[{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"},{"comment_id":"10153851640243984","commenter_b":"Fire that going bitch","commenter_a":"Isaiah 5 : 20 ~ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!","post_message":"This young Texan is standing up for her religious beliefs BIG time after her teacher tried to force students to deny that God is real, and threatened them with failing grades if they did not. Do you support this young girl for taking this stand?"},{"comment_id":"475322915991622","commenter_b":"Tell them to go home","commenter_a":"If they do not like it then go back where you came from","post_message":"Muslims on welfare have finally gone too far. Enough is enough. We need to let these Muslims know that they can't come into our country and force their beliefs on us. Do you support Muslim deportation?"},{"comment_id":"10154881965660575","commenter_b":"Want to be loved I guess","commenter_a":"Is it just me: or is she looking at you like a Stepford Wife ?","post_message":"Barbara Bush: “We believe that every person has the right to live a healthy, dignified life.”..."},{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"}]
