[{"comment_id":"1202403033149557","commenter_b":"Greg is right and you Libtards are in denial.","commenter_a":"To understand what Hillary and her leadership will do to America. all you have to do is look at our Democrat run cities. Poverty, Crime, Drugs and Hatred. Syrian Refugees and Open Boarders will only add fuel to the fire! Democrats do not want prosperity for everyone, they want to keep the poor dependent so they can perpetuate their cause of corruption and lies. It is a fact. An obvious fact. Only selfish, bleeding heart liberals could be so ignorant as to the facts and the reality of the situation. It is a joke. @webpagelink","post_message":"The women of the U.S. Senate are fighting to make their firsts the first of many."},{"comment_id":"10154198707121636","commenter_b":"You British slaves deserve this Royal domination and humiliation!! The King plus Queen rules slaves are always slaves!!","commenter_a":"The point is that the royal family could easily afford to pay for the renovations themselves. We have no money for the NHS, but plenty for this? How is that in any way fair?","post_message":"Money well spent?"},{"comment_id":"1819104865025971","commenter_b":"You're an angel!!","commenter_a":"I literally did this the other day with a dog waking up after a dental. I wrapped her up, rocked her and kissed her and kept saying she would be ok, she was a good girl. It's hard to see them wake up scared and alone so as an assistant, we have to watch them while they're waking up, so why not keep them safe feeling and warm in your arms?","post_message":"Baby Meesha was coming out of surgery and was crying and scared. The vet wrapped her up in his arms and comforted her, singing to her and giving her kisses. A volunteer at the BARCS Animal Shelter walking by caught this tender moment. Turn up the volume for this one. STORY: FOX13news.com/news/@username-story"},{"comment_id":"1499858063367275","commenter_b":"Fleas carry disease such as plague. They're not safer than the flea meds!","commenter_a":"This is why I don't use any flea medication on my dogs, it's more dangerous for them than the fleas and my dogs have NEVER had fleas","post_message":"It's a dog chew so powerful that one dose can kill fleas and ticks for three months. Tonight on KIRO 7 News at 5 p.m., hear from people who say the flea medicine is responsible for the death or sickness of their dogs."},{"comment_id":"935669179891807","commenter_b":"Go Home. U. Brain dead Muslim parasite Abraham sand blasters","commenter_a":"Go back to the Middle East where it's a Holy War USA doesn't want that crap here","post_message":"This Texas mayor wasn't about to let fundamentalist Muslims set up a Shariah court in her town, so a bunch of angry Muslims demanded she surrender. What she hit them with next was NOT what they were hoping for..."},{"comment_id":"1157956670923761","commenter_b":"No can't be true!!! Germans wouldn't let that happen!!","commenter_a":"God help us ALL","post_message":"Goodbye Germany!"},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""}]
