[{"comment_id":"10153150963247483","commenter_b":"I am totally convinced that libs are the only people that post comments on AL.com. Must be a lib ran organization. Oh I forgot, its part of the media!","commenter_a":"Assholes","post_message":"\"In my judgement, with respect to Hillary Clinton, she will be a unique president if she is elected by the public next November, because the day she's sworn in is the day that she's subject to impeachment because she has committed high crimes and misdemeanors,\" Congressman Mo Brooks"},{"comment_id":"10154979630864218","commenter_b":"@username That damn Clinton how dare she think she is above the same laws we have to abide by....","commenter_a":"Face it the Democrats failed policies and over regulation aka job killers have finally awoken the American Voters in rural America their the ones truly hurting","post_message":"Maryland remains a deep blue state politically, but President-elect Donald Trump was able to flip white working-class votes in parts of Maryland, including eastern Baltimore County."},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"},{"comment_id":"1097322517004941","commenter_b":"#LockHerUp","commenter_a":"Hillary Clinton is a Criminal, who should be in prison, not running for office!","post_message":"\"I think my whole life has been about handling pressure. I think I have a great temperament for winning, 'cause I know how to win.\" Donald J. Trump argued that in comparison, Hillary Clinton is \"a loser\" who \"doesn't know how to win.\""},{"comment_id":"582484121909678","commenter_b":"Man she need to stop with her owe puppy monkey baby looking ass","commenter_a":"Donte Grant","post_message":"She's not ready for a tattoo"},{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"10152532301590927","commenter_b":"In Mexico, illegal aliens trying to take up residence, jobs and asking for free healthcare are arrested, put on a bus and taken to the border to be dropped off without a second thought. If you're here in the United States illegally, you deserve to be arrested and shipped back to the border of the Country you originate from.","commenter_a":"Liberal bs.","post_message":"And the immigration debate gets personal again!"}]
