[{"comment_id":"10153810770121336","commenter_b":"A woman who associates with a child abuser (most especially her own child's abuser) should not be allowed on television ! Creepy woman !","commenter_a":"Nope - why? She broke?","post_message":"Will you watch?"},{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"},{"comment_id":"10156120260300354","commenter_b":"Fry his sorry butt !","commenter_a":"Firing squad","post_message":"The appropriate punishment for Bowe Bergdahl is ________________."},{"comment_id":"10153459295185927","commenter_b":"A radical MUSLIM!!!! Keep searching granny at the airport.","commenter_a":"We do NOT NEED gun regulation. We need ARAB regulation!!!! And we need HEARTS rehabilitated more than ANYTHING!!! We need GOD put back into our country!!! And along with God put back into every American's heart, we need a GUN put into every American's HAND!!!!!!!!!!!","post_message":"UN Human Rights Chief Zeid Ra al Hussein: the United States, however, there are hundreds of millions of guns in circulation"},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."},{"comment_id":"10156091694535725","commenter_b":"when was i a women? rockstar","commenter_a":"Mr @username has taken to personal invective again, this time mocking the appearance of the only woman in the Republican field, Carly Fiorina. This from a man who wears a tribble on his head","post_message":"I will be speaking at the #StopIranDeal rally shortly- watch live here-"},{"comment_id":"10153111433392483","commenter_b":"Awwww lets cater to the criminals AGAIN shoot the bastard and be done i cant stand a fucking pedophile sick sick sick","commenter_a":"Their gonna let this perve go","post_message":"A gag order was issued today in the case of an Alabama pastor accused of sexually torturing, abusing and raping multiple children and teens."}]
