[{"comment_id":"544761025684245","commenter_b":"Liars don't smile a lot.","commenter_a":"What Killiary considers a welcome endorsement would be considered a sin and disgrace to any decent human being. Furthermore , what satan's secretary calls the \"extreme\" position of Republican candidates on women's health is really a quite normal position for any one who wants to protect a babies life and quite possibly the life of the mother as well. Of course that position endangers the finances of planned parenthood so naturally Ms. Richards , who would lose her lucrative job if abortion is outlawed, wants to help elect someone who favors her cause. May God have mercy on Clinton, Richards and all like them who promote the culture of death.(MA)","post_message":"The endorsement marks the first time Planned Parenthood has waded into a presidential primary."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"},{"comment_id":"539553339568579","commenter_b":"Yes. Send them home. They CANT Obey Our laws","commenter_a":"To Syria, no return ever!!","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"10157068560150354","commenter_b":"When you ignorant fucking blacks start acting like black lives matter, maybe then I'll start to believe that black lives matter. Until that happens, and I doubt it ever will, keep killing each other and SHUT THE FUCK UP. Your BLM movement is a FUCKING JOKE;nothing more than LOW LIFE, FUCKING ANIMALS.","commenter_a":"I HOPE THIS IS AN ISOLATED INCIDENT. FOR THOSE WHO STOOD BY AND WATCHED, MAY THE SAME HAPPEN TO YOU.","post_message":"A shocking Chicago video reveals the horrifying death of 32-year-old Marques Gaines..."},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"948931958516352","commenter_b":"Somebody exterminate these animals !!!","commenter_a":"Just run their fat black asses over because black lives do not matter - at least not to black people so why should I give a flyin' fuk about 'em.","post_message":"Merry Christmas from Hillary, Barack, and Black Lives Matter!"}]
