[{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"592725884246871","commenter_b":"She looks like the devil","commenter_a":"She is definitely easier on the eyes than the current one or the wicked witch running for pres","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"10154067022696336","commenter_b":"All you have to do is watch him lady.","commenter_a":"Well, I don't know if Donald Trump is a Christian or not and neither does that pope. Only Donald Trump and God knows that. And I heard a man on TV this morning calling the pope \"the Holy Father\" and my bible says to call NO MAN Father, but your Father in Heaven and I DO KNOW THAT IS GOD.","post_message":"Donald J. Trump responded to Pope Francis suggesting that Trump is \"not Christian.\" @webpagelink"},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."},{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"},{"comment_id":"10153330773746336","commenter_b":"Killing America ....... Job by job......","commenter_a":"Good it should not be right to work, should be the best man for the job.","post_message":"“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\" – Greg Mourad, National Right to Work Committee"}]
