[{"comment_id":"10155216559835603","commenter_b":"I believe if you follow the rules it shouldn't matter if they have quotas.","commenter_a":"I never worked where there was a \"quota\". I could write as many as I felt necessary.","post_message":"Do you believe some police departments have ticket quotas? One police officer tells us tonight they absolutely do and he has the paperwork to prove it! News 4 Investigates this shady system: @webpagelink"},{"comment_id":"1279039008785553","commenter_b":"Video by a feminist probably...","commenter_a":"Wait a second. You're mad because 20 people, out of 320 people, dropped out of the study.... so 6%.... and because 6% couldn't handle it..... you reach the conclusion that obiously men can't handle birth control.... isn't that a sexist statement against men? Not to mention I'm sure more than 6% of women don't take birth control because of side effects. Let's just think before we generalize a group.","post_message":"Male birth control is here, but men won't take it because they can't handle the same side-effect of female birth control that women have been dealing with since the 1960s."},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"},{"comment_id":"864879717035938","commenter_b":"Voter fraud will get her elected anyway","commenter_a":"I would like to ask, How many Hilrack supporters have been in the military or had someone they love in the military and how many believe in God. The drive behind the Hilrack campaign is to REMOVE GOD from this country and then she will remove the military. READ \"The battling boys of Bengazhi\" Thats their agenda!!! The aid she gave to them will be repeated with any and all protecters of America. Why do you think all the Clinton money is in Canada???","post_message":"She's done. Please help us spread this. America needs to see it. Do you think Hillary is not fit to be president?"},{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"10154651718054203","commenter_b":"@username So afraid of smart, strong women that it's pathetic. #madampresident Get used to it, prick.","commenter_a":"They're desparate at this point. Killary's ship is sinking fast, and when Trump smokes her on Monday it will seal the deal.","post_message":"Take a deep breath."}]
