[{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"1142341912527542","commenter_b":"well so are you","commenter_a":"You haven't made a good movie since Good Fellows, sit down and shut up before you piss yourself.","post_message":"Robert De Niro has launched an excoriating attack on Donald Trump. The actor doesn't pull any punches in his criticism calling him a 'fool', a 'bozo' and 'an embarrassment to the nation'. And that's probably the nicest stuff..."},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"1502446079775417","commenter_b":"Hillary is doing so badly she has to stir up whatever she can. Notice at all of her rally's or speeches instead of substance,all she does is pick on Trump. Guess that and lying are her specialities, along with hating half the country.","commenter_a":"Go Trump Say NO to Hillary And YES to Trump Save America from WW3 so go out and vote for Mr Trump When I as a Muslim wants him to be come a president so what is wrong with you Go out and make history vote for trump Thanks Don't listen to the media they are one sided","post_message":"It's possible that Donald J. Trump will try to backtrack today. But here's why he can't."},{"comment_id":"994387677320953","commenter_b":"That witch is who is teaching our children","commenter_a":"This man is on point👍🏾","post_message":"Woah, THAT escalated quickly! What's YOUR opinion?"},{"comment_id":"971095776261096","commenter_b":"#CottonCancer","commenter_a":"NO! I don`t even like Corn when it is too sweet,so i know i would not like fruit that is...and it cannot be good for us.","post_message":"Yes, \"cotton candy\" grapes are a thing."},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"}]
