[{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."},{"comment_id":"1076303882387835","commenter_b":"Stoooopid bitch! ! ! ! ! ! !","commenter_a":"Folks, QUIT talking about her, just let her fade away to hell.","post_message":""},{"comment_id":"10153024704310927","commenter_b":"Bill; do you understand that the 08 housing crash was the result of the 01 dot-con crash and that crash was preceded by the savings & loan crash and crash backwards it goes back to drilling nuclear holes in the ground & Vietnam and then disasters back to 1913 non-federal reserve bank. That to sustain the illusion the fiat currency denominator had to be divided by greater volume than gold, then oil and now QE zero interest ether ?? Destroying the ME extends the time line that said nations can once again convert away from the bankrupt US dollar ??","commenter_a":"Just more political theatre. It has already been shown that the IRS did not target conservative groups. The were doing their jobs and broke no laws.","post_message":"Rep. Jason Chaffetz UNLOADS on IRS Commissioner John Koskinen while introducing resolution of impeachment: violated the public trust ... Impeachment is the appropriate tool to restore public confidence in the IRS ... .\""},{"comment_id":"934398819989704","commenter_b":"Apparently, the right-wing cannot get enough of their failed foreign policies. Now, all they need is another Bush in the White House.","commenter_a":"Derp","post_message":"He's baaaaack..."},{"comment_id":"10153379588172377","commenter_b":"TRUMP vs HILLARY?? Trump Illegals out, creates jobs - Hillary Illegals left here, job losses? Trump build a wall, welcome new legal citizens and make them pay taxes. Hillary let em stay and use all our stuff for free. No wall ?? Trump going to bring companies back to America - Hillary could care less ? Trump supports all woman's programs, equal pay and job growth. Hillary supports only women's programs that give to her foundation and supports habitual adultery from her husband?? Trump support our allies in the Middle East & make new deals - Hillary does not support our allies and no new deals? Trump get rid of Obama care and have open insurance plans that people are allowed to pick from - Hillary supports Obama care and it will literally bankrupt itself in 3 more years ? Trump protecting other countries with our military & now earning ...","commenter_a":"why would Obama do that? His hero is Bil Ayers, terrorist bomber.","post_message":"President Obama should have insisted on Cuba returning a group of fugitives accused of killing police officers."},{"comment_id":"10153966184001037","commenter_b":"She is crazy & evil!","commenter_a":"Obama started the war in Iraq?","post_message":"Sarah Palin opens up about her son's arrest: “My son, like so many others, they came back a bit different.”"},{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""}]
