[{"comment_id":"553460564841833","commenter_b":"Isn't Covergirl a brand? Wouldn't saying \"He can't do that\" because of the brand name be like saying girls can't play Gameboy because it has 'boy' in the name? Also, people are making a fuss about a guy appearing as the face of a woman's product, but I didn't see anyone making a fuss about almost naked women appearing on publicity for men's magazines, car's oil, burgers, beer, etc.","commenter_a":"He looks like a girl what are they thinking!!!!!!","post_message":"Oh....my."},{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"},{"comment_id":"1051849191502758","commenter_b":"Dirty lady lol","commenter_a":"I WANT PICTURES !!","post_message":"How do you measure up?"},{"comment_id":"920858977949524","commenter_b":"Hillary is a whore!","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"692830987553004","commenter_b":"Fr we were running thangzz up in that bitch","commenter_a":"@username i don't miss Carrows but I miss working with you. 😿😻","post_message":"Too lit! #WSHH"},{"comment_id":"10153312996021167","commenter_b":"He has also said that Muslims need to be deported, whether the are American citizens or not. 😖","commenter_a":"Brokaw makes a false comparison. In the 1940's, many Japanese were US citizens, and living here already. Their internment was a knee-jerk reaction to a very real fear that the Empire would try to invade our country with help from loyalists living here. Today, there is no nation threatening invasion, but rather a rogue terror group looking to radicalize ideological adherents within our borders, and inspire them to randomly murder us. Trump has suggested that we not allow any more people from Middle Eastern areas known as incubators for terrorists UNTIL we have much better means of sorting out the radicals from the legitimate refugees.","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"}]
