[{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."},{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1247857341977182","commenter_b":"The radical Christians in this country would throw gays off of rooftops too if they wouldn't go to jail for it. If you think that's wrong read the comments on any article about them.","commenter_a":"Now all the Christians will throw the pope under the bus for stating the obvious","post_message":"\"It's like a mixed fruit salad. There is a bit of everything. There are violent people in all religions,\" Pope Francis said."},{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."}]
