[{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"10153025802828205","commenter_b":"Cindy @username please those immigrants pay taxes and guess what they can't file them every year. So the United states keep them. And I bet you would do anything if your kids didn't have an education. Or food on their table. Yes those that killed . Do bad things should be deported. Those parents that work . Some people like me have small business. So shut up if you never been on a situation where you don't a choice.","commenter_a":"If the above bill goes trough then where does ending DACA and deportation come in? They are giving them an opportunity for citizenship which if they do that then they should deport their illegal parents especially if the kids have completed school and working. No compromise here or you Republicans will never win the White House and I will only vote to get all Rhinos out of their cushioned thrones.","post_message":"On #TBT, remembering when my Republican colleagues believed in protecting immigrant children, just one year ago. Yesterday, they voted to end #DACA and deport #DREAMers. What a difference a year makes."},{"comment_id":"10153275884859877","commenter_b":"Pigs don't eat pizza.","commenter_a":"It sounds pretty delicious but obviously racist.","post_message":"NY pizzeria apologizes for promoting racist ‘Pic-a-Nika’ pizza - but some of those ingredients are suspect. Grio fam, what do you think of the owner's response to the backlash? Do we believe his explanation for the \"mistake\"?"},{"comment_id":"10154400564286509","commenter_b":"Delusional much?","commenter_a":"10 dead so far in republicans terrorist attack on Flint. Where is the justice. The serial killer Governor needs to be put away...","post_message":"\"Our mouths were ajar\": Meet Dr. Mona Hanna-Attisha, the pediatrician who exposed lead poisoning in Flint, Michigan."},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"},{"comment_id":"871509956275393","commenter_b":"Fuck u.bitch dani","commenter_a":"Whoopl.is.a.racist bitch","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10153093570621955","commenter_b":"Lying old hag","commenter_a":"The queen of the American Communist Party, oops, I mean liberals...","post_message":"WSJ: HILLARY TO ANNOUNCE NEXT MONTH..."}]
