[{"comment_id":"10158101758695291","commenter_b":"And you know this how?","commenter_a":"Amazed at the crowd who, like all Americans, except native Americans, are from somewhere else. Jesus would not only be proud of these marchers, he would march with them.","post_message":"Birmingham-Shuttlesworth International Airport immigration and refugee march"},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10154308942676336","commenter_b":"Build the wall screw the Mexicans","commenter_a":"no need to .. i mean their ignorant puppet master says it all the time :P","post_message":"The student said he wanted to do something \"provocative\" to protest restrictions on freedom of speech and didn't realize until later that the phrase held such a strong, threatening connotation."},{"comment_id":"10153379588172377","commenter_b":"TRUMP vs HILLARY?? Trump Illegals out, creates jobs - Hillary Illegals left here, job losses? Trump build a wall, welcome new legal citizens and make them pay taxes. Hillary let em stay and use all our stuff for free. No wall ?? Trump going to bring companies back to America - Hillary could care less ? Trump supports all woman's programs, equal pay and job growth. Hillary supports only women's programs that give to her foundation and supports habitual adultery from her husband?? Trump support our allies in the Middle East & make new deals - Hillary does not support our allies and no new deals? Trump get rid of Obama care and have open insurance plans that people are allowed to pick from - Hillary supports Obama care and it will literally bankrupt itself in 3 more years ? Trump protecting other countries with our military & now earning ...","commenter_a":"why would Obama do that? His hero is Bil Ayers, terrorist bomber.","post_message":"President Obama should have insisted on Cuba returning a group of fugitives accused of killing police officers."},{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"}]
