[{"comment_id":"10154388991666162","commenter_b":"Stfu!","commenter_a":"Happy birthday you druggie idol you","post_message":"Prince was born on this day in 1958. He would have turned 58 today... @webpagelink"},{"comment_id":"10154194396888010","commenter_b":"Says a woman who has a child... but who only wants people who look like her and have money like her to have opportunities, though. #privilege","commenter_a":"This can't be serious? They want to provide State-finder childcare, too? And, preschool? Every study I read says the current system of young elementary school is failing kids (too much time in seats, not enough art and play, etc.) and the solution is to start them even earlier? Free childcare, free preschool, free K-12, and Bernie wants free college. Where does it end?","post_message":"The goal: free preschool and affordable daycare for all."},{"comment_id":"10153692809021694","commenter_b":"\"there are people who care enough to find you\" Riverrrrrr??? D:","commenter_a":"@username :0","post_message":"We have so many questions, but we won't have to wait long for answers!"},{"comment_id":"10154405981987300","commenter_b":"But they're still ten times better than ungrateful immigrants from African hell holes!","commenter_a":"They have everything covered. Police union, the system, their own partners that lie to protect themselves, the idiot that post all over the internet \"back the blue\", they get a free meal because if they don't, they'll make a tantrum and call the police and the news, etc, etc, etc. A simple war veteran (which, to me, has more respect that this parasites of society), don't get much back up when they get in trouble. Of course I'm talking about the bad cops. Because their is bad cops, right?","post_message":"“It’s too emotional to see your baby caught up in something like this.”"},{"comment_id":"10154312259097654","commenter_b":"yes yes","commenter_a":"absolutely!","post_message":"Kellyanne Conway says the media is flat-out refusing to cover the Trump administration fairly. Is she right?"},{"comment_id":"572993952849381","commenter_b":"She needs a stiff dicken","commenter_a":"Such class....................................................NOT!","post_message":"This woman just needs to STFU."},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"}]
