[{"comment_id":"10153562142188717","commenter_b":"Yes! Please leave!","commenter_a":"good for her .. Tah Tah","post_message":"Raven-Symone, co-host of \"The View,\" swore on the talk show that she will move to Canada \"if any Republican gets nominated\" for president."},{"comment_id":"1239601439418363","commenter_b":"kill yourself then you basic bitch","commenter_a":"yo this shit is funny as fuck and if you disagree you're definitely not lit kill yourselves if you didn't laugh when the girl dialed 911 on the microwave and the first few notes of the x-files theme song plays as you hear the operator lmaoo im deaaaaaad if you didn't like this vid fuck u, ur bitch, ur fam, and the clique u claim","post_message":""},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."},{"comment_id":"509394902575723","commenter_b":"Women especially can be proud!","commenter_a":"What do y'all think so far?","post_message":"Republican Rep. from Alabama seems surprised that not every single State Department was 100 percent loyal to Secretary Clinton all the time."},{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"10154616109355575","commenter_b":"THEY DON'T NEED A TAX BREAK. JUST TAX THEM COMING IN.","commenter_a":"Do it Donald, show all these NaySayers it can be done, save our Jobs, put America back to work.","post_message":"Trump doing more before he's President than Obama did in 8 years!"}]
