[{"comment_id":"895447730553834","commenter_b":"You can both GFYS , typical ignorant trash","commenter_a":"Fuck the Oneida nation","post_message":"Mayor Patrick O'Connor said the long-time village seal shows a historic wrestling match between village founder Hugh White and an Oneida Indian that figured into good relations between early settlers and the Oneidas."},{"comment_id":"10154177550736509","commenter_b":"She was legal to have sex in those two states! End of story!","commenter_a":"Did he KNOW she was a minor? That should make all the difference.","post_message":"The 17-year-old girl's cell phone had evidence of \"inappropriate communications over the last several weeks between (25-year-old Steven) Sheerer and the minor,\" the prosecutor said."},{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"1770834126470122","commenter_b":"She can't fit those shoes","commenter_a":"Of course she's going to copy from one of the smartest, classiest 1st ladies we've ever had!","post_message":"Portions of Melania Trump's speech on Night 1 of the Republican National Convention bear striking similarities to Michelle Obama's speech at the 2008 Democratic National Convention."},{"comment_id":"10153842177281636","commenter_b":"In other news, unelectable man set to win another election.","commenter_a":"hahahahaha where are the haters now? suckers!","post_message":"BREAKING"},{"comment_id":"484808285062410","commenter_b":"Illegals are actually working for money other than the \"Americans\" begging for money on a corner","commenter_a":"I bet he had a taster for it too. Give away our jobs, let illegals in, give them government money, they never earned, and let the American people suffer. What a great President.","post_message":"President Barack Obama drinks filtered water in Flint, Michigan during a briefing on the ongoing water crisis."},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."}]
