[{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"1272561409477278","commenter_b":"Bitch stop lien ^","commenter_a":"Why not tell the full story instead of half?","post_message":"Over her son littering though? #WSHH #Texas #Cop"},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"10155094693558628","commenter_b":"Yes! Illegal is illegal. He is enforcing laws that have been ignored far too long! If they want to be here then do it the right way and not look to us to support them!!!","commenter_a":"No","post_message":"Like Opposing Views for more!"}]
