[{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"10150597550159999","commenter_b":"If you want to, go ahead sugar tits","commenter_a":"Never question again why men don't take women seriously","post_message":"She dated him for his dog. Then another dog came around. Read on in The New York Times Opinion."},{"comment_id":"1045180198948491","commenter_b":"Yeah @username all seemingly Noble reasons however... Trump is a sleazebag so regardless of whatever Noble reasons you may have... The end result is still the same. Let me explain to you about how Germany does things. They have what's called social democracy. Everybody gets Healthcare everybody gets an education not just the wealthy. Donnie's cabinet controls more wealth then 95% of the country and you honestly believe he is going to do what's best for America. You're a bigger fool than I could have imagined","commenter_a":"You people are more ridiculous than I ever imagine... What are you think she's going to do privatize public education... The woman barely has a clue as to how the education system works in the first place she has no real understanding of Education in general and yet she's going to revolutionize education in America... Sure she is... Another far-right right hair-brained scheme to put dollars in somebody's pocket","post_message":"Ignore the noise!"},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"10152889213814071","commenter_b":"I'm gon die Miranda Hill Allie Lorimor","commenter_a":"Anfal Alkhalaf","post_message":"Listen to your dentist."},{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."}]
