[{"comment_id":"10153278742792144","commenter_b":"Foolish woman do you really think you can reason with a wild animal? Enough already.","commenter_a":"Very irritating.....good for the bear. There was no reason to pepper spray when she could have gone inside.","post_message":"HAHA."},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."},{"comment_id":"10154001304876509","commenter_b":"She should be fired and arrested. No one else can break the law and get away with it.","commenter_a":"That is insubordination! She is not following the rules and duties depicted in her job description! Justified cause forr job termination! Her Supervision should file charges and she should be processed according to HR procedures which could lead to job termination.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"10153198316596336","commenter_b":"Wilma Loo...Who LOVES you Girlfriend ? ;-)","commenter_a":"Translation:We hid the money in offshore accounts in tax evading countries,wiped our servers clean,burned all copies and rewrote history.Nothing to see here,move along,move along.","post_message":"“We made mistakes.” The Clinton Foundation has issued a statement after improperly reporting some of its donations. @webpagelink"},{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."},{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"}]
