[{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"1077005215689340","commenter_b":"Hillary is an establishment hoe","commenter_a":"She is the most qualified candidate in this race. I strongly believe, Life will be better with @username. <3 #imwithher #weareforher #Hillary2016 #feelthehill #yeshill","post_message":"Anyone asking for your vote has to grapple with the reality of inequality in America—and offer real plans to fix it."},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."},{"comment_id":"10154859585584726","commenter_b":"Unfortunately in the eyes of progressives the answer is no. Meanwhile a slutty whore like Madonna can sell anything and everything she wants.","commenter_a":"Boy what hypocrites we have in show business. The left is losing it and it is getting really old!","post_message":"Can't a guy sell what he wants to sell?"},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"1874033892840716","commenter_b":"REALLY,Jim !#!#!!!","commenter_a":"We are concerned about you Al and the other nuts who wouldn't recognize the great things Trump will n is doing for the USA. Pray God continue blessing Trump doing good work for us.","post_message":"\"We all have this suspicion that — he lies a lot. He says thing that aren't true.\""}]
