[{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."},{"comment_id":"10156857801965093","commenter_b":"Who will women vote for if Trump and Clinton are both running in the Fall?","commenter_a":"Maybe America have more young vaginas thann old vaginas!","post_message":"It's hard to believe America's first female Presidential front-runner is doing THIS badly among women."},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"},{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"1183411145055216","commenter_b":"Wake up Hillary will destroy trump","commenter_a":"Trump is walking all over Hillary. Polls showing her ahead i do not believe.","post_message":"Dorothy Woods, whose husband Ty Woods was one of the four Americans killed in the 2012 Benghazi terror attack, says that Hillary Clinton's track record proves that the Democratic nominee believes rules don't apply to her. @webpagelink"},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
