[{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"949176475215531","commenter_b":"The some bitch had a beautiful bitch at home dammit quit taking up for this clown","commenter_a":"But he only talked about fuckin another chick. Shit people left and right young and old talk about wanting to bang women. I do it all the time? Bill followed through, no confirmation of trump cheating and/or raping/fucking another women. Hop off the high cloud, and take a step into reality.","post_message":"This is just horrible..."},{"comment_id":"10153007861084753","commenter_b":"Get a job!!!!!!!!!!!!!!!!!!!!!!!lazy bitch","commenter_a":"that is so wrong on so many levels","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"876438732485400","commenter_b":"10$ a seat","commenter_a":"thanks yeah its a burgh thing thank you pens congs","post_message":"1-0 Pittsburgh Penguins are up at the end of the first period. Here is a LIVE look inside Consol where thousands of Pens fan have gathered to watch Game 6 together. #LetsGoPens #WeWantTheCup"},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."},{"comment_id":"10152911365806336","commenter_b":"That's NOT truth.....","commenter_a":"Open carry does not apply to black men.. No one wants to admit it, but it's the truth..","post_message":"A Florida man thought he was acting heroically for tackling a man with a gun at Walmart. Instead, the vigilante ended up in handcuffs."}]
