[{"comment_id":"10153631215978984","commenter_b":"Please take the baby away and never should she get back any of the children. Also, make sure that she cannot have any more kids.","commenter_a":"What a shame...","post_message":"The cops got the call so they went to this pregnant woman's home... but once they got there, they were stunned at what they saw. This was not something they had been trained for... they will never forget this."},{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"},{"comment_id":"10155246322201509","commenter_b":"Hillary will only do what pads her pockets and feathers her own nest...","commenter_a":"Trump Newest Hat Says \"The Low Educated Loves Me\" #TrumpIsAnIdiot!","post_message":"Nope, the newest Donald J. Trump hat isn't a parody."},{"comment_id":"10153731471343967","commenter_b":"But a laser pointer. Entertain your cat AND COOK DELICIOUS BACON.","commenter_a":"@username James Speck @username","post_message":"Brilliant"},{"comment_id":"1110994785663439","commenter_b":"All Hillary does is pander and shift her views to what's convenient for her.","commenter_a":"Democrats should Support Democrats , Bernie isn't a Democrat only in convenience, Playing basketball doesn't and shouldn't mean you support Minorities, where you live is who you are and in Vermont Bernie is 91% White?","post_message":"JUST IN: The Congressional Black Caucus PAC endorses Hillary Clinton for president."},{"comment_id":"1097911176909250","commenter_b":"So... Nazis ok? It's the very nature of Islam that poses the problem isn't it? Do you really want to populate your country with people who follow a religion that is also a supremacist ideology? Is it your argument that it's hate that motivates people to not want to allow mass immigration of people that follow this system of belief? I would say that's a very irresponsible and naive view. Who do you have a greater duty to? If you think it's to the millions of immigrants living in countries with terrible histories of violence, terrorism, misogyny, and rape I have to say that is not kindness at all. Don't you understand that real people in your country are going to die and get raped because people think like you? Where do you draw the line. There are billions that would love to pour into our countries because our values ...","commenter_a":"Go back home and fight for your freedom instead of coming to western countries and committing crimes and raping.","post_message":"This photographer traveled by raft with refugees headed to Europe. The images he captured are a rare glimpse into the greatest refugee crisis since World War II."}]
