[{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10153595971197016","commenter_b":"And women are going to vote for this lady killer","commenter_a":"Sigh. If this big dope gets elected even the people who elected him will be bitterly deceived and betrayed and it won't take long.","post_message":"Republican presidential nominee Donald Trump on Sunday morning described the numerous female employees at Fox News who accused Roger Ailes of sexual harassment in the workplace as \"complaining\" and explained how that makes him \"sad\" because really the company's top executive actually \"helped\" \"some of those women\" and he's a \"very good person\" and a close personal friend. WTF."},{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10153213531701336","commenter_b":"I will bet she cannot fix anything, maybe breakfast if she knew how to turn the stove on.","commenter_a":"Sounds like she's twisted","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"900278129995043","commenter_b":"No","commenter_a":"They're great to look at and their love is cute and all but not sure if their personalities would work for a talk show. Maybe a dating game show would work better.","post_message":"Would You Watch? Boris Kodjoe And Nicole Ari Parker Get Their Own Talk Show On Fox"},{"comment_id":"867742276749682","commenter_b":"You are a liar and a piece of shit!","commenter_a":"Yes","post_message":"Obama just gave Trump hell for complaining about the voter fraud but look what just happened. This goes to show you the sickening corruption that's happening in our country. Do you think the election is rigged?"}]
