[{"comment_id":"1077881772268351","commenter_b":"She's lying her lips are moving...","commenter_a":"Get $60 worth of free medical marijuana at eazeup.com with promo code: icfnwx","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."},{"comment_id":"10153311362744135","commenter_b":"Thank you \"Pieter\" for finally posting something informative. This may be the first time. As far as your buddy \"Kathleen\" goes, it matters because many of her negative comments apply to politicians in general, so it would be quite naive and hypocritical of her to constantly criticize Christie, let's say for lying, while supporting a candidate who also lies.","commenter_a":"Please discuss why you don't threaten to enforce federal guns laws in states, but only marijuana. This would show you as a complete hypocrite and fraud. Please explain why you have expanded the failed war on drugs, your words, in Jersey.","post_message":""},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."}]
