[{"comment_id":"10153007861084753","commenter_b":"Get a job!!!!!!!!!!!!!!!!!!!!!!!lazy bitch","commenter_a":"that is so wrong on so many levels","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10154686052869586","commenter_b":"Get this bear out of there now","commenter_a":"Holding animals in captivity is inhumane. Do not support zoos.","post_message":"Thousands of people visit daily to take selfies & knock on the glass :("},{"comment_id":"1195858527119048","commenter_b":"That is what we call \"seasons\" in Texas. LOL","commenter_a":"No it is not. Just look around us fire in one state floods in others and earthquakes in others lakes dying up and animals dying from bad water and no food.","post_message":"This is important."},{"comment_id":"10153924277776130","commenter_b":"These girls are still relevant? Lol","commenter_a":"Can't get crack online","post_message":"Um ... what!?"},{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"1171557939550328","commenter_b":"OBAMA IS A TRAITOR. HE SHOULD LEAVE THE WHITE HOUSE ASAP.","commenter_a":"Obama just sunk lower than even I thought he could sink..as he was trying to be a comedian - he deliberately chastised Donald J. Trump over and over...he should be so embarrassed but he's an idiot so I guess we are still to assume he's above and better than the rest of us. By the way Obama - no one was laughing other than \"AT\" you for being so ignorant. That got you no leverage with anyone in that room if those people attending were normal human beings - only your planted people gave you any recognition and even they must have been devastated by your horribly degrading remarks all made in the name of humor - just as Will Farrell finds Alzheimers disease comedy - this was right up there with it...SHAME ON YOU FOR BEING SUCH AN ASS HOLE!!!","post_message":"PHOTOS and VIDEO of TRUMP RALLY IN CALIFORNIA... Arrests, Cars Smashed, Mexican Flags, Riot Cops.... Can't wait for the deportations to begin. See photos and video from event: @webpagelink"}]
