[{"comment_id":"10154188598828405","commenter_b":"he is fighting to get your gun","commenter_a":"Thank you Rep. Lewis!! From a mother, military spouse and small business owner - I'm happy to see democrats fighting to keep us safe! #goodtrouble","post_message":"On July 5th, we're going to continue to push, to pull, to stand up, and if necessary, to sit down. Don't give up. Don't give in. Keep the faith, and keep your eyes on the prize. #goodtrouble"},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153093570621955","commenter_b":"Lying old hag","commenter_a":"The queen of the American Communist Party, oops, I mean liberals...","post_message":"WSJ: HILLARY TO ANNOUNCE NEXT MONTH..."},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"1768080320145861","commenter_b":"She is a criminal to her core","commenter_a":"TRUMP will protect LBGT people from the moSLIMEs. Hitlery will always side with iSLIME because that is who keeps her rich. VOTE for TRUMP!","post_message":"On June 18, 1983, Sally Ride became the first American woman and first LGBT astronaut to go to space."},{"comment_id":"1009175035805692","commenter_b":"Thanks god being a feminist is hip again!","commenter_a":"Sweet","post_message":"A 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody?"}]
