[{"comment_id":"10153996062974203","commenter_b":"Take them all out by any means necessary, they are enemies of this country.","commenter_a":"In other reports, Ammon has told those left at the refuge to give up and go home. Why should they just get to go home, as if nothing happened and they hadn't done anything wrong. Every last one of them should be charged with crimes of all sorts.","post_message":"They're not going anywhere."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"10154937079431729","commenter_b":"Those are some ugly women.","commenter_a":"Indeed, Colonel.....I was also having thoughts along the same lines like why aren't women engaged in sports with men like football, baseball, rugby, la crosse, hockey and, on and on.","post_message":"Folks, I need you to weigh in on this as well."},{"comment_id":"10153228723406336","commenter_b":"Please these Repigs are tooo much..HILLARY CLINTON WILL BE PRESIDENT Regardless of all the BS Faux NONEWS says and EXAGGERATIONS from Hannipig","commenter_a":"Listen for the \"vast right-wing conspiracy\" defense.","post_message":"Hillary Clinton has agreed to testify on Capitol Hill later this month about two controversial issues when she was secretary of state – the fatal terror attacks in Benghazi and using a private server and emails for official business."},{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."},{"comment_id":"10154303024133132","commenter_b":"Shut up, Maggie.","commenter_a":"It's not nice to be wearing such nice clothes to cuba when those people have nothing! They looked scaredto be their in my opinion.","post_message":"Sasha and Malia Obama delivering a healthy dose of style inspiration while in Cuba! (via PeopleStyle)"},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""}]
