[{"comment_id":"671493889666053","commenter_b":"doesn't she have a criminal record??","commenter_a":"What a moron. She's been convicted of shoplifting, and has been on welfare. Everything that comes out of her mouth is a real stretch of the truth, to put it kindly. Another one who wouldn't know the truth if it bit her on the ass.","post_message":"Oy this woman makes my eye twitch. ~tiff"},{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"940671535979474","commenter_b":"Traci, if you feel that way then please block me.","commenter_a":"The trolls are up and ready. I see no great news for women. No woman should have the right to kill, like no man should have the right to force himself on her. Two wrongs don't make a right.","post_message":"Life begins at conception and it's time the law reflected this obvious truth! Have you signed YOUR petition yet? Click HERE to urge Congress to pass the Life at Conception Act! @webpagelink"},{"comment_id":"10150971534884999","commenter_b":"The thrust for stories to prove a Trump presidency will embolden bigots is so great right now, people are faking hate crimes.","commenter_a":"\"RISE IN HATE CRIMES\" -If 'Murican media is anything like Toronto's , they are rigorously hunting down stories that fit the appropriate narrative of the day.","post_message":"Kids are at risk of getting the message that racism and harassment are OK, Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."}]
