[{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"10153292022111051","commenter_b":"Keep the statue,ignore the STUPIDS !!","commenter_a":"Again, if they don't believe why do they spend so much time removing evidence of God.... I really do believe that Atheist DO BELIEVE in God but don't want reminding that God is Holy and we are not. If God does not exist then sin does not exist, and thus they can live the way they want without worry of sinning...Sad! Our children and our country have paid the price of Atheists and their faithless and evil ideals.","post_message":"Should they have to remove the statue?"},{"comment_id":"10153943433408645","commenter_b":"She should go to hell for posting this picture on her profile..","commenter_a":"Maybe because she has a horrible profile picture of someone beheading a cop?!....the same photo the shooter in Dallas had on his Facebook....or maybe not....not condoning either act, just responding to the ridiculous lead in of the article...","post_message":"Lanaydra Williams told FOX 4's Megan Dillard she didn't know where Overland Park was before Thursday night, nor did she know the man who made a threatening Facebook post on a picture of her daughter. The stranger was identified as an Overland Park Police Department officer, and the department apologized to her after firing him on Friday."},{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10153194136535329","commenter_b":"Shut the fuck up bitch.","commenter_a":"OMG nobody is obligated to come to your kids birthday party people always run to FB for sympathy get over it & yourself","post_message":"“I know this might be something silly to rant about, but my heart is breaking for my son. We invited his whole class (16 kids) over for his 6th birthday party today. Not one kid came,” Ashlee posted on a local Facebook group."},{"comment_id":"1020979627937496","commenter_b":"@username you shouldn't talk about yourself and Justin that way, asscrack. Ohhh she's not American so her music sucks? You and people like you are the reason this place sucks so much. God forbid you have to hear something that doesn't cater to you! Try really sacrificing for something worthwhile other than greedy politicians and your bank accounts and egos. Half of this country doesn't believe in the armed forces and government any more for good reason. Sacrifice my asshole, you don't know what sacrifice and hardship are until you've been homeless and still given things up for others. You know why people go into the armed services, most of them? They're too fucking lazy and/ or stupid to figure out something else on their own and sheep need the direction of wolves.","commenter_a":"If you've never heard the language before, don't insult and call it gibberish. You're the reason everyone thinks America is full of morons, thanks!","post_message":"People are getting really worked up over \"Work\" for the WRONG reason."},{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."}]
