[{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"589287567920858","commenter_b":"Wanted to see the dogs lock jaw these pos","commenter_a":"Click bait everywhere goddamn","post_message":"A man was slashed after coming to the defense of a dog. Surveillance video shows the two men punching, kicking and beating dogs on Staten Island."},{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"533672440152326","commenter_b":"You know that just the stupid negroes . The same ones who will kill their own .","commenter_a":"Who ever is sending the haha face this is not the place ... And you are part of the problem please show respect and leave this page","post_message":"The body of slain Dallas police officer Michael Krol is escorted to the church for his final funeral mass here in Michigan. He will be buried in Southfield later today: More: @webpagelink"},{"comment_id":"10153079471709411","commenter_b":"Pakistan is terrorized from within, same as we are from the west.","commenter_a":"I wonder if this drone terrorised the inhabitants of the White House as much as US drones do to civilians in Pakistan?","post_message":""},{"comment_id":"1371377862955264","commenter_b":"@username once a fraud always a fraud","commenter_a":"When will you people STOP this lunacy .. And that is WHAT it is.. He did NOT become a BILLIONAIRE by being stupid.. He WON the election. GET OVER IT SNOWFLAKE","post_message":"We need to stop giving this psychopath any ideas..."},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."}]
