[{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"10154055081001770","commenter_b":"Those girls are too skinny. They need to put some meat on those bones before they could be sizzling","commenter_a":"sizzling...but was she a Hillary voter?","post_message":"Are these sizzling photos too much for the internet to handle?"},{"comment_id":"10154715830017509","commenter_b":"It'll be a sad day for women if that's the best they can offer as their poster child.... In fact I find it a huge insult to all the smart, strong, driven and hard working women in this country. So many women that are so better suited for the job... Such a shame","commenter_a":"Can't wait to break that glass ceiling tomorrow Hillary by making you the first woman President of the United States! #StongerTogether! #ImWithHer!","post_message":"Since Bill and Hillary Clinton left the White House 15 years ago, they have taken in more than $240 million in income and paid $100 million of that back in taxes."},{"comment_id":"10153556909588132","commenter_b":"I know!!!","commenter_a":"Krystal Frederick","post_message":"Another The Bachelor couple bites the dust."},{"comment_id":"912344515551025","commenter_b":"Illegals are taking jobs we Americans can't or won't take...","commenter_a":"Well I like Cruz...a lot. My husband and I both voted for him. He's a true conservative and defender of the constitution....","post_message":"Ted Cruz voiced his strong opposition to President Barack Obama's lax enforcement of our nation's immigration laws, arguing that his policies have led America down a path of economic turmoil. @webpagelink"},{"comment_id":"10153982122994071","commenter_b":"Stfu","commenter_a":"No, no they shouldn't ... this is a classic example of over extending and away from your core business. The ramp up time is too long and the others can fill the gap fast. They need to stick to immediate delivery systems.","post_message":"Amazon.com is coming for the grocery industry."}]
