[{"comment_id":"10152740103222507","commenter_b":"Have female genitals, potential prostitute","commenter_a":"Carry a gun....potential murderer. You won't be laughing when you child or grandchild gets killed","post_message":"Disturbed thinking."},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"},{"comment_id":"1023543291017240","commenter_b":"Nappy fake hair bitches.","commenter_a":"Black women aren't hot ! You can't do a fucking thing to me ! White lives matter !","post_message":"Do you think what this college student said is racist?"},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"1308041469292102","commenter_b":"Yet he never put anyone first ever in his life. You are believing a con man who is very good at conning people like you!","commenter_a":"All of this hate, all of this rage, against one man because he want to make this country great again, says a lot about those who want to stop him, and should be even more of a reason why Americans should vote for him, because he wants to put us first - I think that's a great idea.","post_message":"Show insiders told the AP that Donald J. Trump rated female contestants by the size of their breasts and talked about which ones he'd like to have sex with."},{"comment_id":"10153905060581051","commenter_b":"the house is full of fuckin whores,stop the bullshit,do something for the ppl that sent your sorry asses up there.","commenter_a":"they cannot help themselves... how bout investigatin' some jobs fellas","post_message":"House leaders officially filed a motion today to investigate Hillary Clinton for lying under oath to the FBI. Do you think she's guilty?"},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""}]
