[{"comment_id":"10153761694679705","commenter_b":"well lets say i know more","commenter_a":"did ya know they have votes to local reps to say the same as the usa does not likely","post_message":"Direct mail service was cut in 1963 at the height of Cold War tensions."},{"comment_id":"483365738520673","commenter_b":"Worthless hoe bag","commenter_a":"MYOB WITCH!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1098675453532382","commenter_b":"I don't need to see his return. But I do need to see killarys medical records. She's a wack a doo","commenter_a":"Go Trump 2016","post_message":"WATCH LIVE: Donald J. Trump addresses police shootings, claims America needs a 'national anti-crime agenda.'"},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"10152763555906051","commenter_b":"This is just getting so ridiculous why don't people just mind your own business and live her own life grow up","commenter_a":"i think she is one hell of a shot. i wouldent piss her off. leave her alone. your just jelous because you can't bow hunt as good as her. she is feeding someone. you have nothing to be scared of with an eye like yours. u go girl.","post_message":"This woman has been getting death threats over her photos. Decide for yourselves if the criticism is warranted."},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"}]
