[{"comment_id":"10154128932095579","commenter_b":"Domestic terrorists! Red neck spoiled Yahoo's, not patriots by any means.","commenter_a":"When I think of \"Terrorists\" I think of malicious intent to do harm\". When I think of \"Domestic Terrorists\" I think of the same, but the suspect/aggressor is from within. A \"rotten apple in the barrel\", if you will. When I think of patriots fighting for principles as defined by the Constitution, I think of statements like the ones that these people are making in Burns. I'm not saying that what is going on here is right, warranted, and just, but I am saying that (if their story is true) then we absolutely need be paying attention and asking 'why would the Fed Gov need to use strong arm, mafioso tactics to squeeze/coerce people of of their own lands'', and why are we allowing them to get away with it'? Take a close look at the mission statements of the Sierra club, Agenda 21, etc. Then go look your grand ...","post_message":"Rep. Greg Walden (R-OR) spoke on the House floor for over 24 minutes on the armed standoff in Oregon. Here is the closing 5 minutes of his remarks. Watch the complete video of his remarks here: @webpagelink"},{"comment_id":"1862646097306537","commenter_b":"Now that is what real Democracy looks like. You go GIRLS with you in spirit.","commenter_a":"Beautiful","post_message":"What a successful march! Can we get 300,000 likes for these brave ladies? Read more HERE: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153193679463812","commenter_b":"Lady Gaga was amazing & Julie Andrews is stunning! Love that movie always!","commenter_a":"Absolutely amazing!","post_message":"Perhaps the most powerful moment of the #Oscars: @webpagelink"},{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."},{"comment_id":"10153277843683352","commenter_b":"LMFAOOOOOOO black women stay losing","commenter_a":"Nothing is wrong with being ghetto and loud, you just gotta know when to show it!","post_message":"LADIES IF YOU'RE ALONE OR WITH A SORRY MAN! HERE'S WHY‼️‼️ #VALENTINES"},{"comment_id":"10156463625885354","commenter_b":"She needs to go blow Bill, be the best use of her mouth in YEARS!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Kiss my butt u dumb idiot if someone had a gun some of those people might not be dead","post_message":"Hillary Clinton is a Fact-Free Zone."}]
