[{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"10153459278655667","commenter_b":"Instead of talking about it, how about you guys do something about it? No amount of talk will stop someone from raping another.","commenter_a":"This is an incredibly important topic at the University of Pittsburgh. My fellow Pitt classmates are trying to continue the conversation and created this video about the objectification of women on our campus. If you feel strongly about the right to consent and say no, and want to support college students trying to make a difference check this video out: @webpagelink","post_message":"Vice President Joe Biden delivers an incredibly powerful and passionate speech on survivors of domestic abuse and rape at the University of Pittsburgh."},{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"1252133991511641","commenter_b":"Hillary Clinton for the next president","commenter_a":"Just like President Obama said, if his own campaign can't even trust him with a simple tweet, then why should we trust him with the nuclear codes? #VoteBlue","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"10154308446053984","commenter_b":"Unfortunately there is no share here or I would share it. Hate that lying crazy woman. Thanks for that info.","commenter_a":"This piece was copied from another post. It can be found on you tube in something called The Clinton Chronicles. If you're under 50 you really need to read this. If you over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Y Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood both were forced to withdraw their names from consideration. Next she chose Janet Reno husband Bill described her selection as worst mistake. Some may not ...","post_message":"Democratic presidential front-runner Hillary Clinton just revealed that she believes Americans have too many guns in their homes, and I don't think one would have to take too wild of a guess as to what she would do about it if elected president... Do you think a Hillary presidency would be bad for America?"},{"comment_id":"954543751267694","commenter_b":"First of all she did NOT hit the officer first.. He had his arm around her neck before she hit the arm he had wrapped around her throat.. That's a natural human reaction.. Before HE touched her, she was seated in a chair","commenter_a":"Does anyone notice the difference?","post_message":"#AssaultAtSpringValleyHigh: The SC school resource officer who slammed a teenaged girl on the floor was sued twice in federal court. Cops charged in fatal shootings reaches a nationwide high in 2015. #CoreyJones’ final phone calls may detail the moments before his fatal shooting. Check out these stories and more in today's edition of the NewsOne Top 5, our rundown of the viral stories that we are still talking about today. ------> @webpagelink"}]
