[{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"10154435925811509","commenter_b":"Stz! Sexually transmitted zombies","commenter_a":"This is it. This is how zombies start.","post_message":"CDC confirmed the first case of Zika virus being transmitted sexually in the U.S. Dr. Sanjay Gupta has been following this fast moving story closely and is here live to answer your questions. What do you want to know?"},{"comment_id":"1391521917576588","commenter_b":"She is one ugly ape!","commenter_a":"Where is the FBI? Where is homeland security? These idiots are threatening the president of the United States.","post_message":"Nasty Liberal Journalist Asks Why Trump Assassination Is Taking So Long INSTANTLY Blows Up In Her FACE!"},{"comment_id":"1272205819459623","commenter_b":"Trash. Sex film that she herself leaked and a nude photo? No!","commenter_a":"I agree with Bette Midler for once.","post_message":"\"Kim Kardashian tweeted a nude selfie today. If Kim wants us to see a part of her we've never seen, she's gonna have to swallow the camera.\" - Bette Midler"},{"comment_id":"832342470197694","commenter_b":"Boring!","commenter_a":"We do the very same things here today.","post_message":"What do you see in this inkblot?"},{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"}]
