[{"comment_id":"10153924127869197","commenter_b":"My condolences to the family","commenter_a":"God bless her","post_message":"This 10-year-old girl died after she pushed two other children out of harm's way. Read more about the courageous rescue by Kiera Larsen --> @webpagelink"},{"comment_id":"10153824144307235","commenter_b":"These Kurdish Women have more Balls than these Idiots...","commenter_a":"Give dad and son some boots and send them to iraq","post_message":"The photo was rejected because school officials believe “it promotes violence and breaks federal and state law.”"},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"1135734373128367","commenter_b":"Luke Brandon he's going his own way","commenter_a":"She has been nothing but a big disappointment and embarrassment to herself since she divorced her first husband. He built her and her career has gone nowhere but down the tubes since that divorce, as she insist on living the life of shame and sleaze.","post_message":"Claims Mariah Carey's keeping the HUGE engagement ring"},{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."},{"comment_id":"10153463081456336","commenter_b":"So all that is wrong with this country is the Hispanic Illegals?","commenter_a":"People need to realize something, Donald J. Trump is the only person so far in the entire field of presidential candidates who is willing to take on the genuine issues that the other candidates are so afraid to talk about. The truth hurts, medicine never tastes good. Whether or not he would deliver is another subject altogether. #Trump2016","post_message":"Donald J. Trump says Joaquin “El Chapo” Guzman's escape from prison is evidence that his past comments on Mexico are true. Read more of Trump's tweets and tell us your thoughts. @webpagelink"},{"comment_id":"10153168114730399","commenter_b":"Go to hell u hypocrit","commenter_a":"Our laws are dictated by the society as a whole, not by anyone's God or church.","post_message":"A unique interpretation of our justice system..."}]
