[{"comment_id":"10153543784611130","commenter_b":"Bitch where?","commenter_a":"Why are some Android users so concerned with Apple? I know as an Apple user, I could care less about what Android does. It's not really the competition some make it out to be if it's one-sided...","post_message":"Great news for Android."},{"comment_id":"10153231031836051","commenter_b":"Yes, Hillary should have lost her security clearance a long time ago when they first discovered she had breached security with her emails...she should also lose her freedom...she belongs in jail for her crimes. And she will get out lucky if we don't ask for her life as well.","commenter_a":"Hell yess","post_message":"Do you agree or disagree with these intelligence officials?"},{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10153277427691756","commenter_b":"Bitch","commenter_a":"@username: 28 years too late","post_message":"They can reshape within weeks."},{"comment_id":"1771925833072094","commenter_b":"Well, WE the people are voicing concern about muslim people who leave in US for free and hate us; WE the people.!","commenter_a":"assimilate and don't threaten to kill us or kill us. Or rape us. You're in America. Become American. Eezy peezy.","post_message":"Muslims are voicing concern on social media about a Trump presidency. @webpagelink"},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"10153152678751051","commenter_b":"Lady u need help your just stupid","commenter_a":"So many evil haters for every Obama achievement. You have all been wrong on everything Obama has done this far. It is time to take a positive stance!","post_message":"President Obama says today's Iran deal is a huge victory. What do you think: is this a good deal for America?"}]
