[{"comment_id":"10153905231158984","commenter_b":"Idiot. She'll find out how wrong this is some day. It might be hot.","commenter_a":"So sorry to hear this....","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ. This is just disgusting. She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"},{"comment_id":"10153942931813132","commenter_b":"Show this picture to the stupid drunk driver!!! Ask her if it was worth it!!!","commenter_a":"Blessings!!!","post_message":"Unbelievably sad."},{"comment_id":"1024169244346094","commenter_b":"So basically, nobody proofread the most important speech this woman will probably ever make. Yah, right. Wish there were SOMEONE I wanted to elect.","commenter_a":"all the first ladies speeches hold such content,, it is a speech of genuine concern and well they all have the same ideals,, so look up some other first lady speech's,, it will be a great opportunity to learn s0mething new and see what content the other first lady speech's hold,,you might find out something very interesting,,","post_message":"A speechwriter for Melania Trump is taking the blame for lifting passages from a 2008 Michelle Obama speech, admitting she made a 'mistake' – while saying she offered her resignation, but it was rejected. Full statement: @webpagelink"},{"comment_id":"1430173077011648","commenter_b":"Crazy lady!","commenter_a":"Vote Trump all the way to the White House. This country is a business and should be run by a businessman. We have seen what the politicians have done to this country. Trump was self-funded and owes no one. It is time we the people donate to Donald Trump so he is not forced to accept special interest money. I don care how rich he is, he can keep bleeding money, let help him. It should be the American people that Trump owes and not special interest. Go Trump all the way to the White House. Make America Great Again! All aboard the Trump Train! Take America Back from CAIR, MOVE ON, BLM, Muslim Brotherhood and Liberal Terrorist!!!!! Vote Trump, bring jobs to America. Vote Trump if you want to get rid of unfair trade agreements..Save our Country!!!!!!!!!!! Keep out the refugee terrorists!!!! Save our countries jobs!!!! And a side ...","post_message":"Gee, wonder why?"},{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10154072934058352","commenter_b":"Bitch bye u all in mii shit","commenter_a":"But thatz still her bro .....","post_message":"Nicki Minaj posts $100,000 bail for older brother Jelani Maraj after he is charged with raping a 12-year-old"}]
