[{"comment_id":"10154233852123445","commenter_b":"Eww shut up bitch i do but ive seen u more than her 👊😛","commenter_a":"@username @username @username @username haha hell yea i do !😂😂😂😂","post_message":""},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"},{"comment_id":"10153213545451336","commenter_b":"Lady , you've lost all credibility.","commenter_a":"You can't Change what has already happened or bring back the dead .","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"1729905883960126","commenter_b":"That's ridiculous! Stupid woman","commenter_a":"As abreast feeding mother of two.................... She's crazy!! Get organised for Gods sake!!!","post_message":"She was breastfeeding her son in the pool while the wave machine was on"},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153297410416770","commenter_b":"She a turd......she better be praying..wrong thing to say,vote Trump","commenter_a":"Too late and why would you support a total liar?????","post_message":"Former Secretary of State Madeleine Albright is trying to fix a mess she made when she told women at a Hillary Clinton rally there's a \"special place in hell\" for them if they don't vote for Clinton."},{"comment_id":"10153425194311336","commenter_b":"Or illegals","commenter_a":"Yeah lets all love each other just not the gays, liberals, and obama woo hoo ....","post_message":"“At heart we really are indivisible.” Megyn Kelly shares why she loves America. Why do you? Tell us using #ProudAmerican! @webpagelink"}]
