[{"comment_id":"10153748803376077","commenter_b":"Greed!!","commenter_a":"Whoa!!","post_message":"9NEWS Denver Broncos Insider Mike Klis has confirmed that quarterback Brock Osweiler is going to the Houston Texans."},{"comment_id":"10153961148192869","commenter_b":"such a vile, vile woman.","commenter_a":"I don't understand how any woman that has a daughter could vote for Hillary Clinton, sorry she is the poorest excuse for a champion of women and children that I have ever seen.","post_message":"In the war of the Presidential candidates, Donald Trump has taken some heat for his over-the-top characterizations of Hillary Clinton. Admittedly, this is the first campaign in my memory in which one candidate actually called the other a “monster.” But one woman who finds Hillary’s behavior truly monstrous has finally put her name and face behind that charge. This required courage, not just because it goes against the Clintons --- that’s always a scary thing to do --- but also because it relates to the fact that she was raped at age 12 and Hillary defended the man who raped her. The man pleaded guilty to a lesser charge and spent just a few months in jail. This was early in Hillary’s career, in Arkansas, in her one big courtroom trial. (The defendant had reportedly requested a female lawyer.) Certainly every defendant has the Constitutional right to a legal defense, ..."},{"comment_id":"10153653825589641","commenter_b":"Barbaric ... Disgusting behavior . Poor woman. I thank God every day that I was not born in an Islamic country and pity all those women who are oppressed . May she rest in peace .","commenter_a":"What happened to the man she was supposedly cheating with ? Let me guess ....nothing. That country is nothing but a bunch of murderers","post_message":"The victim was in a forced marriage, and had tried to flee with another man."},{"comment_id":"489404284583485","commenter_b":"The hell with her","commenter_a":"Slick willy is at it again!","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"10153414468266323","commenter_b":"Took five years for my son to be. Diagnosed he is now ten","commenter_a":"This is fucking offensive. I can't believe the writer is a senco of all people.","post_message":"The range of options available to the discerning child-labeller is growing: social issue, learning difficulty, behavioural need, obsessive tendency, food intolerance or – my all time favourite – being “on the spectrum” ..."},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"}]
