[{"comment_id":"10154061820451955","commenter_b":"It is just amazing that she can't take both of Bernie's knees out with a snap of her fingers. Something is brewing...","commenter_a":"Time to start planning a street party when Donald J. Trump wins the election. One thing for sure, Hillary Clinton won't be elected DOG CATCHER!","post_message":"SHE LOSES AGAIN"},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"},{"comment_id":"979482032090033","commenter_b":"I hope they fire this liberal girl.","commenter_a":"What do we expect from a company whose owner and chief executive is arrogant and unChristian!They just follow their leader. hope that more people boycott Starbucks. There are better coffee and cheaoer ones out there.","post_message":"Starbucks seems to be on a roll lately, and not in a good way! Should conservatives stay away from Starbucks?"},{"comment_id":"833545303358765","commenter_b":"She's a idiot!","commenter_a":"Abortion is not the answer - Pro-Life is!","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"}]
