[{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"10153763731329170","commenter_b":"Of course Obama and the Democrats will send them to Texas. That conservative state must stand their ground against the onslaught of terror on America.","commenter_a":"They are stuffing them into Texas in an effort to change us from conservative to liberal","post_message":"This shocking map shows exactly where Islamic extremism is festering within the United States... Has this scourge reached your community yet?"},{"comment_id":"10157948531130206","commenter_b":"Lol now only Muslim men beat their girlfriends???? Come on all races n religions of coward men beat n sometimes even murder their wives/girlfriends. Sorry this happened to you. But plz don't try to make it sound like he beat u only cuz he was Muslim......","commenter_a":"This is just sad. I use to have a muslim boyfriend who would always hit me and I left him faster than a rocket ship.","post_message":"Qandeel Baloch was known for her raunchy social media posts that challenged social norms in Pakistan."},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"1080594048640963","commenter_b":"Yes, no one was eating as much sugar in the ancient world as we do today. You can't in your right mind insist there was no tooth decay until the 20th century based on a small sampling from a small area when this \"Mediterranean Diet\" was the norm the world over. Ask any archaeologist. This article is using bad logic for clickbait.","commenter_a":"of course there's no sugar in any of these fruits and figs and honey they were eating.","post_message":"Pompeii citizens never used toothbrushes or toothpaste."}]
