[{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"},{"comment_id":"10152759006876943","commenter_b":"At least they aren't cheap whores.","commenter_a":"We have the best government money can buy!!","post_message":"\"That resulted in a second lawsuit last fall, this one in D.C. Superior Court, in which Judicial Watch attorneys argued that city health officials fraudulently authorized Congress to buy plans through the small-business site...\""},{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""},{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"10153557407432964","commenter_b":"Did they really come legally? I think not. America was first inhabited by the Indians. Christopher Columbus discovered this country by chance and we were not invited, so legally I would think not. We took over, slaughtered many Indians in the take over. So please don't go there. If immigrants come to America I agree we need to now come legally and apply for citizenship, but that is not the issue. The issue is the children born here! This is where they were born and with that they are American! Period!","commenter_a":"I'm not sure I agree with that statement because regardless of whether their parents are immigrants, they too have the ability to become Americans. The children who are born in this country are born on American soil and should be considered Americans, just my thoughts. After all we were all once immigrants and at one time even if we ourselves are not immigrants, we were born on American soil from an ancestry of immigrants and for that reason we too are Americans. I agree with many things about you Senator Vitter, but I have to say on this I don't agree.","post_message":"I think it's flat out wrong for children of illegal immigrants to become U.S. citizens just because they were born here, especially when it’s justified using a false technicality of the Constitution. I made this argument in a guest column in USA Today. Read more:"},{"comment_id":"694654787391766","commenter_b":"I'm suprised that asshole can even find a bathroom.","commenter_a":"The worst President in US history.........","post_message":"ISIS has officially declared they are coming to America. Obama needs to step up before it’s too late. Is Obama unfit to handle this situation?"}]
