[{"comment_id":"10154189944991320","commenter_b":"NO WHITE PEOPLE DO THIS...BLACK AND LATINO....NO CHINESE....NO IRISH....NO ITALIANS.....NO GERMANS....NO SWEDISH...... NO LATVIANS.......BLACK AND HISPANIC PIECES OF S..T","commenter_a":"Try Linden Blvd. and Pennsylvania Ave.","post_message":"The NYPD made its inflexibility clear, dirt bikes and ATVs are illegal in the city, break the law and arrests will be made and the seized vehicle will be destroyed. @webpagelink"},{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10154241642885579","commenter_b":"@username And lucky for you Canadians, you have Justin Trudeau and Chrystia Freeland. They are both young, sensible and bright.","commenter_a":"I'm 73 years old and this is the strangest election I've ever seen in my life. It's scary as hell and I want to move , but nowhere to go. This is the demise of the country that has been predicted for decades. Going under , folks. It's been fun while it lasted.","post_message":"Marco Rubio: \"And so, while it is not God's plan that I be president in 2016 or maybe ever, and while today my campaign is suspended, the fact that I've even come this far is evidence of how special America truly is.\" Watch full speech here: @webpagelink"},{"comment_id":"1701496370115384","commenter_b":"GET OUT OF OUR home & go back to hell where u belong!","commenter_a":"yes!","post_message":"16 U.S. States Come Together To Ban Shariah Law It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1849864471907247","commenter_b":"Oh yea, he needs another wife. Loser!","commenter_a":"Too soon!","post_message":"As no surprise, Gwen Stefani said yes!"},{"comment_id":"10153051114747550","commenter_b":"I did when I was a teenager! Moms are hot!","commenter_a":"True it's sick but boys that age will bang a mom especially to show off.","post_message":"Mother accused of having sex with minors at her teenage daughter's party--> @webpagelink"},{"comment_id":"10153354138131680","commenter_b":"Any evidence statistically of that. Or is that what you think as a HRC supporter. Also I voted for Obama and I support Sanders this election.","commenter_a":"Her decision is very unpopular in Hawaii. Hawai'i Democrats are Obama Democrats. I would expect that she will face a primary challenge as a result.","post_message":"\"I’ve decided I cannot remain neutral and sit on the sidelines any longer.\""}]
