[{"comment_id":"1349594718399369","commenter_b":"Megyn.....one of history's greatest whores. Ever.","commenter_a":"Only because Perry, Walker & Christie already dropped out.","post_message":"This was VERY intense."},{"comment_id":"10150889945159999","commenter_b":"Another great day for Mr Trump and another day Mrs. Clinton lost. Meeting with the Mexican President first and finding common ground, while she stays home and refuses to speak to the American people. Mexico will pay for the wall. It is in their best interest to keep American thugs and murderers out of Mexico","commenter_a":"If the real Native Americans take up this mantra we're all in trouble. D","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"432628273528434","commenter_b":"\"Riot Whores\" want to get paid? Tip: a smart whore always gets paid BEFORE the act!","commenter_a":"Soros wanted them, now pay them you socialistic pig!","post_message":"You might agree that these greedy people are missing the whole point."},{"comment_id":"10157597315525294","commenter_b":"if ya momma was playing she,d get fined too!!!","commenter_a":"As usual we find a way to lose!!!!","post_message":"Plugged in: Josh McCown and Cam Erving injured. Browns blow first half lead. If McCown can't go, who should QB this week against Miami??"}]
