[{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10154102446149749","commenter_b":"@username, STFU and go lick the pope's ass ..","commenter_a":"Well why doesn't the Catholic Church hand over some of its many billions and do something about it and relax their pathetic view on contraception No wonder there are so many of them","post_message":"The Pope laments Europe's handling of the influx of migrants and refugees fleeing war and persecution."},{"comment_id":"10155187133853029","commenter_b":"Your literally the only one what finds this funny","commenter_a":"@username listen to the end","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"1324340430958054","commenter_b":"God will certainly Judge the U.S. for how this country decides to judge and treat people from other countries.","commenter_a":"It's not a forever ban. This is to send a message that we will not let the slightest possibly of another attack. And that if this is the only way then we will do it. We do not hate Muslims. We hate murders.","post_message":"SOUND OFF: President Trump has made a lot of changes this week, and his most recent executive order dealt with immigration. What do you think about his new policies?"},{"comment_id":"10154133163039032","commenter_b":"Ohhh waaaa, namecalling hurts soooo bad, better to be a pig and be free than to be \"hip\" and be a socialist. Again libtards are so out of touch with reality its scary, you all hate this country and the constitution but yet none of you have lived in anoyher country to compare. Like I said, try living in China or Cuba, or Greece, or Russia if you all think big government and socialism are so great. Btw, name calling and insults mean nothing.","commenter_a":"To the guy with \"the america was never great\" sign, why don't you go live in another country for awhile and then come back and waive that sign. Scary how delusional some people are.","post_message":"Music, signs and lots of confrontation between Trump protesters and rally attendees in Prescott Valley. @webpagelink"},{"comment_id":"1049402575096281","commenter_b":"Talking about slavery isn't race-baiting. It's American history. Also, I didn't hear you mention the part about women's rights.... Did you also mean gender-baiting? If not, maybe you are the one stuck on race...","commenter_a":"America was great when americans had pride in your country instead of some fatherless minion trying to tear it apart to serve his race baiting tv program...","post_message":"“Make America Great Again” begs the question: when exactly was America great?"},{"comment_id":"10153201111658984","commenter_b":"DEPORT ALL OF THEM !!","commenter_a":"And the sad part is that I have no faith this error will ever be fixed.","post_message":"This is just astonishing. I think this revelation will make a lot of people very uneasy..."}]
