[{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"},{"comment_id":"10152628059135667","commenter_b":"Dear Bill, are you having relations with that women?","commenter_a":"How can they release something they dont have.","post_message":"\"I want the public to see my email,\" Clinton tweeted."},{"comment_id":"10153889847128132","commenter_b":"Da devil is a lie she outta pocket no excuse non of that","commenter_a":"Well this explains a lot. If you have people like her working in child services, no wonder the children are left in abusive situations and no wonder society is grieving for them as they plant their innocent bodies in the earth--a sad day it is","post_message":"So horrifying."},{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"699619480228630","commenter_b":"@username RE-MOVE HEAD FROM ASS","commenter_a":"....and, Obama let Putin become the Hero of this War on ISIS!","post_message":"Russia is relentless bombing ISIS until they are completely destroyed. We are fully behind them. This is what needs to happen. Can we get 75,000 'LIKES' for Russia?"}]
