[{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"10152669093692434","commenter_b":"This girl is always bipping off about something, anything to get attention to her has been ass. All she ever was a girl in the movie and shitty tv show Clueless. She wasn't even the main character. She needs to sit her ass down and take 100 seats.","commenter_a":"She has ruined Clueless for me.","post_message":"“I’m not saying I’m a victim. I’m pissed off. I don’t wanna be a victim.” Stacey Dash is entirely owned by Meredith Viera in an incredibly awkward debate about the wage gap on The Meredith Vieira Show"},{"comment_id":"10153845314569024","commenter_b":"This is a wake up call. Ban these type of stores underneath the rail. Build a wall around it.","commenter_a":"Cuomo & DeBlasio told their agents to not answer questions??","post_message":"Do you think the city ought to be doing more to keep overhead rail infrastructure secure?"},{"comment_id":"10154027837914087","commenter_b":"Must be polling illegals...","commenter_a":"BOGUS BULLSHIT.","post_message":"Hillary Clinton leads Donald Trump by nearly double digits in New Mexico."},{"comment_id":"1918194181741344","commenter_b":"Orange Hitler needs to shut up!","commenter_a":"Trump NEVER considers possible consequences of his words.","post_message":"Donald J. Trump told his supporters \"a bomb went off in New York,\" well before local officials had publicly confirmed details of the incident or what caused the explosion."},{"comment_id":"1009117072471350","commenter_b":"How typical for illegals to play the race card while obviously not understanding the term racist.","commenter_a":"No one in their right mind should support Trump","post_message":"Add Lindsey Graham to the list of Republicans who say they will not support Donald J. Trump."},{"comment_id":"10153875456235329","commenter_b":"Dear women, stop giving us all of your stuff to put in our pockets","commenter_a":"YES! Matt","post_message":"This is not a drill."}]
