[{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"891611624218799","commenter_b":"That attitude is what spoiled immoral girls, who got caught up in this SEXUAL REVOLUTION\" and forgetting that sex is for married people, and it also leads to pregnancy. They figure,,so what,,if I get pregnant,,I'll just kill my own baby,,,no problem,,,BUT I bet when these young women,,grow older, and marry and THEN do have a child,,,they have guilt like they never knew before.","commenter_a":"Close your legs, ya skank.","post_message":"Um, what? Killing a baby doesn't \"end a pregnancy,\" it just makes someone the mother of a dead baby."},{"comment_id":"10156209671355354","commenter_b":"Please stay there! Not welcome in Texas!","commenter_a":"I hope the next administration is one that will take this down!!","post_message":"And look what it's expected to be by 2018!"},{"comment_id":"894267073955650","commenter_b":"She makes me sick!!!!! Gag!!!","commenter_a":"Not even smart enough to keep her mouth shut.","post_message":"OUCH: Meet the Press plays brutal montage of Hillary Clinton flip-flopping on various issues @webpagelink"},{"comment_id":"10153108961506491","commenter_b":"Who cares ,whatever the case, he's richer than me ...who are we to judge and worry about how much money somebody has in their pockets ? .He has more money than any of us here writing crap on Facebook .","commenter_a":" keep teaching them cause it's obvious, America thinks we come from space!","post_message":"Bill Gates barely holds a candle."},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."}]
