[{"comment_id":"10153931613802093","commenter_b":"I hope they carve him really good in TDC.","commenter_a":"What a motherf**king piece of s**t thug. Die, a**hole! Yeah, I'm pissed.","post_message":"BREAKING: Gustavo Zavala-Garcia has officially been charged with capital murder in the death of 10-year-old Kayla Gomez-Orozco. His bond has been set at $10 million. bit.ly/2fwFjd0"},{"comment_id":"10152948975362434","commenter_b":"SHUT UP BITCH","commenter_a":"Oh I think I don't need to post my thoughts as just the last two comments from Shoshana and Kelly do it for me. But - who the hell does she think she is anyway?","post_message":"Of course she is."},{"comment_id":"10153117013549740","commenter_b":"We wouldn't have any thugs!","commenter_a":"Good idea","post_message":"\"We need to get around this idea that you can resist arrest. You can’t. You just can’t do it. It results in potential injuries to the officer, to the suspect. And we need to change that, and the way to change that is to start penalties for it.\""},{"comment_id":"10155187593643352","commenter_b":"Women do the same thing every day...I'm happy for these guys...lol","commenter_a":"He need a damn job like Mary j blidge husband. They some damn bums","post_message":"Do you believe this? Lamar Sally is taking Sherri Shepherd back to court for an additional $75,000 on top of the $4,100 in child support she already gives him every month. What is he smoking? ----> @webpagelink"},{"comment_id":"10154728738598352","commenter_b":"No excuse for those stupid people if that was my mom let me tell u poop would hit the fan they would have the biggest law suit and have everyone fired. No excuse for their stupidity bunch of idiots","commenter_a":"Thank God for Islam. We don't put our elders in these places and forget about them, alhamd lellah.","post_message":"Bedridden grandmother, 86, screams for help for three hours after staff at a dialysis clinic forget about her and lock up for the day"},{"comment_id":"10154040346806162","commenter_b":"Low life POS!!!!","commenter_a":"Sad how you kill your own child u will rotten in jail rip","post_message":"FAMILY MURDERED: A man is accused of killing his 2-year-old daughter and her mother over child support: @webpagelink"},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"}]
