[{"comment_id":"939835422761174","commenter_b":"Damn...you are still at it? Get off the computer and go talk to the young men whose lives were destroyed. Go peer at those missing eyes. Go stand near the them who lost legs. Listen to the stories of the PTSD stricken. Then come speak this hunger for war. I took an oath to support and defend this constitution. I have great pride when I see little American children stumble to daycare with their backpacks on. I also know, the threat to us doesn't lie in a desert. No donkeys can cross the ocean alive. It's in the profiteers. Those folk who rattle dangers but are too old to pick up arms. Defending our country has been my lifelong business, but I won't say it's been without questioning where the profit is going! Re-read Sodom and Gomorrah. It wasn't about being gay...it was about PRIDE and INHOSPITALITY both of which ...","commenter_a":"You all should do a little research on Trump, did you know that when his father died Trump stole his brother's inheritance and did not get anything to his brothers kids either. He is a greedy bastard. The pathetic part of all of this is that this ignorant population who is supporting him right now think that he is going to do more for them. He doesn't give a rats ass about any of them at all whatsoever. He would structure tax laws and policies that would for their benefit him once he left the White House if he ever made it to presidency. And all those morons who voted for him would sit there with their asses handed to them.","post_message":"LOL! Somewhere, Pres. Obama is rolling on the floor with laughter! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154028228372060","commenter_b":"B*LL S**T.","commenter_a":"Assuming this is true, this is unacceptable. What a horrible thing to say to someone.","post_message":"A Muslim teacher in a Georgia high school said someone left her an anonymous note in her classroom, telling her that her \"headscarf isn't allowed anymore.\" The note also told her to \"tie\" her headscarf around her neck and \"hang yourself with it.\""},{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"10153196646006336","commenter_b":"Illegal Immigration !!","commenter_a":"the only thing i want this guy to speak is about cuban and latino massive immigration to USA !","post_message":"“The purpose of our laws is to protect our right not just to worship, but to live our faith as citizens of this country.” 2016 presidential candidate Marco Rubio spoke with FNC’s John Roberts about religious freedom today at the Faith and Freedom Summit in Iowa, saying that we’ve reached an era of growing religious intolerance."},{"comment_id":"10153235771901167","commenter_b":"Pay close attention! And the Liberals love this guy? @webpagelink","commenter_a":"Exactly. Hate crime.","post_message":"Multiple Planned Parenthood clinics have been targeted in arson attacks since the release of highly edited videos trying to smear them. Why aren't you hearing about that on the news?"},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"}]
