[{"comment_id":"507498396098707","commenter_b":"You guys are all nuts if you think Hillary will make a good president! She is a lier, cheat, she would bring this country down the tubes. She is insane, she is a felony and belongs in jail. If anyone else did what she did they would be in jail for life. Wake up democrats I'm sure there is someone else out there, who can do a much better job! Just because you guys want a woman in the White House she is definitely the wrong choice!","commenter_a":"She's a chameleon who will do anything for power, prestige and to keep her ego stoked.","post_message":"No one does politics as good as a Clinton."},{"comment_id":"10152724701755927","commenter_b":"I don't know who he is, but I do not like him.","commenter_a":"And? Who cares what Chris Hayes thinks!","post_message":"Remember this from Chris Hayes?"},{"comment_id":"959728980774046","commenter_b":"This is ridiculous ! We are a Christian based country . Muslims need to get the hell out and take their evil ideology with them ! NOW !","commenter_a":"YES !!!","post_message":"Obama Gave Millions To This Mosque In America, But Look Who Owns The Mosque This shows you exactly where his true allegiance lies. Do you think Obama is a traitor?"},{"comment_id":"10153828694670779","commenter_b":"So was Hillary's. But don't see you bitching about her. Oh that's right, you're for her, lol. They both suck! And war is coming. Hope you all are ready!","commenter_a":"Poor Frump supporters. At least they have the right temperament. :-D","post_message":"Donald J. Trump's debate conduct is destined to become a future candidate-training video of what not to do. The man dismissed as the most ignorant, uncivil and unprepared major-party candidate in history could not have conducted himself more poorly."},{"comment_id":"618627604994485","commenter_b":"Right on Nicholesa and Aaron. From the word go, you could see that she was a south side of Chicago ghetto girl and she hasn't learned a thing being with the \"swells\". She is an embarrassment.","commenter_a":"Poor little rich bitch wants out sympathy. She should give us hers for all of our money that she's waster. What an ugly greedy ungrateful woman she is. We have never ever had a first lady worse in OUR white house. She is a despicable human being.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"684790694966567","commenter_b":"He is naturally jumping in the election of this man because he is willingly trying to make this united states and land or\\\\f Muslim's. HE continues to support anything he can by continuing to have open doors for these people and also continues to increase the jobs for them and NOT FOR THE AMERICAN PEOPLE this king of leadership is UNAMERICAN JUST LIKE HE IS.","commenter_a":"No doubt!!","post_message":"Now, it is time for a simple question: Has President Obama launched a political campaign against Prime Minister Netanyahu and his allies? @webpagelink"},{"comment_id":"1092391170839418","commenter_b":"@username why would you want my ass to look like your girls face......woof woof.","commenter_a":"His last words were probably \" more ham \". He was old and he was a fat slob. Nobody needed to kill him.","post_message":"Before passing away, Justice Scalia made a comment to his security detail. And based on what we're learning about his death, that comment may have changed everything about that fateful night."}]
