[{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"10153307437349641","commenter_b":"Well a man Isis noob is better than a super trained nato soldier who does nothing as all NATO soldiers do - nothing","commenter_a":"i dont think isis fighters are more than trained noobs :v","post_message":"ISIS \"moron\" gives away HQ location on social media:"},{"comment_id":"523969991126914","commenter_b":"That's the whole purpose of the melting pot. To asimilate and not for every culture to impose their beliefs on the rest of the country, loyalty to the people and to the American flag.","commenter_a":"Get them the he'll out of our country !!!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"10156857801965093","commenter_b":"Who will women vote for if Trump and Clinton are both running in the Fall?","commenter_a":"Maybe America have more young vaginas thann old vaginas!","post_message":"It's hard to believe America's first female Presidential front-runner is doing THIS badly among women."},{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"10153422173110329","commenter_b":"Weird","commenter_a":"@username read all the way through. This is what you're getting.","post_message":"Mom is gonna freak. An elegant homemade gift is just a few easy steps away."}]
