[{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"618134845039685","commenter_b":"It's about time, defund them and get them out of the country.","commenter_a":"Make it so! Move this anti-American institution offshore!","post_message":"Have Obama and the UN finally gone too far?"},{"comment_id":"10153520680806077","commenter_b":"Marine's can be so cocky ugh","commenter_a":"Some people are so trigger happy, its ridiculous and disturbing.","post_message":"Jesse Nelson's 32-year-old brother Christopher was killed after he tried to break into a house in Denver. \"Dying like this, it's not worth it,\" Nelson said."},{"comment_id":"10152966322040047","commenter_b":"CRIMINAL","commenter_a":"Next they sell them for food ingrediants!!","post_message":"Planned Parenthood continues to defend its ghastly operations. Abortionists have confessed to changing their practices in order to harvest more body parts. Sign and Share our petition - demand that Congress further investigate the abortion giant and end the sale of babies' body parts."},{"comment_id":"1266833826777136","commenter_b":"I think this is the only remaining British cultural heritage??it should be nurtured and taken good care of.","commenter_a":"It's ceremonial !","post_message":"The campaign's gaining thousands of supporters"},{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"}]
