[{"comment_id":"442634665940047","commenter_b":"A phony through and through. All she cares about is herself and power","commenter_a":"Indeed","post_message":"ICYMI - Hillary Clinton an Expert at being Fake"},{"comment_id":"10152593040747093","commenter_b":"Both need supervision. That dog could have killed that child.","commenter_a":"Can't blame a 3 year old.","post_message":"Parents of a 3-yr-old attacked by a dog are not happy...b/c the dog’s owners aren't going to get rid of the pet… @webpagelink"},{"comment_id":"1298830980155135","commenter_b":"No wonder we are in the decline we find in our country...these people obviously do not want to deal with reality and make excuses.","commenter_a":"The indoctrination of the Sheeple.","post_message":"When asked about the Ohio State University terrorist attack that took place on Monday, the students just could not bring themselves to be honest."},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"497304097143406","commenter_b":"LEAVE ABE ALONE DIMWITS!","commenter_a":"Leave our money alone","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"}]
