[{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"10155061325079575","commenter_b":"Why would he care about dapl? Obviously he has no intention of cleaning up the water issues in Flint, Michigan either. Because who cares about the people of this country and their wellbeing when you're Trump","commenter_a":"They dont want money it is about the water supply and the destruction of it!","post_message":"President Donald J. Trump signed executive actions to advance construction of the Keystone XL and Dakota Access oil pipelines. The projects had previously been blocked by the Obama administration due in part to environmental concerns."},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"1091133320986005","commenter_b":"Hillary should be jailed as well","commenter_a":"Austin no your ignorant","post_message":"WATCH LIVE: Donald Trump on the final day of campaigning in North Carolina"}]
