[{"comment_id":"10154330734419087","commenter_b":"Shes a half wit scrub striving for brownie points. Bitch needs to go home and make a peanut butter sandwich and shut the fuck up, we ain't got her candy.","commenter_a":"@username not enough money or incentive","post_message":"#BREAKING: The Green Party is dropping the case spearheaded by Jill Stein to request a recount of the election results in Pennsylvania, citing an inability to pay a $1 million bond required by the court."},{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."},{"comment_id":"10153138059356336","commenter_b":"Why women think they have to expose most all of their boobs is beyond me. Not sexy at all, just crude and tasteless","commenter_a":"Need to prove it? Does not \"represent\" anybody.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\" LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"10153320749437439","commenter_b":"Appeasement increases Islamofasism. Now, go study, @webpagelink","commenter_a":"I can't believe you. Yes you are free to be as stupid as you want. But one of these days you are going to be the cause of the death of some innocent person. Shut up and go away you dumb bitch.","post_message":"Going live on @jaketapper The Lead on @CNN to discuss jihad attack on free speech #garlandshooting"},{"comment_id":"1053937954629059","commenter_b":"Crystal...I'm beyond sick of those trifling girls.","commenter_a":"Who cares???...I'm so sick of B news","post_message":"Un-Clutch Your Pearls: Beyoncé Has Nothing To Do With The Sarah Baartman Project @webpagelink"},{"comment_id":"10153394425273352","commenter_b":"What a racist, ignorant bitch!! THE MAN WAS BLACK!!!!! Smh","commenter_a":"If this was a Black person who did this it would not be the same these white people make there own law when they break the law .what a Shame.you all get away from man ,But Y'ALL Didn't get away from God pls.","post_message":"Mother breaks down in court after her ex-husband is cleared of strangling to death their 4-year-old son because he was SLEEPWALKING when he did it"}]
