[{"comment_id":"10154311258046323","commenter_b":"Sorry about that but now I have stated my opinion hope that it carries equal weight","commenter_a":"What are you talking about !!we are fighting for democracy, he was our democratically elected leader. please do not patronise us and who are you to say \"it will never be done under JEREMY CORBYN \" Its only your opinion stop writing it as a fact. The guardian used to give both sides of the argument and leave the reader to make up their own mind.","post_message":"\"A well-led Labour party could win a general election by 2020 when the carnage will be there for all to see. But this will never be done by Jeremy Corbyn. The Labour party must be reclaimed – for the sake of British values, for British democracy and for the very future of our country. Nothing less will do.\""},{"comment_id":"1005094719524280","commenter_b":"Well lets send Trump to the southern border...im sure he will find all the rapists he is looking for....as matter of fact he should say to the all latino people in their faces,..you all bring nothing but rapists here....im sure when people came thru Ellis Island to start a new life Trump would have greeted them as well.","commenter_a":"Too bad the Coast Guard isn't on the southern border. The Cubans are actually fleeing a dictatorship.","post_message":"A USA Today reporter observed a U.S. Coast Guard crew intercepting Cuban rafters attempting to reach freedom on U.S. shores. Despite the recent news of normalizing relations between the U.S. and Cuba, these rafters were sent back to Cuba before they could celebrate on the 4th of July."},{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"10153436831622217","commenter_b":"I never said I sympathized with Rhodes, I'm concerned over how you are passing over Hitler's attrocities if they are nothing. Generally, people who downplay Hitler are anti-Semitic","commenter_a":"Oh my God... if you compared Hitler with Cecil Rhodes, the former is a TODDLER... he killed over 15 million people, kidnapped forced millions into slavery, his statue shouldn't be anywhere for people to remember him, he's not hero or we can have statue of HITLER in Berlin","post_message":"Campaigners say #CecilRhodes represents white supremacy."},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"},{"comment_id":"10152699530401051","commenter_b":"This brittany chick needs her head examined.","commenter_a":"He was born male, he died male. No matter what he felt,","post_message":"These parents faced nonstop criticism after their teen committed suicide by walking in front of a tractor trailer. Now they’re speaking out."},{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""}]
