[{"comment_id":"1272811836073158","commenter_b":"I wouldn't mind my dick being six feet longer","commenter_a":"Is this before or after birth......if so I know many candidates for editing DNA to make civilised human.....step forward 8b7...there are some 'adjustments' needed.","post_message":"Should we be allowed to edit human DNA?"},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1023637380990606","commenter_b":"Bubble gum? Lol are you 12?","commenter_a":"I came to piss off pro vaxxers and chew bubble gum. Im all out of bubble gum.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"1776660905952346","commenter_b":"Pure, concentrated trash.","commenter_a":"Wow. I would be better of going to Hough and Central and picking something up, thank you.","post_message":"BLOWJOBS FOR HILLARY?"},{"comment_id":"1817145371836310","commenter_b":"@username MY BAD...I THOUGHT YOU WERE A WOMAN...NOW I UNDERSTAND...","commenter_a":"Yep. She got mitch slapped, and now she's gnashing teeth. I can't thank you enough mitch. Bravo. I thought you were a spineless rhino, and you probably are, but this is brilliant.","post_message":"Elizabeth Warren took to Facebook Live after being silenced on the Senate floor for quoting a 1986 letter by Coretta Scott King. Now, supporters are rallying behind her with #ShePersisted. @webpagelink"},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"}]
