[{"comment_id":"563081667216516","commenter_b":"Where the white woman at !!","commenter_a":"Markus please don't allow this on my pic I have very young children One is my 6 month old grandson. And 4 other grand kids. Please help Me out lets work to gather to stay Younger. Love auntie Diana","post_message":""},{"comment_id":"509394902575723","commenter_b":"Women especially can be proud!","commenter_a":"What do y'all think so far?","post_message":"Republican Rep. from Alabama seems surprised that not every single State Department was 100 percent loyal to Secretary Clinton all the time."},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"1107053186021095","commenter_b":"Woman enjoy sex more than man but how ? I cant beleive that","commenter_a":"Actually women enjoy sex even more than men, so leave them alone. Nature has to reward them more since they have to invest more in the fruits of the sexual act both during pregnancy and after birth.","post_message":"She started the affair when her teenage nephew came to live with her in 2008"},{"comment_id":"10155041928809187","commenter_b":"Good please for ICE to pick up a bunch of illegals.","commenter_a":"i wish mexico would close its borders an treat american they way they treat illegal just for one day","post_message":"We are Live outside City Hall, where protesters are rallying as part of a nationwide demonstration called 'A Day Without Immigrants' to speak out against recent ICE crackdowns, and showing the impact that immigrants have on the community."}]
