[{"comment_id":"1063488917004194","commenter_b":"Lysha Ewing u r a very bitter woman.","commenter_a":"Stupid cops. To think if it were a black baby they would have walked by","post_message":"Police officers smash window to find fake baby."},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"10154746403950399","commenter_b":"Hope CNN is the first nail in her coffin.her propaganda is responsible for bringing a narcissistic sociopath to power.she knew what he was and put herself and financial gain before our country.she is a traitor.","commenter_a":"Excellent move CNN. The people deserve better going forward. She did an excellent job selling campaign flimflam, but her job is done now, she does not have the skills for the White House world stage.","post_message":"\"We passed. Those are the facts.\""},{"comment_id":"10154455424349445","commenter_b":"Tons of them in cod","commenter_a":"I used to see them and had to pick them out of sole filets when I worked at a major New England grocery store fish market years ago.","post_message":"This video will make you squirm.... but the retailer says its actually a natural phenomenon. @webpagelink"},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"10154362784109062","commenter_b":"❤️","commenter_a":"Praying for the family...","post_message":"A heartbreaking loss for a family after a 14-year-old boy collapsed and died after school in Cleveland, Texas. Hear from the mother about how the teen is being remembered on KHOU 11 News at 6."},{"comment_id":"10153642078228132","commenter_b":"So sad for them.","commenter_a":"Nathaniel Gaytan","post_message":"EXCLUSIVE: It's the end of the road for Ben Affleck and Jennifer Garner."}]
