[{"comment_id":"10154387073057894","commenter_b":"Bitch she would get demoted hard !","commenter_a":"Good! Let Honda go, she has no relevance on the show! @username","post_message":"NeNe Leakes and Kim Zolciak-Biermann in Talks for a FULL-TIME Return to 'The Real Housewives of Atlanta' for Season 10"},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"},{"comment_id":"10153217105611336","commenter_b":"Nah he's just a pussy","commenter_a":"If I were on the Baltimore police force I would walk off the job","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"},{"comment_id":"10153952600386336","commenter_b":"This will definitely stop the murders in Chicago. NOT! It's laughable how completely out of touch this clown is.","commenter_a":"Find Job... Fine job..Mr President.","post_message":"President Barack Obama will use executive actions to expand licensing requirements for small-scale sellers, according to reports."},{"comment_id":"933155700053185","commenter_b":"go Hillary....... TO PRISON!","commenter_a":"I hope Hillary will serve her Prison Time as Gracefully as Martha Stewart did! She might even make some new girlfriends!","post_message":"THIS is who liberals want?"}]
