[{"comment_id":"10153336853341518","commenter_b":"Remember these two Stones Tablets were made to represent apart from commandments written on them. The first Stone Tablet represented the sin bearin Messiah who was to be born in the Holy Land in Canaan and the second Stone Tablet was to represent Messiah the KING who who was to be born in the Holy Land hidden in Africa. These Stone Tablets are buried in different places in Africa and they are Two Shrines of my God.","commenter_a":"Who cares? This is the problem with Judaism today; the discussion is over minutiae and not substance. People are ignorant regarding the mitzvot and the Chief Rabbinate is concerning themselves with this?","post_message":"The Israeli Chief Rabbinate has cut the arches off the 10 Commandments. (We want your comments, but please first read the actual and complete article and not just the Facebook excerpt. See link below...) ------------ Shalom Bear has published \"Squaring the Circle\" on JewishPress.com. @webpagelink"},{"comment_id":"725368590987052","commenter_b":"That bitch should get shot","commenter_a":"Leave blondie","post_message":"Share if you agree."},{"comment_id":"1265274246854453","commenter_b":"Checks and balances in government is what our forefathers had in mind when creating this country -- to offset those may use position to do heinous things. Banning an entire religion isn't the answer - and yes, it IS banning a religion if you say Christians from these countries can come, just not Muslims.","commenter_a":"But how come , you know , if one who comes over , has bad intentions or not ? This kind of mindset is not too much different , from the mind set of nazis","post_message":"President Donald J. Trump tweeted a message about the federal judge who halted his travel ban."},{"comment_id":"960663503945907","commenter_b":"If you don't love her(America) then leave now !","commenter_a":"Good bye Felicia!","post_message":"U.S. students jump off deep end: Renounce America Now it's official. Many American students want to have nothing to do with the U.S., and they're pressing for this astonishing action."},{"comment_id":"10155094693558628","commenter_b":"Yes! Illegal is illegal. He is enforcing laws that have been ignored far too long! If they want to be here then do it the right way and not look to us to support them!!!","commenter_a":"No","post_message":"Like Opposing Views for more!"},{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"10154896780339411","commenter_b":"Why is that boot still in charge. Get her out !!!!","commenter_a":"Says the leader that advocates the EU: one of the biggest protectionism rackets on the planet!","post_message":"'Globalization is happening. We can arrange it such that we strengthen multilateral instruments... or such that we seal ourselves off and become protectionist', said Angela Merkel."}]
