[{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"},{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"10153731471343967","commenter_b":"But a laser pointer. Entertain your cat AND COOK DELICIOUS BACON.","commenter_a":"@username James Speck @username","post_message":"Brilliant"},{"comment_id":"10156725914675093","commenter_b":"Trump gonna go all the way...There's no stopping the Trump Train!","commenter_a":"I really like watching all you rpublicans running in circles..HA...HA....HA HA!!","post_message":"Other Republicans say we should protect the Constitution. Ted Cruz has actually done it; indeed, it has been the animating passion of his career. Read the full editorial in the link & vote in our poll at the end!"},{"comment_id":"1411212282241061","commenter_b":"That's DIRECTED To YOU Mr Joe Biden. .oh my mistake. .mr. Joe bishop!","commenter_a":"Trump is still a fraud and will always be! Go Ted Cruz 2016!","post_message":"The #NeverTrump movement has been around longer than you'd expect."},{"comment_id":"10153354510959714","commenter_b":"He technically could put kids in danger. His fans tend to be a bit over the top. One of those fan girls could and would easily shove someone out of their way to get near him without any thought given to whether or not the person they just shoved is ok.","commenter_a":"OMG I'm not a fan of the guy but u all are over reacting...putting the kids i danger seriously...how...he is not a terrorist he a singer...u all need to get a life...","post_message":"Justin Bieber totally crashed a prom, you guys."},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again. He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency. We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."}]
