[{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"},{"comment_id":"10153306552824087","commenter_b":"Good question Eli Richardson Why do straight liberal females have a problem with men using their facilities?","commenter_a":"Even though that has never happened in the couple hundred cities that already have such protections. My city (also in Texas) has had it for 6 years, never a single issue. It's pure hate of trans people. It's transphobia that drives countless people to suicide. It's unacceptable.","post_message":"The Houston Equal Rights Ordinance became better known by detractors as the “bathroom ordinance,” after opponents warned that some protections related to the use of public bathrooms would allow sexual predators to go into women’s bathrooms."},{"comment_id":"894267073955650","commenter_b":"She makes me sick!!!!! Gag!!!","commenter_a":"Not even smart enough to keep her mouth shut.","post_message":"OUCH: Meet the Press plays brutal montage of Hillary Clinton flip-flopping on various issues @webpagelink"},{"comment_id":"10154934744787403","commenter_b":"@username sorry to disappoint but I'm all for Trump kicking all you Mexicans out of the country 😂😂😂😂😂","commenter_a":"Hypocrite","post_message":"BREAKING NEWS: President Donald Trump plans to suspend visas to seven Muslim-majority countries, draft order shows."},{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"},{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"}]
