[{"comment_id":"566760130115693","commenter_b":"lol women are objectifying themselves! they love the attention! women are one the most hypocrite creatures in the world!","commenter_a":"Females are excepting this behavior. It goes both ways..","post_message":"The #WomenNotObjects campaign wants advertisers to know that consumers are fed up with how females are portrayed in the media."},{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"1027684670588211","commenter_b":"Sadly it's true though. The American education system is poor and it's not the citizen's fault.","commenter_a":"Who did this survey? You just want to make fun of Americans and make others feel superior. By the way, your Grand Canyon photo is too dark, poorly done.","post_message":"Do you know where these major national landmarks are?@webpagelink"},{"comment_id":"10155818590289657","commenter_b":"Democrats always want more. They're parasites .","commenter_a":"Who cares what the democrats want. I am so tired of them making demands. They are nothing more then a pack of bullies and I am tired of them. They should try to fix themselves rather than telling other people how to think.","post_message":"\"Ridiculous shame.\""},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"}]
