[{"comment_id":"491494467719874","commenter_b":"What a dumb ignorant Bitch !","commenter_a":"And she's working on some kind of a reality show where she's a \"judge\"??? OMG!!!!!","post_message":"There it is. There’s the stupidest thing she’s ever said."},{"comment_id":"1666280716731910","commenter_b":"When she gets out she will be deported.","commenter_a":"she'll get out in less than 8 years...crime has consequences...and people exploit illegals...that's one of the reasons we need to build the wall and reform and enforce immigration laws!","post_message":"The Democratss tell illlegals, \"Yes, go ahead & vote\"—this woman does it five times and gets eight years in the slammer."},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"744295802392870","commenter_b":"Oh god this world","commenter_a":"Anoosh GondalSadia Manzoor lol wth","post_message":"The PMS Package makes your 'time of the month' easier with candy and treats. Via In The Know"},{"comment_id":"1172930249409099","commenter_b":"I get chastised for bad grammar but she gets a free pass for talking about wanting to Murder Men. Cough** cough** cognitive dissidents. Cough** cough**","commenter_a":"Yes, it is called bandwagoning. And the sad fact of it is that now we will never know how many of them were being honest and how many are lying for the limelight. Cases like this only cast doubt on instances of rape, unfortunately. If you are victimized, report it immediately. Don't wait.","post_message":"Awful."}]
