[{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"10154079954761833","commenter_b":"hopefully some illegal alien or muslum will off her with a hammer .","commenter_a":"More people are killed with hammers in the US than guns each year. Why isn't she calling for tool manufacturers to be held liable?","post_message":"When Hillary Clinton says that the firearms industry is only business in America that is wholly protected from any kind of liability,\" she is not telling the truth. Gun manufacturers and companies are responsible for bad products. What they are not responsible for are bad people who misuse their products."},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""}]
