[{"comment_id":"853194554776798","commenter_b":"all illegals should be hunted down like animals captured and deported","commenter_a":"Send. Them. All. Back. Legal immigration only.","post_message":"\"I know it’s going to pass, and I know we’re going to be protected.” - Camila Trujillo, DREAMer"},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."},{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"},{"comment_id":"10153702146296491","commenter_b":"Huh ...well suck his dick already","commenter_a":"John Drumpf Miller and his toxic orange implants.","post_message":"Megyn Kelly: \"I would say the hair is real. I have laid hands on it personally.\""},{"comment_id":"10153706337066694","commenter_b":"Point out the sarcasm in your original statement. You SUCK at humor AND sarcasm.","commenter_a":"Yes, because we should assume \"diets\" were a thing because bitches could bake bread....","post_message":"Deal with it, paleo dieters."},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"522894674501793","commenter_b":"@username NEVER THE BENGHAZI BITCH.....please","commenter_a":"i would vote for hillary to stop cruz. if he should become the nominee i will for the first time in my life vote democrat just to block a foriegner from getting in. I want a president born in the usa not canada, whether he is eligible or not is beside the point","post_message":"Have the GOP left it too late to try to stop Donald Trump?"}]
