[{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"10154464854894087","commenter_b":"Your fucking Scum","commenter_a":"World's Greatest Groper...engraved on the back of the medal.","post_message":"BREAKING: President Obama awarded Vice President Joe Biden with the Presidential Medal of Freedom -- the highest civilian honor -- in the surprise ceremony."},{"comment_id":"10153968888907894","commenter_b":"I am with you Tee. These woman don't have any sense, you better get with a man with money. Get your own money as well.","commenter_a":"All these females calling her a gold digger but running around single as fuck with some random broke niggas kids they ain't even with....lmao...ladies it's wise to get with a man that can provide and keep yall asses out the welfare office and from working dead end jobs so you can actually raise your kids. ...but yall been taught it's proper and prideful to struggle with a dude that can't even purchase you a house let alone afford school uniforms for public school 😂😂😂😂","post_message":"60-Year-Old Mel Gibson and His 26-Year-Old Girlfriend Are Expecting"},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"10152767669722217","commenter_b":"100' wall? It will keep out all the green eyed monsters!","commenter_a":"After the last couple of days, I feel it's time to throw my hat into the political ring. I'm forming a new party. The Free England From London Party. We have one proposal. To turn the M25 into a hundred foot wall and fill it with concrete. I'm not sure how we're gonna pay for it, so we're the same as all the other parties, however, I reckon a few Poles and Kurds will do it quite cheap and we could recycle bits of London to make the wall. Who's with me?","post_message":"Spotted any quirky campaign #GE2015 pics? Share yours in the comment section below or via haveyoursay@bbc.co.uk"},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."}]
