[{"comment_id":"1921412701405309","commenter_b":"Your daughter is next.","commenter_a":"But had they wasted the dude, they'd be selling shirts with his thug face and calling for a cop lynching.","post_message":"A police officer's body camera captures the moments he and his partner were shot during a traffic stop. More details ---> @webpagelink"},{"comment_id":"1178194115526177","commenter_b":"That's her idea of building America?","commenter_a":"Hillary supports blm and black panthers in that they say kill all whites and cops. And riots, looters, arsonists, and cop haters are all ok with Hillary.","post_message":"It's being called \"a monumentally stupid comment,\" and that's among the remarks we can print. You simply won't believe how Bernie Sanders is \"feeling the Bern\" from his own fans after saying white people don't know this one thing"},{"comment_id":"1318671731495117","commenter_b":"So basically women have no rights to privacy in a woman's bathroom or locker room. So women have no rights in Washington State.","commenter_a":"They make a law for about one hundred (max) people. The Washington government doesn't think much of all the rest of the states people do they. What a waste of time.","post_message":"Big Brother is watching"},{"comment_id":"10154360236166523","commenter_b":"He is not a queen","commenter_a":"He is a QUEEN. Only the packers can get dominated the whole 1st half and go into the locker room with the lead.","post_message":"Mr. Aaron Rodgers -- the Hail Mary King! via.fox6now.com/ZsBiQ"},{"comment_id":"1516899938343259","commenter_b":"Yet when guys write this type of stuff all women are emotionally hurt ad need to bitch to the moon. Regardless, these women are virtually worthless. Never date a feminists they have nothing to offer a man at all. Zero. Let them die 60 and single","commenter_a":"I can say with 100% honesty that I would avoid every one of those selfish cunts as if they carried the plague. And i feel certain that these are the same daft cunts that will cry about the matriarchy if men were to make an article just like this.","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""},{"comment_id":"727349494120008","commenter_b":"are you kidding me. Get rid of these lowlife scum bags. It didn't have a dining room. well soon they will be Trumped.","commenter_a":"If this is true .they need to go pitch a couple tents ⛺️ somewhere . Give the house to someone who will be grateful to have a roof over there heads 😡😡","post_message":"This shows the welfare mentality at it's absolute WORST! This family has rejected 2 different taxpayer funded 5-bedroom houses and is now staying in a taxpayer funded hotel but they are making another VERY special demand..."},{"comment_id":"10154029521602411","commenter_b":"They why do u live there.? Give them back their land. U r part of the problem apparently","commenter_a":"Why is that something to celebrate? Another way of saying it is that's when the invaders successfully finished off stealing the land of the Potawatomi and Shawnee","post_message":"On December 3, 1818, Illinois became the 21st U.S. state."}]
