[{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week. Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"},{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""},{"comment_id":"1115178825215538","commenter_b":"What the hoes Milton","commenter_a":"Smh..that's sad ..the thing is a man will stay only if he WANTS to stay no matter how many babies you popping out the coochie..better get yo life..become a wife..and try to avoid the strife","post_message":"Desperate"}]
