[{"comment_id":"10156672176230615","commenter_b":"@username you're amazing. Marry me haha","commenter_a":"Let me be honest here. When the California primary happens I'm voting for Bernie. But if Hilary does win the democratic side I'll vote for her. No way am I letting a republican be president. Republicans will just do what they can to get rid of Obamacare, canceling out the rights for the LGBT community, sending our troops to meaningless wars. Hilary might go to war but however she might not. In the end I'm voting democrat for the presidency. A republican will just destroy this country and send us to hell. Not voting for democrat cause Hilary is it is voting for a republican.","post_message":"BREAKING –"},{"comment_id":"10153239404845329","commenter_b":"If a women wants to hate on men and bring them down, she is not a feminist no matter how much she claims to be. Feminists just want complete gender equality!","commenter_a":"I'm pretty sure that most men aren't like \"rape is so cool bruh, I'm going raping this weekend bruh, you coming?\" Stop lol And not all men get all \"EEEEEKKK\" about periods. Personally, I can listen to my female friends talk about it and not even get slightly sick.","post_message":"\"Imagine if men were as disgusted with rape as they are with periods.\""},{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."},{"comment_id":"10153285448873984","commenter_b":"Send her to jail.","commenter_a":"Lock the beast up!!!!","post_message":"And people think she could be our next president? Do you think Hillary should be held accountable over this?"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"1088028091217546","commenter_b":"They'll just keep those desperate women safe in prison","commenter_a":"To all of the people who believe in blocking a women's right to choose by making legal abortions harder to obtain and want women to travel hundreds of miles to get one, if the law in Texas passes, I shudder to think how many \"complications\" (as if that was *really* the GOP's concern at ALL) there will be when desperate women resort to desperate measures. #keepabortionsafeandlegal","post_message":"The Supreme Court, two days after hearing a major abortion case from Texas, on Friday temporarily blocked a Louisiana law imposing regulations on doctors who perform abortions in a move that would allow two recently closed clinics to reopen."},{"comment_id":"1253938284627180","commenter_b":"Your mom's a joke","commenter_a":"Because vag isn't gonna pound itself........","post_message":"From an evolutionary perspective, men are a really bad idea. So why do they exist?"}]
