[{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"10156182407910354","commenter_b":"Will they be put in jail for raping, beheading, burning live people? I think I need some pigs running around my yard.","commenter_a":"Since this treason is all being done by the commie DemocRats lets dump them all into the DemocRat run city's . Chicago, Detroit , Boston, Philly, New York , San Fran, etc. How about a 90% tax on all liberals.","post_message":"You just KNEW this was coming, didn't you?"},{"comment_id":"10155243885678984","commenter_b":"@username excuse me ??? It's the fake news that is treating the president with utter disregard for his office ... they are bought & paid for that's why they say what the liberals are spouting ... makes one SICK !","commenter_a":"Oh boo freakin hoo! Shut the f#&@up all you newsies! You treat the President of the United States like a lowlife scumbag and expect him to kiss your collective asses to make nice! This is Donald Trump and you dummies just don't get it! Be fair and honest and quit making up crap and he will reciprocate! Wake up and smell the coffee!","post_message":"Fox News' Brett Baier just left many viewers speechless. This is going to get Donald Trump's attention..."},{"comment_id":"662547200602525","commenter_b":"When she is burning in hell she will want to change her mind.. buy the way. Put some damn clothes on you look like a tramp.","commenter_a":"She is so gross!","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"},{"comment_id":"344636695739845","commenter_b":"all of these OLD STUPID WOMEN & MEN sould be fired for not doing their job","commenter_a":"I saw her on TV....She's an Idiot !","post_message":"Democrat Leader Calls Israeli Leader and says He Doesn for Her"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."}]
