[{"comment_id":"10156512492735354","commenter_b":"Togetherness...as long as all the women keep their mouth shut. Maybe the punchline is exactly what I wrote.","commenter_a":"What does this photo actually say? It says girls are annoying. Girls talk too much. Girls should be seen and not heard. Whatever a girl says is not important. Men do not want to hear what a girl has to say. Little boys have a voice but little girls do not. The husband's voice is more important than his wife's. Seriously? I can't even imagine what kind of \"joke\" they were trying to tell with this photo. This is hardly funny at all. It's not that this is necessarily offensive, it's just frickin' sad, ignorant, and misogynistic. Congratulations to this mother and father...they have essentially taught their daughters a very important lesson as to their place in this world...and that they have NO VOICE!","post_message":"A firestorm of controversy has erupted over a viral Christmas card depicting a man's wife and girls with mouths taped shut..."},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10153950593368984","commenter_b":"MAXAMED : WITH THIS NAME YOU SHOULD NOT BE SHOWING OFF!! JEWS ASURE THE WHOLE PLANET BELONG TO THEM, WHAT SAY YOU? FIRST CHANGE YOUR RIDICULOUS NAME, THEN AFTERWARDS CUT YOUR PENIS, ONLY TO SAVE THE WORLD OF PEOPLE LIKE YOU.","commenter_a":"A simple answer: If Muslims need to be treated like Muslims, then they should commit their crimes in Muslim countries. When in America, do as Americans do!!!","post_message":"Muslim inmates decided they needed special treatment because an Islamic holiday was coming up, so they started making insane demands. That's when the jailers responded with some unexpected news..."},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""},{"comment_id":"1209844019025849","commenter_b":"But she will claim , its someone elses fault and she knows nothing !","commenter_a":"Better watch himself or he will have an accident like all the others!!","post_message":"WATCH: Romanian hacker \"Guccifer\" tells Fox News he easily breached then-Secretary of State Hillary Clinton's email server. @webpagelink"},{"comment_id":"10153832289717061","commenter_b":"Wow. This mf","commenter_a":"Only 1 million?","post_message":"Taylor Swift vows to donate $1 million to relief efforts in Louisiana after devastating flooding damaged 11,000+ homes."},{"comment_id":"939262232775539","commenter_b":"Hey pam how about I come over and slam you're stupid ass to the ground and throw you across the room, see how you like being manhandled","commenter_a":"No the policeman was right!! No damn respect for anyone any more, just makes me sick!!!!","post_message":"BREAKING NEWS! The cop ASSAULTED a young girl in her South Carolina high school classroom has JUST been FIRED! Do you agree with this decision by his department? Does it change anything? Let us know and help SPREAD THE WORD about the power of #FilmingThePolice! From (Y) Counter Current News - MBD"}]
