[{"comment_id":"674562089401036","commenter_b":"The asshole cant do it","commenter_a":"Yes because the jails are full of Muslims. And what other matters does he have more important. What an absolute joke a president sticks his nose in these matters. Time for the states to push back.","post_message":"Obama administration has decided that they are going to ban pork products. This is just getting ridiculous. They need to come back to reality. Do you think the Obama administration is out of control?"},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"539636529560260","commenter_b":"She should be in jail","commenter_a":"NO FU*K YOU liberal artist Abby Martin !","post_message":"Liberal artist slams Chris Kyle with this t-shirt, but that's not even the worst part. This is awful. He was a true patriot who protected our country. Let's show his family our support. Can we get 20,000 'LIKES' for Chris Kyle?"},{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."}]
