[{"comment_id":"1823696047877973","commenter_b":"She is just jealous.","commenter_a":"Rosie is a washed up loser who thinks we care what she says. We know exactly what and who this disgraceful person is.","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"10153941436496770","commenter_b":"Open your closed minds. Someday we will have a woman president but NOT THAT WOMAN!!!","commenter_a":"What s lie findlly give it up and give it a break. People make the most insane comments. Give the Rep. Some credit because we believe in ethics. You need to grow up and accept Trumps win . If you feel you need to live the country now then leave on the Miley train!","post_message":"And so begins the liberal blame game."},{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10154684431129614","commenter_b":"They should both be arrested Alisa Perne. Neither acted like an adult should, that lesson never suck","commenter_a":"He wasn't acting like a man and she wasn't acting like a woman. He had no right to hit, but she kept provoking still not right. He could of called the police or walked away..both at fault, but he hit so physical violence on his part.","post_message":"Police are searching for a man seen punching a woman in the face in a disturbing surveillance video taken outside a store in Venice over the weekend. The victim apparently had seen the man at a festival in the city on Sunday but does not know him. The two bumped into each other again at the store and got into an argument before the man punched her. Bystanders tried to stop the man but he managed to escape and ran away from the scene. read KTLA's story here: @webpagelink"},{"comment_id":"1194478233905538","commenter_b":"@username...your learning is interfering with your lack of understanding and common sense. These people are Muslims as maybe you are. Their ideology is to secede as supreme at any cost including the taking of life to advance their cause. Allowing 10,000 to come to this Country, and not knowing who they really are, is not a smart idea nor is it responsible. We have enough problems in this Country now with illegals and supporting them. We don't need more leaches to feed. And yes, I am a proud Southerner as you have mentioned. Your history is somewhat flawed and Gods laws supersedes mans laws.","commenter_a":"9/11...\"We will never forget\"! The White House has already forgot, allowing 10,000 Syrian Muslims into America...","post_message":"The Obama administration said Thursday it is willing to take in at least 10,000 refugees in the next fiscal year as Europe grapples with the crisis."},{"comment_id":"10153266988046636","commenter_b":"Nah that doesn't bother me, I'm a risk taker the rest of the time","commenter_a":"things like this make me nervous of going to London most weekends","post_message":"Police say they are treating it as a 'terrorist incident'"},{"comment_id":"889632651227311","commenter_b":"She's a dingbat","commenter_a":"Way to meny Hillary lovers. Hate Sarah only because she is a conservative.","post_message":"Trump comes forward with huge announcement about Sarah Palin... You're going to love this. She is a true patriot and will serve our country. Can we get 10,000 'LIKES' for Sarah Palin?"}]
