[{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"1004794989572137","commenter_b":"Bruno stfu you POG bitch","commenter_a":"Wtf is going on here? Don't you have pride and respect for the uniform you wear, for the veterans that fought many battles wearing that same uniform HOLY FUCK!","post_message":"The new Army drill and ceremony standard. #thanksobama ~Will"},{"comment_id":"854726854659317","commenter_b":"Build the wall","commenter_a":"The Donald has done it again @username","post_message":"I don't have time for political correctness and neither does this country. Donald J. Trump"},{"comment_id":"10153696500960575","commenter_b":"Shoot this mother fucker.","commenter_a":"Hey you are invited to my next BBQ all the pig you can eat","post_message":"More tolerance and love from the Religion of Peace."},{"comment_id":"10154199579226770","commenter_b":"I would make her the racist","commenter_a":"Then should be on our team and not with Islamic terroists","post_message":"A journalist for The Guardian, a left-wing news website, said she wouldn't condemn violence against so-called 'racist' people."},{"comment_id":"10155154956823487","commenter_b":"These people are like the Clinton's they don't give a damn about the illegal immigrants! All they care about is making money 💰 off the backs of illegal immigrants!! Why didn't they help those poor people before get legal documents in order!! 😡😡😡","commenter_a":"A refreshing glimpse of optimism.","post_message":"Bill Gates: predict a comeback for the truth."},{"comment_id":"228156194316478","commenter_b":"Trump 2016, Trump 2020","commenter_a":"AND THAT'S Y HIS ASS GOT TO GO!","post_message":"WOW. Listen carefully... EVERYTHING she said back then was right! Video by Occupy Democrats, LIKE our page for more!"}]
