[{"comment_id":"10152804677074342","commenter_b":"Lots of prostitutes in England!!!!","commenter_a":"PROSTITUTES in LAS VEGAS. Stupidity","post_message":"DIARY OF EVIL: A teen has been found guilty of attempting to kill three woman out of 'revenge' and from frustration of not being able to lose his virginity. \"I was planning to murder, mainly women, as an act of revenge because the life they gave me. I'm still a virgin at 17.\" FULL STORY --> @webpagelink"},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"},{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"673333352791257","commenter_b":"It is VACCINATED children getting the measles from the illegals.","commenter_a":"There will be more diseases brought in that we have eradicated ! They can't let in all these refugees and not face the problem!!!","post_message":"Illegal immigrants have been bringing a special 'gift' with them when they cross the borders. This is terrifying!"},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"1173361852693721","commenter_b":"Oh oh, look out behind Hillary, she has her gass again, and gives it up to everyone on stage.","commenter_a":"Liar Hillary she just can understand that lying is not normal well I guess it is for her and Bill and Obama and her Party.","post_message":"Donald J. Trump is calling Hillary Clinton a liar, openly calling her a liar for making up that story about his being a recruitment video for ISIS. He's now demanding an apology for her lies."}]
