[{"comment_id":"10154089645681336","commenter_b":"Seriously Paula??? Smh! Pathetic!","commenter_a":"It's lice. We all got it in the 70's while in school. It's not life threatening. So it's harder to kill. If it's bad, I agree with shaving the head. It's hair. It will grow back. On average hair grows an inch per month. You can't stop kids from being kids and rolling around on the ground or jumping into leaves. So they get lice. Deal with it.","post_message":"What can you do if your child is affected?"},{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"10153445338169170","commenter_b":"The best government is the least government!!!!","commenter_a":"Never","post_message":"Net neutrality regulations kick in today. ...So when has government regulation actually helped?"},{"comment_id":"10154429240061955","commenter_b":"@username Excellent! Praying everyone in our country reads this!!! Please!!!","commenter_a":"I simply cannot understand how BLIND and Ignorant one can be to support Hillary... She is a Career Criminal with blood on her hands! How can people NOT see this? Just do some BASIC research on her. You will be shocked at the amount of evidence against her!","post_message":"'Fact-checking' becomes opinion journalism..."},{"comment_id":"620923104721955","commenter_b":"😂😂😂 dumb ass girl","commenter_a":"Cukukrazi Sociallyawkward Arsonist Tweak Monsta 😂😂","post_message":"This Is Terrible!"},{"comment_id":"1816447821944782","commenter_b":"put a sock in it bitch","commenter_a":"What if Trump said he was here for the white folks. These people just don't get it.","post_message":"Former Bernie Sanders campaign spokeswoman Symone Sanders just appeared on CNN to weigh in on the future of the DNC and the Democratic party."},{"comment_id":"1049396555150863","commenter_b":"I thought you made a great partner to clint in fight movies rest in peace Jeff","commenter_a":"I like him. He was a good supporting actor. Underrated, in my opinion.","post_message":"Actor Geoffrey Lewis, known for his long working relationship with Clint Eastwood and for a slew of roles in television and film, has died at age 79. @webpagelink"}]
