[{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""},{"comment_id":"10153711356708188","commenter_b":"@username I completely agree. I about had a heart attack when Rand Paul supported McConnell over Bevin. I knew then that he was nothing at all like his father and he would never get my vote. This whole thing is reaffirming my belief that I should not vote Republican again. It will never self correct and I will never vote lesser of two evils again. So, now I wait for the third party candidates to get their faces out there. I hope one of them has the fervour of Trump, the Constitutionality of Ron Paul, and the knowledge and heart of Chuck Baldwin. And, no I won't even though Cruz seems to be on the right track, I won't vote for him if he remains a Republican... not that he would EVER get the nomination.","commenter_a":"Did you really need to sneak in a little attack on Rand Paul?","post_message":"Gee, let's see freedom caucus- you asked us to help you kick out the speaker of the house, then you asked us to do our homework on Daniel Webster. You told me that this is who you needed and wanted. I did. I spent hours in conversations, study and prayer because YOU ASKED ME TO. The listeners did too. I put my credibility on the line for you because you asked me to. Then you just pull out and go for the ROMNEY PICK? You told US to stand up and fight. We did. Now YOU sell us out too? Really?!?! The \"fix\" the republic needs is Paul Ryan? The man who never met a bailout he didn't like? A man who asked to be made king? 100% support and you can't vote him out? Your solution is MORE POWER FOR THE SPEAKER?!?!?!? I am quite frankly pissed and I ..."},{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"10153423522201636","commenter_b":",,,keep yer head down and leave the building!!!","commenter_a":"I KNOW WHY,,, never ever ever ever talk about PERIODS when a woman has her period!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :O","post_message":"The answer is simple"},{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"10153072153096157","commenter_b":"If you're here Illegally you Wil pay the consequences. Deportation!","commenter_a":"stupid question any of u talkers served","post_message":"The ICE operation would begin as soon as next month and would likely affect hundreds of immigrants who fled violence in Central America."}]
