[{"comment_id":"10154609834091336","commenter_b":"I wonder where the laptop and hard drive went?","commenter_a":"Was there ever a doubt Hillary could be trusted. She can't even tell the truth about being sick. She's totally unethical and should never be allowed anywhere near the white house","post_message":"\"Mrs. Clinton delegated her legal security obligations to others. Those obligations to protect official Americans overseas, and especially in Benghazi.\" Gregory Hicks, the former Deputy Chief of Mission for Libya in Hillary Clinton's State Department, said he believes she cannot be trusted with our national security."},{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"},{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10153963839661782","commenter_b":"Why is it ok for the woman to hit him ?","commenter_a":"Not ok you POS","post_message":"BREAKING: A video that shows Oklahoma running back Joe Mixon punching a woman two years ago has been released. We want to stress that this video might be disturbing. We are showing it to you in an effort to be transparent. Click on the link to watch the video now: @webpagelink"},{"comment_id":"10154180774646770","commenter_b":"We need to ban ALL muslims! That'd fix the problem!!","commenter_a":"And some of them are being trained at the age of five to behead their stuffed animals. They have posted it online. We need to be very, very careful as we do this vetting.","post_message":"Obama admitted very few Syrian Christian refugees, compared to thousands of Muslim refugees."}]
