[{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"},{"comment_id":"1068900079796837","commenter_b":"Right on..","commenter_a":"Guitar picks of course, a pick pocket!","post_message":"Who knew? (via HuffPost Canada Style)"},{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"},{"comment_id":"10154193452504087","commenter_b":"2 choices: 1. Hillary(blue pill) 2. Trump(red pill)","commenter_a":"Donald Trump killed his own chances to win the presidency. He should shut his mouth. Keep his zipper closed. Closed his Twitter account. Prepare for the debates. Finally, listen to the advice of your children and staff.","post_message":"Trump interrupted Clinton during the debate to call her a \"nasty woman\" as she was reiterating her commitment to raise taxes on the wealthy."},{"comment_id":"10154630383678145","commenter_b":"She can Rot in prison too!!! Throw everything you can at her!!","commenter_a":"LOCK HER UP THROW AWAY THE KEY.","post_message":"Officials believe LaKensha Smith-Loyd knows where her uncle, accused cop killer Markeith Loyd, is but she has so far refused to tell them."},{"comment_id":"832838423431849","commenter_b":"She won't be in the White House.","commenter_a":"A-hole","post_message":"Say WHAT?!?!? In remarks today to the South Carolina Democratic Women's Council, Hillary Clinton says \"You're not going to see me turn white in the White House!\""},{"comment_id":"10152934177006051","commenter_b":"Stupid Bitch you need your ass whipped","commenter_a":"Karma","post_message":"Even the police were stunned that a teen girl could be so cruel to an elderly woman."}]
