[{"comment_id":"10155790641929778","commenter_b":"Were you guys offended when Obama did it? This is why nobody trusts the media, it's completely bias!","commenter_a":"If you, or anyone you know, is personally affected by this ban, please reach out to us. Message us on Facebook or email newstips@wusa9.com.","post_message":"More than 30 protesters are holding signs against President Donald J. Trump's immigration plan at Washington Dulles International Airport. @webpagelink"},{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10154248904966337","commenter_b":"You ladies are making me think I'm being an asshole for the right reasons","commenter_a":"Stop this goddamn decimation of his character. Millions of us live with chronic pain every day.. Even if he was on painkillers so fucking what. Even if he possibly overdosed, it doesn't fucking matter. He was still a prodigy a musical genius. These post mortem aqusations are nothing more that cheep attempts at gathering attention for your shitty fucking attempts at journalism, and you should be fucking ashamed at your lack of talent and mortality... Fuck you","post_message":"OH NO: New details emerge regarding the death of #Prince."},{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"},{"comment_id":"1338050419567745","commenter_b":"Ladies don't behave like that..","commenter_a":"Why are they so darned angry? It doesn't make sense.","post_message":"LIBERAL YOUNG LADY GOES ON RAMPAGE & DESTROYS TRUMP TABLE at COLLEGE (video) @webpagelink"},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"}]
