[{"comment_id":"10153985207391680","commenter_b":"The Deplorables, The Unredeamables won the election tonight. The Media, Hollywood, Academia, Celebrities and the Elected Officials on both sides that have tainted and divided our country with their slanted, elitist opinions have finally been put in their place. This election was never about Donald Trump, it was about the people. Not the people the media falsely reported about and stereotyped. I was at two Trump rallies, these people were black, white, Hispanic, all ages and all races. People who love our country, love our constitution and the principles within it, love God and love and respect all Americans. The silent majority who we're sick and tired of being falsely portrayed as the intolerant ones, being intimidated, called names and told by an arrogant and grossly out of control government and out of touch minority what we were supposed to think, say and do. #WeThePeople #IndependenceDay2016","commenter_a":"This is about Obama, the establishment and MSM picking Clinton over Bernie. Congrats imbecils.","post_message":"Barack Obama's legacy lost on Tuesday night."},{"comment_id":"10153973412478854","commenter_b":"Move your black Ass ,no one cares.","commenter_a":"U Have Become Despicable & Have No Class.","post_message":""},{"comment_id":"10152627692760950","commenter_b":"cathie stickna in your butt","commenter_a":"weird President","post_message":"President Barack Obama makes a few funny faces and uses a selfie stick in a new BuzzFeed video — and some politicians aren't happy about it."},{"comment_id":"10152976248907232","commenter_b":"I am guessing both Pamela and Leslie are cop wives, or just like giving cops free head","commenter_a":"You know what boggles my mind is how they are here to protect and to serve but it goes both ways here .. they are paid by our tax $ to protect and to serve and yes there job is a hard job but at the end of the day these ppl are just like anyone of us ppl of the streets but I'm confused as to why if little mikey off the block killed somebody beat somebody or whichever would get a he'll of lot of years in prison and cops who are supposed to be here to protect and serve us would get a slap on the wrist or a leave of absence and paid .. so in reality we are all not treated the same by the system but let's just keep being blinded to the matter it has nothing to do with race it has to ...","post_message":"Thousands of demonstrators stood on sidewalks in Delaware County to show their support for law enforcement. STORY HERE: @webpagelink"},{"comment_id":"921257648004031","commenter_b":"Nope, Michelle can get naked with any woman she chooses. I'm okay with that. Hillary too. Lesbian love! Let's all celebrate that.","commenter_a":"I couldn't care less about the nude photos. That has no effect on my disdain towards Trump. I DO care about the fact that conservatives are fine with this, but would have a complete meltdown if this were Michelle Obama and call her every dirty name in the book.","post_message":"What kind of example would First Lady Melania provide for America's children? But let's hear more Fox \"News\" outrage about Michelle Obama's sleeveless dress PLEASE... sigh... Full photo here: @webpagelink"},{"comment_id":"1334294883276632","commenter_b":"What a joke Hillary Clinton is! She's allowed to continue running while there is a fbi criminal investigation?! I wouldn't even be able to apply for a job at McDonald's if I were under a FBI criminal investigation! Nail that bitch!","commenter_a":"the traitorous bitch looks and sounds just like Nixon.","post_message":"BREAKING: Hillary Clinton holds press conference about FBI reopening email probe. VIDEO OF HER STATEMENT: @webpagelink"},{"comment_id":"1250167005050052","commenter_b":"Fuckgirls. Yep.","commenter_a":"Aja can fuck girls be one word? Lmao","post_message":"Let us know! #2016 #WSHH"}]
