[{"comment_id":"992971160795677","commenter_b":"Jean Russ Awwww Jean you're so sweet. But Cruz has just shot himself in the foot again with the phony Obama-Rubio photo shot. What is this guy Cruz doing? Sabotaging his own political aspirations? Digging a hole like a mole; no eyes; no direction; tunneling is a blind panic of a junior Senator?","commenter_a":"I just voted for the best GOP candidate in 32 years! I voted for @username!!!","post_message":"TOMORROW: Join me and Phil Robertson \"The Duck Commander\" in Myrtle Beach or Charleston. RSVP here: tedcruz.org/south-carolina"},{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""},{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."},{"comment_id":"902484503120305","commenter_b":"She will never be a first lady! She spouts her mouth in the wrong direction! Lady you are suppose to set an example for red white black brown or any other color of people in United States! Instead you keep things stirred up, you and your so called husband!!","commenter_a":"Oh, she is the racist. She hate her own kind. Disgusting.","post_message":"Jaw-dropping!"},{"comment_id":"10153699640168984","commenter_b":"Trump2016, Deported his ass and then let him back in,Just like he said he can do with the good illegals, but if they are bad then he will leave them on the other side of the wall.lol","commenter_a":"the most entertaining candidate I have ever seen :)","post_message":"This Univision host thought he could battle it out with Trump, but he failed BIG time. Do you think Donald Trump made the right move?"}]
