[{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."},{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."},{"comment_id":"10154092035258352","commenter_b":"NASTY ANIMAL.","commenter_a":"Just gross","post_message":"Dairy Queen worker who 'has herpes' arrested for 'spitting on officer's burger'"},{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"},{"comment_id":"10155333457725354","commenter_b":"Besides all this...Clinton looks like she needs a facelift! She definitely has not aged well. With all the worries she's had I can see why she looks like this...","commenter_a":"No integrity","post_message":"MELTDOWN: Hillary's Disastrous Press Conference..."},{"comment_id":"943180705778182","commenter_b":"It's a ROCKET SHIP.... Feel the Bernie Ship!","commenter_a":"All I can say is Wow","post_message":"Bernie Sanders closes in on Hillary Clinton in a big way in this \"shocking\" new New Hampshire poll. Watch more here: @webpagelink"},{"comment_id":"10156651950690354","commenter_b":"She can have all my babies","commenter_a":"Some poor schlep is going to get this girl pregnant one day and then oooooohhhhhhhh shitttttttt, here comes the crazy. Which brings up a good point. Wear condoms. Knowing is half the battle.","post_message":"Here's the VIDEO that's breaking the Internet today. \"Miami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\" **Viewer discretion is advised**"}]
