[{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."},{"comment_id":"10153700779194062","commenter_b":"No NOT all Latinos are Mexicanos but that would be the first place anyone of that Heritage will head too is that is MEXICO with the quickness !!! You can not hide here in TEXAS we can tell da difference now.. Everybody stands out now a days!!!","commenter_a":"So where is the other guy that was last seen with them now?","post_message":"More: Baytown Police said the bodies were found Thursday afternoon at FM 563 at Eagle Ferry."},{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."},{"comment_id":"956871837686622","commenter_b":"This mother is insane.","commenter_a":"Not cute or darling...it is ANIMAL ABUSE..this child will grow up not respecting animals or people a a result of mommy's abuse to her and to animals...kids do not know...they have to be taught...","post_message":"This is not “cute” or “playful” or “darling” or “harmless” — it’s ANIMAL ABUSE, indirectly perpetrated by a mother too ignorant to keep her clueless (and ultimately innocent) toddler from treating a LIVING, FEELING creature like an inanimate rag doll. Disgusting…"},{"comment_id":"10155606763470492","commenter_b":"OMG it happen on number 7 train everyday. this lady on the photo is nothing. many of them insists squeeze inside and the worse is stink body smell that hit your nose.","commenter_a":"Tiffany Yeung","post_message":"Behold, the Incredible Levitating Lady."}]
