[{"comment_id":"1255582551128439","commenter_b":"@username No that shooter was a Mentally Challenged person . Most of the MASS SHOOTERS have been Mentally Challenged. You ask why are they allowed to roam the streets? Well, they took the money to contain and treat them and gave to to the unwed mother to have 20 kids with and to provide Food Stamps. DO NOT under estimate the challenged ones. Some are very smart and great at solving problems. They just can't function in society.","commenter_a":"Here's what we now so far: Syed Farook and Tashfeen Malik met in Saudi Arabia. Farook was described as a devoutly religious Muslim (most likely Sunni). The third suspect, Tayyeep Bin Ardogan, is a 28-year-old native of Qatar. Only Farook was employed by the agency hosting the Christmas party. Multiple explosive devices were discovered at the scene of the massacre. IEDs (improvised explosive devices) are illegal in the State of California. IEDs take time to build. Obviously, there was some planning involved. IEDs are mass-casualty weapons that kill indiscriminately. They're not something you use when you're concerned about casualty mitigation and innocent bystanders. A coworker stated that Farook had grown out his beard over the last several months. The geniuses in the DOJ (namely the FBI) are trying to ascertain a motive. That's nice. Let's see how long it takes them to put the pieces together.","post_message":"The suspects in the San Bernardino shooting were armed with four guns and an explosive device in a \"well-planned\" attack, officials said."},{"comment_id":"10153899755279218","commenter_b":"Ridiculous!!! That's y some of these mother fu#$&@# go around and do what the hell they want to do because of the justice system really lay these fuc&%$@ down do to them what they are doing to others give them the death chair it just doesn't make any sense to me...eye for an eye I don't care if its my family u did the crime u do the time I believe in 2nd chances some deserve it and some don't plain and simple","commenter_a":"K she looks HIGH AS HELL in her mugshot. Shorty clearly has a problem. Her baby should go to someone who cares, someone who will love her forever. There's no way I would let the child stay with this woman.","post_message":"MOM GUILTY: Sandra McClary, 26, pleaded guilty to reckless endangerment of her child, Anne Arundel County prosecutors said. Police said McClary's 2-month-old daughter was found in a carrier on the side of the road late July 4 in Pasadena. READ MORE: >> @webpagelink"},{"comment_id":"10154096879120329","commenter_b":"Girl buy a shirt that will fit","commenter_a":"Jenny","post_message":"Anyone who says they made it into adulthood unscathed is either lucky AF or a liar."},{"comment_id":"1202675816432455","commenter_b":"Anyone is better than Killary. I'd rather look at and hear him than her.","commenter_a":"Guess Rush has already forgotten all of Trump's promises to \"cut deals\" with all the Reids and Pelosis out there. The left probably won't have to worry very much.","post_message":"I want you to fast forward to November to Trump winning the presidency in November. I want you to think, using your intelligence guided by experience, what's gonna happen that night? What's gonna happen the next day? What's going to happen every day thereafter? What's gonna happen the day Trump gets inaugurated? What is the left gonna do? They're not gonna just sit idly by and accept this and say, \"Good fight. We gave it everything we had, but we lost.\" They're gonna do everything they can to undermine it. And I think we're gonna see levels of violence that we have not seen."},{"comment_id":"10153593940166336","commenter_b":"Every woman scares Jorge.","commenter_a":"He did NOT pay kids for sex. He raped children!! Get it right!!!","post_message":"Fogle offered to pay adult prostitutes a finder's fee if they could connect him with minors for sex acts, including some as young as 14 or 15 years old, authorities said."},{"comment_id":"10153481340240575","commenter_b":"This should be a crime!!!!! Go to hell!!!","commenter_a":"This is a BLACK DEVIL HE NEEDS TO BE EXTERMINATED!!!!!","post_message":"The Gateway Pundit - Farrakhan Shouts “Allahu Akbar!” and “White People Deserve to Die” In Latest Sermon (Video)"},{"comment_id":"927473010672643","commenter_b":"@username this has made my day!! When are you and Rene coming to visit I miss you guys!!!!","commenter_a":"Eyes bigger than stomach? 😜","post_message":"That's the most metal thing I ever heard. \\\\m/"}]
