[{"comment_id":"1713686355585143","commenter_b":"Stick it bitch.","commenter_a":"They came into office with 1 are 3 million they now have 12 to 20 more million...Don't tell me she's not getting paid...","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"1744752812466666","commenter_b":"He can't he has to pay for all of Obama's muslims he let in here during his presidency. Also, all the illegals. Unless we get rid of all the illegals there is no money.. Oh and the muslims that Obama let in here..LOL","commenter_a":"Mr. @username, Like where you're going. I would 1st Cut Welfare 100% and give it all to the Vets, they have earned it. Close the border and start kicking out un-documented, non tax paying illegals. Bring jobs back to the U.S.A, and repeal oshitcare. Also free up the 2nd A. If you Hate this Country Ask the Government for a ONE WAY TICKET to anywhere in the world. Free of charge.","post_message":"A NATION WITHOUT BORDERS IS NOT A NATION AT ALL. WE MUST HAVE A WALL. THE RULE OF LAW MATTERS! -DJT"},{"comment_id":"10154742008716130","commenter_b":"And I would brain-smash you if it were legal. So what now, Bitch?","commenter_a":"Looks like someone forgot to tell this douchebag that Democrats don't run s*** anymore.","post_message":"Time's running out..."},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"}]
