[{"comment_id":"10153246663015950","commenter_b":"Only in America . Keep the girl scouts all girls and leave the boys alone . If the girls want to do the same stuff as the boys do then create your own stuff for girls only .","commenter_a":"Boy Scouts are so much more organized with better opportunities, I don't blame them one bit! As an adult involved in both, I'd much prefer to be a Boy Scout! Girl Scouts of America need to get their crap together.","post_message":"A group of girls decided they were more interested in what the boys were doing. So, they quit Girl Scouts and started participating in activities alongside a local Boy Scout troop. Now they're fighting to prove they can do the same things boys can."},{"comment_id":"10153140551051051","commenter_b":"Absolutely. It's a broken system. What I don't get is that in any other country if you enter the country illegally, you get sent back. Why is it soo hard here for that to happen? It's a bigger problem then an illegal person killing another person. Maybe it's time to close the borders and get our country and its laws in order?","commenter_a":"deport trump to mexico...","post_message":"The man who had been deported 5 times before killing an innocent S.F. woman entered a surprising plea. Do you think he's an example of how the current immigration policy isn't working?"},{"comment_id":"324603137933515","commenter_b":"@username have her livein your house ! Problem solved ..","commenter_a":"She can come but her parents need to stay and fight for their country","post_message":""},{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"1311191442237531","commenter_b":"Pretty lady","commenter_a":"Same thing happened to me but without the note.","post_message":"'Found this on the floor of a bar about a year ago. Hope you don mind...'"},{"comment_id":"10154311258046323","commenter_b":"Sorry about that but now I have stated my opinion hope that it carries equal weight","commenter_a":"What are you talking about !!we are fighting for democracy, he was our democratically elected leader. please do not patronise us and who are you to say \"it will never be done under JEREMY CORBYN \" Its only your opinion stop writing it as a fact. The guardian used to give both sides of the argument and leave the reader to make up their own mind.","post_message":"\"A well-led Labour party could win a general election by 2020 when the carnage will be there for all to see. But this will never be done by Jeremy Corbyn. The Labour party must be reclaimed – for the sake of British values, for British democracy and for the very future of our country. Nothing less will do.\""},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."}]
