[{"comment_id":"1295782043794583","commenter_b":"Let them fear! BE TERRIFIED! Trump will deport you! Americans WANT illegals and Moslems DEPORTED!","commenter_a":"\"I going to stand up for the 11-year-old girl in Nevada, who worried that her parents would be deported under a Trump presidency. For the Muslim family in Queens whose young children are terrified of how their family would be treated if Donald Trump becomes their Commander-in-Chief.\" What about the FIVE YEAR OLD GIRL in Idaho who was gang raped by SEVEN of your precious muslims,Hillary? What about the families in NY & NJ who are terrified that they will be blown up by ANOTHER muslim who has stolen and benefited from America's generosity,only to turn their islamic hate on us?!? Go to Hell,back where you came from,Hillary.","post_message":"HILLARY EMAILS HER DEBATE STRATEGY. AND ON THE HEELS OF A MUSLIM-LED TERROR ATTACK, HILLARY'S EMAIL COULD NOT BE MORE ANTI-AMERICAN. Read it. @webpagelink"},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"10154054771666574","commenter_b":"Thank you Senator @username. Please stand up to this narcissistic demagogue who is the president. Please encourage your Republican colleagues to stand up to the POTUS and his white nationalist advisors.","commenter_a":"A Free Ukrainian and freedom for Chechnya, Dogestan, Alania, Ingushetio, North Osseha, and other ethic republic under Russian occupation.","post_message":"President Donald Trump’s call with Vladimir Putin is scheduled to take place amid widespread speculation that the White House is considering lifting sanctions against Russia. For the sake of America’s national security and that of our allies, I hope President Trump will put an end to this speculation and reject such a reckless course. If he does not, I will work with my colleagues to codify sanctions against Russia into law. In just the last three years under Vladimir Putin, Russia has invaded Ukraine, annexed Crimea, threatened NATO allies, and intervened militarily in Syria, leaving a trail of death, destruction, and broken promises in his wake. Russia’s war on Ukraine has killed over 10,000 Ukrainian soldiers and civilians. Russia supplied the weapons that shot down a commercial aircraft over Ukraine and killed 298 innocent people. Russia has conducted a massive military buildup along NATO’s eastern flank, conducted large-scale military exercises, ..."},{"comment_id":"885067018227393","commenter_b":"Moms should go to a socialist country where their values are the norm","commenter_a":"Cops are too agressive and think they are always the kings and you can't tell them anything, and they dont know the laws.","post_message":"Moms want out of America!"},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."},{"comment_id":"1060332480688422","commenter_b":"Hillary foreign policy. Iran bad deal. Libya diaster, benghanzi four died on her watched as they pled for help and she wants more illegals and migrants to come in take over country putting our safey and jobs at risk. Voted for Iraq war, a war buillt on lies! Say No to Hillary!!!","commenter_a":"Whether Bernie likes it or not he has no say so over what this country's direction is.","post_message":"Our message in this campaign is of creating a nation and a vision based on social justice economic justice, racial justice, and environmental justice – and whether Donald Trump likes it or not, whether Hillary Clinton likes it or not, that is the future vision of this country."},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."}]
