[{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153193679463812","commenter_b":"Lady Gaga was amazing & Julie Andrews is stunning! Love that movie always!","commenter_a":"Absolutely amazing!","post_message":"Perhaps the most powerful moment of the #Oscars: @webpagelink"},{"comment_id":"10154095575861051","commenter_b":"Hillary ain't sending no one back she'll let the whole world here, terrorists included","commenter_a":"I just hope that when Hillary wins she will issue a deportation order for Ted's old man.and sends his goofy ass back to Cuba.","post_message":"Ted Cruz says Trump would absolutely be a better president than Hillary Clinton, so he'll be casting his vote for him this November. Do you feel the same way?"},{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"10154529062833132","commenter_b":"Your son probably won't even know what's going on unless he's seen the first one. Gtfo with your nonsense lady. I hope your son grows up to be a better adult then you.","commenter_a":"Cant they just leave the kids movie alone? Kid's dont need to see that. My son isn't going to see the movie now. I swear the gays have to take over","post_message":"Ellen DeGeneres is addressing the issue some people had after the recent Finding Dory trailer."}]
