[{"comment_id":"936217929734331","commenter_b":"Miley is the best white feminist ever! Also, Bangerz was a half-decent album","commenter_a":"She is really a sweetie has a good heart.","post_message":"There's a side of Miley Cyrus that just about everyone misses."},{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"480289475501690","commenter_b":"Read thru all the comments before insinuating, fucking bitch","commenter_a":"What about womens rights? What about the Muslim teens who made a mistake? Or the children & women getting raped? What about the women who are clearly not mentally capable of handling pregnancy or a baby? Id rather an aborted baby than a murdered baby left in the dumpster.","post_message":"The bill has been called the first of its kind in the nation:"},{"comment_id":"809483035820491","commenter_b":"Send her little ass over there to stay and take her ma ma with her","commenter_a":"NO FOR GOD SAKES , NO MORE CLINTON'S.","post_message":"Send Chelsea to Benghazi! Dc Gazette (y)"},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"}]
