[{"comment_id":"10153487180410667","commenter_b":"@username this couldve been you","commenter_a":"Outstanding young man and a very generous \"Thor \"","post_message":"\"I looked up at my mom and was like, 'ma, do you know who this is?'\""},{"comment_id":"1666280716731910","commenter_b":"When she gets out she will be deported.","commenter_a":"she'll get out in less than 8 years...crime has consequences...and people exploit illegals...that's one of the reasons we need to build the wall and reform and enforce immigration laws!","post_message":"The Democratss tell illlegals, \"Yes, go ahead & vote\"—this woman does it five times and gets eight years in the slammer."},{"comment_id":"10153756780250695","commenter_b":"Respect everybody-easy on the sir crap","commenter_a":"the police and are like any other person they put there pants on and go to work ........they chose the job we didnt force it on them.i see no reason to buy there meals and say sir and ma'am to them.i work hard for what i have and i get nothing free so why should police get anything free.they have to come if you call them anyway........................!","post_message":"\"Put their charities on your giving list. If your local law enforcement has volunteer-citizen job opportunities, sign up.” Do you agree with his idea?"},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153025802828205","commenter_b":"Cindy @username please those immigrants pay taxes and guess what they can't file them every year. So the United states keep them. And I bet you would do anything if your kids didn't have an education. Or food on their table. Yes those that killed . Do bad things should be deported. Those parents that work . Some people like me have small business. So shut up if you never been on a situation where you don't a choice.","commenter_a":"If the above bill goes trough then where does ending DACA and deportation come in? They are giving them an opportunity for citizenship which if they do that then they should deport their illegal parents especially if the kids have completed school and working. No compromise here or you Republicans will never win the White House and I will only vote to get all Rhinos out of their cushioned thrones.","post_message":"On #TBT, remembering when my Republican colleagues believed in protecting immigrant children, just one year ago. Yesterday, they voted to end #DACA and deport #DREAMers. What a difference a year makes."},{"comment_id":"1225936470775105","commenter_b":"Bye naked fool","commenter_a":"What a worthless p.o.s. go get out its types like you we need to be rid of.","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"814443405353112","commenter_b":"if that be the case then throw the Muslims out!","commenter_a":"And what if their choice of attire offends Americans? Will they change their dress code? I doubt it. Squeaky wheel getting attention yet again","post_message":"Catholic University Investigated for Having Too Many Crosses Because It’s Offensive to Muslims @webpagelink"}]
