[{"comment_id":"10153680623219087","commenter_b":"@username Why should the gun industry be the only industry in our country to be granted blanket immunity?","commenter_a":"Ah yes, @username ready to go with its latest Bernie slam piece right after he wins Wisconsin and right after they post an article praising Hillary's graceful concession. Quality, non-agenda-filled journalism, lads and ladies.","post_message":"\"Shame on you, @BernieSanders try living one hour of our lives. Love, the #SandyHook Principal's Daughter,\" Erica Smegielski tweeted with links to the front page of Wednesday’s New York Daily News, with a headline reading: Bernie’s Sandy Hook Shame."},{"comment_id":"1092391170839418","commenter_b":"@username why would you want my ass to look like your girls face......woof woof.","commenter_a":"His last words were probably \" more ham \". He was old and he was a fat slob. Nobody needed to kill him.","post_message":"Before passing away, Justice Scalia made a comment to his security detail. And based on what we're learning about his death, that comment may have changed everything about that fateful night."},{"comment_id":"10153182713489030","commenter_b":"You're clearly loose butthole","commenter_a":"Yeah, this show is as stupid as every druggy I have ever met, and not even close to being funny, uless you are a druggy too.","post_message":"Vote for Seth Rogen and Zac Efron's Workaholics video in this year's Webby Awards People's Voice. @webpagelink"},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"923763564345713","commenter_b":"Blacks don't have a race card too play too our advantage only white ppl. Have a race its called white privilege. We have no damn race card nor ace card too use too our advantage since our culture controls nothing.whites have the race card too play since they control the system.","commenter_a":"Where are those white commenters now. Aren't these people \"race baiting\" or pulling the race card I dont hear their clown asses now! When its things like this they have nothing to say Because they are sitting back applauding this. They are the racist!","post_message":"This is happening. Residents of a predominantly black suburb in Detroit are up in arms after discovering racist political flyers sprinkled on their lawns that depict a cop in Ku Klux Klan gear pointing a gun at a black child. The flyers urge residents to “get the blacks out” and vote for white candidates, including mayoral contender Kenson Siver. MORE ---> @webpagelink"},{"comment_id":"10153767433373132","commenter_b":"go girl.","commenter_a":"You are the most. Beautiful one there your Hair your. Clothes shoes. You go Rock it Beautiful!!!","post_message":"Counting down the days to New York Fashion Week."},{"comment_id":"10153707450494218","commenter_b":"I DONT CARE if he was Sellings DRUGS or Selling His MOTHERRRRR These Six Police Officers TOOK A LIFEEEEEEE PPL.. ANd for that They Shall SUFFERThat's IT That's ALLLLL","commenter_a":"No justice for the 6 officers who were doing their job. What do we have police officers for? That needs to be explained..... Mr. Gray was a drug dealer plus numerous other things. Baltimore wants to keep drugs in their streets it seems! My thoughts only and Mr. Gray, well he would have gone to prison if he lived I hope.","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"}]
