[{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"1199808656730781","commenter_b":"I will say that being raised by two parents, not necessarily a man and a woman, can be a good support system for a child though. Single parents aren't worse by any means, but it is tougher out there for single parents, that's for sure.","commenter_a":"2 perverts","post_message":"Classic Jeb! (Hat tip to Bipartisan Report)"},{"comment_id":"1315430658535467","commenter_b":"Hell yes! Build your wall and Get Over It!","commenter_a":"Could you guys please move on from this and actually report news.","post_message":"He's the \"Hamilton\" actor who gave a holier-than-thou speech to Vice President-elect Mike Pence at a performance of the play in New York City last week. Now, sick tweets have emerged that show the kind of person that Brandon V. Dixon REALLY is, and it's definitely not the kind of thing he wanted out there..."},{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"10153118428724641","commenter_b":"Those blood sucker should come to Malaysia to joining in our corrupt club here without fear... They really stupid because Malaysia only protect the corrupt rich...","commenter_a":"Must be getting ready for something if they want more people back to their country.","post_message":"150 corrupt Chinese officials may be hiding in the U.S. And China wants them back cnnmon.ie/1M6Of5q"},{"comment_id":"10152787741471130","commenter_b":"And please don't reproduce a$$hole!","commenter_a":"This makes my stomach churn. These poor dogs would have been better off on the streets!!!","post_message":"\"They were living in their feces, urine and there was nothing there.\""}]
