[{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10153764153724117","commenter_b":"Hey you fucker","commenter_a":"It's simply beyond comprehension how anybody can even entertain the drivel that spews forth from his vapid-short-sentence-narcissistic mouth. (And disclaimer for the inevitable butthurt Repubs, Clinton isn't any more trustworthy. Happy now?)","post_message":"Donald J. Trump is selling skepticism about the democratic process because he does not believe in it himself."},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."},{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"1215144131854339","commenter_b":"yup-knew this was coming next illegal immigrants-","commenter_a":"This is only for California elections it does not include the federal or United States presidential elections he cannot sign into law to control the federal government he only has control of the state so only state elections pertain to this law","post_message":"HORRIBLE!!!"},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""}]
