[{"comment_id":"10153901120586336","commenter_b":"If the current laws are followed and enforced like they should be then no one who should not own a firearm would be able to buy a firearm from a license FFL Dealer. Read about it on the ATF website","commenter_a":"This will do nothing to stop the criminals from doing what criminals do. It will only hurt law abiding citizens.","post_message":"President Barack Obama is reportedly finalizing a proposal to expand background checks by executive order."},{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"1619157871724827","commenter_b":"oh come on this is another lie and I would sue thevhekl out of Gloria and this bimbo! all these women have come back and stated they lied!! this bimbo wants her 15 minutes and she has no merit! ! he was right most Hollywood women will let you grope them for them to get ahead!! funny how all these women kept going around him time after time therefore it did not happen or they would not have wanted to be around him!!","commenter_a":"Blah blah blah,,,,, ummm what happened to all the other woman during the elections. Bye felicia","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."},{"comment_id":"1526333487662909","commenter_b":"Trump, you just jealous it was not you to be the first to go there. Get a life you weirdo.","commenter_a":"Big talk for someone who is a national embarrassment.","post_message":"Wow, President Obama just landed in Cuba, a big deal, and Raul Castro wasn't even there to greet him. He greeted Pope and others. No respect!"},{"comment_id":"10153982977694411","commenter_b":"This old bitch is an asswhole ..am sure you are having sex with your boy aren't you?","commenter_a":"go the hell home.. you are nothing but a bunch of bitchers, bellyachers.. shut up and get a life.. stop moaning and groaning and playing the pity card.. there's millions around the world that are worse off than you are.. keep moving until you find where it is Allah wants you.. dang.. are you all stupid ignorant imbeciles? can any Muslims think for themselves or do they all wait on what their God Allah/Poop Francis says.. rub your rosary beads and pray 5 times aday towards Mecca or better yet go there and shut the hell up.. freaks.","post_message":"'We were just standing outside and we all just started coughing and our eyes were burning. We were really confused about what was going on'"},{"comment_id":"10153283210126770","commenter_b":"Stupid people","commenter_a":"Go back to sleep.","post_message":"MSNBC host Melissa Harris-Perry criticizes the Democratic presidential field for being anemic, old, and “whiter than the Oscars.” Read more: @webpagelink"}]
