[{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it. Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"925455207491820","commenter_b":"Buzz off Kim and take Kanye with you. Both of you suck....","commenter_a":"Wasn't it Paris Hilton that didn't know what Wal-Mart was?","post_message":"Here's how Kim Kardashian responded when asked to react to Megyn Kelly calling her look \"enhanced.\""},{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"10156546943220354","commenter_b":"THIS SHAMEFUL........","commenter_a":"What a piece of shit","post_message":"And then he said where he promises to MOVE if Trump DOES win..."}]
