[{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."},{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"10152943147236680","commenter_b":"Nowadays we have male, female and family bathrooms!!! If you can't hold it in look for a tree!!!","commenter_a":"There's a term called friendly fire...","post_message":"The senior member of the Senate Armed Services Committee opposes the plan announced last week by the Pentagon to allow transgender troops to serve in the military, saying “it wouldn’t work.”"},{"comment_id":"891587657549689","commenter_b":"Two bullies fightng for power all over the arab both are terrorist","commenter_a":"Saudi arabia please don't do this because you are not killing your enemy you are killing your own brother","post_message":"The Saudi King says his country’s military operations against #Yemen will continue. Three days of airstrikes have killed over 50 people, many of them civilians. What do you think about the attacks on Yemen? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"},{"comment_id":"10153576684991323","commenter_b":"Life is harder for women? That's why they live longer on average than their male counterparts? :p Please. That generalisation is painful to read.","commenter_a":"\"... an air of misogyny among her predominantly male colleagues...\" Basically, trivial nonsense that women want to incessantly complain about as always. Guess what: circles of female friends/colleagues will ALSO make misandrist comments about their boyfriends and men in general. The difference? Their remarks are treated as levities and never deemed sexist, whereas men are pilloried for supposed misogyny. Double standards, anyone? Woman to her friends: 'No, I don't do any DIY. I get my man to do that!' (Socially acceptable). Man to his friends: 'No, I don't do any house cleaning. I get my woman to do that!' (Misogynistic).","post_message":"Sometimes leaving a job is easier than standing up to sexism – so what can women do about it?"}]
