[{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""},{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"10154246558899575","commenter_b":"I think she should have been charged with negligent homicide. She caused the child's death.","commenter_a":"Agree.","post_message":"The mother of a 2-year-old boy who fatally shot himself last month has been charged with neglect. Police say the child found the gun in her purse."},{"comment_id":"10153459295185927","commenter_b":"A radical MUSLIM!!!! Keep searching granny at the airport.","commenter_a":"We do NOT NEED gun regulation. We need ARAB regulation!!!! And we need HEARTS rehabilitated more than ANYTHING!!! We need GOD put back into our country!!! And along with God put back into every American's heart, we need a GUN put into every American's HAND!!!!!!!!!!!","post_message":"UN Human Rights Chief Zeid Ra al Hussein: the United States, however, there are hundreds of millions of guns in circulation"},{"comment_id":"10153798525078352","commenter_b":"She needs to be punched in her mouth","commenter_a":"she's just horny.","post_message":"VIDEO OF RACIST WHITE LADY SCREAMING NI@@ER AT KIDS GOES VIRAL AND SHE SAID SHE'S NOT SORRY FOR IT! (VIDEO)"},{"comment_id":"719757218174186","commenter_b":"So, @username. Please give me a source of information you've taken part of that doesn't promote the hoax. How many articles have you red? How many books? How many documentaries? You know how in a trial both parts are allowed to talk? The jury then have to consider which story makes the most sense and who has the most solid proof. So I take it you've studied both sides thoroughly before you decided it's a crazy tin foil hat theory? I mean, only a huge fool would believe they understood something without reading both sides. And you're not a huge fool now are you?","commenter_a":"Of course not, it's a Globalist hoax to control the world population even more and finance the World Government which is an essential part of the New World Order. The Chinese are in on it of course but don't know why he thought it was their idea specifically","post_message":"-_-"}]
