[{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"1188867387819383","commenter_b":"how about just stopping illegal immigration which brought it here in the first place","commenter_a":"Running a high powered fan inside, facing your entry door might help as you come in and out and might help them from entering your home and any that might be clinging to you!","post_message":"ZIKA is FOR REAL and it hits more than just PREGNANT LADIES @webpagelink"},{"comment_id":"1286627034690657","commenter_b":"Nope she will lose","commenter_a":"Hillary Clinton the next President of the United States.","post_message":"'WE HAVE A VERY SERIOUS PROBLEM' Hillary Clinton points out a striking divide in the criminal justice system in America during Sunday's NBC News-YouTube #DemDebate. Catch all the highlights here: @webpagelink"},{"comment_id":"1757840827811038","commenter_b":"Cindi, your an idiot. She is legal.","commenter_a":"She has bad health,think how much more will she take from we all to stay alive","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."}]
