[{"comment_id":"10154190661067541","commenter_b":"Now that's an ugly women","commenter_a":"Bannon you are a lot better looking than that thing in the left.","post_message":"Steve Bannon has a doppelganger, and her name is Rosie O'Donnell."},{"comment_id":"10152763408026717","commenter_b":"Let's threaten to slit the throat of little bitches, see how this Bitch feels","commenter_a":"Hes gay as well !","post_message":""},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"10153351201607439","commenter_b":"We the People have our lives going and We the People aren't the ones waging war on other countries. It's the government. They want to go to other countries and spend trillions of our tax dollars on them and try to get those mid east countries to be more civilized. Well, you can't teach a baboon how to talk and you surely can't teach these primitive thinking tribes to be civil. So the only thing they know is to try to rule the world and get the whole world to be on their level. As for that Boston Bomber mother.....your fu*kface son will burn in hell way before your 'people' get a chance to try to burn America down! And you'll be under ground too and will never see America burn. America's too strong of a Nation for that. Even with this Muslim president.","commenter_a":"Hey, your religion aint working.","post_message":"@webpagelink"},{"comment_id":"10154081618264087","commenter_b":"There's nothing wrong with her we all saw her open a jar of pickles","commenter_a":"Selfish move since her so called Pneumonia is very contagious . She was in a crowd, she hugged a small child. Not a good thing when you have Pneumonia.Just another lie, how can you believe anything the Clintons or their Clown say.","post_message":"\"I think it shows that she's not one who likes to call in sick.\""},{"comment_id":"10154360236166523","commenter_b":"He is not a queen","commenter_a":"He is a QUEEN. Only the packers can get dominated the whole 1st half and go into the locker room with the lead.","post_message":"Mr. Aaron Rodgers -- the Hail Mary King! via.fox6now.com/ZsBiQ"},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"}]
