[{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"685743394925463","commenter_b":"Someone just lock her up! Please!","commenter_a":"Hillary needs life","post_message":"The double standard..."},{"comment_id":"1832396510332680","commenter_b":"Should we really call it entertainment..I call it junk","commenter_a":"Why do you suppose Liberals love the entertainment biz and wanted control over it..it's one of their mainstream vehicles to get their agenda across...so much for entertainment anymore..","post_message":"“The music industry suffered a melt down on national television during the American Music Awards – launching into unhinged, profane tirades directed at President-elect Donald Trump and his wife, Melania,” Todd Starnes writes."},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"1100335149996537","commenter_b":"White people crossing the border are rapist and murderers","commenter_a":"I wish there was some way for me to give him a lift to Mexico","post_message":"Happening right now, police in upstate New York are going door-to-door, hunting for one remaining escaped prisoner from a maximum security prison. The two escaped nearly two weeks ago. The other was shot and killed by police earlier today. Much more tonight at 10."}]
