[{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"652304278301265","commenter_b":"Jeremy Kwan Matthew MacKellar Anthony De Ruijter have a look at urs its actually fooked","commenter_a":"Braden Shaw","post_message":"There's a hidden map in your iPhone of everywhere you've been."},{"comment_id":"526657100877562","commenter_b":"@username that's why I'm voting Jill Stein.","commenter_a":"I'd rather vote for the one who may have evaded taxes than the one who led the charge on foreign policies that killed millions of people and now possibly could cause WW3 by taunting Russia with the no-fly zone in Syria. But I digress...Jill Stein is who I'm voting for because I don't vote for monsters.","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"838829739577213","commenter_b":"Yes! They should be arrested!","commenter_a":"As long as it includes under God!","post_message":"This is disgusting. Do you support the Pledge of Allegiance?"},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."},{"comment_id":"1247455158641980","commenter_b":"She's such a nasty woman!","commenter_a":"guess she needs to be held for terrorist threats","post_message":"MADONNA Tells Feminazis At DC #WomensMarch: \"I Have Thought an Awful Lot About BLOWING UP The WHITE HOUSE\" [VIDEO] @webpagelink"},{"comment_id":"10152829318850667","commenter_b":"I concur, Josh! Emimen is a great rapper and I don't recall him ever saying the word. I could be wrong, but I don't recall it. I don't like the word used by any person but it definitely should not be said by him.","commenter_a":"You have the right to say whatever you want. The question is, do you have enough respect for others to know you shouldn't?","post_message":"Rapper Chet Haze, the son of Oscar-winning actor Tom Hanks and actress Rita Wilson, says that the slur is part of hip-hop culture and that he has a right to say it."}]
