[{"comment_id":"10153305166698984","commenter_b":"Please! Just let her go away!!!!!!","commenter_a":"18 U.S. Code 2071 - Concealment, removal, or mutilation generally (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States, shall be fined under this title or imprisoned not more than three years, or both. (b) Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the ...","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign... Do you hope Hillary loses?"},{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."},{"comment_id":"1277469425634935","commenter_b":"Oh yeah she must of smoked weed. Pshhh... don't be a dummy. Ppl don't smoke weed and drive in the wrong lane. If that were to be true millions off Ppl would be headed the wrong way. This lady was off her rocker I highly doubt it's do to weed or alcohol.","commenter_a":"Yeah legalize marijuana... will get more cases of wrong way drivers. But that's okay as long we have our freedom. That was a sarcastic remark. No to drunk driving no to marijuana no to drugs","post_message":"WRONG-WAY DRIVER: It's happened again -- DPS troopers used stop sticks to stop a woman who led them on a wrong-way freeway chase that began in Phoenix and ended in Mesa. Thankfully, no one was injured. STORY: @webpagelink"}]
