[{"comment_id":"10154170958189586","commenter_b":"Ouiii","commenter_a":"@username on dirait misha","post_message":"Wait until you see Rupert's face when he discovers #vegan nachos. All rats should be this happy! #StopAnimalTests #WW4AIL"},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"1180471822029044","commenter_b":"Because she was high as a kite!","commenter_a":"WDF is this?","post_message":"Now this is funny."},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."}]
