[{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"443280275797013","commenter_b":"Its not just the cops with thug goggles on. The actions of blacks in Ferguson and Baltimore do nothing but reinforce that view. Racism, disrespect of laws and common decency toward others and their possessions, just begets more of the same focussed in the opposite direction.","commenter_a":"You are so racist against white people it's not funny.","post_message":"As a news team, we are not agreeing with either side of this photo as a philosophy but sharing it for perspective and as a piece of artwork which should generate honest conversation."},{"comment_id":"10153513325884614","commenter_b":"Brianna Paino","commenter_a":"I was told so it maybe BS. There is no law stating what direction the car is to be pointed. Say backing up in a lane at a stop.","post_message":"Dramatic cellphone video captured a dangerous scene in the Hollywood Hills: an Audi driving backwards for miles on a narrow and windy stretch of Laurel Canyon. Kevin Zanazanian, who shot the video, told KTLA the stunt jeopardized the safety of pedestrians and motorists. He said he recorded it for safety reason. After the video was uploaded to YouTube, the Los Angeles Police Department said it was investigating the incident and working to identify the driver, whose identity remains a mystery. Read KTLA story here: @webpagelink"},{"comment_id":"10152777493386130","commenter_b":"Ya. Clearly, women want nothing more than to \"trap\" some real prize catches around here. Give me a break.","commenter_a":"this is great. Now men are less likely to be victims of the tramps who lie about birth control and crazy GFs who try to lock their men in.","post_message":"We're looking at you, gentlemen."},{"comment_id":"10153054360324411","commenter_b":"your wicked..i no longer have remorse for your kind....it is a tare...to be pulled up by the roots to be shoveled in a lake of ever lasting fire........you can't raise yourselfs up above nothing but killing......it is of old......you want this earth to yourselves.......its not going to happen...like sands in the hour glass ...........your time is short...","commenter_a":"brain washed .........or is it ..in their seed ?","post_message":"URGENT: Pakistani police use tear gas against anti-#CharlieHebdo protesters near French consulate in Karachi"},{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"617179595103961","commenter_b":"She is SUPER PREDATOR HERSELF","commenter_a":"$illary🐍🐍🐍🐍🐍 in the grass she will do any thing say anything to win ... Oh ya she already has","post_message":"This Video SHOULD Cost Hillary Clinton The Black Vote"}]
