[{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"1090368724307930","commenter_b":"Women fought for many, many decades for the right to vote.","commenter_a":"Yay, and now we will get to vote in an awesome woman as president!","post_message":"The United States is 239 years old. Women have been able to vote for only 95 of those years."},{"comment_id":"964259683612268","commenter_b":"get them the hell out of our usa we dont want them here,take that scumbag obama with you.","commenter_a":"Probably headed to the Democrat Registration Office.","post_message":"Oy vey."},{"comment_id":"10153247018494087","commenter_b":"Bad cars cause people to die so do the bad guns!","commenter_a":"Yes it is Donald! The libs are too stupid to realize it! Look at Chicago, the more gun control, the more shootings.","post_message":"“The gun laws have nothing to do with this,” Donald J. Trump said. “This isn't guns, this is about really mental illness. And I feel very strongly about it.\""},{"comment_id":"10156372463505354","commenter_b":"OMG that laugh of hers is so annoying and she is a ugly old bitch! Carley is so much more a women than Hillary could ever be and much more knowledge than the old hag. She let four Americans die in Benghazi she should not even be able to run for President and her emails and her and Bills Clinton foundation fiasco I could go on !","commenter_a":"She is sick","post_message":"*DEMOCRATS' WAR ON WOMEN* Remember how the liberal media EXPLODED when a questioner asked Trump about \"Muslim Obama\"? Well, look at THIS..."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."}]
