[{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"10153791461399607","commenter_b":"No the home owners are getting a 10 yr break on property taxes. Look up Eager Park Townhomes.","commenter_a":"Who the hell can afford it, hell I bet the city will hit you with a $5,000 a year property extortion, I mean tax..","post_message":"Johns Hopkins University is offering a $36,000 incentive to employees to purchase a home in the new Eager Park neighborhood in East Baltimore through its \"Live Near Your Work\" program."},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now. ~tiff via Occupy Democrats"}]
