[{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"10153724163922452","commenter_b":"A black woman would have been acting up and resisting the officers. Did you SEE how the lady DID NOT act stupid? She OBEYED. It's really that simple.","commenter_a":"If this was an African American she would have been roughly handled, beaten b/4 forcefully taken into custody ..#basedonwhat #how #ihaveseenthemdoonTV# God please help us...Amen","post_message":"A woman led authorities on a chase through Los Angeles, Orange and San Diego counties that lasted more than two hours. @webpagelink"},{"comment_id":"10152700132182434","commenter_b":"Also, can I state for the record Sansa had a good idea she would in fact have to have sex that night, but it's the only way to get her revenge on the boltons. She had a choice to get into the family, Littlefinger gave her one, but she chose to do this. This is fucking Westeros, people, hell, in many states in the US a husband can't rape his wife.","commenter_a":"i'd like to point out that Danaerys' rape occurred in the same way as Sansa's and had a lot to do with her character development","post_message":"Whoever titled last night’s episode of Game of Thrones “Unbowed, Unbent, Unbroken” has a grim sense of humor and solid sense of irony."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"453827754807805","commenter_b":"HELL YES!!! NOW THEY TRYING TO TAKE THE ONLY. GOOD FAMILY ORIENTED. ON T V TRYING TO GET GOD OUT OF EVERYTHING. THESE. PEOPLE ARE NUTS","commenter_a":"Yes","post_message":"Do You Support Keeping Duck Dynasty On TV? Comment 'yes' or 'no'."}]
