[{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""},{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."}]
