[{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"10153658944994726","commenter_b":"Hillary grow up and stop the whining!You are worth $2 millions! or billions?","commenter_a":"What a Dumbell","post_message":"WATCH: Hillary: I’m an ‘Outsider Candidate’"},{"comment_id":"517159568465923","commenter_b":"Actually Humphrey already had it wrapped up","commenter_a":"One of the saddest days in our nation's history. I have no doubt he would've won the nomination and the election. I was only 12, but remember it like it was yesterday.","post_message":"RFK's loss still being felt."},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."},{"comment_id":"10153828594101135","commenter_b":"Ignorance at its best","commenter_a":"losers go back to the burbs","post_message":"Supporters of Donald Trump are gathering for a \"flash mob\" on the Wayne State University campus - where Hillary Clinton is scheduled to speak later this afternoon."},{"comment_id":"10153221106178812","commenter_b":"She'll get life,","commenter_a":"Lord She Need God In Her Life!","post_message":"JUST IN: Court again declares mistrial after hung jury in sentencing retrial of Jodi Arias - @webpagelink"},{"comment_id":"10155350061090231","commenter_b":"He couldn't shoot him in the leg and let him live?????","commenter_a":"Did he sprinkle crack on him before calling it in?","post_message":"BREAKING NEWS: Video shows SC police officer, Michael T. Slage, shooting Walter L. Scott, 50, in the back as he fled."}]
