[{"comment_id":"860168877353787","commenter_b":"She has such a nasty attitude and doesn't try to hide it. Very haughty woman.","commenter_a":"She looks like she's giving him attitude. Why's does she always have \"that\" look on her face when she looks at whites and anyone else she considers below her?","post_message":"Caption this photo in the comments! ...... Former President George W. Bush and first lady Michelle Obama speak before President Barack Obama delivers a speech and takes a symbolic walk across the Edmund Pettus Bridge. (AP Photo/Bill Frakes)"},{"comment_id":"10153481286598984","commenter_b":"Let's get this evil son of ? Out of office","commenter_a":"Wake up America Obama has an agenda and he is working it!","post_message":"This DHS agent just admitted the truth about Obama's disturbing agenda... so Obama sent his officials to do something terrible to her DAUGHTER. What do you think?"},{"comment_id":"10154038920644091","commenter_b":"Ladies! Do your thang...","commenter_a":"he can save me any day. 😍","post_message":"One thankful New Yorker expressed his gratitude to the NYPD and New York City Fire Department (FDNY) with free coffee and treats."},{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"1779050492377737","commenter_b":"She can suck a large hot dog my dog is smarter than her","commenter_a":"He can sue her and make her prove it.","post_message":"Star Wars actress Carrie Fisher speculated Sunday night that Donald Trump’s occasional sniffling during the second presidential debate stems from the fact that he is “absolutely” a cocaine user..."},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week. Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."}]
