[{"comment_id":"994492227347127","commenter_b":"Where is sound. Its just like showing a 360 picture.","commenter_a":"Watching from Yorkshire","post_message":"We were live at the demolition of one of the UK's tallest buildings. The Grain power station in Kent came down at approximately 11:00BST. Do you live in the area? Were you happy or sad to see it go? (Skip to 10 minutes in for the demolition moment)"},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"},{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."},{"comment_id":"750864925104085","commenter_b":"with OUR money !!","commenter_a":"Absolutely","post_message":"Obama Caught Red Handed Financing Mosques Around The World He has been hiding who he is for his entire presidency. Do you think Obama is a Muslim?"},{"comment_id":"917736131581794","commenter_b":"If she wants us white people to die bring it I'm locked and loaded she ain't got the balls to","commenter_a":"Now who's the racist.","post_message":"I'm sorry, what?!"},{"comment_id":"1851627945062122","commenter_b":"Rosie would hate it if her wife has a pic out there like Melania's and she were compared to other lesbians, just saying","commenter_a":"Rosie lacks any semblance of class... what a hateful, mean thing to do. Thank you God that Trump is our next president! This left wing ugliness is hard to take..","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"}]
