[{"comment_id":"1036357393060980","commenter_b":"Criminals are cowards and go for easy prey. Doubt one is going pick a fight with someone who will shoot back. Use your head Raymond","commenter_a":"Welp, the criminals will know who to shoot first.","post_message":"AROUND TEXAS: The Texas Senate gave preliminary approval Monday to a measure that would make the Lone Star State the largest in the country to allow licensed open carry of handguns. Would you support the right to openly carry in Texas? MORE ---> @webpagelink"},{"comment_id":"1072091946219346","commenter_b":"Loooool she's just a hoe","commenter_a":"@username its that deep","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10153229329259087","commenter_b":"Check out this bitch","commenter_a":"Oh, a little tidbit that maybe Trump supporters don't know: Trump's current wife is a former almost porn star and underwear model for a wife. Yep, just what we want in the FLOTUS! Someone that EVERYONE can know and see what she looks like naked, and on all fours... TRUE","post_message":"GOP presidential front-runner Donald J. Trump went on the offensive on Thursday morning, attacking cable networks for treating him unfairly, slamming several presidential rivals as \"shrill\" and inexperienced, and pushing back on Pope Francis's opinions on climate change and immigration."},{"comment_id":"1370922502927793","commenter_b":"If she could somehow flood NYC with illegal aliens then yes, she could be the next mayor.","commenter_a":"Gitmo for Life for High Treason and we aren't talking emails","post_message":"After winning New York with 1.7 million more votes than Trump, could Hillary's next move be mayor of the Big Apple?"},{"comment_id":"685160361665842","commenter_b":"She must have needed something to have married this turtle.","commenter_a":"His wife will head transportation dept. or something. She is anti-union and for big corporations. Family does Business abroad. Her family gave turtle face around 25 million.","post_message":"Astoundingly dishonest."},{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""}]
