[{"comment_id":"554679601385273","commenter_b":"Just look at that fugly face! Barf","commenter_a":"What an ugly dude!","post_message":"Of course Sally Kohn brought up white privilege..."},{"comment_id":"1698278530442016","commenter_b":"We need to plan a gathering this summer","commenter_a":"@username where are you?","post_message":"Your Monday just got better. Today is National Margarita Day."},{"comment_id":"10154241642885579","commenter_b":"@username And lucky for you Canadians, you have Justin Trudeau and Chrystia Freeland. They are both young, sensible and bright.","commenter_a":"I'm 73 years old and this is the strangest election I've ever seen in my life. It's scary as hell and I want to move , but nowhere to go. This is the demise of the country that has been predicted for decades. Going under , folks. It's been fun while it lasted.","post_message":"Marco Rubio: \"And so, while it is not God's plan that I be president in 2016 or maybe ever, and while today my campaign is suspended, the fact that I've even come this far is evidence of how special America truly is.\" Watch full speech here: @webpagelink"},{"comment_id":"1048532555215895","commenter_b":"What a sicko. she needs to be either arrested or locked up somewhere.","commenter_a":"Someone should sew her legs together..better still use lots of super glue, she needs to suffer s little.","post_message":"Woman: “I’ve Had Five Abortions Because I Love Getting Pregnant But Don’t Want Kids”"},{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"10153333368109705","commenter_b":"Maybe more like 12, but the whole \"space age\" thing they started with \"i\" everything is tired. Heck, even their naming scheme. About the only difference today is they do most things in aluminum instead of white plastic, but it still has the same design queues. But who can blame them? When you have so many people branded to buy your products without blinking, change would be scary.","commenter_a":"Let's hope so. Apples design has been stale & stagnant for the last 15 years. For a company who is lauded for it's design, I can't believe It's gone this long without some fresh blood or new design ideas.","post_message":"Jony Ive just got promoted to Apple's C-suite. Here's why it might be his first step toward the exit door."},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."}]
