[{"comment_id":"10153798525078352","commenter_b":"She needs to be punched in her mouth","commenter_a":"she's just horny.","post_message":"VIDEO OF RACIST WHITE LADY SCREAMING NI@@ER AT KIDS GOES VIRAL AND SHE SAID SHE'S NOT SORRY FOR IT! (VIDEO)"},{"comment_id":"10155252266929411","commenter_b":"Wheres the music coming from?","commenter_a":"77","post_message":"#1917LIVE: The sun sets on the Russian Empire Romanov rule is collapsing. Martial law imposed in #Petrograd. Authorities fear violence can erupt anytime. Russia is like a boiling cauldron, that can explode at any second. Follow #1917LIVE - Retweet the Revolution @webpagelink @webpagelink/ 27.02.2017"},{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"10154859585584726","commenter_b":"Unfortunately in the eyes of progressives the answer is no. Meanwhile a slutty whore like Madonna can sell anything and everything she wants.","commenter_a":"Boy what hypocrites we have in show business. The left is losing it and it is getting really old!","post_message":"Can't a guy sell what he wants to sell?"},{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"566696260200553","commenter_b":"They can go now","commenter_a":"Hope she goes","post_message":"It appears Bill and Hillary Clinton are making plans to flee the country to Qatar in the event Donald Trump wins this election."}]
