[{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"},{"comment_id":"1073645179326169","commenter_b":"^^^boom^^^","commenter_a":"Christian's don't commit Adultery Hypocrites Do God is Revealing what is done in the Dark. Nothing is hidden from God","post_message":"DEVELOPING: Possibly Millions More Christians Have Committed Adultery Using Ashley Madison Than Previously Thought. #FallingAway #AshleyMadison"},{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"},{"comment_id":"10153509665060950","commenter_b":"I'm sorry but that doesn't even sound right. The solution that they put the fetus in does not destroy it. If that was the case every placenta, product of conception, etc, would be destroyed! Most product/tissue that comes from one's body goes into some sort of formalin. And about them giving you back tissue/poc, that will never happen. I don't believe any hospital will be like oh here, you can have your 19 week demised fetus. It's not going to happen.. That's like saying you want your uterus when they take it out. Someone told you a load of crap if that is really what transpired.","commenter_a":"I find that hard to believe. They have protocols to follow when it comes to medical waste. Right? (I honestly believe they do)","post_message":"The woman claims as she screamed for the employee to stop, she could see the face of her child as it was flushed."},{"comment_id":"1179417458812166","commenter_b":"The apple didn't fall far from the tree. She is just as dumb as her momma lol .","commenter_a":"They didn't have a plan besides the same tired failures the current admin did and her daughter is just as fugly as Nancy .","post_message":"Nancy Pelosi's daughter went full-on crazy during this Friday Fox interview..."},{"comment_id":"10154308446053984","commenter_b":"Unfortunately there is no share here or I would share it. Hate that lying crazy woman. Thanks for that info.","commenter_a":"This piece was copied from another post. It can be found on you tube in something called The Clinton Chronicles. If you're under 50 you really need to read this. If you over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Y Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood both were forced to withdraw their names from consideration. Next she chose Janet Reno husband Bill described her selection as worst mistake. Some may not ...","post_message":"Democratic presidential front-runner Hillary Clinton just revealed that she believes Americans have too many guns in their homes, and I don't think one would have to take too wild of a guess as to what she would do about it if elected president... Do you think a Hillary presidency would be bad for America?"}]
