[{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"636469079877004","commenter_b":"Send her back to her own country so she can mooch off of their welfare system, not ours! We have more than our fair share of moochers as it is!","commenter_a":"Send her back really quick........","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10158575805875354","commenter_b":"We also need to find and prosecute people with fake social security numbers. Illegals have admitted to buying them.","commenter_a":"Then pass voter ID laws in every state. I understand not wanting to spend money but I am tired of this arguement every election. I want to have peace of mind knowing that it is only We the people voting.","post_message":"Senate Majority Leader Mitch McConnell (R-KY) said he would not spend federal funds investigating voter fraud in the 2016 election..."},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"1097322517004941","commenter_b":"#LockHerUp","commenter_a":"Hillary Clinton is a Criminal, who should be in prison, not running for office!","post_message":"\"I think my whole life has been about handling pressure. I think I have a great temperament for winning, 'cause I know how to win.\" Donald J. Trump argued that in comparison, Hillary Clinton is \"a loser\" who \"doesn't know how to win.\""}]
