[{"comment_id":"10153740918402217","commenter_b":"Good for the women!","commenter_a":"Or are they being left to clean up the rubbish left by the men? When it all goes wrong, people of the masculine variety will blame the women when it was 3 of their number who screwed it up in the first place!","post_message":"It may be a watershed moment."},{"comment_id":"994031577299051","commenter_b":"scumbags who cross the border are exactly that illigal criminals who purposely defy US laws. The wall just got taller.","commenter_a":"Keep your citizens and residents on your side of the border. When I travel to Mexico, I have to fill out paperwork. To get back into the United States, I have to fill out paperwork. It is unacceptable that someone can come into this country through Mexico without having filled out anything and no record of them in existence while they're here.","post_message":"Vicente Fox Quesada: \"I'm not going to pay for that f---ing wall.\" Donald J. Trump: \"The wall just got ten feet taller.\" Presidente Enrique Peña Nieto: Trump has damaged the relationship between the U.S. and Mexico."},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"},{"comment_id":"10153546398404071","commenter_b":"my baby","commenter_a":"avoiding to say that but still im homeless","post_message":"Millionaires never say these things — and you shouldn't either."},{"comment_id":"1033391136683934","commenter_b":"Dee I'm not a violent women, however I would love to bitch slap you. Sorry but I'm tired of idiots like Dee. Yes Dee it's called artificial insemination. I highly doubt anyone doing this would get an abortion.","commenter_a":"That MOTHER LOVING USED ASS WIPE thinks EVERYONE should WORSHI{_ HIS GODDESS, Ayn Rand, and that EVERYONE should be SELF-SUFFICIENT. Oh yeah, He is ADDICTED to TAXPAYER-FINANCED salary and TAXPAYER-FINSANCED health care. HIS ROTTEN KIDS would STARVE if he weren't a USELESS, WORTHLESS MOOCHEZR. Maybe HE would like to pay for all of the unwanted pregnancies.","post_message":"Did Speaker Ryan just go there on Planned Parenthood?"},{"comment_id":"1109370075781392","commenter_b":"@username, do you think the military being forced to lower their standards to allow females into front line infantry units is a good thing? The Marine Corps did numerous studies that show infantry units became much less effective when women were added. Currently, a special forces Sgt. is being court martialed and will be less than honorably discharged because he confronted an Afgan police officer and pushed him to the ground because he was ongoingly raping a little boy- that's a good thing? Our veterans are literally dying because they are having to wait for treatment from the VA - that's a good thing? A lot of great officers are being let go and forced out because they don't agree with Obama's policy's....that's a good thing? The current ROE's tie soldiers hands and put them in danger. The morale is at an all time low....things are not good. THis plus ...","commenter_a":"Our military is second to none! The only people questioning the readiness of our military forces are Republicans! There isn't one nation on the planet that wouldn't trade to have both our military personnel and equipment! So stop perpetuating a political lie in the hopes of portraying President Obama as un-supportive of our troops and military leadership!","post_message":"When President Barack Obama took office, he inherited a professional, world-class, battle-toughened military. Seven years later, many experts see the U.S. armed forces as a tattered and demoralized organization. In a special 'Fox News Reporting - Rising Threats - Shrinking Military,' Bret Baier investigates what Obama has done with – and to – the military. Don’t miss it Friday at 10p ET on Fox News Channel. @webpagelink"}]
