[{"comment_id":"1174393302606728","commenter_b":"I want my money back it is ugly and doesn't make her any better","commenter_a":"She could wear a 100,000 and it wouldn't help her looks","post_message":"Woman of the People"},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"1160841880602656","commenter_b":"Hello! Women pay taxes too!","commenter_a":"Not all bills in the House of Commons or Senate passes. This is a terrible bill, one that I wish not to pass. Our national anthem is fine the way it is, and does not need changing what so ever. The Honorable Member's health decline has nothing to do with this bill, and that headline is terrible to use. You wouldn't use the word healthy on any Honorable Member in the house, then why use his health attached to the bill?","post_message":"\"What a shame!\""},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10153119045143145","commenter_b":"You are actually showing your colors, stop trying this woman about race card when it was all about race.","commenter_a":"She was stupid and uncooperative. Why didn't she just do what they asked her instead of acting like a complete assh*le.","post_message":"This woman got into a road rage argument in a school parking lot. Then this is what happened when police arrived. #WFTV WATCH THE VIDEO: @webpagelink"},{"comment_id":"10155210015483132","commenter_b":"What about him he deserves a good women she's nasty","commenter_a":"Good for her! She deserves a good guy","post_message":"Things are heating up between Valentin Chmerkovskiy and Amber Rose!"},{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."}]
