[{"comment_id":"10154551778899411","commenter_b":"@username You are a troll ass bitch.. You are as disgusting as the photo of your ass in your profile.. punk...","commenter_a":"I wouldn't get \"teary\" about it. Lol. Trump is digging his hole deeper and deeper the more he opens his big know nothing mouth! This draft dodger accepted a purple heart from a Vet who \"earned\" it which is as low as you can go. Than after that he kicks a crying baby out of his event. Trump will do himself in without anyones help!","post_message":"Mr. Smith told news.com.au that Mr. Trump's \"fat pig\" comment illustrated a \"darkness in his soul.\""},{"comment_id":"10158012155960354","commenter_b":"Prosecute her! Drain the swamp!","commenter_a":"lock donna brazil up.........","post_message":"“Stealing valuable proprietary confidential information is illegal, and debate questions are highly confidential,” said Ken Sukhia, who served as United States Attorney for North Florida and who has prosecuted numerous white collar crimes."},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"1011455315580612","commenter_b":"Is this guy a republican?","commenter_a":"Ignorance perpetuation personified!!!!!","post_message":"This guy is a complete moron."},{"comment_id":"10154618806016336","commenter_b":"WHY THE IRAN DEAL IS A MONEY LAUNDERING SCHEME CREATED BY THE CLINTONS AND CARRIED OUT BY OBAMA: Our economy is worth billions if not trillions of dollars, annually. The Clintons are incensed at Americans and think they are trolls or deplorable or predators or worthless. What the Clintons really desire is to add to their greedy pot of wealth built on the backs of slaves; modern day, contemporary slavery which includes a melting pot of all races. TRUTH: Hillary's economic plan seeks to further these greedy ambitions of gain and puts all of America and every American citizen at risk. By allowing an influx of immigrants including the 11 million (maybe astronomically more) to stay illegally, unconstitutionally, your wages will decrease or stagnate while your costs of living rise: You will be forced to compete with these new immigrants for housing, your prices on everyday purchases will rise, over ...","commenter_a":"Trump founded Racist Birtherism","post_message":"A senior ISIS leader was killed earlier this month in a precision strike near the Syrian city of Raqqa, a U.S. official told Fox News."},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"}]
