[{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"750864925104085","commenter_b":"with OUR money !!","commenter_a":"Absolutely","post_message":"Obama Caught Red Handed Financing Mosques Around The World He has been hiding who he is for his entire presidency. Do you think Obama is a Muslim?"},{"comment_id":"10153703339506509","commenter_b":"Hillary will be in jail before she ever becomes president!","commenter_a":"the entire republican party is a joke","post_message":"Rick Santorum officially announces that he's running for president. @webpagelink"},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"10153845270776167","commenter_b":"Joe make up your mind, can't have it both ways.","commenter_a":"Joe. That's the dumbest lie You've told. And that's sayin somethin","post_message":"Even small children would call this excuse nonsense."},{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"}]
