[{"comment_id":"10153973401955329","commenter_b":"Steven David buy me this!","commenter_a":"Mallorie PaigeBusby Jonathan Busby lol","post_message":"I'd much rather be sleeping right now."},{"comment_id":"1056310464431070","commenter_b":"AND THERE WILL BE MORE THANKS TO OBAMA AND CONGRESS","commenter_a":"Just kill him","post_message":"BREAKING: ACTUAL ISIS FIGHTER ARRESTED IN SACRAMENTO: Aws Mohamed Younis Al-Jayab Lied To Immigration Authorities ISIS is in the USA! We need TRUMP 2016 to eradicate them! @webpagelink"},{"comment_id":"992725720849341","commenter_b":"Who cares what they want........I hope every single one of those sniveling, useless, A-holes leave!!!!","commenter_a":"Who cares","post_message":"They really don't want Donald Trump to be president."},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."},{"comment_id":"10153851640243984","commenter_b":"Fire that going bitch","commenter_a":"Isaiah 5 : 20 ~ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!","post_message":"This young Texan is standing up for her religious beliefs BIG time after her teacher tried to force students to deny that God is real, and threatened them with failing grades if they did not. Do you support this young girl for taking this stand?"},{"comment_id":"10153575697359087","commenter_b":"I love American Politics... Hillary Clinton is the People's Champion yet she Support the 1994 Massive Incarceration Bill, the 1996 Welfare Reform that double poverty in America between 1996-2001, 1999 Glass-Steagall Act which caused the 2008 Financial Collapse and NAFTA which as a result 70,000 Factories and millions of Jobs have gone Overseas... But hey she can't be judge on her RECORD because she is a Woman and that would be SEXIST...","commenter_a":"This is a garbage article by not even mentioning Bernie Sanders.","post_message":"\"Donald Trump versus Hillary Clinton in November? Don't bet on it.\""},{"comment_id":"1304157179622515","commenter_b":"Is there any difference at all in Trump utilizing Twitter and Chinese Commie rulers using a a newspaper as their mouthpieces? What does China have that we don't have besides lots of bodies? The best thing they know how to produce is garbage.","commenter_a":"China, wallstreet, and our own government have been pissing down our collective backs for years, and telling us it's good for us because it's just rain.","post_message":"That's quite a bark, but do they have the bite to back it up?"}]
