[{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"1788948718006323","commenter_b":"Scumbags","commenter_a":"lol. Morons.","post_message":"Democratic Rep. Karen Bass of California labeled semi-automatic rifles \"weapons of mass destruction\" Wednesday."},{"comment_id":"1221649794521715","commenter_b":"Thats not how a hoe talks to a pimp literally in this case","commenter_a":"He's just trying to cover his own butt.....","post_message":"The owner of the Nevada brothel where Lamar Odom was found unconscious says Khloe Kardashian's publicist has asked him to stop speaking to the media — a request that made him furious."},{"comment_id":"984289534964128","commenter_b":"Easy. Stop all benefits to foreigners.","commenter_a":"Foolishly, in October 2014 Italy left-wing government became the first European Union country to decriminalise illegal immigration and deploy its navy at huge expense to save migrants crossing the narrow Sicilian channel in open boats from North Africa (Libya mainly) in order to bring them to Italy and thus the European Union where most remain. The policy change, driven by a perverted mix of human decency and political correctness, was pure folly: it has acted as a green light to wannabe boat people everywhere, whose numbers soar as the chaos in Africa and the Middle East escalates. The result is an exodus of biblical proportions out of Africa and the Middle East into Europe. The Welfare System in Britain and Ireland is the main attraction for these illegals. Action needs to be taken now to STOP this Exodus!!!!!","post_message":"Forget the Greek crisis or Britain's referendum, this wave of migrant's is Europe's biggest threat"},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"},{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"}]
