[{"comment_id":"472965199559859","commenter_b":"I'd be packing my bags headed for Ecuador.","commenter_a":"If hell freezes over and Trump actually wins the White House, I forecast that the USA will see the largest mass exodus of the intelligentsia class of citizens in the history of our country. Those people capable of using 3-4 syllable words including researchers, doctors, teachers, scientists, and engineers will not be able to stomach the idea of a golden haired baboon driving the nail into the coffin that was once the United States of America. May God have mercy on us.","post_message":"Donald J. Trump: \"Happy #CincoDeMayo...I love Hispanics!\""},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"1005063259586728","commenter_b":"I don't mean In Syria. Whatever safe country they might be in. Buy them something Since ur gov has voted against letting refugees in the USA.","commenter_a":"Or buy them a home where they are.","post_message":"Kudos to Moore for taking a stand in the name of American compassion."},{"comment_id":"1626581144301352","commenter_b":"Amy shular should just go do porn. Nothing else it will shut her pie hole with a dick in her mouth.","commenter_a":"Of course they won't leave. They won't be treated like \" royalty\" ( said sarcastically ) anywhere else 😩😩😩","post_message":"It was only a matter of time..."},{"comment_id":"10154392424871130","commenter_b":"She has always been irrelevant!","commenter_a":"She is a Kellyanne wannabe. Open mouth, speak without thinking, non-stop, digressing, interrupting and not letting anyone else start or finish a thought. Hopefully very soon all of these people will be irrelevant.","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"1241124305907597","commenter_b":"Mexicans R not the enemies! The Enemies come with visas on Air planes! They are already here! Keep bringing refugees! From overseas!!","commenter_a":"Trump will secure our borders!","post_message":"The New York Police Department said it dispatched its \"critical response group\" which is equipped with high-powered weapons, and other security to crowded areas of the city."}]
