[{"comment_id":"10153735845537144","commenter_b":"The dog having a home is the goal isn't it? This woman didn't know the dog, she might not have liked it. The dog could have hated her. Yeah, the governor had an advantage and the guy's not my favorite. However, this whiny woman sems too needy and I'm not at all sure I would trust her to care for a pet.","commenter_a":"Another entitled old white guy. God how I despise his ilk.","post_message":"What. The. Hell."},{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."},{"comment_id":"10154208001624497","commenter_b":"an improper whore","commenter_a":"I'd recommend an 8 ball of crack and a proper whore","post_message":"\"Every reasonable alternative has been examined and exhausted; every rational avenue, from acupuncture to chocolate, explored to no avail.\""},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153477964755575","commenter_b":"I'm in true awe at how people react to situations. I am physically sick at what these murderers are doing and GETTING AWAY WITH IT. What kind of people are we to sit back and let the government ruin our lives. You saw, as Americans, how much power we have when Megyn Kelly attacked Donald J. Trump. Why aren't we furious about ISIS and demanded our government eliminate them all. obama has done an excellent job on turning American people against one another an will continue to do so as long as WE allow it. Its time people. Stand up and voice your opinion and tell obama that this is WRONG. WE have the Power......Use it.","commenter_a":"This crap needs to be stopped, let the Marines do it...","post_message":"The Gateway Pundit - ISIS Kidnaps Priest, Kills Him, Cuts Him into Pieces, Packs Him in Box and Sends Him Back Home"},{"comment_id":"10154040346806162","commenter_b":"Low life POS!!!!","commenter_a":"Sad how you kill your own child u will rotten in jail rip","post_message":"FAMILY MURDERED: A man is accused of killing his 2-year-old daughter and her mother over child support: @webpagelink"}]
