[{"comment_id":"10153559486711130","commenter_b":"Shut that slave hole down.","commenter_a":"And another.... 💔","post_message":"This is the third whale that has died this year at the park."},{"comment_id":"10152836781859117","commenter_b":"Couldnt agree more. My sister had to go take a nursing exam the day after her 6 year old son died. Then missed the following exam for his funeral and had to make up the days the following weekend. If this bitch wants sympathy she can look in the dictionary between shit and syphilis.","commenter_a":"She is full of shit and her so called \"crippling anxiety\" is also a mound of shit.","post_message":"Brace yourselves for what might be the most frivolous higher education lawsuit of the century."},{"comment_id":"438540092994538","commenter_b":"Ron i understand....however Im still not tryin to make excuses but im a single homeowner with a mortgage that works full time and has the same bills as everyone else. I wanted it bad enough and i found a way to do it. If anyone wants it bad enough then they will find a way to sacrifice for the time being. Only reason i origanally commented on this post is because i am proof that a lil sacrifice and hard work pays off. I gave up alot for the year i went to school. Most people will just \"omg i cant give all that up, eh ill just work at a crap job and complain and expect to get things handed to me.\" What bothers me is the sarchasm and name calling ive gotten here from some people haha. Ur the ones that want things handed to you probably!! Stop ...","commenter_a":"Or?? How bout it means get off ur butt and try to better yourself....","post_message":"Let's aim for a living wage."},{"comment_id":"10153086528067061","commenter_b":"Ban idiots. Not guns","commenter_a":"\"Guns aren't the problem - people are\"..nope, stupid freaking people being allowed to get guns seems to be the problem...and it needs to be addressed and remedied. People suck more every dang day","post_message":"DEVELOPING: TV station says reporter and photographer dead after gunman opens fire during live report in Virginia. What we know so far: @webpagelink"},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"1825065494398013","commenter_b":"the people actually running for president and the SUPPORTERS of those candidates are two different things, dillan.","commenter_a":"The party of old white people is starting to show it's age","post_message":"BREAKING: 'I'm going to run in 2020. For president'"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"}]
