[{"comment_id":"911884798904575","commenter_b":"\"I guess if you favor the right, the debt will grow, more jobs will be lost\" - The current President who is on the left raised the debt more than every other President combined. You acknowledge that there can be different factions on the left but not right apparently as well. If your main concern is the debt then you should lean more conservative as the primary goal is financial stability. Bush was not a conservative btw, he was more liberal. The main difference in policy between Obama and Bush (and possibly both parties in general atm) is \"what\" they wanted to spend money on but they both want to spend as much as they can get away with. I also do not accept your copy and pasted answer to Octavio's question. A definition doesn't tell anything. He's asking where you see the differences. It's also dishonest to call America ...","commenter_a":"Socialism works, as designed by the Founding Fathers, all of whom were socialists.","post_message":"Republican liar: 1 Bill Maher: Infinity"},{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10153014301039205","commenter_b":"@alex you're fucken stupid saying illegals don't have a place in the U.S. We ALL are fucken immigrants idiot , what about the Chinese gangs and Russian mobs ? What about them ? What about the KKK and other racial groups who commit crimes ? It's not just us MEXICANS who are illegal it's EVERYONE , If anything the natives founded this land and the rest are immigrants .. Smdh","commenter_a":"Who's fucking side are y'all on? Trump may not be the nicest kid on the block but we are talking about a Drug Lord in a very dangerous drug cartel. Is yalls hatred that much for Trump that you support a drug cartel boss killing him?","post_message":"The FBI is now protecting Donald J. Trump"},{"comment_id":"897220707004345","commenter_b":"Ah yeah, 'only'!","commenter_a":"Emma Marie Hulme Bet you'd be able to shed some light on this!","post_message":"Near death survivor says all he saw was darkness"},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"},{"comment_id":"10153588638028203","commenter_b":"Really an evil woman. Whether intentional or not. Please God, open her eyes and heart.","commenter_a":"This one is heading for hell also .","post_message":"Nancy Pelosi: Planned Parenthood videos are a 'distraction' @webpagelink"}]
