[{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"10153618680301336","commenter_b":"I don't agree with what happened to Mr Ramos but I emphatically want the illegals sent packing and our borders fortified!","commenter_a":"Moron","post_message":"ICYMI: Univision anchor Jorge Ramos told Megyn Kelly that Donald J. Trump's immigration plan is full of empty promises. What do you think? @webpagelink"},{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"10154727217281037","commenter_b":"When your cat was grabbed, am sure you did not mind. Trump is an insult to humanity.","commenter_a":"He is a low class guy with money.","post_message":"Melania Trump defended her husband, saying the vulgar remarks were not reflective of him and that she had accepted his apology and hoped others would, too."},{"comment_id":"2117406141818910","commenter_b":"@username Lmao...lmao...lmao...lmao...lmao","commenter_a":"So now he he is blaming his own voters if he loses. Face it trump you are going to be the one who loses to a girl and in a big way.","post_message":"Donald J. Trump says he \"will never, ever forgive\" voters if he loses the election."},{"comment_id":"10155265316599199","commenter_b":"No. She was just bat s%$@ crazy","commenter_a":"Im sick of you Christians shoving your religion down our throats. Literally","post_message":"Court documents say the mother \"saw her daughter die and then placed her body in the shape of a cross\""},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."}]
