[{"comment_id":"1233538923335820","commenter_b":"Well she can shove it in my face.","commenter_a":"Climb back into your closet. We are sick of all of you being shoved in our faces.😈😈😈😈","post_message":"\"I knew going in that I had the opportunity to make history ...\""},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"10153320749437439","commenter_b":"Appeasement increases Islamofasism. Now, go study, @webpagelink","commenter_a":"I can't believe you. Yes you are free to be as stupid as you want. But one of these days you are going to be the cause of the death of some innocent person. Shut up and go away you dumb bitch.","post_message":"Going live on @jaketapper The Lead on @CNN to discuss jihad attack on free speech #garlandshooting"},{"comment_id":"932144616915891","commenter_b":"Kill em thier lives don't matter they are scum","commenter_a":"I'm with @username not about race but individuals robbing with guns . Really is that anyone can see? Not criminal activity. Because this is a crime.","post_message":"He's got a package and a uniform, but he's no delivery guy. Once you open the door, his gun-toting crew moves in for the robbery. Now police are warning about the slick new holiday scam. The dangerous delivery - @webpagelink"},{"comment_id":"10154103059341509","commenter_b":"LMAO He will never menstruate or go through menopause LOL","commenter_a":"His NAME is BRUCE Jenner. Will he give up his medal, because he won those medals as a Man","post_message":"A judge has granted a petition allowing Caitlyn Jenner to officially change her name and gender. @webpagelink"},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse. He deserves to be honored for this heroic action, not punished. Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"}]
