[{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."},{"comment_id":"10154248071539714","commenter_b":"@username seriously what does being white have to do with anything.","commenter_a":"Isn't that discrimination? I mean I don't care. It could be a good thing. But with all the political pc going around. This is discrimination compared to what liberals say","post_message":"A former Uber driver and his wife are launching an alternative car service for female passengers only. (via Good Morning America)"},{"comment_id":"10152654360726636","commenter_b":"Dirty women, women in India are cleaner.. LOL","commenter_a":"Ewwwwwwww no way! Everyday girl me!","post_message":"One in three have gone three days without washing..."},{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"},{"comment_id":"1749451101986580","commenter_b":"Disgusting ... Soooooo sick of the ignorant and desperate race card being used - Clinton you are literally turning my stomach as you spoke often, all on recorded tv I may add, of protecting our borders from illegal immigrants and the insurmountable costs associated with this illegality - it's not racist, just one nation cannot afford to take on the needs of an impoverished third world nation that hides vast amount of hidden cash and hurts their citizens - you are such a liar and hypocrite - like now you should completely lecture us on keeping healthy and happy marriages - you and your lying inept money grubbing hateful wife make me sick - literally sad for any one that thinks you are role models - just so so so sick","commenter_a":"Racist not at all. Trump/Pence will be better then the evil woman! No question about that! I believe that Billy is suffering from a sexual disease that is destroying what mind (little left).","post_message":""}]
