[{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"},{"comment_id":"10152710214754205","commenter_b":"Bitch, you're from Missouri.","commenter_a":"Another reason to hate chicago","post_message":"Secret CIA Black Sites In American Heartland For 'Disappearing' Citizens"},{"comment_id":"1103187606428737","commenter_b":"More words of wisdom from the vastly intelligent mind of Pelosi, or liberals say the darndest things.","commenter_a":"idiot","post_message":"www.EagleRising.com"},{"comment_id":"10157219301315354","commenter_b":"Round up all illegals as soon as possible.","commenter_a":"Now we tolerate Mexicans and all kind of low life's stomping and burning our flag while stand silent and do nothing . Wake up America.!!!","post_message":"***IN HONOR OF EVERY SOLDIER, SAILOR, AIRMAN, MARINE, & GUARDSMAN WHO DIED DEFENDING FREEDOM***"},{"comment_id":"10153442006357061","commenter_b":"Sometimes a girl just needs help getting all gorgeous for the day.","commenter_a":"Ahhhh. The small amount of time this took will pay dividends in the future to this little gem. We should all make investments like this.","post_message":"Deputy helps 2-year-old toddler put her pants on after she calls 911 while struggling to get dressed. \"I'm just grateful for the deputy and her kind, wonderful heart.\""},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"10153292022111051","commenter_b":"Keep the statue,ignore the STUPIDS !!","commenter_a":"Again, if they don't believe why do they spend so much time removing evidence of God.... I really do believe that Atheist DO BELIEVE in God but don't want reminding that God is Holy and we are not. If God does not exist then sin does not exist, and thus they can live the way they want without worry of sinning...Sad! Our children and our country have paid the price of Atheists and their faithless and evil ideals.","post_message":"Should they have to remove the statue?"}]
