[{"comment_id":"10155627747429778","commenter_b":"Suck it up snowflakes","commenter_a":"So great!","post_message":"#BREAKING Donald Trump surpasses 270 votes in Electoral College to officially win Presidency"},{"comment_id":"10157031950785206","commenter_b":"Lady like OMG!!! The way she lied and attacked Hillary!!! Yeah, she was real ladylike LOL!!!!!","commenter_a":"WOW! What a disaster you were just now on Chris Matthews Hardball. No wonder you have sunk in the polls and have been sent to the kids' table when it's time to debate. Your behavior was terrible.","post_message":"Cheer on Carly in the debate right now—LIVE on Fox Business! Even if you don't get Fox Business, you can watch the debate for free online at foxbusiness.com."},{"comment_id":"10154771311354312","commenter_b":"Suck it up buttercups, she lost, move on!","commenter_a":"Trump won so how is it that anyone can change that! that would be like all the Indian fans protesting the Cubs winning the world series and changing it to the Indians winning! he won just like any other president has won! I did not want Obama in for the second 4 years as a lot of people didn't but you did not see all of us out there doing what Clintons people are doing. If you ask me all of Clintons people are the problem here. If Trump does not do his job then impeach him! but give the guy a chance to MAKE AMERICA GREAT AGAIN!!","post_message":"People upset about Donald Trump's election floated an option that could deny him the White House."},{"comment_id":"942361925804666","commenter_b":"I don't like it poor women","commenter_a":"How horrible.","post_message":"With everyone watching. Horrifying. - Matt Orr"},{"comment_id":"1553570801369710","commenter_b":"The head of black panthers got robbed at gun point called police. They got his stuff back and arrested the criminal. Ben and jerry time to get your heads out of your ass. I won't buy any thing from you hope all true Americans stop buying your products let the boycott begin hope you lose millions in sales","commenter_a":"All lives matter.","post_message":"Why? Just...why"},{"comment_id":"870644459698474","commenter_b":"Hillary will win. I'll take more Clinton any day.","commenter_a":"That is disgusting! They just don't get it! We don't want another bush! But their greed will get the better of them!","post_message":"Getting closer to announcing?"},{"comment_id":"10152694778793717","commenter_b":"Colebrook....-38","commenter_a":"Berlin -22","post_message":"We're looking for your best guesses for the coldest spot overnight tonight in New Hampshire. Comment below with your guess for the town and temperature, and Kevin Skarupa will reveal who was right Thursday morning!"}]
