[{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"},{"comment_id":"1312277812121210","commenter_b":"If AMERICANS don't put a stop to this ANTI American travesty NOW, IT WILL BECOME harder to stop from behind when more tragedies are hitting us from all sides!","commenter_a":"Sanctuary Cities will become Brussels in the next 10 years.","post_message":"If you're gonna openly allow people to emigrate to your country who are not going to assimilate -- and we have been doing that. We have not been requiring assimilation. That's a stark difference between the immigration of today and the immigration prior to 1986."},{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."},{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."},{"comment_id":"1688508021436310","commenter_b":"FIRE HER!!! She is a THUG!!!! DISGUSTING!!!!!!","commenter_a":"Fire her sorry hamburger flipping butt!","post_message":"This girl belongs in jail."},{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"}]
