[{"comment_id":"10155262254115725","commenter_b":"Well he's a she.","commenter_a":"I don't care what he does.","post_message":"Flash Survey: Does Hillary Clinton's use of a personal email account to conduct Secretary of State business hurt her potential presidential run? Vote here ---> @webpagelink"},{"comment_id":"453687788168068","commenter_b":"The 2ND Amendment was created to stop future Politicians after 1789 From EVER disarming the American POPULACE, It was a RULE OVER The FEDERAL GOVERNMENT to Say Congress the courts and the President Could Not EVER! Make a Law to CURTAIL the AMERICAN PEOPLE FROM OWNING AND USING FIRERARMS, THE GOD GIVEN RIGHT OF THE PEOPLE TO KEEP AND BEAR ARMS, wait for it SHALL NOT!!! BE!! INFRINGED , THAT MEANS NO FIREARMS RESTRICTIONS, TO MY GOVERNMENT THAT MEANS YOU SHALL NOT PERIOD!. END OF DISCUSSION. NEXT GRIPE, SERVANTS OF WE THE PEOPLE.","commenter_a":"Seeing that his commands are what the fighting & killings are all about, it sounds about right, & if you believe that you will believe anything.","post_message":"Why Owning a Firearm is Not Just a Constitutional Right but a God-Given One!"},{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"624073524449893","commenter_b":"Leave Trump alone, We love him","commenter_a":"I love Fox News","post_message":"A Fox News reporter just left for this surprising reason. No matter we stand behind Fox News. Do you support Fox News?"},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."}]
