[{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"},{"comment_id":"10155709379820389","commenter_b":"Let ISIS continue to take these worthless countries and killing all the cowards. Once they have taken all the muslim countries, we'll know what is left is our enemy and then we kill them. There is NO good reason to kill more Americans defending a people that runs and are unwilling to fight. We shouldn't give aid or weapons....our money would be better spent here at home.","commenter_a":"Screw this pathetic administration. Iraq needs us and this pathetic socialist President turns his back. My friends and I shed blood, sweat and tears to give the Iraqi's freedom only to have our coward of a leader destroy all we did.","post_message":"\"The United States is not going to be responsible for securing the security situation inside of Iraq,\" Press Secretary Josh Earnest told Fox News."},{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"800358286665935","commenter_b":"Shutup you cornballs","commenter_a":"Fundamentalists linear thinking both secular and religious can't enter the narrative. A generation that cannot discern connotations and denotations. We are in an intellectual and spiritual decline. Stupid stupid mobs","post_message":"This thug should have just obeyed the damn law! Read why Jesus lived in a police state: @webpagelink Crimes he committed: illegal fishing, loitering and homelessness, feeding people without a permit, not caring about paying taxes, whipping corrupt bankers, inciting insurrection, claiming to be above the empire."},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10158427550135093","commenter_b":"I watched a movie recently where this woman wanted to sing and thought she could sing. Because her husband was somewhat affluent she sang in get togethers and everyone fawned upon her and let her believe she could sing. Eventually her delusion became so bad that she wanted to pursue more public and aggressive venues for her singing. A doctor stepped at her husbands request, and decided to record her and play it back to her so she could be faced with the reality of her own voice. Alas, upon hearing it. . .she dropped dead.","commenter_a":"Ye are away with the fairies so ye are","post_message":"Over the line. Katherine Timpf sums it up as only she can."}]
