[{"comment_id":"10153372708775950","commenter_b":"Yuck!","commenter_a":"Wahhabism is not about freedom , except the freedom from disbelief in Islamism . Obama loves the Muslim Brotherhood , just like this mosque does . How much Wahhabist / Muslim Brotherhood money is funding Hillary Clinton's campaign ? Since when did Political Islam become a fifth column in American Politics ? Who let them in ? NAIT ( North American Islamic Trust ) is the pass through for Political Islam ( Muslim Brotherhood / Wahhabist ) political activity in America . Islam is both a religion and a political entity .","post_message":"JUST IN: Hillary Clinton won the Iowa caucuses, defeating Bernie Sanders, according to final Iowa Democratic Party results @webpagelink"},{"comment_id":"10154400322244657","commenter_b":"In your illegal immigration poll Robert? Legal, voting hispanics want them gone.","commenter_a":"It doesn't matter. Now that the GOP candidates are in a pissing contest to see who can be the most xenophobic and racist while restarting the war on women, no Republican candidate has a a shot in 2016","post_message":"Does anyone have enough momentum to unseat Donald J. Trump? See which candidate rose and fell in the new Townhall.com / Hot Air poll:"},{"comment_id":"1495644530464502","commenter_b":"Trump !! Hillary can't swim!!","commenter_a":"Butt wipe","post_message":"Watch Nebraska Senator Ben Sasse's speech LIVE to close out this year's #RSG16!"},{"comment_id":"1263029653753561","commenter_b":"This wasn't even a debate, it was #RealityTV. But yeah, Clinton couldn't have lost because #herOpponent has a #MentalDisability. Trump supporters are right, it's unfair to him to expect him to be competent. Donald show us your crooked tax returns #WordsMatter. Do you want the most powerful person on Earth to have the mouth, the character, the words of Donald Trump?? There is no argument for Trump. #ItsAVoteForHillaryAndHerAgenda #StrongerTogether #Progress #AFutureToBelieveIn #LoveTrumpsHate #LatinosArentRapists #WomenArentMissHouseKeeping #UnitedAgainstRacism #YesWeCan #DontBooVote #WhenYouGoDownWeGoHigh #LatinosArentPigs #ClimateChangeIsntAHoax #MissUniverse1996IsntMissPigy","commenter_a":"Its pretty simple boycott all these biased media outlets. Let their billionaires spend their money keeping it afloat. They don't help their own countrymen. But, sure want to take down America. Sorry, you are a idiot if you can't see this. Sad, but true Hillary is their puppet a long with Bush. The problem is the people are waking up. I can only say arm yourselves. These outlets and their mindless bots working for them are going to still put out the same trash everyday. You take down Law enforcement, then Military divide the people and conquer Keep being idiots.You will be telling of the America I love as \"Once upon a time\" You know those pastuers are always greener till your there. Don't you bots find it interesting Hillary is pulling a large number of Jewish vote and Muslim. WTH do you think she has promised each side to ...","post_message":"Trump's tax plan: 1. Huge tax cuts for billionaires and millionaires like him. 2. A tax hike for millions of middle-class families."},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"1796700900563912","commenter_b":"Stupid lady!!","commenter_a":"People need to stop ... It was a choice ... No chances could be taken .... It's sad... But the choice had to be this 4yr old little boy","post_message":"Family of toddler who fell into the gorilla enclosure at the Cincinnati Zoo & Botanical Garden said their child is “doing well” and thanked zookeepers who fatally shot the gorilla."},{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."}]
