[{"comment_id":"10154324384701600","commenter_b":"This has been going on, way before the flood of people started moving here. this is what happens when a predator looses it's fear of humans","commenter_a":"Its because so many people are moving to Colorado. There are more homes and apartments being built and the more we build the more we invade their homes. It becomes harder for then to hunt for food. So then they move into our towns and cities because people leave trash around everywhere.","post_message":"Update: 5-year-old boy survived the attack. His mom fought the animal off. The boy is being transferred to a Denver hospital in fair condition."},{"comment_id":"10154477709641729","commenter_b":"True","commenter_a":"Hillary is power hungry and Bernie is actually a communist . Both don't care about the American people.","post_message":"They'd best heed the writing on the wall."},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."},{"comment_id":"1132425910108091","commenter_b":"The Duggars need to be rape themselves so they can experience what is like to be violated only then they will know that is not something you can can forget or forgive and it's even worse when the rapist is a family member that's supposed to protect you.","commenter_a":"Proves they believe girls/women have no value.","post_message":""},{"comment_id":"776000935873204","commenter_b":"But I'd call you a hoe 😂😂","commenter_a":"Us when we get a dog and live in separate places 😂 @username","post_message":"\"I pay puppy support...\""},{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"}]
