[{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"576566162546923","commenter_b":"I'm going to keep flossing every day. Brush three times, floss once. Usually more but oh well. When you get ten cavities per year, you do whatever could give you hope","commenter_a":"The AP can't get facts right about news events, so we should trust them about flossing?","post_message":""},{"comment_id":"10153747219101350","commenter_b":"Screw you, you ignorant bitch!","commenter_a":"But don't worry, I am sure they psychiatrists will say it is a syndrome, that needs understanding.... TALK!","post_message":"\"There's the anxiety that comes from dealing with unwanted and often unasked-for interaction with the public during an intimate chore [like] folding underwear.\""},{"comment_id":"10155110249450294","commenter_b":"She got caught in the moment ... She looks like she's on drugs!!! This b!tch ain't news worthy...","commenter_a":"I saw it also and I took it that she was comforting her BF and they were both distressed about what just happened in the game. I remember it was a tense time","post_message":"Ohio State Buckeyes won the game ... but here's the six seconds from last night's Sugar Bowl that everyone is talking about today. What is happening in this video?!"},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"924205284313566","commenter_b":"Who teaches people to hold a handgun like that???","commenter_a":"No don't agree along those lines , that's open a CAN of of worms with BIG problems behind it . ,good Luck","post_message":"For God's sake, get a grip!"}]
