[{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"},{"comment_id":"10153880559652411","commenter_b":"I hate to see what she did when she got home!! Poor Billy run bill run!!","commenter_a":"Trump won hands down. Put her on the defense from the beginning and she stayed there. She just gave America that fake smile like she always does and then pretends everything is just perfect. Give me a break! I know she was extremely angry with some of the truthful comments Trump was saying and I could see that in her facial expressions. If it wasn't for the liberal media Trump would be miles ahead!","post_message":"#KenBone's overnight fame was fueled by his snazzy red sweater, white shirt-tie combination, his thick mustache, his disposable camera and of course, his catchy name, according to social media."},{"comment_id":"10154006446451680","commenter_b":"She is a joke.","commenter_a":"Making sure this cult leader doesn't get away with anything and Elizabeth Warren is one tough woman. Good for her.","post_message":"\"The American people understand the revolving door,\" Elizabeth Warren said. \"They're really sick of it.\""},{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."},{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"10157409839305389","commenter_b":"CROOKED HILLARY everytime she Open her Mouth LIES come out !","commenter_a":"definition of a liberal: liar, thief, flip-flopper and now CORRUPT","post_message":""}]
