[{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"},{"comment_id":"10153513064987629","commenter_b":"Put your damn sticker and tongue away woman.","commenter_a":"Wait! Wait! WAIT A GOD DAMN MINUTE HERE! So cops can be wrong or even worse racist liars? Our judicial system can fail at the expense of innocent citizens? I need to take a seat. Bear with me for a second...","post_message":"\"They’re so wrapped up in a different culture than—what I’m trying to say is, the right culture, the better one to pick from.\""},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."}]
