[{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."},{"comment_id":"1032518616814893","commenter_b":"Watch her pop that shit out right in the gym straining to hard","commenter_a":"People are so stuck on looking good they don't even take time out to enjoy being pregnant it's sad and looks nasty!","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."},{"comment_id":"10153934644331336","commenter_b":"Immoral women?","commenter_a":"I wonder what would happen if sexes were reversed. Point is, the guy will be wrong no matter which side he is on.","post_message":"He pinched her, so she punched him... hard."},{"comment_id":"10153348375511756","commenter_b":"Women are just as capable of destroying the infrastructure of poorer countries leading to the suffering and death of millions of innocent people as men are.","commenter_a":"No women on front line.","post_message":"Cpl. Jasmine Abrego is just 5 feet 1 inches tall. She left her job as a Marine clerical worker to train for the infantry and, as she puts it, \"kick bad guys' butts.\" \"Mentally it's just being strong, you just get stronger,\" she says. \"You just push yourself through it, that's what I've been doing.\""}]
