[{"comment_id":"10153748388188132","commenter_b":"You have lost. Your. Mind. Woman.","commenter_a":"All of you women on here calling her disgusting and gross and saying \"Ewww we don't need to see that,\" are absolutely part of the problem. There are countries where menstrual shamming still occurs and young girls are treated like animals as a result. You may think it's gross because you live in an entitled world where you're treated no differently when you have your period. Educate yourselves before you run your mouth... @webpagelink","post_message":"Thoughts?"},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"10153140451210950","commenter_b":"He is waiting for Jade Helm. Ha ha ha ha what an idiot.","commenter_a":"@username the \"President\" is not Protestant. You my friend are the dumb ass. He is a Muslim,educated in Jakarta,Indonesia at several Mosques. Born in Kenya and outer by several family members as being a \"Kenyan\" your support of this foreign born usurper of the presidency is ridiculous. Not to mention Pope Francis is evil and lacks the backing of a large number of Catholics. Pull your head out of you're ass and realize that it I simply a meeting of 2 monsters,playing pretend for the media to feed it to idiots lil you. Retard!","post_message":"For the first time ever, President Barack Obama and Pope Francis sit in the Oval Office — together: @webpagelink"},{"comment_id":"1058693167521161","commenter_b":"I died a long time ago, no girl cares about me and it's quite clear.","commenter_a":"Telling the women that you Love, that you Love her.","post_message":""},{"comment_id":"10153306067889087","commenter_b":"I bet they're total bitches!","commenter_a":"Who are these people backing Hillary?! It seems like every Democrat supporter that I come across is supporting Bernie.","post_message":"Hillary Clinton holds a stunning 31 point lead over her closest Democratic presidential rival Bernie Sanders according to a new NBC News/Wall Street Journal poll."},{"comment_id":"1757774521121112","commenter_b":"This is so DUMB! I would vote for any Republican before I would vote for \"Killery\" You sure don't know what you will get with her!.","commenter_a":"@username Agreed","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10153114864642144","commenter_b":"Bitch is a hater","commenter_a":"I don't even care about McCain but to be dismissive about his service to our country is disrespectful. Trump is an asshole.","post_message":"Low, even for Trump"}]
