[{"comment_id":"1642335606053552","commenter_b":"It's a shame what Obama has done...","commenter_a":"We'll See If You Mock Jesus When He Returns For All Us CHRISTIANS! CHRISTIANS Are Praying for You Obama.......","post_message":"Wow. Thank you for defending Christians David Cameron."},{"comment_id":"958480264190210","commenter_b":"From this little shrimp? He couldn't lick his lips!","commenter_a":"The high-water-mark of this idiot's journalistic career was his appearance on \"My Name Is Earl.\"","post_message":"It is amazing that Fox keeps Geraldo around. He does this childish stuff all the time."},{"comment_id":"10150823645789963","commenter_b":"She was a hoe..","commenter_a":"But having relations with an intern is something private. A blow job is no big deal. The Leftists sure do rationalize a lot.","post_message":""},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"},{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"10154746403950399","commenter_b":"Hope CNN is the first nail in her coffin.her propaganda is responsible for bringing a narcissistic sociopath to power.she knew what he was and put herself and financial gain before our country.she is a traitor.","commenter_a":"Excellent move CNN. The people deserve better going forward. She did an excellent job selling campaign flimflam, but her job is done now, she does not have the skills for the White House world stage.","post_message":"\"We passed. Those are the facts.\""},{"comment_id":"955239887844766","commenter_b":"Good read. Tells it like it is.","commenter_a":"obama is the biggest pos in this country!","post_message":"I didn't expect THIS!"}]
