[{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."},{"comment_id":"10153043792241680","commenter_b":"Hillary Clinton 2016!!","commenter_a":"Maybe it's his fault...no cant be.","post_message":"He says it would be \"an unforced error\" if Republicans let the government shut down."},{"comment_id":"10153037559646051","commenter_b":"Some woman so hard up for a half ass man that they no nothing about and children are getting hurt for there weaknesses","commenter_a":"sadistic POS monster","post_message":"The only thing worse than what this guy did to a 5-year-old is why he did it."},{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"10152835065341636","commenter_b":"The other 6% are too busy wanking.","commenter_a":"But what's the big deal about such a common thing as masturbation?","post_message":"94% of men and 85% of women admit to masturbating"},{"comment_id":"10153924127869197","commenter_b":"My condolences to the family","commenter_a":"God bless her","post_message":"This 10-year-old girl died after she pushed two other children out of harm's way. Read more about the courageous rescue by Kiera Larsen --> @webpagelink"}]
