[{"comment_id":"952585388112135","commenter_b":"That is true @username however they will find no virgins on the other side.","commenter_a":"only way to deal with those ISIS thugs.","post_message":"“A tall bearded man emerged and drew a long knife...He began addressing the crowd and slapping the father and his son around the head and kicking them onto the floor.” That's when three shots rang out."},{"comment_id":"10153963537435579","commenter_b":"Defeat lsis & send all refugees home ! Simple","commenter_a":"Best plan would be to stop funding, remove all troops and leave other countries alone.","post_message":"Speaker Paul Ryan: \"What happened in Paris is pure evil's clear this was an act of war and that the world needs American leadership. The National Defense Bill that I will sign later today will requires the President to come up with a plan for defeating ISIS, not just containing, but defeating ISIS. A containment plan is not enough.\""},{"comment_id":"10154464043803010","commenter_b":"Stfu bitch","commenter_a":"Cop shot the hood who shot him. Case closed. #righteouskill","post_message":"Officers stumbled into a shooting in progress, and a gun battle ensued."},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"},{"comment_id":"493650944158819","commenter_b":"Get rid of her","commenter_a":"Well her whole life she's been breaking the law, she corrupt .","post_message":"Hillary's career could be over after she was exposed doing this. Good. Let's end it right here, right now, once and for all. Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"1016852955001727","commenter_b":"Calais wasn't a jungle before these muslim herds invaded it and consequently turned it into filthy, unsafe jungle!!! Let them go to muslim countries for a better life, they do not belong to Europe!!! They cannot and will not assimilate. EVER!!!","commenter_a":"Welcome to Europe, here you be safe and free","post_message":"\"It's slowly, slowly starting to become colder and I don't know what are their plans, these people, because if it starts snowing, most of the people, they're going to start coughing and getting sick and probably dying in that jungle.\" Read more: @webpagelink"},{"comment_id":"853806161323392","commenter_b":"Ya I always thought she was odd shaped... not anymore. Taylor is way hot","commenter_a":"Smart girl: screw the paparazzi out of a big pay day and staying true to her values; all while looking gorgeous and being a positive role model for girls everywhere.","post_message":"She had a good reason – and it wasn't vanity."}]
