[{"comment_id":"10153124758876336","commenter_b":"Inappropriate.","commenter_a":"This says she's not a very good golfer and is not really serious about golf as a vocation. Bet she gets a lot of offers for sex though.","post_message":"This week, \"GolfDigest\" unveiled a head-turning shot of one of golf's top young female stars, Lexi Thompson. What do you think of the controversial cover?"},{"comment_id":"10152979046217690","commenter_b":"Hoes","commenter_a":"Looks like that abstinence only thing isn't working out so well.","post_message":"At least 20 cases of chlamydia have been reported at a small West Texas high school. @webpagelink"},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"497304097143406","commenter_b":"LEAVE ABE ALONE DIMWITS!","commenter_a":"Leave our money alone","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"827089443993145","commenter_b":"First Lady??? Really","commenter_a":"Ignore ....WHAT A WASTE OF CIVILATION","post_message":"Is she serious?"},{"comment_id":"10154271893261336","commenter_b":"He should deport the freeloaders and criminals. There are a lot of nice people out there who want to work and be a part of America","commenter_a":"Trump just told CNN he is for a raise to the minimum wage. I am waiting for Trump to say he will not deport the 11 Million undocumented immigrants he promised his rightwing base. Look for that next week.","post_message":"After emerging as the presumptive GOP nominee following a major victory in Indiana, Donald J. Trump is responding to questions about whether he'd choose John Kasich as his running mate. Don't miss Trump tonight on \"The O'Reilly Factor\" starting at 8p ET."}]
