[{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"1497908770268866","commenter_b":"Alina is converted or living with muslims , check her page.","commenter_a":"A mother of 3, just 26 years old..... Makes me wonder about her story. Don't believe everything you read in the media. If she really got raped the men must be punished, simple as that. Shouldn't she have stayed at home with her children in the first place in stead of wandering the streets? And going out all by herself without a friend? Mmmm","post_message":"Raped by 'migrants from Iraq, Syria and Bahrain' after her drink was spiked"},{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"865498240307419","commenter_b":"She does this for money . She is a witch like her Mom","commenter_a":"I do feel sympathy for Chelsea. She is truly a victim of the unlucky sperm club. She has to defend two people who are seriously flawed while trying to raise her own family. Their lecherous and unlawful behavior are certainly not her fault.","post_message":"Chelsea tried to challenge her, immediately regrets that decision. This woman was forcefully raped by Bill, let's show her some support for god sakes. Can we get 10,000 'LIKES' for her Bravery?"},{"comment_id":"10154180485564411","commenter_b":"Here illegally? They should hide.","commenter_a":"Most criminals try to hide. Live in fear!","post_message":"Immigrant rights activists call it the Effect."},{"comment_id":"1178752805478081","commenter_b":"Sick the American get off this privacy","commenter_a":"If someone comes to my door wearing that outfit,I will personally egg them.......","post_message":"It's nowhere near October, but one ensemble is already on track to be named the most controversial Halloween costume of 2015."},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"}]
