[{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."},{"comment_id":"963771213658338","commenter_b":"He hasn't been sent yet! The judge will do that! 263, but if he, the judge, gives him concurrent sentences, he'll be out in 20....wait until JAN 16","commenter_a":"Lolol good!!!","post_message":"Daniel Holtzclaw was sentenced to 263 years in prison."},{"comment_id":"1688508021436310","commenter_b":"FIRE HER!!! She is a THUG!!!! DISGUSTING!!!!!!","commenter_a":"Fire her sorry hamburger flipping butt!","post_message":"This girl belongs in jail."},{"comment_id":"1478284585520531","commenter_b":"@username At least he loves and respects Americans, which clearly you are not....Does not have the blood on his hands like Hillary of 114 people and counting.....Maybe you want him to destroy us, but, when he does you'll be right there with us all...Let all these illegals come live with you!!!","commenter_a":"This has got to stop!!!! Please read the following.. John Miech *Here is something to think about**, and why so many Americans support Donald Trump !!* (This information has all been checked, then double checked... it is 100% Correct.) That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! You mean until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government. @username, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her ...","post_message":"Do you know what the actual percentage of money the Clinton Foundation has raised that they donate so far to charity is? It's like 5%."},{"comment_id":"10154260147516051","commenter_b":"@username you ignorant bitch !!! If the illegals voted and they can't vote then how did they vote if they are illegals ????dumb ass !!! You racist ass bitch !!!","commenter_a":"The majority of Americans elected Mr Trump. Millions of Clinton votes were cast by illegals who had no right to vote. You people need to respect the process and get over it","post_message":"The majority of Americans dispute Trump's right to rule since he lost the popular vote by almost two million votes. Do you think the candidate who gets the most votes should win?"}]
