[{"comment_id":"10154512310684726","commenter_b":"her face looks like a duck.","commenter_a":"Liar","post_message":"Tammy Duckworth says they’re all orphans and widows because the men are 'all dead.'"},{"comment_id":"953216211400448","commenter_b":"Ron, don't forget about the white folks whom have EBT cards and are on welfare.","commenter_a":"So why are we not receiving reparations like the Jews Obama.U jst gave them 12 million for something that didn't happen here!","post_message":"President Obama defends the Black Lives Matter movement, saying the concerns of the activists who have marched & protested for change are legitimate. Obama reiterates that while all lives do matter, black communities are under a specific & unique scourge that needs to be addressed. He also goes on to say that using the phrase “Black Lives Matter\" does not mean that other lives do not. DETAILS ----> @webpagelink"},{"comment_id":"10150823645789963","commenter_b":"She was a hoe..","commenter_a":"But having relations with an intern is something private. A blow job is no big deal. The Leftists sure do rationalize a lot.","post_message":""},{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."}]
