[{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"},{"comment_id":"10153162341961051","commenter_b":"That is crap. She should not have been arrested. She could see her children.","commenter_a":"She was making the best out of a tough situation. Geez. A little common sense, please.","post_message":"Simple question: should this mom have been arrested?"},{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"1819541594934723","commenter_b":"Why caught, why is that bitch alive.","commenter_a":"Oh well","post_message":"At least they got the scum bag! @webpagelink"},{"comment_id":"1190828210956634","commenter_b":"Ist: ENFORCE THE IMMIGRATION LAWS, forbidding businesses from hiring ILLEGALS & H1B workers; 2d: DEPORT THE FAKE MUSIM \"refugees\"; 3rd: BUILD THAT WALL!!! 4th: BEGIN DEPORTATION OF ALL ILLEGAL ALIENS! That's enough for the first day. Most of our problems can be solved just by ending ILLEGAL IMMIGRATION!","commenter_a":"RESIGN....","post_message":"GREATEST QUESTION: @webpagelink"},{"comment_id":"10153442006357061","commenter_b":"Sometimes a girl just needs help getting all gorgeous for the day.","commenter_a":"Ahhhh. The small amount of time this took will pay dividends in the future to this little gem. We should all make investments like this.","post_message":"Deputy helps 2-year-old toddler put her pants on after she calls 911 while struggling to get dressed. \"I'm just grateful for the deputy and her kind, wonderful heart.\""}]
