[{"comment_id":"474651159350328","commenter_b":"I had to take a class on how to handle union situations at wal mart.","commenter_a":"Ya outta see Targets 20 minute \"what to do if a union approaches you\" training video that every target employee must view before they are hired... It's Reduculus...","post_message":"In recent years Walmart has been labeled the bad apple in Corporate America, but recent news may give Target that title. ~Tanner"},{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"10153671588729342","commenter_b":"I'm a woman who sees her as nothing but lying trash!!","commenter_a":"😷😷😷😷😷😷😷 Please, people... What do you see in her? My mom told me if I don't have anything nice to say, to not say anything at all.....! Killing me on this one.","post_message":"With Hillary Clinton set to speak momentarily at Texas Southern University, ABC13-Deborah Wrigley has an inside look. Watch Live --> @webpagelink #abc13"},{"comment_id":"761832037248738","commenter_b":"The Dell was your first mistake buy a Mac or a HP","commenter_a":"Bubba killed the jukebox last night...","post_message":"\"Man Kills His Computer.\""},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about. But no Democrat's ever admitted it."},{"comment_id":"495211413960969","commenter_b":"What a f****n punk","commenter_a":"He is a psychopath I assume.","post_message":"As for killing Trayvon, he said, \"I believe God has his plans\" F*ck this guy. -Linda"},{"comment_id":"10153769957503984","commenter_b":"get rid of her .","commenter_a":"Couldn't have been too quiet, you know about it. She quietly sign with them because old agency smart enough to drop her?","post_message":"Megyn Kelly very quietly just made a huge move that could change everything for her and Fox News. What do you think? Should Megyn stay or go?"}]
