[{"comment_id":"981909798535164","commenter_b":"No, I don't think he have to.","commenter_a":"No","post_message":"Bernie Sanders doesn't talk very much about faith beyond saying he's culturally Jewish. Jimmy Kimmel asked him, point blank, if he believes in God, and he framed his answer in a rather unique way. Do you think a president must have a belief in a god to be a good leader?"},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"10153138059356336","commenter_b":"Why women think they have to expose most all of their boobs is beyond me. Not sexy at all, just crude and tasteless","commenter_a":"Need to prove it? Does not \"represent\" anybody.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\" LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."},{"comment_id":"10154246558899575","commenter_b":"I think she should have been charged with negligent homicide. She caused the child's death.","commenter_a":"Agree.","post_message":"The mother of a 2-year-old boy who fatally shot himself last month has been charged with neglect. Police say the child found the gun in her purse."},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."},{"comment_id":"10153850039752452","commenter_b":"Samantha Keller me","commenter_a":"Esdras Diaz","post_message":"After being a dad for five months, this father decided to share a funny review on his “2016 model” baby. @webpagelink"}]
