[{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"822069341254814","commenter_b":"Two egocentric over weight idiots !","commenter_a":"The best news I have heard for I would have voted for Christie and Trump I know can get us back on track for our money and bill problems. way to go Christie hope you make vice President what a great team you two would make for America.","post_message":"Thank you Governor Chris Christie! It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152604672427894","commenter_b":"I bet the beautiful lupita will be married before her silly ass will ever be...hell Walter didn't want her .","commenter_a":"Kenya need to stfu with her stupid ass","post_message":"Kenya Moore Shades Lupita Nyong'o Over Golden Globes Photo Snub: 'Girl Bye'"},{"comment_id":"506619736194965","commenter_b":"Thats some nasty, ass mf shit","commenter_a":"Que terrible,","post_message":"Workers reportedly wear diapers to avoid becoming so desperate that they urinate or defecate on the floor."},{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"},{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"728722383954381","commenter_b":"this shit sad most if not all terrorist are from s Arabia and suni.. it hasn't even been 1 Iranian terrorist. and they fund ppl to defend they city that's not called funding terrorist. fuck trump AZ a U.S. citizen. I'm a shame of this racis country. that's why I fucking moved. fuck that bitch and his racis face. let that bitch try to come fuck w iran and see what happens. wer not Iraq or Syria. none of that. we strong. and we got them nukes and Russia and China fuck w us. let Israel bitch ass make move😎fuck Israel and s Arabia","commenter_a":"Should be interesting to see this brought up in Surpreme Court...","post_message":"The Muslim (country) ban."}]
