[{"comment_id":"10153692809021694","commenter_b":"\"there are people who care enough to find you\" Riverrrrrr??? D:","commenter_a":"@username :0","post_message":"We have so many questions, but we won't have to wait long for answers!"},{"comment_id":"465155073666373","commenter_b":"Tax and spend.....are investments in our society.","commenter_a":"The problem with liberals they preach their beliefs and are hypocrites. Look at All Gore with his huge carbon footprint. Yes science is real and climate change is real this coming from a conservative but unless we get our house in order this country won't survive. The answer from liberals is a carbon tax. Let's see gas and electricity go through the roof and see the gap between the rich, middle-class and poor widen even deeper. You have to live what you preach and ultimately politicians are out only for themselves. There poor decisions impact the masses and we all need to wakeup. The problem with liberals is they think everyone who doesn't believe exactly like them are bigots or racists and there is no compromise. Tax and spend is not the answer the rich just find new ways to hide it and the middle class families keep falling into ...","post_message":"More proof they can't deal with facts."},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"10153157733159197","commenter_b":"She looka likea man.","commenter_a":"the scowl on the face of #3 is pretty funny","post_message":"Have you been to a spa in East Hartford lately? It could be one that was shut down after a prostitution bust-->> @webpagelink"},{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."}]
