[{"comment_id":"10155461555215354","commenter_b":"Cause shes an ASSHOLE","commenter_a":"Let her pay for it.","post_message":"Liberal values..."},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"10153586191671336","commenter_b":"White girls everywhere lose their minds","commenter_a":"No to starbucks for quite some time.","post_message":"Yay or nay… What do you think of Starbucks changing up the pumpkin spice latte?"},{"comment_id":"10153128633786323","commenter_b":"I think you're getting a bit sadistic Sanchita. \"Lowered into vats of acid\"? You should hear yourself. That's inhumane. They should be put in prison, like they already are. And women CAN rape, though sadly this country's rape legislation is inadequate when it comes to women-perpetrators. What about a woman-on-woman rape? Or when a woman in her 30s rapes a 13 year old boy?","commenter_a":"Stop demonising men","post_message":"“I began this film with a narrow focus: ‘Why do men rape?’ I discovered that the disease is a lack of respect for gender. It’s not just about a few rotten apples, it’s the barrel itself that is rotten.”"},{"comment_id":"10153633238805575","commenter_b":"Get those monsters outta here!","commenter_a":"Oh who did not see this coming? Remember in Greece all the guns that were found? This is not refugees this is trying to take over send them back!!!","post_message":"This is frightening."},{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10153320110664641","commenter_b":"her kids are black, derp","commenter_a":"As long as she is not racist and is doing good she is my sister! Her being white does not change anything","post_message":"Rachel Dolezal represents the black community publicly and vocally. But her birth certificate says she's white."}]
