[{"comment_id":"10152973439396323","commenter_b":"Yeah they need to give you a time frame to study and work then go back to where you came from. It shouldn't be a forever stay for immigrants. Once they get the freedom to stay for long then they going to start taking over. America is a big example, UK, France are big example of immigtants taking over.","commenter_a":"Well they are angry citizens and they have the right to be angry when their government keep dumping immigrants in their country like that, especially those taliban immigrant who want to take over Europe like they did to Spain in the 11th century. Somebody gotta stand up to it while others are bend over backwards to accept the influx of immigrants floading their homeland. Last I recall Germany is a Dutch land not usa.","post_message":"“We just want Germany to stay German!” The rise of the Pegida party"},{"comment_id":"10155992640990354","commenter_b":"They are none good roll models..they don't need these women as anything but singers..and you need to make sure they are dressing like hos..cause thats what all little girls seem to want to dress like..it's to late anyway..all of us have allowed them to face a world thats gone insane..they wont be in a world like we had..it's over..they will have abortion..hate..sex that kills..and men cutting off their heads and men raping them...so keep worrying about music..clothes..fingernails..princesses..and cutey stuff...they are doomed...and we let it happen.","commenter_a":"Taylor Swift is a good role model. Myley Cyrus is NOT a good role model. Taylor Swift writes and sings her amazing hit songs. What does Mylie Cyrus do? Sing and not good at all. My girls love Taylor Swift!","post_message":"Which is worse: Kiss Kiss or Bang Bang?"},{"comment_id":"658534947621213","commenter_b":"@username stay home then","commenter_a":"The Trump camp says Cruz is stealing the delegates? A delegate cannot be stolen! They are professional adult people that make up their own mind! In other words, they are not controlled by anyone!","post_message":""},{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"},{"comment_id":"893405944041287","commenter_b":"Slap a hoe","commenter_a":"@username What An Idiot She Is","post_message":"Mom Forgets Her Baby In A Shopping Cart A valley mom walked out of a Fry's store in Gilbert this afternoon but left her newborn behind in the shopping cart. 40 minutes later the panicked mom realized her mistake and went back to get him. The baby is back with his family tonight. Photo: Katie McCulley. Full story: @webpagelink"},{"comment_id":"1179869992091535","commenter_b":"Lol yeah never thought about a lefty you ever try those net bags to catch spent casings I use them because we reload that should help","commenter_a":"First of all the guy was lying no way he shot it he said the casings flying in front of his face gave PTSD has anyone ever had a spent casing fly in front of them why shooting the AR not me lol so I doubt he even used one","post_message":""},{"comment_id":"1063700283715505","commenter_b":"No more illegals","commenter_a":"Keep legal immigrant families together. I have so many waiting in the Philippines waiting to legally come. The other illegals can wait to be legal like the rest or let all immigrants come to USA.","post_message":"The Supreme Court’s deadlocked ruling on immigration leaves families like Karla’s under the threat of deportation. We need a president that will fight to keep families together, not tear them apart."}]
