[{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\" - Vice President Joe Biden"},{"comment_id":"10154045189272169","commenter_b":"Farmers are already having trouble finding people to work. A lot of illegals have left this country and Americans won't do the work, so there are places that crops are just sitting and going to waste.","commenter_a":"Illegal workers should go back to their own country.","post_message":"Farmers markets are everywhere. But do laborers see benefits? (From PBS NewsHour)"},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""},{"comment_id":"10153307590149087","commenter_b":"Bitch got a face like a monkeys nut sack....to friggin ugly to be president","commenter_a":"Of course....he rocks!","post_message":"A poll of Iowa voters found Dr. Ben Carson decisively defeating Hillary Clinton in a hypothetical general election matchup."},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"},{"comment_id":"10153957745968132","commenter_b":"wow pretty stupid its not like the jungle book jeez idiot she should be caged","commenter_a":"Who the hell in the PEOPLE staff is in charge of the facebook page that writes obsurd comments?? What the hell is terrifying about this situation?? Nothing! She was a moron that snuck into a zoo and decided to pet it. She got what was coming to her. Terrifying..would be if it's normal business hours and a tiger came out of its cage.","post_message":"This is so terrifying!"},{"comment_id":"1603692309937131","commenter_b":"Hillary got 2 million more votes. Americans REJECTED TRUMP","commenter_a":"\"Why are you really doing this?\" Despite the many rumors swirling on the Internet, the Stein/Baraka campaign genuinely believes in the power of grassroots democracy. Independently funded candidates like @username cannot stand a chance if our electoral system is rigged in favor of establishment, corporate-funded candidates. The evidence so far shows it is easy to hack many voting machines being used in elections. Aside from conducting a recount, we advocate Ranked Choice Voting and federal campaign financing, just a few solutions put forth by the Green Party in it's six-point plan for grassroots democracy. The Green Party Platform, which calls for \"publicly-owned, open source voting equipment and deploy it across the nation to ensure high national standards, performance, transparency and accountability; use verifiable paper ballots; and institute mandatory automatic random precinct recounts to ensure a high level of accuracy in election results.\" jill2016.com/recountfaq","post_message":"I am joined tonight with Kevin Ronca, the director and creator of the incredible docuseries, \"The Revolution Televised.\" Although only 13 minutes in length, each of these episodes get to the heart of the matter: exposing the corruption that has been taking place in our sick political system! I would like to invite you to join the conversation as we will be releasing the 4th episode in this series right now, followed by a live Q&A session between our viewers, me and Kevin about this extraordinary series and where he goes from here. I'm sure you all have heard about the dramatic developments at Standing Rock, including the announcement today by the Army Corps of Engineers (see below). Kevin is willing to go there with his team to bear witness to this very important struggle. --- Press Release from Army Corps of Engineers 11/25/16: @webpagelink -- Here are some of ..."}]
