[{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"1008881259209071","commenter_b":"America is in bad shape and people can't see it. I don't understand why they are for Hillary. She can't do a thing but lie. She will do nothing for poor and middle class. How do people not see this? ?? I am amazed at how stupid people are thinking life will be better with her doing what Obama has for 8 years. Bankrupting America and millions of Americans. WHAT has she done FOR America? ?? More. ..what has she done TO America? The red states will get it right I hope. If only the people in the swing states would come to their senses.","commenter_a":"Yep, you said it right, power and money, but wait , they want your votes too, hahahahahaha hahahahahaha hahahahahaha, I am not stupid, Hillary is not getting my vote","post_message":"\"The Clintons are greedy. They love money. They love money so much they've been accused of ignoring ethics and, very likely, laws to rake in more and more money.\" – Eric Bolling @webpagelink"},{"comment_id":"10153217092086943","commenter_b":"Heads need to roll for this and indictments handed down. My what our government has come to. Nothing but self serving law breaking idiots.","commenter_a":"@username is relentless about getting to the truth. They work for the people by continuing to tirelessly go after these corrupt polititions and agencies in our government who some how think they are above the law. Congress has caved into the stall tactics by this corrupt administrations Justice dept, Irs, and State Dept. Thanks @username.","post_message":"This is from an Investor's Business Daily editorial yesterday: \"Thanks to a band of lawyers called Judicial Watch, and no thanks at all to the mainstream press, we are learning about a shady October 2010 meeting between former IRS official Lois Lerner, Justice Department officials and the FBI.\""},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"10153523101282169","commenter_b":"They don't have a wall...just go....and demand your rights....lol","commenter_a":"@username, you are cool water in a desert of ignorance. Please don't think we are all so ignorant of our world.","post_message":""}]
