[{"comment_id":"831063543595735","commenter_b":"and what would having military service help with illegal aliens......","commenter_a":"Every Presidential candidate should have had at least 3 years active duty! No exceptions! Would stop illegal aliens, and other scum from infiltrating the white house like NOW!","post_message":"We need a leader who supports our military, now more than ever! www.thepoliticalinsider.com"},{"comment_id":"10153073286297894","commenter_b":"I think the idustry favors her and is partial to her music but there is no room for disrespect to anyone.","commenter_a":"I can't get past \"somewhat respect me\". Either he respects you or not! ByeTaylor","post_message":"Taylor Swift Talks Kanye West in ‘Vanity Fair': I Felt We Couldn’t Be Friends Until He Somewhat Respected Me"},{"comment_id":"1130182300405839","commenter_b":"Sorry about the lies aren't going to work she won the debate she will be our president get over it","commenter_a":"He is a tax cheat. What makes him think he is ok not paying taxes. I truly believes he hates our country. He is scum","post_message":"Absolutely deplorable."},{"comment_id":"10153003636601167","commenter_b":"Conspiracy--Huh,,,, Just MORE REPUBLICAN,,,LIES !!!!!------Why don\"t republicans want \" Regular Americans \" to have Obamacare ( ACA) ?????--HATE for the BLACK MAN, in the White House !!!!! Republicans,, STILL INSIST,,,,Racism Doesn\"t Exist ---YEA,,RIGHT !!!","commenter_a":"Not again \".,(;#!!:#$,:that Damn Obama. Lol","post_message":"LOL."},{"comment_id":"697812187045401","commenter_b":"And the women who choose to cover their faces?","commenter_a":"Victory for the woman that are forced to cover their faces. Now they can feel the warmth of the sun, feel alive.","post_message":"Anyone caught will be fined about $541."},{"comment_id":"10153197051250329","commenter_b":"Lol that's like half of us @username","commenter_a":"Kimberley Stefan","post_message":":/"},{"comment_id":"574474082714162","commenter_b":"A voting majority will not vote for a re-hash of the Bush administration.","commenter_a":"Newt Gingrich, Mike Huckabee","post_message":"Question of the Day: Who should Donald J. Trump pick to be his running mate?"}]
