[{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"10154652833671336","commenter_b":"BUILD THE WALL!!!","commenter_a":"let's end this by voting for trump","post_message":"A man who allegedly killed two people and kidnapped a third one over the weekend in the Dallas area had been deported three times to Mexico in the last two decades, immigration officials said on Wednesday."},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance. This seems WAY too coincidental... Beyonce needs to step up and take responsibility."},{"comment_id":"1570131419945845","commenter_b":"How does someone like this get elected in this day and age? Shame on those that vote for such a disgusting human being. I hope Texas sees the day when most of their women have left the state. This is the opinion of a multiple degreed female with a B.A in Mathematics and a Juris Doctorate","commenter_a":"He's an embarrassment to men as well as women. How in this day and age does someone like this still exist?","post_message":"\"It is the job of a woman to stay at home\" - A real Republican in 2016."},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"}]
