[{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"},{"comment_id":"10154402940891636","commenter_b":"Americans with guns are more of a threat than any other nation, must loose more lives with kids and their \"toys\"","commenter_a":"If he'd spent the $trillions he'd wasted on wars on so-called 'Climate Change' instead, then im sure the world would've been closer to 'normality' by now, but no, 8 solid years of bombs in the Middle-East is what you get. Why thank him for this, its given us EU terrorism.!!","post_message":"Hero"},{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"},{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"10153245476169087","commenter_b":"F you Bitch !!","commenter_a":"obama with his gay pride lit up the white house for his muslim brothers and he told us how proud that he was to light up the white house for his gay friends","post_message":"“If Donald Trump becomes president, that will be the end of the world,” said Hunger Games actress Jennifer Lawrence said. \"I genuinely believe that reality television has reached the ultimate place where now even [presidential elections] might just be for entertainment.\""},{"comment_id":"1017996811629034","commenter_b":"Wat a dumb bitch","commenter_a":"PUT YOUR GUNS DOWN????? What the fuck she's stupid","post_message":"This Black cop is furious about other cops not owning up to police brutality."},{"comment_id":"10153520477923132","commenter_b":"Those freaks should have never been on TV anyway!!","commenter_a":"Yep thy absolutely should. Should never have a show on the air that advocates bigotry and hatred while showing women as animals for breeding purposes that are be owned. Also the show advocates for having more children than you can afford (unless you have a reality show to pay the bills) and more kids than you can physically and emotionally take care of.","post_message":"Do you think TLC should cancel 19 Kids and Counting?"}]
