[{"comment_id":"10155201075949657","commenter_b":"why would a woman vote for this asshole he calls them FAT PIGS","commenter_a":"I'm surprised women don't value honesty more in light of Hillary's proven lies","post_message":"Trouble."},{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."},{"comment_id":"704812552989083","commenter_b":"I would too....she is ugly!","commenter_a":"Poka dots look good on her. Muslim men are just jealous their women dont look like that.","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"1117181214965894","commenter_b":"@username , It is kind of a long story... But just as we have labels on cans to tell us whether it's Corn or Peas the label on our Faith denotes how accurately we wish to follow Jesus .","commenter_a":"Many are walking away from Christianity, because not all...but the few, out there in this world use God and the Bible to push their own personal and political agandas! People are so tired of so-called Christians who act so self-righteous and who's actions are far far from what Jesus would do! As a Christian...Many of us do not want to be represented by Greed, bigotry and hatred!","post_message":""},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."},{"comment_id":"10152558711931770","commenter_b":"When was the last time the Climate beheaded, butchers and burned to death with gas someone?","commenter_a":"what a goof","post_message":"The president compares climate change with ISIS..."}]
