[{"comment_id":"10153440964853606","commenter_b":"Omg","commenter_a":"prayer for him and were r parents hope parents go to jail","post_message":"A 2-year-old boy is in life-threatening condition after he was found at the bottom of a pool Sunday evening. @webpagelink"},{"comment_id":"954295721303850","commenter_b":"Dumb hoe lol","commenter_a":"KiAsia SimplyyMee Wilson smh #fixitjesus","post_message":"SMH"},{"comment_id":"10153560993130667","commenter_b":"Sounds like Hellen Hollands is just a plain old witch to me.","commenter_a":"This school and school district should be ashamed of themselves. This young man left school in order to live - to SAVE HIS LIFE. He deserves every single thing that graduation affords, other than his actual diploma (which he will receive in December). I'm guessing there is no graduation ceremony in December, so he gets no graduation? School systems across America are failing their students every single day. Rules are made to be broken, changed or given a pass","post_message":"\"I never asked to receive a diploma and am even okay with not walking across that stage or having my name called. I just want to be a part of the ceremony.\""},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"},{"comment_id":"10153536148652426","commenter_b":"That's sad! Lawyers can find many ways of getting people out of trouble. Bet the girl didn't show remorse or learn an important lesson.","commenter_a":"Ok, fine people for smoking around children. Then let's raise the fines for texting and driving and add fines for talking and driving. These fines can be used to further aid in our children's education. But most important-people can use their lessons they learned in driver's ed such as using a turn signal and stopping at a stop sign.","post_message":"Should smokers be fined for smoking in cars with kids? A - Yes B - No"},{"comment_id":"10156066398495354","commenter_b":"Just can't handle the truth or face reality can you, imagine that, a black playing the race card, what a shocker!","commenter_a":"Ramos may be Hispanic, but he is also rude and disrespectful to the other reporters in the room.","post_message":"Or maybe... because they attacked him first?"}]
