[{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"10153436831622217","commenter_b":"I never said I sympathized with Rhodes, I'm concerned over how you are passing over Hitler's attrocities if they are nothing. Generally, people who downplay Hitler are anti-Semitic","commenter_a":"Oh my God... if you compared Hitler with Cecil Rhodes, the former is a TODDLER... he killed over 15 million people, kidnapped forced millions into slavery, his statue shouldn't be anywhere for people to remember him, he's not hero or we can have statue of HITLER in Berlin","post_message":"Campaigners say #CecilRhodes represents white supremacy."},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"967357503323727","commenter_b":"This sexist pig is just pissed because two women probably did better than he did. Tell this little ass to pick up his toys and go the hell home! Quit whining !","commenter_a":"If the truth be known, men are the weaker sex. Most of the genetic information is on the X chromosome and women have 2 Xs, men only one X. The Y chromosome has little genetic information, besides the male sex gene. Consequently, women are genetically stronger in many way ways and live longer. In many European countries women do a lot of the heavy work in the fields. In the US women are treated as somehow inferior, and men want to believe that they are \"weaker,\" but it is not necessarily so.","post_message":"This Republican misogynist is fuming that these two women passed the same Army Ranger course he did."},{"comment_id":"1049402575096281","commenter_b":"Talking about slavery isn't race-baiting. It's American history. Also, I didn't hear you mention the part about women's rights.... Did you also mean gender-baiting? If not, maybe you are the one stuck on race...","commenter_a":"America was great when americans had pride in your country instead of some fatherless minion trying to tear it apart to serve his race baiting tv program...","post_message":"“Make America Great Again” begs the question: when exactly was America great?"},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"10156018657180389","commenter_b":"Carly Fiorina thinks that men that do not want to vote for her are \"Sexist\"... All of you that support her are actually Feminist, or men that are ashamed of being men... Do you really want a Feminist like Hillary or Carly in the White House?","commenter_a":"Hey Sean! Gonna be seeing our man Ted Cruz tomorrow:))!","post_message":""}]
