[{"comment_id":"10152974957394641","commenter_b":"shame on u black woman.","commenter_a":"They will mit with Muhammed in hell enjoy the fire","post_message":"Saudi Arabia has announced the successor to the throne: cnn.it/1t3xpeS"},{"comment_id":"10154384389006636","commenter_b":"One of the biggest lies is that the state of Israel was built out of a scrap of desert with just a few primitive wandering around. So they perpetrate a lie that Palestine was the invention of Yasser Arafat and the Palestine Liberation Organization. Yet the real truth is that Palestine has existed as a discrete country for well over 2,000 years and there is plenty of evidence to prove this. @webpagelink","commenter_a":"Israel continually ignores international law and wonders why the UN resolution was passed against illegal settlements in occupied land. Will Israelis give the homeless shelter - hell will freeze over first.","post_message":"A nationwide strike"},{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"},{"comment_id":"10153222902488645","commenter_b":"@username dont worry about those nails.... worry about that mouth full of yellow teeth.... nasty","commenter_a":"Who cares? The dude is old as hell and WWE is for red necks.","post_message":"Hulk Hogan claims that he resigned from the WWE in the wake of the release of the transcript in which he used racial slurs, while the pro wrestling company says he was fired. Either way, all mention of him has been scrubbed from the WWE's website."},{"comment_id":"10153351260137439","commenter_b":"Go home to your rodent pit ugly woman","commenter_a":"Why did they come to the USA? To bring death? Shame yourself Mother of Satan.","post_message":"@webpagelink"},{"comment_id":"10153841941246770","commenter_b":"I'm not voting for the CORRUPT, LYING, MURDERING, CROOKED iLL SICK PERSON! I'll VOTE FOR TRUMP, you know why because the LIBERALS are a bunch of sick twisted people who do give one crap about this country!!! #NEVERHILLARY","commenter_a":"You ad your husband are a perfect for each other. Both dumb as a brick!","post_message":"Chrissy Teigen just called Trump a \"sociopath\" on live television."},{"comment_id":"1142026852548536","commenter_b":"Hillary is done!! all thanks to Gucifer 2.0!!! Ding dong the witch is dead, the wicked witch @webpagelink","commenter_a":"hahaha..my grandsons are proud of hillary clinton for her campaign for president..they think donald trump is a bully and bigot..says a lot for a 16 year old and 12 year old!","post_message":"A lot has changed in the past two and a half decades. But the things we’re fighting for remain the same."}]
