[{"comment_id":"10154251661998144","commenter_b":"arrest them all","commenter_a":"These people mare a direct threat to our Country and the good honest people in it! Anything goes to move them! I'm fed up!","post_message":"Anti-Trump protesters blocked off an ambulance because they were upset about President Trump's executive orders"},{"comment_id":"10154463724150329","commenter_b":"@username because I don't keep people around who are ignorant and misogynistic pigs, such as yourself. Get a grip and show some fucking respect. Sitting in your parents house being a troll isn't gonna get you anywhere. Also, alot more women are feminists than you would think, @username.","commenter_a":"Wear whatever the fuck you want. Just dont expect everyone to compliment you.","post_message":"\"Bikinis just don't look nice on plus-size women.\""},{"comment_id":"1358800054143336","commenter_b":"Are you for real???","commenter_a":"Yes @username, they are so utterly disgusting!! But remember, \"when they go low, we go high!'\". And they're just pissed knowing that Every penny Donald J. Trump has had or will ever have, can't buy him the class, dignity, and humanity of Barack Obama. #FarewellObama","post_message":"But wait -- where was Sasha?"},{"comment_id":"1539276206088035","commenter_b":"Yes,They Love to spend Our Money !","commenter_a":"That's what dems do,,,,spend money they don't have ,,,,,","post_message":"I'm perhaps the best fundraiser for the Democrats. If you want to separate Democrats from their money, tell them that I'm on the march. Tell them that I'm responsible something, and they will start writing checks for money that they don't even have."},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"10154332100229369","commenter_b":"??????? Seriously? Crooked Hillary. I will never vote for her.","commenter_a":"The headline is B.S. and I do not mean my undergraduate degree. Hillary is brave, intelligent, tested, Democrat, progressive, public servant. Get used to it.","post_message":"Yikes. Now what?"},{"comment_id":"1105112639584987","commenter_b":"She's an embarrassment to all intelligent women","commenter_a":"Get over your love affair with Trump. It's not happening and @username looks super pathetic.","post_message":"Here's what happened in Iowa, according to Donald J. Trump."}]
