[{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"910228435682060","commenter_b":"That's why it's good she'll never be president.","commenter_a":"Communism at work! No freedom of speech if they have their way! Vote them OUT!","post_message":"Are you at all surprised by this?"},{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."},{"comment_id":"10153965204071680","commenter_b":"Vote Hillary !","commenter_a":"Bruce Moss","post_message":"Joe Biden: \"It gets down to Florida, Florida, Florida – not a joke! You all do your job, we get to go to bed early Tuesday night.\""},{"comment_id":"10155265316599199","commenter_b":"No. She was just bat s%$@ crazy","commenter_a":"Im sick of you Christians shoving your religion down our throats. Literally","post_message":"Court documents say the mother \"saw her daughter die and then placed her body in the shape of a cross\""},{"comment_id":"10153415013561509","commenter_b":"Absolutely!! Old lady's got a warrant in Egypt . she's going nowhere that's why she hides out. Please run with her.","commenter_a":"Scott Walker 2016!!","post_message":"Virtually every potential Republican candidate will make their case to conservatives this week at #CPAC2015. Learn more about it in CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat #CPAC"}]
