[{"comment_id":"10154307782959205","commenter_b":"ummm i dont think thats the chant they should be using.. wrong march","commenter_a":"Choppy feed. :/","post_message":""},{"comment_id":"10153235598706756","commenter_b":"Its when your chakras are misaligned, or your spirit animal needs a vet. The only treatment is #woofighters","commenter_a":"what exactly is \"psychic damage\"?","post_message":"Maureen Corrigan says the story \"reflects on the unearned power that beauty confers on its recipients; rather less convincingly, it also tries to make a case for the psychic damage of being beautiful in a world that's all too eager to rate women primarily on their looks.\""},{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"10153773304673869","commenter_b":"shut up, fool.","commenter_a":"It's a Prince song and it belongs to him. She just found a hit that he threw away. He was just that good.","post_message":"There's a moment in “Nothing Compares 2 U” in which a doctor tells O’Connor “Girl, you better try to have fun, no matter what you do.” The advice is patently dumb—though not unfamiliar to any woman who has ever been told to just smile."},{"comment_id":"10155326860884199","commenter_b":"lmao, and this woman is fit to be President? People have lost their everlasting minds!","commenter_a":"Hillary sucks","post_message":"Hillary Clinton is speaking at the Congressional Hispanic Caucus Institute."},{"comment_id":"10155087301336509","commenter_b":"@username once stench like you and others weeded from this country, then decency and class will return. Its your choice to be losers. Stop blaming others for your failures in life..CLASSLESS!!!!!","commenter_a":"Michelle Obama is the strongest and the women with the most elegance I've ever heard of. Hopes she stays in politics and still get involved after she leaves the White House!","post_message":"\"Don't let anyone tell you that this country isn't great. This right now is the greatest country on earth,\" Michelle Obama said."},{"comment_id":"10156548921815725","commenter_b":"Shameless lady you are shameless","commenter_a":"Can you only imagine this family in the white house! WOW They will bring back the class that our first family has been missing for the past 8 years.","post_message":"Thank you Ivanka Trump for the kind words. I am very proud of the role model you are for so many."}]
