[{"comment_id":"699619480228630","commenter_b":"@username RE-MOVE HEAD FROM ASS","commenter_a":"....and, Obama let Putin become the Hero of this War on ISIS!","post_message":"Russia is relentless bombing ISIS until they are completely destroyed. We are fully behind them. This is what needs to happen. Can we get 75,000 'LIKES' for Russia?"},{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"1128228853905897","commenter_b":"EXECUTE the QUEER ----NOW !!before this poor girl is DEAD from being RAPED by this SUBHUMAN PR*CK !!!","commenter_a":"Discusting pervert","post_message":"DISGUSTING! Muslim Migrant Men Pose with Pre-Teen Non-Muslim Girlfriends on Social Media! Obama wants these perverts in your neighborhood!"},{"comment_id":"1333556083351913","commenter_b":"Javier judging by the other comment threads on this post it seems that very many people at least in the USA disagree that those activities are as gender neutral as you do.","commenter_a":"None of this shit is new 😐 Men have always been barbers, tap dancers, ballet dancers, shoe makers, basket weavers, bakers, or tailors. What the hell is wrong with any of this stuff? More importantly... WHY are you pointing this normal stuff out as if it is odd???","post_message":"This mom is encouraging boys to do what they love — no matter what people have to say."},{"comment_id":"10153956823096135","commenter_b":"I want Michigan to win. Been a fan for many, many years !!","commenter_a":".","post_message":"POLL: It's time for The Game! The Michigan Wolverines face off against the Ohio State Buckeyes at high noon Saturday on WXYZ-TV. We want to know who you think is going to win. React to this post with a heart if you think it will be Michigan and a like if you think it will be Ohio State. You can also predict the final score with a comment. Also, if you share this post your friends can weigh in too."},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition Via Detroit Zoo"},{"comment_id":"885286484921464","commenter_b":"This woman is delusional.","commenter_a":"Bat shit crazy","post_message":"ClashDaily.com"}]
