[{"comment_id":"1068743996585956","commenter_b":"No deport non americans and those who wish to leave..escort them to Mexico..let themtry their bullshit with them..see how far they get..I am fed up with the demorats/libtards!","commenter_a":"No","post_message":""},{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"},{"comment_id":"1809165166033201","commenter_b":"You want healthcare get a job why should we pay for others","commenter_a":"You just say it and think it us true???? Lies!!!","post_message":"President Barack Obama holds news conference at The White House ahead of overseas trip. @webpagelink"},{"comment_id":"536032629890369","commenter_b":"suck a dick","commenter_a":"@username du o daniel","post_message":"Piper the abandoned pig has a new home and a new best mate (via The Dodo)"},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"771398419667869","commenter_b":"Do not trust this corrupt bitch she will promise everything Bernie says so we will back her !Bernie or bust never Hillary she can not be trusted","commenter_a":"#Bernieorbust #NeverHillary #Hillarigged #IndictHillary #RIPDNC #Demexit","post_message":"Thanks to millions of people across the country, we have the most progressive platform in the history of the Democratic Party. Thank you! And while we have made great progress advancing the important issues that brought millions into the political process, the fight is just beginning."},{"comment_id":"10153502199714087","commenter_b":"If I had any faith in Clinton. Sure. But I don't. So....","commenter_a":"My dream is that Bernie Sanders agrees to run as Hillary Clinton's vice president on the condition that Elizabeth Warren be appointed Secretary of the Treasury and Bernie gets to focus on one main goal: voter turnout! Bernie can build the revolution he's been talking about by getting everyone more involved and then we can pick up some democratic seats this year and take back congress in 2018 with progressive candidates. Bernie's task would be non-partisan voter turnout and involvement supported by a strong democratic machine finding good candidates in local state governments and for congress. This is a long term plan, one that ultimately paves the way for President Warren. Bernie wouldn't get to be president but he would give us a good 16 year trajectory to push progressive policies. Wouldn't that be lovely?","post_message":"“In the last election, the mid-term election, 80 percent of young people didn’t vote,” Bernie Sanders said.“I’m very proud we’re bringing a whole lot of young people into the political process [and] that we’re revitalizing democracy. If we’re going to change America, that’s what we’ve got to do.”"}]
