[{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."},{"comment_id":"10154645431764445","commenter_b":"Why? Herr Drumpf is a racist bigoted sexist pig","commenter_a":"Of course he's white","post_message":"BREAKING: The suspect in the deadly Washington state mall shooting is in custody, according to officials: @webpagelink"},{"comment_id":"10153814092279740","commenter_b":"Gear up and hit the streets or shut up these KEYBOARD WARRIORS Crack me up !","commenter_a":"Great Job by the Police....Suspect had ample opportunity to surrender peacefully and the KILL ZONE for an edged weapon is 21 FT..he was well within that zone and a threat to police, who are not required to retreat nor should they...","post_message":"Fla. police shot and killed a razor-wielding man suspected in a bank robbery early Saturday. Video captured the shooting:"},{"comment_id":"1296352430384784","commenter_b":"Was he still running..?","commenter_a":"HUH? Was he still in it?","post_message":"Mike Huckabee suspends presidential campaign #Decision2016"},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."}]
