[{"comment_id":"1542337212473798","commenter_b":"Anyway, porn is evil and consent can never be bought!","commenter_a":"Fact is, some women enjoy sex, some women enjoy porn, and by saying a woman cannot or should not participate, and that they are all manipulated, you are taking away their right to choose. Thats antifeminist. Further, you are aaying women, by nature, are easily manipulated and dont know whats good for them, and thats also antifeminist. I ssy, as long as a woman is freely chosing the career, and is informed of what it entails, then have at it.","post_message":"How do we make pornography better for actors and the people who consume it?"},{"comment_id":"1362884163768725","commenter_b":"A grown ass man, with a meme of a \"butthurt report\" ,shows the intelligents of trump supporters. Trump supporters and memes go hand and hand.","commenter_a":"I did not see any bitching when Obama was elected, all you cultural marxists can fill up your \"safe\" spaces and fill out butthurt reports, not that anyone cares for you snowflakes","post_message":"Whether you support trump, hate him, or don't care either way — you need to see this:"},{"comment_id":"10153309125991491","commenter_b":"Kerr, it's not the good guns with guns in the US. It's the BAD ones.","commenter_a":"He is 100% right. The attackers would've been shot down where possible. Edited for grammar.","post_message":"\"It would have been a much, much different situation.\" - Donald J. Trump"},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."},{"comment_id":"887531464615283","commenter_b":"Sorry Derek grammar police ! What a bitch seriously piss off","commenter_a":"This is why they have gay wrights and the rebel flag in the news to distract u from this been trying to tell u police state !!","post_message":"This story is going viral right now. Read the details of the case and ruling and you'll understand why. @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"10153405815803132","commenter_b":"about time....she is to good for him!","commenter_a":"Amanda Nicole Ross","post_message":"\"There have been problems for a while, so this was inevitable.\""},{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"}]
