[{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"},{"comment_id":"10153524199539641","commenter_b":"because most of them came here for money, and they are imigrants who are using the situation,not the real war refugees - the real war refugees would be happy just to be in a safe UE country,without demanding to get to the richest countries with the best social care (get money fo free and reproduce like rabbits).","commenter_a":"I'm sure only few of the refugees are children. many are young males and what is with refugees? why won't they stay at hungary? hungary is peaceful nation. i wonder why. hmh","post_message":"Anguish erupts as migrants and refugees are prevented from boarding trains:"},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"10152903748937507","commenter_b":"Women really hate unborn children.","commenter_a":"Republicans really hate women!","post_message":"Sure, let's put pregnant women in jail. That sounds like an effective use of taxpayer dollars."},{"comment_id":"10153683071398984","commenter_b":"Get the hell out bitch!","commenter_a":"Pork sandwiches for everyone.","post_message":"This Muslim tried to shame a grocery clerk into taking off her American flag pin... but instead, something amazing happened. This story is going viral across the nation..."},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"}]
