[{"comment_id":"10153945154891323","commenter_b":"Naser E. Kandjani many nations in Asia and Europe and Africa have million Muslims without conquests or wars and they were just spread by talking through Muslim merchants and travellers in these countries..you can read how Islam spread in east Africa and many Asian countries especially China Indonesia phillipines Malaysia ...all these countries have Muslims though no wars or conquests arrived there ...most Muslim nations today became Muslims without wars","commenter_a":"Anti-islam movements in Europe are treated as any political group and not called terrorist organizations ...What if there were anti Christian organization in any European country ..how will u react to it? Your double standards created extremisim in the whole world...","post_message":"'Islam has failed': Former EDL leader Tommy Robinson brings Pegida to the UK. Tommy Robinson stepped down as leader of the far right English Defence League in 2013. Alongside two former Ukip candidates, he is now setting up the UK arm of Pegida, the pan-European anti-Islam movement. Film-maker Simon Winkler joins Robinson as he prepares for Pegida’s first march in the UK."},{"comment_id":"10154939052379218","commenter_b":"@username grammar Nazi feeling smug over a typo.","commenter_a":"But hey remember Love Trumps Hate lmfao libtards and there hypocritical ways","post_message":"Police say a teen wearing a cap with a Donald Trump campaign slogan was beaten and kicked as hundreds of students staged a walk-out to protest Trump's election."},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""},{"comment_id":"1002365369819992","commenter_b":"Then why did she have a professional IT tech wipe it?","commenter_a":"The cat is out of the bag. Now they can give up the untrustworthy propaganda about Hillary.. We all know who America can't trust- Republicans","post_message":"Tomorrow, Hillary will testify in front of the House Select Committee on Benghazi. She’ll answer their questions, remember the brave Americans lost in the attack, and outline the need for our country's continued leadership abroad. Let her know you’re with her by sharing this. hrc.io/WithHer"},{"comment_id":"10153918741113854","commenter_b":"@username You stupid racist the C word that women don't like! Will be glad when people like you die out!!!!!!!!!!!!!!","commenter_a":"Barack Obama has done NOTHING to improve this country....he has improved his own lifestyle at our expense!","post_message":""},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."}]
