[{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."},{"comment_id":"10154496628933132","commenter_b":"@username she didn't say anything to the girls. She simply gave them a card. If my daughters were acting like spoiled brats I would not mind if someone put them in their place!","commenter_a":"Sorry Helicopter Mom, if I were those girls parents I'd jump down your throat for trying to police the thoughts and opinions of this group of girls, from what it sounds like to me it was the equivalent of a negative review among peers, I for one applaud the young ladies for exercising their First Amendment rights of free speech and I place the mother in question for violating those young ladies personal and intellectual autonomy","post_message":"The author and parenting expert shared the importance of being beautiful both inside and out."},{"comment_id":"10158117739325594","commenter_b":"Don't worry Stacey, I will be wearing leggings to your baby shower. Those count as pants, right?","commenter_a":"@username, @username, Elena Fraga","post_message":"Groups of people arrive at the Powell Street station — without pants — as part of the \"No Pants Subway Ride\" event. Read the full story: @webpagelink"},{"comment_id":"1231960196816235","commenter_b":"Europe and America is being invaded...Those invaders who want to hurt us are being helped by our own president Barrack Obama. I have compiled videos and links that when put together, you will have a full understanding on how our country is being invaded. Please help spread this around the country--Radio stations, tv stations, governors,mayors, groups,unions, etc. Let's not act as democrats or republicans. we all need to unite and fight for our country as Americans. @webpagelink There is no refugee crisis. The six wealthy Gulf countries Qatar, the United Arab Emirates, Saudi Arabia, Kuwait and Bahrain have offered to receive exactly zero Syrian refugees. Did you ever wonder why these countries won help their fleeing Arabic Muslim companions? One word: Hijra. Hijra is the Arabic word for , used to besiege new territories.Those travelling are able bodied strong men who are very capable of doing harm. If there are ...","commenter_a":"Let them resettle with the Federal judge in his secured gated community!!!! But not on Texas!!!!!","post_message":"Texas hit a major setback on Monday after a federal judge rejected its efforts to block Syrian refugees from resettling in the Lone Star State."},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"}]
