[{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."},{"comment_id":"1212813765463824","commenter_b":"She's lower than a snakes belly. God help us if she's elected.","commenter_a":"The Benghazi Butcher.","post_message":"This father of a Benghazi victim just shocked the CNN reporter when he abandoned the script... he wanted the world to know the truth about Hillary Clinton. This MUST get out..."},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"}]
