[{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."},{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."},{"comment_id":"10152923328206051","commenter_b":"Screw you bitch.","commenter_a":"It don't count it was just a dog.","post_message":"This guy knew his injured neighbor couldn’t take her dog out for a walk, so he offered to. While the two were out, he killed it with an ax. Guess how much jail time he got. Wrong. Less."},{"comment_id":"1362606120446523","commenter_b":"I heard about that. Those kid's were way out of bounds for doing that. But I assure you, no citizens of the United States of America are being threatened of being deported. Only illegal immigrants of any color, race or religion. Its already the law. It has been for a long time. Its just not been enforced properly. The media tries to spend it in to hate. Its not hate, although there is anger for what were allowing to happen to our country. I personally only hate terrorist. No matter where they come from. Thats why we need to band together all American citizens. We have band together against a corrupt government, illegal immigration and these terrorists. Foreign and demestic. If we can't come to terms with that as a people. See it for what it is. Than im afaid all is lost.","commenter_a":"No they don't. You continue to try and make it about Trump. It does however have a lot to do with you. The media and the government. This is your( collectively) propaganda. To continue to divide. Its not working. Not for the majority. People listen please. They are lying to you. To push their naritive. If you actually listen to Trump. Not just the out of context sound bites they feed you. He and people who support him want unity more than anything else. For America. Then we can focus on everyone else. But we have a serious problem at home to deal with first. We have to let white, black, left, right and what ever else America go!! And realize we the people. All the people. We the people of this great nation are on the same team. Thats what we are missing. Everyone is more concerned with their ...","post_message":"This is just sad."},{"comment_id":"1063405993707262","commenter_b":"@username by sitting this election out, you will be voting for Hillary!","commenter_a":"The Donald has his whole family there. Oh, and his favorite adviser - himself, his biggest fan - himself, his biggest fan - himself. Who else does he need? He's been saying all along that he will win without support. The truth is that, as much as I dislike these guys, they are basing this on principles. Laura, I used to have much more trust in you, but you've gone over too the dark side it seems. Trump is the worst candidate in my lifetime. And when you consider that includes Dole, McCain, Romney and the Bushes, that's saying a lot.","post_message":"Jeb Bush, John Kasich and company reveal they value their egos more than the GOP's success."}]
