[{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"1197525123667075","commenter_b":"Time for her to be fired!","commenter_a":"That also includes Mountain Dew, Mug Root Beer and Mist Twist, Aquafina bottled water, Propel water, Gatorade and Rockstar Energy drinks. Also all Frito-Lay products including Fritos, Cheetos, Lay's and Ruffles potato chips and Rold Gold pretzels. All Quaker products. This is only a partial list.","post_message":"Follow us for more at President Trump"},{"comment_id":"1072309979477455","commenter_b":"So basically she is happy wearing those 40 yards. If she wasn't she wouldn't be wearing it","commenter_a":"I hope she's happy wearing 40 yards of material everyday! Happiness is a warm burka....","post_message":"VIDEO: United Arab Emirates appoints first minister of happiness"},{"comment_id":"843269965740273","commenter_b":"How do you know it's a woman?","commenter_a":"It's so sad to see how judgmental people are. Opinions are like belly buttons. Everyone has one and they're filled with lint. To call this woman names and degrading her by calling her IT, is shameful. Not everyone lives inside the box or mold of society. \"Free your mind, and the rest will follow!\"","post_message":"Today's culture is damn sickening. This thing is straight from hell and should be sent back. This is ridiculous..not even funny"},{"comment_id":"1820420311530016","commenter_b":"Feminazis!!","commenter_a":"Again Liberals at their stupidest.","post_message":"Women's protest"},{"comment_id":"10154645431764445","commenter_b":"Why? Herr Drumpf is a racist bigoted sexist pig","commenter_a":"Of course he's white","post_message":"BREAKING: The suspect in the deadly Washington state mall shooting is in custody, according to officials: @webpagelink"},{"comment_id":"519948784859162","commenter_b":"They should be deported","commenter_a":"yes","post_message":"Students Replace ‘Under God’ With ‘Under Allah’ In Pledge. If you are going to live in our country, you should respect our culture. Do you think this is wrong?"}]
