[{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"},{"comment_id":"1343052442401891","commenter_b":"@username She also stated that she was going to get her 'presidential kneepads' Brenda. She knew exactly what she was doing! So, get over it already. Trump has cheated on both previous wives, and is now with the scary looking mrs strumpit.","commenter_a":"I love watching Bill do things like that. he's so good at it","post_message":"Because it's fun to watch them squirm."},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"},{"comment_id":"10152986192691491","commenter_b":"You're an odd little woman","commenter_a":"Malala is big drama queen , thousand of girl are raped and kill no body knows why malal","post_message":"Malala gunmen secretly set free in Pakistan @webpagelink"},{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"10152709124101545","commenter_b":"And a healthy sex life;) lol love u baby!!!","commenter_a":"Me and @username have been married 13 years.... Trust, communication, honesty, & endless love... Agree on things, if you don't, work it out. Don't keep money from each other, if your having problems sit down and go over your financial obligations. Set a budget. Go to parent conferences together to understand your child's growth and development ... That simple","post_message":"Do you know the secret to a long and happy marriage? We want to hear from couples who’ve been married 25 years or longer to get advice on making it work. Comment below, and we may reach out to you for an interview."}]
