[{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"863141660412250","commenter_b":"I can't belive some young women want to pay tons of money for this,keep poppin those Skittles and you'll look like that in no time!","commenter_a":"Sorry but it's hard for me to feel sorry for these customers. One ounce of common sense would tell you....Do not let this person inject me with anything!!","post_message":"Toxic butt ‘doctor’ stuns court with her backside."},{"comment_id":"10153328594703132","commenter_b":"She needs to just quit. Can't stand her","commenter_a":"Jennifer Lesher","post_message":"\"I do not want to use my comedy to contribute to a culture of unattainable perfectionism and intolerance towards difference.\""},{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"},{"comment_id":"10153639349621636","commenter_b":"It was 25 degrees when I got off at Gatwick-hotter than the Med!","commenter_a":"What do you say POMY wimps!!","post_message":"'I think it might be too hot'"},{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."}]
