[{"comment_id":"1153743537971235","commenter_b":"She needs to be in prison!!!","commenter_a":"Really! I don't believe it! Her conscience must be getting to her. But I doubt it. Are they trying to make us feel sorry for her?","post_message":"Is this the real reason Hillary has so many \"issues\" when it comes to her health?"},{"comment_id":"1203286669686614","commenter_b":"I am not sure where you, Harry Reid are coming from. This bill is not for or against immigration, it is against illegal immigration. Why are you against protecting the USA against illegal acts? The best thing we can do for the USA is have the exact same law for illegal immigrants as our neighbors to the south. Let us have the same illegal immigrant laws as Mexico, then there will be no thought or comments about being wrong or too tough. Yes?","commenter_a":"The vilest thing in the Congress are you sir!","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."},{"comment_id":"1676679282547936","commenter_b":"The women do have a choice... Unless they revolt.","commenter_a":"her crime was that his dinner was served to late by his wife and it was too cold for his liking..... Why would ANY woman marry a Muslim man? .... Even a Muslim woman.......","post_message":""},{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."},{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"10153752277268984","commenter_b":"Hell No!!! Women in combat will be a liability and not an asset!!! I am all about women achieving their highest, but to EVER say a woman physically has the same strength as a man, is absolutely false!! Our culture teaches males to protect females, our Military does NOT need that liability in battle!!!!!","commenter_a":"Sorry ladies but I feel that only a few of us can fit certain gender roles in many male jobs. No standards should be lowered to make women fit . Some can apply but not all can make it.","post_message":"Shortly after the US military lifted its ban on women serving in combat, the Marine Corps began a year-long experiment - here's the result... What do you think about women serving in combat?"}]
