[{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"10152964410961130","commenter_b":"It's Bush's fault Duh","commenter_a":"If they'd have shot him it would be all because he's black & a victim of the evil white man lol","post_message":"Have you seen this man?"},{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."},{"comment_id":"10154164118946167","commenter_b":"Legal immigrants!","commenter_a":"There has got to be individual discretion involved in these cases. It's ridiculous. We are a nation of immigrants. We all come from an immigrant somewhere down the line!","post_message":"A Cambodian-American spoke out today about how inhumane Trump's immigration rhetoric is. This is an interview that a lot of people need to see."},{"comment_id":"1238344686206387","commenter_b":"This is so nice to see. Females in this world matter very much.","commenter_a":"Jean Daniel Boixo","post_message":"These young Pakistani girls are aiming to knock out gender stereotypes. (via NowThis)"},{"comment_id":"10150710732969999","commenter_b":"@username Under Trump she would probably be stopped from entering the US.","commenter_a":"Now watch Trump dismiss this intelligent young Muslim woman with a bigoted insult as his ignorant fans cheer him on.","post_message":"\"Well, that’s really tragic that you hear these comments which are full of hatred, full of this ideology of being discriminative towards others,\" Malala Yousafzai said in response to Donald J. Trump's remarks on Muslims."},{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"}]
