[{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"484808285062410","commenter_b":"Illegals are actually working for money other than the \"Americans\" begging for money on a corner","commenter_a":"I bet he had a taster for it too. Give away our jobs, let illegals in, give them government money, they never earned, and let the American people suffer. What a great President.","post_message":"President Barack Obama drinks filtered water in Flint, Michigan during a briefing on the ongoing water crisis."},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"1362606120446523","commenter_b":"I heard about that. Those kid's were way out of bounds for doing that. But I assure you, no citizens of the United States of America are being threatened of being deported. Only illegal immigrants of any color, race or religion. Its already the law. It has been for a long time. Its just not been enforced properly. The media tries to spend it in to hate. Its not hate, although there is anger for what were allowing to happen to our country. I personally only hate terrorist. No matter where they come from. Thats why we need to band together all American citizens. We have band together against a corrupt government, illegal immigration and these terrorists. Foreign and demestic. If we can't come to terms with that as a people. See it for what it is. Than im afaid all is lost.","commenter_a":"No they don't. You continue to try and make it about Trump. It does however have a lot to do with you. The media and the government. This is your( collectively) propaganda. To continue to divide. Its not working. Not for the majority. People listen please. They are lying to you. To push their naritive. If you actually listen to Trump. Not just the out of context sound bites they feed you. He and people who support him want unity more than anything else. For America. Then we can focus on everyone else. But we have a serious problem at home to deal with first. We have to let white, black, left, right and what ever else America go!! And realize we the people. All the people. We the people of this great nation are on the same team. Thats what we are missing. Everyone is more concerned with their ...","post_message":"This is just sad."},{"comment_id":"10154969261836320","commenter_b":"So sad Amen","commenter_a":"Dammm i had no idea","post_message":"We're remembering actress Brittany Murphy who tragically died in Los Angeles on this date in 2009. She was just 32."}]
