[{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."},{"comment_id":"636469079877004","commenter_b":"Send her back to her own country so she can mooch off of their welfare system, not ours! We have more than our fair share of moochers as it is!","commenter_a":"Send her back really quick........","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10157692463425389","commenter_b":"Hillary will win due to the corruption within the establishment, and the votes of illegals and dead people!!","commenter_a":"Never permit the Federal government to pass into the traitorous hands of Hillary Clinton","post_message":"Keep in mind-he actually did these things."},{"comment_id":"10154289283474149","commenter_b":"Why does she keep hitting he neck","commenter_a":"Push it out already lol.","post_message":"We're on #GiraffeWatch2017! When do you think the baby giraffe at Animal Adventure Park will make its debut? Read more: @webpagelink"},{"comment_id":"10152995985561130","commenter_b":"shes such an ass!","commenter_a":"@username lol","post_message":"What the..."},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"},{"comment_id":"10153118428724641","commenter_b":"Those blood sucker should come to Malaysia to joining in our corrupt club here without fear... They really stupid because Malaysia only protect the corrupt rich...","commenter_a":"Must be getting ready for something if they want more people back to their country.","post_message":"150 corrupt Chinese officials may be hiding in the U.S. And China wants them back cnnmon.ie/1M6Of5q"}]
