[{"comment_id":"10153123096616770","commenter_b":"They'll leave on their own !","commenter_a":"Send back the illegals!","post_message":"Donald J. Trump wants a “deportation force” to remove the illegal immigrants currently living in the United States."},{"comment_id":"10153092888622507","commenter_b":"I like planned parenthood because it will finally rid all the blacks from the US","commenter_a":"Woman, can you say Obama care? You dems rammed it down my throat saying it would take care of all medical needs. Aren't women part of this? Why should I help pay for obamacare and planned parent hood too!","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"10153837326772293","commenter_b":"To know how irresponsible and corrupt a candidate is, is worthy to know. Even the main stream news, democrats and the I.A report denouncing Hillary of improper acts in office is added to her bungling of Libya and other important areas. You can't make this up. I'm sure if even convicted of treason her stiff supporters would kiss her ring before she flew away on her broom.","commenter_a":"Thanks for that pearl of wisdom Newt. While you were trying to impeach President Clinton, you and Hyde, Livingston were having affairs of you own..hypocrisy much!!","post_message":"“Part of it is, he’s just trying to throw stuff in the air and keep her rattled,” Newt Gingrich said."},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10153428723486636","commenter_b":"no thank you","commenter_a":"No wonder @username is no longer going to print-regurgitating 8 month old articles without cause to is pretty embarrassing.","post_message":"The WHAT?"},{"comment_id":"10153085738765163","commenter_b":"Yep @username. Sophia was a crazy cat lady. Lol","commenter_a":"Renee Rudd","post_message":"SHE WINS. 😂💛😸"},{"comment_id":"1802126320030739","commenter_b":"I still say his daughter should be charged with inciting a riot! All damages, and the protester that was killed. I still think she was doing all of this to get a paycheck from the city. No difference between her and Browns momma in Ferguson Missouri. Remember her jumping up and down on somebody's car screaming \"Burn this mother*ucker down\" referring to the city! Was she charged? Hell no, I still wonder if she got paid ? Bitch should have been buried under the jail.","commenter_a":"Ah, more clickbait. Headline: Dash Cam Footage Released. Story: Police are not releasing the dash camera footage because..... Gotta love the manipulative lies in these article headlines that these sites put out just so they can get paid per click to the site.","post_message":"Riots have critically wounded one already and now it's proven he had a gun, not a book..."}]
