[{"comment_id":"593997884104848","commenter_b":"God help us all...God please Bless America! No Hillary!!!","commenter_a":".......President means MAN! .amen.","post_message":"Nancy Pelosi said confidently today that Hillary Clinton will be the next president of the United States. Do you hope she's right?"},{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"1344505415570466","commenter_b":"yes 1999 ...only recently explore in earnest","commenter_a":"Actually it was found few years ago.","post_message":""},{"comment_id":"788040247961250","commenter_b":"you were pounced on by women....","commenter_a":"I feel so sorry for him. When did we as a people become so cynical, unfeeling, intolerant and belittling. He made an old person's mistake - we old farts are often out of sync with the modern culture - it's not a crime. Did anybody consult the women he worked with before they dumped him??","post_message":"\"They haven’t even bothered to ask for my side of affairs.\""},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"1621412104829954","commenter_b":"She needs to go and climb under a rock","commenter_a":"This woman is disgusting.....","post_message":"Lady Gaga just stunned her fans when she wore this out in public..."}]
