[{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"},{"comment_id":"10153249437958701","commenter_b":"What about whores?","commenter_a":"Taking offers on souls in exchange for this perfect diamond. Virgins get first preference.","post_message":"It's a 100-carat diamond, considered by experts to be \"perfect,\" and it's going on sale. Watch the full story, later tonight."},{"comment_id":"1256330341086427","commenter_b":"I recently read an article where he said he doesn't change diapers and taking care of the kids was his wives' responsibility, so I think it's fair to say he probably has zero understanding of fetal development and pregnancy. This is a man, after all, who called a breastfeeding woman disgusting for needing to pump breast milk. Fun fact-Donald Trump is not the only man who has no idea what he's talking about in this arena. I had a friend who had to explain to a coworker, who was a father of THREE children, that breastfeeding women need to pump at work because they cannot start and stop lactation at will. Guy thought a breastfeeding coworker could just wait until her 8 hour shift was done to start lactating, and was disgusted that she stored her breast milk in the fridge.","commenter_a":"As a C-Section baby myself, I was scratching my head for a good long while after he said that. I don't understand how a seventy-year-old man with five children (and a few grandkids!) could be *that* ignorant of childbirth!","post_message":"“It is, of course, such an absurd thing to say,” one doctor said. “I’m unaware of anyone that’s terminating a pregnancy a few days prior to delivery of a normal pregnancy.”"},{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"},{"comment_id":"497157623808151","commenter_b":"Oh but their day is coming!!! We will show up one way or another!!!","commenter_a":"Obama sucks","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"1619560758331037","commenter_b":"This bitch needs to be taken down so sick of her throwing other people under the bus she's just as guilty as them. Take her out!","commenter_a":"SHE MAY RUN...BUT YOU DO NOT HAVE TO VOTE FOR HER! THE RED CARPET WAS YANKED OUT FROM UNDER HER BEFORE...IT CAN HAPPEN AGAIN! BENGHAZI MURDERESS IS NOT PRESIDENTIAL MATERIAL!! THE CLINTONS N' OBAMAS ARE FINISHED!!","post_message":"Hillary Clinton MUST be stopped!"}]
