[{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."},{"comment_id":"853999368022756","commenter_b":"He's a busy man filing all his bankruptcies!!! Lol","commenter_a":"His excuse for failed marriages is hes a busy man. Whats his excuse for all his bankruptcies.","post_message":"Trump admitted that his marriages aren't traditional but claimed that it's different for him because he a \"hardworking person.\""},{"comment_id":"10155373271046509","commenter_b":"Megan Kelly spoke with her for less than five minutes and all that was uncovered was that this chick lied. That's enough for me.","commenter_a":"cheap attention. sorry, but this is pathetic","post_message":"\"He was really aggressive. He was really rude. He was a bad person with me.\""},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"},{"comment_id":"10154770919726037","commenter_b":"There isn't any suspense. I think we all know what Trump's reaction will be when he loses...","commenter_a":"He answered truthfully. We'll wait and see. It was a gotcha question for which there is no correct answer.","post_message":"“I’ll keep you in suspense.” - Donald J. Trump"},{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"}]
