[{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"10154916215254330","commenter_b":"She should be arrested and lose her job.","commenter_a":"I am not saying this is right but I have seen countless similar things of people doing this type of thing to images of Obama so everyone should just chill with the outrage , where was the outrage when it was Obama images being hung !!","post_message":"The video shows a woman pointing what appears to be a toy gun at a video of President Donald Trump and pretending to shoot at him several times, saying \"Die!\" ---> @webpagelink"},{"comment_id":"10153371654068855","commenter_b":"She's just trying to get famous.","commenter_a":"...why can't this bigoted bitch comprehend and accept REALITY?! (well, because she is an ignorant, bigoted, discriminatory and hateful bitch! - and perhaps soon-to-be unemployed, too!!!)... Government Employees Have No Freedom Right To Refuse Service To Same-Sex Couples, Says Americans United Jul 8, 2015 Clerks Must Issue Marriage Licenses To All Qualified Couples, Church-State Watchdog Says Government employees who oppose marriage equality because of their religious beliefs are not entitled to refuse service to same-sex couples, Americans United for Separation of Church and State has informed officials in all 50 states today. In a letter released today, which will be sent to all state attorneys general as well as county clerks in Texas and South Dakota, Americans United explains that with marriage equality now the law of the land, government employees do not have the right to opt out of serving gay couples, because doing so would harm those couples ...","post_message":"You have to do your job, Kim Davis!"},{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"10155485619961509","commenter_b":"Hillary is. Not a woman! She is a devil!","commenter_a":"Trump: Nobody has more respect for women than me, believe me.... 20 mins to Hilary \"What a Nasty woman\", this clown is the biggest joke ever.","post_message":"Hillary Clinton, citing Bernie Sanders, calls Donald J. Trump \"the most dangerous person in modern history to have run for president.\" @webpagelink"}]
