[{"comment_id":"850737528316277","commenter_b":"Does anybody realize the U.S. has 5,525 miles of border with Canada and 1,989 miles with Mexico. Our maritime border includes 95,000 miles of shoreline. How do you propose to secure this border? How do you propose to identify and round up 11 million people and deport them? I would really like to hear your reasoned proposals.","commenter_a":"just do it already.","post_message":"Don't you think we should start enforcing CURRENT immigration laws?"},{"comment_id":"10154755616704726","commenter_b":"53% of white women voted for TRUMP !!!!!","commenter_a":"They should have nominated an honest, personable candidate, and maybe, just maybe they could have won. Hillary was the very worst candidate, with way too much baggage. It had nothing to do with gender. Most women would have voted for a woman who had not lied and had not been under FBI investigation. Wikileaks showed just how dishonest her campaign was.","post_message":"Grieving Democrats and pundits point to gender bias as a culprit for Trump's win — but an October poll disproves them."},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."},{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"1741973229385885","commenter_b":"Cus your race isn't nearly as low as the natives or Jews and why do you think you deserve it the Jews didn't get land they might of got paid....but I witness frist hand blacks recive way better benefits then whites or natives.... so natives got land Jews got money blacks got freedom with rights along with benefits what makes the blacks so special to recive more","commenter_a":"Of course, it's okay for them to be racist, but when white people say something we get beat up. Love hypocrites","post_message":"Brian Ogle's mother says her son responded to students wearing Black Lives Matter T-shirts at his school with \"Blue lives matter,\" a defense of police officers. Officers found him bleeding on the ground after a homecoming football game."},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"1048574538534260","commenter_b":"Please vote for Trump , Wisconsin !","commenter_a":"The career politicians in the runnng - all of them except Mr. Trump, have had many opportunities to do their job of protecting us, providing good paying jobs, help get a handle on the ever-increasing debt - - and they have done Nothing, but bask in the political paradise they have created - - getting paid with our valuable tax dollars to do nothing but make matters worse. I hope Wisconsin voters will not allow themselves to be bamboozled into voting for more of the same for the next 4 years. I don't think this country could take it. Trump 2016 !c","post_message":"My new radio ad, airing today in Wisconsin! See you soon! #MakeAmericaGreatAgain"}]
