[{"comment_id":"1043155299071968","commenter_b":"She is disgusting.","commenter_a":"She's scummy just ignore her 5% I Q","post_message":"JENNIFER LAWRENCE Recalls Attending Same Concert As Trump: “I was adamant on finding him and then making a video of me going, ‘Hey Trump, f*ck you!’” [VIDEO]"},{"comment_id":"10154199913475530","commenter_b":"You told me about them n we used to look for my Riverland park","commenter_a":"@username Remember us searching for these when we were kids?! Lol","post_message":"Get outside and train your eyes onto the forest floor. Morel season is on in Michigan."},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"10153452421356323","commenter_b":"\"Tear down this wall.\" ;)","commenter_a":"America will elect a Socialist when China democratically elects Ronald Reagan as its President.","post_message":"If Democratic socialist Bernie Sanders is elected president of the United States, how do you think it could impact global politics?"},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"}]
