[{"comment_id":"1294378153962270","commenter_b":"Look in the mirror bitch","commenter_a":"I aint spending no money on this hoes lmao","post_message":"Blac Youngsta claims none of the strippers looked good! #WSHH #BlacYoungsta"},{"comment_id":"10155252266929411","commenter_b":"Wheres the music coming from?","commenter_a":"77","post_message":"#1917LIVE: The sun sets on the Russian Empire Romanov rule is collapsing. Martial law imposed in #Petrograd. Authorities fear violence can erupt anytime. Russia is like a boiling cauldron, that can explode at any second. Follow #1917LIVE - Retweet the Revolution @webpagelink @webpagelink/ 27.02.2017"},{"comment_id":"10155063304006350","commenter_b":"She's 100% right. She's a true narcissist, there would be no room for a child.","commenter_a":"not everyone is and that's totally fine. I hate when people keep asking childless women and insisting. LEAVE THEM ALONE!","post_message":"One role Oprah Winfrey insists she wasn't suited for: motherhood."},{"comment_id":"1003687313057656","commenter_b":"The tears flow as I watch and read this... For all of you Christian Conservatives out there, REPUBLICANS IN CONGRESS PARTICULARLY, we need to open our hearts and welcome the Syrian refugees in, otherwise we cannot call ourselves \"CHRISTian\". The refugees will be vetted over a 2-3 year period ~ they're not coming tomorrow. Be compassionate ~ that is what we are about here in the USA, remember our quote on the Statue of Liberty, which was a gift to us from France (!), welcoming immigrants and refugees: \"Give me your tired, your poor, your huddled masses, yearning to be free.\" How about we practice what we're preaching with this message?","commenter_a":"Tears.","post_message":"Watch this and you will get chills. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"10152941804948869","commenter_b":"Women in bed with marxism again...","commenter_a":"No, the world needs more female rockers...not more critics","post_message":"\"The problem for women is that our role in popular music was codified long ago.\""},{"comment_id":"472562882934292","commenter_b":"She's a want to be Queen A Big Not she's not the first ya got it .","commenter_a":"that woman definitely needs therapy posing as a queen lol dream on woman","post_message":"Michelle tried to do something absurd, but USPS shut her down. Awesome, it's about time someone told her 'no'. Do you support the post office's stand against Michelle?"}]
