[{"comment_id":"10156809440295725","commenter_b":"Time to get tough with these vermin muzzies. We need to kill them before they kill us. Wake up, America, this is not CandyLand anymore.","commenter_a":"It is time! We have been too relaxed on this matter for too long. It is not that we do not love and welcome diversity and other nationalities and cultures into the amazing USA; however, we must have order and we must have processes in place to be proactive rather than reactive about our safety. We must take care of the people in our country first and then use the wealth that those resources will bring to help others throughout. My mother always said, if you cannot take care of yourself first, you cannot take care of anyone else and that simple advice applies here greatly.","post_message":"As president- I would be very, very tough on the borders, and I would NOT be allowing certain people to come into this country without absolute perfect documentation!"},{"comment_id":"685743394925463","commenter_b":"Someone just lock her up! Please!","commenter_a":"Hillary needs life","post_message":"The double standard..."},{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"10153378576094087","commenter_b":"*you're","commenter_a":"your a SKANK!!!","post_message":"First Lady Michelle Obama and SNL player Jay Pharoah spit a sick bunch of dope rhymes in a new CollegeHumor rap video about how awesome it is to go to college. WATCH:"},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"1567244033571398","commenter_b":"Good and take all those bitches from the View.","commenter_a":"Move. That will even make America Greater.","post_message":"ClashDaily.com"}]
