[{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"1287852217938587","commenter_b":"Don't worry Hillary is gonna make it all go away!","commenter_a":"everything is so simple, what would you do if you were in their place?? if you were from the illuminati or some sort of influence to the world?? right? we would do whatever it takes, use the media and technology or any type of power given to us to lie to ppl to influence the. and make them thing whatever we want to think...population control","post_message":"Now that we finally know the Orlando shooter's real motive, the question remains: why did the FBI try to hide it for so long?"},{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"10154551778899411","commenter_b":"@username You are a troll ass bitch.. You are as disgusting as the photo of your ass in your profile.. punk...","commenter_a":"I wouldn't get \"teary\" about it. Lol. Trump is digging his hole deeper and deeper the more he opens his big know nothing mouth! This draft dodger accepted a purple heart from a Vet who \"earned\" it which is as low as you can go. Than after that he kicks a crying baby out of his event. Trump will do himself in without anyones help!","post_message":"Mr. Smith told news.com.au that Mr. Trump's \"fat pig\" comment illustrated a \"darkness in his soul.\""},{"comment_id":"10153740918402217","commenter_b":"Good for the women!","commenter_a":"Or are they being left to clean up the rubbish left by the men? When it all goes wrong, people of the masculine variety will blame the women when it was 3 of their number who screwed it up in the first place!","post_message":"It may be a watershed moment."},{"comment_id":"10153123601201051","commenter_b":"Every one that supports this is freaking stupid put the bitch in jail than when she is ready to pop take the baby put the child in a good home than hang the bitch...","commenter_a":"The woman in this picture is not 7 weeks pregnant. It is also her choice to make not mine.","post_message":"This woman is planning on having an abortion - but she says she'll cancel it on one condition."}]
