[{"comment_id":"10155465475828797","commenter_b":"The president of Mexico is worried that if the drugs stop coming into the US , he will lose lots of money! Plus if all the Mexican criminals are send back , Mexico will be in more havoc !","commenter_a":"We The united states of America want President Trump to build a Border Wall just like Mexico! Also I would like to see the same Mexican LAWS on immigrants coming into their country, the same Mexican Law's in United States","post_message":"WATCH LIVE: Sec. of State Rex Tillerson and DHS Sec. John Kelly hold a joint press conference Thursday in Mexico City after meeting with Mexican officials, including President Enrique Peña Nieto."},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."},{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."},{"comment_id":"10153831819518598","commenter_b":"Glad she doesn't love me","commenter_a":"Love is always a good reason to murder someone isn't it.","post_message":"Woman Writes: “I Had an Abortion Because I Love My Son”"},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"1753098654934241","commenter_b":"I'm not making this Woman commit suicide, and I'm not the one to stop her.","commenter_a":"Jump bitch.","post_message":"She wants to end her own life."},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"}]
