[{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"10153840278814497","commenter_b":"That would put a LOT of male caucasians over 30 out of country.","commenter_a":"50% Talent competition and 50% swimwear competition.","post_message":"Step 1: Filled-out refugee application materials are thrown onto a large, unorganized pile of folders on a desk at the United States immigration headquarters"},{"comment_id":"10156255636920354","commenter_b":"At least admit you got beat up by thugs...","commenter_a":"To bad the band did not hit him in his lying liberal mouth.","post_message":"Things are about to get VERY interesting..."},{"comment_id":"10154507086148984","commenter_b":"She was instructed to keep her hands on the dash...smh","commenter_a":"Not even surprised by this video, their false narratives always fall apart.. And instead of rendering aid to her boyfriend she continues to record, can't be more self-centered than that.","post_message":"Right after Philando Castile was identified as the man killed by police, people started talking about what a wonderful guy he was. But we've found video of what he was caught doing to a helpless child before he was killed, and it will make you sick. Don't expect to hear about this anywhere but here..."},{"comment_id":"963311450392051","commenter_b":"WILL MR. TRUMP STAY AHEAD ?! - @webpagelink","commenter_a":"Iiar liar pantsuit on fire.","post_message":"Hillary has been a champion for everyday families her whole life. That's why she's running for president."}]
