[{"comment_id":"1128329537202466","commenter_b":"That says it all! Those flag burners and dissenters can leave.","commenter_a":"I'm a proud veteran too.","post_message":"I'm A PROUD AMERICAN!!"},{"comment_id":"10153384836141756","commenter_b":"And they're thin from getting anal leakage from eating all that spam!","commenter_a":"And they are still thinner!","post_message":"South Koreans eat three times as much Spam per capita as Americans. Customers buy it in bulk packages and as fancy holiday gift boxes. \"It's a luxury that really has kind of cemented itself in Korean society,\" says the president of a food tour company in Seoul."},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"1163610097050858","commenter_b":"So you would prefer a lying heartless uncaring self serving witch? Who tried to play down her predator husband's affairs.","commenter_a":"Trump is only for Trump and now the Republican Party is his new trophy...Good Luck GOP....I am out of there for good","post_message":"More great content from our friends over at Team Trump!"},{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"445713658965481","commenter_b":"Time to start rounding up these radicals. They will destroy everything","commenter_a":"Is time to retaliate! !! A good MUSLIM IS A DEAD MUSLIM. ... kill them all ......","post_message":"A Florida College Student was Brutally Attacked by Five Muslims On Patrol Enforcing Sharia Law. @webpagelink"},{"comment_id":"10155217718349411","commenter_b":"Sanders is most sensible politician than other American leaders the only guy who is not a Zionist boot licker long live socialism Nothing wrong in being socialist , socialism is the best ideology that distributes wealth equally there is never extreme rich or extreme poor in socialist societies take examples from Danmark , Finland , Norway etc you see how well they are doing","commenter_a":"Donald Trump is your President! Because I'm American hispanic and I'm tired of how all of these coward racist liberals that hate America like Obama, and his supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":""}]
