[{"comment_id":"1294109124000954","commenter_b":"Not crazy just tired mostly gonna watch YouTube and eventually fall asleep","commenter_a":"Americas doomed if trump becomes president same can be said about hilary just sayin","post_message":"Glenn Beck caught his listeners off guard today with THIS massive announcement. He's been one of Donald Trump's harshest critics, and no one thought that this would happen."},{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"10153352524191179","commenter_b":"B**ches","commenter_a":"No class!...it really starts at home","post_message":"Arizona high school students' racism even offends Arizona"},{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10154220565880575","commenter_b":"This is why immigrants need to be vetted and illegals should be shipped out of USA. TRUMP/PENCE","commenter_a":"Sunshine patriots, you'll do as you're told.","post_message":"Mothers of slain children killed by illegals hold protest in front of Paul Ryan's home."},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"}]
