[{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"},{"comment_id":"10156240313260551","commenter_b":"This post is a waste. If you have 1/2 a brain you have known for over 6 years that she is a racist.","commenter_a":"IF....all the white folks were gone from this country, there wouldn't be enough others to support the welfare system or the Obama's income......hummmmm.","post_message":"This woman is RACIST!"},{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"10154413356958701","commenter_b":"Well that sounded racist against whites to me ALLLLLL LIVES MATTER IF U R BREATHING THAN U MATTER EVEN THE DECEASED MATTERS WE DONT FORGET ABOUT THEM SO EVERY BODY AND SOUL WHETHER ALIVE OR DEAD MATTERS SO STOP THE HATRED","commenter_a":"Scary! Those dens of racist hate are all over the country.","post_message":" do not say police lives do not matter, we do not say all lives do not matter, said Right Reverend W. Darin Moore. we do not apologize that we boldly say, and unapologetically and uncompromisingly declare, black lives matter."},{"comment_id":"10158299454390206","commenter_b":"Then get the hell out.","commenter_a":"I will pay for the firing squad bullets! Now.","post_message":"Chelsea bombing suspect is apparently a United States-hating homophobe @webpagelink"}]
