[{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."},{"comment_id":"566760130115693","commenter_b":"lol women are objectifying themselves! they love the attention! women are one the most hypocrite creatures in the world!","commenter_a":"Females are excepting this behavior. It goes both ways..","post_message":"The #WomenNotObjects campaign wants advertisers to know that consumers are fed up with how females are portrayed in the media."},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""},{"comment_id":"798386106976830","commenter_b":"MORONIC BITCH","commenter_a":"That shrill is so revolting! Don't know who is more disgusting, Conway or Trump!","post_message":"Maybe she really doesn't know better? Or is just plain stupid?"},{"comment_id":"10153376239848984","commenter_b":"Kill the fucking idiot","commenter_a":"He is now someone's girlfriend...","post_message":"He stabbed a police officer 14 times and what he said here was even WORSE. Do you think this criminal deserves life behind bars after this?"},{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."}]
