[{"comment_id":"10153122280259877","commenter_b":"Beautiful girls. Happy birthday","commenter_a":"Happy birthday Sasha,,,my twin girls birthday is today,,14yrs old","post_message":"We are wishing #SashaObama a very HAPPY BIRTHDAY today!! COMMENT to sign our #GrioBirthdays card for Sasha!!"},{"comment_id":"1857128867864045","commenter_b":"What about the insane amount of lying going on in the White House right now? I haven't heard you talking about that.","commenter_a":"So lame.","post_message":"Please check out our 2nd Facebook live town hall right here!"},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."},{"comment_id":"916180815144838","commenter_b":"She is still the best when compared to the other guys. Run, Hillary, Run.","commenter_a":"Rut-roh!","post_message":"Are Clinton's numbers doing better or worse since she formally entered the 2016 race?"},{"comment_id":"10153755876406337","commenter_b":"Fuck that hoe","commenter_a":"So I guess they're never ever ever getting back together","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"}]
