[{"comment_id":"512673055591027","commenter_b":"She's such a joke.","commenter_a":"Why can't this woman get a job and shut up?","post_message":"Sarah Palin says she will work to defeat House Speaker Paul Ryan by backing his primary opponent in Wisconsin. @webpagelink"},{"comment_id":"1017271401662888","commenter_b":"Yes","commenter_a":"Yes","post_message":"A University of Texas/Texas Tribune Poll found Texan voters say illegal immigration is the greatest threat to the U.S. -- DO YOU AGREE? Comment with YES or NO"},{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"476667025791225","commenter_b":"I agree","commenter_a":"He's right on!","post_message":"Donald Trump spoke out against gun-free zones in last night's debate, calling them \"target practice for the sickos.\" Agree or disagree? Via Opposing Views"},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"10153514569274228","commenter_b":"@username, although they were religious and studied the bible, they were vehemently against forming a national religion and/or intertwining government and religion.","commenter_a":"This is garbage. Separation of church and state was never and will never be a thing in the cultural vacuum that is the American bible belt.","post_message":"Not everyone is pleased with the new decals"},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"}]
