[{"comment_id":"10154244908884778","commenter_b":"So even if u were be low society's best u would deserve to die ? That's where we should bring some type of responsibility to the government for bringing drugs into this country in order to rid certain races but we don't punish the king pin we look down on those trapped by the government SMDH!! Wake up people white black Puerto Rican Asian r all using drugs of some sort the majority of those being punished are black people & this has been going on for decades!! SLL LIVES MATTER @username I guess you & all your family is perfect so go to work or at least get off my post","commenter_a":"That's a COP OUT pun intended !! Those officers need to be accountable for their actions!! Money won't bring Freddie Gray back SMDH","post_message":"#BREAKING: Baltimore officials came to a $6.4 million wrongful death settlement with Freddie Gray's family on Tuesday, our news partners at the Washington Post report."},{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"},{"comment_id":"964102913657572","commenter_b":"I guess he's not a good Christian !!!!!!!!!!!","commenter_a":"who is he?","post_message":"Americas Freedom Fighters"},{"comment_id":"10153013352396336","commenter_b":"Once again, an illegal alien!","commenter_a":"sounds like sabo tage to me. maybe even terroristic.","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."},{"comment_id":"10153456187686615","commenter_b":"That chick must be high","commenter_a":"Please everyone lets leave her in an empty room. I seriously don't understand how anyone could like her!!","post_message":"JUST IN: Hillary Clinton's campaign says the Democratic presidential candidate will be making a stop in Pittsburgh next week."},{"comment_id":"1172311699525637","commenter_b":"Fuck You! Get off your fat ass and get a fucking JOB!","commenter_a":"All I can do is laugh","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"}]
