[{"comment_id":"620923104721955","commenter_b":"😂😂😂 dumb ass girl","commenter_a":"Cukukrazi Sociallyawkward Arsonist Tweak Monsta 😂😂","post_message":"This Is Terrible!"},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."},{"comment_id":"1744094332472035","commenter_b":"You fix it by following the laws already on the books and securing the borders. Start deporting anyone here illegally and fine businesses that are hiring them. When they see there's no work for them and we are serious about catching and deporting them most will pick up and leave.","commenter_a":"That's a real question but few are willing to answer without being labeled a bigot or racist. The immigration problem is very real and here is a clear example of how the illegal community drains resources for American citizens.","post_message":"During a heated exchange, Tucker Carlson asked immigration activist Jose Antonio Vargas if it’s fair for illegal immigrants to take coveted scholarships from American citizens. @webpagelink"},{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."},{"comment_id":"593396500847956","commenter_b":"Hillary Clinton may or may not be Chuck Norris in drag #bitchesgetshitdone","commenter_a":"Hilary may or may not have killed a man with her bare hands in a NOLA speakeasy. In 1983 or 1991. #ComeySpeak","post_message":"Both the left and the right have criticized FBI director James Comey for how remarkably vague his letter was."},{"comment_id":"494998494021091","commenter_b":"Probably because nobody wants to get that shit all over their car. I know I wouldn't.","commenter_a":"Diane Abramson, seriously, how has nobody \"accidentally\" run over Cruz in a crosswalk yet?","post_message":"The man behind Donald J. Trump's Muslim ban is on Ted Cruz's list of trusted experts."},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"}]
