[{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"10153834571832439","commenter_b":"Because we have a pussy in the White house","commenter_a":"Like no!","post_message":"Why? These migrants are coming to our countries from failed, devastated cultures. When and why was it decided that we have to mute and censor our traditions and mores for theirs - a failed society that suffocates and destroys."},{"comment_id":"10158129645930015","commenter_b":"We don't want a wall.","commenter_a":"I live in mexico , but do you know that all the money invested on that stupid wall , it will come out from your pocket , American taxpayer will pay for that wall ,not us, we ain't paying that thing, we have bigger problemas than that ,good luck with your wall","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"10154831608750211","commenter_b":"Selfish whiner","commenter_a":"What a crock of crap. Just trying to get some attention and get noticed as someone \"special\". Whatever......his loss.","post_message":" don feel accepted in the White House. With the president having so many strong opinions and prejudices I believe certain people might feel accepted there while others won."},{"comment_id":"10154025197726717","commenter_b":"She leaked information about innocent people being murdered!!! I see nothing wrong with that!!!","commenter_a":"Fuck her, she leaked secrets. It's against the law, doesn't matter how you identify or what's between your legs","post_message":"Manning recently asked President Obama to commute her sentence, and supporters worry what a Trump presidency will mean for her."},{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."}]
