[{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"},{"comment_id":"10156528298190206","commenter_b":"She is treacherous!","commenter_a":"IS THIS TRUE???@username, a Republican candidate president and the former CEO of Hewlett-Packard, presents herself on the campaign trail as a hawk on Iran. She promising to take a hardline on the regime in Tehran. However, during her time as the chief executive of HP, she hundreds of millions of dollars worth of products to Iran through a foreign subsidiary, despite strict U.S. export sanctions, Bloomberg reports.","post_message":"I’ve answered hundreds of questions on the campaign trail. Find videos of my answers here:"},{"comment_id":"10153323760987994","commenter_b":"They are puppy mill dogs. They over breed these poor dogs and none of them ever see a vet...so the puppies are that are born are just as unhealthy....","commenter_a":"I purchased two kittens from there and 1 died within 24hrs, they told me \"bring it back and I'll replace it\", they gave me another one and it died 2 days later along with the other one","post_message":"A Mount Clemens pet store is being sued by nearly a dozen customers."},{"comment_id":"1035379929888394","commenter_b":"@username actually if you check the poll aggregates you'll see that Hillary can best Trump.","commenter_a":"Can President Obama become her running mate for her Vice? Or Bill Clinton?","post_message":"The numbers don't lie, but Republicans definitely do."},{"comment_id":"726722780803193","commenter_b":"Bloody Tim with all his Facebook profiles!","commenter_a":"Tim Duurland @username Adam Burns Tim Duurland","post_message":"This \"smart table\" could be the future of ping pong."},{"comment_id":"700385996818645","commenter_b":"We in America should do that too. The tree is evil, the fruit is isis and radical muslems.","commenter_a":"Thats what they want it makes them stronger. Causes more hate.","post_message":"Muslims are doing everything to stop him, but he won't relent. This might be what they have to do. Do you agree with his movement?"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"}]
