[{"comment_id":"1681608915392702","commenter_b":"@username it made it to the internet via facebook / twitter etc , not sure about the mainstreeam","commenter_a":"with innocent doctors inside","post_message":"Pretty much sums it up... The Free Thought Project.com (Y)"},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"1263330063738211","commenter_b":"WE ARE STRONGER TO-GET-HER AWAY FROM POTUS! #NeverHillary #DrainTheSwamp","commenter_a":"Seeing you, Obama, your husband and the rest of the democrat crooks, liars and thieves in prison for life or the hanging post!!!!!","post_message":""},{"comment_id":"10156409954230354","commenter_b":"DUMBASS BITCH STRIKES AGAIN!!!!!#","commenter_a":"Get her out of the power supply. Feel for your own residents. One bankrupt San Bernardino. Please give our city hope .","post_message":"Nancy Pelosi’s message to Americans this Thanksgiving is that the nation’s “broken immigration system” is “cruel” to illegal immigrants. No mention of the THOUSANDS of victims of criminal illegal aliens. Pass the turkey..."},{"comment_id":"1179053782134909","commenter_b":"Yes and he is ASS!","commenter_a":"IDIOT","post_message":"Kanye West Claims He’s Tougher Than A US Soldier. Wow, how disrespectful. He must be kidding. Do you think Kanye West is a disgrace?"}]
