[{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"10153229329259087","commenter_b":"Check out this bitch","commenter_a":"Oh, a little tidbit that maybe Trump supporters don't know: Trump's current wife is a former almost porn star and underwear model for a wife. Yep, just what we want in the FLOTUS! Someone that EVERYONE can know and see what she looks like naked, and on all fours... TRUE","post_message":"GOP presidential front-runner Donald J. Trump went on the offensive on Thursday morning, attacking cable networks for treating him unfairly, slamming several presidential rivals as \"shrill\" and inexperienced, and pushing back on Pope Francis's opinions on climate change and immigration."},{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"10155373271046509","commenter_b":"Megan Kelly spoke with her for less than five minutes and all that was uncovered was that this chick lied. That's enough for me.","commenter_a":"cheap attention. sorry, but this is pathetic","post_message":"\"He was really aggressive. He was really rude. He was a bad person with me.\""},{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"},{"comment_id":"10154880820226178","commenter_b":"What a shameless woman. You are heartless.","commenter_a":"Kelly A Dee","post_message":"LOL. Martha Raddatz can barely keep it together!"}]
