[{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"},{"comment_id":"10156091694535725","commenter_b":"when was i a women? rockstar","commenter_a":"Mr @username has taken to personal invective again, this time mocking the appearance of the only woman in the Republican field, Carly Fiorina. This from a man who wears a tribble on his head","post_message":"I will be speaking at the #StopIranDeal rally shortly- watch live here-"},{"comment_id":"10155463176480294","commenter_b":"Jordan Beier","commenter_a":"I saw about at two points when the injury could have happened (the roll, and when he was thrown out of the ring) and the dropkick could have finished off the injury but the way he was handled after the injury didn't help matters. According to the earlier reports he died at the hospital but he didn't look alive to me.","post_message":"When the bout ended, medical personnel transferred Aguayo to the hospital, where local media reports he was pronounced dead:"},{"comment_id":"10152700132182434","commenter_b":"Also, can I state for the record Sansa had a good idea she would in fact have to have sex that night, but it's the only way to get her revenge on the boltons. She had a choice to get into the family, Littlefinger gave her one, but she chose to do this. This is fucking Westeros, people, hell, in many states in the US a husband can't rape his wife.","commenter_a":"i'd like to point out that Danaerys' rape occurred in the same way as Sansa's and had a lot to do with her character development","post_message":"Whoever titled last night’s episode of Game of Thrones “Unbowed, Unbent, Unbroken” has a grim sense of humor and solid sense of irony."},{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."}]
