[{"comment_id":"1040430382659049","commenter_b":"they are getting to close for comfort. she will play the stroke card any day now.","commenter_a":"She looks like a wore out old saddle bag.","post_message":"Hillary, EXPOSED!"},{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"1745647555687410","commenter_b":"Julianne 😂😂","commenter_a":"Lol Luke Hargis you guys need to figure this out before moving out!","post_message":"\"I pay puppy support...\""},{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"},{"comment_id":"953630401426610","commenter_b":"You are not Deplorable Hunny!! She is just Evil!!","commenter_a":"I am an immigrant who came here LEGALLY...just because I want LEGAL immigration and I want nthe Border Wall...Acc. to Hilary I am in the basket of \"DEPLORABLES\"","post_message":"Donald J. Trump speaks at the The Remembrance Project National Conference in Houston."},{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""}]
