[{"comment_id":"456327834562277","commenter_b":"They are a matched set, failed business woman and failed politician.","commenter_a":"As for CARLY supporting Cruz SHE wants the VP spot and this is her ONLY chance! Tying herself to Cruz who will allow lying, half truths, whatever it takes to get into OUR White House! Carly Fiorina said BEFORE this establishment endorsement, that she found it that fellow candidate Sen. Ted Cruz, didn renounce his dual citizenship until 2014, and that Cruz one thing in the drawing rooms of Manhattan, and another thing in the living rooms of Iowa ! NOW it seems, Cruz brokered a deal with Carly AND SHE WAS BOUGHT! Talk about a SHILL Fiorina is a TOTAL GOP ESTABLISHMENT SHILL!","post_message":""},{"comment_id":"907985779261171","commenter_b":"Wish she would cover up more. Less boobs and rear. Just sayin","commenter_a":"she is incredible and I am so happe for them","post_message":"One-armed shark attack survivor Bethany Hamilton surfs the waves at six months pregnant"},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."},{"comment_id":"10153775640411178","commenter_b":"Bully!","commenter_a":"\"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt 1907","post_message":"Ben Carson makes a bold statement."},{"comment_id":"10153832289717061","commenter_b":"Wow. This mf","commenter_a":"Only 1 million?","post_message":"Taylor Swift vows to donate $1 million to relief efforts in Louisiana after devastating flooding damaged 11,000+ homes."}]
