[{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"},{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"742531822604062","commenter_b":"PLEASE PUT HIS ASS IN IT","commenter_a":"All this shit is posted and nothing is ever going to happen to this goat fucker or his bestie Hillary Clinton","post_message":"Obama Caught In Major Lie - This Could Be The Nail In The Coffin [VIDEO] He cannot be trusted. End his term early. Do you want a president who will tell the truth?"},{"comment_id":"893596794095327","commenter_b":"Obama lead the ludicrous Iran Nuclear Deal. That was it for me. Iran has already violated the 5 year ban on developing and testing ballistic missiles which was part of the nuclear deal and guess what - do nothing Obama is just ignoring it. As far as national security goes - Obama is a disaster. And now he wants to bring in 10,000 refugees from ISIS territory who can not be vetted. Obama is not good for America or Israel.","commenter_a":"CORRECTION: It is under Obama that Israel has received more defense material than under any other previous administration! And these people have the gall to call him the worst President for Israel! And with His Highness' present standing in international diplomatic circles, his voice is hardly more than a \"whisper\" in the globalized wind! It's about time that people become aware of what he has wrought on Israel's reputation.","post_message":""},{"comment_id":"10153652749211336","commenter_b":"You better find a different church.","commenter_a":"Joe's Sunday Sermon - 09-06-2015 I guess I am compelled to address the elephant in the room. No, I am not making fun of her weight, it is just an expression. I am of course talking about Kim Davis, the misguided Kentucky Clerk of the Court that was recently jailed due to her contempt for the court and in my humble opinion, for humanity as well. This is NOT an issue of religious freedom. You can twist it, bend it and run it through a press and it will still not come out as a religious freedom issue. Does her issuing those licenses force her to change her religion or her religious views? No. No, it does not. She may still practice her religion as she chooses. She took an oath and that oath was to uphold the law. Does her religion condone being dishonest and deceitful? Well, again, in ...","post_message":"As Kim Davis began her third day behind bars yesterday, having chosen indefinite imprisonment over licensing gay marriage, around 300 people gathered on the lawn outside."},{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."}]
