[{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"10154543039398132","commenter_b":"Two jerks","commenter_a":"Stay joyful! Happy birthday Blake","post_message":"Gwen Stefani celebrated Blake Shelton's big 4-0 with some epic throwbacks."},{"comment_id":"837004389725950","commenter_b":"Oh so sad.","commenter_a":"Amen!!!!!","post_message":"Absolutely! Thanks to our friends at Democratic Memes for this great image. Give their page a like and let them know we sent you!"},{"comment_id":"1122159437825214","commenter_b":"Hillary is only qualified for prison , Americans that vote for her are idiots, wake up !!!!","commenter_a":"That is how politicians make their fortunes. Crooked Hillary should not get near the White House. Who knows what she will continue to do; she believes she is untouchable.","post_message":"TREAT PEOPLE WITH DIGNITY? HILLARY TAKES MILLIONS FROM REGIMES THAT BRUTALIZE WOMEN & LGBT RESIDENTS: What Clinton said today, \"If you believe as I do, America values hard work and treats people with dignity and offering everyone the chance to live our dreams and cares for those in need, well, the formula for America's success have always been that we are stronger together.\" Versus Behind closed doors, Hillary Clinton uses State Department access and favors to rake in massive sums of money from some of the most oppressive regimes on planet Earth. “Rarely, If Ever, Has A Potential Commander In Chief Been So Closely Associated With An Organization That Has Solicited Financial Support From Foreign Governments.” “Rarely, if ever, has a potential commander in chief been so closely associated with an organization that has solicited financial support from foreign governments. Clinton formally joined the foundation in 2013 after leaving the ..."},{"comment_id":"10153240346384087","commenter_b":"You are remarkably uninformed. Why do you passively accept propaganda?","commenter_a":"Abortions account for over 86% of Planned Parenthood revenues, according to President Cecile Richards, who makes over $520,000 annually. Richards made the admission while testifying before the House Oversight and Government Reform Committee on Tuesday. @webpagelink","post_message":"Rep. Jim Jordan interrupted Planned Parenthood President and CEO Cecile Richards 19 times in five minutes as he grilled her about the previous apology she had given about the leaked footage."},{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""}]
