[{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"10153787356025667","commenter_b":"Hello pretty lady","commenter_a":"Here's a fact for you Ms. Arnaud: Have you ever heard of Robert Byrd? Hillary considered him a close friend and mentor. Do some research.","post_message":"Hillary Clinton gave one of her strongest rebukes against Donald Trump at a speech in Reno, Nevada. @webpagelink"},{"comment_id":"10153921857951323","commenter_b":"seductive dancing is an ancient art form...and a rare 5% of woman have any natural talent at it at all.","commenter_a":"'Sex industry' is not an industry. Sadly you were not given enough opportunities and maybe this is why you think this is a job.","post_message":"\"The sex industry is one of the very few industries in which middle-class to upper-class men regularly give large sums of money to working-class women. I wonder if that’s one of the reasons why people hate us.”"},{"comment_id":"1215195555169015","commenter_b":"Angela Merkel sucks wake-up idiots please","commenter_a":"Actually, Donald Trump is the only candidate, with a proven business record, who can assess data, consult with people who need to be heard, and make decisions he can logically defend. Hillary's track record as a senator and Secretary of State are without merit! (Btw, I used to be a democrat but I refuse to vote - then or now - for the two most corrupt politicians of our era!)","post_message":"“She is the only candidate who can assess data, consult with people who need to be heard, and make decisions she can logically defend.” —WIRED on Hillary"},{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"},{"comment_id":"1201416786646537","commenter_b":"Hope the heck they do. Better without their sorry butts","commenter_a":"Samuel L Jackson can stay! Lol","post_message":"These celebrities said they would leave the United States if Donald Trump became president, well he's now president."},{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."}]
