[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."},{"comment_id":"10153548931652550","commenter_b":"my only solution to this and advice to the american government is to stop allowing foreigners to come into the united states... I think this country has the worst imigration problem.","commenter_a":"Who trusts the Obozo regime to make sure no terrorist enter our country masquerading as refugees?","post_message":"Welcome to America: New photo shows newly-married couple who killed 14 people in California last week in a suspected ISIS-inspired attack, entering the U.S. together for the first time last year ... @webpagelink"},{"comment_id":"1626581144301352","commenter_b":"Amy shular should just go do porn. Nothing else it will shut her pie hole with a dick in her mouth.","commenter_a":"Of course they won't leave. They won't be treated like \" royalty\" ( said sarcastically ) anywhere else 😩😩😩","post_message":"It was only a matter of time..."},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."}]
