[{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids Is The One True God (VIDEO) @webpagelink"},{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."},{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"10153215250940329","commenter_b":"You clearly don't live in the country.","commenter_a":"\" Why are your large pizzas the size of our personal pizzas?\" because we aren't a country full of fat fucks.","post_message":"Dear BuzzFeed Oz."},{"comment_id":"10153323760987994","commenter_b":"They are puppy mill dogs. They over breed these poor dogs and none of them ever see a vet...so the puppies are that are born are just as unhealthy....","commenter_a":"I purchased two kittens from there and 1 died within 24hrs, they told me \"bring it back and I'll replace it\", they gave me another one and it died 2 days later along with the other one","post_message":"A Mount Clemens pet store is being sued by nearly a dozen customers."},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."}]
