[{"comment_id":"10153188976024087","commenter_b":"Ethyl Rosenberg did less and thy fried her in the electric chair!","commenter_a":"Go Hillary , ignore the naysayers , they don't even have a real scandal , crime or violation , ignore the fake media , stay focused on the real issues that Americans truly care about","post_message":"Senior aides to Hillary Clinton will meet with Democratic lawmakers at the Democratic National Committee offices on Thursday to discuss messaging and strategy as the presumptive front-runner's numbers continue to fall."},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"10153838420452217","commenter_b":"English can be privatised ? Wow.","commenter_a":"I'll trademark all the vowels...That way they are just spcsvrs...which makes no sense...","post_message":"Yes, you are reading this clearly. 👀 👓"},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"}]
