[{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"10155219757361159","commenter_b":"They should be deported and he should be in prison.","commenter_a":"So............your entire family is full of criminals and you're going on television to identify them right before we finally start enforcing the immigration laws in this country? Definitely stupid enough to be a Democrat.","post_message":"\"They got a false Social Security card, they got a false identification, they got a false driver license prior to us passing AB 60, they got a false green card, he admitted."},{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""}]
