[{"comment_id":"10153400314832183","commenter_b":"...and he thinks that threat is going to deter anyone from voting for Bernie. It makes me MORE determined to vote for Bernie. Don't let the door hit you in the ass Bill.","commenter_a":"PLEASE, vote for U.S. Senator Bernie Sanders for president so O'Reilly will go!!","post_message":""},{"comment_id":"1600332060187317","commenter_b":"she's a skank...","commenter_a":"Megyn seems to know that whether positive or negative, any publicity is good. Think about this Megyn, apologize to Trump and you'll be a headliner in all the major news outlets. .","post_message":"Megyn Kelly EXPOSED!!"},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"236889993435379","commenter_b":"What a lousy excuse of a woman! You do not speak for me!","commenter_a":"What the hell was that","post_message":"Holy mother of batsh*t!"},{"comment_id":"1198460870230286","commenter_b":"Women have it Harder then men? Who has to work in construction for his whole life if he doesn't have an good education? men do. Who has can't just suck dick and flash their tits or be a stripper or be a prostitute to get easy money? Men can't. So listen here you ugly fucking single mother in practice bitch you should've been caught in the condom.","commenter_a":"Stop boner shaming! Girls get to flaunt their sexuality. They get to show off their nipples. Then guys have to hide boners. You know how uncomfortable it is to flip a boner into your waist band Only some people breast feed. None of you would be here without a boner FREE THE BONER","post_message":"You! #WSHH"},{"comment_id":"10154170958189586","commenter_b":"Ouiii","commenter_a":"@username on dirait misha","post_message":"Wait until you see Rupert's face when he discovers #vegan nachos. All rats should be this happy! #StopAnimalTests #WW4AIL"},{"comment_id":"10153062976166680","commenter_b":"Eh. Women do come back in body bags but whatever.","commenter_a":"The candidates should pledge to keep Jackson and Hamilton on the currency. Where does it say a women has to go on a bill. Women don't come back in body bags during our wars. To go on a currency bill as Washington, Lincoln, Hamilton, Jackson, Grant, Franklin, and Jefferson have is b/c of their committment to this country, AND NOT b/c of their genitals. If a woman is to go on a bill let it be on a three-dollar bill.","post_message":"POLITICO Europe: “There is such a thing as society,” Cameron said in an implied retort to Margaret Thatcher’s counter-view, “it’s just not the same thing as the state.”"}]
