[{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."},{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"1299697093430376","commenter_b":"Snaaaaacks forreal. Them ladies looking like 4 course meals family","commenter_a":"So we all goin to ignore all the female snacks 😍😍👅 in this video ...","post_message":"Mike Tyson going in on Soulja Boy! #WSHH #MikeTyson #SouljaBoy"},{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"10153723467413984","commenter_b":"Wow what a woman","commenter_a":"You FOOLS! Let this American citizen out of jail and start concentrating on REAL illegals in this country! You have totally lost track of reality! In my 65 years on this planet I have never seen the U.S. Government be so dysfunctional as it is right now!","post_message":"Amazing. Kim’s 21-year-old son has just stood up for his mother in a HUGE way after she was ordered to jail, and it speaks volumes. Do you support Nathan Davis?"},{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."}]
