[{"comment_id":"10152700473451051","commenter_b":"Better to stay single. Plan to meet in a well lit public location. Women don't pick up or be picked up.","commenter_a":"I tried this one time! Never again! He scared me!","post_message":"It started out as an ordinary date between two people who met online. It ended very violently."},{"comment_id":"10154708467139575","commenter_b":"@username -AMEN!!!","commenter_a":"There are many people that work on major holidays. I don't know why every year retailers being open on Thanksgiving is a huge deal. First responders, hospitals, airports etc never ever close. Instead of the media always focusing on the negative maybe they should focus on the positive and the people that work these Essential jobs and miss many holidays with there family's.","post_message":"Macy's is staying committed to Thanksgiving Day shopping, saying it will open at 5 p.m. this year. What do you think about this? Will you visit Macy's on Thanksgiving?"},{"comment_id":"10154962513977235","commenter_b":"That's Trump's kinda gal. She and Melanoma should get together and compare notes.","commenter_a":"Shows how repub's don't have a brain of their own! The just regurg other people's info and apparently aren't too concerned about the ethics of theft 👎🏼","post_message":"\"The book contained a complete cut and paste job on Keynesian economics taken from off the internet.\" BUSTED!"},{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""},{"comment_id":"934248849943870","commenter_b":"American's just as guilty for ALLOWING these Satanic PIGS to roam our country and have their way! THIS----IS---OUR---COUNTRY!!! NOT the POA - NOT Islams!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"These MUSLIMS think they can come to this Country and do what they want, NO if you don't like it go back rape you women and kill but not in AMERICA!","post_message":"Must Watch!"}]
