[{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"10152844711636167","commenter_b":"Some say brave, real people say KKKOCKSUCKINGWHORE","commenter_a":"What's \" brave\" about cutting seniors earned benefits??","post_message":"Except his plan would be \"terrible\" for the poor and middle class..."}]
