[{"comment_id":"1233016690120338","commenter_b":"I would say #NeverHillary. Write in Bernie OR anybody else. The woman is so corrupt.","commenter_a":"\"Superprepared warrior\" is absolutely nothing you should be proud of. You're a disgrace to world peace and America. America will never elect someone as insidiously corrupt as you. Hope the FBI comes knocking soon!!!","post_message":"“On April 19, New York Democrats will have unusual say over the party’s nominee. They have in Clinton a superprepared warrior realist... By choosing Clinton, Empire State Dems would powerfully signal that the party has gotten real about achieving long-sought goals.” —New York Daily News nydn.us/1Vn9bcK"},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."},{"comment_id":"885506288175787","commenter_b":"Thnx god u not woman,imagine poor woman life with such big ugly nose","commenter_a":"if i was that woman i would never talk to that stupid arabian pig -_- what kind of thinking and beliefs let these ppl tobe in social with this kind of talking and beliefs it doesnt worth even a simple like","post_message":"Apparently in countries like America sexual crimes 'are no big deal' to women."},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"10154170827586756","commenter_b":"@username dont u have a planned parenthood office to firebomb like your christian boy did in denver? come at me asshat i'll beat your ass down and light your hairy persian ass on fire to worship in lol","commenter_a":"I hope American culture and goods don't start to flood Iran and ruin it","post_message":"NPR's Steve Inskeep revisits three Iranians he met last year to find out if their lives have changed because of Iran's nuclear agreement with world powers. \"We are actually in a new world,\" says one."}]
