[{"comment_id":"10155711262144657","commenter_b":"Yep!","commenter_a":"He already does......see Trumpsters have always had a direction to Trump.....we do not CNN Clinton news nerwork or any other left stream bias pieces of crap. This way we get the info before lamestream media manipulates it.","post_message":"Calm down, everyone."},{"comment_id":"468040403386540","commenter_b":"They need to leave America!!!","commenter_a":"No, do we get ours? Did any of our relatives from the past get their's","post_message":"Should The US Allow Muslims To Have Their Own Areas? Comment 'yes' or 'no'."},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."},{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"10152984157398598","commenter_b":"If she didn't want to get pregnant and ruin her career she should have kept her legs closed!! Selfish pos","commenter_a":"All u negative people will never understand...a baby can dampen your career...or just job if u have one...just think that if the mother is single...she will be out of work for six weeks...how do u pay rent..carnote..bills..ect..then when its time to go back to work how are u going to pay for daycare after being out of work..oh not to mention in todays society how many sick perverted people there are in the world and to know u may possibly give ur child up to one of those...SMH. shame on all of u who judge this woman....A REAL woman knows whats best for her and a child...and is certainly no ones place to judge...y dont all u negative people become a social worker and go find the real children who need help from a parent who decided to have them for their own sick pleasure! Thousands of children being born ...","post_message":"She Aborted Her Baby Twice and Both Abortions Failed, So She Aborted Her Baby Again"}]
