[{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"},{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."},{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"},{"comment_id":"10152870782829091","commenter_b":"Who kill innocent people ... Im just saying .. Encourage them America ....this is why the world is crazy cuz of the way y'all( liberal whites ) think ..filthy animals","commenter_a":"What the hell is wrong with people..... She should of had her students send letters to our troops","post_message":"SHOCKING: A teacher in New Jersey has been suspended for having her third-grade class to write get well letters to a sick inmate convicted of killing a Philadelphia policeman: @webpagelink [PHOTO: Forest Street School]"},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."}]
