[{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""},{"comment_id":"10153027990406130","commenter_b":"I'd add not to be shy about calling your OB for more pain meds, especially after multiple c-sections. They're not surprised, it's actually common. I wish I would have called sooner than suffer unnecessarily.","commenter_a":"I've had 6 c-sections.. 3 of which were After a long labor. While laughing and/or coughing is painful for the 1st day, that's about the worst of it, I never took pain meds after... The first one I might call 'rough'- but the other 5 were not bad at all. #5 was 6 weeks early and I had to pump milk and walk to the nursery (she needed the heat light) every 2 hours to feed her, it really wasn't that bad.","post_message":"Congratulations! Your ab muscles are completely non-existent now. The good news: Your arms are gonna get buff."},{"comment_id":"10153136004245090","commenter_b":"She's an idiot","commenter_a":"She is a liar, sneaky, underhanded, untrustworthy and she needs to answer for Benghazi and the killing of those four innocent men. I hold her and Obama responsible. Would never want someone like this as President.","post_message":"Bottom line: Why don't you want Hillary Clinton to be President? Sound off here: @webpagelink"},{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."},{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."},{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"},{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."}]
