[{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"10153309026372452","commenter_b":"Please move out of Communist California.","commenter_a":"Hunter 😒😒😒😒😒","post_message":"The more you drive the more you pay? California could soon charge you for every mile you drive. abc7.la/1JjBX9b The state is looking for volunteers to test a new \"mileage tax.\" It's designed to replace the gas tax, but could you end up paying more? And how would they track every driver in the state?"},{"comment_id":"10153556909588132","commenter_b":"I know!!!","commenter_a":"Krystal Frederick","post_message":"Another The Bachelor couple bites the dust."},{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."},{"comment_id":"10156669278135354","commenter_b":"Evil disgusting whore","commenter_a":"GRANNY couldn't tell the difference between LOVE and KINDNESS if her life depended on it!!! Her own husband had to go find love in someone else's arms cause she knows NOTHING about love!!!!!","post_message":"There was no \"love and kindness\" in Hillary's lies about Benghazi. It wasn't \"love and kindness\" when Hillary transferred 20% of US uranium to Russia for $145 Million in Clinton Foundation cash. \"Love and kindness\" don't describe her treatment of Bill's sex victims. Exposing US secrets through your server and destroying emails isn't \"love and kindness.\""},{"comment_id":"10154254205206179","commenter_b":"Yes, the man who was accused of racism 30 years ago despite being a legal champion of civil rights when it mattered, showing he can actually put personal beliefs aside and do his job when it counts. Can't have someone like that as attorney general. He might actually enforce the law.","commenter_a":"She knows the rules. . She was warned. . She broke the rule. . She was disciplined. . The rules are arcane, but then crying cause y'all don't get your way, well please! #growuppeople","post_message":""},{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."}]
