[{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"10153906233727522","commenter_b":"Hillary is so obese she looks pregnant in that photo!","commenter_a":"What a bull crap fake news article. Dont blame the constitution for running a more flawed candidate.","post_message":"It's possible to win the Electoral College while winning only 22 percent of the national popular vote."},{"comment_id":"10152785786292434","commenter_b":"All women can give you something. A headache, an empty wallet, herpes etc.","commenter_a":"Everyone has chlamydia. But Norway's a nice place to catch it.","post_message":"Well it certainly got my attention."},{"comment_id":"485555318301715","commenter_b":"All muslims need exterminated","commenter_a":"That will be a good time to take more out they will be together","post_message":"Gunman accused of hate crime in slaying of three Muslim students. Brace yourself, more race riots to come as angry Muslims prepare to march. Should all race rioters be wiped out?"},{"comment_id":"662013840614058","commenter_b":"Give Texas back to Mexico!","commenter_a":"How ignorant. It is against the law. I would hope that the sane people in Texas vote these idiots out of office as soon as they can.","post_message":"This time they may actually do it...."},{"comment_id":"10153013319096336","commenter_b":"Alison, your a sad sad little mind young women. I sure hope you're raising your children better than you. SMDH #m0r0n #Gruber #StickAndStones #TruthHurts #ByeBye #LordGiveMeStrenthFromStupidPeople","commenter_a":"I knew as soon as I heard it was a \"produce truck\"","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."}]
