[{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""},{"comment_id":"10153228594071615","commenter_b":"Does it involve SPIDERsSsssssss????","commenter_a":"What doctor would even do this?","post_message":"Are you afraid of spiders? If so, there might be hope for you..."},{"comment_id":"828345383930736","commenter_b":"Yes and NO Muslim country is taking ANY refugees!","commenter_a":"I find the hateful, negative comments sad. What is perhaps even sadder, is that I am not surprised by the terrible comments. They are offering to do something kind and selfless.","post_message":"More than 11,000 Icelanders have offered to take Syrian refugees into their homes."},{"comment_id":"10156318897435354","commenter_b":"Guess what Ms. Wilde, past immigrants came to this country in a legal fashion. That's why we call people who enter otherwise illegals. What a house ape you are.","commenter_a":"Olivia you ignorant slut, you and your liberal harpy friends wouldn't like if those trespassers came over here with their broom handles. Then again Olivia, maybe you would","post_message":"Wrong. What's \"really sickening\" is seeing innocent Americans murdered and raped by criminal illegal aliens and having a president who cares NOTHING about the victims and their families. THAT is what's \"really sickening,\" Olivia Wilde."},{"comment_id":"10153624031427293","commenter_b":"But don't forget it's going to be a wall that's yuuuuge and beautiful and the best part is Mexico is going to pay for it!","commenter_a":"does he have any ideas? any plan other than the wall?","post_message":"\"(Trump) will run into a buzz saw of reality otherwise known as the general election, and he may not know how badly mangled he’ll get.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"10153457336028525","commenter_b":"Brian","commenter_a":"Jose J Torres","post_message":"A cure for diabetes? It could happen, and they've already begun testing it in a small number of diabetic patients. STORY: @webpagelink"}]
