[{"comment_id":"1202509189764740","commenter_b":"It's always about me Me ME!","commenter_a":"cause i aint dead and after 38 years you cannot make me a beater to be dead after 38 years and with mama rosa's paperwork","post_message":"One thing he doesn't say, is \"victory.\""},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake? Only if you like to have fun..."},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"},{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""},{"comment_id":"533672440152326","commenter_b":"You know that just the stupid negroes . The same ones who will kill their own .","commenter_a":"Who ever is sending the haha face this is not the place ... And you are part of the problem please show respect and leave this page","post_message":"The body of slain Dallas police officer Michael Krol is escorted to the church for his final funeral mass here in Michigan. He will be buried in Southfield later today: More: @webpagelink"},{"comment_id":"692519350938643","commenter_b":"not even a woman!","commenter_a":"I don't think he should have gotten the award he's not a hero. Give it to someone who has really done something who is a hero. He looks like talks like and walks like a man playing dress up in his mothers clothes","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10155802536765354","commenter_b":"Hope she goes to jail!","commenter_a":"Sad","post_message":"\"I’m not about to be on no scene 10 minutes doing CPR.\""}]
