[{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians. The Mind Unleashed"},{"comment_id":"10153080762721051","commenter_b":"Set his butt on fire the next time sis.. Light a match and go for it. Learn how to defend yourself.","commenter_a":"It has to do with the fact that even with the strides that women have made in securing rights. Women are still 2nd class citizens we are expendable. The national movement has wrapped itself up in abortion rights as the only right we speak out for. Susanne B Anthony must be rolling in her grave. Shame on us for allowing this to continue. There are currently more women than men worldwide. Withhold that which men hold dear, watch how fast things change.","post_message":"This woman's husband repeatedly abused her. Then he sent her a text message that read, \"In the next 48 hours I will be locked up and you will be dead.\" Despite that, he's still walking free."},{"comment_id":"10153678204533984","commenter_b":"They are scum ! We don't have enough prisons !","commenter_a":"This is a hate crime! Throw the book at these idiots!","post_message":"This is just brutal...How can anyone do this to an innocent teen?"},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."}]
