[{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""},{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"480556725471124","commenter_b":"She is right! Lock up Hillary.","commenter_a":"She is right, absolutely. This corrupt two system set up by Republican party for a long time ago, specially in G.W. Bush's administration. Now finally, some one found a guts to talk about it. We need more of these speech to bring the truth and fact to American and Washington. Shame, shame.............and shame. Viva and thanks to Democrats for bringing a truth in this matter.","post_message":"YES! This morning, Sen. Warren gave Republicans an EPIC smackdown as they voted for a Koch-sponsored bill to make it harder to prosecute financial criminals. \"There are two legal systems in America; one of the rich and powerful, and one for everyone else.\" \"Billionaire Republican donors Charles and David Koch have been pushing for the corporate crime relief amendment\" according the the Huffington Post. UGH! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153431961096130","commenter_b":"Look what she made him do!","commenter_a":"I was NEVER a fan of Johnny Fraud!","post_message":"Johnny told police that his girlfriend was both “a little mad” at him and “a little bit intoxicated.”"},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."}]
