[{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."},{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""},{"comment_id":"1676679282547936","commenter_b":"The women do have a choice... Unless they revolt.","commenter_a":"her crime was that his dinner was served to late by his wife and it was too cold for his liking..... Why would ANY woman marry a Muslim man? .... Even a Muslim woman.......","post_message":""},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"1782119588705977","commenter_b":"@username Dumbocraps can't read. They need pictures.","commenter_a":"never once have I cared or wondered \"What would Eric Trump think?\" about... anything.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"163756660695086","commenter_b":"She's unbelievable. I swear she better not get into office. WAKE UP AMERICA!!!","commenter_a":"I think Hillary is channeling Marie Antoinette.","post_message":"Hillary Clinton just landed her plane in Nantucket... Almost immediately after people saw her, this HUGE problem went viral..."}]
