[{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"},{"comment_id":"783781558433266","commenter_b":"That's the truth! Their acting like that's what they won't so people think their real. Lol! Their both scared and they should be! Trump the only one can beat Hillary or sanders!","commenter_a":"Move on.org, BLM and now Bernie supporters, are all DOMESTIC TERRORIST GROUPS OF AMERICA. They all need to he arrested! This is not protesting, this is organized violence!","post_message":"The last person that Hillary or Bernie want to run against is Donald Trump --- and that is fact!"},{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."},{"comment_id":"10153483775401409","commenter_b":"You are a troll anyway. I can tell by looking at your page. Funny thing is you have a picture of the twin towers on your page saying never forget but you want to let illegals stay and I bet are all for the refugee program.","commenter_a":"Its because Trump loves attacking women but not his own. I bet he doesn't treat his wife good at home and only likes his wife and daughter as sex objects to him. He's a disgusting man.","post_message":"Here's how Heidi Cruz responded after Donald Trump threatened to 'spill the beans' on her Tuesday."},{"comment_id":"2035328873360726","commenter_b":"Touch my wife and you're a dead goat-humping mf.","commenter_a":"So this must be why American women want muslims in our country?","post_message":"SHARIA LAW BEATING Of Woman Captured On Cell Phones By Cheering Crowd…Woman Savagely Lashed With Cane By Masked Men…Screams In Pain Before Collapsing The smiling women in the large crowd is almost equally disturbing… ***WARNING***VIDEO IS VERY GRAPHIC And DISTURBING!"}]
