[{"comment_id":"10154017510261336","commenter_b":"I NEVER SEE THIS KIND OF PLANNED HATE TO DONALD TRUMP OR DOCTOR CARSON AND NOT TO OBAMA OR SOCIALIST ILL SANDERS OR HYENA CLINTON... NOBODY IN CNN OR ISLAM PAY MEDIAS NEVER ASK DEMOCRATS... WHAT SOCIALIST COUNTRY IS DOING BETTER THE U.S.A. ....WE DON`T NEED SOCIALISM OR ISLAM LAWS ,,SOCIALISM LEECHES SUCK CAPITALISM LIKE CUBA FOR 65 YEARS SUCKING FLORIDA MONEY TO CUBAN GOVERNMENT AND PEOPLE ...WHAT A ZOMBIES IGNORANT DEMOCRATS ARE ....NOW EVERYBODY CAN SEE THE FUTURE IF TRUMP WIN THE WHITE HOUSE... BUT NOBODY CAN IMAGINE OR SUGGEST THE DESTRUCTION THAT MUSLIM LEADER OBAMA ALREADY DONE IT ..OBAMA`S ACTION ALWAYS BENEFITS HIS RACE ISLAM ,SOCIALISM ,BLACK CRIMINALS ,OUR MONEY SEND TO HELP ALL PLANET BUT NOT THE TAX PAYERS....OUR CONSTITUTION IS BY FAR THE BEST GIFT TO HUMANS FREEDOM ....AND CAN YOU BELIEVE ME I`M NOT GETTING PAY FOR DOING THIS I CALL THIS THE POWER OF ...","commenter_a":"And the lobbyists and special interest groups Bush, Trump 2016","post_message":"Jeb Bush said to defeat radical Islam, we \"shouldn't have the warfighters have their arms tied behind their backs.\" Do you agree? #GOPDebate"},{"comment_id":"10152550592377014","commenter_b":"Someday we would love too visit, Beautiful!!","commenter_a":"Jeremiah Ludewig it's so pretty but idk if I could do with cactus lol","post_message":"Another night, another stunning Arizona sunset sent in by a great 3TV viewer. Thanks, Rosanne Zimmerman!"},{"comment_id":"1157727034250343","commenter_b":"Bunch of scum bags","commenter_a":"Spin, spin, spin, is that all we get today ?","post_message":"CBS journalist ADMITS it's their job to protect Hillary Clinton's past."},{"comment_id":"1887850284608044","commenter_b":"She was obviously impaired with alcohol, Thats how these freaks work!!!","commenter_a":"But the teen is also partly to be blamed. Knowing very well he is a disturbed 40 something dude who worships satan, how can u be ignorant on the values of his life. Why dint u just stay away from this monster as he wld embody all things evil that which is the hallmark of satan n the devil.","post_message":"Jailed for nine years"},{"comment_id":"10153573991208132","commenter_b":"Officer Donahue is a true hero","commenter_a":"My cat Quacks too!","post_message":"So. Many. Feelings."},{"comment_id":"10152949847416615","commenter_b":"A job well done champ!!","commenter_a":"I need some of that cashola","post_message":"The New Castle Police Department says K9 Champ was instrumental in locating the $15K that was hidden throughout the residence..."},{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"}]
