[{"comment_id":"1393322447348037","commenter_b":"NEVER Hillary!","commenter_a":"Petulant child is what Cruz is. Anyone who still endorses Cruz endorses Hillary Clinton!","post_message":"Comparing the print version of Ted Cruz's RNC speech to the rendition that got him booed off stage really does prove it's all in the delivery."},{"comment_id":"687263024766984","commenter_b":"@username here's a fact for ya 100% of illegal immigrants are criminals","commenter_a":"\"What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers. … Probably 2 million, it could be even 3 million, we are getting them out of our country or we are going to incarcerate,” Trump said. “We’re getting them out of our country. They’re here illegally.” Don't see what the problem is with that.","post_message":"Immigrants rights groups say they're \"preparing for the worst.\""},{"comment_id":"867088560054064","commenter_b":"A SMART WOMAN....not that stupid one!","commenter_a":"Ann Coulter","post_message":"There’s a growing movement to have a female hero replace Andrew Jackson on the $20 bill."},{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"10150542434714999","commenter_b":"She will not be the next president. Do you see unicorns at all?","commenter_a":"Who cares!!! She'll still be President.","post_message":"Special Report: Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record."},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"1072924802728530","commenter_b":"So your saying, that I'd have a needle put in my eye for something that wouldn't be used since I sleep when it's able to use.... interesting....","commenter_a":"@username .. hackers never stop ... xD","post_message":"Who wants to be able to see in the dark?"}]
