[{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"10153492886881973","commenter_b":"I gave up.","commenter_a":"Could you make the article even less readable on a mobile?","post_message":"Our pop culture reporter didn't think \"Spotlight\" deserved Best Picture last night, so he went back to give us his picks from the past 40 years."},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"10154313794062464","commenter_b":"Makes sense to me that Hillary would hide all her secrets in bathroom....no one would go in there after her....even if she did wipe her server.....","commenter_a":"Love the boots!!! I hate pink!!!","post_message":"In the Washington Examiner today: “Could Wendy Davis challenge Ted Cruz in 2018?” Add your name to stand with the cowboy boots over the pink running shoes: @webpagelink"},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153471883581509","commenter_b":"Can we remove obese women who wear the wrong sized clothing and bathing suits? Tired of seeing leopard print spandex stretched to its capacity, duck faced selfies and moose knuckles. Help me retain my eyesight please FB.","commenter_a":"Or 'dirty' words, children can be confused.","post_message":"Facebook is getting super-specific about what is and isn't allowed on the social network. @webpagelink via CNNMoney"}]
