[{"comment_id":"1362983927059832","commenter_b":"Found the \"run the USA into the ground\" voter.","commenter_a":"In a close election, to falsely broadcast that a candidate \"faces indictment\" is an act of sedition, especially when they know their viewers are hungry to believe such a ridiculous lie and would eat it up. Absolute treachery!","post_message":"In fact, Baier said, after checking with his sources, there is no evidence at this time for either statement."},{"comment_id":"10153561312261748","commenter_b":"I'm come to the conclusion that we can safely assume the complete opposite of anything said by a conservative.....","commenter_a":"It's little wonder the whole world thinks the USA has gone bat shit crazy!","post_message":"Ted Cruz says people don't like Duck Dynasty's Phil Robertson because he \"speaks with joy,\" floats him as UN Ambassador"},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"10152898754710950","commenter_b":"For real, dude. She rolled up talking shit. Lmao!!!","commenter_a":"Why is she riding a motorized wheelchair if she can brawl? What a loser and gets the kid involved too. This will be used as an example of spandex white trash by the comedians.","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."}]
