[{"comment_id":"1779050492377737","commenter_b":"She can suck a large hot dog my dog is smarter than her","commenter_a":"He can sue her and make her prove it.","post_message":"Star Wars actress Carrie Fisher speculated Sunday night that Donald Trump’s occasional sniffling during the second presidential debate stems from the fact that he is “absolutely” a cocaine user..."},{"comment_id":"1016888675050426","commenter_b":"Go Trump!","commenter_a":"God Bless you, Mr Trump, we've needed someone like you for a very long time, someone e who really cares about the a","post_message":"WOW! Thank you, America! LETS GO - it is Super Tuesday -- get out & VOTE TRUMP!"},{"comment_id":"10156809367690725","commenter_b":"U shush up cactus lady","commenter_a":"STOP, JUST STOP! Trump uses this sad news to advance HIS agenda, and the terrorists use his rhetoric to advance theirs. DONALD TRUMP, JUST SHUT UP!","post_message":"Watch this clip from earlier this year. Time and time again- I have been right about terrorism. It’s time to get tough!"},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"1324340430958054","commenter_b":"God will certainly Judge the U.S. for how this country decides to judge and treat people from other countries.","commenter_a":"It's not a forever ban. This is to send a message that we will not let the slightest possibly of another attack. And that if this is the only way then we will do it. We do not hate Muslims. We hate murders.","post_message":"SOUND OFF: President Trump has made a lot of changes this week, and his most recent executive order dealt with immigration. What do you think about his new policies?"},{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"}]
