[{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"},{"comment_id":"1238750836185439","commenter_b":"Maybe we \"Military Mothers\" should go protest the \" Temper Tantrum Party Protester's\" for BURNING OUR AMERICAN FLAG that is on our son's and daughter's uniforms. Wonder if that would take away their little spot light and five seconds of fame?","commenter_a":"After watching the new \" Temper Tantrum Party \" BURN OUR AMERICIAN FLAG last night, I'm voting straight up Republican Party Ticket for every Election... big, or small... for the REST of my life.","post_message":"\"We are living in an amazingly destructive, politically correct environment here in America. Just because something offends you, doesn't mean you have the right to hurt or destroy.\" Bill O'Reilly had some strong words for left-wing \"agitators\" who refuse to accept Donald J. Trump's victory in a fair and honest election. @webpagelink"},{"comment_id":"1313943068640455","commenter_b":"Ol bitch ass!!! Now come love on meeeee","commenter_a":"@username Amber Nicole yo ass lol","post_message":"Her mood swings are real!"},{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"10153832289717061","commenter_b":"Wow. This mf","commenter_a":"Only 1 million?","post_message":"Taylor Swift vows to donate $1 million to relief efforts in Louisiana after devastating flooding damaged 11,000+ homes."},{"comment_id":"1152899144750942","commenter_b":"She should be more scared of her elder rapists.","commenter_a":"I have this theory that if he wins, at his coronation hes gonna start his speech by saying he doesnt want to be president he just wanted to prove how racist and bigoted people in this country are by going out saying ignorant shit on all levels and poor rednecks eat it up. I mean seriously if people really think trump would be good for America those are the people that are wrong for America. You can spend all day polishing a turd but at the end of day hes still a piece of shit. All the anti muslim shit he spews with all his rich muslim buddies. He has hotels and other businesses in multiple muslim countries are we supposed to ignore that or what.","post_message":"They let her know, in no uncertain terms, that they have her back. - Eric March"}]
