[{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"10152934177006051","commenter_b":"Stupid Bitch you need your ass whipped","commenter_a":"Karma","post_message":"Even the police were stunned that a teen girl could be so cruel to an elderly woman."},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"10153519290756336","commenter_b":"Good He caught Her now She cannot steal Anyone Elses's Identity","commenter_a":"You are a thief ! .... end of story","post_message":"\"You picked the wrong guy.\" FOX 4 News reporter Steve Noviello confronted a woman who allegedly stole his credit card on camera."},{"comment_id":"10153781188388984","commenter_b":"We need to get Americans off of Welfare...80 million Americans are not coming off their porch until we take EBT away from them, the Obama phone and ACA. Immigrants with green cards would not be here if Americans would get off their ass.","commenter_a":"Ben Carson supports amnesty for illegal aliens. The liberals can have him.","post_message":"Rush Limbaugh just issued a huge statement Dr. Ben Carson ... this caught a lot of people by surprise. Do you agree with what Rush just said?"},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"1048532555215895","commenter_b":"What a sicko. she needs to be either arrested or locked up somewhere.","commenter_a":"Someone should sew her legs together..better still use lots of super glue, she needs to suffer s little.","post_message":"Woman: “I’ve Had Five Abortions Because I Love Getting Pregnant But Don’t Want Kids”"}]
