[{"comment_id":"10154095809901094","commenter_b":"Only aliens would do what they are doing, along with stopping any alternative or sustainable agendas, fuel sources.","commenter_a":"Of course. Alien agenda. They are terraforming the planet for the tall greys. Chemtrails have the make up chemically for their perfect atmosphere. Pumping it into the earth with fracking etc. Polluting the oceans. Terraforming the planet. Goal is set for 2029. Decrease the human population to 500,000. Believe it or not this is the plan. The NWO/'Globalist' agenda IS the alien agenda. Total take over. Out of the shadows","post_message":"US Navy documents reveal plans to inject 20,000 tons of heavy metals, plastics and other highly toxic compounds over the next two decades into the oceans where it conducts its war games."},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids Is The One True God (VIDEO) @webpagelink"},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"1321737624513912","commenter_b":"So they're not seen as better coders, they're better coders who happen to be women!","commenter_a":"If all 4 of the total androgynous coders had 80%of their code approved, would that mean androgynous coders were superior than both other genders? How about keeping to the science topics, not social engineering propaganda.","post_message":""},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""}]
