[{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means. READ MORE: @webpagelink"},{"comment_id":"1487874397904733","commenter_b":"A vote for stein is a vote for trump. Besides,google her. She is no prize!","commenter_a":"If any Bernie supporter will support Trump after reading this, they were never a Bernie supporter. If they say they will vote for Stein, they are not a Bernie supporter. Bernie was an independent. He got into this race as a democrat because he said A 3RD PARTY CANDIDATE CANNOT WIN.","post_message":"Wow, he went there."},{"comment_id":"1079778352065591","commenter_b":"She is cum bumb","commenter_a":"Hillary may be her Girlfriend!","post_message":"Talk about condescending!"},{"comment_id":"10152945760561051","commenter_b":"Great job for the AF vet I'm a 8 year vet from the ARMY I would have done the same maybe just a little more aggressive.","commenter_a":"No way the protesters are students. They are agitators.","post_message":"When this Air Force vet saw protesters stepping all over the American flag, she walked over to pick it up. Things escalated quickly from there."},{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"}]
