[{"comment_id":"10152907297842507","commenter_b":"look at them idiots......fff","commenter_a":"we need a new classification. White-Black-Latino-Asian-Native American-Loser.","post_message":"Anyone want to weigh in?"},{"comment_id":"10154222477216717","commenter_b":"I want her and trump dropped in the middle of Aleppo ASAP.","commenter_a":"What swamp did this creature slime her way out of!!!' I wish she would slither back in!!'","post_message":"Trump advisor Kellyanne Conway also said that detained Muslim travelers would be \"disposed of\" on a case-by-case basis."},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""},{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."},{"comment_id":"869870296383645","commenter_b":"I got bad news my greatgranddad was a yankee from OH I;m from KY. I know the war was over states rights","commenter_a":"My family were Union all the way but I have no qualms about the Confederate flag.","post_message":"\"In a free society, offensive speech should not just be tolerated, its regular presence should be celebrated as a symbol of democratic health.\""},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10153139427330329","commenter_b":"Jajajaja es el actor secundario N1","commenter_a":"que wea braaaad.. sale hasta en la sopa el ql ajajja Carolina","post_message":"Here is the new Magic Mike trailer. You're welcome."}]
