[{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"10153999197086623","commenter_b":"She needs those basement dwelling super predators!","commenter_a":"PLEASE!!!! Don't let the opinions/directions of others, polls, political analysts and outcome predictions determine your participation in the voting process. Register*… Vote… Exercise your right to be heard! *If you are not registered, in some places you may do so in person up to and through election day. Contact your state government voter organization or @webpagelink for more information.","post_message":"\"There is a platform now. I reflected on the things I've heard her say, commit to and seen in writing, and that's how I came to my decision.\""},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."},{"comment_id":"10153308250786770","commenter_b":"Even if a guy is into that, I can't imagine him liking those freaky legs.","commenter_a":"If he wants to live as a woman, that's on him, but could someone please tell him if he's going to wear short skirts to put on pantyhose? His legs are ugly & weird looking.","post_message":"\"That will always haunt me,\" Caitlyn Jenner said."},{"comment_id":"10153554741380950","commenter_b":"Wait until those other prisoners get a hold of her. She will wish she was dead! Many of the women in there worry about their children, and don't take kindly to those who hurt children! She'll get hers! Karma right around the corner!","commenter_a":"Do it to her!","post_message":"The 4-year-old boy's stepmother put his legs in 130-degree water for at least 20 minutes; it would have taken just 4 seconds to scald the child, prosecutors say."}]
