[{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"},{"comment_id":"620704854748480","commenter_b":"agree","commenter_a":"Agree","post_message":"Enough said."},{"comment_id":"1393293527430364","commenter_b":"Run us over girl. I'd love to have universal healthcare and lose this moron in command.","commenter_a":"All of this it's so true I've said this exact thing to you @username being Canadian fucking rocks 🇨🇦🇨🇦🇨🇦 y'all could learn a bunch from us if you could see past the orange dildo standing in front of you guys.","post_message":""},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"},{"comment_id":"10154037628650672","commenter_b":"Even the illegal/undocumented immigrants are human beings. Everyone deserves a chance at safety.","commenter_a":"This doesn't effect law abiding citizens!!! Immigrants are safe!!! People who are here illegally are the problem!","post_message":"Mayor Bill de Blasio is addressing the media in the wake of President Donald Trump's executive order to strip federal funding for so-called sanctuary cities."},{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"}]
