[{"comment_id":"1212130192174477","commenter_b":"Shall I keep going?","commenter_a":"Y'all are duped!!!! This is fake news, funny how any regular news outlet is not covering it. This would be mana fro heaven for CNN. Of course you now have been clued in, it won't do any good because you drank the Kool-aid and facts don't matter anymore. The fact that the fake story exists it a testament of propagated ignorance where it OK to be lazy and not even try to find the truth.","post_message":"IRAN OPENS Military Theme Park For Kids To Fight Israel, The West: Military Checkpoints, Machine Guns, Bullets Firing At U.S. Flags, Bunkers Replace Roller Coasters [VIDEO]"},{"comment_id":"10152829915341130","commenter_b":"What a doll she is!","commenter_a":"I hope you are successful. I love the breed, had one 33 years ago, she was perfect and sweet and love able....don't think she knew she was a Pit. We got her at 6 weeks. She was the runt of the litter and blond. So cute, so smart.....we loved her. Her life cut short, hit by a cAr...our fault, out in country did not think there was enough traffic to leash her for her morning job, one car amd she ran in front of it....I have never forgiven myself. But she had my heart at day one. Good luck with your training🐾🐾","post_message":"\"I don't want her bad behavior to speak for the breed -- rather, to behavioral issues born from neglectful and abusive homes. More than that, though, I don't want her to have any bad behavior. I want her to help fight The Great Pit Bull Bias.\""},{"comment_id":"10153946533833797","commenter_b":"Iam glad this guy grew some and told the girl to take a hike","commenter_a":"Love this! No one comes in between me and my little fur babies! 💜","post_message":"PET PEEVE: They always say a dog is man's best friend. And this guy is really proving it. One man chose his beagle when he was faced with the “it’s me or the dog” decision. More on the ad here:"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"10154902832777235","commenter_b":"Fuck that old bitch. She has probably done the same shit a million times.","commenter_a":"She came from pigselvania, lol","post_message":"This jolly little elf of a person is just brimming over with holiday cheer!"},{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"}]
