[{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"10153425194311336","commenter_b":"Or illegals","commenter_a":"Yeah lets all love each other just not the gays, liberals, and obama woo hoo ....","post_message":"“At heart we really are indivisible.” Megyn Kelly shares why she loves America. Why do you? Tell us using #ProudAmerican! @webpagelink"},{"comment_id":"10153472169705667","commenter_b":"Such a wonderful thing to do.","commenter_a":"Thank you, may the Lord Bless you and your family","post_message":"Napster founder Sean Parker's cash infusion is the largest ever for cancer immunotherapy"},{"comment_id":"10153441853036336","commenter_b":"A real lady doesn't hit a man. Haha.","commenter_a":"So how many times did he need to get hit by her before protecting himself?? She swung first...","post_message":"A Florida State Seminoles Football quarterback has been dismissed from the team after police released shocking video footage that shows the freshman punching a woman."},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"}]
