[{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"1214139651951673","commenter_b":"What a crock! Mr Trump is not a racist","commenter_a":"Sorry Jake but this isn't just about your skin color.it's also about a economic plan which the republican party has that is unfair. A foreign policy that won't work. -just about any plan they come up with is for the upper class.about much more than just you.","post_message":"18-year-old Jake Anantha was a Donald J. Trump supporter until he was kicked out of a rally. Anantha says he was being \"profiled\" and wants an apology. Watch more here: @webpagelink"},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"1705288253066676","commenter_b":"@username Building a wall is doable? Finding and deporting millions of illegals is doable? Banning Muslims is doable? Explain how","commenter_a":"So good looks qualify you to be VP of the USA? More reason to be afraid for our country. In addition to being racist and ignorant, this guy is shallow and beyond stupid (although we knew about the stupid part before)","post_message":"\"She’s got the beautiful looks,\" Eric Trump said. \"She's got — she’s smart. She's smart smart smart smart. ... She’s certainly got my vote.\""},{"comment_id":"1753488154905363","commenter_b":"Bush signed NAFTA. Trump is supposed have a moron.","commenter_a":"Deplorable from Ohio","post_message":"Donald J. Trump speaks to the press after touring the Flint Water Plant and Facilities."},{"comment_id":"1072393442772125","commenter_b":"Some people also don't have a problem with photos of Jews killed in concentration camps.","commenter_a":"Got news for you on the gross part. They've been doing that one for years. 40 years ago, I got a pamphlet in the mail with mutilated baby parts from abortions. Didn't change my mind about it being a woman's choice.","post_message":"It just might work"}]
