[{"comment_id":"10153206229641336","commenter_b":"You Carol, are a Goddess if you can swallow that orange whole! Puh-tow!","commenter_a":"Great. We need someone like him. He gets my vote.","post_message":"Vermont Senator Bernie Sanders is set to announce his decision to run for the Democratic nomination for the presidency as soon as Thursday, according to multiple reports. @webpagelink"},{"comment_id":"10152958677570927","commenter_b":"If it was that bad! Why isn't the border fence leaning toward the South! Someone will gladly take your number!","commenter_a":"Another stupid comment from the Peanut gallery","post_message":""},{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"1770180839911909","commenter_b":"I will be disgusted if Hillary is the president!","commenter_a":"I'm still in disbelief! Thank you for your service to this country Hillary. I'm just disgusted that Trump will be president.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10155683176459778","commenter_b":"@username classless is any woman who voted for Trump...","commenter_a":"I hope he sticks his middle finger up on the walk across the lawn...","post_message":"Are you ready to say goodbye to President Obama?"},{"comment_id":"10154071183936336","commenter_b":"#obamaville #EVILislam #muslimBrotherhood. #NOmoreDemocrats #SouthCarolinaForTRUMP!","commenter_a":"There is either more to the story or it's the usual Obamma admin ways.","post_message":"\"After acting to protect a child from sexual assault from an Afghan commander, SFC Martland was punished and could be kicked out of the military at any time,\" said Jay Sekulow, of the American Center for Law and Justice."}]
