[{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"10154442416273701","commenter_b":"You wouldn't likely notice a player. This woman was doing something else, I'm sure.","commenter_a":"Am I the only one that thinks it's disrespectful to be playing in a cemetery??","post_message":"Authorities in New Jersey say a woman trying to catch Pokemon in a cemetery ended up stuck in a tree and had to call 911 to rescue her."},{"comment_id":"10153307590149087","commenter_b":"Bitch got a face like a monkeys nut sack....to friggin ugly to be president","commenter_a":"Of course....he rocks!","post_message":"A poll of Iowa voters found Dr. Ben Carson decisively defeating Hillary Clinton in a hypothetical general election matchup."},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1415750351836830","commenter_b":"She was with the head writer of SNL and the woman who plays her on SNL skits. They All suck!!!","commenter_a":"id bet they were laughing at each other because they couldn't decide who was SKANKIEST.....","post_message":"Hillary raised a lot of eyebrows with her dinner guest..."},{"comment_id":"10152552248390736","commenter_b":"Obama doesn't want anything that will improve the country. It is against his plan for a Muslim takeover.","commenter_a":"Get started on the over-ride and start taking with the House to get this president impeached!","post_message":"The Keystone pipeline would bring a reliable supply of energy into our country – providing opportunity, creating jobs and lowering the cost to ship goods, products and crops. The idea that Congress is sidestepping the normal process is out-of-touch with reality. This project has been studied for more than six years and has been given the green light at every obstacle. Arkansans and all Americans can see that President Obama is the real hurdle to Keystone. I will continue to support this project, and I urge the Senate to quickly vote to override this veto."}]
