[{"comment_id":"1169952976350143","commenter_b":"Nope. I have worked in Criminal Court, and this was battery.","commenter_a":"Yup","post_message":"POLL: Should charges be dropped against Donald Trump's campaign manager Corey Lewandowski? (VOTE NOW)"},{"comment_id":"10154108457106782","commenter_b":"She probably screwing him","commenter_a":"Of course she supports him. She's nearly as stupid as he is.","post_message":"Kellyanne Conway, the high-profile White House counselor, has come under fire from Democratic and Republican lawmakers, fact checkers and the media. But she's so far maintained the support of her boss, President Donald Trump. @webpagelink"},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"},{"comment_id":"10153604606804024","commenter_b":"AFUCKINMEN ON THAT SHIT!","commenter_a":"OBAMA DOES NOT CARE---HE TREATS THE ENEMY BETTER THEN AMERICANS !!!!!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1363588373682001","commenter_b":"She should be a circus act, a walking talking pig!","commenter_a":"She's such a pig! She's irrelevant and is desperately attempting to retain some sort of notability. Yeah Rosie you and your big disgusting mouth will be remembered for the hateful words you've inflicted on society. Nice going!! I'm pretty sure you're own adopted kids figured you out and want nothing to do with you!? Very telling!","post_message":"Her tweet of a video questioning whether his young son, Barron, is autistic is nothing short of bullying."},{"comment_id":"426421217482473","commenter_b":"Yeah, I can picture this foul-tempered, lying, self-centered Socialist with an executive order pen in her fingers! Makes my blood run cold! There is NO WAY this liying, evil woman should ever get near the White House. She would be a foul-tempered dictator!","commenter_a":"Lowlife!","post_message":"Is Hillary Clinton threatening to betray the constitution?"},{"comment_id":"10155044912398010","commenter_b":"Trump doesn't want any more tunnels, after he builds his wall.","commenter_a":"Maybe it is true? Trump appointed him to head the DEA and he is going to pay for the wall??","post_message":"The Sinaloa cartel boss was recaptured a year ago after his second jailbreak."}]
