[{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."},{"comment_id":"754375298024849","commenter_b":"I thought you did well.. BUT we want the illegals gone.. I am not a fan of the illegals... Get a plan.. announce it and I will get on board... I am not a fan of Mexico...","commenter_a":"jeb is no good","post_message":"The Reagan Approach"},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."},{"comment_id":"10153977245641509","commenter_b":"Shirts for everyone!! If women can keep their shirts on, so should men.","commenter_a":"Yes","post_message":"This isn't just about decency, a CNN commentator writes -- it's a small exercise in democracy. What do you think? @webpagelink"},{"comment_id":"886338878165958","commenter_b":"Muslim GET OUT!! Allah can't help you in America!","commenter_a":"Or, they could just move to a muslim country.","post_message":"YESSSSSSSS! This totally just made my day...."},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."}]
