[{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"1267284936616307","commenter_b":"Figures that the media would just cover his Donald Trump comments but not on climate change comments.","commenter_a":"And igloos.","post_message":"Stephen Hawking issued a dire warning, but it wasn't about Trump."},{"comment_id":"963694916975312","commenter_b":"Actually, Pro-Life is fighting for the rights of unborn females while Pro-Choice believes that unborn females have no worth. If anybody is hating women, it is those who don't mind if they are killed while still very young.","commenter_a":"go ahead and have your abortion if you want it, but one day the consequences will come back to you, there are consequences to everthing","post_message":"\"People need to know that women have abortions every day and they go on and live their lives”"},{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."},{"comment_id":"10153689334397869","commenter_b":"Locked away in a prison? So that your tax dollars can feed him, cloth him and pay for the medicine when he is sick. There is already a fence up and they scale it. If you build a bigger wall then they will just dig tunnels.","commenter_a":"Governor, I've always respected you. I voted for you when you ran for president eight years ago, and I was proud to cast that vote. That said, wouldn't it be better to have him arrested and locked away where he can't do any more harm, regardless of what side of the border he's on? I'm concerned that having a \"deport the criminals\" stance fuels a xenophobic mentality that all illegal immigrants are dangerous criminals. Also, there's no way to ensure he stays deported for good, even with a wall. Lastly, it seems to imply that if he's a danger to society that we don't care about the lives of people outside of our borders. Aren't humans worthy of human dignity regardless of what side of the border they're on? Imprisonment seems like the best option. I'm genuinely curious, and would appreciate an honest, civil discussion.","post_message":"Prayers today for the family of North Texas firefighter Captain Peter Hacking, who was killed along with his four-year-old stepdaughter and 22-month-old son when a van veered into their lane and hit their car head-on. If the van driver recovers, he’ll be charged with criminally negligent homicide. Let’s hope that’s also enough to get him deported for good, since he’s an illegal immigrant who was already deported in 2008, but came right back across the border. Normally, I’d link to a news site for more, but I’d rather that you read it here. It’s the GoFundMe page set up to help Captain Hacking’s widow and his surviving son and four step-children:"},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."}]
