[{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"10153845270776167","commenter_b":"Joe make up your mind, can't have it both ways.","commenter_a":"Joe. That's the dumbest lie You've told. And that's sayin somethin","post_message":"Even small children would call this excuse nonsense."},{"comment_id":"10154496006728689","commenter_b":"@username I guess you're right with your saying!!","commenter_a":"Many people are saying.....not me, but many people. They might be right. I haven't fully investigated it yet, so I don't know,, but from what I'm hearing from many people........Things, I've heard things. Lot's of things. Not so good things...many bad things,I don't know, but it's what I'm hearing lately, from many people. They could be right. And then what? These things I've heard, from many people. Could be trouble...We're in trouble, folks.","post_message":"WATCH: Donald J. Trump: If Hillary Clinton gets to pick her US Supreme Court judges, \"nothing you can do, folks — although the 2nd Amendment people, maybe there is. I don't know.\" Read full story: @webpagelink"},{"comment_id":"10153927371866037","commenter_b":"May them leave now and so what... Do they think they can bring down saudi arabia ...! Rubbish","commenter_a":"new begginings for World Friends & Foes...! ( drawing a line in the sands-a dark Red Cloud will come from that part of the world. )","post_message":"Foreign Minister Adel al-Jubeir says that all Iranian diplomats must leave Saudi Arabia within 48 hours."},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."}]
