[{"comment_id":"1007328145956900","commenter_b":"Then take your ass back to england and leave all the money you made from American box office sales.","commenter_a":"Then go home.","post_message":"Well, that seems a bit over the top."},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"},{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"},{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"1024247464301668","commenter_b":"Thats life woman ....","commenter_a":"Why do we have to broadcast everything? Is anything private anymore?","post_message":"The scar that saved a baby's life"},{"comment_id":"720325791491332","commenter_b":"Josiee, you write like a whore. Are you?","commenter_a":"Screw the Muslims if they do not like our christian message go back to where you came from","post_message":"Trump is in deep trouble after sending out a beautiful message to his supporters. We stand with him. Can we get 40,000 ‘LIKES’ for Donald Trump?"}]
