[{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"1395470217172404","commenter_b":"Who knew?","commenter_a":"This is not news talk about garbage.","post_message":"As if he had to announce this..."},{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"},{"comment_id":"10153561162560530","commenter_b":"No, she hit him and kneed him in the balls","commenter_a":"Why didn't this show how he was shoving through the crowd and her up against the bar and that's why she got mad?","post_message":"Surveillance video from a Tallahassee, Florida bar shows Florida State University quarterback De'Andre Johnson and a woman engaging in a bar fight in June 2015. STORY: @webpagelink"},{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""}]
