[{"comment_id":"735303209993590","commenter_b":"Goog God.Shouldnt there be a law against ugly girls in bikinis?","commenter_a":"Probably wearing a swimsuit!!!","post_message":"What Chelsea Clinton Was Just Caught Doing Could Destroy Hillary's Campaign This puts Michelle Obama to shame. Do you think Hillary Clinton would make a horrible president?"},{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"10154310279241409","commenter_b":"@username I'm not against deporting any illegal immigrant that cannot qualify for resident alien status. If they have minor children, the children should stay with their deported families, but be allowed the reenter the US after the age of 18 with the proper paperwork. Legal migrant workers are the backbone of many US industries which would not survive without that work force. We don't really need a wall we only need to change the orders that have been forced upon our border patrol officers which makes the ineffective in most interactions with illegal migrants.","commenter_a":"Does anyone know what it is that they are protesting? Do they have any suggestions on how to handle illegal immigration, and the vetting process of refugees and immigrates? This seems like it may just be a way to get a day off work and get on TV.","post_message":""},{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"10153438152599087","commenter_b":"What a phony!","commenter_a":"This man should win an award . I wanted to hurl. Wake up people, he is setting you up, playing you like a fiddle for his own political agenda. What a low life to use the children over and over. Not one damn thing he is going to use that damn pen for, will stop the issues we have. The gun doesn't pull its own trigger and mentally ill, terrorists, and murderers do not obey damn laws. He wants to disarm the law abiding. Ask him to dismiss the secret service that carry guns to protect his ass and see how far you get.","post_message":"“Every time I think about those kids [in Newtown], it gets me mad,” President Barack Obama said as tears rolled down his cheek. WATCH:"},{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."}]
