[{"comment_id":"10153454020915329","commenter_b":"My favourite is free spirit - I might go with that one","commenter_a":"Bree Andrijich @username Amy Badock Monique Scott","post_message":"Sport fishing enthusiast?"},{"comment_id":"1118758671477300","commenter_b":"Illegal immigration is what Americans are against Trump for president 2016 !!!","commenter_a":"Biden doesn't speak Spanish either. I bet he had a huge crowd","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"533672440152326","commenter_b":"You know that just the stupid negroes . The same ones who will kill their own .","commenter_a":"Who ever is sending the haha face this is not the place ... And you are part of the problem please show respect and leave this page","post_message":"The body of slain Dallas police officer Michael Krol is escorted to the church for his final funeral mass here in Michigan. He will be buried in Southfield later today: More: @webpagelink"},{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"1241837469190442","commenter_b":"@username was gonna say too :/.. probably bhs...","commenter_a":"Tim","post_message":"Ready to play during recess? Sit on the bench at this school, and you'll find friends in no time. (via CBC Saskatoon)"},{"comment_id":"10153156840858690","commenter_b":"F**k off, blue haired Zionist murderer!","commenter_a":"just a game, fake for 3 reasons: 1. To lower the rising American hate that's growing in the world 2. For Isreal to keep using the US as a negotiator (like calling your big brother to be a \"indendent \" deal maker\") 3. Confuse people, now we are talking about this while the settlements are being built and time goes on","post_message":"Increasingly isolated, Israeli Prime Minister Benjamin Netanyahu turns to US Senator Chuck Schumer, Israel's leading friend, to enlist his support against President Barack Obama. It's likely their conversation went like this, says Marwan Bishara. @webpagelink"}]
