[{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"607614076095838","commenter_b":"Sorry asshole there is noway you're going to get rid of Jesus, don't believe it, just keep doing what you're doing.","commenter_a":"No thank you I'll follow Jesus","post_message":"What Obama just said will have you quivering in your sheets. He has completely lost it. Spread this and show America his true intentions. Do you agree Obama is a threat to American life?"},{"comment_id":"1142341912527542","commenter_b":"well so are you","commenter_a":"You haven't made a good movie since Good Fellows, sit down and shut up before you piss yourself.","post_message":"Robert De Niro has launched an excoriating attack on Donald Trump. The actor doesn't pull any punches in his criticism calling him a 'fool', a 'bozo' and 'an embarrassment to the nation'. And that's probably the nicest stuff..."},{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"10154161190123837","commenter_b":"Some psycho wife probably found out and messed it all up for everyone, typical.","commenter_a":"Lock her up!","post_message":"DOLLS BEAUTY SUPPLY: This business wasn't attracting women to buy cosmetics. Detectives believe it was attracting men to pay for sex."},{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""}]
