[{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"10153203883521717","commenter_b":"I was raped by two women when I was 5 years old","commenter_a":"InB4 feminists saying men can't be raped.","post_message":"Human trafficker who forced men to have sex for 20 hours every day gets 11 years in prison"},{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"860168877353787","commenter_b":"She has such a nasty attitude and doesn't try to hide it. Very haughty woman.","commenter_a":"She looks like she's giving him attitude. Why's does she always have \"that\" look on her face when she looks at whites and anyone else she considers below her?","post_message":"Caption this photo in the comments! ...... Former President George W. Bush and first lady Michelle Obama speak before President Barack Obama delivers a speech and takes a symbolic walk across the Edmund Pettus Bridge. (AP Photo/Bill Frakes)"},{"comment_id":"10155683176459778","commenter_b":"@username classless is any woman who voted for Trump...","commenter_a":"I hope he sticks his middle finger up on the walk across the lawn...","post_message":"Are you ready to say goodbye to President Obama?"},{"comment_id":"10152612107376636","commenter_b":"Women have to cover their hair in 2015 Ffs as if hair tempts men into sinning, give me a break.","commenter_a":"Not true! I am a Muslim woman and NEVER been pushed away from any mosque; whether it be in my home country Egypt or in Tunisia where I currently live with my husban. I am totally sick of the Independent and of all the bogus they keep spreading on Islam","post_message":"This is a problem that has been going on for decades, and little has been done to change it"}]
