[{"comment_id":"10153518944503984","commenter_b":"It's the Holy Spirit's job to convict or convince the unbeliever that they need a Savior. We can share the GOOD news that Jesus died and took our punishment for our sins but it is not our job to make people feel bad. Their hearts will know because of the Holy Spirit. We can share the news that we, too, were once sinners but now we are saints. People who come to God out of fear or condemnation usually won't stick around long because those emotions go away. People need to know that Someone has taken their punishment for sin for them and that they are loved more than words can say. We ALL are searching for love. Hope this helps.","commenter_a":"The Bible says it is the KINDNESS of God that leads people to repentance which is what it sounds to me like Joel Osteen is giving. Read the Word!! Jesus was not a hater no matter what people did. Paul or Saul, killed Christians too.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"861742507286409","commenter_b":"This is a beastly crime Do what should be done to an inhuman beast! KILL IT.","commenter_a":"Beat him to death like he did the veteran","post_message":"Refugee Charged With Murder After Beating 97 Yr Old WWII Veteran To Death. No media outrage, no riots, nothing. What do you think his punishment should be?"},{"comment_id":"10153231329598855","commenter_b":"She probably extored enough money to live off of so her job is nothing. What a narrow minded turd.","commenter_a":"WONDERFUL! Now if we can get all local, state and federal gay bashing employees to follow suit, possibly the USA will no longer be looked upon as the greatest hate nation on the face of the planet.","post_message":"She'd rather give up her job than grant marriage licenses to same-sex couples."},{"comment_id":"1815485588708872","commenter_b":"Kill your self woman!","commenter_a":"These are 2 polls of manyyyyyyy. These were outlier polls. The AP is a 14 pt spread in favor of Hillary. If they don't make this look like a horse race the last week or so, people won't watch. Nate Silver pointed this out last night. Go check out 538 polls. Imagine 100s of weather models predicting a snow storm predominately tracking east and 1 or 2 suddenly say west. Those are outliers and not a reflection of the whole. People are in here all excited bc they don't know what they are looking at.","post_message":"JUST IN: Florida and Nevada move back to Donald J. Trump's direction, with now six states and 87 electoral votes up for grabs"},{"comment_id":"1578711192434391","commenter_b":"Oh hell yes lock her up","commenter_a":"Yes","post_message":""},{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."}]
