[{"comment_id":"687141811427171","commenter_b":"Impeach her husband and she'll go away with him!","commenter_a":"Look who's being bossy now!","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10153956818033967","commenter_b":"I rolled mine back to Windows 8.1, 10 is worse than Vista.","commenter_a":"Step one....reinstall Windows 7","post_message":"Unleash the power of Windows."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"10154539572188433","commenter_b":"@username ignores taped audio/video proof if it exposes negative info about Killary!","commenter_a":"I don't understand how Drumpf can stand up in front of the American people and continue spewing his blatant lies. He should know that he can't get away with it. If he doesn't, he's no more intelligent than his dumb deplorable supporters.","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"1542337212473798","commenter_b":"Anyway, porn is evil and consent can never be bought!","commenter_a":"Fact is, some women enjoy sex, some women enjoy porn, and by saying a woman cannot or should not participate, and that they are all manipulated, you are taking away their right to choose. Thats antifeminist. Further, you are aaying women, by nature, are easily manipulated and dont know whats good for them, and thats also antifeminist. I ssy, as long as a woman is freely chosing the career, and is informed of what it entails, then have at it.","post_message":"How do we make pornography better for actors and the people who consume it?"},{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."}]
