[{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"},{"comment_id":"1154295914627380","commenter_b":"This woman is crazy for thinking of that.","commenter_a":"You remind me of the politicians who turned away boats full of Jewish refugees, and sent them back to Germany to suffer in the Holocaust.","post_message":"Hillary Clinton will increase Syrian refugees by 550% without a realistic screening process."},{"comment_id":"10153341904559170","commenter_b":"And why haven't you taken responsibility for your actions?","commenter_a":"And why haven't you solved your people's problems yet, Herm? Too busy slangin pizzas and tap dancing for white folks?","post_message":"Deplorable."},{"comment_id":"10153406065866800","commenter_b":"Already happened. That's the point.","commenter_a":"Wow, ok. So it's ok for a black person. To be racist, but if a white comedian made any of these jokes in reverse he'd be chased off the stage by pitchforks. Really guys? It goes both ways.","post_message":"\"For some reason black people need a white person to get their message out. I'm going to make this work for me, I'm going to hire a helper whitey.\" -- Jessica Williams"},{"comment_id":"1024169244346094","commenter_b":"So basically, nobody proofread the most important speech this woman will probably ever make. Yah, right. Wish there were SOMEONE I wanted to elect.","commenter_a":"all the first ladies speeches hold such content,, it is a speech of genuine concern and well they all have the same ideals,, so look up some other first lady speech's,, it will be a great opportunity to learn s0mething new and see what content the other first lady speech's hold,,you might find out something very interesting,,","post_message":"A speechwriter for Melania Trump is taking the blame for lifting passages from a 2008 Michelle Obama speech, admitting she made a 'mistake' – while saying she offered her resignation, but it was rejected. Full statement: @webpagelink"},{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"}]
