[{"comment_id":"10152910836255779","commenter_b":"Simply stated, the majority of the comments on this thread express what she is all about. Feminism, my eye tooth!","commenter_a":"Remember the days when you had to have talent to make the cover of @username? #TakeMeBack","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"10152860079081130","commenter_b":"Her fat neck though!!","commenter_a":"His hair looks like an old lady! This kid has serious issues!","post_message":"Ellen and the Biebs are at it again."},{"comment_id":"10153465175281162","commenter_b":"Unbelievable the number of ignorant do gooders on here. If you never handled pigs how can you say what is the best way to do it? if ya pick up a pig like a puppy it will struggle and squeal and put up a fight. but if ya hold it by a hind led it will settle down and let you handle it. The trucks they are on have multiple floors so yes you can get a lot of pigs on there, if they were less densely packed there would have been more mortality. and yes air can circulate. All you planet saver that think vegans are going to save the world, How much fossil fuel, fertilizer, herbicides, pesticides, and other pollutants, are produced in the growing and harvesting of what you eat.","commenter_a":"Jamie Hall","post_message":"A semitrailer carrying 2,200 piglets overturned on a highway. Watch as emergency crews rushed to wrangle the pigs -- > @webpagelink"},{"comment_id":"10152735928791680","commenter_b":"Of course. I know there is no way Hillary's home had anywhere near the \"Defense in depth\" that the government has. She decided to run her job from her less secure home. She brought it upon herself. ISPs and private servers are hackers easiest and most favorite targets, especially the traffic to and from. Take an IT course sometime. This info is taught at the basic level.","commenter_a":"Democrats can be mean brainwashed SOBs: @webpagelink","post_message":"Louisiana Gov. Bobby Jindal took his socially conservative message Thursday straight into the belly of the liberal beast: the New York Times’ opinion pages."},{"comment_id":"10153092280824270","commenter_b":"Was your clothing allowance enough to buy everything? If it was, DoD finance screwed up AGAIN and will correct that issue shortly. They apologize for any inconveniences this may have caused.","commenter_a":"Not sure why people are complaining about buying them. That's what a CLOTHING ALLOWANCE is for. It's nothing new. We had to buy our own ACU's too when they came out. I used my Star Card to get a couple sets and then paid myself back with my clothing allowance. Pretty simple.","post_message":"Soldiers can start buying the newest camo pattern on July 1 – the one that looks strikingly similar to what soldiers have been wearing in Afghanistan for years."},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10153856262981167","commenter_b":"And what do they show? Nothing in the previous 30K!","commenter_a":"Fixtion(sic) for Fox viewers like screaming \"fire\" in a theater.","post_message":"Really scraping the bottom of the barrel here"}]
