[{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"1114940968546374","commenter_b":"One man and one woman, Not 4 men and one woman. Stone her!","commenter_a":"Maybe she have life in prison since she likes jail so much.","post_message":"This is honestly what it's all about..."},{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"},{"comment_id":"1513869335297739","commenter_b":"I would like to know how to follow the day to day Congressional sessions. I would also like to know how to find out who in Congress reported for work when Congress was in session. I would like to know the Congressional schedule, pay, vacation time, healthcare benefits including what company handles their care. I would like to know of any other benefits they receive, as an example- I believe there is a gym in the Congressional building. These are the questions I want answered. Please direct me to the places I can find these answers. Thank you and your team for the hard work and excellent reporting all year. I become informed by the you and sound very smart as I share it all. Hah! Rest up and enjoy the holidays.","commenter_a":"We will need you more than ever in 2017. Keep up the critical thinking, it seems to be a lost art with so many. Merry Christmas.","post_message":"Just a quick note to our BillMoyers.com readers that we are going on a much-needed holiday break. Thanks to all of you for reading, sharing and commenting on our content in 2016. We’d love to hear your thoughts on what you’d like to see from us in 2017. Please share your ideas in the comments section below. And have a wonderful holiday! See you in the new year."},{"comment_id":"648669105287702","commenter_b":"That Bitch be ugly!!!!","commenter_a":"So be it","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"1084382244943634","commenter_b":"The below information must get exposed. Hillary wrote a college thesis on Saul Alinsky's book. We have to save America .!! These are facts., Not propaganda Please read and copy paste to pass this on The Cloward-Piven aka \"Coward Proven\" strategy is based on the teachings of Saul Alinsky a communist socialist died about 43 years ago, but his writings have influenced the politicians who control our nation today. Hillary Clinton did a college thesis on his writings and Barack Hussein Obama writes about him in his books. Saul Alinsky Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone think this stuff isn't happening today in the U.S. ? All eight rules are currently in play. There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The ...","commenter_a":"These are okay but when will the size and cost of government be SUBSTANTIALLY reduced? When will we secure our borders? When will we un-bridle the economy and the coal industry? When will we adopt the Fair Tax? Stop playing with the small stuff and fix the big issues!","post_message":"Here are 7 bills we recently sent to the president's desk. Every single one is now law. @webpagelink"},{"comment_id":"10153485942076491","commenter_b":"Thanks for the suggestions Mark but I really don't care what yoy think I should be reading.","commenter_a":"He really should narrow that down to a top 10 list. Nobody likes to read that many books.","post_message":"It includes ‘The New Jim Crow’ by Michelle Alexander."}]
