[{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""},{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"10154303723989411","commenter_b":"@username I'm not sure all of them are refugees","commenter_a":"if cannot adapt the European lifestyle why want to lived in Europe. I just do not understand, much better they lived in arab countries and do their own style.","post_message":"'We are not anti-migration party, we are for controlled immigration. We cannot allow for the borders just to be open for everybody who wants to come in and settle down here. No other country does that'"},{"comment_id":"10153171170386051","commenter_b":"Nasty ugly bitch","commenter_a":"What a sick bitch","post_message":"Police showed up at this woman's home only to find her young grandson naked. They asked him what was going on - and that's when he broke down."},{"comment_id":"10153748803376077","commenter_b":"Greed!!","commenter_a":"Whoa!!","post_message":"9NEWS Denver Broncos Insider Mike Klis has confirmed that quarterback Brock Osweiler is going to the Houston Texans."},{"comment_id":"10153016885814117","commenter_b":"The word you will never hear from your wife, @username.","commenter_a":"Perhaps the costs of CC regulation should be compared to the costs of climate change inaction? CEA finds what economists would call “increasing marginal costs” of delay. If we don’t make a concerted effort to keep the rise in average global temperature within the range consistent with modest costs and instead allow it to stabilize one degree Celsius higher, the annual additional damages would equal 0.9 percent of global output. A longer delay that added another degree would cause additional annual damages of 1.2 percent of global output. That’s a total change of 2.1 percentage points. To illustrate those annual costs more tangibly, 2.1 percent of current U.S. GDP, which is about a fifth of world output, is roughly $360 billion. The story doesn’t end there, however. There’s a lot of uncertainty around these estimates. Acting sooner rather than later is insurance against unpleasant surprises. We’re happy to pay fire ...","post_message":"Today, President Obama and the EPA are announcing the final regulations that would establish President's Clean Power Plan. How much will it cost you?"}]
