[{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"},{"comment_id":"10152707849071028","commenter_b":"With their family issues this's couple should not have children.","commenter_a":"\"Seven case workers were assigned to the family\" yet they didn't do a thing!","post_message":"The girl’s nose and part of her cheek were eaten away, while her upper lip was shredded. @webpagelink"},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."},{"comment_id":"10154647269064024","commenter_b":"You must be dumber than dumb to believe a fake news story. And the folks in Hamtramck are laughing their asses off at you, and everyone else, who believes this codswallop. Hamtramck is NOT under Sharia law.","commenter_a":"You folks in Hamtramck, Michigan must be dummer than dumb, now you can live and enjoy what you have done. Happy Days are NOT in your future.","post_message":"First Muslim City Council In U.S. ENFORCES Sharia Law... Too Late Now! - BB4SP"},{"comment_id":"10154311258046323","commenter_b":"Sorry about that but now I have stated my opinion hope that it carries equal weight","commenter_a":"What are you talking about !!we are fighting for democracy, he was our democratically elected leader. please do not patronise us and who are you to say \"it will never be done under JEREMY CORBYN \" Its only your opinion stop writing it as a fact. The guardian used to give both sides of the argument and leave the reader to make up their own mind.","post_message":"\"A well-led Labour party could win a general election by 2020 when the carnage will be there for all to see. But this will never be done by Jeremy Corbyn. The Labour party must be reclaimed – for the sake of British values, for British democracy and for the very future of our country. Nothing less will do.\""}]
