[{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."},{"comment_id":"10153406999866336","commenter_b":"This is why blacks think conservatives are racist. Only foxtards are defending this flag.","commenter_a":"How about just not ban anything...and let the consumers decide for themselves !!! Or...would that be racist somehow too ???","post_message":"“If Amazon.com is removing the Confederate flag from its offerings, the logical and principled decision is to stop selling any promotional material... of Che Guevara or any mass killer.”"},{"comment_id":"997631186950175","commenter_b":"That would be a terrible thing to do and there are many who would adopt that precious child","commenter_a":"Well if I was pregnant with a fetus with Down's Syndrome I would abort the fetus. Not everyone can raise a special needs child. I would not put it up for adoption, that would not be an option. That's just my opinion.","post_message":"Yes it does!"},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"}]
