[{"comment_id":"1028137907274272","commenter_b":"I just want to know all you people that are here illegally, if you love it here so much why haven't you went through the process of becoming legal? And if not then bye bye. I mean it's pretty fu**ing simple. Get legal citizenship or get booted back to wherever you came from. You need the United States, the United States doesn't need you.","commenter_a":"It's all fun and games until she gets deported with the rest of us.","post_message":"Meet Miriam Cepeda, a 24-year-old Latina and a self-proclaimed \"Trump girl\" campaigning for Donald J. Trump in Texas, 8 miles from the Mexican border. @webpagelink"},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."},{"comment_id":"1350025431679743","commenter_b":"Lmaoo thats why i say i cant be no girl","commenter_a":"See Babe Its Not Easy Being A Girl @username","post_message":"Women shouldn't have to spend a fortune on bras. Like ATTN: on Facebook."},{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."},{"comment_id":"1858889271057520","commenter_b":"Bitchhhhh","commenter_a":"@username Jayquan Parker @username","post_message":"A woman drove her SUV into a T-Mobile store after she says she couldn't get her cracked iPhone replaced. @webpagelink"},{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."}]
