[{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."},{"comment_id":"10154152289921957","commenter_b":"The woman is brainwashed!","commenter_a":"Why are these Muslims out of their country, If they're not happy with our system & law if they all go back where sharia law Is permitted everyone will be happy. Just go back and let the world be happy ,the rest of the world doesn't want sharia law. Don't go to other countries & try to convert to your beliefs, we are not interested at all, go back to your world. .","post_message":"The Women's March organizer thinks Trump is going to be oppressive to women and minorities.... as she fearlessly defends Sharia Law."},{"comment_id":"222401854833654","commenter_b":"Build the wall","commenter_a":"Say it to mexico, who build the wall with...? u know the answer, and it turned up very good, no illegal immigration and less crime , Israel built the wall too, and no muslims terrorist attack, bulgaria and hungary have kinda wall/fence, and no attacks, there you go...","post_message":"Those who don't know history are doomed to repeat it Details: @webpagelink #BerlinWall | #TrumpsGreatWall Join Us The Free Thought Project"},{"comment_id":"10156735133795354","commenter_b":"Yes, but they do not work, they are LAZY","commenter_a":"That would cost more too , plus how many on welfare due to injury taking pain medicine gonna be positive anyway ? Big mess","post_message":"***SHOULDN'T WELFARE APPLICANTS BE DRUG-TESTED LIKE EVERYONE ELSE?***"},{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"}]
