[{"comment_id":"889604141156365","commenter_b":"YOU LOOK LIKE A GORILLA SLAVE. WAS CHEETA YO MASTER? STUPID FUCKING NIGGER DOESN'T EVEN KNOW THAT IT WAS HER OWN RACE SELLING THEM TO MUSLIMS AND THEN TO WHITE PEOPLE. SOME OF THESE BLACKS ARE THE MOST IGNORANT SOB'S IN THE WORLD. MUST BE A QUEER BLACK WOMAN WITH A NAME LIKE BUBBA.","commenter_a":"First of all she is full of shit! when i worked in burger King you just kept on cooking .you dont know who is getting the Burger.she is pissed because she didnt prepare herself for a better job .Whos fault is that?why do thet put this shit onF.B .It isnt helping anybody It just fans the flames of racism.I find that OFFENSIVE!","post_message":"Did you miss this one? I bet you did because in Obamaland... 'The Media' doesn't cover such stories. Enjoy. @webpagelink"},{"comment_id":"1814664762098886","commenter_b":"But you sure don't mind taking white people's money do you Colin?","commenter_a":"Then have him sit on the locker room bench and not the field","post_message":"NFL player Colin Kaepernick isn't apologizing for his controversial decision to not stand during the national anthem."},{"comment_id":"1918194181741344","commenter_b":"Orange Hitler needs to shut up!","commenter_a":"Trump NEVER considers possible consequences of his words.","post_message":"Donald J. Trump told his supporters \"a bomb went off in New York,\" well before local officials had publicly confirmed details of the incident or what caused the explosion."},{"comment_id":"633174346857148","commenter_b":"You are absolutely correct. And, this was a time of turmoil in our country. How the times have changed. It's sad isn't it??","commenter_a":"Thousands of young people got together for 3 days of music and partying and no one got killed or caused havoc. It could not happen today.","post_message":"On this day in history, the Woodstock festival debuted on a dairy farm in New York in 1969. Do you remember the original Woodstock?"},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."}]
