[{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."},{"comment_id":"10153715327517894","commenter_b":"These hoes kill me acting like they the only one with a fucking opinion and that their opinion is the only one that's right bitch you got me fucked up Alex Carey and when I see some breast then I'll refer to transgender!","commenter_a":"I love @username, but I don't expect anything objective about Mariah Carey to come out here because @username and Mariah are besties. I'm sure there's more to the story than this.","post_message":"Nick Cannon Is Refusing to Sign Off on Mariah Carey Divorce Papers"},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"},{"comment_id":"10155201075949657","commenter_b":"why would a woman vote for this asshole he calls them FAT PIGS","commenter_a":"I'm surprised women don't value honesty more in light of Hillary's proven lies","post_message":"Trouble."},{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"},{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"}]
