[{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"},{"comment_id":"10153642652659411","commenter_b":"Needs to be bombed to death. No more terrorism, no more parasitic immigrants.","commenter_a":"You want to slow down the migrant crisis? Stop bombing the Middle East!","post_message":"Op-Edge: 'The root cause is frankly Europe just not being prepared for this large scale numbers of people fleeing persecution and misery in other countries. Europe has rather just closed its eyes to reality and rather hoped that the situation might just go away' - Keith Best, former Vice Chair of the European Council for Refugees and Exiles"},{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"10153452410792235","commenter_b":"LOL He is such a nut","commenter_a":"Ted, I prescribe driving your chevy to the levy...","post_message":"You mad, bro?"},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."},{"comment_id":"861460177233384","commenter_b":"She needs to smoke. Nancy Disgrace","commenter_a":"I refuse to watch her anymore..go away Nancy!!!!","post_message":"Nancy Grace vs. 2 Chainz: Part 2! Right now on HLN. Where do you stand on the debate? #PotToBlame"}]
