[{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."},{"comment_id":"964102913657572","commenter_b":"I guess he's not a good Christian !!!!!!!!!!!","commenter_a":"who is he?","post_message":"Americas Freedom Fighters"},{"comment_id":"10153122280259877","commenter_b":"Beautiful girls. Happy birthday","commenter_a":"Happy birthday Sasha,,,my twin girls birthday is today,,14yrs old","post_message":"We are wishing #SashaObama a very HAPPY BIRTHDAY today!! COMMENT to sign our #GrioBirthdays card for Sasha!!"},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."},{"comment_id":"1849595058601808","commenter_b":"That's one hypothesis...","commenter_a":"Jamie Steward","post_message":"Believe it or not, this has been a complete mystery for a long time. But there IS an evolutionary reason for it."},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."}]
