[{"comment_id":"10153882150921545","commenter_b":"Hahaha. Your an idiot lady!","commenter_a":"appalled by the comments on this article. this was a TEENAGE GIRL who was groomed and manipulated by ISIS agents via social media to leave her family to join them, not some mastermind terrorist who deserves to die. she is as much a victim as anyone else who has been killed by ISIS.","post_message":"ITV News reported Thursday that Sultana is thought to have been killed in May when a Russian warplane dropped a bomb on her accommodation in Raqqa, the de facto capital of the Islamic State"},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"1676979775916397","commenter_b":"IF TRUMP CANT HANDLE SOME FEMALE MODERATOR HOW THE HELL WOULD HE HANDLE WORLD LEADERS? GIVE ME A BREAK. DONT EMBARRASS THE REST OF THE COUNTRY NH!!!","commenter_a":"New Hampshire vote for him! Trust Trump! Thank you for volunteers!","post_message":"I enjoyed a great breakfast at the Airport Diner! Everyone get out & vote in New Hampshire! Lets MAKE AMERICA GREAT AGAIN! Voting questions? @webpagelink"},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."}]
