[{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10156082273560354","commenter_b":"Why in truth is it impossible to build this wall and yet we can send people to the moon???????????????????????????????","commenter_a":"UNIVISION owns Rick Perry now?","post_message":"\"It’s 1,933 miles from Tijuana to El Paso to Brownsville and you’re not going to build a wall on that distance. What you are going to do is...\""},{"comment_id":"10153704026896350","commenter_b":"And what kind of Kenyan or African name was it. Something no-one can pronounce or spell I'm sure.","commenter_a":"s","post_message":"Aww, we think the name is perfect!"},{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."},{"comment_id":"10153302631606636","commenter_b":"@username first claimed that all Muslims were terrorists and then claimed that any who thought so we're bigots. She must be so ignorant that to think that there are others that cannot read fast and with great stamina farer than her thoughts drivel out.","commenter_a":"Let me tell you there is no moderate or conservative Islam. Islam is Islam. There are not two Islams. Let me also mention that anybody harming any innocent person has nothing to do with Islam.","post_message":"It strictly follows Sharia rules"},{"comment_id":"10156146620705354","commenter_b":"Europe","commenter_a":"It's probably too late for Europe. It's not too late for the USA, but economically and socially we are following Europe's example.","post_message":"\"Islam Will Be the Death of Europe\""}]
