[{"comment_id":"10153225010746833","commenter_b":"These people should be tarred and feathered.","commenter_a":"This is what the liberals want.","post_message":" of New Jersey, warns Gordon VanGilder. The retired schoolteacher is the latest to fall victim to the Garden State gun laws the 72-year-old is facing up to 10 years in prison for having an antique flintlock pistol in his car. In this exclusive report, his attorney notes that VanGilder is facing the same felony charge for his unloaded mid-1700s firearm as he would be for a loaded .44 Magnum. is overreach, for sure, says VanGilder. @webpagelink"},{"comment_id":"500542473482734","commenter_b":"What's so crazy is that these people's ancestors were probably poor farmers! VERY few southerners owned slaves - only the richest - but they convinced the dumb farmers to go to war for them. Learn some history rednecks!","commenter_a":"Your ancestors didn't own a thing in their lives. They didn't own black people then and now. If someone did not willingly agree to become your slave it means you did not own them. They are their person. Unless they make An argreement with you as similar to terms of employment then you do not own then. All sales of slaves are void because you can't sell a human as property or goods. God already said Let My People Go... And so be it that was the end of slavery and should have remain that why. I'm sure if all Black people go back to Africa and the Caribbean and keep allot our wealth their and all white people move back to Europe without our riches we would still be more wealthy than you because you would knocking on our doors for our oil, gold, diamond and anything of value ...","post_message":"HOLY CRAP."},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"10153950706953132","commenter_b":"This is why people suck.. who the hell does that?? why??? WTF.. really man!!????","commenter_a":"Autumn Baker","post_message":"But it's the little boy who won the game."},{"comment_id":"444043602465820","commenter_b":"Look at her satanic pointed teeth!","commenter_a":"Not surprising, coming from stupid, I mean her.","post_message":"Democrat Leader says Her Kids Weren't Human Beings while in Her Womb!"}]
