[{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."},{"comment_id":"10154805040466037","commenter_b":"WTF!!!!! You're the hypocrite. Vote for Hillary a baby killer","commenter_a":"Dumb heartless trump, there are civilians....women and children in Mosul. They need to get out before attacking the place. Hmmmm there's something called \"war crime\" if u attack recklessly as ur suggesting innocent lives will be lost... It funny how u don't support necessary abortion to save a mother's life but ur happy to kill many innocent civilians... Trump = fool bigly","post_message":"“We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!”"},{"comment_id":"10152478705626990","commenter_b":"I eat a lot of eggs too, but it's just about a dollar or less, so I don't really pay attention to the price increase.","commenter_a":"Eggs are one of the few inexpensive natural proteins ... I'm concerned that this is gonna hit poor families where it hurts the worst :/ just a thought","post_message":"EGG-SPENSIVE! A new California law mandating that hens get more room in their cages, means egg prices are likely to go up --> @webpagelink"}]
