[{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""},{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"10154742351861336","commenter_b":"Insane b.s. But Hillary is a free woman. Wtf","commenter_a":"When I went to vote in the primaries, there were people wearing Hillary shirts and they had signs and were giving out stickers. Oh I guess it's OK for Democrats. :/","post_message":"A Donald J. Trump voter in Texas was arrested Monday for wearing a T-shirt to the polls that mocked Hillary Clinton’s infamous comment in which she said half of Trump supporters were “a basket of deplorables.”"},{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"10153567099501509","commenter_b":"Throw those Muslims overboard!!","commenter_a":"May God forgive them","post_message":"Muslims who were among migrants trying to get from Libya to Italy in a boat this week threw 12 fellow passengers overboard -- killing them -- because the 12 were Christians, Italian police said. @webpagelink"},{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."}]
