[{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."},{"comment_id":"472128496314627","commenter_b":"Yeah lol she cray","commenter_a":"She was talking all kinds of mess about Prince. Maybe someone scooped her up for interrogation.","post_message":"Irish singer Sinead O'Connor was reported missing Monday a day after she went on a bike ride in the posh Chicago suburb of Wilmette and did not return."},{"comment_id":"10154565207543812","commenter_b":"A gun can not cause violence. It's harmless. I have several. They have never shot anyone. They have never caused violence against me or anyone. Get it??","commenter_a":"He lost his brother, son and partner to VIOLENCE by someone using a gun. Could have been a knife, a baseball bat or even a suicide vest. Lay any of these items on a table and they do nothing. Let me know what I'm missing here","post_message":"#Dallas Police Chief David Brown Sr., a 30-year veteran and Dallas native, lost his former police partner, his younger brother and his own son to gun violence."},{"comment_id":"1325104020861488","commenter_b":"Both of those nut cases should be locked up and hit with $100,000 bail, third party and charged to the fullest extent. A little jail time should be mixed in with their punishment.","commenter_a":"Even as a woman I would have jumped in. But I'm a Country girl. I can whip ass like a Man. Especially when it comes to someone's life.","post_message":"A Florida police officer saw a car speeding over 100 miles per hour and stopped it on I-75 in Collier County, which the two men inside didn't seem to appreciate. After pulling a little trick before getting out, they began attacking the cop in the street to avoid arrest when they were met with an incredibly perfect dose of karma that they didn't see coming. @webpagelink"},{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"1676679282547936","commenter_b":"The women do have a choice... Unless they revolt.","commenter_a":"her crime was that his dinner was served to late by his wife and it was too cold for his liking..... Why would ANY woman marry a Muslim man? .... Even a Muslim woman.......","post_message":""}]
