[{"comment_id":"859046174191636","commenter_b":"she sucks like spike lee","commenter_a":"why is it important that she was a black female director? is it not good enough to be the Best Director?","post_message":"\"I do think it was a snub. But, I do believe she’s the first black female director whose film was nominated for an Oscar, so that’s already been history making.\" - Director Yoruba Richen on \"Selma\" and Ava DuVernay"},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."},{"comment_id":"10152595284751519","commenter_b":"If only the women on Fox News would start wearing tampons for earrings, maybe they'd be taken more seriously.","commenter_a":"How can any thinking woman vote republican? Stepford Wives comes to mind. How does the republican platform support women? Oh and Glen, ACA is winning. Read.","post_message":"We don't have to take Fox News' lies any longer. Here's how we fight back."},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."},{"comment_id":"10153435267083352","commenter_b":"Sick woman!","commenter_a":"Grr.","post_message":"Lady Sets Out to Murder Two Moms, Take Their Babies, Then Tell Her Former Man That the Kids Are Twins From Him Her Scheme Goes Horribly Wrong and One Baby Dies"},{"comment_id":"10153491983334087","commenter_b":"Look , she the cuase of all wars in Middle East , Voted for war in Irag ,war in Libya, war in Syria. She removed notorious terrorist group AKA \" MOJAHIDEEN \" out of terrorist list , so they can go to Syria . She is Republican","commenter_a":"Elizabeth Warren Sinks Clinton's Hopes for Endorsement @webpagelink","post_message":"“The difference between [Hillary Clinton] and Sanders is that she didn’t wait until the campaign to champion gun violence prevention,” said Dan Gross, president of the Brady Campaign to Prevent Gun Violence, which is endorsing Clinton in the presidential race."},{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."}]
