[{"comment_id":"1155951624441179","commenter_b":"\"Security concerns\"... Right. It was probably because smiling is illegal.","commenter_a":"Real reason: Mewtwo is in Tehran 😂","post_message":"Iran isn't going to catch them all."},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10153099824304753","commenter_b":"This bitch should burn in hell and die of slow painful death","commenter_a":"Look at this demon shaking my damn head","post_message":"She murdered two of her children, one of them in front of her 8-year-old son. At today's custody hearing, she wanted the whole world to know it and was kicked out of the courtroom. What do you think should happen to this woman? @webpagelink"},{"comment_id":"1755262658020828","commenter_b":"@username, good thing you have a vagina, or your head would be fair game. STFU","commenter_a":"Would anyone want him to be their pilot knowing how little he cares for a human? I wouldn't.","post_message":"It seems that words do have consequences after all."},{"comment_id":"10154497878598145","commenter_b":"So much White Trash in Florida!","commenter_a":"Omg @username I freaked out for a second....","post_message":"Authorities said the couple and the victim's son were having dinner, and when the child refused to eat his food, Stephen Collins became angry."},{"comment_id":"880526405340442","commenter_b":"Muslims bullying their way into power.","commenter_a":"Get your FREE money making website. No Investment Ever Earn and save on everything... loans, cars, insurance, merchandise, vitamins, hosting almost anything you can imagine, No Investment Required... EVER. @webpagelink","post_message":"The public was allegedly told 'not voting for him was sinful and un-Islamic'"},{"comment_id":"1878310592388061","commenter_b":"Deport this muslim.","commenter_a":"The Quran should not be recognized as","post_message":"First Somali-Muslim Lawmaker Who Married Her Brother Was Just Sworn In, And Americans INSTANTLY Noticed What She Had Her Hand On Top Of! This is ILLEGAL! Sharia is non compliant!"}]
