[{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"1150560135003462","commenter_b":"Pathetic Kardashian whore.","commenter_a":"you go it right she is pathetic","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"460205810854230","commenter_b":"The law should be to only give welfare to an American citizen. Then, take the American abusers off of welfare.","commenter_a":"But not as much as those in government office positions of welfare.","post_message":"The average immigrant household consumes 33% more in cash welfare, 57% more in food assistance, and 44% more in Medicaid, according to a new study by The Center for Immigration Studies."},{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."}]
