[{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."},{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"514346735420286","commenter_b":"Muslims cause cancer and sure death. Let's ban them...","commenter_a":"Amazing. After all these years they find this out. I think it's a bunch of bullshit. Remember certain people hate bacon and want it out of restaurants","post_message":"WOW! NOT EXPECTING THIS!!!"},{"comment_id":"961273403971266","commenter_b":"Very funny.","commenter_a":"It would be a GREAT pick....! Watching Liberals heads spin and POP will be fun..! Plus Newt would wipe the floor with Hill-Lie-ary and anyone she chooses for VP.","post_message":"Trump has been asking confidants for input on Gingrich as a potential pick."},{"comment_id":"1267284936616307","commenter_b":"Figures that the media would just cover his Donald Trump comments but not on climate change comments.","commenter_a":"And igloos.","post_message":"Stephen Hawking issued a dire warning, but it wasn't about Trump."},{"comment_id":"10153440735091130","commenter_b":"We don't want to hear any more about this ugly, perverted, faggot drag queen.","commenter_a":"Done w Huff Post","post_message":"Stunning!"}]
