[{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."},{"comment_id":"10153198316596336","commenter_b":"Wilma Loo...Who LOVES you Girlfriend ? ;-)","commenter_a":"Translation:We hid the money in offshore accounts in tax evading countries,wiped our servers clean,burned all copies and rewrote history.Nothing to see here,move along,move along.","post_message":"“We made mistakes.” The Clinton Foundation has issued a statement after improperly reporting some of its donations. @webpagelink"},{"comment_id":"811770395611301","commenter_b":"Kennites ! Caine's offspring is the remnant. Numbers 33 : 50 - 56 God told the Jewish people when entering the Promised Land. God said - Run the Inhabitants out of God's Land. Destroy all pagan Idols. Destroy all pagan high religious places. Possess the Promised Land ! May God bless Israel !","commenter_a":"Sons of Satan who want their own Caliphate hiding behind religious to commit atrocities again fellow humans.","post_message":"Women taken captive in Iraqi town Mosul. #Sexslave #ISIS #Iraq"},{"comment_id":"1197700750270781","commenter_b":"Get over it. The water is theirs. Respect it.","commenter_a":"@username I just adore you!!!","post_message":"These sharks aren't actually all that scary when you get your facts straight. Something else is, though."},{"comment_id":"10152784811780927","commenter_b":"Why give a s**t? You act like he is relevant!","commenter_a":"Why do we care what he thinks?","post_message":"Another rock star goes on the attack against conservatives."},{"comment_id":"1014609198628438","commenter_b":"She s the normal one!","commenter_a":"Oh I think this woman should be arrested and taken into custody as she is obviously a sociopath with a gun!!","post_message":""},{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."}]
