[{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"},{"comment_id":"10153924127869197","commenter_b":"My condolences to the family","commenter_a":"God bless her","post_message":"This 10-year-old girl died after she pushed two other children out of harm's way. Read more about the courageous rescue by Kiera Larsen --> @webpagelink"},{"comment_id":"1205428982807783","commenter_b":"Actually our laws are being ignored, all illegals by law are to be deported and anyone who employs them face prison time if the current laws were enforced","commenter_a":"DONALD TRUMP It is a shame that a billionaire ...regardless of politics or party ...can walk in, fund himself and blackmail the political process.... Is this the future of our country only self-funded billionaires can run for president from now on? If that is the case then this is no longer a republic and we are no longer operating through a democratic process TRUMP'S IGNORANCE on the world stage will begin to be seen now. JUST WHAT DOES THIS MAN KNOW? He knows how to conduct business and DIRTY business deals He knows how to declare bankruptcy He knows how to be a GOOD ANCHOR HUSBAND who takes young women the age of his daughter who are NOT CITIZENS and provide them with $$$$$ and a pathway to citizenship... THAT IS WHAT HE KNOWS TRUMP continues to show the world what a racist pig he is SANTORM and CRUZ and ...","post_message":""},{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"},{"comment_id":"1772911969633181","commenter_b":"Trump says they can come back legally. Why deport them?","commenter_a":"Try this Clinton: Little girl: \" Does my family have to go back to wherever?.\" Clinton: I'm afraid you do, you see your parents are criminals.\" Little girl: \"Criminals?\" Clinton: \" Yes your parents came into this country, illegally, they broke the law.\" Little girl: My parents are criminals? Don't bad people go to jail? At school the teacher, told us you belong in jail. Is that true?: Clinton: Just like your parents, only if I get caught\" Little Girl \" Oh Clinton I want to grow up to be just like you. Circumvent the law, lie, cheat, steal. I'll vote Democrat forever.","post_message":""},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."}]
