[{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"},{"comment_id":"540506192811626","commenter_b":"@username , the woman who owns the tummy.","commenter_a":"Yes! Absolutely! Women have the right to decide what's in their own best interest. Who does this man think he is to tell any woman what she can and cannot do with her body?","post_message":"“We should let women make their own decisions.” —Tim Kaine"},{"comment_id":"566760130115693","commenter_b":"lol women are objectifying themselves! they love the attention! women are one the most hypocrite creatures in the world!","commenter_a":"Females are excepting this behavior. It goes both ways..","post_message":"The #WomenNotObjects campaign wants advertisers to know that consumers are fed up with how females are portrayed in the media."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"10152653959642894","commenter_b":"my wifey cnt marry ciara's nigga #loveTINASHE","commenter_a":"hmmmmm \"HOW MANY TIMES\" we gonna hear that lie....I love Tinashe but when I found this out...lost so much respect for her. You know it's gotta be true....if you listen to \"How many times\" you know it...and....Ciara been hurt too many times so....she just gonna leave her baby daddy for NO REASON? Oh.....ok","post_message":"Tinashe Denies Rumors That She's Dating Future, Says It's '100% Made Up and Untrue'"},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."},{"comment_id":"480329612157619","commenter_b":"deport all illegals","commenter_a":"and I went through 2 WTC bombings 5 months pregnant in the first one.. 2 back surgeries had and foot surgeries in the second and I could not get a dime to support myself and my daughter other than the Social Security Disability I worked for for 23 years ...in fact was told \"I made too much money to get any help\" Really????","post_message":"This illegal immigrant has been collecting welfare for 20 years... This is outrageous. Illegals on welfare should be kicked off and deported immediately. Should we deport all illegals collecting welfare?"}]
