[{"comment_id":"886338878165958","commenter_b":"Muslim GET OUT!! Allah can't help you in America!","commenter_a":"Or, they could just move to a muslim country.","post_message":"YESSSSSSSS! This totally just made my day...."},{"comment_id":"1537745819864402","commenter_b":"and that still doesnt make him legitimate to run. Even down here in Australia we know he doesnt qualify... Surely they havnt dumbed billy yankee down that much???????","commenter_a":"Boehner and Trump, best of buds...who would have thought?","post_message":"Ted Cruz just got the best endorsement he could ever get. He could not have gotten a better endorsement than he got out of John Boehner."},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."},{"comment_id":"10154384389006636","commenter_b":"One of the biggest lies is that the state of Israel was built out of a scrap of desert with just a few primitive wandering around. So they perpetrate a lie that Palestine was the invention of Yasser Arafat and the Palestine Liberation Organization. Yet the real truth is that Palestine has existed as a discrete country for well over 2,000 years and there is plenty of evidence to prove this. @webpagelink","commenter_a":"Israel continually ignores international law and wonders why the UN resolution was passed against illegal settlements in occupied land. Will Israelis give the homeless shelter - hell will freeze over first.","post_message":"A nationwide strike"},{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"},{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"}]
