[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10153560993130667","commenter_b":"Sounds like Hellen Hollands is just a plain old witch to me.","commenter_a":"This school and school district should be ashamed of themselves. This young man left school in order to live - to SAVE HIS LIFE. He deserves every single thing that graduation affords, other than his actual diploma (which he will receive in December). I'm guessing there is no graduation ceremony in December, so he gets no graduation? School systems across America are failing their students every single day. Rules are made to be broken, changed or given a pass","post_message":"\"I never asked to receive a diploma and am even okay with not walking across that stage or having my name called. I just want to be a part of the ceremony.\""},{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"10153847730226336","commenter_b":"Those widows aren't afraid to strap on a vest and blow innocent people to pieces ...#mrpresident","commenter_a":"He could never win a debate with Cruz.","post_message":""},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"}]
