[{"comment_id":"1828581784096492","commenter_b":"You can be my snowflake anytime brother❤ the majority","commenter_a":"Snowflake. Go ahead. You can call me a snowflake. I don’t mind. In fact, I kind of like it. A snowflake travels through the atmosphere molded by the climate and emerges as a distinct crystal. Shaped by its environment but maintaining a steady path to become grounded on this earth. I am not the only snowflake. There are 65 million of us and together we are a blizzard. A sustained storm enveloping everything it its path. Clearing the air and blanketing the earth in a fine powder. Covering over the dirt and the grime along with strong winds exposing corruption, bigotry, misogyny, nepotism & cronyism. 65 million snowflakes are an avalanche. Once triggered, we are unstoppable. Accelerating rapidly and gaining strength. Overcoming all resistance. Scouring the landscape and hauling away the detritus and the scum. Leaving no place for prejudice and hatred to gain a foothold. Tearing down walls and ...","post_message":"Robert de Niro just said it ALL about Trump! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"10154231947457411","commenter_b":"You would think they would have heard all the bee's buzzing around up in the attic long before it got to this point. DUH.","commenter_a":"This is common wasps or bees or Lizards I have seen a lot but not this much","post_message":"A Texas homeowner found herself in a sticky situation after calling for help with what she thought was going to be a simple roof repair."},{"comment_id":"10154754813479369","commenter_b":"She is ALL Talk!!! A PERFECT Politician!","commenter_a":"I can't wait until he is prosecuted for all of the crimes he has committed. Will that happen? With a just justice system it will.","post_message":"Trump to Clinton: 'You'd be in jail' if I was in charge."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"},{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"821129384591070","commenter_b":"Big whoop. The lady could sneeze, and the Left would twist it into a controversy!","commenter_a":"Some people are just so unhappy in their own lives they have to try and make others just as miserable. Get over yourself and get a REAL life!","post_message":"Sarah Palin kicks off 2015 with a little controversy..."}]
