[{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"},{"comment_id":"967920213241731","commenter_b":"Stay out of Florida's business.","commenter_a":"Yes","post_message":"A bill to require a 24-hour waiting period for abortions passed the Florida Legislature and is now heading to Gov. Rick Scott's desk. Do you think he should sign it?"},{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"995637910477067","commenter_b":"HATE this hypocrisy. It's perfectly acceptable to tell a skinny woman to eat a hamburger or something, but if that woman then responds with \"eat a salad\", she's seen as a cruel bitch. Hate it!","commenter_a":"Prefer Pink any day to those anoreic coat-hangers.","post_message":"We love this tweet from P!nk about how you don't need a \"perfect\" body to be happy. <3"}]
