[{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"},{"comment_id":"1157413281045845","commenter_b":"Oh Hillary .... go get a life!","commenter_a":"Stupidty and desperation","post_message":"Remember when Hillary Clinton said refusing to accept election results was \"horrifying\"?"},{"comment_id":"1680942268839646","commenter_b":"@username..you're a fucking racist bitch!","commenter_a":"I would like to see in the White House, a president with love for this country. Hasn't been one there for over 7 years now.","post_message":"Would you like to see these two move in to the White House next January?"},{"comment_id":"10153043534789614","commenter_b":"Girl do your thang....U have a beautiful heart and it shows. WOOp","commenter_a":"You know wat, the only reason those guys said those thing is cause the DICKS are to small to please a big beautiful woman. If u agree give me a HELL YEAHHHH!!!!","post_message":"When Kristen Layne decided to sell her junior prom dress on Facebook, she had no idea that some people would respond by criticizing her weight and looks. \"These two men were just saying some very hateful things, just telling me I was fat and that I wasn't beautiful,\" she said. It wasn't long, however, before a number of commenters rallied to the Tennessee teenager's defense. One person posted: \"It's obvious this woman is beautiful, inside and out.\" Another wrote that the dress \"looks absolutely stunning.\" Layne had originally tried selling the gown for $350, but supporters have now raised more than $2,700 to help her buy a new dress for her senior prom. Read KTLA's story here: @webpagelink"},{"comment_id":"875339435822246","commenter_b":"And that wig is horrible!","commenter_a":"No new news...She says that about all men. No shame and straight up tacky.","post_message":"Sherri Shepherd Wants To Sleep With Johnny Gill… @webpagelink"},{"comment_id":"1152705121429163","commenter_b":"Illegals are voting in our elections.","commenter_a":"Don't you think you should stop asking this question and read the Constitution of the United States dumbass!","post_message":"I Agree!"},{"comment_id":"2179339492291943","commenter_b":"Stick that thumb up your assssss.....","commenter_a":"Bang bang trumpty","post_message":"Trump wants guns in your classrooms, but not at his inauguration."}]
