[{"comment_id":"10153113348589885","commenter_b":"A gun saved mine and my families life one night. Guns save more lives than you know . You disarm innocent people, murders will rise.","commenter_a":"This was a hate crime. We should also talk about gun control. This guy was a gun enthusiast. He killed them execution style. He had power over them. Gun power. Do you think he would have approached them if he didn't have a gun?","post_message":"A crowd gathered Thursday night at St. Louis University to pray for three young Muslims who were shot in the head Tuesday in Chapel Hill, N.C."},{"comment_id":"10155094190367577","commenter_b":"Wtf.. Russia is not communist","commenter_a":"China is still a communist country, as is Russia. As before, they are again silent allies against the U.S. and her allies, the list of which is getting shorter daily. Russia and China both are fighting other countries to win the land and resources they want from them. It is a chess game and the plan has been in play for decades. They have gone from fighting the Middlle Eastern countries, to becoming their allies. Those countries are the ones who have professed to be America's and Americamn","post_message":"China has backstabbed the globalists by trying to become a military threat instead of just an economic powerhouse:"},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"1043101302382000","commenter_b":"@username, the worst president in OUR lifetime was 2000-2008.","commenter_a":"Rep. Todd Young I understand your optimistic out look. How ever if you think that man will ever do anything, that would make America stronger then you greatly disappoint my opinion of you.","post_message":"While the President closed his State of the Union address by noting his desire to work across the aisle, much of his speech was spent digging in his heels on the same tax-and-spend policies rejected by the American people rather than identifying areas of common ground. But while I’m generally disappointed he took this tack, I still think there were some hints of bipartisanship that might present opportunities to grow a stronger economy. For starters, I agree with the President that Congress must pass a trade promotion authority bill. With two of the largest free trade agreements in the history of the world currently being negotiated, it is vital that the administration works with Congress to set negotiating priorities so that a deal might be completed quickly. In order to grow our economy, we must continue to open foreign markets to agricultural products and manufactured goods from places like Indiana, ..."},{"comment_id":"10154536510048279","commenter_b":"nonsense. keeping Donald Trump out of the white house is the only thing that matters right now in this historical moment. Now if Jill Stein were Gertrude Stein, I'd vote for her. She'd have a chance. But for now, we should take a clue from no one less than Angela Davis and vote for Hillary. There are a lot of right wing trolls out there disguised as purist lefties. Don't fall for it.","commenter_a":"There really needs to be an eye roll reaction option on ef book","post_message":"A leaked audio recording reveals Hillary Clinton told a group of donors she’s the center-left to center-right alternative to Bernie Sanders and Donald Trump."},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."},{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."}]
