[{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."},{"comment_id":"10152956638371051","commenter_b":"Clueless jerk off!","commenter_a":"I\"d tell them to kiss my ass!!!!!!!!!!!!!!!!!","post_message":"When a mom received this note about her son from a neighbor, she thought it was a joke."},{"comment_id":"1067594940000226","commenter_b":"#DumpTrump","commenter_a":"The ultra right wing justices that have been appointed to the court over the past 5 decades have done more harm then all the republican obstructionism. Obama needs to fill the seat ASAP with someone who will defend Roe v Wade, and keep the EPA on track to clean up our air and water for once and for all.","post_message":"Republican hypocrisy in a nutshell... Thanks to Democratic Underground."},{"comment_id":"1729018337314031","commenter_b":"Hello everyone,my name is sandra from the united state,getting my lover back was what I least expected and could never imagine,my lover and I were together for five years,but all of a sudden he changed completely and turned away from me and I had no idea what was going on,I tried asking him why but he refused to tell me what the problem was,as time went on he sought for a breakup,I was so worried and confused but I never gave up on him until I met an old friend of mine who had a similar problem,she told me about a spell caster called alakijaoogun who helped her situation,I never used to believe in spell casting in my entire life because I never taught it could work for me but to my greatest surprise it got me a positive result and I was able to get my lover back,even after ...","commenter_a":"i think she has thrush","post_message":"Miley Cyrus delivered quite a statement to Donald Trump..."},{"comment_id":"10153150214411320","commenter_b":"so judging by the comments...women think that it is too much, and men not far enough. :D","commenter_a":"Nothing left for the imagination","post_message":"The cover of the Sports Illustrated Swimsuit Issue features Hannah Davis. She is wearing one of the most revealing bikinis yet for the annual issue. Do you think the magazine has gone too far? Read also: Plus sized model to appear in swimsuit issue: @webpagelink"}]
