[{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"1587873301226283","commenter_b":"They won't do that. They are professionals and have ethics.","commenter_a":"This is how it is going to work now for the Libs. If you voted for Trump there will be a price to pay. Lost a lot of money because of Obama in Office and I let it be. Be careful Libs, Don't get Jammed up. Most of the Police, Firemen, and Military are Conservative. What would happen if they decide not to respond because your a known Lib.","post_message":"\"WON'T BE BULLIED.\""},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"1005094719524280","commenter_b":"Well lets send Trump to the southern border...im sure he will find all the rapists he is looking for....as matter of fact he should say to the all latino people in their faces,..you all bring nothing but rapists here....im sure when people came thru Ellis Island to start a new life Trump would have greeted them as well.","commenter_a":"Too bad the Coast Guard isn't on the southern border. The Cubans are actually fleeing a dictatorship.","post_message":"A USA Today reporter observed a U.S. Coast Guard crew intercepting Cuban rafters attempting to reach freedom on U.S. shores. Despite the recent news of normalizing relations between the U.S. and Cuba, these rafters were sent back to Cuba before they could celebrate on the 4th of July."},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"}]
