[{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1744752812466666","commenter_b":"He can't he has to pay for all of Obama's muslims he let in here during his presidency. Also, all the illegals. Unless we get rid of all the illegals there is no money.. Oh and the muslims that Obama let in here..LOL","commenter_a":"Mr. @username, Like where you're going. I would 1st Cut Welfare 100% and give it all to the Vets, they have earned it. Close the border and start kicking out un-documented, non tax paying illegals. Bring jobs back to the U.S.A, and repeal oshitcare. Also free up the 2nd A. If you Hate this Country Ask the Government for a ONE WAY TICKET to anywhere in the world. Free of charge.","post_message":"A NATION WITHOUT BORDERS IS NOT A NATION AT ALL. WE MUST HAVE A WALL. THE RULE OF LAW MATTERS! -DJT"},{"comment_id":"10154242925578837","commenter_b":"The wall will cost billions and stop hundreds. Wao.","commenter_a":"A wall to stop terrorists, criminals and drugs from pouring into America, what a noble idea","post_message":"CONGRESS TO PAY FOR WALL - GOP leader Paul Ryan says congress will end up paying $12 billion to $15 billion for President Trump's border wall."},{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"},{"comment_id":"10154198214815496","commenter_b":"Kid is gonna put u away","commenter_a":"This is crazy they get to do this","post_message":"Live | The trial of the mom and dad accused of locking their son in a room for almost two years continues. More on what you're watching (and updates when the stream is down): @webpagelink More on the case | @webpagelink"},{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"811770395611301","commenter_b":"Kennites ! Caine's offspring is the remnant. Numbers 33 : 50 - 56 God told the Jewish people when entering the Promised Land. God said - Run the Inhabitants out of God's Land. Destroy all pagan Idols. Destroy all pagan high religious places. Possess the Promised Land ! May God bless Israel !","commenter_a":"Sons of Satan who want their own Caliphate hiding behind religious to commit atrocities again fellow humans.","post_message":"Women taken captive in Iraqi town Mosul. #Sexslave #ISIS #Iraq"}]
