[{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"1092357044118639","commenter_b":"Except the assholes wouldnt drown. They'd just move to your neighborhood. I'd rather have them where they are right now.","commenter_a":"So basically where all the assholes in the U.S. live would be underwater. Anyway we can make this happen overnight?","post_message":"Would your city survive? What would Earth look like?"},{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"}]
