[{"comment_id":"10153573697440090","commenter_b":"If our next leader or liar was on that stage we are in trouble","commenter_a":"In your dreams!","post_message":"Take. It. Back. @webpagelink"},{"comment_id":"492568140946699","commenter_b":"Keep it close to the Whitehouse for the next few months, 2 fer 1! (JOKE)","commenter_a":"No.","post_message":"Guess who was at the ribbon cutting ceremony?"},{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."},{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"},{"comment_id":"833696443343651","commenter_b":"What a sick statement, what a horrible woman!","commenter_a":"Hillary Clinton was awarded the Margaret Sanger award for her abortion stance.","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"1019297701444035","commenter_b":"Fix it or pay the consequences rich people.","commenter_a":"What I want to know, is why in the hell is the contractor, not a American company but one from the UK ?","post_message":"This worker does everything right. He works hard, and all the time, and he still can't feed his kids without food stamps. Why does the Senate allow this?"}]
