[{"comment_id":"563015167220109","commenter_b":"@username. You are Brain dead. Your mother must be so proud that she raised the village idiot. Sure glad you don't live here so we won't have to put up with your stench!!","commenter_a":"Did you hear that the Post Office just recalled their latest stamps? They had pictures of Antonin Scalia on them ... and people couldn't figure out which side to spit on.","post_message":"WOW... he went there!!!"},{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."}]
