[{"comment_id":"914542602012252","commenter_b":"Communist asses back to Europe? That's a pretty racist thing to say isn't it. That's like me telling you to take your racist american hating ass back to africa","commenter_a":"The black community should be ashamed of backing this criminal","post_message":"People are going to EXPLODE on Fox."},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"},{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat? Hillary: Sure! 👻"},{"comment_id":"779121095562429","commenter_b":"You are so clueless.","commenter_a":"Sadly, his supporters will never watch this video. They are in utter denial. All they care about is his promise to stop immigration of Muslims and Mexicans and to keep white privilege in place. There are a lot of bigots/racists out there.","post_message":"Donald J. Trump has said a lot of things. Mike Pence said he didn’t say those things. He did. Here’s proof."},{"comment_id":"1013896902039895","commenter_b":"News flash, illegals don't have state ID's or driver's licenses therefore they couldn't be auto registered to vote. Another case of a republican who pretends to be smart.","commenter_a":"So illegals can vote too? dirty liberals","post_message":"A victory for voting rights!"}]
