[{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"10157662056330405","commenter_b":"Kasich is a sore loser..used to like him but after he lost the race for president he has gotten to be a sour sore loser..","commenter_a":"Good job, Governor! Wish there were more like you that agree to support what the PEOPLE want! My governor, Kasich, wrote in 80 year old John McCain for a president, wth! He's a disgrace!!!","post_message":"Great to rally a huge crowd in Eau Claire for Donald Trump, Mike Pence, Ron Johnson, and the entire Republican ticket."},{"comment_id":"10155790474957316","commenter_b":"*she's a woman","commenter_a":"Um...He's a guy so....","post_message":"Manning had been a candidate for gender-reassignment surgery, which would have been paid for under the Pentagon’s new policy for transgender troops. But the terms of the 35-year sentence the court-martial imposed includes a “dishonorable discharge,” which the commutation did not affect, Army spokeswoman Cynthia Smith said Wednesday."},{"comment_id":"995637910477067","commenter_b":"HATE this hypocrisy. It's perfectly acceptable to tell a skinny woman to eat a hamburger or something, but if that woman then responds with \"eat a salad\", she's seen as a cruel bitch. Hate it!","commenter_a":"Prefer Pink any day to those anoreic coat-hangers.","post_message":"We love this tweet from P!nk about how you don't need a \"perfect\" body to be happy. <3"},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"10155391516626729","commenter_b":"make the bitch donate it to charities or homeless people","commenter_a":"Green Party = Communist, it is all about the money","post_message":"Probably the objective all along."},{"comment_id":"10155444687161490","commenter_b":"*how dare she!!!!!","commenter_a":"@username, This ^^","post_message":"Ivanka Trump tweets about the \"importance of women having a seat at the table. @webpagelink"}]
