[{"comment_id":"10153228594071615","commenter_b":"Does it involve SPIDERsSsssssss????","commenter_a":"What doctor would even do this?","post_message":"Are you afraid of spiders? If so, there might be hope for you..."},{"comment_id":"1811602825768086","commenter_b":"@username they voted for TRUMP because Hillary is lying criminal that should be locked up","commenter_a":"not surprising.... the KKK IS a dem organization so it makes perfect sense that they would be able to get the uniforms.","post_message":""},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."},{"comment_id":"1607625002874515","commenter_b":"Whole Lotta good talking to your imaginary friend in the sky did her...","commenter_a":"Man, I was on Atlantic and Nostrand earlier this year, when Girl must've have been under the influence of this mess dropped her pants and ran across Atlantic avenue into on coming traffic. It wasn't no one but the angels that carried her to the other side of that street... Idk what jumped in my soul, but all I could immediately do was pray over her.","post_message":"Some are calling it 'Zombieland.' Bed-Stuy in Brooklyn is where 33 people were seen wandering around Tuesday, in what police say appear to be K2 overdoses. This video shows some of those who were treated."},{"comment_id":"911888578926545","commenter_b":"@username SO WHAT ITS LEADING TO THAT WE NEED TO TAKE OUR COUNTRY BACK AND PUT THEM IN PLACE THEY CAN T GET OUT OF OR PUT THEM IN MEXICO","commenter_a":"Civil Disobedience is totally fine and I salute those who stand by their beliefs. Perpetrating violence, burning, looting, damaging property etc. is not and those folks should be arrested and prosecuted.","post_message":"***The Radical Hard Left is plotting a Soros-funded plot to spark upheaval across America***"},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10153261191949255","commenter_b":"Misogynist fraud","commenter_a":"What a dink tip","post_message":"Rand knows that women have cooties. Yuck."}]
