[{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"10153079471709411","commenter_b":"Pakistan is terrorized from within, same as we are from the west.","commenter_a":"I wonder if this drone terrorised the inhabitants of the White House as much as US drones do to civilians in Pakistan?","post_message":""},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"1677499192511819","commenter_b":"you should post this for the misogynist guys on my link to see ahah","commenter_a":"@username this is exactly what that article you shared the other day was talking about. Is this real life?","post_message":"Donald Trump suggested Hillary Clinton is ahead because she's playing the \"woman's card.\" Not surprisingly, jokes and memes followed, pointing out the strange logic of such a statement."},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"10154888080729099","commenter_b":"@username idiot","commenter_a":"Yorkshire UK. Police shot a person the other Day, Last time they shot someone was 6 years ago.","post_message":"Breaking News: Police have shot and killed a man in Prospect Heights. The shooting comes less than 12 hours after an NYPD officer fatally shot a man in Canarsie @webpagelink"},{"comment_id":"892287504157347","commenter_b":"America is lost. We haven't won a war since 1945. When did it start? November 1950 when the American X Corps retreated from North Korea during the Battle of Chosin Reservoir. It was spun as a victory. Look who owns North Korea today. Yes! We lost. Harry S Truman was our Democrat president. We are losing peeps! You are getting your welfare checks, but for how much longer? We have aborted away our labor and armed forces. We are importing Islamic labor. (LOL!) Remember this date: 27 November 1950. It's the date the Chinese crossed the Yalu River and began our long, slow decline ...","commenter_a":"if they want to fly their flag go back to your own country, this is America their is only one flag and that is the American flag","post_message":"If the NAACP can have the Confederate flag, which is part of the heritage of THIS country, taken down in places coast to coast, should flags that belong to other nation´s cultures be allowed if they cause strife? Read More: @webpagelink"}]
