[{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"},{"comment_id":"923310344378873","commenter_b":"What a fucking idiot and a disgrace to the United States. this mother fucker needs to be stopped and now, impeachment is not good enough for the disgrace that he is I am thinking more like a firing squad!!!! Illegal immigrants are illegal hence the name and should not be counted in any vote, voters should have to show I.D. proving who they are and that they are citizens of the USA!!!!!!","commenter_a":"BS!!!!","post_message":"The Obama administration’s insistence that all states must use the same federal voter registration form effectively forbids any state from verifying – or even asking about – the citizenship status of would-be voters. @webpagelink"},{"comment_id":"10153761760496179","commenter_b":"Olivia Gregg 😅😭😂","commenter_a":"Anna Margaret","post_message":""},{"comment_id":"941727655948060","commenter_b":"the reason Trump is doing so well is that most Conservatives like me are sick of the way our country has gone down for the last 7 years..it got worse not better. Veterans treated shamefully especially the wounded in our VA hospitals. THe amount of our money that has been given to terrorist countries that hate us. And the flooding of our country with illegals who are given everything when we have many poor who could use help. Plus we do not know who or what has been coming here. Some that could be dangerous to our citizens and have been..","commenter_a":"Trump!!","post_message":"The Indiana primary may be the end -- and it's THIS WEEK. Make your voice heard by clicking the link & voting now."},{"comment_id":"1217766195006823","commenter_b":"DISGUSTIMG CLASSLESS PIGLETS UNREAL","commenter_a":"Congrats to the left,You've just proven to the world,you don't need Obama to make America look foolish,you can do it all on your own.","post_message":"ClashDaily.com"},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"965004330186413","commenter_b":"@username you are indeed a stupid bitch.","commenter_a":"Yes letting out a shit ton of animals out into an environment where they will overpopulate and have to be hunted anyway. Great job fanatics. I'm not at all pro fur, but true activists don't do those things.","post_message":"Seen 'em?"}]
