[{"comment_id":"1052907811455998","commenter_b":"She looks like Hitler's nasty ass! THERE'S A PARTY GOING ON AND THE TRUMP TRAIN TO GET ON, CHOO CHOO, CHOO CHOO","commenter_a":"The left wing nuts see trump as a dictator. He's trying to follow the Constitution and our rule of law. What a bunch of morons","post_message":"Sarah Silverman is a _____________."},{"comment_id":"1372709936105605","commenter_b":"someone should fire up her ass","commenter_a":"DISGUSTING NEWS BARBARIC..","post_message":"WTF IS WRONG WITH THIS CULTURE..."},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"},{"comment_id":"10155216559835603","commenter_b":"I believe if you follow the rules it shouldn't matter if they have quotas.","commenter_a":"I never worked where there was a \"quota\". I could write as many as I felt necessary.","post_message":"Do you believe some police departments have ticket quotas? One police officer tells us tonight they absolutely do and he has the paperwork to prove it! News 4 Investigates this shady system: @webpagelink"},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"533146616873631","commenter_b":"She is a racist nigga pig","commenter_a":"Not that he's is so bad give up the race crap","post_message":"I AM SICK AND TIRED OF THIS BS..."},{"comment_id":"1425850460773794","commenter_b":"She has obviously got a different understanding of Constitutional law than most citizens!","commenter_a":"Please go eat some cyanide soup...","post_message":"She is not fit for public office. Do you agree?"}]
