[{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"10155404890705354","commenter_b":"HHHAAAAAA just when you think these morons can't get any more stupid then they already are..HHHHAAAAAA......how about a lying bitch? is this phrase \"Off Limits\" personally I think it's really very descriptive of this...well...lying bitch....","commenter_a":"Bullshit!","post_message":"Hillary Clinton's digital thugs warn the media: using the word \"secretive\" is \"coded sexism.\" Take a gander at the rest of Hillary's laughable list of \"sexist\" words..."},{"comment_id":"10154391312414614","commenter_b":"I think these pro illegals group should pay the billions it's costing Americans, show their support that way......","commenter_a":"Annndd I don't care.","post_message":"\"We wanted to point out that while he seems to think he can say what he likes in one place and not hear about it elsewhere, he is wrong,\" said one Scottish protester, referring to Trump's controversial comments about Mexican immigrants. point of the flag is to show solidarity with the Mexicans and every other group that Trump has decried, derided, insulted and tried to marginalize, said David Milne, a member of the Tripping Up Trump campaign."},{"comment_id":"10153291228751037","commenter_b":"He's not abandoning his kids. He's still their for them.","commenter_a":"It's too bad he didn't do it before making all of his children.","post_message":"#BruceJenner’s ex-wife knew about his plan to transition decades ago"},{"comment_id":"10152826905226130","commenter_b":"Lisa Longbine you are without a doubt one of the biggest tools of society. Why dont you do some research before sounding even more ignorant than you already do. Measels is on the rise mostly due to the huge amount of diseased illegals entering the country by the millions. Due some research tool...","commenter_a":"There's a reason why people don't want their kids getting vaccinated. The fact that their daughter can't get vaccinated is proof enough that they're dangerous","post_message":"My daughter has cancer. Your unvaccinated kid put her in danger. Here’s what I have to say to you."},{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"}]
