[{"comment_id":"1738340076416341","commenter_b":"Women can be President too 21 Century America ,,,","commenter_a":"Vote Trump to end the Clinton Crime Cartel as we know it.","post_message":"Mike Pence \"signed an abortion law so extreme and so dangerous that even pro-life Republican women in the Indiana legislature spoke out and voted against it.\""},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."},{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""},{"comment_id":"10153646970166336","commenter_b":"She'd be worse than that in the role of President!","commenter_a":"She jeopardized National security!! The idiot!!","post_message":"Hillary Clinton said in an interview Friday that she’s “sorry” her use of a personal email for State Department business has “been confusing to people,” but didn’t offer an outright apology for her actions."},{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"1121791217896305","commenter_b":"Go back to school. Its not just to slow things down so you can understand!!","commenter_a":"\"We will reject bigotry and hatred and oppression' IM DONE LOL also you forgot a comma","post_message":"This is my pledge to the American people: as your President I will be your greatest champion. I will fight to ensure that every American is treated equally, protected equally, and honored equally. We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people. -Donald J. Trump"},{"comment_id":"977500405643041","commenter_b":"this picture says it all.their only destination is here.sorry no we have enough.","commenter_a":"oh deer what did they exspect no room left in britain","post_message":"Refugees are sleeping on rocks because France won’t let them in"}]
