[{"comment_id":"10152791090146523","commenter_b":"Feminist BS","commenter_a":"See, it doesn't just happen on college campuses. Young men learn young that sex is their \"right\" and if they want it, they take it. And then the girl gets blamed. Why do we focus on young women keeping themselves \"modest\" but do not focus on teaching young men to respect women and keep their pants on?","post_message":"17-year-old Muskego boy accused of sexually assaulting 15-year-old girl at underage drinking party."},{"comment_id":"1724147734520564","commenter_b":"First Ladies always ware pearls. Hers are a double strand!","commenter_a":"She's no lady she is only 1 step above hillary Clinton in being the most pathetic excuse for a first lady","post_message":"Has Michelle Obama been a good First Lady?"},{"comment_id":"1259514897430388","commenter_b":"I hope the other women in jail rip her to shreds BARE HANDED","commenter_a":"They outta stab her and rip her cords out without painkillers so she cant have any more kids","post_message":"JUST IN: Buckeye mother Andrea Portillo is accused of stabbing her 5-month-old infant to death. MORE: @webpagelink"},{"comment_id":"1312435595456367","commenter_b":"Meeee and babe lmao I feel bad for you on Saturday","commenter_a":"Maria LMAO","post_message":"Yo Chill"},{"comment_id":"10156625898105354","commenter_b":"Boo hoo whiney bitch. !","commenter_a":"Wow these lady must see through smoking glasses","post_message":"\"B**ch commits! That’s the hashtag.”"},{"comment_id":"607404219443285","commenter_b":"He's an idiot","commenter_a":"Then why in the hell did he get elected...twice?","post_message":"Delusional..."},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"}]
