[{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"10153341682339575","commenter_b":"Thank God for careless criminals.This case was able to be solved quickly because of it.","commenter_a":"I hope satan meet this scumbag at the gates of hell RIP beautiful young lady","post_message":"UPDATE: Bloomington Police confirm they have reopened the investigation into the disappearance of Lauren Spierer. This comes after the arrest of Messel in the murder of Hannah Wilson. Police will investigate any links between the two cases."},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"1183868738313543","commenter_b":"I'd rather have my daughter use the restroom with these people:","commenter_a":"Before you know it they will be in your kids public restroom if they aren't already, thanks to the new laws.","post_message":"UPDATE: The Winter Haven Police Department arrested 22-year-old Adam Timothy Tharp after he was caught flashing a 7-year-old girl at a Polk County library."},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"}]
