[{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"1079326368771039","commenter_b":"Devil women","commenter_a":"that will be a cold day in Hell!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’. This is just getting ridiculous. Do you think they should keep the cross in our Churches?"},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"1358265534191667","commenter_b":"She is an ignorant cunt and let some one break into her house and use it up and then she will change her mind","commenter_a":" .. . The problem is not guns. It is hearts without G-o-d. It is homes without discipline. It is schools without p-r-a-y-e-r. It is courts without justice. It is Obama willful destruction of the economy and good jobs, families to flourish. It is Obama directive to not enforce gun laws, giving himself the perfect excuse to label guns as the problem. Right out of the Marxist Playbook. HE is the problem. HE is the greatest traitor in the history of human civilization.","post_message":"The founder of Moms Demand Action for Gun Sense in America says she's done wallowing in disappointment following Donald Trump's victory last week."},{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"},{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"}]
