[{"comment_id":"10152888732626680","commenter_b":"This recent ruling by the Supreme Court on gay marriage is only about civil unions. Those who are making this about church unions could not be more wrong as the Majority Opinion of Justice Kennedy points out: \"Finally, it must be emphasized that religions, and those who adhere to religious doctrines, may continue to advocate with utmost, sincere conviction that, by divine precepts, same-sex marriage should not be condoned. The First Amendment ensures that religious organizations and persons are given proper protection as they seek to teach the principles that are so fulfilling and so central to their lives and faiths, and to their own deep aspirations to continue the family structure they have long revered.","commenter_a":"Here come the lawsuits from the States!","post_message":"The Supreme Court has legalized gay marriage nationwide by ruling that the U.S. Constitution bars states from denying marriage licenses to same-sex couples. Full story: @webpagelink The landmark, 5-4 decision split the court along the usual ideological lines, with Republican appointee Justice Anthony Kennedy joining the court’s liberal wing to back same-sex marriage rights and the court’s remaining GOP appointees dissenting. Before the court acted Friday, 37 states authorized marriages by same-sex couples, but most of those states did so due to court rulings that could have been overturned if the Supreme Court reached the opposite result."},{"comment_id":"1827543604143155","commenter_b":"That's right, all you chowder-heads SEE and HEAR what you want to. If MALEIFCENT does win, it will be through 100% corruption...but then that doesn't matter as long ad she wins, right? That way all the unemployed, druggie, scumbags can keep up the anarchy. Well, hold on to your backpacks cause there's a shit storm coming, along with rude awakenings.","commenter_a":"Alexis Marie","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153454020915329","commenter_b":"My favourite is free spirit - I might go with that one","commenter_a":"Bree Andrijich @username Amy Badock Monique Scott","post_message":"Sport fishing enthusiast?"},{"comment_id":"1524668304213513","commenter_b":"The other egg isn't going to hatch","commenter_a":"did both eggs hatch","post_message":"LIVE: American bald eagles Harriet and her mate, M15, are caring for their newly-hatched eaglet! So cute! (Credit Southwest Florida Eagle Cam)"},{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"10154202048116336","commenter_b":"piss off, Dirty Mary. We're having fun!","commenter_a":"Who cares lol. We have terrorist cutting people's heads off and we are freely bringing them HERE to America and your talking about this nonsense? Wow!","post_message":"Miranda Lambert brought a date to the ACM - Academy of Country Music Awards! Lambert, who split with husband Blake Shelton in July, brought her new boyfriend Anderson East. @webpagelink"},{"comment_id":"10154008919327439","commenter_b":"I cant stand these lying disgusting woman abusing savage animals MUSLIM MEN","commenter_a":"Didn't take long for \"moderate\", \"peaceful\" muslims to take on a new tactic. One that the liberal media will blame on Christians. These followers of allah/satan are true examples of evil!","post_message":"ISIS has issued a handbook for Muslims in the West. The gist of the instruction booklet is the necessity to blend in with the western way of life and to avoid ‘looking like a Muslim’ - pretend to be Christian -- so as to stay below the radar of the security services. This is important. It is key to understanding the enemy and their tactics. The media and the Democrats are deliberately misleading the public. You must educate yourself and those around you. Share this article on Facebook, Twitter, email. Build our army."}]
