[{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"},{"comment_id":"1851253931763489","commenter_b":"You WILL get the thin mints bitch!","commenter_a":"Nathan Williamson","post_message":"Knonk Knock, you want these Semoas?-mo Shop.tacticalshit.com"},{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"},{"comment_id":"10155369881175389","commenter_b":"Hillary should run on a ticket with McCain. Both are so full of themselfs.....hint","commenter_a":"#ThaiJohnson the reason she doesn't look into the camera is the same reason a person lying to you can't look you in the eyes, she has that Obama syndrome can't stop lying and can't keep tract of the lies.","post_message":"Question of the Day: What do you think of Hillary Clinton's performance at today’s press conference? Tell us in the comments, and tune in to Fox News tonight at 10p ET for more on this story."},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"}]
