[{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"10155746665275968","commenter_b":"@username so....that leaves people working and travelling abroad virtually unprotected.","commenter_a":"Those were the people in charge of the safety of all ambassadors. Wouldn't that constitute treason or gross negligence on the Trump cabinet that they don't have people in place in transition?","post_message":"😠 😨 😬"},{"comment_id":"869610479765368","commenter_b":"Oh it's only Muslims who r care free! Grow up what about non Muslims that r care free with the poor starving away! Do u know Muslims give the most charity! Stop being typical media followers, lead ur own minds","commenter_a":"I love how caring these Muslims are, while the rest of their people starve to death and kill each other, they are living in the lap of luxury","post_message":"'Our lives aren't like Homeland or Argo!'"},{"comment_id":"10153899931145575","commenter_b":"Wow, I wonder how many high school graduates are up in here!","commenter_a":"Now his voters will get behind the only true conservative in this race, Ted Cruz. This is not good news for Trump.","post_message":"Breaking: Rubio Drops After Florida Defeat..."},{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"}]
