[{"comment_id":"10153659512120667","commenter_b":"add plz","commenter_a":"Put one of these posers up against a Gracie see what happens...dumbed down fighting","post_message":"He did it again."},{"comment_id":"953914171315722","commenter_b":"I do agree that woman look proactive in these yoga suits. I always wear a long shirt over mine. Why cant these young women use some common sense.","commenter_a":"I am not responsible for someone else's thoughts.","post_message":"This woman's response to the idea that women should dress in a way that prevents men from having lustful thoughts is both amazing and hilarious:"},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"1870199419930367","commenter_b":"@username I would argue that we are far worse than monkeys.","commenter_a":"What's truly is a tragedy is the length of time humans have been in existence, and we still haven't gotten very far and I don't think we're capable of forming a world based on simple human decency.","post_message":"A great nation is judged not by how many millionaires and billionaires it has, or by the size of its military budget. It is judged by how well it treats its weakest and most vulnerable citizens. A truly great nation is one that is filled with compassion and solidarity."},{"comment_id":"10155265316599199","commenter_b":"No. She was just bat s%$@ crazy","commenter_a":"Im sick of you Christians shoving your religion down our throats. Literally","post_message":"Court documents say the mother \"saw her daughter die and then placed her body in the shape of a cross\""},{"comment_id":"880698808638574","commenter_b":"Bilble is all about sex","commenter_a":"This is done in public? Wonder what goes on in private.. But Wait! Do we not hear of the domestic violence in this country also. Christian , Jewish, Hindu as well? Religion is not true religion if it practices such violence.","post_message":"A Saudi female victim of a gang-rape is sentenced to 200 lashes and six months in jail More details: @webpagelink"}]
