[{"comment_id":"10152768330837452","commenter_b":"Good, then keep them home.","commenter_a":"I will home school my child before I let the state lawmakers tell me what I should and shouldn't inject them with !!!","post_message":"BREAKING NEWS: Lawmakers have approved a bill that would require California schoolchildren to be vaccinated. @webpagelink The proposal would eliminate the state's personal-belief and religious exemptions, so unvaccinated children would not be able to attend public or private schools."},{"comment_id":"420003978124197","commenter_b":"She's getting back what she deserves ! Treasonous witch !","commenter_a":"She's a loser","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."}]
