[{"comment_id":"10157488430805354","commenter_b":"Lock her up !","commenter_a":"She should strike her","post_message":"***Viewer Discretion is Advised*** The mother, streaming live on her daughter’s account, tore into and struck the 16-year-old numerous times for posting provocative photos of herself on Facebook...."},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"514850542008234","commenter_b":"Tyler, youz a lil bitch!","commenter_a":"Psshh* his Dad is a fucking Islamic nut, we all know what that kid was up to, this kid is PROOF how dog shit socialists insane the media is. What an embarrassing joke.","post_message":"“Wow. Just wow.”"},{"comment_id":"654547928069119","commenter_b":"Her momma needed to be called..to see what a disrespectful kid she has..","commenter_a":"She deserved what she got..","post_message":"Obama supporter gives lip to police, learns very quick lesson. This is what you get when you disrespect authority. Do you think she got what she deserved?"},{"comment_id":"10157746035990093","commenter_b":"Megan needs to be Fired! She could always work for the Clinton's.","commenter_a":"That's one lieing women","post_message":"Donna Brazile CANNOT take Megyn Kelly's line of questioning and it's hilariously uncomfortable. She's so CLEARLY lying!"},{"comment_id":"10153375690709087","commenter_b":"Stop any and all immigrants from coming in until we can financially take care of our own first","commenter_a":"Even BB knows it's not just a \" religion\"....","post_message":"Benjamin Netanyahu - בנימין נתניהו \"rejects Donald Trump’s recent remarks about Muslims,\" the Israeli Prime Minister's office said in a statement. \"The State of Israel respects all religions and strictly guarantees the rights of all its citizens. At the same time, Israel is fighting radical Islam which is attacking Muslims, Christians and Jews alike and threatens the entire world.\""},{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"}]
