[{"comment_id":"10153512778925667","commenter_b":"Life is like a camera. Just focus on what's important, capture the good times, develop from the negatives, and if things don't turn out take another shot.","commenter_a":"They should put him in the same cell as Clinton.","post_message":"Martin Shkreli could face additional criminal charges."},{"comment_id":"1074021369287319","commenter_b":"She's negative. ..kinda like both of u ... f off","commenter_a":"Beyonce is an asshole","post_message":"Not a lot people noticed, but Beyonce took a major stand last night."},{"comment_id":"10153340865359087","commenter_b":"MONEY KEEPS U OUT OF JAIL QUILTY OR NOT u can make bail u are out","commenter_a":"Don't want to go to prison, don't break the law. It's that simple!","post_message":"“It is wrong for corporations to be making profits from the incarcerations of their fellow Americans,” Bernie Sanders said. “I want to see incentives to get people out of jail or prevent people from going into jail.”"},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"10154678643996729","commenter_b":"Screw that ignorant queer!","commenter_a":"It makes sense now why the Obama administration doesn't want us to have guns, he needs to sell them to people that hate us.","post_message":"This one hits close to home..."},{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""}]
