[{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"},{"comment_id":"1788323888048645","commenter_b":"SouthernBox Blues But why are the prisons full? Getting rid of the illegal aliens from them would help. If the little jackasses need to be locked up, do it. Just like Sheriff Joe, put them in a tent.","commenter_a":"Its time for Chicago to clean house . From the dirty politicians all the way down to these street thugs .","post_message":"WATCH: 71-year-old man shot while watering lawn; new Chicago shooting sparks outrage: @webpagelink"},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"915434395182976","commenter_b":"As a mom myself, I agree with you Ben. How much did she actually ingest if she took a sip and said it tasted funny?","commenter_a":"Clearly this is not cool, but accidents do happen in life. She drank a tiny amount of watered down sangria, not methylated spirits or even vodka. I think the parents are massively over reacting. I would be angry, but come on, a few sips of cheap wine mixed with orange juice is not going to kill a small child.","post_message":"She was rushed to the hospital drunk"},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."},{"comment_id":"865303986949796","commenter_b":"She has the 2nd highest rated show on cable news and all YOU have is this little space on Trumpbart to air your idiotic views. Not hard to see who is more important.","commenter_a":"Grow up Megyn....as I have stated before...YOU went after him and lost ALL credibility you had. As important...your \"love fest\" with the disgusting Michael Moore was the last straw. Get over it...you just are not that important.","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"}]
