[{"comment_id":"1287108874642473","commenter_b":"OF COURSE OBAMA`S AND HILLARY PAY CHECK FROM SAUDI ARAB IS GETTING BIGGER BY SECOND , IMAGINE WHEN THIS HYENA BRING MORE OBAMA`S ANGEL REFUGEES... HOW BIG HER CHECK WILL BE..? HYENA CLINTON WILL NEVER SUFFER MUSLIN VIOLENCE , SURROUNDED BY HEAVY ARM BODYGUARDS , OK...WHAT ABOUT YOUR FAMILY..? IF OBAMA`S GANGSTERS TAKE OUR GUNS ...HOW WE ARE GOING TO PROTECT OURS FAMILIES...? WORKING HARDER IN ORDER TO FEED OBAMA`S ISLAM ORPHANS & WIDOWS ANGELS OR BLACKANIMALMATTER OR ILLEGALS ,...DEMOCRATS SLAVERING THE PLANET FOR ISLAM ...NOT SEE IT YET ...SERIOUSLY ..? CHECK HOW MANY PEOPLE ARE ON WELFARE OR FOOD STAMPS ..","commenter_a":"Who is the mayor?","post_message":"\"If you go 15 miles from downtown you will find communities that don't have water or sewer yet.\""},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."},{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."},{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""},{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."}]
