[{"comment_id":"10153099143921323","commenter_b":"...rape their asses!!","commenter_a":"What will it take to stop ISIS, period! Where are the voices of reason and moderation among Muslim leaders? How can we help them be heard?","post_message":"Noor, a 14-year-old girl from a small village in northern Iraq, was sold 15 times, passed from one Islamic State fighter to the next. Each time, she was raped. Noor managed to escape and made her way, mostly on foot, to a refugee camp. “The worst moments,” Noor said, “were when one man would sell me to another. And I would have to hear them debating what my life was worth.”"},{"comment_id":"474408059350901","commenter_b":"Stay off their land!","commenter_a":"Err... They only kill white people because their other fellow tribes who join the \"democratic\" world suffered a lot of losses and they warned them. There is a documentary on this. You should check it out.","post_message":"Anyone who has ever tried to come ashore the island was attacked or even killed."},{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"10153306237383984","commenter_b":"It's about d**n time......quit dragging your feet and file the articles....make sure to include all his bogus names in the charges including the name Davis","commenter_a":"If it hasn't been done by now,it's not going to happen.He might be impeached, but to actually 'remove' him from office takes a seperate action,and that's the ultimate goal.But.........don't get your hopes up. Saying and doing....are seperate issues as well!","post_message":"Wow. This guy has a lot of guts to go after Obama in this way. Do you hope his plan to take down Obama is successful?"},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"600515870151925","commenter_b":"I'd say the dog has reached that point because it is being handled incorrectly. I'd put a spot light on the Obamas for not treating the dog properly and training their girls on how to treat the dog. Dogs don't lash out just like that. It would have to have been constantly mishandled. Like that stupid heavy jewellery around the neck for instance.","commenter_a":"I don't think they need to sue, if he takes financial responsibility for the cost of the injuries.","post_message":"Should they soak the Obamas for big bucks? (Or at least some sort of political favor?) Wealth being spread around. That the Obama way, isn it?"}]
