[{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""},{"comment_id":"1033723873315290","commenter_b":"Brian Feltman feltman","commenter_a":"THE MINNOWS CLING TO THE FLOTSAM","post_message":""},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."},{"comment_id":"964183830350156","commenter_b":"Somebody give that girl a sammich!","commenter_a":"Kellyanne looks like she is about to physically break down. I would feel sorry for her, but she brings this entirety upon herself.","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it. Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"1370415506308495","commenter_b":"I believe you have that backward.","commenter_a":"They are Demon-crats. Get it right you dirty rat!","post_message":"An activist joins thousands of Bernie Sanders supporters who are demonstrating ahead of the Democratic National Convention in Philadelphia."},{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."}]
