[{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."},{"comment_id":"598276743693951","commenter_b":"Wow. What a racist pig..","commenter_a":"You serve SATAN !!!! You are a very poor excuse for a human !","post_message":"CNN host Fareed Zakaria calls for jihad rape of white women"},{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"10153101745071336","commenter_b":"kat, an arms limitation agreement isnt a treaty.","commenter_a":"Yep, once the ship starts sinking, the rats are the first to go. Good riddance!","post_message":"BREAKING NEWS: Senate Minority Leader Harry Reid announced that he will retire from the Senate at the end of his term. @webpagelink"},{"comment_id":"10153373415836130","commenter_b":"That's right.","commenter_a":"They NEVER thought it was a bomb. If they had, why was the school NEVER evacuated? They were racist, bigoted asses who lied when their hatred was bared to public scrutiny","post_message":"The family is “still deciding where he will go next.\""},{"comment_id":"10153917800769087","commenter_b":"Suck Ass Fox (lol)","commenter_a":"the people who think trump is a joke need to get smart....in a hurry. the only vote that will count in november is the one cast to defeat, no, destroy trump. i don't think jill stein will do that. hillary will. hold your noses people and do the right thing. for the wrong reasons perhaps, but do it. after the dust settles and trump, god forbid, wins, it will be too late to hear you whining.","post_message":"Dozens of the most prominent people in Silicon Valley signed an open letter on Thursday warning that Donald J. Trump \"would be a disaster for innovation.\""},{"comment_id":"10155210015483132","commenter_b":"What about him he deserves a good women she's nasty","commenter_a":"Good for her! She deserves a good guy","post_message":"Things are heating up between Valentin Chmerkovskiy and Amber Rose!"}]
