[{"comment_id":"10152774559661051","commenter_b":"He Should criticizing Christians when so many muslims are creating problems all around the world.","commenter_a":"Rot in hell.","post_message":"President Obama says Christians should stop criticizing Islam because \"people committed terrible deeds in the name of Christ.\" And he didn't stop there."},{"comment_id":"10152752919406051","commenter_b":"She should have spent AT LEAST ONE YEAR IN CUBA.","commenter_a":"I know this might stir up the pot even more, but my sister got gastric by-pass surgery over 10 years ago & has severe health problems ever since, and will have them for the rest of her life. She also has to take a truckload of pills every day in order to make sure she gets enough nutrients so she won't have other health problems from not eating enough. Anyone doing any research on gastric by-pass will find that it's not the solution to weight loss, and in some cases, they're much worse off than before. This woman isn't so fat that she can't lose the weight on her own. The problem is she doesn't want to lose weight. If your \"want to\" isn't there, even gastric by-pass won't be very effective. I personally know 3 women who have had this surgery & they've all gained whatever weight the lost ...","post_message":"This woman says she’s too fat to work, so the government offered to pay for weight loss surgery. She had a different plan."},{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"},{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"},{"comment_id":"1122936174469300","commenter_b":"That fat lady will sing in the end, just wait","commenter_a":"I'd never vote for ANY republican, but when it comes to one-liners nobody beats Trump. His smack-down of Hugh Hewitt was epic, and Trump argued well taking on both Rubio and Cruz at the same time.","post_message":"Romney insists Trump's reasoning is an excuse."},{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."}]
