[{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10153963833427212","commenter_b":"She hit him too.. He should have walked away, but she is not innocent....","commenter_a":"I will never condone a woman's bad behavior however I will not condone a man laying hands on a woman. I believe in self protection but, I don't blame her for wanting to block this and I do blame him for his assault on her. He apologized and they delayed it long enough that the statue of limitations applied so why people will always defend a man and an athlete just because they are is quite pathetic. Women are always scapegoated to be the reason they got hit or assaulted and worse of all by women!","post_message":"ICYMI: Amelia Molitor, the woman OU running back Joe Mixon punched two years ago, filed a new motion to block the release of the assault video on Thursday. #News9"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"916726885042526","commenter_b":"Such a FOOL !!","commenter_a":"He must be hitting the bong again","post_message":"President Obama said he thinks he's been a pretty good president, and he could win if he ran again. What do you think? Read more at @webpagelink"},{"comment_id":"10156146620705354","commenter_b":"Europe","commenter_a":"It's probably too late for Europe. It's not too late for the USA, but economically and socially we are following Europe's example.","post_message":"\"Islam Will Be the Death of Europe\""}]
