[{"comment_id":"710448769145701","commenter_b":"I tell these slouches to pull up there pants.","commenter_a":"Someone told me that came from prison and meant you want to get fucked in the ass ?","post_message":"Two thugs had the pleasure of living in a jail cell for a few days. This is great. Do you think all thugs with sagging pants should be arrested?"},{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"10153222292274877","commenter_b":"She is a woman. End of story.","commenter_a":"Ok this is the dumbest post I've seen by you guys. Trans woman? correct yourself its a trans man and will never be a woman.","post_message":"Body of 25-year-old trans woman found beaten to death in park. She was studying to be a cosmetologist. Get the full details of what happened below. Grio fam, let's keep the victim's family in our thoughts/prayers."},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"274137179658285","commenter_b":"@username paying for this useless wall? Yeah I know. It must be stopped!","commenter_a":"I wonder how many of these people are willing to take any of it illegals home, feed them, pay their medical bill and totally care for them?","post_message":"LIVE: Protesters gather at JFK Airport in New York in response to Trump's immigration order. A Yellow Springs resident is planning a local protest for Sunday: @webpagelink"},{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""}]
