[{"comment_id":"10153369191183984","commenter_b":"Yes it is.The best we can do is try to covert those that are a,ready here. I'm not sure how many would even listen.Its a job for the Holy Spirit. In the mean time we should stop immigration of Muslim population into the USA . When it reaches a certain percentage than there will be major problems. Satan is a master at deception and he came to kill steal and destroy.Jesus came to give life and give it more abundantly .","commenter_a":"OOOOH boy!! are we sitting by and letting this happen before it grows too late? Hell no!!!! Anyone interesting to get rid the prez, say aye!","post_message":"Wow, after watching this, I've got to wonder how this guy can say what he does and get away with it! Unbelievable! Do you think that radical Islam is the threat this woman claims?"},{"comment_id":"1049397791786635","commenter_b":"Oh yes let's hope it's true!!","commenter_a":"Danni Fiebig @username","post_message":"The Bachelor Australia may have just given it away (via Daily Mail Australia)"},{"comment_id":"10154408526388352","commenter_b":"Boobs are for food NOT fun!!!","commenter_a":"Well that was mean","post_message":"'Step outside and button up': Judge blasts mother and kicks her out of courtroom for breastfeeding her eight-month-old son during custody hearing"},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"10153976625678162","commenter_b":"Zionists let jews die that didn't obey the transfer agreement","commenter_a":"Just shows how much the Zionists have in common with the Nazis. They killed defenceless people and celebrated the murderers. The fact 35,000 Israelis have signed a petition to get the IDF member a medal is astonishing. @webpagelink","post_message":"As a video recording of an Israeli soldier killing a wounded Palestinian in Hebron on Thursday emerged hours after the shooting Israeli government officials and civil society representatives were split in their responses. Some quickly moved to condemn the shooting, while an outspoken group of Israeli leaders applauded the soldier and circulated a counter-theory of self-defense and heroism."},{"comment_id":"859046174191636","commenter_b":"she sucks like spike lee","commenter_a":"why is it important that she was a black female director? is it not good enough to be the Best Director?","post_message":"\"I do think it was a snub. But, I do believe she’s the first black female director whose film was nominated for an Oscar, so that’s already been history making.\" - Director Yoruba Richen on \"Selma\" and Ava DuVernay"}]
