[{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"10153373990610329","commenter_b":"So NO harm ?!? Dude how did this dumb bitch make it through medical school... 😂😂","commenter_a":"I know what I'd do!! Shotgun job!","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10153120259284411","commenter_b":"Ran like the bitches they are !!","commenter_a":"Marines don't flee. They were ordered home... there's a difference...","post_message":"Fleeing US marines handed over weapons to random Sanaa airport employees Yemen official"},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""}]
