[{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"1122225431128139","commenter_b":"@username, but I'm sure you was just fine with the Buch admin. Why is it Republicans always try to impeach every Dem president, I gurantee if Hillary wins they will spend her whole time as president trying to impeach her. Why don't they try doing something for the citizens of this country.","commenter_a":"As I read people's comments, I am again dismayed at the length to which the left will go to deny the FACTS.. the info came form a FOIA request. these arent conspiracy documents....they are FACTS... I know..the left loves to discount facts...they can be pesky......","post_message":""},{"comment_id":"515846775249931","commenter_b":"Does she know how ugly she is?","commenter_a":"Why would I care what a celebrity thinks or says.","post_message":"\"Oh, Donald Trump is whining about attention now?\""},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"},{"comment_id":"10152950499076130","commenter_b":"What a joke. Handcuffs is what she should be wearing","commenter_a":"SANDERS 2016","post_message":"Are you?"},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"}]
