[{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"550313591806506","commenter_b":"@username stop trying. Your Hillary will not succeed and if she does she will be taken to jail right after.","commenter_a":"NY press trying to destroy Sanders before the primary? Shocker.. Does anyone really trust any of the media outlets these days? I haven't for almost 10 years..","post_message":"This Bernie Sanders interview did not go as planned..."},{"comment_id":"10154446560569087","commenter_b":"....and you prefer a sexual deviant,foul mouthed fraud who could phucking care less about the working men and woman...this phucking billionaire builds multi million dollar condos and private country clubs that only the very rich could afford....so keep drinking the lumps poison koolaid and watch as America slides into hell...","commenter_a":"What the fuck did you and Obama show us in the last 8 years, other than treason, socialism, and the lack of and balls what so ever.","post_message":"Vice President Biden responds to Trump's tweets: \"Grow up, Donald, grow up. It's time to be an adult.\""},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"10152772572266051","commenter_b":"Awwww come on people . What the heck .people hunt all the time","commenter_a":"You can tell these activists and Hollywood people have never hunted whitetail?","post_message":"Some people are outraged over Matthew McConaughey’s hunting business. Decide for yourselves if there’s anything wrong with it."},{"comment_id":"10153934719761813","commenter_b":"@username Go run to your safe space. The ACLU would rather cast legal immigrants in with the illegal Alien filth than make a distinction between legal immigrants and these animals. It's not \"harsh\", it's calling this scum exactly what they are.","commenter_a":"Hey ACLU, these animals aren't \"undocumented immigrants\", don't lump this filth in with those that have legally immigrated here. They are Illegal Aliens, not legal permanent residences, naturalized citizens or here on visas. They broke the law and should be treated like the criminals they are; detained, processed and then deported back to their home countries along with their families. This garbage SHOULD live in fear, be harassed and made to feel uncomfortable. They should be detained, when local LEO interact with them, and then turned over to ICE/CBP for deportation.","post_message":"Since Election Day, the ACLU has seen a renewed sense of urgency from hundreds of thousands of Americans to protect civil liberties. One of our top priorities is ensuring that our communities don’t fall under siege in service of Trump’s quest to deport undocumented immigrants. To carry out his mass deportation scheme, Trump would have to cast his dragnet far deeper into American communities. Even if massive taxpayer dollars could be diverted to do so as a practical matter, the effort will erode the civil liberties of all. Millions of people who live and work along our nation's borders—from New York to Arizona, Washington State to Texas—are already living in increasingly militarized areas where they are stopped, harassed and treated in ways the U.S. Constitution does not permit. Read more about the work already in progress to ensure people’s rights are protected in border communities @webpagelink"},{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."}]
