[{"comment_id":"725221097581400","commenter_b":"This Latino American Women thinks its terrible that people here illegally are breaking laws & think its ok no its not..","commenter_a":"The petty haters whining about tax dollars need to just have a seat. And take a long, hard look at themselves. A) she's a CHILD B) she's going to go further in life than any of you small-minded simpletons because of her drive and determination, and her GPA and scholarships were a direct result of that. She didn't show up on free Yale day. She is smart, worked her butt off, and is on track for the kind of success she deserves.","post_message":"Larissa Martinez held a 4.95 GPA and took 17 AP classes over her McKinney Boyd High School career. She's also an undocumented immigrant who arrived in the U.S. in 2010 -- but only 10 of her classmates knew that before last week. After her speech, they gave her a standing ovation."},{"comment_id":"10153338869724411","commenter_b":"hey asylum seekers, if you don't like it in italy, then don't go to italy!","commenter_a":"Modern slavery and the should be thankful for that. Hate this shit!","post_message":""},{"comment_id":"10154383392767894","commenter_b":"These two witches are beholding to special interests!!! Drain the swamp!!!!","commenter_a":"did not help ...","post_message":"These two Republican senators voted against Betsy DeVos."},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."},{"comment_id":"10153797525542183","commenter_b":"@username No it was the racist Obama that started this long before Trump was running for president. He wants to incite the Blacks to get them out and vote Democrat so he had to get the media to claim Blacks were being killed by cops. The only thing he left out was they were Black criminals attacking cops that were being killed.","commenter_a":"Obama is the poster boy for the \"Black Lives Matter\" racists. Obama started this along with his media puppets to get Blacks to vote Democrat. The Democrats do not care how many cops or law abiding Blacks have to die to get and keep their power.","post_message":"Don't expect a word of this to sink in with those suffering from ODS."},{"comment_id":"885506288175787","commenter_b":"Thnx god u not woman,imagine poor woman life with such big ugly nose","commenter_a":"if i was that woman i would never talk to that stupid arabian pig -_- what kind of thinking and beliefs let these ppl tobe in social with this kind of talking and beliefs it doesnt worth even a simple like","post_message":"Apparently in countries like America sexual crimes 'are no big deal' to women."}]
