[{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."},{"comment_id":"1172261136143561","commenter_b":"iPhone 7 will murder Note 7, with its 720p display and 2000 mAh battery. *Slow claps*","commenter_a":"Verge commenters won't like to admit verge is now defending samsuck. Looks like Samsung paid Verge, the iPhone 7 will murder this on benchmarks AS IT ALWAYS DOES","post_message":"Seriously, everybody chill."},{"comment_id":"1001125933342993","commenter_b":"Poor little Ivanka, I wonder what her price tag was? High class whore!","commenter_a":"Michelle had bare arms and got criticized by Republitards. Meanwhile, Melania posed nude and Republitards were silent. It's that self-serving double standard once again!","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."},{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"}]
