[{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10154412077781323","commenter_b":"Italy isn't doing anything, yeah neither is Nigeria, or the Nigerian women that are the madams of these places.","commenter_a":"Italy allowing this to happen in plain sight. It's blatant and brazen and on the roads in broad daylight. The country should be in uproar, but no one does anything about it, not the government, not the vatican.....shameful.","post_message":"Thousands of women and girls are being trafficked to Italy from Nigeria, into a life of forced prostitution. Abused and desperately vulnerable, they have a champion in Princess Okokon, who was herself trafficked from Nigeria in 1999. Okokon fled her captors, and, with her husband, set up the NGO Piam Onlus Asti. Together they have helped hundreds of women in Asti and Sicily to escape their traffickers, giving them refuge and support."},{"comment_id":"512513402270286","commenter_b":"take her ass outside and hang her","commenter_a":"Everything became a talking point of deflecting responsibility to her experts.","post_message":"Rep. Jim Jordan questioned Hillary Clinton about Benghazi attack: “You tell Americans one thing, but your family an entirely different story” WATCH and SPREAD!"},{"comment_id":"834219746615367","commenter_b":"It's hard in that situation it would be nice if it worked just that easily but pregnancy is a risk and you or I can't force a women to carry a baby.","commenter_a":"Woman's Rights? What about the fathers rights? I had a fiancee who had an abortion about 25 yrs ago. I didn't even know she was pregnant until after the abortion. She had her friend call and tell me. Then wanted me to pay half of the cost. I as the father I should have had a right in the say so for abortion.","post_message":"Five reasons why Matt Walsh says he is pro-life without exception:"},{"comment_id":"1276342415734510","commenter_b":"Well they didn't because Peter Falk hadn't even been born yet.","commenter_a":"I VOTE FOR THE AMERICAN INDIANS.TELL ME WHY DID THE EUROPEANS KILL THE NATIVES ,IF THEY WERE BARBARIC THEY WOULD HAVE KILLED COLUMBO AND BURNED HIS SHIPS.","post_message":""},{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."},{"comment_id":"10153129046736051","commenter_b":"The border is broken and Obama wants everyone to come on in. Breakdown between law enforcement agencies. I agree with Trump. Build a damn wall. I live in a border city. Luckily we don't have a big problem but now we have to worry about middle eastern people.","commenter_a":"That's a Dad who will have nightmares the rest of his life! May God be with him. What a beautiful young woman! What the hell is wrong with our country?","post_message":"This woman's dad had his arm around her when they heard the pop. As she collapsed on the ground, he could hear her repeat the same thing over and over again: \"Dad, help me, help me.\""}]
