[{"comment_id":"742199012637343","commenter_b":"No sharia law here. Go back where you came from.","commenter_a":"What many have said thy plan to take over the country. CAIR","post_message":"Muslims Trying To Enforce Sharia Law In America Just Got Some Very Bad News [VIDEO] If you are going to live in America, you will have to abide by our laws. Do you think Sharia Law has no place in America?"},{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"1099878783413317","commenter_b":"Thank-YOU!!!!!","commenter_a":"Damn good question! Ask obama!!","post_message":"America's Freedom Fighters"},{"comment_id":"947304708651886","commenter_b":"I agree ,however the woman has he ultimate protection! POLITICAL PRIVILEGE!!","commenter_a":"then WHY isn't he requesting it/","post_message":"The pressure is growing..."},{"comment_id":"1582705788695822","commenter_b":"Hillary Will be President!!","commenter_a":"Liar. Killer. Cold hearted, some one please drop a house on her","post_message":"Thank you, California!"},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"1126946630726765","commenter_b":"@username accepted money/bribe from the Clinton Campaign/Foundation. Recent documents released from wikileaks show! He is part of the problem and is an enemy of Americans at this point!","commenter_a":"clinton-foundation-invoiceAs you can see, the page from the Accounts Payable Invoice lists 14 names to whom the Clinton Foundation had paid considerable sums of money for suppression: $89,000 to A.C.O.R.N. $42,300 to William (Bill) Ayers: unrepentant former Weather Underground domestic terrorist; early supporter of and like ghostwriter for Barack Obama. $109,000 to @username, the radio show host who was an avid supporter of Ted Cruz during the GOP primaries, and continues to be a diehard opponent of Donald Trump. (See suspended by SiriusXM radio for hinting at Trump assassination) $203,000 to Black Lives Matter. $333,400 to the Black Panthers. $10,000 to Bill Kristol, founder and editor of the conservative magazine The Weekly Standard and, like Beck, is dead set against Trump. (See Kristol declares there will be a 3rd-party candidate against Trump) $80,600 to Monmouth University, presumably the university Polling Institute that conducts political and election public opinion polls. $12,000 ...","post_message":"Must watch."}]
