[{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"10154534078174445","commenter_b":"I know. Is that close to where you live? It's scary","commenter_a":"Sharon Leahy-Lind Elizabeth Lind","post_message":"Imagine you're enjoying a day in the woods, walking down a trail when you see THIS: a large snakeskin. @webpagelink"},{"comment_id":"1788323888048645","commenter_b":"SouthernBox Blues But why are the prisons full? Getting rid of the illegal aliens from them would help. If the little jackasses need to be locked up, do it. Just like Sheriff Joe, put them in a tent.","commenter_a":"Its time for Chicago to clean house . From the dirty politicians all the way down to these street thugs .","post_message":"WATCH: 71-year-old man shot while watering lawn; new Chicago shooting sparks outrage: @webpagelink"},{"comment_id":"850932761669644","commenter_b":"Send her over better yet send her kids not mine","commenter_a":"I hate to break this to some people but the only Americans that are there any legitimate threat from Isis are the Americans were going to be sending over there..... Somehow Obama has managed to kill over 10,000 Isis fighters by dropping bombs without one single American military casualty..... Why change the game plan now?","post_message":"Do you agree with Rep. Barbara Lee?"},{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."}]
