[{"comment_id":"1798977096981448","commenter_b":"What stupid woman do you think orange head is going to grab your thing and you're so happy","commenter_a":"No I believe Clinton was way worse then Tump with rape and the White House incident-- really!","post_message":"SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"},{"comment_id":"1419671894761590","commenter_b":"Serves the liberal illegal lovers right.","commenter_a":"Moron","post_message":"Liberal Governor Just Caught Stealing $115 Million, Who He Gave It To That Will Piss You Off!"},{"comment_id":"10154553975279753","commenter_b":"Aaliyah Johnson","commenter_a":"Gina Anna","post_message":"uh this is amazing Foxes & Friends"}]
