[{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"},{"comment_id":"10157544751020354","commenter_b":"wasn't lady gaga also a crack fiend before she made shitty music and supported domestic terrorists?","commenter_a":"No one gives a shit what the fucking rich liberal is said.","post_message":"Here are Lady Gaga's tweets supporting the BLM radicals..."},{"comment_id":"10153831819518598","commenter_b":"Glad she doesn't love me","commenter_a":"Love is always a good reason to murder someone isn't it.","post_message":"Woman Writes: “I Had an Abortion Because I Love My Son”"},{"comment_id":"1267284936616307","commenter_b":"Figures that the media would just cover his Donald Trump comments but not on climate change comments.","commenter_a":"And igloos.","post_message":"Stephen Hawking issued a dire warning, but it wasn't about Trump."},{"comment_id":"10152564778122623","commenter_b":"What I don't understand is why would anyone want to follow her? Congratulations you got video of her stopping and starting over and over, all the while you are driving in wet conditions with one hand, with a child in the car??? Plus this crazy lady could have gotten out WITH a gun and killed the woman driving and the child. People need to just let road raged people go. Just pull off to another road or whatever, get a tag number and call 911. Leave it to the authorities. She should be thankful for her life.","commenter_a":"I'm glad the nut case was turned in and charged.","post_message":"It's the video everyone is talking about. The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"}]
