[{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""},{"comment_id":"1368414533215688","commenter_b":"GOD bless them! I HATE cigarettes and the trillions of the non-biodegradable butts that filthy our planet and its waterways.","commenter_a":"Fine them sons of bitches. Why should they be above the law.","post_message":"Thoughts?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"10153272244859071","commenter_b":"Women RUN the World.... All Hail the Queen....","commenter_a":"Ana Clara Mello","post_message":"Kurdish fighters have said ISIS is \"afraid of girls.\""},{"comment_id":"635163520007560","commenter_b":"If she is illegal,DEPORT her and all 11 of her illegal children!!!","commenter_a":"why should she,she get everything free here and we are paying for it and our military men and women get nothing","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"}]
