[{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"889040704452119","commenter_b":"I'm outdone. The babies can't even sell Girl Scout Cookies in peace!","commenter_a":"Smh. .","post_message":"“What Did I Do Wrong?” 9-Year-Old Girl Shot While Selling Girl Scout Cookies With Sisters"},{"comment_id":"1137553239588633","commenter_b":"I will not vote for Hi$$ary under any circumstances in November. It will not come to that because Bernie will win as he has the people behind him. They have done everything to suppress Bernie but they will fail. If she steals the nomination with the help of the corrupt DNC and the corporate media then please do as I and many other liberal progressives and take the Bernie or bust pledge. It is way past voting for the lesser of two evils. I refuse to be bullied into supporting her when I know that she is basically a GOP lite and if she is nominated we will lose. I will not help her and my vote is not for sale. So if it ever comes to that, I will cast my vote proudly in November for the only candidate that supports me - Bernie Sanders . I will do ...","commenter_a":"I'm not voting for Bernie as much as I like him only because I'm afraid it will be wasted. He's great but I don't believe he'll be elected. I'm going to lose it if Trump gets in","post_message":""}]
