[{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"10152924363976130","commenter_b":"I picture the admin of this page, a fat whiney crazy feminist that hates life because the wine ran out, and because a man opened a door for her.","commenter_a":"How many women believe everything that men tell them?","post_message":"\"Generally speaking, we (men) do not believe things when they're told to us by women.\""},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."},{"comment_id":"10153526082496323","commenter_b":"NASA erased 'accidently' the high resolution tapes from the 1st moon landing in the 80's .lol .","commenter_a":"They never went to the moon though","post_message":"Even astronaut Buzz Aldrin had to file travel expenses – for a less than astronomical $33.31."},{"comment_id":"10155691016515354","commenter_b":"She actually spoke about how she respected the woman who hated blacks and called basically for their removal!! Ya right, she supports her own money making agenda, let's go conservatives and keep this creepy crook out of \"OUR HOUSE\"!!","commenter_a":"Now the Democrat liberals are trying to get criminal minds to help enforce their power! Criminals joining criminals. Wake up folks !! Crooks for crooks!","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.” If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"}]
