[{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"1002116393141873","commenter_b":"I wonder if Muslim women can cover their faces at protests with the new anti-mask protest law?","commenter_a":"Does this mean people can wear the banned Anonymous mask to the citizenship oath ceremony?","post_message":"Developing"},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""},{"comment_id":"1281317941894705","commenter_b":"she is crazy in the head","commenter_a":"No","post_message":"So apparently everyone that doesn't support Hillary Clinton is just being juvenile, according to Streisand."},{"comment_id":"1840557005997054","commenter_b":"Out her in jail!!!","commenter_a":"Insanity needs to be STOPPED now. Gets some 'TEETH' into prosecuting ALL threats.","post_message":"Yet another one..."},{"comment_id":"10153020222586051","commenter_b":"No apology for this little lady. She is too ignorant to understand who made sacrifices for her to have the privilege of saying the Pledge! Maybe she should return from whence her ancestors came from a place where I'm sure the reason they left was because they didn't have the freedoms they came to the U.S.A. to enjoy!!","commenter_a":"After all we all should be praying.","post_message":"The teacher told this girl that she had to stand up for the Pledge of Allegiance. The girl's response: No."}]
