[{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""},{"comment_id":"1370922502927793","commenter_b":"If she could somehow flood NYC with illegal aliens then yes, she could be the next mayor.","commenter_a":"Gitmo for Life for High Treason and we aren't talking emails","post_message":"After winning New York with 1.7 million more votes than Trump, could Hillary's next move be mayor of the Big Apple?"},{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."},{"comment_id":"10154909768331509","commenter_b":"The World knows Obama and Hillary have failed us.","commenter_a":"Trump might use be them, but Hillary will email them to someone..","post_message":"The U.S. president has the power to order a nuclear strike anywhere in the world at any moment -- so choose your next leader carefully, America. (via CNN Opinion)"},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."}]
