[{"comment_id":"1235978386476227","commenter_b":"someone please give that nasty fat cunt a coupon to jenny criag.","commenter_a":"Get over yourself!! U need to go to the gym","post_message":"Entitled woman claims cashier give her a free drink because her grandmother was a slave. 'LIKE' if this is WRONG!!!!"},{"comment_id":"10156229104235354","commenter_b":"Kim more is nothing but a troll. But she needs to shut up and mind her on business. Dumb Limey.","commenter_a":"Piers shut up and stay in England, count all the people been kill in your own country....................................................","post_message":"See his 5 tweets."},{"comment_id":"10153490224540950","commenter_b":"Trump","commenter_a":"Who Cares Vote Trump","post_message":"Ted Cruz's wife was caught in the crossfire this week between her husband and Donald J. Trump. But she said she's \"not worried\" about Trump spilling the beans about her past. Take a peek:"},{"comment_id":"10153561312261748","commenter_b":"I'm come to the conclusion that we can safely assume the complete opposite of anything said by a conservative.....","commenter_a":"It's little wonder the whole world thinks the USA has gone bat shit crazy!","post_message":"Ted Cruz says people don't like Duck Dynasty's Phil Robertson because he \"speaks with joy,\" floats him as UN Ambassador"},{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"783835985050207","commenter_b":"Ginny don't forget under obummer gas was over $5 a gallon. Our healthcare got destroyed. Illegals flooded our country sanctuary cities like where Kate from the unpassed Kate's law was MURDERED by a loser criminal ILLEGAL career criminal thug. I could go on but I've found that the foolish people out there that haven't woken up yet never will.","commenter_a":"I love how about Obama and Hillary want to save the world but not America","post_message":"Obama plans on bringing in 10,000 Syrian refugees, but Hillary Clinton wants to increase that to 65,000. What do you think?"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"}]
