[{"comment_id":"1070629882958022","commenter_b":"Look mr. TopHeavy, when you get pregnant let me know lol. I know many women who smoked while pregnant and had/have extremely healthy babies and children.","commenter_a":"Btw.. I'll call bullshit on this","post_message":"Here's what smoking does to your unborn baby."},{"comment_id":"10153517390897293","commenter_b":"TRUMP KNOWS HOW TO NEGOTIATE! Politicians see how you get things done! Everyone is talking about Trump, and he doesn't have to pay a penny! Awesome! This is a Revolution for Trump like I have never seen in my 63 years! Go Trump! The man with COMMON SENSE! Obama was bought by the Communist Billionaire George Soros. Soros' main objective is to destroy America. Soros is now buying Hillary. NEWS MEDIA IS BRAINWASHING AMERICA TO HATE TRUMP! The people who have ruled America behind the backs of Politicians they have paid to win will lose a lot of MONEY if Trump gets elected. Who are these people, well some of them OWN NEWS MEDIA STATIONS! How many World Leaders have been paying Politicians to run so they could have a payback when the Politician got into power? Notice how much money America sends to other Countries? Think about it, WHO ...","commenter_a":"Waaaaah.","post_message":"He's out of Thursday's debate."},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"1710841849170298","commenter_b":"We cant have a woman as president we need Bernie or a republican","commenter_a":"Hillary is the devil.","post_message":"We did it, New York. Together, there's nothing we can't do. Watch Hillary live from NYC—and if you've got her back, chip in here: hrc.io/1VhzzV3"},{"comment_id":"10152703267277217","commenter_b":"64% of voters didn't vote for the Conservatives in 2010, so not that popular.","commenter_a":"Best PM ever. Don't even know why the others have bothered...","post_message":"What do you make of David Cameron's cufflinks? Follow our UK election coverage: @webpagelink #GE2015"},{"comment_id":"838829739577213","commenter_b":"Yes! They should be arrested!","commenter_a":"As long as it includes under God!","post_message":"This is disgusting. Do you support the Pledge of Allegiance?"},{"comment_id":"10153924277776130","commenter_b":"These girls are still relevant? Lol","commenter_a":"Can't get crack online","post_message":"Um ... what!?"}]
