[{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"10154466524309203","commenter_b":"She's disgusting","commenter_a":"Enough of the hate and racism. Every time they open their mouths, garbage comes out.","post_message":"CNN political commentator Hughes: \"hoping I not going to have to [brush up on] my #DoratheExplorer to understand some of the speeches given this week. #DNC #TimKaine"},{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"10153982345631162","commenter_b":"Lol at the lady that thinks Chicago is Houston!","commenter_a":"Well the store has a history of getting robbed at gun point. Also note, armed robbers have been killed in the past trying to rob this store. Its best not to try to stick this place up anymore. Matter of fact, why not obey the law and not stick up any stores.","post_message":"EMPLOYEE SHOOTS SUSPECTS: Two men were killed after police say they attempted to rob a liquor store when an employee opened fire at them - Diane Pathieu ABC7 is live with more: @webpagelink"},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"}]
