[{"comment_id":"875381432484713","commenter_b":"I dont know about you ladies but I sure dont want to see no 35 year old pop star.","commenter_a":"Kenya once again showed what a messy, ugly, and miserable woman she is. Claudia is Kenya's equally despicable sidekick. Demetria needs to grow a brain of her own. NENE LEAKES showed she is the Queen of RHOA. And Cynthia continues to talk tough, but if someone says boo to her, she will break down in tears when all is said and done. Phaedra was dead wrong for asking Demetria is she had done crack, but Demetria had one of the night's best comebacks with the 'all we have in common is the number 8'!","post_message":"“Your Clit Has Left Your Body!\" Phaedra's Shade, NeNe's Wrath and Claudia's Toes Are Unleashed #RHOA Ep. 10 @webpagelink"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"10153033840709071","commenter_b":"It's screwed up that you assume (be it probaly acurate) that we have not heard of Eritrea.. Why dont people know grography? It's alarming.","commenter_a":"People are leaving in droves so things are obviously not great, however western media outlets have always been incredibly harsh with regards to Eritrea. The ongoing refugee crisis is incredibly sad though. @username, thoughts?","post_message":"The worst regime you've never heard of."},{"comment_id":"10156311109050354","commenter_b":"FUCK THEM.","commenter_a":"Another attack on the First Admenent","post_message":"\"You’re taking my rights. You’re taking what I am. My roots run Southern.”"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"}]
