[{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"},{"comment_id":"953216211400448","commenter_b":"Ron, don't forget about the white folks whom have EBT cards and are on welfare.","commenter_a":"So why are we not receiving reparations like the Jews Obama.U jst gave them 12 million for something that didn't happen here!","post_message":"President Obama defends the Black Lives Matter movement, saying the concerns of the activists who have marched & protested for change are legitimate. Obama reiterates that while all lives do matter, black communities are under a specific & unique scourge that needs to be addressed. He also goes on to say that using the phrase “Black Lives Matter\" does not mean that other lives do not. DETAILS ----> @webpagelink"},{"comment_id":"10158365855655500","commenter_b":"RIP Carrie Fisher.","commenter_a":"Who cares don't watch, pops that's four words.","post_message":"Fashion, Beats and Bling are WFLA Lila Gross picks. What are your three words to describe the Oscars?"},{"comment_id":"10153051540886028","commenter_b":"The employee probably had no idea what the Isis flag looked like. Uneducated people who have no idea about current events would have no idea. With the whole Confederate \"battle\" flag all employees probably got a notice with its picture on it saying why Walmart wants nothing to do with it. Common sense people. Also total set up to prove a point that we choose at the moment what we're going to have a hissy fit about and how worse things could totally go under the radar because of the uneducated and ignorant people out there. I guarantee you most people couldn't recognize 3 out of any of the 50 state flags and I'm being generous with that! Sad truly sad!","commenter_a":"Freedom of speech and the 1st Amendment take precedence here....any and all cakes should be baked without political correctness.....","post_message":"\"Hi, Walmart, you've got some explaining to do.\" One man is calling out Walmart for refusing to make him a cake decorated with the Confederate flag along with the caption, \"Heritage not hate,\" only to say yes to making an ISIS flag cake. \"I’ve got proof. Went back yesterday and managed to get an ISIS battle flag printed. ISIS happens to be somebody we’re fighting against right now who are killing our men and boys overseas and are beheading Christians.\" Now, the chain is apologizing and says the ISIS cake \"should not have been made.\" @webpagelink"},{"comment_id":"1162663783801971","commenter_b":"I stopped reading at \" good man \" Trump is far far removed from being a good man..","commenter_a":"Trump, regardless of what people who don't even know you say, I believe you're a good man & have good intentions for this country. Don't get sucked into what the government or anyone else wants you to do. You've called on Jesus to be your Lord & Savior & I'm proud of you for that because I know that the moment I did, He changed my life forever. Seek Him & all He is & He will give you all of your hearts desires. He's God, all His riches & glory will never compare to money, just stay focused on the Lord & you've got this! Trust me. He loves you.","post_message":"The spirit is amazing --- thank you to this homeowner in Florida for their support."},{"comment_id":"1077881772268351","commenter_b":"She's lying her lips are moving...","commenter_a":"Get $60 worth of free medical marijuana at eazeup.com with promo code: icfnwx","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."}]
