[{"comment_id":"1266833826777136","commenter_b":"I think this is the only remaining British cultural heritage??it should be nurtured and taken good care of.","commenter_a":"It's ceremonial !","post_message":"The campaign's gaining thousands of supporters"},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy. READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10154004463969060","commenter_b":"We did, we along with many other countries liberated Europe…you're welcome. But in all serious we have and we continue to do, but we know when we're being played! But you're so busy with statistics, you failed to look over the problem! You need to understand the difference between migrants and refugees! The human catastrophe you're talking about is in Syria, they're refugees (although most are single males - who should be heading in the other direction to fight for there freedom and their families) The majority are economic migrants (for outside the EU), exploiting the current situation - and Germany.","commenter_a":"She does what she thinks it's good for Germany and EU, and not what she thinks would give her more votes!!!!!!! That's the difference!!!!!!!","post_message":"“I don’t have a Plan B,” she said with fighting passion. It is “my damned duty” to find a common path for the EU"},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"10153459278655667","commenter_b":"Instead of talking about it, how about you guys do something about it? No amount of talk will stop someone from raping another.","commenter_a":"This is an incredibly important topic at the University of Pittsburgh. My fellow Pitt classmates are trying to continue the conversation and created this video about the objectification of women on our campus. If you feel strongly about the right to consent and say no, and want to support college students trying to make a difference check this video out: @webpagelink","post_message":"Vice President Joe Biden delivers an incredibly powerful and passionate speech on survivors of domestic abuse and rape at the University of Pittsburgh."},{"comment_id":"254814161629338","commenter_b":"She is a big mouth stupid bitch . They all are","commenter_a":"Can't watch this show anymore...it's all about political bashing.","post_message":"The View host Joy Behar just launched an attack on Barron Trump. This is terrible. She should be absolutely ashamed. Can we get 10,000 'LIKES' to have The View cancelled!"},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."}]
