[{"comment_id":"10153126452213854","commenter_b":"Yep, idiots. Gays will lose more than their heads from muslims.","commenter_a":"Good luck with that","post_message":""},{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."},{"comment_id":"1179451428768183","commenter_b":"Blacks on a welfare leash! also remember the KKK WAS STARTED BY THE DEMOCRATS. the first RUNAWAY Slave tracked down by a Democrat Government and the first legal slave was owned by another BLACK MAN ,, SO WHO YOU VOTING FOR ??","commenter_a":"Bastard, who opened the vault holding our Social Security.","post_message":"Here's the HARD TRUTH about what the Democrat party has REALLY done to the Black community,."},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"10153892633433812","commenter_b":"STFU","commenter_a":"Sex is meant for procreation. If you don't want kids the only sure way is to not have sex. Birth control, even when packaged correctly is not 100% I have had multiple friends become pregnant while properly using birth control. Stupidest reason to sue ever.","post_message":"More than 100 women are suing Qualitest Pharmaceuticals after they say they got pregnant while taking incorrectly packaged birth control pills."},{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."}]
