[{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"1000962836629860","commenter_b":"Then they need to take ownership of the word terrorists.That is what republicans in congress are. They need accept responsibility for the violence in this country.","commenter_a":"Morons","post_message":"While they sell fear to the American people to get reelected, they sell themselves to the gun lobby."},{"comment_id":"882717625081928","commenter_b":"Keep negotiating with Muslim terrorist and they will only become more determined. The world needs to unite and eradicate this cancer.","commenter_a":"Life for a life,Peace talks Needed.","post_message":"Japan has vowed to work with Jordan to secure the release of a Japanese journalist held by Islamic State militants in a crisis that has become a test for Prime Minister Shinzo Abe. Read more: @webpagelink"},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"},{"comment_id":"10154193452504087","commenter_b":"2 choices: 1. Hillary(blue pill) 2. Trump(red pill)","commenter_a":"Donald Trump killed his own chances to win the presidency. He should shut his mouth. Keep his zipper closed. Closed his Twitter account. Prepare for the debates. Finally, listen to the advice of your children and staff.","post_message":"Trump interrupted Clinton during the debate to call her a \"nasty woman\" as she was reiterating her commitment to raise taxes on the wealthy."},{"comment_id":"10154565207543812","commenter_b":"A gun can not cause violence. It's harmless. I have several. They have never shot anyone. They have never caused violence against me or anyone. Get it??","commenter_a":"He lost his brother, son and partner to VIOLENCE by someone using a gun. Could have been a knife, a baseball bat or even a suicide vest. Lay any of these items on a table and they do nothing. Let me know what I'm missing here","post_message":"#Dallas Police Chief David Brown Sr., a 30-year veteran and Dallas native, lost his former police partner, his younger brother and his own son to gun violence."}]
