[{"comment_id":"10153866620387869","commenter_b":"Leave, sissy boy.","commenter_a":"I like @username but I get the impression this is just a propaganda page. Guess I'm out of here.","post_message":""},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"10154362709291438","commenter_b":"@username Put down the bong.","commenter_a":"BLM=Obama/ISIS cop killers.","post_message":"The head of the local union doesn't think NFL players have a right to free speech."},{"comment_id":"547324122108733","commenter_b":"Hearing her, and the rest of these contemporary crashing bores, causes me macroaggressions","commenter_a":"This nation no longer understands the cause of anything. We have managed to create a group of retards who are only concerned with their own personal agenda, while at the same time, they have abandoned common sense and common decency...","post_message":"\"One day, these privileged snowflakes armed with their microaggressions will be in charge of HR departments all across the fruited plain,\" says Todd Starnes."},{"comment_id":"909912449057779","commenter_b":"She is a CRIMINAL LIAR !!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Poor, really, couldn't they spell abysmal?","post_message":"Well if the shoe fits..."},{"comment_id":"1801737773446077","commenter_b":"Hell no stupid BITCH","commenter_a":"That's what this country is all about- Idiots supporting idiots!","post_message":"President Obama called Hillary Clinton the most qualified presidential candidate ever. Do you agree?"},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""}]
