[{"comment_id":"870966692926187","commenter_b":"GIRL BYE","commenter_a":"I don't blame her for not wanting to call him. She hasn't spoken to him for a reason. Probably the same reason why Lisa Bonet and God knows how many other members from the cast have not! She should not have been fired for that.","post_message":"Keisha Knight Pulliam Fired From Celebrity Apprentice For Not Contacting Bill Cosby For Fundraiser @webpagelink"},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"579001232257569","commenter_b":"THIS HAS ALWAYS BEEN A PROBLEM FOR A LONG TIME ITS CALLED THUGS AND OUTLAWS IN CHICAGO.THIS STARTS AT HOME WHEN THESE THUGS DO NOT HAVE A FATHER TO SHOW THEM THE WAY.THINGS WILL NEVER CHANGE IN CHICAGO WHEN YOU HAVE WOMEN THROWING THERE LEGS UP TO ANY MAN WALKS BY FOR MONEY.IT WILL NEVER CHANGE. THEN THE MEN WALKS OFF AND FINDS ANOTHER ONE TO KNOCK UP.THE WORLD KNOWS ABOUT THESE PEOPLE.ITS LIFE IN CHICAGO.","commenter_a":"What a joke","post_message":"BLACK LIVES HYPOCRITES! Gun-Controlled Chicago: 21 Shot, 1 Stabbed, 1 Dead In 24 Hours Amazing they can unite and riot for TRUMP but can't for the constant murders and shootings plaguing THEIR community! IF you are pissed off LIKE AND SHARE THIS!"},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"10155187133853029","commenter_b":"Your literally the only one what finds this funny","commenter_a":"@username listen to the end","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""}]
