[{"comment_id":"10153222292274877","commenter_b":"She is a woman. End of story.","commenter_a":"Ok this is the dumbest post I've seen by you guys. Trans woman? correct yourself its a trans man and will never be a woman.","post_message":"Body of 25-year-old trans woman found beaten to death in park. She was studying to be a cosmetologist. Get the full details of what happened below. Grio fam, let's keep the victim's family in our thoughts/prayers."},{"comment_id":"10153823295824411","commenter_b":"You needed to be pulled over Obama.","commenter_a":"He got racially profiled into being elected president.","post_message":" as a report that came out just this week reminded us, there are a lot of African-Americans, not just me, who have that same kind of story of being pulled over or frisked or something, and the data shows that this is not an aberration."},{"comment_id":"952585388112135","commenter_b":"That is true @username however they will find no virgins on the other side.","commenter_a":"only way to deal with those ISIS thugs.","post_message":"“A tall bearded man emerged and drew a long knife...He began addressing the crowd and slapping the father and his son around the head and kicking them onto the floor.” That's when three shots rang out."},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"1181685188533567","commenter_b":"This picture is missing a muzzle for that big mouth!","commenter_a":"Her eye bags and pouchy cheeks disappear somewhat when her mouth is open like this. But then you see her overbite and buck teeth.","post_message":"It's happening!"},{"comment_id":"1125723030801501","commenter_b":"Lord, she's a vile woman.","commenter_a":"Does anyone have the balls to fire this woman for not doing her job. FIRE HER!!!!!","post_message":"Seems Kim Davis may be going back to jail..."},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"}]
