[{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"1814664762098886","commenter_b":"But you sure don't mind taking white people's money do you Colin?","commenter_a":"Then have him sit on the locker room bench and not the field","post_message":"NFL player Colin Kaepernick isn't apologizing for his controversial decision to not stand during the national anthem."},{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"10153292336206680","commenter_b":"Given he is so concered about conditions in Eurpose how about opening the borders to more refugees in desperate need . Sharing the burden rather than slamming to door to hope shut.","commenter_a":"I've been to Brussels. I was essentially homeless there for one night as I passed through -- I camped at a vacant fairground. Not a single Muslim tried to commit a violent act against me. The real world isn't nearly as scary as Trump seems to think it is.","post_message":"POLITICO Europe Donald Trump defended his proposed Muslim ban."},{"comment_id":"10153123341393433","commenter_b":"If the GOP and Faux news had been fighting the ACA every step of the way it would have probably met expectations. I have a neighbor that continually puts Obamacare down but when questioned on specifics she doesn't know anything about it.","commenter_a":"Survivor - Republican Nomination Edition! See the candidates squirm at questions about evolution! See them deny climate change! See them lambast Obama and try desperately not to even mildly criticize each other! See them try to criticize Jeb Bush while lusting after his millions! See them scurry and grovel for billionaire dollars! See them coordinate-not-coordinate with their PAC's! Watch as they kiss the ring of Sheldon and the behinds of the Koch's! See them on their knees begging and groveling for your vote! See them slap each other silly in the final rounds! See them bow out, tails between their legs, defiantly trying to sound manly and tough! See them in the green room, crying and sobbing and wailing... Oh wait, that's when they're on stage. See them try and start a war with Iran! See them argue about who gives Bibi the best blowjob! See them trying to be ...","post_message":"Did the health care law kill jobs? Does everyone have access to coverage? Monday marks the fifth anniversary of Obamacare, so here's a look at the predictions that were right and that ones that missed their mark. bit.ly/1HbvOsO"},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\" Do you think Trump is insecure?"}]
