[{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"},{"comment_id":"1044585922265355","commenter_b":"Poor little Marco.","commenter_a":"Senator Rubio, please stop getting in the gutter. Your recent comments make you sound like like you are 5 years old. You are better than that and I am so very disappointed.","post_message":"\"And you know what they say about guys with small hands...\" Marco Rubio said of Donald J. Trump."},{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"486656498389047","commenter_b":"Fuck the fist wtf she got on the left beside the fist!!!? DAMN","commenter_a":"Asking for head. You know all those been about 12\" deep","post_message":"What you doing fellas?????? #WSHH"},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"}]
