[{"comment_id":"10156566417190354","commenter_b":"Lets oblige her in a dumpster; place for Islam garbage.","commenter_a":"Did you know bullets and explosives have pig by products in them ?","post_message":"Her full statement is unbelievable..."},{"comment_id":"10153864923562490","commenter_b":"Women do not belong on boats or in combat this is just common sense and has everything to do with sex...","commenter_a":"Being a navy veteran, I don't agree with this. They already had a court martial case where enlisted male sailors were tried for taking pictures of female officer submariners showering....","post_message":"First enlisted women report for duty to sub force in early 2016."},{"comment_id":"587779548050076","commenter_b":"NO NO NO NO NO !!! AND HELL NO! Keep them out and send all illegals back!!!!!","commenter_a":"Hell no","post_message":"I'm thinking ... uh ... duh. But then again, we have the SFB Liberals who see 'no wrong' in Sharia. Vote in our CLASH Poll and let the US know how u feel. @webpagelink"},{"comment_id":"497839773741528","commenter_b":"SO TIRED OF THE MUSLIM'S THINKING THEY CAN TELL US HOW TO LIVE IN OUR COUNTRY,,,,,,,THIS IS AMERICA NOT THE MIDDLE EAST......LEAVE AND TAKE YOUR MUSLIM BROTHER OBAMA WITH YOU...........","commenter_a":"@webpagelink I am a proud American, but this is a false story that is meant to instill false patriotism, and sadly by these comments it has worked.","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 35,000 'LIKES' for this patriot?"},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"1294762407204042","commenter_b":"She should be arrested!! She a used this horse and disrespected the law","commenter_a":"Arrest her, let her do her time cleaning out stables of horse droppings .. It's equal to mentality !","post_message":"\"She seems nice\""},{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."}]
