[{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"596495133817002","commenter_b":"Please put this bitch in, just for the sake of good comedy.","commenter_a":"And Dems here's 8 more years. Repubs are screwed if we put these people up.","post_message":"This is easily the most hated person by liberals. They will begin freaking out in 3... 2... 1..."},{"comment_id":"10153774603359714","commenter_b":"She needs to resign then!","commenter_a":"Right Fire her..she has a job to do and it was put into law then she should uphold it or go....fundamentalist zealot","post_message":"Kim Davis said she grasped Pope Francis' outstretched hand, and he told her to \"stay strong.\""},{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"},{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10152823352857093","commenter_b":"Manslaughter is manslaughter no matter who you are or what you got...","commenter_a":"I think she's disoriented by her cash! Not the crash..man so a if","post_message":"YOUR TURN: Nicole Hutchison faces an intoxication manslaughter charge, accused of hitting and killing a TXDOT worker on U.S. 75 Central. Police say she told them she was wealthy, they would regret arresting her & asked about her 3 dogs but not the victim. Her attorney says she was disoriented by the chain reaction crash... WATCH: @webpagelink READ: @webpagelink"}]
