[{"comment_id":"1024247464301668","commenter_b":"Thats life woman ....","commenter_a":"Why do we have to broadcast everything? Is anything private anymore?","post_message":"The scar that saved a baby's life"},{"comment_id":"10154199579226770","commenter_b":"I would make her the racist","commenter_a":"Then should be on our team and not with Islamic terroists","post_message":"A journalist for The Guardian, a left-wing news website, said she wouldn't condemn violence against so-called 'racist' people."},{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"},{"comment_id":"10152856224956051","commenter_b":"Ban them from the USA!!!!!","commenter_a":"These f***ing traitors need to have their asses strung up on the flag pole !!! Wtf is happening to our country!! What a bunch of sorry worthless stupid f***ing liberals!!.. S*** is fixin to hit the fan!.. Do they actually think we're just going to sit back n let them continue their disrespect??","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."}]
