[{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10153509849905329","commenter_b":"Get a grip lady","commenter_a":"Caitlin didn't choose to be born feeling like she was in the wrong body. She's not getting the award for getting surgery, she's getting the award for standing up in a bigoted, judgmental, harsh world and being her authentic self. She is giving hope and courage to thousands of transgender people all over the world and showing them it's OK to be themselves. Who knows how many people she is saving from suicide by being strong enough to go public and be treated with ridicule, ignorance, and hate. She's making a tremendous impact on the LGBTQA community. Courage comes in all forms. Are only the military and first responders allowed to show courage? Is that the only type of courage we're allowed to recognize? I choose to disagree. Of course Noah is courageous, no one is saying he isn't. Of course every member of our military is courageous, but that ...","post_message":"ESPN confirmed to BuzzFeed News there is no such thing as a “runner-up” to the Arthur Ashe Courage Award."},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"},{"comment_id":"10156149703965294","commenter_b":"I'd take her dang license and make her walk because she is so dang stupid!!","commenter_a":"He was doing his job,she was in the wrong ,51 in a 20 school zone.she should have been arrested.feel sorry for the safety of the kids.","post_message":"At first, she pleads for mercy: \"Can you give me a warning please?.... I have so much frozen food in the car.\" But, when the deputy walks to his car and comes back, her attitude changes completely:"},{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"10154018676368701","commenter_b":"If she used a gun and shot the fleeing perp then she should get off free and clear ! The cops do don't they !","commenter_a":"Sadly, if it was a gun she would be facing attempted murder charges in shooting a fleeing suspect. Since a car is a lethal weapon, it wouldn't be surprising if they decide to charge with something comparable. Property is not worth life, ever","post_message":"Police credit the octogenarian driver with leaving damage that helped officers identify the thieves car and apprehend them."}]
