[{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"},{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"1629129360707510","commenter_b":"she is a piece of trash and nothing can change that","commenter_a":"Who cares","post_message":"This Is Unbelievable!"},{"comment_id":"10153120507763984","commenter_b":"Quit giving our tax dollars to all the lazy and illegal people, bring industry back from China .","commenter_a":"This is exactly what I've been talking about. They want to raise the gas tax, they want to introduce a milage tax. Who will this hurt the most? The pood and middle class. The Democrats don't care about the poor and middle class, they view them as cannon fodder. And uninformed people keep voting for them.","post_message":"The Obama administration and this Dem like the idea of using taxpayer dollars to study... new ways to tax people. Do you think the idea of this new tax is absurd?"}]
