[{"comment_id":"10153421775308352","commenter_b":"oh you beat me to it....damn,are those tits real","commenter_a":"I'd raid her too, looking like that!","post_message":"Police raid pot club of Alaskan reporter who quit her job live on air to fight for legalized weed, after reports surfaced of illegal marijuana sales"},{"comment_id":"994031577299051","commenter_b":"scumbags who cross the border are exactly that illigal criminals who purposely defy US laws. The wall just got taller.","commenter_a":"Keep your citizens and residents on your side of the border. When I travel to Mexico, I have to fill out paperwork. To get back into the United States, I have to fill out paperwork. It is unacceptable that someone can come into this country through Mexico without having filled out anything and no record of them in existence while they're here.","post_message":"Vicente Fox Quesada: \"I'm not going to pay for that f---ing wall.\" Donald J. Trump: \"The wall just got ten feet taller.\" Presidente Enrique Peña Nieto: Trump has damaged the relationship between the U.S. and Mexico."},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."},{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"},{"comment_id":"10152804677074342","commenter_b":"Lots of prostitutes in England!!!!","commenter_a":"PROSTITUTES in LAS VEGAS. Stupidity","post_message":"DIARY OF EVIL: A teen has been found guilty of attempting to kill three woman out of 'revenge' and from frustration of not being able to lose his virginity. \"I was planning to murder, mainly women, as an act of revenge because the life they gave me. I'm still a virgin at 17.\" FULL STORY --> @webpagelink"},{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"}]
