[{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"10153681462888984","commenter_b":"Let's have a face to face.","commenter_a":"I am, and I have always liked her because she is honest!!","post_message":"Sarah Palin just put something on Facebook that immediately went viral... this image is exactly what Hillary didn't want America to see. Palin is never scared to tell it like it is... we should be grateful for her courage and patriotism."},{"comment_id":"1315765065158489","commenter_b":"I think.. Mexico already knows where the border is...start shooting.... enough said!","commenter_a":"Mr. Trump - take down that wall !!!","post_message":"Pres. Donald J. Trump wants to pay for his proposed wall by slapping a 20 percent tax on imports from Mexico. Do you think the tax is a good idea?"},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"10153217105611336","commenter_b":"Nah he's just a pussy","commenter_a":"If I were on the Baltimore police force I would walk off the job","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"10150849465384999","commenter_b":"Canada only lets rich Asians in obsessed with money!","commenter_a":"Keep letting Hordes of Immigrants into Europe!!!...Same goes for the U.S. of A., Canada & Australia!!!","post_message":"Victims of the terror attack on Bastille Day were honored on Friday in Nice, Paris, Rome, New York and Moscow."},{"comment_id":"10153794749431336","commenter_b":"She's been dogging scandal since the 70's shady person and that's probably going to be our next president.. Not because she's the best for the job, because she's a woman","commenter_a":"Clinton, will never be president of the USA, NEVER...","post_message":"George E. Pataki on Hillary Clinton’s server scandal. #GOPDeabte @webpagelink"}]
