[{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"1773311049564873","commenter_b":"Jerk","commenter_a":"Mitt Romney should be quiet. I worked very hard for him, was sick when he lost to Obama mostly because he would not fight back. He broke a lot of hearts the way he ran and loss. He has absolutely no RIGHT to open his mouth now. I am angry at him.","post_message":"Mitt Romney wants Donald Trump as FAR from the White House as possible... but nobody thought he would go this far to accomplish it. Is Mitt Romney irrelevant?"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"10153207702598967","commenter_b":"That chick in red goes down HARD!!! Hahahaha...","commenter_a":"Outstanding!","post_message":"So silly but so fun"},{"comment_id":"10154165946748606","commenter_b":"Please don't stereotype. You can not speak for all Hispanics. We all don't \"love\" to drink and drive.","commenter_a":"RIP... The Hispanics love to drink and drive. Thank God mo one else involved this time.","post_message":"A car went airborne after hitting a beltway bridge abutment before landing on the roadway below, killing the driver. @webpagelink"},{"comment_id":"10154249016409170","commenter_b":"She's a soft spoken HACK!","commenter_a":"Bam, i love the dems motto, vote early and often. How is this right. Another star for NC. Good job","post_message":"Usually Democrats can play the race card with no consequences. Not this time."}]
