[{"comment_id":"775605039243294","commenter_b":"Experimental Sexual Preference Network - no longer watching this no moral standards network","commenter_a":"I will not be watching any more","post_message":"Leftist ESPN goes all in..."},{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"10153129788220667","commenter_b":"No one cares that he lived and no one would care if he died","commenter_a":"Really?? Who cares?!?!??!!!","post_message":"He is in significantly better shape than when he was rushed to a Las Vegas medical facility after a three-day binge at a Nevada brothel."},{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"1806158626337786","commenter_b":"She has pneumonia like I have the plague! UGH","commenter_a":"Now they're saying she had pneumonia since Friday---yet she did a celebrity fundraiser Friday with no mention of being ill. And if she did have pneumonia since Friday, why wasn't that the first excuse given for her collapse?","post_message":"\"Overheated.\" \"Short circuit.\" These are her and her campaign's own words. If they're using language like this to spin her appearance, what is the reality?"},{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"}]
