[{"comment_id":"10154451087971756","commenter_b":"@username That's exactly the kind of response I would expect from a feminist... You don't want to do any of the heavy lifting. There's no reciprocation on the part of feminists because they only care about themselves. Even if I did respond how you wanted, you wouldn't address any of my points and simply make ad hominem attacks. That's all you people are capable of because you have no critical thinking skills.","commenter_a":"To the men commenting on this post that are shaming other men for being feminists: shame on you. You are just proving the very reason why we, as males, have much to benefit from feminism as well","post_message":"The male activists all face roadblocks. Other men might think it's strange for guys to talk about sexual health in public. Women sometimes resent the idea of men offering them information about their bodies."},{"comment_id":"10153500393969087","commenter_b":"Lmao!! Yes that woman really said that. She's a looney bin","commenter_a":"@username did you really just say \"Kid Rock is a patriot and has billions of fans that respect him?\" You really just summed up the average Trump supporter quite perfectly: someone who doesn't quite know the difference between an extra 0...","post_message":"\"I'm digging [Donald J. Trump],\" Kid Rock told Rolling Stone magazine. \"I think he will [win]. To me, I'm just like, 'We gotta try something else.'\""},{"comment_id":"10154517045124087","commenter_b":"The Muslim ban from war torn nations is meaningless. Besides him not banning Muslims from Saudi Arabia - because they have \"great human rights\" over there from Women not being allowed to drive or throwing Gays off of roof tops; Trump says US will prioritize Christian refugees. How do you determine who is a Christian when one can easily lie about this? Congress will likely overturn this. While they're at it, Trump stop droning brown people overseas and Congress stop sending foreign aid to these terrorist organizations who indirectly receive it.","commenter_a":"Good","post_message":"BREAKING: President Trump has signed an executive order indefinitely banning all refugees from war-torn Syria and suspending all refugee entry for at least 120 days."},{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"1142481939134045","commenter_b":"F*** that nicole. That's not kool. Omg! 😨","commenter_a":"@username Logan Rose","post_message":"Would you? #WSHH"},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"}]
