[{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"},{"comment_id":"1160841880602656","commenter_b":"Hello! Women pay taxes too!","commenter_a":"Not all bills in the House of Commons or Senate passes. This is a terrible bill, one that I wish not to pass. Our national anthem is fine the way it is, and does not need changing what so ever. The Honorable Member's health decline has nothing to do with this bill, and that headline is terrible to use. You wouldn't use the word healthy on any Honorable Member in the house, then why use his health attached to the bill?","post_message":"\"What a shame!\""},{"comment_id":"789272967888144","commenter_b":"If you're here illegally you need to get the fuck out . Don't care how old you are or how long you've been here","commenter_a":"Kill yourself Santorum , you have no purpose and you spread the disease of hate.","post_message":"Santorum... Santorum... That name sounds vaguely familiar... But why?"},{"comment_id":"607404219443285","commenter_b":"He's an idiot","commenter_a":"Then why in the hell did he get elected...twice?","post_message":"Delusional..."},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"940335786059476","commenter_b":"That's right fuck that dumb cunt!!!","commenter_a":"Michael Lance Kaniala-Ekahi Baldasare-Low Shelbie King @username","post_message":"How to silence Kim Davis supporters who cherry-pick the Bible to discriminate against LGBT Americans. In the comments, tag your friends who need to see this. Video by Occupy Democrats, please LIKE our page!"}]
