[{"comment_id":"1344505415570466","commenter_b":"yes 1999 ...only recently explore in earnest","commenter_a":"Actually it was found few years ago.","post_message":""},{"comment_id":"1549351415084883","commenter_b":"Dear Miss Jordan the idiot is not I that's for sure, just remember this this is not your land to start with. I hope you don't have an issue with the Native Americans because if it's true you should go back with you where you from.","commenter_a":"Why does the police have military style vehicles, why does the Native Americans still have to defend their land, why our government doesn't do anything about it.... Same old story oil companies rule the world.","post_message":"Watch as police in riot gear use pepper spray on activists protesting against the Dakota Access Pipeline. Multiple were arrested. More: @webpagelink"},{"comment_id":"10153332639166350","commenter_b":"I think either Dianna Elizabeth or Elizabeth Diane","commenter_a":"Congratulations William and Kate!!","post_message":"It's a princess! Congratulations, Duchess Kate and Prince William! on.today.com/1DRmS6f"},{"comment_id":"484366015087312","commenter_b":"They are all racist. They all hate white people. Yet they couldn't live without white people. Infact if it wasnt for white americans they would still be enslaved around the world. This country didnt start slavery, it was white americans that put an end to slavery around the world. its all they have is the slave thing without it they would have to evolve or take responsibly for thier inability to evolve .","commenter_a":"Why can't President Obama be impeached?","post_message":"National controversy after Juan Williams says something shocking. Juan is racist, plain and simple. Do you think FOX should fire Juan Williams?"},{"comment_id":"10153069537647293","commenter_b":"lol holly you do realize \"lust\" existed before the legalization, right? plenty of both gay and straight couples letting lust \"win\" on a regular basis. the legalization of same-sex marriage allows same-sex couples in LOVE to get married. so yes, love wins.","commenter_a":"Give it up haters. Love won. You lost.","post_message":"\"This is no time for fear or outrage or politicizing. We see that we are strangers and exiles in American culture.\""},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"},{"comment_id":"10154047067166756","commenter_b":"I hope you didn't watch the trailer. Lol","commenter_a":"WARNING:This article gives out way to much information.","post_message":"Leonardo DiCaprio was part of a cast that didn't have to fake being freezing or exhausted during the eight winter months spent in the Canadian and Argentine wilderness. Still, all anyone wants to talk about is the bear attack, says NPR film critic Bob Mondello."}]
