[{"comment_id":"10156861000555725","commenter_b":"No more stuffed-shirt limp-wristed men who talk to us in carefully chosen PC correct words .... We need a real man to take control of our country and return us to our glory days! AMERICA FIRST - EVERYONE ELSE IS A DISTANT SECOND ...... #TRUMP2016!!","commenter_a":"Why would anyone believe Breitbart after they made a business deal to screw one of their own?","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10153217617761460","commenter_b":"Gays have no right to call it Marriage .","commenter_a":"I dont like, or approve of same sex marriage, however we all have a DIVINE right to choose how to live our lives. What that means is, if one chooses to go against the 'rules' then that is on them. Its called \"free will\". I would advise against it according to my own spiritual belief's...but I have no right to take it any further than that with a non-believer. Its a touchy subject! We all have a gay person in our lives somewhere that we love, we may not like or agree with this life-style, and we do have a right to \"voice\" that, but that is where the right ends, and the rights of the gay person start...I only wish now the gays would see where THEIR rights end when dealing with those of us that are Not gay, and we do have Divine & Constitutional to disagree, but ...","post_message":"Marriage should be defined as it has always been. This is the ideal for raising children and is good for society. But while Americans are deeply divided on this issue, we should be able to agree that a Supreme Court decision would only exacerbate that division. Like the Roe v. Wade decision in 1973, a Supreme Court ruling that overturns state laws on marriage would do nothing to end the debate about marriage, but would instead prolong it. Full statement here: @webpagelink"},{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"10154990936431600","commenter_b":"#KeepWadeBitches","commenter_a":"bad choice in a head coach, Elway must be smoking weed","post_message":"What do you think Denver Broncos fans?"},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"}]
