[{"comment_id":"1343052442401891","commenter_b":"@username She also stated that she was going to get her 'presidential kneepads' Brenda. She knew exactly what she was doing! So, get over it already. Trump has cheated on both previous wives, and is now with the scary looking mrs strumpit.","commenter_a":"I love watching Bill do things like that. he's so good at it","post_message":"Because it's fun to watch them squirm."},{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"1134794909920596","commenter_b":"He bitch ya breathe smells like shit I can prove it.","commenter_a":"Well thats what the little shit gets for fucking with a monkey","post_message":"Angry baboon throws poop in little girl's face! #WSHH"},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"}]
