[{"comment_id":"960803304010619","commenter_b":"That is where it starts. Where does it end?","commenter_a":"For Gods sake, no one is trying to unlock your average Americans phone. They want to unlock the California couple, Christmas party killer terrorists, phone. And for good reason. To find other connections.","post_message":"JUST IN: Donald J. Trump is calling for a boycott of Apple until the company agrees to the government’s demands and unlocks the phone used by one of the San Bernardino terrorists. What do you think?"},{"comment_id":"10153140451210950","commenter_b":"He is waiting for Jade Helm. Ha ha ha ha what an idiot.","commenter_a":"@username the \"President\" is not Protestant. You my friend are the dumb ass. He is a Muslim,educated in Jakarta,Indonesia at several Mosques. Born in Kenya and outer by several family members as being a \"Kenyan\" your support of this foreign born usurper of the presidency is ridiculous. Not to mention Pope Francis is evil and lacks the backing of a large number of Catholics. Pull your head out of you're ass and realize that it I simply a meeting of 2 monsters,playing pretend for the media to feed it to idiots lil you. Retard!","post_message":"For the first time ever, President Barack Obama and Pope Francis sit in the Oval Office — together: @webpagelink"},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""},{"comment_id":"1547490425548819","commenter_b":"Hillary is worse than any of that and if elected she would be appointing supreme court justices who are in there for life. It is unfair to say that we need to re evaluate our values because we want some one who can beat her. In the end America as a whole is not voting evangelical prudence and wisdom would say pick any one who can beat her. My one and only comment. Blessings sister...","commenter_a":"Christians who support Trump need to reevaluate their values. I've never heard of Christians supporting a strip club owner who defends Planned Parenthood and doesn't care about marriage, but that's just me. Oh yeah, and swears continually!","post_message":"Editors' Note: The Christian Post has not taken a position on a political candidate before today. We are making an exception because Trump is exceptionally bad and claims to speak for and represent the interests of evangelicals."},{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."},{"comment_id":"1008881259209071","commenter_b":"America is in bad shape and people can't see it. I don't understand why they are for Hillary. She can't do a thing but lie. She will do nothing for poor and middle class. How do people not see this? ?? I am amazed at how stupid people are thinking life will be better with her doing what Obama has for 8 years. Bankrupting America and millions of Americans. WHAT has she done FOR America? ?? More. ..what has she done TO America? The red states will get it right I hope. If only the people in the swing states would come to their senses.","commenter_a":"Yep, you said it right, power and money, but wait , they want your votes too, hahahahahaha hahahahahaha hahahahahaha, I am not stupid, Hillary is not getting my vote","post_message":"\"The Clintons are greedy. They love money. They love money so much they've been accused of ignoring ethics and, very likely, laws to rake in more and more money.\" – Eric Bolling @webpagelink"},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"}]
