[{"comment_id":"571789942944915","commenter_b":"Mentall illness--- the narcissist doing his thing..I only hope the damage he IS going to do is NOT catastrophic.","commenter_a":"Egomaniac?? That is being kind. He is certifiably insane. I am calling all my congressional reps on Jan 21 to demand a mental health evaluation. He is crazy.","post_message":"Trump's 'Twitter feed is remarkably bananas this morning. Something bad must be coming.'"},{"comment_id":"10154517045124087","commenter_b":"The Muslim ban from war torn nations is meaningless. Besides him not banning Muslims from Saudi Arabia - because they have \"great human rights\" over there from Women not being allowed to drive or throwing Gays off of roof tops; Trump says US will prioritize Christian refugees. How do you determine who is a Christian when one can easily lie about this? Congress will likely overturn this. While they're at it, Trump stop droning brown people overseas and Congress stop sending foreign aid to these terrorist organizations who indirectly receive it.","commenter_a":"Good","post_message":"BREAKING: President Trump has signed an executive order indefinitely banning all refugees from war-torn Syria and suspending all refugee entry for at least 120 days."},{"comment_id":"523969991126914","commenter_b":"That's the whole purpose of the melting pot. To asimilate and not for every culture to impose their beliefs on the rest of the country, loyalty to the people and to the American flag.","commenter_a":"Get them the he'll out of our country !!!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"710448769145701","commenter_b":"I tell these slouches to pull up there pants.","commenter_a":"Someone told me that came from prison and meant you want to get fucked in the ass ?","post_message":"Two thugs had the pleasure of living in a jail cell for a few days. This is great. Do you think all thugs with sagging pants should be arrested?"},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"1549806335319114","commenter_b":"She is why we don't need women leading our country.","commenter_a":"She is nuts!","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."}]
