[{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10152627290331636","commenter_b":"should be run over by a merkava driven by a female israeli lieutenant. thirty times.","commenter_a":"To all the comments... No one support banding women from driving in saudi expect the foreign policy of UK, USA and france which insisted to aid every decision that made or will be made by barbaric and dictator royal family in saudi since 1940s,.... lets stop taking and read history... \"Knowledge-is-power\"","post_message":"The totally logical justification for a ban on women driving in Saudi..."},{"comment_id":"10153304564243525","commenter_b":"Typical knee jerk, fear based response. The terror attack in Paris was masterminded by a Belgian, not a serian. The NSA is a lot harder to get through than the security in Paris. What we need to do is acept the refugees, like Germany has done, and educate them on taking back their contry from the corupt regime AND ISIS.","commenter_a":"This is a very sad situation.","post_message":"#BREAKING Governor Rick Scott says Florida will not be willing to accept any refugees from Syria. Florida joins the growing list of states that have sent similar notices to the federal government. STORY: @webpagelink"},{"comment_id":"10153153941377507","commenter_b":"fuck her","commenter_a":"Who is this boob! Facts are facts!","post_message":"The last thing we need is a news outlet telling seniors that their Social Security isn't their money. We need to expand it - not cut it. Sign the petition if you agree: @webpagelink (via Snarky Pundit)"}]
