[{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10153767433373132","commenter_b":"go girl.","commenter_a":"You are the most. Beautiful one there your Hair your. Clothes shoes. You go Rock it Beautiful!!!","post_message":"Counting down the days to New York Fashion Week."},{"comment_id":"10152478705626990","commenter_b":"I eat a lot of eggs too, but it's just about a dollar or less, so I don't really pay attention to the price increase.","commenter_a":"Eggs are one of the few inexpensive natural proteins ... I'm concerned that this is gonna hit poor families where it hurts the worst :/ just a thought","post_message":"EGG-SPENSIVE! A new California law mandating that hens get more room in their cages, means egg prices are likely to go up --> @webpagelink"},{"comment_id":"10153618573248984","commenter_b":"@username ANOTHER IDIOT FOLLOWER","commenter_a":"ANYONE WHO SUPPORTS HIM IS A ASSHOLE","post_message":"Trump is tearing it up! This is sure to make his haters absolutely livid. Do you support Donald Trump?"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"10154324283638854","commenter_b":"Like they say it for the first time !!! they say it all the time it is their law and authorities are to blame ! There is no way of knowing which Muslim will want to become a martyr by killing who ever their god tells them to kill !!! this religion must be totally banned in a Christian Country !!!","commenter_a":"The Gay community needs to vote for Donald Trump. If you vote for Hillary you can expect more of these infiltrator brought into this country unvetted.","post_message":"VIDEO: Speaker at Orlando Mosque Says Gays Must Die. SPREAD THIS EVERYWHERE!"}]
