[{"comment_id":"1702706209988180","commenter_b":"Stupid Question! Why should illegals be allowed to vote here? Do we vote in their country??????? NO!!!!!!","commenter_a":"YES","post_message":""},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"1324175080956294","commenter_b":"You'd rather vote for Killary That murdering lier. God help us.","commenter_a":"Can't imagine any decent American voting for this clown!! I'm not the biggest Hillary fan but anything is better than this. Use this weekend while we spend time with family and friends to first of encourage people to VOTE. And then let them know the evils this dude is spewing. We've come too far to let this dude take us backwards!!","post_message":"Just when you thought Trump couldn’t get any more racist and misogynist, he manages to lower the bar of human decency."},{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"},{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""}]
