[{"comment_id":"444043602465820","commenter_b":"Look at her satanic pointed teeth!","commenter_a":"Not surprising, coming from stupid, I mean her.","post_message":"Democrat Leader says Her Kids Weren't Human Beings while in Her Womb!"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"832762386834955","commenter_b":"Little bitch alert","commenter_a":"Use thc dumbasses","post_message":""},{"comment_id":"10154884386731509","commenter_b":"Irrelevant, and you obviously miss the point.","commenter_a":"I do not support Trump. Let me get that out of the way first. That said, this is a terribly undemocratic, anti-American thing for Buzzfeed to do. Anyone who disagrees is sadly unable to separate partisan politics from basic principles.","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"775776192555196","commenter_b":"When God or nature grants you a vagina and uterus, you'll have a say in reproductive rights. Until then, NO. You canNOT force your girlfriend to continue an unwanted pregnancy to term, you creep. That's rape.","commenter_a":"So if a father wants his baby a woman can kill it with out his permission I guess a man only has rights to a child when a woman wants his money for the next 18 years rape is the only time abortion is ok if it's not from rape abortion is murder stop sugar coating avoiding responsibility if a woman wants a child and a man doesn't can he force an abortion no woman do not have exclusive rights over children just because you carry it for nine months a child beongs to both male and female hate me if you want to but my child was MURDERED! With out my say!! How is that equality?!","post_message":"Elizabeth Banks, Bellamy Young, and others share abortion stories to #drawtheline."}]
