[{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood? Check out what he told supporters...."},{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"},{"comment_id":"1353932681333143","commenter_b":"No ma'am. Her CHOICE killed her. Let's call a spade a spade.","commenter_a":"Grieving or not that's totally unfair on her friends who by the sound of it were nit even taking g the drugs with her! RIP what a waste of life educating kids this age on drugs is the most important lesson here as they are bound to try them.","post_message":"'You f****** killed her'"},{"comment_id":"1769177686700867","commenter_b":"Move out of our country then bitch! I'm glad Mike didn't let you carry our flag you traitor!!!!!!!!","commenter_a":"If your ass don't like it here leave you jabroni ass clown","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"636469079877004","commenter_b":"Send her back to her own country so she can mooch off of their welfare system, not ours! We have more than our fair share of moochers as it is!","commenter_a":"Send her back really quick........","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10153880483259705","commenter_b":"Samantha, this is your life.","commenter_a":"The driver?","post_message":"Mind... doesn't... understand..."}]
