[{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"},{"comment_id":"551801648301945","commenter_b":"I don't get it?Hillary will finish off this country!why not trump?He loves this country,He loves our military,he will get jobs bk from china&other countries that are ripping us in every way,He is rich enough that he doesn't need donations or special interests groups.That sounds a lot better than flooding America with illegal immigrants,Raising Taxes,&bankrupting the Country.","commenter_a":"I like Sanders but I believe he is too far left to win. Hillary has baggage but I believe she can win. Either way we have to keep the GOP out of the White House","post_message":"No matter which candidate you support - attacking each other isn't helping the cause. ~Marty"},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"10155070444570603","commenter_b":"This disease is curable with treatment. If she puts it off she will die. Just as an abortion her parents still have the right to choose life for their child.","commenter_a":"This is crazy!","post_message":"UPDATE: Cassandra was diagnosed with Hodgkin Lymphoma in September. For three weeks she was getting chemotherapy, but then changed her mind and decided she didn't want it."},{"comment_id":"10155549933771729","commenter_b":"They are terrorists. Maybe, its time to form our militias and eliminate these crazy evil nuts.","commenter_a":"Yes indeed. Love it!","post_message":"Oh, so sorry..."}]
