[{"comment_id":"1749451101986580","commenter_b":"Disgusting ... Soooooo sick of the ignorant and desperate race card being used - Clinton you are literally turning my stomach as you spoke often, all on recorded tv I may add, of protecting our borders from illegal immigrants and the insurmountable costs associated with this illegality - it's not racist, just one nation cannot afford to take on the needs of an impoverished third world nation that hides vast amount of hidden cash and hurts their citizens - you are such a liar and hypocrite - like now you should completely lecture us on keeping healthy and happy marriages - you and your lying inept money grubbing hateful wife make me sick - literally sad for any one that thinks you are role models - just so so so sick","commenter_a":"Racist not at all. Trump/Pence will be better then the evil woman! No question about that! I believe that Billy is suffering from a sexual disease that is destroying what mind (little left).","post_message":""},{"comment_id":"1072393442772125","commenter_b":"Some people also don't have a problem with photos of Jews killed in concentration camps.","commenter_a":"Got news for you on the gross part. They've been doing that one for years. 40 years ago, I got a pamphlet in the mail with mutilated baby parts from abortions. Didn't change my mind about it being a woman's choice.","post_message":"It just might work"},{"comment_id":"1277939352272817","commenter_b":"Its gangster in this bitch I better go before MFs pull they emojis out on my ass.","commenter_a":"Were are the white folk at? What's they excuse for this bull shit? Fucking dumbass idiots. I hope they sue the shit out of them!!!","post_message":"This bad cop narrative continues to evoke frustration. #WSHH #NYPD"},{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."},{"comment_id":"1295782043794583","commenter_b":"Let them fear! BE TERRIFIED! Trump will deport you! Americans WANT illegals and Moslems DEPORTED!","commenter_a":"\"I going to stand up for the 11-year-old girl in Nevada, who worried that her parents would be deported under a Trump presidency. For the Muslim family in Queens whose young children are terrified of how their family would be treated if Donald Trump becomes their Commander-in-Chief.\" What about the FIVE YEAR OLD GIRL in Idaho who was gang raped by SEVEN of your precious muslims,Hillary? What about the families in NY & NJ who are terrified that they will be blown up by ANOTHER muslim who has stolen and benefited from America's generosity,only to turn their islamic hate on us?!? Go to Hell,back where you came from,Hillary.","post_message":"HILLARY EMAILS HER DEBATE STRATEGY. AND ON THE HEELS OF A MUSLIM-LED TERROR ATTACK, HILLARY'S EMAIL COULD NOT BE MORE ANTI-AMERICAN. Read it. @webpagelink"},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"},{"comment_id":"10154746403950399","commenter_b":"Hope CNN is the first nail in her coffin.her propaganda is responsible for bringing a narcissistic sociopath to power.she knew what he was and put herself and financial gain before our country.she is a traitor.","commenter_a":"Excellent move CNN. The people deserve better going forward. She did an excellent job selling campaign flimflam, but her job is done now, she does not have the skills for the White House world stage.","post_message":"\"We passed. Those are the facts.\""}]
