[{"comment_id":"10153062603882235","commenter_b":"What is it about the name Cheney that brings out the stupid? Good God woman shut the hell up and stop sounding like your father. smdh","commenter_a":"Blackface was always intended to degrade. Drag is something else entirely.","post_message":"Mary Cheney — the lesbian daughter of former Vice President Dick Cheney — asked in a Facebook post this week why drag performers are allowed to blur gender lines in their work while society frowns on the form of racial minstrelsy known as “blackface.”"},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"},{"comment_id":"10155880374735354","commenter_b":"It sickens me to know that we let Muslim terrorist cowards like that stay in this country under the protection of religious freedom while we tell the Marines and the rest of the armed forces that we don't trust them enough to have a weapon around a civilian population. Ship those goat fuckers out and give our boys some firepower.","commenter_a":"I will always honor them and all that do sooo much to feel us free God Bless","post_message":"Know Their Names, Honor Their Lives. Semper Fi."},{"comment_id":"1504505429602215","commenter_b":"Screw Obama and the muslim horse he rode in on.","commenter_a":"first time i,ve seen odummer with his head out of his obummer.","post_message":"The first marine national monument..."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"991848417558053","commenter_b":"what woman?","commenter_a":"If this woman is willing to show such an overt act of patriotic disrespect, how will she ever effectively enforce our laws in an unbiased way? She should be removed from her position. End of story.","post_message":"VIDEO: Muslim Police Chief Shows This Act Of Complete Disrespect To America And Is Under Heavy Fire For It."},{"comment_id":"1135459499799639","commenter_b":"END THIS EVIL INBRED FERAL ISLAMIST BARBARIAN DEATH CULT NOW, WHEREVER IT EXISTS!!","commenter_a":"Vote Trump and we won't have this problem.","post_message":" correctness is putting America in danger and it's time to take action and protect our country!"}]
