[{"comment_id":"10153594866289641","commenter_b":"Ignore these followers of ayesha exploiter. their book says its good to drink camel piss and have sex with a goat.. dont mind these illegitimates children of arab savages","commenter_a":"WTF.....I know so many Hindus who drink cow's milk. ...n why shouldn't they eat beef. ...totally nonsense. .","post_message":"In Hinduism, cows are deemed sacred and their killing a sin."},{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"},{"comment_id":"1766583846919055","commenter_b":"I think she is an egotistical show-off.","commenter_a":"I think nothing about it.","post_message":"What do you think of the dress?"},{"comment_id":"10152999859350090","commenter_b":"He is gone. Concentrate on what is happening NOW!","commenter_a":"yes , in my lifetime. Teddy Roosevelt runs neck and neck. different reasons.","post_message":"Tell us if the Gipper tops your list. The Historical Presidents Poll: @webpagelink"},{"comment_id":"950959664958199","commenter_b":"She's a skunk","commenter_a":"Jackie Kennedy is turning in her grave.","post_message":"Michelle Obama Makes Rap Video: YoYo! Only Way To Succeed Is To \"Go to college!\""},{"comment_id":"649071821906476","commenter_b":"THATS WRONG WITH THIS WORLD! Let her whipr children!","commenter_a":"Next time the boys won't be so lucky. Somebody just might get killed.","post_message":"Louisiana mother arrested after allegedly whipping her three children as punishment for breaking into a neighbor's home. \"I never could imagine that trying to be a good mother would end me up in jail.\""}]
