[{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"10152886010046051","commenter_b":"Kill them sick people,now we'll have to pay for them to live in prison","commenter_a":"Both of them will burn in hell. Drugs are the most powerful tool of the devil.","post_message":"This mom decided to trade her 11-year-old for something that was a lot more important to her."},{"comment_id":"10153157386338984","commenter_b":"MUSLIM ASSHOLES","commenter_a":"@username:(. Not all blacks are Freeloaders. You are being Racist I hope you don't teach that to your Grandchildren's. What about the Bushes when they were in WH and they traveled around the world,that was ok right. And you Republican want another fucking Bush in office.","post_message":"Outrageous. This makes my stomach churn. I think we should make HIM pay up... Do you think Obama should be impeached?"},{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."},{"comment_id":"10153870911641680","commenter_b":"Crooked Hillary only a few more weeks until she goes away for good","commenter_a":"Forced conscription ”has always been a bipartisan goal“? News to me.","post_message":"Hillary Clinton: \"I don't think you'll hear any of this from my opponent, and I think that's a shame: National service has always been a bipartisan goal.\""},{"comment_id":"10154889440018701","commenter_b":"@username I totally agree with you ! So many people are making lame excuses for these kids! They were old enough to be out by themselves with no supervision,THEY MADE THE DECISION to do what they did,which KILLED PEOPLE and DESTROYED HOMES !! I hope the deaths and destruction is imbedded in their minds FOREVER !!! Bad choice of a way to spend your day ya little F***ERS !!!","commenter_a":"As a child a friend and I were playing with fire in a field. We accidentally set a huge bush on fire that could have easily spread out of control had we not had a drink with us. By the grace of god it didn't spread to all the near by homes. We were not trying to burn people's homes down. I think people need to realize that kids don't always think of what could happen. They are children! They will have this on them for the rest of their lives.","post_message":"Two minors have been arrested and accused of starting wildfires that killed 14 people in eastern Tennessee."},{"comment_id":"1254986011246599","commenter_b":"@username, Hillary was pandering the liberal black voter.......sickening to say the least! Hang the bitch till dead.","commenter_a":"I sense a lot of vigilantes are going to start taking matters into their own hands, since Obama, of course refuses to acknowledge blacks are the problem.","post_message":"This is the nightmare we all envision when thinking about being stuck in a riot. What would you do in the same situation..."}]
