[{"comment_id":"10154693491116833","commenter_b":"They know. It doesn't fit their agenda of eliminating ownership.","commenter_a":"When will the liberal anti-gun haters, learn that teaching safety first you will get rid of most of the accidental shootings. It's not the gun it's the person that picks up the gun that is the problem. If you would allow gun safety in the schools, like sex-ed, there would be a lowering in accidental shootings.","post_message":"While Everytown's ad message is all about being and safe with guns, the ad, amazingly, disregards basic fundamentals of safe gun handling. Unlike the National Rifle Association, anti-gun groups don't make actual gun safety training services, for adults and children who want to be and safe with guns available."},{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"684212015075058","commenter_b":"@username Your mom was penetrated 3 or 4 times in one day by a cave dweller","commenter_a":"The source file was on whitehouse.gov when they originally released it. I downloaded it, simply opened it in photoshop, and all of the layers were still accessible. I was able to remove words, dates, signatures and even fragments of words where they pieced them together. It was a complete fumble on their part.","post_message":"I thought this was just a conspiracy theory. But it actually happened today. #fakepresident? Edit: No we have not been hijacked, and our mods have diverse political opinions. This was from AP and tons of other sources both left and right, definitely not fake. Heavy was the most neutral we could find."},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"962133447168441","commenter_b":"Ok first of all don't try to tell me there was no raiping in euroup until the emigrants got there it's just the fact that a raipest is a raipest no matter where he is so you shouldn't go around saying imegrants are raipests hide your wives and kids I mean grow up dude","commenter_a":"Imagine if an immigrant did the same thing in Europe. I guess the title (and the comments) would be totally different!!","post_message":"A tourist has captured spectacular views from the top of a pyramid he illegally scaled in Egypt. (Video credit: Caters TV.)"},{"comment_id":"1507272636242022","commenter_b":"@username, that is exactly what Americans are so angry about , is our own traitorous bunches of Bureaucratic terrorists that not only has funded but brought into our own country on our own American soil, these terrorists that they somehow continue to push on the public and is why Trump stood up and heard American peoples complaint, not one politician up in that white house is a true American, or else they would have long ago removed the terrorists as well as not funded them with the peoples hard earned tax dollars, all Trump is saying is know whom we are allowing into our country, something the now Manics in the white house are not doing..","commenter_a":"Yeah Donald Trump is protecting Americans. Maybe if some of his supporters read a little about Hitler and Nazi Germany, they would see some similarities. I mean, the Jews and Communists were plotting against the Germans, right? They did start that tragic Reichstag fire, didn't they? Oh! And let's not forget the gay people and the mentally ill! America has a problem with them too! Yeah and women too. We've just gotten all uppity during the last 40 years, trying to steal men's jobs. Send us away too. And while we're at it, let's round up the Japanese again. I mean, they attacked us once, what's to stop them from doing it again? Of course, we should forget they were mostly citizens and born here! It absolutely amazes me how many people believe this!!! It's unamerican! It's dangerous. When you start sending a group of people off like that, where ...","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"1541922275848239","commenter_b":"What a stupid bitch. Only in Amerika can someone that vapid be taken seriously.","commenter_a":"NUT JOB ???","post_message":"Kellyanne Conway is a complete hypocrite who has no soul and CNN host Jake Tapper proved it."}]
