[{"comment_id":"10154496628933132","commenter_b":"@username she didn't say anything to the girls. She simply gave them a card. If my daughters were acting like spoiled brats I would not mind if someone put them in their place!","commenter_a":"Sorry Helicopter Mom, if I were those girls parents I'd jump down your throat for trying to police the thoughts and opinions of this group of girls, from what it sounds like to me it was the equivalent of a negative review among peers, I for one applaud the young ladies for exercising their First Amendment rights of free speech and I place the mother in question for violating those young ladies personal and intellectual autonomy","post_message":"The author and parenting expert shared the importance of being beautiful both inside and out."},{"comment_id":"10153715327517894","commenter_b":"These hoes kill me acting like they the only one with a fucking opinion and that their opinion is the only one that's right bitch you got me fucked up Alex Carey and when I see some breast then I'll refer to transgender!","commenter_a":"I love @username, but I don't expect anything objective about Mariah Carey to come out here because @username and Mariah are besties. I'm sure there's more to the story than this.","post_message":"Nick Cannon Is Refusing to Sign Off on Mariah Carey Divorce Papers"},{"comment_id":"1033520256666198","commenter_b":"It would be that woman riding in on a broom!","commenter_a":"what governor","post_message":""},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"546660998833704","commenter_b":"Yes! Please Do not get into Roe vs. Wade! It is settled law. Let women decide this issue.","commenter_a":"Ben, the worst thing you could do tonight in the debate will be to fall into the liberal media's trap. CNN CNBC and the rest of the liberal media wish to turn this debate unto a boxing rim once again. At the end, it will hurt the Republicans and that is the liberal media's purpose. They intend to make you fight Trump. They want to bring you down, the liberal media though. DO NOT FALL INTO THEIR TRAP!!!!!","post_message":"Thank you for all the kind words of encouragement leading up to the debate tonight. I know I don't stand alone, as We the People stand together to Heal, Inspire and Revive. Please make sure to send me your pictures throughout the day and during the debate at bencarson.com/standwithben!"},{"comment_id":"10153952652862293","commenter_b":"I guess you are happy with the Clinton globalist international crime family in the White House (along with the money laundering Clinton Foundation). She will continue to ship your jobs overseas (she supports NAFTA and the TPP), promote open borders that bring in criminals and support unlimited immigration of Muslims bringing Sharia Law and terrorism. Maybe you could then move to a \"no go zone.\" Ask Europeans (and the people in Dearborn, Michigan) how that is working for them?","commenter_a":"How is it not completely obvious to anyone with two eyes that this family is a bunch of con artists? Literally nothing they say is true. And half the country wants to give the most important job on the planet to this guy? Amazing.","post_message":"Eric Trump said he could not name a single instance when his father had given such a gift."},{"comment_id":"10156315267360725","commenter_b":"Humble pie lol","commenter_a":"She was getting way to cocky... talking way 2 much... didn't hit gloves before the fight .... she was force fed a slice of humble pie last night","post_message":"Glad to see that Ronda Rousey lost her championship fight last night. Was soundly beaten - not a nice person!"}]
