[{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."},{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."},{"comment_id":"936977403012167","commenter_b":"If they are illegal, how can they vote ?? Just askin'","commenter_a":"Hell no","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"},{"comment_id":"10153337350877217","commenter_b":"This is like a long running sentance And Jimmy saville is still dead.this often crops up in papers.","commenter_a":"Yaw hear about Colbert Chischilly?","post_message":"Tributes were paid to Leslie Nielsen today but he died 5 years ago..."},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"}]
