[{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"10153276953617293","commenter_b":"Whitesplaining.","commenter_a":"I guess since the whitest guy in the world doesn't find it offensive it must not be.","post_message":"\"I don’t find it offensive,\" Jeb Bush said. \"Native American tribes generally don’t find it offensive.”"},{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"890231291031876","commenter_b":"Why would you slap immigrants in the face by rewarding those that broke the law?","commenter_a":"There are a lot of academic papers (i.e. data by experts and not angry, ignorant people on Facebook) that shows that 1) undocumented residents have a MUCH smaller drain on tax dollars relative to what they contribute than what the media hypes up (generating fear is a lot faster/easier/profitable than actually knowing the facts), 2) that immigrants rank high on civic service, 3) that immigrants rank high on starting new businesses ventures, 4) that the U.S. Immigrantion system shows indicators of being purposefully designed to have an undocumented work force for which the govt. can reap benefits without paying the full bundle of rights, etc.","post_message":"We must sign comprehensive immigration reform into law to bring over 11 million undocumented workers out of the shadows. We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status. @webpagelink"},{"comment_id":"1115178825215538","commenter_b":"What the hoes Milton","commenter_a":"Smh..that's sad ..the thing is a man will stay only if he WANTS to stay no matter how many babies you popping out the coochie..better get yo life..become a wife..and try to avoid the strife","post_message":"Desperate"},{"comment_id":"1263026913766051","commenter_b":"You lady are a idiot","commenter_a":"That's the problem. You all look to Facebook for your answers instead of doing your own research and being free thinkers.","post_message":"This is the video we've all been waiting for. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"582484121909678","commenter_b":"Man she need to stop with her owe puppy monkey baby looking ass","commenter_a":"Donte Grant","post_message":"She's not ready for a tattoo"}]
