[{"comment_id":"10154057964035448","commenter_b":"Everyone go to Shannon's blog and tell him to shut the hell up","commenter_a":"Shannon Sharp is one big disappointment. What an ignorant clown he turned out to be. Hasn't a clue...just a great big mouth!!","post_message":"The Left will never learn..."},{"comment_id":"2045292995569416","commenter_b":"Oh shes another one who lied.","commenter_a":"Liar liar pants on fire!","post_message":""},{"comment_id":"888747014505260","commenter_b":"Good way to a straight path to HELL!!","commenter_a":"Awful but God will be the judge. Foolish woman.","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here!@webpagelink"},{"comment_id":"1151245754895453","commenter_b":"Please like this page and visit this online clothing store and check the available stock. For all kind of Master replica and other beautiful stuff join us here. @webpagelink @webpagelink","commenter_a":"LOVE!!","post_message":"This 12-year-old boy — with no books and no money to get to the library — wanted to read so badly, he read junk mail. That was until his postman and the Internet stepped up to get him some books."},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"},{"comment_id":"10153855979179099","commenter_b":"The wife is the boss in every house hold, where have you been? #Happywifehappylife","commenter_a":"Hope those who do never get another nomination!! Btw Will, grow a set. We can see who's the boss in your house!","post_message":"Will Smith will join wife Jada Pinkett Smith in not attending the Oscars this year. @webpagelink"},{"comment_id":"10154162666938812","commenter_b":"Omg Hillary is a lier and got Americans killed! She only admits lieing when completely and totally caught","commenter_a":"Hillary should win Not that dumb Trump","post_message":"JUST IN: American Samoa Democratic Party says Hillary Clinton has won Democratic caucus. abcn.ws/1L42Yyx"}]
