[{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"10154115994939369","commenter_b":"The thugs will make their way over to this mall too.","commenter_a":"This must be for everyone who wants to shop at Easton, but are tired of all the thugs that are there on the weekend.","post_message":"Not all neighbors and nearby businesses are happy about the new mall."},{"comment_id":"1085989268155126","commenter_b":"How old is this beech? She sound ignorant dumb and stupid. U need to stay off the coke white girl!","commenter_a":"Send her back to the bunny Farm.....she's useless....","post_message":"Tomi Lahren says #BlackLivesMatter is the new KKK."},{"comment_id":"10154839732705695","commenter_b":"Amen to that!","commenter_a":"If Trump can be manipulated by someone half his age with no power over him then he doesn't belong in any leadership position, let alone the Presidency.","post_message":"She suggested that Trump may not have known his microphone was on, calling it \"kind of a boy talk\" that \"Access Hollywood\" host Billy Bush was encouraging."},{"comment_id":"837004389725950","commenter_b":"Oh so sad.","commenter_a":"Amen!!!!!","post_message":"Absolutely! Thanks to our friends at Democratic Memes for this great image. Give their page a like and let them know we sent you!"},{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"}]
