[{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"1170886402975254","commenter_b":"Great family, a drunk, his brother a cheating womanizer, and his lying idot of a wife","commenter_a":"It's ok he will be let go with no repercussions !! 1 he is a Clinton 2 he is in California","post_message":"Former President Bill Clinton's brother, Roger Clinton, has been arrested for DUI in Redondo Beach, California."},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"1297466373615674","commenter_b":"HOW CAN ANYONE VOTE FOR THIS WOMAN WHO IS SO BLATANTLY FOR THE SUPER RICH !","commenter_a":"GO BERNIE !!! YES ... we surely need to implement a nationwide ban on this problem will destroy our only livable planet, Hillary support fracking... That's totally unacceptable and she is unfit to be pres.","post_message":"Fracking is a reckless, destructive and expensive practice and we must put an end to it all over this country. Add your name to say you support preventing the worst effects of climate change through the Keep it in the Ground Act."},{"comment_id":"1159562730832064","commenter_b":"@username what refugees ! Go back to Jordan !","commenter_a":"Haha.... What about millions of refugees whose right to return is banned by Israel? But o o no emotions for Palestinians? Why?","post_message":"Group travelers told to cancel reservation at lodging in Bavaria because they are Israeli."},{"comment_id":"10153561312261748","commenter_b":"I'm come to the conclusion that we can safely assume the complete opposite of anything said by a conservative.....","commenter_a":"It's little wonder the whole world thinks the USA has gone bat shit crazy!","post_message":"Ted Cruz says people don't like Duck Dynasty's Phil Robertson because he \"speaks with joy,\" floats him as UN Ambassador"},{"comment_id":"10155201801124170","commenter_b":"And the are letting this teach our children!!!!!!!!!!!!!!!","commenter_a":"I was talking with someone who told me they way he sees what's happening is most of these rioters are youths and college students that aren't even from HERE!!!Don't care about America, don't even know about America our home sweet home. So they need to STFU.","post_message":"Public education at its finest."}]
