[{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"},{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"719757218174186","commenter_b":"So, @username. Please give me a source of information you've taken part of that doesn't promote the hoax. How many articles have you red? How many books? How many documentaries? You know how in a trial both parts are allowed to talk? The jury then have to consider which story makes the most sense and who has the most solid proof. So I take it you've studied both sides thoroughly before you decided it's a crazy tin foil hat theory? I mean, only a huge fool would believe they understood something without reading both sides. And you're not a huge fool now are you?","commenter_a":"Of course not, it's a Globalist hoax to control the world population even more and finance the World Government which is an essential part of the New World Order. The Chinese are in on it of course but don't know why he thought it was their idea specifically","post_message":"-_-"},{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."}]
