[{"comment_id":"10154100932456968","commenter_b":"Has Steve Bannon taken over the POTUS Twitter account?","commenter_a":"Suggest that Trump and co. start keeping their mouths shut and start listening to America.","post_message":"He also threatened federal funds to UC Berkeley."},{"comment_id":"10155028093604826","commenter_b":"Use to be entertaining...fun .. a great time to get together with friends...now its just another political platform and a lot of disrespect in the name of freedom of speech. I will be exercising my freedom to not watch it","commenter_a":"Falcons but I won't be watching. Totally lost interest.","post_message":"Question of the Day: Who do you think will win the Super Bowl?"},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"},{"comment_id":"692830987553004","commenter_b":"Fr we were running thangzz up in that bitch","commenter_a":"@username i don't miss Carrows but I miss working with you. 😿😻","post_message":"Too lit! #WSHH"},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"10152842669910779","commenter_b":"Feminazi alert","commenter_a":"Why aren't you showing her as an athlete, instead of an object? Such utter bullshit.","post_message":"She’s “a beast.” The “most dominant athlete alive.” The “greatest athlete” UFC president Dana White has ever worked with. But what’s her life really like? And how did she go from living in her car to being MMA’s unstoppable force? Erik Hedegaard tangles with Ronda Rousey. Click through to read the full feature."}]
