[{"comment_id":"1341394042564599","commenter_b":"so lets make america so scary and violent for them that they won't want to stay here. america is a big fat sow that they will feed off of till she dies","commenter_a":"Nice mike","post_message":"TheBlaze news update with Sara Gonzales"},{"comment_id":"710829429070596","commenter_b":"That a girl","commenter_a":"That's all you got NBC? IF that is even true, it pales in comparison to the lies and scandals of the Clinton's. Both candidates are far from perfect but I'm going with the one who doesn't support the butchering of full-term babies, who doesn't support millions of immigrants being granted citizenship, who is in favor of term limits and ending special interest groups in DC, who will create jobs through trade reform rather than the government creating yet another program and who will reform the health care system and end Obamacare, which, in case you haven't checked, your policy is going up by 25% next year, who supports our military and vets and our police officers and supports the NRA and my second amendment rights and the list goes on and on. If the truth were ever told by the media, this would be no contest.","post_message":"Federal agencies are barred by law from endorsing candidates in political elections"},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"1284456268283154","commenter_b":"Take her down, NOW! Before the Election!","commenter_a":"Vote Trump! There is just to much evidence of serious corruption to ignore. She is a criminal and a traitor to America!","post_message":"This is the end of Hillary Clinton's campaign, and it's all due to Congressman Jason Chaffetz releasing damning new evidence that will make sure Hillary sees the inside of a jail cell. The FBI isn't ignoring this anymore. Let's get 2,000 shares to prove that America has spoken and we want Hillary behind bars."},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"}]
