[{"comment_id":"1813306192269436","commenter_b":"Clinton lost because she is Hillary. End of story","commenter_a":"I don't understand why this is just going past everyone like it's ok! We need to do something. If a democrat did this they'd be ridiculed left and right","post_message":"EXCELLENT question! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"704293576413843","commenter_b":"Can't wait to be done with the racist goat humper","commenter_a":"Yay for Trump!!! Bye bye Obama!","post_message":"LIVE VOTE: With Trump taking office, are you grieving or cheering? Let us know why in the comments and see what others think. Join us for continuing coverage as President-elect Donald Trump prepares to take office, straight ahead on The Four!"},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink THIS is why they swim in circles in their tanks. The chart at 0:20 seconds explains it ALL."},{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"10152710214754205","commenter_b":"Bitch, you're from Missouri.","commenter_a":"Another reason to hate chicago","post_message":"Secret CIA Black Sites In American Heartland For 'Disappearing' Citizens"},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."}]
