[{"comment_id":"10153100903362061","commenter_b":"She's ugly!!","commenter_a":"Denise has had some work done.","post_message":"Juicy pop news - first photos of Kermit the Frog and his girlfriend Denise have hit the web: @webpagelink - The Muppets ABC"},{"comment_id":"10153638608000667","commenter_b":"That must be why one out of every three women will have one.","commenter_a":"Abortion needs to be under attack! The murder of innocent babies is atrocious. It has no place in a civilized society.","post_message":"\"Abortion is still under attack all over the place.\""},{"comment_id":"923707264362696","commenter_b":"Then fuck off with THAT bullshit. You ain't Gods gift to women. 😂😂✋","commenter_a":"Why are dudes so obsessed with a woman's personal life? Why do you need to know that and why does that information matter? The real issue is are you both STD free, not how many people someone has had sex with. Evolve please!","post_message":"When She Says She Only Had Sex With 3 Guys"},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"},{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."},{"comment_id":"10153086832391051","commenter_b":"She looks like she is fat enough to go to HELL, sweathog","commenter_a":"Well damn i'm moving over there wht","post_message":"This woman killed someone. She says she doesn't belong in jail for one reason and one reason only."},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""}]
