[{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"},{"comment_id":"10153906891941051","commenter_b":"When you don't treat a woman right - she will do you wrong.","commenter_a":"Wish I had not read this.","post_message":"A man came home early only to find his wife in bed with someone else. The worst part? It was with the absolute last person he'd ever expect to find her in bed with."},{"comment_id":"10152874600638598","commenter_b":"The men in China are becoming desperate for wives and there is none to be had. Men are now kidnapping small girls to keep for wives.","commenter_a":"I don't see any of you adopting the millions of unwanted children from china. The thrown away ones because they were girls, or the second child. The unwanted and given up for adoption, living in an orphanage or on the streets ones.","post_message":"China Has No Plans to Suspend Its One-Child Policy Resulting in Forced and Sex-Selection Abortions"},{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"},{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."},{"comment_id":"935958373261405","commenter_b":"Can she get any uglier.","commenter_a":"Trash just like her parents glad they are gone","post_message":"This speaks volumes about who they are as people. Thank the good lord we are done with them. Were the Obama's the worst first family ever?"},{"comment_id":"10153238274816107","commenter_b":"Counseled women*","commenter_a":"Thank you Rand! The only one who stands for the people!","post_message":"Thanks to your continued pressure, this morning I'm pleased to announce that I've secured a commitment to have a vote on my bill to defund Planned Parenthood before the August recess! I pushed hard all weekend long to vote on defunding Planned Parenthood. My campaign sent out millions of emails mobilizing patriots like you to join this critical fight. It worked. I believe right now you are seeing the impact one man who's willing to stand for something can make in Washington, D.C. with the backing of millions of good folks like you. But now our job gets even tougher. Please call your U.S. Senators at (202) 224-3121 and insist they \"Stand with Rand\" and vote for my bill to defund Planned Parenthood. And please let me know you've got my back by adding your name as a Citizen Co-Sponsor: @webpagelink"}]
