[{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."},{"comment_id":"934898123236603","commenter_b":"COWARDS!!!!!!","commenter_a":"Yes stop and we can just pretend it's not happening....?","post_message":"This is sickening"},{"comment_id":"527065960815030","commenter_b":"Her loss Tim!","commenter_a":"May God bless Tim Tebow you don't need her keep the faith God has a special woman for you","post_message":"God Bless Tim Tebow"},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"},{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""},{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"}]
