[{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"},{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."},{"comment_id":"963821730369705","commenter_b":"we need Ben Carson to give us hope.","commenter_a":"Liberals did it.","post_message":"MIT professor and noted left-wing academic Noam Chomsky attributes Donald Trump’s wild popularity to “fear, and the breakdown of society during the neoliberal period.”"},{"comment_id":"1832531477017547","commenter_b":"Calm down, people didn't realise the date wasn't in American standard form. And we didn't feel it, or at least no one I know felt it. Innocent enough mistake, I don't think anyone deserves to be called an idiot for it","commenter_a":"For all of you idiots saying nothing happened today.","post_message":""}]
