[{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."},{"comment_id":"10154415286659445","commenter_b":"I don't know I live in a 3 family Black family on the first floor Hispanics on the second & Im Italian but white on the third","commenter_a":"woah?!?!?","post_message":"WCVB presents a town hall meeting on #RaceInBoston in partnership with The Boston Foundation. Watch on WCVB and share your comments below. @webpagelink"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"589887647811084","commenter_b":"Please don't breed...","commenter_a":"Well I'd show an officer my id when asked, but some people feel differently and it's their right to walk away if they've done nothing wrong. Obviously she was never charged with \"jaywalking\", so in retrospect, she did nothing wrong according to her court hearing. Just saying.","post_message":"Are you kidding me?"},{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"10153904790105496","commenter_b":"Why is this guy not convicted yet...","commenter_a":"Oh no!","post_message":"Thermal experts say temps inside Ross Harris' SUV could have been as much as 125 degrees while Cooper was inside. Watch LIVE trial analysis now: @webpagelink"},{"comment_id":"10154430815494497","commenter_b":"Also ,,!,, cuz the onion","commenter_a":"Can't believe they would make him do this @username","post_message":"Astronaut Suspects NASA Using Him To Test Space's Effects On Fat People"}]
