[{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"10153590307723837","commenter_b":"De p***a WTF is wrong with the human race","commenter_a":"@username here's another one to the list","post_message":"DON'T HIRE HER! A baby sitter brought the kids she was watching to help her rob a bank! But why she robbed the bank makes it even worse!!!"},{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."},{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."},{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"},{"comment_id":"10157183746875725","commenter_b":"#TrumpTrain #Women4Trump #MakeAmericaGreatAgain #BuildTheWall #Vets4Trump","commenter_a":"I live in Australia. I would not want them here. But worse would be Trump. I feel sorry for you all. This will be an election of abstention I think. God Help America.","post_message":"It's clear: scandals and controversies follow the Clintons, who will say and do anything to win."}]
