[{"comment_id":"10155026863931509","commenter_b":"she doesnt look that bad for a transgender","commenter_a":"What a beautiful woman our first lady is.","post_message":"First families join hands for a rendition of \"The Battle Hymn of the Republic\" during memorial for slain Dallas officers. @webpagelink"},{"comment_id":"1160101854032719","commenter_b":"Build that wall!!!","commenter_a":"U tell em Trump","post_message":"Watch as Donald J. Trump discusses his education plan."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"10153176001911336","commenter_b":"They could rename the White House, Geratic Ward","commenter_a":"91% huh? @username lol","post_message":"\"I think I've got a good message. I think I've been more right than wrong on foreign policy.\" Today on Fox News Sunday, Sen. Lindsey Graham said he is considering running for president if he can raise enough campaign funds."},{"comment_id":"10155071797057235","commenter_b":"@username Melania is smart. She's living in New York with her son and her parents. Trump isn't even home half the time. All she has to do is keep up appearances. Show up at the Inauguration and a few key events.","commenter_a":"Yeah. You don't even have to know him to know this was gonna happen. Just watch him for the last 20 years. Why didn't his family talk him out of it.","post_message":"The giant orange baby-man president hates his job. Nobody could have predicted this..."},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"}]
