[{"comment_id":"10153671794761770","commenter_b":"Gross ! She's too fat ! Lol","commenter_a":"- Someone whisper in Dereks ear, ALL beauty is fleeting","post_message":"Derek Jeter clearly hit the jackpot."},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."},{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"\"I have no more campaigns to run,\" Obama quipped during the State of the Union. \"I know 'cause I won both of them.\""},{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"10153349077816051","commenter_b":"I don't care if she black or white or Asian or Hispanic welfare queen trash should have her insides ripped out or kicked off the system sink or swim","commenter_a":"60 000 for 12 kids!!!! That's borderline poverty! Why are people making a big deal out of this.","post_message":"This mom of 12 gets more than $60,000 per year in benefits. And that's not the worst of it."}]
