[{"comment_id":"458714004327362","commenter_b":"Whinny assed little bitch is what he is","commenter_a":"Lies or on all sides. It is politics and hard to see who really is lying. Media is a manipulator.","post_message":"These are some heavy-duty tweets..."},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"},{"comment_id":"10153969905469575","commenter_b":"Translation ?","commenter_a":"The bus should not pass that test bc there was something wrong if bus driver try back out but it's still jump forward an hit students an a frav principal an it's be proof on wthr new long time ago when they was look why bus have problems pass the test!","post_message":"In their inspection last night, police found nothing mechanically wrong with the bus involved in the fatal crash at Amy Beverland Elementary School.  Police are still awaiting the toxicology results from the mandatory blood draw, but the bus driver showed no signs of impairment."},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"370743173113977","commenter_b":"Should have thrown the book at her!!!","commenter_a":"Hell yes she deserved it!","post_message":"Did she deserve that?"},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"}]
