[{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"10153034727835667","commenter_b":"Wtf she's ugly and weird","commenter_a":"Linzee Kay @username","post_message":"Miss Piggy will not be pleased."},{"comment_id":"1419494658112647","commenter_b":"Show your junk to one of my babies and I promise you will sit to pee the rest of your sick life touch one and you will meet your maker and it won't be GOD","commenter_a":"You're one sick son of a b****","post_message":"CNN Believes That Little Girls Should Be Exposed To Male Genitals, Here The DISGUSTING Reason They Are Pushing This!"},{"comment_id":"10153262230564255","commenter_b":"Evil like this should be flogged. He's a monster like the rest of the TeaParty Jerks.","commenter_a":"I truly believe this man, Ted Cruz and their followers have very warped brains that will only bring greater harm to the world than Dubya/Cheney created and we are still trying to repair! They whole group needs to be tried and sentenced to jail for 3 years for TREASON!","post_message":"Losing his grip on reality, or lying shamelessly?"},{"comment_id":"133746713872563","commenter_b":"Burn in Hell scumbag","commenter_a":"You mad!!!!!","post_message":"JUST WATCH: Here's a snippet from the sentencing of Michael Morgan, the man convicted of killing two children in a house fire. @webpagelink  What do you think?"},{"comment_id":"10153075013704342","commenter_b":"And then she'll leave...","commenter_a":"idiots, so the what are they going to pay for their new animal sanctuary now that the livestock are not bringing in enough money to feed or maintain the ranch? oh yeah, they'll just do another gofundme scam and a bunch of idiots will pay their bills for them. crap like this is getting ridiculous","post_message":"CATTLE RANCHER GOES VEGAN: For four generations, cattle have been raised on the Sonnen Ranch in Angleton. A few months ago, that tradition ended when the current rancher got back together with his ex-wife, and she pressured him to go vegan."}]
