[{"comment_id":"10155001030118908","commenter_b":"Angie ???","commenter_a":"Simon","post_message":"Science says practicing mindfulness exercises increases gray-matter density in the hippocampus!"},{"comment_id":"1066188120157365","commenter_b":"You don't know shit lady !","commenter_a":"Those of you that are saying \"cry me a river\" are the same ones who probably laughed along with Trump when he mocked that disabled reporter, but it's all good because you get what you give, karma doesn't forget about anyone","post_message":"Meryl Streep just called out Donald Trump for bullying at the Golden Globes."},{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."},{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the \"Defund Planned Parenthood Act of 2015.\"   #ProLife #DefundPP"},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"}]
