[{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"918834358153905","commenter_b":"It's not liberalism it's victimism. Justifing everything you do and tring to force others to change by acting like everything that happens is victimizing you","commenter_a":"Agreed.","post_message":"The latest COMMENTARY from Matt Walsh:"},{"comment_id":"10153708782186350","commenter_b":"Michelle ovomit is the washed out hag!","commenter_a":"Michelle Obama is a wonderful woman who deserves respect. She didn't do anything to you. Stop acting like 12 year old bullies and grow the hell up","post_message":"Find out what Michelle Obama can't wait to do once she leaves The White House."},{"comment_id":"10153817855231955","commenter_b":"@username Dude your girl looks like a dude!","commenter_a":"That's okay. Iowa hasn't picked a winner in 16 years, looks like they are keeping up the tradition. Keep thumping your bibles you inbred corn growing losers.","post_message":"CRUZ WINS IOWA"},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"}]
