[{"comment_id":"10150798110624999","commenter_b":"@username, the Constitution says nothing about corporations having the same rights as The People, either.","commenter_a":"The constitution says nothing about abortion","post_message":"Oklahoma lawmakers have voted to ban virtually all abortions. That's flatly unconstitutional, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10153469659427042","commenter_b":"She's getting a life now getting away from that abrasive idiot.....stop with the marriage BS married or not no woman should be abused","commenter_a":"It means there not married right!! Now they have a child with no Dad , that's why Hashem laws say first we get married than have children . Are actions will let us all see our Rebbe King Moshich . She should get a life. Yechi Hamelech","post_message":"\"I have the courage to actually do something about it this time.\""},{"comment_id":"10156245317395720","commenter_b":"What illegals are we talking about? The ones that invaded on the Mayflower? Or the ones that boldly and brazenly broke into our shores on Ellis Island?","commenter_a":"THE LAW already says certain immigrants can work without fear of deportation. They're called the ones who came here LEGALLY! ILLEGALS, on the other hand, may not work in the United States.","post_message":"184 Members of the House and 34 U.S. Senators filed an amicus brief last night supporting Supreme Court review of President Obama’s executive actions on immigration. We are confident that allowing certain immigrants to come out of the shadows, register with the government, and work without fear of deportation fully comports with immigration law and the U.S. Constitution. Read more here: @webpagelink"},{"comment_id":"10153561445142093","commenter_b":"Really lady? Liberals and Muslims want to rewrite history? @webpagelink","commenter_a":"There are already people who say the holocaust didn't happen. With today's trend of re-writing history for political correctness, it may disappear in the next 50 years!","post_message":"A WW II vet was reunited with a Holocaust survivor who he helped liberate and the incredible moment was caught on camera...@webpagelink"},{"comment_id":"511888302293280","commenter_b":"this man deserves the right to express himself he fought for our freedom and i thank him and all vets it was not a bullshit war no war is bullshit lives are lost and families are destroyed we need to get back on track in this country starting with respect for each other","commenter_a":"Just because you fought in one bullshit war doesn't mean you automatically get a platform to spout your opinion about crooked cops claiming BULLSHIT on disenfranchised citizens are starting another war! Those killed by cops are ALSO AMERICANS...just FYI.","post_message":"When  asked if he was concerned about his safety, he said, “I’ve seen more than all this. I’ve been through the riots already.”  -Linda"},{"comment_id":"10153187291468812","commenter_b":"Sex slaves, good job girls!","commenter_a":"What's wrong with people this world is going crazy","post_message":"NEW: Search on for 3 schoolgirls who have fled home to join ISIS: @webpagelink"},{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"}]
