[{"comment_id":"10155589079690354","commenter_b":"both pigs","commenter_a":"Odd is right Tyranny lives","post_message":"Adorable...."},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"883279651765090","commenter_b":"No I read the whole thing, when article says believing Lincoln would restrict their rights to own slaves southerners decided secession was a better choice then to give up their economic system and their way of life. I translate that into, we will not get rid of our free labor (slaves) so secession was the choice, I can see where economics played into it, but to say slavery was not part of those same economics would be terribly ignorant. Lincoln maintained that secession was illegal thus unless south gave in war was inevitable.","commenter_a":"Here is an explanation of the civil war directly from the FEDERAL Government which proves without doubt that the War was NOT about slavery. Learn to research for yourselves people and stop being sheep. @webpagelink","post_message":"This is a VERY dangerous lie. Spread the TRUTH!  Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."},{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"10153063718888606","commenter_b":"What would be said if they were male teachers and little girls.... Sick is sick.... They need to go to jail and be on the sex offenders list.....","commenter_a":"Definitely a crazy world we live in!","post_message":"Two California teachers are accused of having sex with students while on trips to the beach, which included one overnight occasion. Police describe what happened here: @webpagelink"}]
