[{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"},{"comment_id":"245227072596737","commenter_b":"She's a freaking retard!","commenter_a":"One thing he is not insecure, but you are Nancy","post_message":"\"I feel sorry for you. You're the president of the US and you're so insecure...I pray for your Mr. President. And more importantly, I pray for the United States of America.\"  Do you think Trump is insecure?"},{"comment_id":"1753310708283376","commenter_b":"F all them towel heads and illegal immigrants. It's time to Trump all your dumb asses","commenter_a":"What did you expect of an ILLEGAL, MUSLIM, ALIEN who should be IMPEACHED AND TRIED FOR TREASON AGAINST THE USA! HOWEVER, the ELECTED OFFICIALS WILL DO \"NOTHING\" AGAINST THIS \"TERRORIST\"!","post_message":"Obama Admits He Is Embarrassed By Americans [VIDEO].  He is the worst president in the history of our country.  Do you think Obama is the embarrassment?"},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."}]
