[{"comment_id":"1077871268936068","commenter_b":"I guess being a lawyer, U.S. Senator and Secretary of State aren't real jobs?","commenter_a":"So fun to meet someone whose actually worked a real job..eh Hillary?","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"},{"comment_id":"1843443299266966","commenter_b":"Yet recent college grads have to have 3-4 years of experience to get a damn job with their field. This lady is straight unqualified for this position.","commenter_a":"Handle ya bizness AL!!!! Yasssss!!!!","post_message":"Al Franken is stunned to learn that Betsy DeVos is unfamiliar with the difference between proficiency and growth."},{"comment_id":"10153619360488132","commenter_b":"Your not a father!!!","commenter_a":"Jennifer Ramirez","post_message":"It was a very happy Father's Day for Caitlyn Jenner."},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"470081979849049","commenter_b":"Sure try take away all our guns but let the criminals still have them way to go","commenter_a":"Terrible First Lady","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"}]
