[{"comment_id":"10156320084670354","commenter_b":"The most disgusting women on this planet !!!!","commenter_a":"why are these women so adamant on murdering of innocents?","post_message":"WATCH Whoopi Goldberg and Joy Behar unload on Dr. Ben Carson..."},{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"1084755811580947","commenter_b":"She well be Charming President .","commenter_a":"Unless Democrats want to see President Obama hand over the keys to the White House to Donald Trump, we Bernie and Hillary supporters had better start aiming attacks at Trump and the Republicans, and not at each other.","post_message":"\"She cares. She tries. She perseveres. And now she has a chance to tell the story she’s always wanted about America: the story about a country that found the courage to turn away from our darkest impulses; that chose to embrace our growing diversity as a strength, not a weakness; that pushed the boundaries of opportunity outward and upward, until there are no more barriers, and no more ceilings.\" —Jon Favreau, President Obama's former speechwriter"},{"comment_id":"10154153789003010","commenter_b":"Gee, I bet General Petraeus wishes people held him to the same standard they hold Clinton. Maybe if he put a (D) next to his name, he could have gotten away with it.....","commenter_a":"Hillary Clinton has been a dedicated public servant for decades and she will be an awesome president.","post_message":"Let's not mince words: Clinton screwed up. But did she commit a crime, asks columnist Doyle McManus.   (via Los Angeles Times Opinion)"},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"10154256296041130","commenter_b":"is she for Citizens United? how about the ACA? How about Roe v. Wade, what's her position there? Now compare Republican's position on these...","commenter_a":"Only further proving that Hilary is a Republican, but delusional liberals will still vote for her","post_message":"\"This is not a traditional race, and these are not traditional times.\""},{"comment_id":"10153903226928797","commenter_b":"She Must Be Mentally insane","commenter_a":"Connie Reyes","post_message":"MOM HAS SHOCKING OUTBURST: The mother accused of killing her two young children and stuffing their bodies in a freezer has lashed out in court after losing her temper. What do you think? WARNING, details in this story are graphic and may be hard for some readers. Here's what mom said:"}]
