[{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"1082496428446957","commenter_b":"Taxpayers fund churches!! Churches don't pay taxes! Planned Parenthood is doing a service that they are legally allowed to preform because there are women choosing to have those services done. Christians have no right do insist this be stopped just because of their religious beliefs. I'm sick of Christianity being all high and mighty thinking that it is the end all be all of decision making for everyone else on the planet. Not everyone is a Christian and not everyone must be. Defund your churches!! Make the churches pay taxes!! Every time a Christian stops an abortion make a Christian take in an illegal alien and put him/her through school/college!! Stop hiding behind your bible and pretending to actually care about the embryos because we all know when you're not cursing abortion your wishing gays would go away and praying extra hard that your children won't turn out to be ...","commenter_a":"You know what's really ironic? Your religious organization doesn't pay taxes yet you're complaining about the money spent on abortions. Another thing is that you want to stop abortions but there's starving children right there in your neighborhood and your church and its congregation all have food on their tables, cars, cell phones etc. Then, you even complain about paying for birth control because it goes against your religious beliefs but then you expect non Christian tax payers to pay for your churches. In addition, you believe that your Christianity should trump my rights as a woman and you should decide what I should do with my body because of what your bible says. Well, I'm telling you NO!! Abortion is legal and its going to stay that way because of people like you. Women like me will always be here to stand up for our rights not only just ...","post_message":"Planned Parenthood has made a business out of destroying that which God has created. The one-sided relationship between it's ever-growing bank account and American taxpayers must be severed. That is why I introduced the \"Defund Planned Parenthood Act of 2015.\"   #ProLife #DefundPP"},{"comment_id":"10153022135468635","commenter_b":"The Jesus I know of hung around with prostitutes, drunks and gamblers. I imagine he certainly wouldn't have used social media to put down homosexuals because he would have been too busy loving them.","commenter_a":"The strong homosexual, transgender movement today is not surprising. It is a sign of how there will be a new world order. It is disturbing but it also points closer to our seeing Lord Jesus.","post_message":"\"Vines argues that while the Levitical code forbids homosexuality (Leviticus 18:22) it also forbids eating shellfish (Leviticus 11:9-12). Yet, he says, Christians no longer regard eating shellfish as wrong — so why can't we change our minds on homosexuality? Here Vines is rejecting the New Testament understanding that the ceremonial laws of Moses around the sacrificial system and ritual purity were fulfilled in Christ and no longer binding, but that the moral law of the Old Testament is still in force.\""},{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in.   Should parents have taken kids out of school for the parade?"},{"comment_id":"646317502237529","commenter_b":"Better ban these assault tree's!","commenter_a":"I have done these cases before. There is no excuse for this type of thing to be happening if the trees are being properly inspected and cared for. There are certain types of trees that should not be in public parks because they are known to do this. God be with the family.","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"1766923240187480","commenter_b":"What is the purpose of the wall on the border of Guatemala, I for one am sick of the illegals working here not paying taxes but taking their wages back to mexico and supporting their families over there.. Is this perhaps why a wall is not in the best interest of mexico?","commenter_a":"@username that's probably the truest state I have heard yet! Hilary is a monster and yes gets away with anything Would be impossible to impeach!","post_message":"Mexico's foreign minister Claudia Ruiz Massieu dismissed Donald J. Trump's campaign promise her government would pay for a U.S.-Mexico border wall."},{"comment_id":"1303809496299333","commenter_b":"Let us pray all that hard work won't be wasted. Hillary for prison 2016!","commenter_a":"It's going to take a lot of lawyers to keep her out of jail...finally some shovel ready jobs!","post_message":"This investigation shows no signs of slowing down."}]
