[{"comment_id":"10154941890619705","commenter_b":"Yeesh and I feel bad for my soy chai latte. I can't drink milk so its soy but I still feel bad about a special order. Not anymore!","commenter_a":"Melissa Lane","post_message":"And you thought your Starbucks order was complicated."},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"10153032045224411","commenter_b":"Don't waste your time here Ana! The reason why some of these people have tunnel vision is because their heads are deeeep up the RACIST European and American governments ASSHOLES they can't turn their heads to see what is really happening on side...","commenter_a":"Sadly people are not intelligent enough to draw a line between a religion and extremism. Had these cartoons been about Jesus instead of Mohammed a crazy christian extremist could have done the same thing, but I doubt that would be followed by throwing grenade at a church.","post_message":"'I personally believe that the death penalty should exist in our legal arsenal.'"},{"comment_id":"1026595164030198","commenter_b":"what was this brain dead bitch watching????","commenter_a":"A dues paying member of the old hag society.","post_message":"When did Andrea Mitchell become an official spokesperson for Hillary Clinton?"},{"comment_id":"10153274785312623","commenter_b":"I think they need counseling by Dr Phill.Hey people!Wake up!Want to be with the one you love?Renew your vows yearly.Want to have it both ways and live with guilt every day?Do not get married.","commenter_a":"It's like this.If you love each other.Fine.If you have the need to stray away from your soon to be spouse to hang out with the girls.Fine.But to be with somebody while you are married?Hey you are not fooling anybody but yourself.Either be married and be happy or go two different directions. I have been with my wife fronearly 20 years and have been through the best of times and the worst of times","post_message":"The wife of a Winston-Salem man arrested for bigamy is speaking out:"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"919963074724525","commenter_b":"It's not burning fast enough.hope they got all there goats out.would be a shame to lose what use to be there virgins","commenter_a":"probably after insurance so they can buy more guns???????????","post_message":"Taking bets...accident or on purpose? Was this an 'act of God'? What do you think?"}]
