[{"comment_id":"531806736985283","commenter_b":"No deal why is this bitch still free lock her up","commenter_a":"He can't, Hillary, not without the approval of the People!","post_message":"“The Europeans, the Russians, the Chinese, they’re going to say, ‘we stuck with the Americans, we agreed with the Americans, we hammered out this agreement, I guess their president can’t make foreign policy.’”"},{"comment_id":"10153411176356509","commenter_b":"I dont see any woman winning nothing by -coming forward- for the lack of proofs Cosby won`t face any compensation neither sentence, but it is a considerable quantity of womens telling the same, you figure it out ...","commenter_a":"Why are they all remembering it now?","post_message":"Heidi Thomas, who was an aspiring actress when she met Bill Cosby, is coming forward about a secret she says she has been holding for 30 years. This story contains graphic language:  @webpagelink"},{"comment_id":"10153026521466955","commenter_b":"Women of the world just took a hit, sorry","commenter_a":"it's all lies and if you even think for a moment it's true then your the fool","post_message":"MAG: Bruce Jenner 'Transitioning into a Woman'... Filming momentous docu-series..."},{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"10153328841247377","commenter_b":"she should be in jail what she done to Stevens was murder .","commenter_a":"We The People That For Trump Will Vote For Trump The Hard Core Dem Will Vote Dem If I Told Them My Dog Was Running They Wood Vote For Her Most Of Dem And Rep Wont To See Our Country Great A Gain Will Vote Trump","post_message":"New email released Monday shows slain Ambassador Chris Stevens wanted to leave Benghazi for months before his death, ex-U.N. Ambassador John Bolton said Tuesday."}]
