[{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"496840043839909","commenter_b":"No she should not!!!!!!","commenter_a":"well at least something can move them","post_message":"America in uproar after this Sarah Palin Picture leaks.  We stand behind her 100%. We need to show her our support.  Should Sarah Palin Refuse To Take Down This Picture?"},{"comment_id":"1245886292171089","commenter_b":"@username me too","commenter_a":"Maybe they were afraid the non-white people were not going to use the proper restroom for the gender on their birth certificate. Hey, do we have to bring our birth certificates along if we visit your fine state so we can pee? Oh, nevermind, I forgot...NO ONE IS GOING THERE, so we don't need to know! As long as you have McCrory as your governor, you best get used to this kind of thing happening. (Note: this bit of sarcasm was aimed at this Nightclub, not the City of Charlotte. Charlotte is the city that passed an ordinance on Anti-Discrimination to protect the LBGTQ community, which lead to the stupid HB2 being passed by the state legislature. Too bad Charlotte suffers along with the rest of the State for trying to be open and fair.)","post_message":"This is an outrage."},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"1341790949180015","commenter_b":"There are people in the world that defend raping children and killing babies . Ignore these people .","commenter_a":"Disgusting.","post_message":""},{"comment_id":"920934694585179","commenter_b":"94 MILLION LEGAL AMERICANS JOBLESS LEGAL AMERICANS HOMELESS LEGAL AMERICANS HUNGRY LEGAL AMERICANS HURTING AND THIS DEMOCRAT SLAVE MASTER, WHO GETS A LIFE-TIME SALARY FROM LEGAL AMERICANS VOTED AGAINST THIS BILL WHICH WOULD GIVE JOBS TO LEGAL AMERICANS","commenter_a":"Wrong on many levels....","post_message":"Greater energy security and more #jobs are at stake. Approve #KeystoneXL!"}]
