[{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"10153732358683984","commenter_b":"And let Sherriff Joe and border patrol do their jobs. The murder rate in Arizona is out of control and it's all illegals criminals","commenter_a":"Amen! TOTAL SUPPORT for Trump!! :-)","post_message":"The Donald just made a BOLD promise to a certain group of people if he becomes president - and boy oh boy, he is NOT messing around.  Do you support Donald Trump's tough position on this?"},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"1797699957184669","commenter_b":"Gowdy is a total bad A!","commenter_a":"I must say that I have never heard of you before today, however after watching many you tube videos and a bit of research I am impressed by you in every way. You would make an amazing Attorney General.","post_message":"There will never be enough words to adequately express our gratitude for the brave men and women who have selflessly fought for our freedom. Thank you to all of our veterans, past and present, for your service and sacrifice to our country. May God bless you."},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"1772923492974110","commenter_b":"@username .. Tippu tip, one of the greatest slave traders known to man that had over 10,000 slaves in Zanzibar, grandmother was a muslim slave. The problem with islam is the contradictions. You inherit the greatness of your lineage as well as all of the ills. The first step for Muslims to get passed this & be accepted in the international community is to accept the past for what it is & stop lying, deflecting, & manipulating it. It only creates more RAGE! Everything in this video is FACT and supported with 100's of years of abundant evidence. This video is actually a low ball. The actual number of victims of islamic genocide s 100 - 150 million deaths. Please stop telling me about \"bilal\" that was a slave in the first place by an arab. Abu bakr freed 3 personal pagan slaves for bilal's emancipation. Am I suppose to ...","commenter_a":"This is the blind teaching the blind. A ratings based media hub focusing on the impulses of the ignorant. This is not accurate about Muslims and therefore makes it inaccurate of Arabs. All Arabs aren't white. There was a black Arab named TIPPU TIP, he was one of the biggest contributers to slavery. He was very black. Look him up. Also, a Arab can't teach islam. Because Islam isn't synonymous with Arabs, it's more wide spread with Asians. Indonesia is the largest population of Muslims. All Arabs aren't muslim. And there were many Arabs who rejected Prophet Muhammed. I love history but I hate when people try to each topics of sensitive topics but pose a biased view. Black people must realize we are not all the same. Americans aren't the same a all Africans. We know why we're African, but most don't know we're more American than the white ...","post_message":"10 Facts About The Arab Enslavement Of Black People Not Taught In Schools"}]
