[{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"10153639008667098","commenter_b":"Down the street prima","commenter_a":"@username @username not near you guys?","post_message":"WOAH, that's a big sinkhole. It's over in Madera near Fresno and it's almost 20 feet deep.   Read more: kron4.com/2016/04/12/video-giants-sinkhole-swallows-street-in-madera/"},{"comment_id":"10153307488209087","commenter_b":"Read it again, silly bitch.","commenter_a":"Clinton was the one who started the whole \"birther\" movement against Obama. I wonder what she has planned for Sanders.","post_message":"“She is very much trying to put Bernie Sanders on the defensive, and it may be that she feels she has a chance to put this race away,” one Democratic strategist said about Hillary Clinton. “I think a lot of this is trying to end this campaign as early as possible and basically blow Bernie Sanders out of the race.”"},{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"807667145998560","commenter_b":"Dumb bitch cant spell","commenter_a":"Because she wanted to be an arrogant*** brat instead of following simple orders","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"389899691198325","commenter_b":"No comment !!! But she better Pray that Her President doesn\"t get away with his Immigration Laws ??","commenter_a":"Get a JOB!!!!","post_message":"Another welfare queen...:/"}]
