[{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10152984956631378","commenter_b":"Alan. Yes, it is murder. Abortion isn't done at 8 months.","commenter_a":"If abortion is totally banned, get prepared for this kind of thing to happen far more often.","post_message":"POLICE: TEEN BEATEN TO ABORT BABY: Police say four family members were arrested after a 14-year-old girl impregnated by a relative was beaten in order to induce an abortion: 6abc.cm/1Q7wchn"},{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"10153428290568487","commenter_b":"?? Do you think it while turn a woman into a fuck machine? Does Viagra turn men into drooling cock monsters?? WTF are you even talking about??","commenter_a":"Am I the only one with a slight concern that this could be used to spike women's drinks? Just a thought in the back of my mind....","post_message":"A FDA panel has recommended approving female Viagra for the market. Is it even necessary?"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"}]
