[{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"\"Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.\""},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"10158146961425354","commenter_b":"Patton Oswald? Never heard of her. When will the Secret Service pay a visit to this loon?","commenter_a":"King of Queens actor. Weirdo.","post_message":"PROGRESSIVES' HATE TURNS EVEN DARKER   “Holy F*ck. Come ‘n’ get it, terrorists.\""},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":""},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."}]
