[{"comment_id":"10153434512226749","commenter_b":"Oh we WILL get your guns. We will save this country from the terrorist gun owners","commenter_a":"Give it up Obama....you're not getting our guns! Stricter gun laws will only make more people buy them illegally!","post_message":"It's time to do something. @webpagelink"},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"10153017146936973","commenter_b":"But history is written by the victor i suppose.","commenter_a":"I'm from Mississippi and have been living in Oregon this pass year going school, work, etc. The Confederate flag represents our heritage and the hard working people like the farmers that supply food for you, and feed for the animals people in the U.S consume. Majority of the military that protects this country is Southern. People think they can just so publicly shit on us for something they know nothing about. Let me tell you something my family has been there for generations they had no slaves had to bust their asses having their children working hard picking cotton and corn using wood stoves until the damn 70s. Only the rich had slaves and that made up what 2% of our population ha. Bunch bullshit putting down an entire cultures heritage because of a few bad seeds that had the money and could call the shots.","post_message":"As the nation struggles with the legacy of a historic icon commonly brandished by hate groups, the outcome of that conversation could resonate in Oregon, too."},{"comment_id":"10155818308010354","commenter_b":"Black thugs.","commenter_a":"Idiots!","post_message":"It wasn't enough for the mob of 50 teens to ransack the Walmart.  When they saw the disabled man in the motorized wheelchair, they wasted no time..."},{"comment_id":"10154264665781336","commenter_b":"No @username My dad is a legal immigrant my dad learned today that his vote is worth crap and the party will NOT listen to his vote and they will do whatever unless you bribe politicians You can take your negativism and stuff it up your butt","commenter_a":"Why even be a Republican or Democrat when they throw away your vote and DO NOT LISTEN No LONGER a party member of anything","post_message":"\"We don't feel that this was a fair process. The Trump button got checked more than any other, so why do we have so few delegates?\" said State Treasurer Jeff DeWitt."},{"comment_id":"10153370094858010","commenter_b":"Yeah she really wants equal money lol your dumb lady","commenter_a":"It is the American nightmare regarding the death of our middle class and deeper poverty to our poor and elders. Vote the Repugs OUT!!!!","post_message":"Sen. Elizabeth Warren of Massachusetts got a standing ovation from California Democrats gathered today for the party's state convention. Warren told them: \"This country isn't working for working people. It's working only for people at the top. That's not the American dream. That's the American nightmare.\""},{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a \"b.\"   Now why would a Nigerian oligarch with a past like his do such a thing?"}]
