[{"comment_id":"1838073153099439","commenter_b":"Well, she's certainly dum enough for the part!","commenter_a":"But she looks like Hulk Hogan","post_message":"Amy Schumer has been cast to play a blonde doll with impossibly perfect physical proportions...."},{"comment_id":"1729422480677478","commenter_b":"I'm for the wall. Now!","commenter_a":"Immigration across the southern boarder is at an all time low level. President Obama has deported more illegals than any other president.","post_message":"Donald Trump says a border wall is a common sense way to slow the flow of illegal immigration at the border. Are you for or against his plan?"},{"comment_id":"10153966040516680","commenter_b":"Really Denny? Look back at this entire election process; every single act of violence was committed by the left, either A Bernie or a Hillary protester. EVERY single one of them.","commenter_a":"Tim like all rightwingers always blame someone else; it's SOP. This and other acts of violence is just a taste of what will happen if Trump is elected. Those prone to such acts will take it as de facto permission for violent acts against blacks, Latinos, Muslims, immigrants and of course their most hated enemy, liberals.","post_message":"“This act is a direct assault on people’s right to freely worship,” local authorities say."},{"comment_id":"10155087953524726","commenter_b":"wow. nice job ben, and that female twit is the typical young female know it all, what a fucking idiot, they actually think they have it all figured out.","commenter_a":"Ben Shapiro.... man, you're good.","post_message":"This is a must-watch."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"},{"comment_id":"10153947034057464","commenter_b":"Cruz for president 2016","commenter_a":"I think what irritates me the most about the republican election right now is people are voting for Trump because they think he is going to stand up for the American people, NEWS FLASH people he's not going to, he has illegal immigrants working for him, he has donated more to the Democratic Party than the Republican Party, and he was one of the people who supported Obama care. He is not our best choice he's our worst choice. He's a frigging liberal that is in the election to help Hillary get in why can't people see that!!'","post_message":"WATCH Ben Ferguson on why he's endorsing our campaign.  Join the #CruzCrew: tedcruz.org/volunteer"},{"comment_id":"10158510929345206","commenter_b":"Then how do you explain her looking at the camera from a certain angle while wearing a head scarf? Only one woman can pull off that move.","commenter_a":"thats not even her.","post_message":""}]
