[{"comment_id":"10153919372908352","commenter_b":"A REAL MESS..WOW","commenter_a":"Macho","post_message":"‘I feel like a princess!': Transgender teen crowned homecoming queen at Missouri high school"},{"comment_id":"915727415130269","commenter_b":"Dại Lâm what do you think?","commenter_a":"I'm getting burned out on the Rock he was in 13 movies last year and it's only June and he's already in 6 movies this year give somebody else a job dam he's not the only actor in Hollywood. ..gee","post_message":"From Fast & Furious to Big Trouble in Little China."},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"},{"comment_id":"10153937424304205","commenter_b":"This is why rape is so prevalent these days","commenter_a":"Every kids goes to thier mom in utah for this like this. Go spend a few years here then bitch about utah. Your making fun of thier Mormon culture... Look I've grown up in utah and I don't disagree that it's ridiculous. But your making fun of thier religion.","post_message":"A Utah high school student was having what he believed to be impure thoughts toward his female classmates when they wore their cheerleader uniforms in class."},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"888413677941681","commenter_b":"We are aliens!!!!","commenter_a":"Blacks are the only ones seen. Thats good news. It could only mean that whites are aliens.","post_message":"Google Identifies Black People As Gorillas & Other Image Recognition Fails"}]
