[{"comment_id":"1243385125672214","commenter_b":"@username ill kill you","commenter_a":"@username @username Jane Ní Chonchubhair Gala Ní Mhuireagáin boop","post_message":"BOOP"},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"1755849284702183","commenter_b":"Fuck Muslims","commenter_a":"That's not how it read last year fool think we forget","post_message":"They Told Him It Was A 'Threat To Muslims'... and his response went viral.  Do you support his right to fly our flag?"},{"comment_id":"10156284616795354","commenter_b":"Lol, they weren't immigrants.","commenter_a":"Immigrants....","post_message":"What in the world is going on?"},{"comment_id":"10153523768927293","commenter_b":"Thank you!","commenter_a":"What do you mean by white? there are white latinos i.e. latinos of European origin, so it isnt about race? pigment and having a tan or lack of deosnt define a race....cleopatra, moses, werent caucasion? what were they then? most experts say caucasion includes indians and that middle eastern are essentially white - although some can be mixed race .. so what exaclty do you mean and why do you care so much? We could find examples of many blacks playing white characters - very common in shakespeare...so keep your racial obsession and race baiting to yourselves please WP!!!","post_message":"From “West Side Story” to “The Birth of a Nation,” watch 13 times that a white actor portrayed a non-white character on the big screen."},{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""},{"comment_id":"890066024388849","commenter_b":"Our own government is gonna put us in a civil war to survive all this mess.....SOMEBODIES GOT to be making dirty money off all this illegal stuff going on....unbelievable","commenter_a":"Send all of them packing NOW.","post_message":"ILLEGAL TSUNAMI 2.0: 12,509 Illegal Kids Already Over Border In New Wave (VIDEO)  The next explosion of illegal teen border crossing is in full swing, but just one-in-six are being sent home, with most of the rest settled in the United States,...  @webpagelink"}]
