[{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."},{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"},{"comment_id":"10154086770281756","commenter_b":"I guess science works when ranchers feed their cows corn instead of grass and then have to shoot up the same cows with tons of antibiotics because they are eating GMO corn instead of organic grass. Guess what? Those antibiotics are transferred to humans who eat meat and cause cancers in humans. Be safe, don't eat meat or during dairy milk.","commenter_a":"Why? Wouldn't this be a conflict of interest? It behooves hospitals to feed their patients meat with as many antibiotics as possible so people would visit again in the future and hopefully for a much longer stay.","post_message":"Hospitals are on the front lines of the battle against antibiotic resistance."},{"comment_id":"1829686510610987","commenter_b":"Just go away Jill. You are as bad as Crooked Hillary. No one believes you.","commenter_a":"So Sad, wasting more taxpayers hard earned money. I hope Trump puts that piece of shit Hillary in jail. I'll never vote for a Democrat again.","post_message":"FUBAR!"},{"comment_id":"887798031255619","commenter_b":"@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"},{"comment_id":"961735010603412","commenter_b":"Good job Iowa","commenter_a":"Go trooks","post_message":"Join me in Iowa - attending a great event in honor of wonderful Senator Joni Ernst. Let's MAKE AMERICA GREAT AGAIN! #RoastAndRide"},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."}]
