[{"comment_id":"10154648123623812","commenter_b":"@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is \"proving he is more unacceptable\" than Hillary Clinton."},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"1061799393879808","commenter_b":"Poor woman","commenter_a":"Mandy O'Loughlin","post_message":"They ripped most of one woman's scalp off in a horrific 30-minute 'feeding frenzy'"},{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"937660539681364","commenter_b":"He did not say the wall was to keep you or anybody else in...but to keep out Drug Dealers...I agree !!!","commenter_a":"What the hell? Now Trump want to build a wall both Mexico and Canada boarders. So the Americans are going to be imprisoned in his Presidency?? Dump Trump","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"1164591366914667","commenter_b":"Texas, enough said.","commenter_a":"Try to keep your vagina in your pants \"Ladies\"","post_message":"The closing of safe, clean clinics across the state has brought the back alley abortion back to Texas."}]
