[{"comment_id":"1095502743841518","commenter_b":"Jenny Davis so sorry you are correct. It was friends nothing to show.","commenter_a":"Lets all stand behind trump, the winner of the republican party!","post_message":"Who do you think Donald J. Trump should choose as his running mate?"},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."},{"comment_id":"10153126250487452","commenter_b":"But she could've let the staff know so they wouldn't bother her. Or find a private, cleaner place than the toilet to do it. Why do people feel so goddamn entitled? People relieving their bladders are important, too, and they can't do that at their seats. Some people need to grow up and realize the world doesn't revolve around your areola","commenter_a":"I have one kidney and would hate to have to sit and wait and wait and wait to use the restroom because she wants the bathroom for an extended period of time. This has nothing to do with breastfeeding and everything to do with being inconsiderate.","post_message":"An Arizona mom claims she was reprimanded by a flight attendant for pumping breast milk in an airplane bathroom."},{"comment_id":"504839586342663","commenter_b":"You slimy cocksucker","commenter_a":"The poor need to try harder","post_message":"\"We are the first generation in human history that can end extreme poverty.\""},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"445168402354286","commenter_b":"Folks are worried about our second ammendment. How about change and uphold immigration laws. For starters vette K1 Visas correctly. Frankly, the current laws aren't upheld now by the lawless folks in our country and government.","commenter_a":"I believe K-1 is a Fiance Visa, wherein the couple must marry within 3 months.","post_message":"***BREAKING***  Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport.  DEVELOPING..."},{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."}]
