[{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"\"Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.\""},{"comment_id":"908814249264770","commenter_b":"@username did you know it will cost 114 billion dollars to deport 11.3 million people then add in the cost of the wall. Who would pay for that. Our taxes would have to go way up to cover that. I don't think Don can cover that out of his own pocket.","commenter_a":"I am an American. My children are American. My Grandparents and Great Grandparents were immigrants to this country. They came from Poland, Germany and Italy. I am a woman. I am successful in the male dominated auto industry. Donald Trump has spoken against every good thing I have been taught to be proud of in America. He is a ignorant, lying buffoon. #imwithher","post_message":"Yesterday, Donald J. Trump said that the judge presiding over a lawsuit against Trump University should be disqualified from his job because, in Trump's words, he has “Mexican heritage.”   Judge Curiel was born in Indiana—and last I checked, that's in the United States of America. Judge Curiel is as much of an American as I am. He’s as much of an American as Donald Trump is.   Let's be clear about what Trump is saying. He thinks that because Judge Curiel's family has Mexican roots, he can’t do his job. Donald Trump isn't just wrong about this; his words show that he’s wrong about America. He’s wrong about what makes this country great. And on a day that we are mourning Muhammad Ali, let's remember that we live in a country where people can break down barriers, worship their own god, choose their own name, and lead and follow their dreams as far as their hard work and talent will take them. I’ve always believed that in America, it doesn’t matter where your parents were born or what color your skin is—we should be judged by our words and our deeds, not our race, heritage, or religion. Well, it's time to judge Donald Trump by his words and deeds. And I believe that his prejudiced, bigoted words and deeds disqualify him from being President of the United States."},{"comment_id":"1759075771038433","commenter_b":"@username...No evidence??? HOW ABOUT 4 DEAD AMERICANS.... HOW ABOUT ERASING YOUR EMAIL TO HIDE IT, WHEN ASKED...HOW ABOUT MISHANDLING TOP SECRET INTELLIGENCE... THAT'S ALL BEEN PROVEN. .. YOU CAN'T PICK AND CHOOSE....YOU CAN LEAD A HORSE TO WATER, THEN HOLD HIS DAMN HEAD UNDER, UNTIL IT QUITS KICKING...THAT'S WHAT IT TAKES, WITH PEOPLE LIKE YOU, IT SEEMS.","commenter_a":"So would we all. As a matter of fact, orange jump suits would look good on all Socialist-Democrats.","post_message":"“Hillary, I’m waiting for what you promised me. All I heard was you getting on TV, calling me a liar. That’s not true, Hillary. I am not the liar. You are the liar.”"},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"\"If I think for some reason it's not going to work, then I go back to my business,\" Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. \"There's no question about that.\""},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."},{"comment_id":"10154324674924916","commenter_b":"@username, She's actually the lesser of two evils.","commenter_a":"When you cast your vote for an out right bull shitter, who hasn't one damn idea of how he's going to run the country, except to say, \"it'll be better\", your one dumb son of a bitch, and your dragging the country into the gutter.","post_message":""}]
