[{"comment_id":"10154618646328812","commenter_b":"Europe will never be the same again thanks to refugees","commenter_a":"Ever notice how politicians insist on framing the narrative?","post_message":"French President François Hollande said today's attack and hostage situation at a church in Normandy was carried out by \"terrorists who claimed allegiance to ISIS.\""},{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"10153984129784497","commenter_b":"Area woman would have crashed car regardless of spider's presence.","commenter_a":"Area woman crashes car trying to get away from spider","post_message":"Report: Spider"},{"comment_id":"10153121748346615","commenter_b":"Ok. Let them run free then","commenter_a":"Start turning in the shooters.... It's that simple","post_message":"A call for peace and justice: Coming up on Channel 11 News at 6, see how dozens of residents in Homewood held a rally to honor lives lost to violence in the city."},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"}]
