[{"comment_id":"10153120906398205","commenter_b":"95percent of the illegal immigrants are hard workers.... So much so that many citizens feel threatened will take their jobs.....i would never be scared if an illegal taking my job......","commenter_a":"Thus is what you spend your time on. Your dedication should be the American people I think your priorities are screwed up. As a congressman you work for the citizens of this country.","post_message":"Central Florida - I'm coming to talk about how to get ready for DACA and DAPA!"},{"comment_id":"10153589265781782","commenter_b":"Honestly I don't care if she kills herself or what she does rot in hell ask forgiveness I don't care but the hurt she caused the family and the pain she caused that sweet innocent baby is my concern that lady is no concern of mine whatever happens to her happens I just pray peace to the parents of a baby that they don't have any more and she is accessory to that !!!","commenter_a":"I don't understand how any one can have sympathy for this lady she killed some ones child are you kidding ...there ain't enough stress in the world to cause you kill someone else's child kill yourself for God sake !!!!!!","post_message":"DAY CARE DEATH: Jonathan Cooper goes through the court documents that say a Noble day care operator, who now faces a murder charge, admits to throwing and dropping a baby last week. @webpagelink"},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"},{"comment_id":"1000554689985003","commenter_b":"I also work in the water industry and watched this guys demonstration. What a bunch of BS on several accounts. First my information comes from the following website: Water Encyclopedia - Ogallala Aquifer. According to this site the average depth of the Aquifer he is referring to is between 60 to 200 feet. Some sections of this Aquifer is over 1000 feet deep. Anyone that understands anything about water understands ground filtration. This particular Aquifer happens to be receiving it's water from snow and rain run off from the Rocky mountains. Fracking or not is very very unlikely to have any effect on the quality of water in his state. True fracking does use water in it's process - untrue it does not simply dump untreated water back into the Aquifer. This guy's demonstration is about as truthful as someone video taping a moose pissing on a snow bank in ...","commenter_a":"yup......and one \"spill\" accidently of course.......stop this madness!","post_message":"It's simple, really. If this is what you're willing to do to the water, you should be willing to drink it. These committee members weren't."},{"comment_id":"974532882587184","commenter_b":"Yeah but what are you going to do about your wife?","commenter_a":"Me too def on the pedophile down low","post_message":"Welcome to this crazy Christian Dad's painfully awkward attempt at sex-ed."},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"}]
