[{"comment_id":"1201018046605718","commenter_b":"Why should I support someone who's two faced and and is only changing her opinion because her PR person told her to","commenter_a":"#freekesha....sexual assault is nothing to start arguments over ...she needs all the support she can get....as a survivor, I'm with you....#standtogether!","post_message":"We can all use our voices and platforms too."},{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father\" Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"\"The five Muslims took hold of me, and they raped me there,\" the church source quoted the daughter as saying. \"I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.'\""},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"},{"comment_id":"10153186374039497","commenter_b":"If only this were all fiction........","commenter_a":"James Tatham. I very much like @username's humour.","post_message":"This Week Last Year:"},{"comment_id":"10156149888525389","commenter_b":"Now they are coming over by sea they are still illegalls","commenter_a":"Oh Great,more people coming in !!","post_message":"A Miami Beach Police spokesperson said it is unknown how long the group were at sea."},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"1743528099240171","commenter_b":"Why did he choose to only visit those living in North Baton Rouge?","commenter_a":"Our great president. A day late and a dollar short","post_message":"We're in Baton Rouge where President Obama is landing to tour the flood-ravaged city after facing criticism for not visiting sooner. (No audio) @webpagelink"}]
