[{"comment_id":"10153596460999486","commenter_b":"She needs to be in prison for it!!!!","commenter_a":"Funny how that works for a lying, cheating,sneaky,and generally lousy human being!!! She needs to apologize to the 4 families for their murder in Benghazi!!!","post_message":"Talk about a flip-flopper..."},{"comment_id":"10153513415174342","commenter_b":"They should serve the same time they kep him as their slave...","commenter_a":"Where are theBLM in this?","post_message":"A doctor and his wife moved from Nigeria to Britain in 1989 and with them came a 13-year-old -- whom they told officials was their son."},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"},{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"},{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"\"The government believes it owns your body.\"  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"10152856815999753","commenter_b":"Lol. A lot of people. A perk of being a sociopath is the ability to manipulate people like butter. She's mentally unstable. The worst they do is put her in a padded room until they believe her meds and treatment are good enough to let her back out in society.","commenter_a":"Smfh.. Good! Let's see who she can manipulate like that behind bars!!! R.I.P.","post_message":"Michelle Carter said all the right things when her friend Conrad committed suicide. She even organized a fundraiser in the teen's name. Then police discovered the texts she had sent him."},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"}]
