[{"comment_id":"10152848525036749","commenter_b":"Happy bday!!!","commenter_a":"Happy Bday!!!","post_message":"Happy birthday to an amazing, inspiring First Lady."},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."},{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"},{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"\"We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,\" said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"10153256663916770","commenter_b":"Another huge waste of tax payer money. There are so many departments in the WH, that do nothing, except, pad their pockets & suck America dry! A big majority of them need to be kicked out!","commenter_a":"Same accountant Obama has. It's just like dropping a billon here and here(like dirty socks).","post_message":"Department of Energy officials might want to take a few more accounting classes after they miscalculated their budgets by a few billion dollars."},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"}]
