[{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "},{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"496937747163472","commenter_b":"Put the hag in prison","commenter_a":"I like that picture of Hilliary, \"hands up, bitch, you're under arrest.","post_message":"New documents released shows incriminating evidence that could put Hillary away for good.  She is a terrorist. We need to act now.  Should Hillary Clinton be arrested for treason?"},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."},{"comment_id":"636847006505878","commenter_b":"who said she was a lady","commenter_a":"She is by far the worst First Lady of all time.","post_message":"What Michelle just said is one of the dumbest things we've ever heard.  This is just absurd. Michelle is moronic and un-American.  Is Michelle the worst First Lady of all time?"}]
