[{"comment_id":"10154243110114228","commenter_b":"I would of peed on that mf","commenter_a":"@username is it wrong that I laughed 😅😂😅😂","post_message":"Wait  it gets worse."},{"comment_id":"10153460771654575","commenter_b":"Ian Gibson watch the video. Youre screwed.","commenter_a":"Lol this is news?","post_message":"What does your birth month reveal about your health?  Researchers who compiled the birthdays and medical records of patients found that people born in May are the healthiest. People born in October might be at the highest risk for contracting diseases."},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"\"I know my role in the justice system.\""},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."}]
