[{"comment_id":"461391564049150","commenter_b":"Well Paid Bitch","commenter_a":"Not surprising, have you listened to her for more than a few minutes? Not impressive to say the least. Where do they find these people?","post_message":"Donald Trump’s national campaign spokeswoman turns out to be a sleazy welfare cheat and conspiracy theorist."},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take \" street drugs\" have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are \"self-medicating\" themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their \"customers\" died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"694571907348646","commenter_b":"Lmao!!! @username","commenter_a":"Josh Wilson Connor Bobthebuilder Bithell","post_message":"Chocolate lovers can't seem to get enough of this nose candy. #MicBrights"}]
