[{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"10153151146755950","commenter_b":"Seriously, can this bitch go away?","commenter_a":"Nope don't believe it","post_message":"During their private meeting, Pope Francis told Kim Davis to stay strong, according to her lawyer."},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"10153137299814060","commenter_b":"NOT OUR BELIEF !!!","commenter_a":"In islam animal or human statue is ban","post_message":"The destruction of ancient statues (some replicas) at the Mosul museum in Iraq, a video of which was released on February 26th, is far from the most heinous crime committed by Islamic State. But the group’s sacking of holy sites and libraries are elements of a broader attack, perpetrated in the name of Islam, on the Middle East’s rich cultural and religious heritage @webpagelink"},{"comment_id":"10154751454678010","commenter_b":"@username --You are a woman, but lady? Highly questionable.","commenter_a":"Aren't \"Indians\" a part of American History, whether or not their story is positive or negative? Why does every damn thing have to be racist? I think your article/argument would have been more effective if you had taken statements by full blooded Indians who are actually offended by this rather than just mention that the mascot and \"red face\" really \"do harm to actual people.\"","post_message":"Cleveland knows its mascot is racist. They removed \"Chief Wahoo\" from their caps at the beginning of the season.   And yet now he's reappeared on baseball's biggest stage.   via Los Angeles Times Opinion"},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality \"a step further.\" He says he will donate $1 million to help in the effort."},{"comment_id":"10155571867589062","commenter_b":"She's a thug communist married to a drug pusher.","commenter_a":"She's a Texan so I can't say anything bad about a fellow Texas gal.","post_message":"Beyonce will be performing tonight at the CMA Awards. Do you think she was a good choice?"}]
