[{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"10154019579790530","commenter_b":"Boot him out immediately! !!","commenter_a":"Tick uh errr.....Rick Snyder has a net worth of $200 million!! I think HE needs to bust his wallet out and help flint. There's no initiative in this case, we all know the pipes need replacing. So do it!! Might as well start because it's going to be a long process.","post_message":"The board unanimously approved a petition stemming from Gov. Snyder’s authorization to move the office dealing with struggling schools..."},{"comment_id":"10153240442411336","commenter_b":"incest with goats gross","commenter_a":"Guys u don't know abt islam, islam is one of the most growing religion. Coz every is's true and stay forever. People why insult 1/3 believers' religion? If again repeat such insult of us ,next time you will get ponish bY MUSLIC ACT.","post_message":"Four Egyptian kids who dared make fun of ISIS in a harmless video are headed for trial along with their teacher on charges of \"insulting Islam.\""},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"}]
