[{"comment_id":"1510101482356438","commenter_b":"Lol that's not even close to what Asexual means.","commenter_a":"Asexual isn't real. Asexual means you reproduce without a partner. Use a different word cause that's not how this word is used in species. Asexual is like a bacteria. You are just without-sexual-wants.","post_message":"\"I fantasize about my future with my partner, achieving a certain level of success in our careers, getting out of debt. Oh, and cake. Don't forget about cake.\""},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"1272631619499754","commenter_b":"There are hundreds of billions of untaxed dollars, probably trillions going to Mexico every year through the boarder in drug profits. An effective wall and boarder security will prevent tons and tons of drugs from coming in, as a result people wont be able to buy as many drugs so the money they would normally be using to buy drugs will be spent on other things that will help the economy. So not only will it prevent drugs from coming in but it will prevent billions from going out to Mexico and that money instead will be cycled through the US economy and taxed every step in the cycle. This wall will also help clean up the drug abuse problem our society has and save many lives to overdose and drug related violence. Not to mention illegal immigrants not paying taxes but also sending their extra money back to Mexico. ...","commenter_a":"LOL..heck he doeesn't even know what he is talking about how can he keep up with himself...just hilarious to watch each day what has changed. Ya know, I think his hairdresser is leaving the bleach on too long and it is affecting his brain..just a thought.","post_message":"As the Trump campaign tries to pitch minority voters, Donald J. Trump's  position on immigration seems to keep changing."},{"comment_id":"1341782245865041","commenter_b":"Wow!!!! Clearly a Muslim traitor...... Like Barry and Michael, maybe they can all room together......Prison 2017 !!!!!!","commenter_a":"\"Farking Nuts\"","post_message":"YES, POLITICIANS HAVE LITERALLY LOST THEIR BRAINS..."},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."}]
