[{"comment_id":"10157286687695093","commenter_b":"The same FBI that said Hillary Clinton was to dumb to be prosecuted? Gmafb dude. I tell you what why don't all of the uneducated whites thank think their better than blacks go, than not only will the crime rate be lower but the racial tension will be too.","commenter_a":"I guess they're gonna condemn violence against police when white folks stand and condemn police violence against blacks. Until then we'll continue to lie to one another.","post_message":"Must-see!"},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"10153430837822061","commenter_b":"beautiful woman","commenter_a":"Beautiful Robin!","post_message":"Robin Roberts looking stunning this afternoon! She's on her way to the red carpet. #Oscars"},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"}]
