[{"comment_id":"990097811101554","commenter_b":"That looks disgusting ðŸ˜±","commenter_a":"@username BONG","post_message":"Not all heroes wear capes. ðŸ”+ðŸŒ­"},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"10153081622630329","commenter_b":"Yeah because all Muslims are terrorists....you absolute dickhead","commenter_a":"I've been saying this for many many years now and this just proves me right. Especially after 911 we should have turned that entire part of the world into a sheet of glass. The women breed them, the kids are trained like them and are used as mercenaries. KILL THEM ALL. There are to many to sort out and sift through to decide who's good and who's not. Point blank end them all.","post_message":""},{"comment_id":"10154770011654330","commenter_b":"Janine Beekman","commenter_a":"Thanks Malloy u duetch bag get out of office u suck !","post_message":"The drug company, Bristol-Myers Squibb, is shutting down several of its facilities, including one in Wallingford. ----> @webpagelink"},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."},{"comment_id":"10153169803431336","commenter_b":"She put her hands on her kid. I would of laid her flat too.","commenter_a":"every single student involved should be place in juvie. If the teacher isn't given justice she should sue the school for a million. no teacher should put up with that kind of sh&& from a parent or students. School's do not give teachers the support they need when the students act like animals","post_message":"Annika McKenzie allegedly put the teacher into a headlock and threw her on the ground. Then, several students reportedly began kicking and punching her while she laid unconscious."},{"comment_id":"10154507187503690","commenter_b":"By expressing these words u r only humiliating blacks,u r suitable pig to work as the puppet of western world to defeat the black pride.how unfortunate u r","commenter_a":"imagine arabs without islam, great scientist, musicians, world class pretty models, sport heroes, legendary actors both male n female but islam brought d vice. without oil plus islam saudi and d rest would have been worst than somalia. I cause the day that rapist dirty war mongering piglet (mohhamed) was born","post_message":"\"Some people skydive, some people race cars, and some people like to fight.\""}]
