[{"comment_id":"10153865845208984","commenter_b":"TRUMP IS A LIAR! TRUMP IS A RACIST! TRUMP IS A BULLY!","commenter_a":"If you watched the last debate Carson was nervous stuttered his responses I just don't think he's hard enough","post_message":"'The Donald' just ripped into his Republican rivals today and revealed the one big reason why he doesn't think Dr. Ben Carson could do the job. Some might agree that he makes a valid point...  Do you think Trump could be right about Carson?"},{"comment_id":"1713306218956490","commenter_b":"Way to go. Ivanic","commenter_a":"If any women want an equal chance in any profession, then Donald Trump is their man for President. He has given women great opportunities in his businesses. He will create many jobs for all Americans","post_message":"Wow, great response!  Ivanka Trump is pure class."},{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"968965946477597","commenter_b":"Because boys can't Nadia.","commenter_a":"BOYS get to MAKE lightning??? All I got to make was BABIES!!","post_message":"Wellllllll, that's disappointing to see. (via The Huffington Post)"},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."},{"comment_id":"10153715026934199","commenter_b":"Yup, tell Alaska pipelines are safe.","commenter_a":"you know, a pipeline is the safest mode of transportation.......","post_message":""},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: \"They are looking for adventure.\""}]
