[{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much \"Southern heritage,\" why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"689912921147432","commenter_b":"The left is aligned with the most pathetic in society!","commenter_a":"Very bad Photoshop ! Are you serious?","post_message":"This is really creepy. Look how close he is?"},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."},{"comment_id":"1775352399350823","commenter_b":"Who would cheat on a woman like Beyonce?","commenter_a":"Ok y'all I admit I'm \"Becky\". J has a wonderful package and I milked it well. Sorry Queen B.","post_message":"Fans claim she is 'Becky with the good hair'"},{"comment_id":"1072932319412282","commenter_b":"#BuildTheWall","commenter_a":"I hear the Train a comin, It's rollin' 'round the bend. And I ain't seen the sunshine Since a Trump win. I'm stuck in Obama's nightmare, And I just want to be free. But the TrumpTrain keeps a rollin' Down to Washington, DC. I bet there are voters, eating in dining cars, They're probably cheering and smoking big cigars. I know Obama had it coming, I voted for hm and can't be free. But the train keeps a movin' And that's what tortures me. Watching the TrumpTrain Rollin' down to Washington, DC.","post_message":"Join us in Indianapolis at 4 pm today for a major announcement!   RSVP here: @webpagelink"}]
