[{"comment_id":"10154325825161051","commenter_b":"Um I think this woman is a incredibly ignorant idiot, you can see anything in everything if you are looking for it. It is just a design of lines, what a dumbass","commenter_a":"If it offended you dont buy it.What's wrong with these cry babys","post_message":"Here's the Walgreens wrapping paper that had this lady outraged."},{"comment_id":"1016517215129884","commenter_b":"@username why is she disgusting? It was a slap in the face. Hillary is supporting criminals.","commenter_a":"Yeah kind of a huge slap in the face! I like what sheriff David Clark said...it's a convention for the compassion of criminals...DISGUSTING!","post_message":"\"To have [Michael Brown's mother] come speak... is a travesty. It is a slap in the face of law enforcement.\"  Moments ago on \"The Kelly File,\" Kevin Jackson slammed the Democratic Party for featuring Michael Brown's mother at the convention. @webpagelink"},{"comment_id":"10156599267875354","commenter_b":"She had him boxed. I think maybe she used to play college basketball. lol","commenter_a":"Did someone get schlonged?","post_message":"You have to WATCH it..."},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"1805645433016457","commenter_b":"Congress stop her","commenter_a":"Hell Yes she's a racist traitor and one ugly Ass HE SHE or whatever it is.","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"10153717162272708","commenter_b":"No we don't have to solve the worlds problems with money we do not have. If you were a refugee from America, which countries would take you in and give you benefits FOR LIFE? Which countries would require nothing of you as a citizen of their country once they took you in??? Those refugees get better benefits than anyone who is from here would ever get......why? Because their government could care less about them so we have to save everyone from everywhere......just because. Just because they won't care about their own people.....just because we have endless tax dollars to support them all. Nope.","commenter_a":"Saying we can't take refugees is saying you don't have compassion, as humans we have to find away","post_message":"We won’t be able to take more refugees. It’s not that we aren’t compassionate. But we can’t. There’s no way to background check them. SIGN IF YOU AGREE!"}]
