[{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10154572108529087","commenter_b":"She should put on her fake Indian outfit on.","commenter_a":"WARREN IS A BRAIN DEAD DUMBACRAT !!!","post_message":"Elizabeth Warren: \"Congress must pull its head out of the sand and launch a real, bipartisan, transparent inquiry into Russia. Our national security is at stake.\""},{"comment_id":"1028820693878107","commenter_b":"Same maturity level as kindergarteners.","commenter_a":"Republicans should allow weapons at their convention. ..loaded weapons. ..that would make a great pay for view","post_message":"Worst idea ever."},{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"772199822829043","commenter_b":"Don't give in!!!! Let the threaten a lawsuit then tell the idiot atheist to go home & leave his town alone!","commenter_a":"Leave","post_message":"‘It’s very surprising that one guy can come from out of state and start all this’"},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""}]
