[{"comment_id":"506081702885118","commenter_b":"Fuck you too. Bitch ass gringo","commenter_a":"Im mexican and even i say fuck mexico.","post_message":"\"When you're in danger, they're the last people you think to go to.\""},{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":" need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."},{"comment_id":"1308080519212956","commenter_b":"What's up with all this refugee hate going around? \"They're brown and muslim!! I hate em! They're animals! MURICA!!\"","commenter_a":"Until the refugees find it and start using it as there public restroom","post_message":""},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"10153372391166509","commenter_b":"Chris? Am I? Interesting. Here I thought I was just pointing out the facts! :)","commenter_a":"Gotta love Global Warming!","post_message":"It's so cold, #NiagaraFalls froze. Photographers were drawn to the breathtaking icy formations: @webpagelink via CNN iReport"},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY \"CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: \"Tonight we close one chapter in history and we begin another.\" Watch complete speech here: @webpagelink"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"}]
