[{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"\"Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,\" said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"10154207452564916","commenter_b":"Ever hear of Independents? You know, 45% of the voters.","commenter_a":"And just where are all you threatening to leave the Dem party going to go? Good luck with that one.","post_message":""},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"10154165693441748","commenter_b":"wanker","commenter_a":"Was it this way? @webpagelink","post_message":"lol"},{"comment_id":"1099042766785437","commenter_b":"Glad she got her life back by killing another person. Ain't life grand!!","commenter_a":"You make me ashamed to be a woman, disgusting","post_message":"She got her life back at the expense of another."},{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"596204130539541","commenter_b":"@username I think most people are okay with accepting refugees. PROVIDED, that they become members of the country they decide to make home. Non of this lets make Sharia law zones like back home bollocks. How do you separate the good from bad? Only allow families in? That hardly sounds fair. Just be aware that when you accept them in you accept responsibility for them. Anyone raped. Any bars burned down. Any cartoonists shot. You are responsible for those by knowingly understanding some of the bad is coming with those who need your countries protection.","commenter_a":"The assumption that these guys are all refugees is really telling. *Open your eyes a bit, these fuckers are homegrown. Isis is betting on you hating and attacking refugees to add fuel to their fire. You're all being played.","post_message":"Some experts say it's only a matter of time before the heart of the European Union sees tragedy."}]
