[{"comment_id":"10153302071591051","commenter_b":"Sick bitch","commenter_a":"Make him a her!!!!","post_message":"First he raped a 10-year-old. Then he left her something to remember him by."},{"comment_id":"1518093821534153","commenter_b":"Cindi Marcum then why do you ppl think that muslims have the right to travel to the u.s. and and park their lazy asses here, mooch off of us and kill at will while trying to enforce their barbaric ways of life on us....hmmmm?","commenter_a":"So if it's in the rights of the protesters to block a road where does my rights to travel freely fit into that agenda so I can say get to work , seek medical attention or buy food , ect","post_message":"Wow! Talk about fear mongering!?"},{"comment_id":"10153824514356336","commenter_b":"Yeah, build a wall. That'll do...uh ABSOLUTELY NOTHING.","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."},{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"}]
