[{"comment_id":"2108841499340180","commenter_b":"VICTORY FOR TRUMP ! . .FEDERAL PEN FOR THE LYIN' QUEEN !","commenter_a":"Save your money,this election will not be bought","post_message":"Nigerian billionaire Gilbert Chagoury pledged one BILLION dollars to Hillary and Bill Clinton's Foundation. That's billion--with a \"b.\"   Now why would a Nigerian oligarch with a past like his do such a thing?"},{"comment_id":"1079209208779497","commenter_b":"She got them takin away bc of her psychological problems","commenter_a":"Run, mom, run. I was involved in a custody battle with my ex who had money and guess what? I lost!!","post_message":"Hillsborough Sheriff's detectives are asking for the public's help locating two missing twin girls who are believed to be with their biological mother who just lost custody of the girls."},{"comment_id":"595817020606725","commenter_b":"Excellent point!","commenter_a":"If the Hillary Clinton fans were so well-educated, then tell me why they are turning out in Mass numbers to destroy property, assault their fellow Americans, and anyone who doesn't share their beliefs. My guess is that most of these people don't work and probably didn't even vote. If that's your following Hillary, I am so so very glad that you lost.","post_message":"I believe Spiderman once said that a “tree is known by it’s fruit” and “wisdom is vindicated by it’s children.”  No, wait… that wasn’t Spiderman. It was Jesus."},{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"10154398090436523","commenter_b":"She loves abortions. Of course her mother chose life for her. Lol","commenter_a":"Just look who they are and what their purpose is. This is just Evil and Horrendous!","post_message":"WATCH: Women's March on Washington, D.C."},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"}]
