[{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10153197187718132","commenter_b":"The other woman is nuts and seriously needs to commit herself. She's making a bad name for herself doing stupid things like billing other children.","commenter_a":"Both parents failed here!! Poor kids.","post_message":"This is serious business."},{"comment_id":"1119477664770356","commenter_b":"Who needs to pay for the wall .? Ya want it ya pay for it . Smh","commenter_a":"You Goooo Mr Trump. .i am outraged over Fox ex prez of Mexico, how dare he tell us Americans what is best for our country, I can't wait for you to be our president, ..i can't wait until they pay for that wall, and you as our president, will make it happen, from houston texas along with myself and 8 family members will be voting for the next president v Donald Trump. .God bless you and your family,","post_message":"What I would do on my first day in office. #MakeAmericaGreatAgain  Text TRUMP to 88022 to join the #TrumpTrain"},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"500607250129855","commenter_b":"Smoke them if you got them, probably can get the best shit.","commenter_a":"This right wing crap. I am right of the right and this is crap","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"}]
