[{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"1776189505982322","commenter_b":"dumb blonde","commenter_a":"You can't act like a 10 year old threatening to nuke someone if you don't get your way -- that's what Trump would do. Donald Trump doesn't have the temperament, the intelligence or the conscience to have these codes.#imwithher","post_message":"Republicans agree: We can't give Donald Trump control of our nuclear codes."},{"comment_id":"10153744436512894","commenter_b":"Her weaves be the worst. .lol","commenter_a":"Wish them all blessing in life , hope God,s in the equation","post_message":"Pregnant Blac Chyna Goes Glam to Film Upcoming Reality TV Show -- See Her Latest Look!"},{"comment_id":"1171676779558735","commenter_b":"What couples?Floyd has a harem of women like this in Vegas!!","commenter_a":"these celebrity couples are getting ridiculous.........i can understand the attraction to cash but at least try to hide it...","post_message":"Floyd Mayweather is dating a 19-year-old New Look sales assistant from the West Midlands."},{"comment_id":"10157270600175389","commenter_b":"Wow... she sure lost her dreadlocks for her 10 minutes on Hannity didn't she!","commenter_a":"Love how she went from braids to foxy diva afro overnight. That's all I got from her. Yawn.","post_message":"\"I don't believe in any cause that takes innocent lives, regardless of what that cause is.\"  Former Miss Alabama Kalyn Chapman James, who referred to the Dallas shooter as a \"martyr\" in a now-viral video, said she believes Micah Johnson thought he was dying for a cause, but was \"evil.\""},{"comment_id":"10155618787016002","commenter_b":"Only if you are a pussy","commenter_a":"I thought dodge ball was thought to be bullying.....","post_message":"Note to self: Don't play dodgeball with softball pitchers."}]
