[{"comment_id":"10153147899391636","commenter_b":"the womans a simpleton","commenter_a":"And MPs should be treated like....... ?","post_message":"What do you think of Kerry McCarthy's comments?"},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"\"[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.\"  Gov. Mike Huckabee joined Howard Kurtz on \"MediaBuzz\" today to react to the GOP presidential nominee \"softening\" his tone on immigration. @webpagelink"},{"comment_id":"10152878332246130","commenter_b":"It's always the ugly women throwing shade. This chick has a light-bulb-shaped alien head. #haveseveralseats","commenter_a":"She should never have apologized for anything.","post_message":"We're still cringing."},{"comment_id":"218545795283614","commenter_b":"Children in poor areas should not be doomed to poor schools.","commenter_a":"Yes, The GOP has lost every bit of self-respect they ever had. To vote Betsy DeVos in as education secretary with no educational experience is just irrational. If Betsy were smart she would decline the office and get the hell out of town now. She will not survive as educational secretary.","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153054490024877","commenter_b":"This woman proclaims her ignorance every time she opens her mouth. She would do better to be seen and not heard.","commenter_a":"This thing has no soul. Fox News is her God & it dictate that,she say the most outlandished comments.There is a special place in hell for her. #Judgement day is coming soon.","post_message":"Ann Coulter on black protestors: Haven’t we done ‘Enough’ to make up for slavery? And that's just the beginning of what she has to say.   Grio fam, this video clip is controversial to say the least. Check it out and sound off below!"}]
