[{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."},{"comment_id":"1392674554144410","commenter_b":"I assume Soros is paying for all the protests! The Koch brothers provide jobs!","commenter_a":"As Gomer Pyle would say....surprise, surprise surprise! Busted yet again. The little boy who cries wolf......","post_message":"We just found out who the REAL face of the Women's March is... see the funder who's pulling the strings.  Sadly, we should have seen this one coming."},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"},{"comment_id":"10156778240410354","commenter_b":"If he can't handle her, Hillary will make him her bitch. The bitch Trump. Has a ring to it.","commenter_a":"Enough of FOX NEWS \"debates\", Time to vote, enough of Rubios super pac trying to make him look good","post_message":"But the campaign's stated reason for the decision may be different than one might expect..."},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."},{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."}]
