[{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."},{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10153718263126028","commenter_b":"So they take a class to prove they're old enough to safely operate a vehicle that had the potential to kill themselves and other and its ok. But they also learn about the dangers of smoking and drinking at age 13 (give or take a year) in mandatory health class yet can't smoke or drink till 18(now 21) and 21? The logic is just weird.","commenter_a":"Why is it that we don't let people smoke till 18 and drink till 21(both of which mainly affect their own health) yet we trust teenagers as young as 15 and a half to drive a vehicle with the potential to kill others? Seems a little backwards doesn't it? Saving people from themselves but not saving them from others.","post_message":"The smoking age in California is now 21. @webpagelink"},{"comment_id":"1201199053280181","commenter_b":"For them girls that gotta get from one dick to the next real quick😭😭😂","commenter_a":"Rebecca oh lawwwd no😭😂","post_message":" "},{"comment_id":"10153862268256680","commenter_b":"@username I was waiting for Hillary to pass out again and need to get dragged off stage. Maybe next debate!","commenter_a":"He wasn't great we can admit that but he just needs to show he can sit in the chair and he more than did that!","post_message":"Donald J. Trump is used to audiences that are already primed and ready, unlike the debate crowd."},{"comment_id":"10154392449762235","commenter_b":"Having a \"break down \"?","commenter_a":"Suicide by cop! The young man didn't comply from the beginning. The young man also shouted \"I hate my life\". It's a shame but you have to comply with the law. It is sad though. \"JUST DO WHAT THE COPS SAY\"!","post_message":"Dylan Noble’s mother has filed a wrongful-death claim against the police department."},{"comment_id":"10153198594904342","commenter_b":"Really!!! Fix the F***** System. And make her suffer for what she did. Why let her out?","commenter_a":"If that's the case, then let her go 3 or 4 days w/o food. Just give her nothing but Water, and/Gatorade/Powerade. The Human Body can go 3 or 4 days without food; just not Liquids. The Human Body, can run off it's Reserves, If We have Excess weight, don't worry. You'll only feel hungry for a little while, then whenever Our Body's stop growling; that means, that your Body will start Eating off it's reserves.","post_message":"A story working on for Eyewitness News today -- a Houston mother is facing multiple charges on allegations of child abuse.  Investigators say her son  \"like a prisoner of war who had been starved.\"   @webpagelink"}]
