[{"comment_id":"927123483991626","commenter_b":"Oprah is a racist","commenter_a":"Yes !!","post_message":"Oprah threatens anyone who opposes Obama.  Get that liberal trash off of TV.  Do you think Oprah is the racist?"},{"comment_id":"1641330872574045","commenter_b":"His payment for the presidency","commenter_a":"I just love hearing you babies cry. 8 years of total bullshit from your man Obama, and we never rioted, burned down neighborhoods, dressed up as vaginas and marched (like a bunch of embarassing idiots), destroy businesses, drag old men out of their cars to beat the shit out of them for an Obama sticker, and the list of shame goes on. Trump hasn't been president for 90 damn days and you crybabies are already curled up in the fetal position, sucking your thumbs, squealing and kicking like little piglets. You guys make me smile real big. You're the biggest pile of disrespectful pussies on the planet! Suck it up buttercups, TRUMP IS YOUR PRESIDENT! AND GOD BLESS DONALD TRUMP!","post_message":"This isn't a joke."},{"comment_id":"1518865864832838","commenter_b":"No but he does plan to get rid of illegals. Anyone coming I to our country will respect our laws AND FOLLOW THEM!!","commenter_a":"Hollywood has never been right about anything in politics!","post_message":"Another Communist making a fortune on capitalism..."},{"comment_id":"10154248174893734","commenter_b":"build the wall with trump under it","commenter_a":"TRUMP 2016..","post_message":"Do you agree or disagree with Donald Trump's speech at the Rolling Thunder motorcycle rally today?"},{"comment_id":"10153919372908352","commenter_b":"A REAL MESS..WOW","commenter_a":"Macho","post_message":"‘I feel like a princess!': Transgender teen crowned homecoming queen at Missouri high school"},{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10153288794126336","commenter_b":"we do love blonde women with breast enhancements and tight dresses , you nasty girl","commenter_a":"on fox news war on women","post_message":"Memorial Day originally honored soldiers from which American war?  How well do you know your #MemorialDay history? Take this quiz with FOX & Friends Weekend! #ProudAmerican"}]
