[{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"913998228643418","commenter_b":"As if inflation isn't a tax increase unto itself. Total money grubbers...","commenter_a":"The present gas tax money, originally intended to maintain or build our roads is not being used exclusively for that purpose. If it was we'd know exactly how much money we need to do this job","post_message":"The nation’s gas tax will be raised to 30 cents per gallon and increase at pace with inflation if a bipartisan group of House lawmakers get their way in seeking funding for a new transportation bill. @webpagelink"},{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."},{"comment_id":"1212963008739156","commenter_b":"Will you force women to wear less since less is \"liberating\"? What gives you the right to choose for anyone? What's next? Fat people can't wear bathing suits? Pretty girls have to wear short skirts? No one... NO ONE has the right to decide what someone wears. Change laws to promote freedom. Let them choose. Don't choose for them. Clothing doesn't oppress any more than guns shoot people. People oppress. Change that.","commenter_a":"It oppresses women. Before everyone says it's s their religion, it was taught to them by a man. And yes all religions use other ways to oppress women that should stop as well. I always find it odd that people champion the right form them to \"choose \" what oppression the want to follow.","post_message":"A new country is debating banning burqas."},{"comment_id":"10153373131878352","commenter_b":"How about us mothers teach our daughters how to take care of themselves and to love their own skin. A little girl will look to her mother for what a woman is and how to act. When you are body obsessed, your daughter will pick up on it. If you're working out, eating decent, and taking care of yourself, she'll pick up on that also.","commenter_a":"The stretch marks are redic. She looks like a Plane Jane. I'll go ahead and keep buying Barbies for my little girl if this is the only other option. Healthy self image starts at home, not the toy store. A for effort, C- for the execution. Please go back to the drawing board.","post_message":"She’s got stretch marks, brown hair and a fuller figure… now Anti-Barbie fashion doll Lammily stars in ad tackling women’s obsession with the perfect bikini body"},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"}]
