[{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""},{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"579381068889728","commenter_b":"BUILD THAT WALL AROUND TRUMP","commenter_a":"#BUILDTHATWALL","post_message":"Donald J. Trump joins supporters in chanting, \"Build that wall!\""},{"comment_id":"10153727923344153","commenter_b":"Leave them where they are at!!! Fix their country!!! Build camps at their country, protect their country and teach them to protect themselves against their issues as we still have to learn to deal with ours and protect our people and shelter our vets and homeless and dude in 30 more years I better have my social security I put into that pot religiously for me not for them !!!!!!!","commenter_a":"I still feel the same way : JUST SAY NO TO SYRIAN \"MIGRANTS!!!!\"","post_message":"Has your opinion on taking in Syrian refugees changed since the Paris attacks?"},{"comment_id":"1324679534258458","commenter_b":"The women who aren't giving it up are defending her.","commenter_a":"She might be asexual.","post_message":"'I love my husband ... I just don't want to have sex with him'"},{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."}]
