[{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."},{"comment_id":"10152647217041680","commenter_b":"Oh no!!! Millions of jobs added with deficits cut by more than half!!! Stop the tyranny!!!! #TeaPartyFail","commenter_a":"Only 679 days left of Scum Monkey Rule.","post_message":"German Foreign Minister Frank-Walter Steinmeier was reacting to a letter signed by 47 Senate Republicans warning Iran that any nuclear deal it strikes with Barack Obama will be non-binding and easily undone. @webpagelink"},{"comment_id":"1017475884956418","commenter_b":"And bruce will NEVER be a woman!!","commenter_a":"How about this we let kids be kids and not put labels on everything until they're old enough to know what it means","post_message":"\"We believe all students deserve respect... regardless of their gender identity.\""},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10153882229389062","commenter_b":"Man she looks like a man!","commenter_a":"I don't think she got the memo.","post_message":"The 6 officers charged in Freddie Gray's death have been released on bail @webpagelink"},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"}]
