[{"comment_id":"705344102952475","commenter_b":"@username, I'm no fool and I'm with her. Run along, jump back into your basket and go away...","commenter_a":"No matter what your kinds of words against Hillary we will not listen to you.This is solid Blue.","post_message":"\"There were trans people all over the country who were so excited that we could get gender identification papers that reflected who we really are … that is something that Hillary Clinton has done.\" —Laverne Cox"},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""},{"comment_id":"10153503112318812","commenter_b":"Stephanie is a dumbass.","commenter_a":"STAGED!","post_message":"UPDATE: Dallas police: Sniper shot driver who opened fire on officers from armored van; unable to say whether he was killed: abcn.ws/1KNBxWA"},{"comment_id":"10152917753321051","commenter_b":"The bitch cussing in the background should not be near kids!","commenter_a":"Good for you two to look out for that child! She shouldn't be near any children! !!!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10153720250674877","commenter_b":"And then his white gf walks in the video shot. Lmao","commenter_a":"He's a confused brother. I'm sad for him","post_message":"Black cop’s pro-Trump, anti-protester video goes viral: I felt safe with Trump fans!  Grio fam, what do you think of what he has to say? Would you feel safe at one of these rallies?  Share your thoughts below."},{"comment_id":"1777981479109906","commenter_b":"Karma will catch this hag","commenter_a":"Vote her out !!!!!","post_message":"This Florida prosecutor tried 77 kids as adults in a year  65 of them were black.  #MicBrights"},{"comment_id":"1059645677404171","commenter_b":"Stop her","commenter_a":"Pero que no fueron capaces de pararlo...","post_message":"LIVE NOW: Police chase in Long Beach, CA."}]
