[{"comment_id":"10153279474011680","commenter_b":"She's fat","commenter_a":"Hot daughter, John","post_message":"The daughter of Sen. John McCain, who picked Sarah Palin to be his running mate in 2008, said she was specifically pained because of Donald J. Trump's past remarks about her father's prisoner-of-war status in the Vietnam War."},{"comment_id":"1039059936190258","commenter_b":"That's not what Margaret said, and the fact that you think it was is a pretty clear indication of how little you understand about this and comparable situations, Pat.","commenter_a":"Answering for dead soldiers is abusive? If she can't handle this she's absolutely not fit for president.","post_message":"\"Republicans are squandering millions of taxpayer dollars on this abusive effort to derail Secretary Clinton's presidential campaign.\" - Rep. Elijah Cummings"},{"comment_id":"10153412850346519","commenter_b":"Oh, honey, sweetie, bless your little heart. #Derp #LowInformationVoter #UsefulIdiot","commenter_a":"It's time our tax dollars worked for us instead of the Koch's and their ilk.","post_message":"Free rides are a solution, not a problem..."},{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"},{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"10154538085533812","commenter_b":"\"You gotta take them out\"...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as \"obsolete.\""},{"comment_id":"10154239643734411","commenter_b":"Evil Bitch","commenter_a":"That last one killed me, oh man","post_message":""}]
