[{"comment_id":"1132859160143668","commenter_b":"Ian, Trump has also excepted money from the Saudi's, ad a matter of fact, he owes them for a billion dollar hotel project in the UAE. So....please.","commenter_a":"I'm no trump supporter but things like this are just bias non stories. I'm sure if we went through each candidates individual supporters we could find a long list of unsavory people who believe and do unsavory things.","post_message":"The young, black protester was being escorted out at the time of the incident."},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is \"too old.\""},{"comment_id":"932842660117117","commenter_b":"wait so confused why that chick pushed her lol","commenter_a":"Sydney Robles","post_message":"Meanwhile In New Jersey"},{"comment_id":"787320821458495","commenter_b":"F $(; Muslims!!!!","commenter_a":"Fuck Muslims","post_message":"A&E Tells Duck Dynasty To Cut ‘Jesus’ From Prayers To Avoid Offending... We live in a nation with it's foundation built on Christianity. Can we get 30,000 'LIKES' for Duck Dynasty's faith?"},{"comment_id":"1279992562041213","commenter_b":"Notice how he always gets phone calls telling him he's doing great...","commenter_a":"Your headlines are as misleading as the mainstream media...","post_message":"After how much Trump has frustrated America these last few months, it’s great to see the tables turned."},{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"}]
