[{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"1045921455457754","commenter_b":"Thank you for being a voice for many of us.","commenter_a":"Martha (stupid) Stewart did a lot less than what shrilary Clinton has done and she went to prison !!! What is this crazy world comming to? EVERY BODY KNOWS she is GUILTY as SIN!!!:-(:-(:-(","post_message":">> Sign the petition and tell the DOJ Hillary isn't above the law: @webpagelink  Today the FBI announced Hillary Clinton violated classified procedures, carelessly and recklessly endangered national security - and had done so repeatedly, over 100 times.   The FBI then announced she would face no charges. This is an outrage and the rule of law has been turned upside down.  This weekend, we learned former President Clinton met with the Obama Administration Attorney general - the FBI director's boss - in private.   Three days later the FBI director announces no charges are being brought against Hillary Clinton.  The appearance is terrible. The decision is astounding. People have gone to jail for less severe breaches of classified information and national security.    Today Director Comey and the Obama Administration Department of Justice made it clear to the American people, and all those being unfairly prosecuted by the DOJ, that there is no accountability, no justice, and the Clintons are allowed to live by a different set of rules.   This is a loss for the rule of law and further degrades Americans' faith in the justice system."},{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"915027651932695","commenter_b":"Yes","commenter_a":"YES!","post_message":"Follow us for more at BuzzKix"},{"comment_id":"931492536967525","commenter_b":"Lying BITCH...who only worries about her bank acct....NOT...American LIVES. She can't even control her Husband. Good thing he keeps Monica handy.","commenter_a":"Liar","post_message":"ClashDaily.com"},{"comment_id":"10153117989439342","commenter_b":"Stfu","commenter_a":"Why is this breaking news??? So what!! You glorify more sin than good!! Tell the world about Jesus!! Stop caressing this foolishness like its normal! I see why God clearly warned us not to be of this world!!","post_message":"The first image of Caitlyn Jenner, formerly known as Bruce, has been released by Vanity Fair magazine --> @webpagelink"},{"comment_id":"765077356935066","commenter_b":"Gef mir.","commenter_a":"Amen term limits","post_message":"Bernie Sanders is 73, Joe Biden is 72, Chuck Grassley is 81, Barbara Boxer is 74, Nancy Pelosi is 74, Harry Reid is 75, John McCain is 78, Diane Feinstein is 81. Mitch McConnell is 72, Orrin Hatch is 80, Richard Shelby is 79, Carl Levin is 79, Jim Inhofe is 79, Pat Roberts is 78, Barbara Miklski is 77, Jay Rockefeller is 76, Thad Cochran is 76, Tom Harkin is 74, Patrick Leahy is 73, Lamar Alexander is 73,  Bill Nelson is 71.Charles B. Rangel is 83. In the last 30 years, the number of Senators in the Senate for 20 years or more has tripled. Senility and seniority are not serving us well. (some are now older than listed)  The 50 richest Congressmen and women reported a minimum net worth of at least $7.4 million in 2013, Roll Call discovered in it's review. That represents a steep increase from the $6.7 million benchmark set in 2012.  Wealthiest Members of Congress.  California Rep. Darrell Issa (R): $357.25M  Texas Rep. Mike McCaul (R): $117.54M   Maryland Rep. John Delaney (D): $111.92M   West Virginia Sen. Jay Rockefeller (D): $108.05M  Virginia Sen. Mark Warner (D): $95.13M  Colorado Rep. Jared Polis (D): $73.56M  Connecticut Sen. Richard Blumenthal (D): $62.06M  California Rep. Scott Peters (D):$45.04M  California Sen. Dianne Feinstein (D):$43.72M  Washington Rep. Susan DelBene (D): $37.89M  Florida Rep. Vern Buchanan (R): $37.15M  Maine Rep. Chellie Pingree (D): $34.47M  California Rep. Gary Miller (R): $32.97M  California Rep. Nancy Pelosi (D): $29.11M  Ohio Rep. James Renacci (R): $28.08M  Texas Rep. Roger Willams (R): $28.01M  Florida Rep. Alan Grayson (D): $26.18M  New York Rep. Chris Collins (R): $22.50M  New Jersey Rep. Rodney Frelinghuyson (R): $22.21M  Tennessee Rep. Diane Black (R): $21.24M  Massachusetts Rep. Joseph Kennedy III (D): $20M  Idaho Sen. Jim Risch (R): $19.24  Tennessee Sen. Bob Corker (R): $19.12M  Missouri Sen. Claire McCaskill (D): $18.38M  Wisconsin Rep. Tom Petri (R): $15.64M  New York Rep. Richard Hanna (R): $15.3M  Arizona Sen. John McCain (R): $15.17M  North Dakota Sen. John Hoeven (R): $15.16M  Florida Rep. Curt Clawson (R): $13.53M  Wisconsin Rep: Ron Johnson (R): $13.52M  Wisconsin Rep. Jim Sensenbrenner (R): $13.04M  Kentucky Sen. Mitch McConnell (R): $11.97M  Iowa Sen. Tom Harkin (D): $11.85M  Illinois Brad Schneider (D): $11.71M  Texas Rep. Lloyd Doggett (D): $11.51M  Tennessee Rep. Jim Cooper (D): $11.51M  New York Rep. Nita Lowey (D): $11.48M  Virginia Rep. Scott Rigell, (R): $11.29M  Arizona Rep. Trent Franks (R): $11.01M  California Rep. John Campbell (R): $10.21M  North Carolina Sen. Kay Hagen (D): $9.12M  Louisiana Rep. John Fleming (R): $9.06M  Georgia Sen. Johnny Isakson (R): $8.93M  Georgia Rep. Tom Price (R): $8.87M  Ohio Sen. Rob Portman (R): $8.60M  Pennsylvania Rep. Mike Kelly (R): $8.51M  Texas Rep. Kenny Marchant (R): $8.13M  New York Rep.Carolyn Maloney (D): $7.73M  New Mexico Rep. Steve Pearce (R): $7.72M  Florida Rep. Tom Rooney (R): $7.47M  Source: Roll Call"}]
