[{"comment_id":"1596643573967911","commenter_b":"She is a liar and should be behind bars!","commenter_a":"#Sethrich","post_message":"WATCH LIVE: Hillary Clinton reveals economic plan in Michigan — how will it differ from Donald J. Trump's?"},{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"},{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"},{"comment_id":"10152755752215950","commenter_b":"White kids who grow in the same exact environment would most likely participate in these activities, just like black kids who grow up in the same environment as snotty white kids will most likely also be snotty kids. We're all a reflection of our environments, we do as we see we do as we are taught!","commenter_a":"This is a social problem not a race issue..","post_message":"Police say a large group of high school students swarmed a gas station and beat a man who was reportedly helping an older woman to her car."},{"comment_id":"10153236038721336","commenter_b":"See this is what I mean, we know this guy is a terrorist. He admits so on TV and trains other MUSLIMS the most effective ways to be a terrorist. Why is he allowed to walk the streets? We need a force not answerable to normal athority that can move in on MUSLIM terrorist like this without constraints and not having to watch them for 10 years then wait a week after they attack to make an arrest. Get the job done and move on to the next one.","commenter_a":"Why giving your air time to this evil, wicked man","post_message":"Imam Choudary: \"The United States of America are the champions of murdering innocent people!\"  Muhammad contest organizer Pamela Geller: \"[We're] the champions of freedom, sir!\""},{"comment_id":"10152955984226130","commenter_b":"Lesbians STINK","commenter_a":"The image of God is both male and female and is reflected in a godly union between male and female where the creative power of God, His life-giving, His self-giving and His moral nature are perfectly expressed. This is only possible in a heterosexual union. When God created a partner for Adam He created Eve—not another Adam. This means that perfect partnership requires some level of difference as well as a level of similarity so great that Adam could cry out loudly, ”This is now bone of my bones and flesh of my flesh”. Sexual intimacy between a man and a woman is the normal method of male/female bonding (emotionally and physically) because it corresponds to the design of our bodies and because it is the normal means by which offspring are created. If God had intended the human race to be fulfilled through both heterosexual and homosexual marriage, He ...","post_message":"“As long as anti-gay legislation exists in any state, I strongly believe big events such as the Final Four and Super Bowl should not be held in those states’ cities.”"},{"comment_id":"933293890039082","commenter_b":"And any criminal will just turn in their guns! Like they do in Chicago and California!","commenter_a":"Clinton is so clueless!! This isn't about gun control bitch. This is about Obama allowing Muslims to come here knowing the repercussion of this. They were making IED'S in their garage you stupid fuck Clinton. Better start putting a ban on IED'S. Now all these Syrians Obama? Your the terrorist and the democrats are all equally guilty for putting you in and backing you. Come get my guns. You will get them no problem there but you won't be walking away. Black lives matter and Muslims are all terrorist.","post_message":"Wasting no time..."}]
