[{"comment_id":"10154442937338690","commenter_b":"@username sunni Arabs do not deserve a state.","commenter_a":"Since Iraq invasion, the people have only seen bloodshed, division and their oil is stolen. I guess, this is what 'divide and conquer' looks like!","post_message":"More than 200 people were killed in Iraq's capital, Baghdad, in a suicide bombing attack claimed by ISIL"},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"1816579521955760","commenter_b":"@username please explain since you are, \"so sure\". Provide facts. Also, a bit of advice folks, just because you believe it doesn't mean it's true.","commenter_a":"No matter the outcome, people who voted for him and constantly protect him with ignorant comments, will just keep saying \"we won, we won\". They aren't exactly sure what they won since their candidate keeps back peddling on his entire platform. They'll just know that they won. We all lost. Ignorance, racism, labels, anger, and an immature person won.","post_message":"Computer scientists spot voting irregularities in swing states two weeks on from Trump's election."},{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"},{"comment_id":"1334233936596633","commenter_b":"The wall goes up. No more cowardly Muslims in the White House. We've had enough","commenter_a":"Go ahead and lock up the nomination. It's irrelevant. There isn't going to be a Republican in the White House next year.","post_message":"Today's vote could decide whether Donald J. Trump will lock up the nomination outright."},{"comment_id":"660818097425993","commenter_b":"She needs to get Raped to change her opinion. stupid bitch.","commenter_a":"She is a disgusting, lying hag! If she can lie to children, she's a special kind of \"she-demon!\"","post_message":"This is just disgraceful."},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."}]
