[{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"},{"comment_id":"1783246305275728","commenter_b":"@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said \"All White people are Racists\". Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"\"People shouldn't turn it into something negative,\" says one mum whose son dressed up as 'Black Pete' for a parade."},{"comment_id":"10155082864963690","commenter_b":"India and rape can't seem to stop. :(","commenter_a":"indian armies ..............thuuuuuuuuu........","post_message":"\"Victims gave the names of the policemen involved in the barbarity - but nothing has happened.\""},{"comment_id":"1223870594319795","commenter_b":"What if he might win this time","commenter_a":"I honestly feel if Bernie and Jill teamed up they could win and the world would definitely be a better place. This needs to happen badly!","post_message":"Here's the Guardian article everyone is asking about.  Please read my clarifying statement about our offer to Bernie Sanders: @webpagelink"},{"comment_id":"967810213254438","commenter_b":"Phony bitch","commenter_a":"Good new Ian you can now give blood from your arm instead of your B-hole. Joe Mark and @username can give you a ride","post_message":"There's still a lot of controversy around this."}]
