[{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"},{"comment_id":"693806690773834","commenter_b":"Women should be prosscuted!","commenter_a":"I think this is where the word HOG WASH, came to be.... just saying...","post_message":"How rotten this administration is to the core when the attorney general takes the fifth to avoid incrimination!"},{"comment_id":"10152972323790950","commenter_b":"Sick bastards!!!!","commenter_a":"For now...I am going to let this investigation work itself out for evidentiary findings. Meanwhile, I choose to hive him the benefit of the doubt. Such is the way we were taught in college.","post_message":"BREAKING: Subway spokesman Jared Fogle is a suspect in a child porn probe, a law enforcement source says."},{"comment_id":"1700572513518601","commenter_b":"Wow,that cat was terrified when he seen this woman..","commenter_a":"@username i told you not to go there lol","post_message":"WHOA! That moment a rare Florida panther flies by you on your nature walk...#FloridaLife  STORY: @webpagelink"},{"comment_id":"10153968798483352","commenter_b":"Nasty bitch","commenter_a":"What!?","post_message":"Escort madam reveals in explosive tell-all book how University of Louisville basketball team ‘paid her $10K for 22 sex parties’ with troupe of strippers including three of her own daughters"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""}]
