[{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"},{"comment_id":"931492536967525","commenter_b":"Lying BITCH...who only worries about her bank acct....NOT...American LIVES. She can't even control her Husband. Good thing he keeps Monica handy.","commenter_a":"Liar","post_message":"ClashDaily.com"},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"10153200495384411","commenter_b":"leave the fukers there ,revoke their passports","commenter_a":"They weren't British....","post_message":""},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"\"I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.\" —Hillary"}]
