[{"comment_id":"10153462081617452","commenter_b":"Get a life lady!!","commenter_a":"She should be FIRED ...","post_message":"\"You're saying I can't have a hairstyle because of your culture? Why?\"  San Francisco State University is investigating a confrontation between a black student and a white student over dreadlocks."},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"853431768039181","commenter_b":"I notice that there were over 5,000 views I'm sure with the government controlled internet that is about 5,700 over raided so like no one cares.... BUT more scandals and more lies... she will be just like obama,,, she wants to take your right's away just like obama... and she will win by the votes of all the illegals that MUSLIM obama let in..","commenter_a":"Scandal after scandal after scandal from the early years until now. No wonder 57% of all of American's find her untrustworthy !!! The other 43% are Liberal morons.","post_message":"New York Times reporter Maggie Haberman says that Hillary Clinton looked “very defensive” answering questions."},{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"1758000121104260","commenter_b":"It doesn't take a week to get your citizenship, however there is help to those who can't afford the fees.","commenter_a":"What is wrong w ppl this country is about FREEDOM I don't agree w trump but that doesn't mean I will hurt or disrespect anyone that does..","post_message":"WATCH: Trump rally riots - supporters attacked by a mob of protesters at a rally in California."},{"comment_id":"1714145238857650","commenter_b":"@username pull your head out of your buttocks. 99% of the terrorist are Muslim. Hillary wants to open up the flood gates so they can just stroll on in. Terrorism will be coming to America with them. Wake stupid!","commenter_a":"How about we stop all these moronic memes and make sure everyone is registered to vote, so he doesn't get elected!","post_message":"LOL! It's hard to disagree.  Image by Occupy Democrats, LIKE our page for more."}]
