[{"comment_id":"10153434092834586","commenter_b":"First let's remove these beautiful creatures from these ugly hateful humans, then hook them up to the carriages to earn money. Ugly people with ugly hearts. Disrespectful pos.","commenter_a":"Its not fun for the poor horses","post_message":"This is what happens when you voice concern for injured carriage horses in #NYC.   What kind of person could do this?! #BanHorseCarriages"},{"comment_id":"10154023438494486","commenter_b":"WHERE IS HILLARY? SHE SHOULD BE THERE, SHE WOULD HAVE GIVE HIM A BIG HUG OR A BIG KISS.....LMAO","commenter_a":"I don't think Obama was trying to shake his hand. it was almost like he tried to put his arm around Castro's shoulder and Castro stopped him or something. It was weird.","post_message":"Be careful! That's his THROWING ARM"},{"comment_id":"10154392449762235","commenter_b":"Having a \"break down \"?","commenter_a":"Suicide by cop! The young man didn't comply from the beginning. The young man also shouted \"I hate my life\". It's a shame but you have to comply with the law. It is sad though. \"JUST DO WHAT THE COPS SAY\"!","post_message":"Dylan Noble’s mother has filed a wrongful-death claim against the police department."},{"comment_id":"10153652189710530","commenter_b":"Save the geese. Ban airplanes.","commenter_a":"Doug smith- what are they going to do? They can potentially set fire to a blanketed horse causing severe burns or death. It's all fun until it's one of your loved pets. Caroline Torr This horse was in a field when a Chinese lantern landed on top of the horse's blanket and set the horse on fire! Chinese lantern may look amazing when let off but do you know where yours lands after you have seen it fly away??? What do u think happens to the wire frame of the lantern? The ban of Chinese lanterns needs to happen and can't come fast enough for me!!","post_message":"Should there be exceptions to Canton's sky lantern ban?"},{"comment_id":"1311800738876452","commenter_b":"IN YOUR DREAMS !!! #DontBoo #VoteHillary #NastyWomenVote","commenter_a":"Trump will become the next President. I'm saying this because I analysed their horoscope from an astrological point of view.","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"10153170406841770","commenter_b":"I SAY MERRY CHRISTMAS And Happy Easter !! NO MORE REFUGEES ! THE PEOPLE NEED TO BE REMINDED THAT FDR AND CARTER DID WHAT TRUMP IS SUGGESTING ! THE PEOPLE NEED TO HELP DONALD J TRUMP [ MAKE AMERICA SAFE AND GREAT AGAIN ] VOTE FOR AMERICA ! ABOLISH ALL GUN FREE ZONES AND ESTABLISH A NATIONAL RECOGNIZED CONCEALED CARRY ! NEVER FORGET WHAT THE DEMislamOCRAPS AND obuma HAVE DONE AND ARE TRYING TO DO TO AMERICA ! PASS IT ON !","commenter_a":"Saying a specific group of people matter above others is highly racist and prejudicial.","post_message":"Black Lives Matter protesters are filling the streets of Chicago Wednesday, blocking traffic and disrupting the city to protest police actions relating to the death of 17-year-old Laquan McDonald."}]
