[{"comment_id":"10153389397913352","commenter_b":"This women is a rachett ass lier! What a waste of space on my news feed, ya girl aint tellin the truth boo","commenter_a":"So weed paralyzes now sheesh isn't this story bullshit hahahah lmfao weed cures not kills or \"paralyzes\"","post_message":"Mother says her daughter, 17, has been left PARALYZED by a pot brownie she bought from a classmate at high school"},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"1754592891449959","commenter_b":"@username totally 💞","commenter_a":"@username 💖👻💖","post_message":"It's literally the most magical thing of all time, Harry Potter fans."},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."}]
