[{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities \"in protest\". Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. \"Be the change that you wish to see in this this world.\" This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance \"to divide Americans by promoting the Black Panthers and her antipolice message.\"  Do you agree?"},{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"1282583651782104","commenter_b":"People are starting to pee on the streets, into fountains, garbage cans, on car tires, between parked cars, the state is stinking like a outhouse what if confused people take to shitting between parked cars?????","commenter_a":"If you go in the bathroom with my daughter I will.","post_message":"These people are literally threatening murder on a public forum."},{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: \"I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.\" @webpagelink"}]
