[{"comment_id":"973103659397159","commenter_b":"Those girls have shallow, ugly, pugnacious souls. All that effort they put into making their hair into rat's nests would have been better spent reading something other than grocery store gossip rags.","commenter_a":"It's really frightening to see, how intolerant and religiously fanatic people can be. I can't see any difference between Christian or Islamic fundamentalism. Both are as dangerous and frightening. It's really sad, that people will believe more in something people has written ages ago, instead of in the scientific facts we have nowadays, and that they will judge people according to some moral standards from the Middle East (by the way the same moral standards as in Islam), instead of thinking for themselves. And before anyone says the Bible is God's word, show me ONE sentence that is written by God, or Jesus, or even anyone living at the same time as Jesus. There is no such sentence.","post_message":"George Takei says it right. Let's \"kick the ick\" out of our public discourse!"},{"comment_id":"10154366000234166","commenter_b":"Idiots. Careless. I will be glad to raise the baby.","commenter_a":"Betsy Carver ..unreal","post_message":"Police said neighbors found the toddler outside in 96-degree weather with no water. He was screaming, crying, and trying to get inside."},{"comment_id":"10153981290586519","commenter_b":"@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of \"them\" after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"1095553313863196","commenter_b":"How many men has she had in how long?","commenter_a":"Find a new girl who really love you.Don\"t be sad.","post_message":"It's over!"},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."}]
