[{"comment_id":"10156269605955354","commenter_b":"This is so illegal and so disrespectful of those who have risked all for this country. Illegals are invaders.","commenter_a":"Another reason to leave this GD socialist state!","post_message":"It's starting."},{"comment_id":"10153896668671990","commenter_b":"She need the flowjob","commenter_a":"Why didn't this happen to my poll areas","post_message":"Two women, naked from the chest up, bust into a Manhattan polling station early Tuesday, shouting:  of our polls Trump, out of our polls Trump! Donald Trump was expected to show up later to cast a vote himself.  Our reporter Mark Matthews was in the basement of PS 59. @webpagelink"},{"comment_id":"1077262612359760","commenter_b":"She is just nasty.","commenter_a":"That's how classy the liberals are.","post_message":"Today in 2015: Rosie O’Donnell: “I’d Like to Take My Period Blood and Smear It All Over [Pro-Life People’s] Faces”"},{"comment_id":"1755557531334252","commenter_b":"I love how the racist cunt doesn't realize Africa isn't a country lol","commenter_a":"Good. GTFOut. Go to Africa where it's guaranteed you'll have a black president. This half white didn't work out so well.Alec baldwin made the same statement. Liberals whine and cry when they don't get their way. About time to unleash that Trump ttain.","post_message":"\"The View\" host Raven Symone says she's leaving America if a Republican becomes president. Will you miss her?"},{"comment_id":"10154478058311320","commenter_b":"She needs to be fired.","commenter_a":"Angela Russo","post_message":"Shameful...  are going to have to take me off the line, because I am not serving that.  And that was how a uniformed police officer was treated at Noodles & Company when she was denied service. @webpagelink"},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"}]
