[{"comment_id":"1605375073100237","commenter_b":"Fuck him and his family. Good job lady and sorry you had to as nobody wants to kill someone. But they will kill, torture, and rape you. Good you were armed. God bless you.","commenter_a":"Why do we allow people like this to contribute to the GENE POOL? His whole family should be spaded and or neutered. Why because of IDIOTIC lines like \"he needed money for clothes\" what happen to all the government hand outs this family was getting, cause sure as shit they all were on welfare and not one ever held a job. As to whether or not it was the home owners fault is by far the most asinine thing ever spoken.","post_message":"This teen punk broke into a woman's home and tried to rob her. But she defended herself, and left him dead.  Now the punk's family is asking an absolutely sickening question, that left the woman and her friends shocked.  Only in Obama's America..."},{"comment_id":"10155230776483690","commenter_b":"Hahaha we cn kill u indian pigs","commenter_a":"They can kill only innocents, not terrorists. Pigs.","post_message":"In less than 24 hours after Pakistan's deadliest attack in more than two years, the army kills more than 100 \"terrorists\"."},{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an \"ape in heels\" has been fired for good."},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"},{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? \"Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.\" Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"10157731504125354","commenter_b":"why are our prisons full of illegal aliens who have broken the law? why don't we deport them? why? why? why?","commenter_a":"She should be held personally liable.... but she won't.","post_message":"So many acts of love..."},{"comment_id":"10150640777899999","commenter_b":"Did she send that message on her illegal server?","commenter_a":"Donald Trump- the gift that keeps on giving. Signed Hillary Clinton","post_message":"Donald J. Trump promoted tweets that called Megyn Kelly a “bimbo” and that said she “bombed” as a debate moderator."}]
