[{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"},{"comment_id":"10153966537634714","commenter_b":"yeah i shut the bathoom door is consdered polite","commenter_a":"He said disgusting then you have no heart. You are not a lovable person.","post_message":"The quote has not been disputed by Donald J. Trump’s camp."},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"583735078458513","commenter_b":"Mike( @username) what makes these kinds of statements so hateful and racist in that it taxing the ancestors of one group for the actions of the ancestors of another group. The probabilities are just as likely that your ancestors dies freeing the slaves or were not even in America in the mid 1800's or that fella demanding the free $ had relatives that sold the Africans to the slavetraders. That's how it was done. Africans selling other Africans to the traders. Throughout history all groups and races enslaved each other. Many believe the pyramids were built by slaves under the direction of African Masters. Let's try it Dr King's way by judging people by their character not color. That chip on ones shoulder can get quite heavy!","commenter_a":"No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"10153684689187061","commenter_b":"MariaNconnor Evans","commenter_a":"I work saturdays....","post_message":"The feeling when you realize tomorrow is Friday...   -- CLICK TO PLAY GIF --"},{"comment_id":"1121252964608432","commenter_b":"Shouldn't he be taking on Hillary??? Just another dumb ass between the choice of two dumb asses","commenter_a":"Acting just like hillary","post_message":"Politics."}]
