[{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."},{"comment_id":"10154562004884749","commenter_b":"How do you know it's a woman. Would she/he submit to a dope test?","commenter_a":"So she wears a body suit and that makes her special. I think not.","post_message":"She didn't win her race, but she did make history."},{"comment_id":"1720336911319665","commenter_b":"@username ....but she can't stay out of the politics, can she?","commenter_a":"Fake awards made fake news today with the known results by the presenter Warren Beatty, admitting \"I KNEW WHO WON (in this super secret ballot), SO I WAS PUZZELED WHY IT WASN'T LA LA LAND\". Just like Hillarys victory, she won until reality stepped up and slapped her in the face.","post_message":"La La Land producer Jordan Horowitz has been praised for his handling of the epic #Oscars fail."},{"comment_id":"10153588597752042","commenter_b":"Its not indecent exposure. Breasts arent genitals and they are legal in ny. Also its 2015, so if they ban toplessness in nyc or just the times square section, men jogging around topless or wearing loose tanktops showing nipples should be banned as well. Its the same body part. As a matter of fact men in beach should wear something to cover their bare chests as well. Its only fair to women.","commenter_a":"Nope! First Amendment vs. Decency! The problem was old-styled Garbage at Times Square, that problem was solved by then-Mayor Giuliani in late 1990s. DeBlasio was too socialist today!","post_message":"NO MORE NUDITY: After several calls of criticism about topless, body painted women in Times Square, a Bronx politician has introduced legislation to ban toplessness across New York. Do you think this should be passed?"},{"comment_id":"601311203355417","commenter_b":"What a dumb bitch","commenter_a":"I know lets get someone to shoot at her then we can see if she is right","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s.  This is the most ridiculous thing I've ever heard.  Are you offended by this?"}]
