[{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"10154928634761320","commenter_b":"Classy","commenter_a":"drop dead.","post_message":"Happy Birthday to Secretary of State John Kerry.  He turns 73 today."},{"comment_id":"10153619360488132","commenter_b":"Your not a father!!!","commenter_a":"Jennifer Ramirez","post_message":"It was a very happy Father's Day for Caitlyn Jenner."},{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."}]
