[{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"10155843646665354","commenter_b":"OBAMA AND HILLARY CLINTON SHOULD BE IN PRISON !","commenter_a":"Impeach this judge- geez - the real traitor to this nation is in the WH- impeach his sorry ass","post_message":"\"Judges recuse themselves all the time.\"  Bonus: by attacking this judge, left-wing gay activists will be declaring war on a local NAACP chapter..."},{"comment_id":"1394774427201577","commenter_b":"She shouldn't even have a job because she is an illegal alien.","commenter_a":"Frank tokar maybe if you were in her parents situation would do the same , you do anything to make sure sure your children are safe and have the best you can give them , USA is a líder no a low un respectful selfish heartless country thanks god no every American think that way USA is a country of opportunities no one takes your jobs away all depends on you how hard you work .","post_message":"Rick Santorum and Anna Navarro engage in a passionate exchange with a DREAMer who says she may lose her career if the new administration ends DACA. @webpagelink"},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"1018381961551666","commenter_b":"Monthly periids dont count woman. Come up with another strategy","commenter_a":"Yeah.... you've got such a stellar record from Benghazi, who wouldn't want to go into battle at your direction?","post_message":"We can defeat global terrorism—but only if we don’t let fear drive our response."},{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."}]
