[{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"},{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"868576086513962","commenter_b":"My mako 10 rounder has never feed a full magazine flawlessly","commenter_a":"I think we shouldn't have to do this, there shouldn't be a magazine restriction","post_message":"What do you think about this?"},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"10153542134849753","commenter_b":"She needs to get away from his crazy abusive ass!","commenter_a":"Lmfao fuck her and he a dick for doing it","post_message":"A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"},{"comment_id":"367714146750213","commenter_b":"To win a war you have to call it war and fight it like a war.","commenter_a":"But Obama or any of his staff was there , how come ??","post_message":"More than 1 million people are marching in Paris to protest against Islamic terrorists"},{"comment_id":"1155392447817135","commenter_b":"Since she can't take the heat she gets out of the debate. (Kitchen).","commenter_a":"She knows she has already taken both sides of every topic. There's simply nothing left to lie about.","post_message":"Would Clinton benefit from another debate with Sanders?   She doesn't think so."}]
