[{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."},{"comment_id":"10150836955014999","commenter_b":"there is nothing more damaging to black community than RACISM!","commenter_a":"There is nothing more damaging to the Black community that the BLM movement. By defining racism and things like \"cultural appropriation\" as the reasons for failure of African Americans to succeed fundamentally points to solutions in the wrong place. If tomorrow, every last vestige of racism were lifted in society, would Blacks suddenly be elevated? No. The cultural deficit of the Black community is the key. Lack of educational attainment, intact families, communities with massive violence, lack of role models all are the key reasons for failure. These problems may stem from historic racism but they are not solved by eliminating racism today. So, when the BLM movement focuses on racism they are actually focusing in on the wrong items. Lifting small racists issues without fixing the basic cultural failings will do nothing. In 10 years, we may have few elements of racism left and a black community with problems ...","post_message":"\" ‘You’re free,’ they keep telling us. But she would’ve been alive if she hadn’t acted so … free.' \""},{"comment_id":"1538992396141613","commenter_b":"Are these women able to drive their car alone?","commenter_a":"Sorry, I may sound ignorant of the culture, but these women appear to be upper class, mostly because they speak English well, they are educated. I wonder what life is like for poor Muslim women, if their freedoms are the same?","post_message":"These Muslim women are calling out stereotypes, throwing out labels, and asking others to see them as people first and foremost. (via Bustle with more info at u.pw/1qv4Eb0)"},{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."},{"comment_id":"877271008975026","commenter_b":"Preach my man. Preach.","commenter_a":"If you actually listen to what he's saying he explains everything and the reasoning why he was doing what he was doing. Maybe not the barrel roll but everything else is explained. The reason why he told those kids to get down was because they ran and were evading the police. I didn't see how that went down but he at least it to them and did not physically harm those kids. He used physical aggression on the girl yes, but multiple times he told them to leave...they didn't so he made an explain by trying to arrest the loud mouth that couldn't shut up and walk away. She resisted arrest and he forcefully tried placing her on the ground multiple times, where she continued to resist arrest and then for some reason it seems like the in thing to do today for young teenagers and college aged students but ...","post_message":"Here's why Officer Eric Casebolt's barrel roll is worthy of your attention..."},{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."}]
