[{"comment_id":"10153595833422439","commenter_b":"@username - stop them in their tracks? When? So far we've done nothing and the media's not reporting on stuff as ordered by our gay muslim prez! Meanwhile he's flying hundreds of thousands more in and setting up cells all over our Country. Trey Gowdy tried to stop it in SC and the planes and buses keep coming and dumping them.","commenter_a":"I don't think the muslims fully understand that the American people will unite and stop them in there track. God Bless America","post_message":"Coming to America. It’s just a matter of time. The only difference between Islam in Europe and Islam in America is we started importing whole Muslim communities a lot later than Europe. But we are on the same path to ruin."},{"comment_id":"760057160777731","commenter_b":"Kick her off the force","commenter_a":"She should be sacked for that .How are Americans letting there country , that there relatives fought for .Letting this happen . You are been invaded ,don't you see this . They are Attacking you on your land ,they burn your flag and disrespect your ways ,I never thought Americans would stand for this .Has Obama destroyed America .","post_message":"Here's Islam in action, again. @webpagelink"},{"comment_id":"862770227128920","commenter_b":"Ted Cruz loves our country Hilary hates our country and all true Americans!! I would never vote for her or any Dem.","commenter_a":"Yes!","post_message":""},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."},{"comment_id":"10154355156798812","commenter_b":"Yea these are the very perverted people that will claim to be transgender to gain access into bathrooms...","commenter_a":"The list of perverts who video people in bathrooms is long and does not just stop at Target! My local Old Navy had a perv filming a young girl while she was in a dressing room--her mother caught him in the act. These are not transgenders. These are simply perverted people! I am safer in a restroom with a transgender than I am with \"straight\" people! Transgenders are NOT peeping toms! If men dressing as women and claiming they are transgendered to assault little girls in bathrooms, then maybe there needs to be an anti-creepy men bill, not anti-LGBT bills, targeting Transgenders.","post_message":"Protesters inside North Carolina's statehouse staged symbolic sit-ins outside the offices of top legislative leaders."},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10156253683750594","commenter_b":"Tickets better get cheaper!","commenter_a":"He got too confident and thought maybe too good and should have stayed a little more humble and kept his head down in his work. But the whole team was over hyped these last two seasons","post_message":"Just three years ago, Colin Kaepernick was considered the prototype for the quarterback of the future."}]
