[{"comment_id":"10153608158096336","commenter_b":"Takes all kinds of a--holes to make up this world and he/she is certainly the biggest one!!!","commenter_a":"Why is this getting news? It's not mandatory to tip. If you don't get good service you don't tip. Shut up, stop whining and do right by the next customer.","post_message":"A Rutgers University student who is waiting tables at a Jersey Shore restaurant this summer to help put herself through school was given no tip on a $112.03 bill and instead a taunting message."},{"comment_id":"10154231827133797","commenter_b":"How you like them bad apples","commenter_a":"So all of you WANT another war? The Obama hate is getting really old. Let me guess. Your all republican wealthy suburban mini van driving ,entitled Starbucks drinking pricks. I like how you alllll forget Bush's presidency. By far the worst president. Ever.","post_message":"OBAMA ADDRESSES PARIS ATTACKS: President Barack Obama says putting large numbers of U.S. troops on the ground to combat the threat from the Islamic State would be \"a mistake.\""},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"1731115690475220","commenter_b":"She should just go NOW!!!","commenter_a":"Another nut.","post_message":"Barbara Streissand says she's joining Al Sharpton and leaving the country if Donald Trump becomes president. Would you miss them?"},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10155895547455354","commenter_b":"Prayer's for his family and the woman that survived this crime. Where is the FBI, the commander in chief & brother Sharpton?","commenter_a":"There are no words for this outrageous act of hate. Hope they find the black sons of britches that caused this. Praying for the family......GOD BLESS YOU","post_message":"The other person in the car, who survived the wreck, says it wasn't an accident..."},{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."}]
