[{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."}]
