[{"comment_id":"10152945892703855","commenter_b":"Quit being such a pussy.","commenter_a":"Sigh, more attacks on a man having an opinion and not actually insulting anyone. Give up. I guess you can go back to endorsing Prep.","post_message":"We all get it from time to time."},{"comment_id":"1562229620730818","commenter_b":"Whoopi needs to zip her mouth too!!!","commenter_a":"About time","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  \"I told you stop feeding that dog human food,\" the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"10153589847823984","commenter_b":"I'll help her pack to get the hell out of America! What a twit...","commenter_a":"If she is on welfare take her check and benefits away. Then make her do community service cleaning the toliets in a national park.","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"10153964489889024","commenter_b":"FRICKING POS","commenter_a":"This is more truth than what comes out of his mouth","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"864626500338540","commenter_b":"God says we must forgive the ones who ask forgiveness. We all make mistakes nobody is perfect. Mr Trump for you to come forward God sees and forgives you! I pray that everyone sees and not to judge it was very wrong what Mr Trump said. God sees his heart remember Saul who did horrible things. God forgiven him and turned him into Paul! Pray for America that our country changes for the better. Pray for our new President that he is on the right path makes the right decisions! We must pray for Mr Trump to show the women that he will help them in every way! For our children to have God back into schools no more hate but love one another in Jesus name!","commenter_a":"Who believes her empty words?","post_message":"On Donald J. Trump's campaign website, Melania Trump released a statement addressing her husband's controversial comments from 2005."}]
