[{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"\"The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."},{"comment_id":"10153454337713984","commenter_b":"BITCH","commenter_a":"Garbage! They want us to kidos their feetj!","post_message":"This incident has led to calls for a boycott of United Airlines, but not everyone is jumping on board...  Do you think this airline attendant acted fairly?"},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"10153589057371615","commenter_b":"Yep I had a friend who took kick boxing classes 2x a week and she was in her late 60's ! Don't underestimate a woman nomatter how old 😋","commenter_a":"Ya I'm sure she was really able to get her leg high enough to kick you","post_message":"An 80-year-old Penn Township woman is accused of crashing her convertible while drunk … then kicking an officer in the groin while being placed in a patrol vehicle."}]
