[{"comment_id":"957861980892726","commenter_b":"Allowed, not aloud. Here, not hear. You're, not your. Go back to school, Linda.","commenter_a":"No one should be aloud in this country without being vaccinated period! No matter if you lived hear your whole life or your just coming in. Unless there is a medical reason it's just common sense.The risk of spreading these diseases is too high.","post_message":"The current measles outbreaks sweeping the country are the fault, at least partly, of Barack Obama lax illegal immigration practices, according to former Johns Hopkins neurosurgeon and possible 2016 GOP presidential candidate Dr. Ben Carson.   Read more at @webpagelink"},{"comment_id":"807667145998560","commenter_b":"Dumb bitch cant spell","commenter_a":"Because she wanted to be an arrogant*** brat instead of following simple orders","post_message":"\"How did switching lanes turn into all of this?\""},{"comment_id":"10153219350514486","commenter_b":"She should EAT SHIT AND DIE !","commenter_a":"Should have been the day after she was elected","post_message":"Now that Harry Reid has announced his retirement, some Democrats think it time for Pelosi to do the same..."},{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."},{"comment_id":"1222586881085915","commenter_b":"I can't believe a woman would even consider voting for Trump unless they are Transgender.","commenter_a":"It's pretty obvious that TRUMP will be President --- and I can't wait -- Hillary would be a disaster ---No one can say that TRUMP would be worse than Obama or Hillary --- Remember don't listen to polls or media -- they are just media bias--- TRUMP TRAIN all the way to DC ---- Don't forget to VOTE in the remaining Primaries","post_message":"An honor to receive the support from golfing legend, Jack Nicklaus. I will defeat Crooked Hillary Clinton in November, and we will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10153083416063984","commenter_b":"Stoopidbitch","commenter_a":"Doesn't it just make you proud?","post_message":"Obama will not meet with Israeli Prime Minister Benjamin Netanyahu, but he'll meet with these 3 YouTube sensations? Priorities..."},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."}]
