[{"comment_id":"10153289142823984","commenter_b":"I had high hopes .........what a big disappointment to all Americans so sad............","commenter_a":"Yes, start the impeachment procedures NOW!","post_message":"This might be Obama's biggest miscalculation yet, and it's going to cost him dearly.  Should this get Obama impeached?"},{"comment_id":"234297206973807","commenter_b":"I can't stand this woman. She makes me sick","commenter_a":"Lying bitch","post_message":"Kellyanne Conway just took \"alternative facts\" to a whole new level by mentioning a massacre that never happened."},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""},{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"10153308747171037","commenter_b":"Failing to report 1,100 donations and $145 million in donations isn't sinister. It's just a small bookkeeping error. This is how totally out of touch this moron and his wife are.","commenter_a":"And, I did not have sexual relations with that lady, Miss Lewinski.","post_message":"Former President Bill Clinton used his first interview since Hillary Clinton announced her 2016 campaign to address questions about the Clinton Foundation - by Dylan Stableford in Yahoo Politics."}]
