[{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1823991571155225","commenter_b":"Wrong.","commenter_a":"Obama and the Democrats rescued the country from the worst economic disaster in our lifetime, while being obstructed at every turn by the very same Republicans who created the financial disaster.","post_message":"President Obama's Legacy?"},{"comment_id":"1667152256905944","commenter_b":"Why do we have this question. If they are illegal the only right is to be fed on their plane ride back home. On the other hand I have the right to protect my family, land and myself from these criminals. If they have kids then they have a choice, leave with the kid or leave without the kid and never see him or her again. All connections to the child will be erased from our records so you can't track them.","commenter_a":"They are NOT U.S. Citizens, so they shouldn't be allowed to vote.","post_message":"I agree!"},{"comment_id":"10154377682500575","commenter_b":"She is done. She knows that she can't beat Trump. So she is play the frail feel sorry for me tactic. She is no good for our Country she hates American citizens she hates minority's she is only after fame and fortune from crooked dealings. Drop out of the race Hillary save yourself the embarrassment of getting your ass beat in a landslide.","commenter_a":"What attack in minnasota n when","post_message":"Get this poor tired woman to bed! Hillary looks like she's going to pass out after speech in DC and bombs in New York."},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."},{"comment_id":"880035775457816","commenter_b":"Some of the women who have become men have beards ,tattoos and 6 packs. Do people really want them to still use ladies toilets?","commenter_a":"This is not a presidential issue","post_message":"WATCH: Donald J. Trump addressed the recent fight over transgender use of public bathrooms, and whether he'd add separate facilities at his Trump properties."},{"comment_id":"10154286339391756","commenter_b":"We pay nine (right now, eight) people to say \"no\" to that type of demagogic gasbaggery.","commenter_a":"It's a consistent source of amazement to me that he does not understand that if, heaven forbid, he somehow manages to become President, he cannot just unilaterally change/enact/dismantle any law he chooses. He and his equally terrifying supporters might want to learn how this all actually works.","post_message":"\"What we don't have in this country is a tradition of punitive actions trying to silence speech,\" says one D.C.-based attorney."}]
