[{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10153307893053352","commenter_b":"They both should quit. There should be a black woman on the panel discussion.","commenter_a":"Kelly your the best always classy","post_message":"Kelly Osbourne Threatens to Quit ‘Fashion Police’ Over Rancic’s Racist Remark on Friend Zendaya"},{"comment_id":"871266669599749","commenter_b":"Liars lie","commenter_a":"It's odd how no one in the comments section mentions the fact he was beaten over and over again. Good one, anglosaxon humanity!","post_message":"'We're gonna teach you about great American sex'"},{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: \"Tonight, while the results are still not known, it looks like we are in a virtual tie.\" Full video here: @webpagelink #IAcaucus #IowaToday"},{"comment_id":"10153623182969714","commenter_b":"Misspelled here.....lol","commenter_a":"Ouch! Whitney Karp","post_message":"Talk about a teachable moment."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"579741315536254","commenter_b":"How is she a bigot? Because you disagree with her. She is speaking the truth. I don't like her method. She be out in front of the building doing this, not in the store.","commenter_a":"Biggest bigot I've seen so far. Who died and made her thee Almighty?","post_message":"The woman, a mother of 12, screams throughout the video and says that she wouldn't spend a penny at Target because of what she calls their \"wicked practice.\""}]
