[{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"494289207428326","commenter_b":"I'm surprised the husband let her swim at all.","commenter_a":"Our Country our way of life. DON'T TREAD ON ME!!","post_message":"Two Muslim women wore their 'burkinis' to the pool and then something amazing happened.  Awesome. Muslim immigrants need to assimilate or leave.  Do you agree Muslims need to abide by our laws?"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"10153234666538188","commenter_b":"Who is the idiot who decided on this He or she must be a pervert can't wait to see little girls or boys pull down their pants","commenter_a":"What is this country becoming ? I don't recognize it!!!!","post_message":"I just got back from San Diego. Incase you need the restroom you are greeted with this sign.   Welcome to the new normal."},{"comment_id":"981459371894535","commenter_b":"We need more proof than just being a female. gee","commenter_a":"This proves we need a female president !","post_message":"Justice Sonia Sotomayor cornered the conservative justices on the court by framing the Obamacare case as one of federalism vs states rights."}]
