[{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"},{"comment_id":"451917294996564","commenter_b":"As far as I know, no Subway in America has made this kind of change.","commenter_a":"So how many muslims vs AMERICANS are there in the U.S. that needs changes. REALLY?","post_message":"Should we boycott Subway?"},{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"731507293614546","commenter_b":"DUMBASSES...HAVE TO KILL THINGS...HUMANS ARE FUCKED UP.","commenter_a":"He should have drug it up on the shore and smashed it's head in with a boat oar. The only thing a fish like that is good for, is seriously limiting the population of other fish in it's habitat. You can't even eat a fish like that, you could try but I wouldn't advise it. #Conservation #BottomFeeders","post_message":"Surprised?"},{"comment_id":"10153421158184726","commenter_b":"The Confederates nearly destroyed the United States!! They were slave owners and rouges! You lost the war now get over it and burn the damn flag!!!!","commenter_a":"The subject of slavery needs to be relegated to history books and musems right along with the battle flag of the Confederacy. I sick of hearing in about slavery, let's talk about dinosaurs -they don't exist either.!!!","post_message":"WATCH: Rand Paul: It's Time to Put the Confederate Flag in a Museum... Do you agree with Paul?"},{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."}]
