[{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"10153184330157507","commenter_b":"Two people committing to care for each other for life serves society and is why government encourages it through 1100+ rights, privileges and responsibilities. If you think it's a hypocritical institution, the solution is simple. Stay out of it.","commenter_a":"Marriage is hypocrisy. The \"Government\" should have no part what so ever in it.","post_message":"That time Fox News forgot to reprogram Shep Smith"},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"1088416937887089","commenter_b":"The bill won't pass....however, illegals vote any way. There are organizations who are illegally registering them. Absentee ballots are also one of their goals.","commenter_a":"The American people doesn't want this law to pass..it is unfair to the American people! !!!! They dont pay taxes and most doesn't even speak English. ..They dont have a right to vote....And they shouldn't get any kind of welfare either....","post_message":"THE PARTY OF CRIMINALS: New Bill To Give Illegals Right To Vote!  Do you agree Illegals have NO rights, especially voting rights!?   @webpagelink"},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."},{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"952491891550656","commenter_b":"It's CA...go figure...N CA that is which is even worse","commenter_a":"Too bad there is not a \"Dislike\" button","post_message":"JUSTICE."}]
