[{"comment_id":"872299812875772","commenter_b":"Hillary is spreading disgust. She's a shameless, pathological liar with no morals at all.","commenter_a":"She is a complete idiot as well as a liar.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"734144593405526","commenter_b":"Yes","commenter_a":"Yes.","post_message":""},{"comment_id":"10154342764073701","commenter_b":"Listen to yourselves! Stop just stop! Do you realize that YOU are part of the problem?","commenter_a":"People, they are donating money to people in need. That's it! Why is everyone in such a hurry to provoke anger. Myself I feel all that needs to be said is, Thank you Disney!","post_message":"Disney announced it's donating $1 million to a fund set up to help those affected by the attack at Pulse nightclub in #Orlando."},{"comment_id":"1694209280599095","commenter_b":"Illegal aliens have to register for the draft as do green card holders and U.S. citizens or immigrants who are born male and have changed their gender to female! You want to see a run for the border, get a good skirmish started in NK and use a military draft to man it, you'll see the mad rush to leave the U.S. by freebie wanters.","commenter_a":"And \" The last person that wants to play the nuclear card...is me. But you can never take cards off the table \" - Donald Trump -","post_message":"\"America's commitments to defending our allies remain iron clad.\""},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"883740348483208","commenter_b":"Where are you FBI Ophry openly threatening to Murder White's. Do your duty and arrest her. Where did she get all her Million's from. She is a Racist herself.","commenter_a":"You mean all Blacks are full of hate for Whites including you get your facts straight from one generation to the next on and on forever it is taught to HATE all WHITES","post_message":"Do you think Oprah is a bigot?"},{"comment_id":"1059213794114079","commenter_b":"You look like my next door neighbor. No seriously! My next door neighbor wears a hijab. She's one of the sweetest people we know. Even brought us cookies for Christmas!","commenter_a":"Islam is the best","post_message":"She stood up in an incredible way."}]
