[{"comment_id":"10153889787166337","commenter_b":"This sucks this is such a good show","commenter_a":"Not happy! Love the show! Can they not find a replacement for Molly? Your messing with my Monday and I don't like Supergirl.","post_message":"CANCELED? Sad news for Melissa McCarthy and Mike & Molly fans..."},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"\"I don't have a clue,\" said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"\"She should get an award from them as the founder of ISIS,\" Trump said Wednesday."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"}]
