[{"comment_id":"1052361568153705","commenter_b":"A lot of people who follow this page will probably chuckle at this... But those are actually two very evil women you see picture there.","commenter_a":"#Hillary2016","post_message":"Hillary and Cecile Richards sat down with Refinery29 and talked about everything from “mansplaining” to the future of abortion rights."},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"933345140100891","commenter_b":"Linda Farrell, do you really think that the lying millionaire has a clue or even care about our struggles? Putting her in office gives 4 more years of Obama , open borders and 65,000 more refugees in our country! It's called NEW WORLD ORDER look it up! I'll take the skittles and America the way it was! And yes I am women TRUMP 2016","commenter_a":"Hell no","post_message":"Do you want to see the Trumps become America's next First Family?"},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"\"...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.\""},{"comment_id":"521903667998585","commenter_b":"So much for ESPN claiming to be a \"all inclusive\" company.","commenter_a":"We no longer have free speech. Opinions are free speech. These liberals are destroying the Consitution.","post_message":"The final straw came when Schilling shared a virulent anti-transgender meme on Facebook. via NBC Sports"},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"}]
