[{"comment_id":"1021100727949032","commenter_b":"I'm no a socialist I'm a total independent from the corruption government..I'm so proud of myself","commenter_a":"Bernie Sanders it's a socialist.. !!","post_message":"We're live in the #GOPDebate hall!"},{"comment_id":"1151260644926345","commenter_b":"she is pathetic","commenter_a":"Jenner and malania do look a lot alike .","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"},{"comment_id":"10152823501296130","commenter_b":"They're some weird people ..these should not reproduce so good for her weird ass","commenter_a":"I would rather marry for love than for desperations.......","post_message":"Taking matters into her own hands!"},{"comment_id":"1432409323458617","commenter_b":"@username and dodging sex with Trump is her game.","commenter_a":"So when the conservatives were freaking out about Michelle Obamas bare arms I don't recall them freaking out about Malaria laying naked on a fur or in bed with another woman. Were is your outrage now hypocrites. This woman doesn't have an ounce of class compared to the classy Michelle Obama.","post_message":"There's secret meaning in Melania Trump's style."},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."}]
