[{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."},{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"1611331605832486","commenter_b":"Just the fact that Hillary has a list long enough to get e locked up for life, and she's still a president candidate shows how rigged the whole system is...","commenter_a":"Lier.","post_message":"“Of course the elections will not be rigged. What does that even mean?”   President Obama called Donald J. Trump’s claim of a rigged election “ridiculous,” saying \"At the end of the day it's the American people's decision.\" @webpagelink"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"10152826899201051","commenter_b":"How would she like if someone caught her on fire in a cage! This woman is sick!","commenter_a":"Put her in cage, set on fire","post_message":"First she made sure the puppies were securely locked up in the pet shop. Then she set it on fire."},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""}]
