[{"comment_id":"897074360335805","commenter_b":"She is an creep and liar..NO FOR PRESIDENT..","commenter_a":"Treason :How about collecting those deleted e-mails .We know you can do it .Obama and few more need to go with her .Sheis not in the boat by herself .Communist","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"10152974175586130","commenter_b":"So much prettier than the trashy thong suits of today.","commenter_a":"Courtney Kelley Michler","post_message":"Gorgeous!"},{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing \"HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL \"EXPERIMENTS\" AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: \"Never stop believing that fighting for what is right is worth it.\""},{"comment_id":"10158034065045277","commenter_b":"No","commenter_a":"No","post_message":"Right-to-Work... Right for Missouri? We want to know your opinions, so tell us!"},{"comment_id":"1241832409215206","commenter_b":"She is a bitch and a ugly one.","commenter_a":"back off","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"10153146604638690","commenter_b":"the terrorist girl.","commenter_a":"There is no age for crimes, a criminal is a criminal. You use children to score PR points in the media. These rocks can kill the passenger inside the car.","post_message":""}]
