[{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"},{"comment_id":"10152669039472894","commenter_b":"Amber must have taken your man or shaded you at some point in life miserable hoe. Get some counseling and stfu.","commenter_a":"And I hope he gets it, a son needs his father. And ratchet bald hoes don't need thier kids","post_message":"Wiz Khalifa Claims Amber Rose is a Bad Mother, Seeks More Custody of 1-Year-Old Sebastian"},{"comment_id":"10152733465191051","commenter_b":"Karma is a ×itch!","commenter_a":"What goes around, come around. Can't feel sorry for a woman who screwed up her own life, and took it out of a child.","post_message":"A woman who killed her daughter and never served any jail time for it has just been found dead."},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"},{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said \"maybe, just maybe the earth is round\"? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."}]
