[{"comment_id":"10154323067108822","commenter_b":"Fourteen people are DEAD!","commenter_a":"So glad to see everyone is a judge!!! Are the kids wrong for what they did? Yes! Should they be punished for what they did? Yes! No one who made any of these comments could be their parents I'm sure or you wouldn't be saying such hate filled things. No one is going to win in situations like this, I pray all the families and businesses can come back from this, I pray something can be salvaged somewhere. And I pray everyone who has hate in their hearts can change. This world would be a much better place if people loved like they are supposed to, to much greed and hate now. How would any of you feel if they were your family members or if you lost someone. I'm sure some of you are christians?? Think about what you could do for someone instead of spreading hatred and negativity!","post_message":"JUST IN: 2 juveniles have been charged with starting the Tennessee wildfire that killed 14 people."},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"},{"comment_id":"831331320235298","commenter_b":"Go back to Italy ya wop","commenter_a":"Reveal his name.","post_message":"A soon-to-be police officer just posted this comment publicly to our page. Is this a thinly disguised threat of violence against citizens? Doesn't sound like this guy should be allowed to roam the streets with a loaded gun in the near future."},{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"10154058784600044","commenter_b":"Classy fucking skank whore right there. Haha","commenter_a":"Kick her in the pussy","post_message":"Feminist Protestor Assaults Infowars Reporter Owen Shroyer"},{"comment_id":"10156983080310354","commenter_b":"throw his ass in prison HES NOT FIT TO WALK STREETS WITH REAL AMERICANS","commenter_a":"Only 5 years?! When he gets out of prison,strip him of his Texas residency,send him to live where he belongs ,Washington D.C.,with all the rest of the anti-American felons.","post_message":"You heard about this, right?"},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"}]
