[{"comment_id":"481694655288924","commenter_b":"This lady is an idiot.","commenter_a":"Her eyes bulge out because her head is so full of bullshit it's about to explode!","post_message":"Isn't that just rich...The only time rich Hollywood liberals pretend to care about the Bible is when they think they can twist and contort it to make some asinine political point to appeal to those Bible thumpin' dumbo Christians in \"fly over\" country.  #NiceTry #ElitistLiberals"},{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"\"This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.\" —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10153712907532483","commenter_b":"@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"\"There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].\""},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"725563637631927","commenter_b":"The wall around the vatican was bild to keep the muslums out.","commenter_a":"I am not Catholic,He is not my pope. We do not have an established religion in the USA. Which was the whole reason for the whole revolutionary war, pilgrims, etc. He is welcome to his opinion, that's all it is....move on Pope....btw, why do you have a wall around the Vatican, just curious","post_message":"The Pope got TAKEN TO SCHOOL by Trump supporters!"},{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."},{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"}]
