[{"comment_id":"10153968798483352","commenter_b":"Nasty bitch","commenter_a":"What!?","post_message":"Escort madam reveals in explosive tell-all book how University of Louisville basketball team ‘paid her $10K for 22 sex parties’ with troupe of strippers including three of her own daughters"},{"comment_id":"1240366709375196","commenter_b":"Oh how I pray that would happen because that is where she belongs. Get out and vote TRUMP!","commenter_a":"She must NOT be elected, then impeached or her VP would take office. Then she would just be the puppet master. Telling him what to do. Come on America, do what is right!!","post_message":"We all hope that Donald J. Trump takes down Hillary, but a backup plan has just been launched in case he doesn't.  This is a massive development in the campaign, and you know it's got Hillary's people worried."},{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out...  Big thanks to Marianne DeMarco for making this video."},{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":""}]
