[{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"10154385047759714","commenter_b":"Mmm seems she has friends in high place above the law she is!","commenter_a":"RIP America....","post_message":"1916: The first woman is elected to Congress.  2016: The first woman wins the Democratic race for president. #Election2016 @webpagelink"},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""},{"comment_id":"10153319872961770","commenter_b":"What does Mexico have we can't go without WE don't need the Border jumpers We don't need all the drugs coming across they have nothing WE need in this Country and they will realize this and pay for the wall","commenter_a":"Great! Time to get these jobs back. TRUMP 2016!","post_message":"Donald J. Trump said he would be willing to start a trade war with Mexico in order to make the country pay for the wall along the US/Mexico border."},{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a \"respected\" professor who gets to go on TV and say this."}]
