[{"comment_id":"10156399276440354","commenter_b":"What are you a freaking psychic? How would you know who is Christian?","commenter_a":"Man look all this Christian compassion.","post_message":"Ex-porn star Bree Olsen: \"It's bulls**t.\""},{"comment_id":"10153712907532483","commenter_b":"@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"\"There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].\""},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"},{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"1082607271804819","commenter_b":"Lynne Longoria Torres","commenter_a":"the BBC is for the birds.","post_message":"Donald J. Trump has yet to comment!"},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."},{"comment_id":"1715308212052135","commenter_b":"That is the good thing about voting for Trump! It is bad for Mexico and good for the USA!","commenter_a":"Bite me you greaser","post_message":"Mexico's former president claimed voting for Trump is \"treason.\""}]
