[{"comment_id":"10154345069201491","commenter_b":"The wall will be so \"huge and bigly\" the missiles won't even be able to fly over it!","commenter_a":"Trump doesn't like war!! He likes building a huge wall.. Don't worry guys, he is going to isolate North Korea with his wall, perhaps the nuke can't go through it..","post_message":"North Korea's weapons-grade stockpile has soared dramatically, says South Korea."},{"comment_id":"1527023290939672","commenter_b":"@username Jesus Christ, woman....","commenter_a":"well, Oprah, I didnt hear you claiming racist when all us white people were watching your shows and buying your magazine, and saying how great we thought you were,now u got a big bundle of money and suddenly we are racist.....well, thanks a lot for the truth of how you really feel, we will be sure not to bother you with watching your shows or buying your magazine or singing your praises anymore....what an idiot","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."},{"comment_id":"10152549413699071","commenter_b":"So true, reason why women throw themselves on celebrities","commenter_a":"Healthy man not attracted womens .attrating gods grace","post_message":"The most valued trait in a potential mate isn't beauty or wealth."}]
