[{"comment_id":"840046962805763","commenter_b":"GREAT! Then we don't have to build the wall!!! But will Mexico take them back?","commenter_a":"Hey, have at it.","post_message":"LOL."},{"comment_id":"10152823501296130","commenter_b":"They're some weird people ..these should not reproduce so good for her weird ass","commenter_a":"I would rather marry for love than for desperations.......","post_message":"Taking matters into her own hands!"},{"comment_id":"892853017418706","commenter_b":"This my friends is a true leader","commenter_a":"We'll never see Obama supporting our wounded Vets like Bush. Bush was a true patriot","post_message":"George W. Bush said the ride will highlight the \"bravery\" of America's veterans:  \"It’s a ride to herald people who were dealt a severe blow and said, ‘I’m not going to let it tear me down.’”"},{"comment_id":"10152535157075496","commenter_b":"And she protects children!!!","commenter_a":"Just because you make some mistakes in life does not mean you should not be able to work! DFACS clearly states in their policy that she is okay to work for them! There's no need to put this woman on blast like that. Making some mistakes doesn't make her incapable of helping children in need. It's unfortunate people are being so judgemental. I'm glad DFACS is protecting her in the workplace.","post_message":"HOLDING THE POWERFUL ACCOUNTABLE: A state investigator responsible for ensuring the safety of Georgia's children can be convicted of forgery and pulling a gun in a road rage incident and apparently still keep her job.   See more: @webpagelink"},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"500328103497004","commenter_b":"@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"10152939538841051","commenter_b":"what a stupid bitch duh","commenter_a":"It seems to me that they have no control of their sexual needs and have to use children because they can't get anyone their age to have sex with.","post_message":"This woman thought the photos she sent via Snapchat would disappear. Well, they didn’t. Police took one look at them and had all the evidence they needed."}]
