[{"comment_id":"10154323044371545","commenter_b":"I don't need to march with a bunch of femanazis' I'm fully aware of my rights as a woman and my freedoms as a US citizen - no one has tried to take any of those away from me except the last administration so I'm good MAGA","commenter_a":"I wonder how many women signed up to go to these marches thinking that they were supposed to be empowering women when it turned out just to be an anti Trump rally- so I would say that at least half of the women may be there for totally different reasons - which means the people who organized these marches were completely disingenuous","post_message":"Any DFW women make the trip to Washington for the #WomensMarch? If you did, Hannah Davis wants to hear from you. Share your pictures here."},{"comment_id":"1085812054871914","commenter_b":"Ignorant pig","commenter_a":"Be careful what you wish for buddy","post_message":"\"I think we should take a drug test prior to the debate.\""},{"comment_id":"10154142695231378","commenter_b":"Jesus for president!!!!","commenter_a":"This loser is not my President !!!","post_message":"#LIVE: President Obama holds first news conference since election."},{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government \"feel good\" Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"1142484579135691","commenter_b":"It will recover","commenter_a":"Guess what the pound is at a 31 year low at the moment, figure out for yourself what will happen to your economy in about an year, idiots.","post_message":"\"And we'll have done it without a single bullet being fired\" - Nigel Farage @webpagelink #EURef"}]
