[{"comment_id":"904121959720983","commenter_b":"Lock Her up!","commenter_a":"Behind bars fits her","post_message":"America is waking up!"},{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"},{"comment_id":"481694655288924","commenter_b":"This lady is an idiot.","commenter_a":"Her eyes bulge out because her head is so full of bullshit it's about to explode!","post_message":"Isn't that just rich...The only time rich Hollywood liberals pretend to care about the Bible is when they think they can twist and contort it to make some asinine political point to appeal to those Bible thumpin' dumbo Christians in \"fly over\" country.  #NiceTry #ElitistLiberals"},{"comment_id":"505113796343580","commenter_b":"They reproduce like rabbits, anytime a Muslim gives birth in an American hospital they should be sterilized.","commenter_a":"Screw the Muslims, they are all sheep in the cult of Islam.","post_message":"Watch what happens when Muslim Brotherhood extremists attack journalist in front of the NYPD!"},{"comment_id":"10153057363191028","commenter_b":"Bhahaha!!! A ccw in San Fran ? Does a unicorn issue those?","commenter_a":"I am sure that the thugs guns were a registered and they all had concealed carry permits with proper background checks done.","post_message":"The brazen attack occurred just before 6 a.m. at Pier 14 in San Francisco, where the reporter and photographer – along with several other news stations – were covering a story.   \"I thought I was going to hear a click,\" the photographer said afterward, meaning that he thought he was going to die. @webpagelink"},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"}]
