[{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"},{"comment_id":"1026275800718010","commenter_b":"Oooooh. Oh Oh someone is actually deciding that the Manchurian fraud president could actually be an Islamic terrorist. Well the grasshoppers may actually be waking up to that fact. What the hell do you think I have been saying for the last six years. In the movie the Manchurian candidate American prisoners were being brain washed by the Chinese to undermine America and it's politicians and kill them. In Obummer's case he was indoctrinated into the Muslim cult and communism by his father mother and his in-law's. There are no Muslim or Islamic American's because they will give their lives for Islam. They are instructed by the Koran to deceive the infidel's and make them think that you are their friend. When the time is with us we will torcher them and then kill them in the name of Islam There are no good Muslim's . That is for outward ...","commenter_a":"Yes","post_message":"Millions of Americans have suspected for quite some time about Barack Obama's ties to the Muslim Brotherhood. Now, there's a document that's being called \"the smoking gun.\""},{"comment_id":"10152628178977016","commenter_b":"Brainwashed female.","commenter_a":"I sympathize with her feelings, but do believe that never including those with whom we disagree in any discussion only solidifies the differences. Perhaps something of event speakers' words sank into W's cranium. Perhaps his presence will help some haters think twice about their positions.","post_message":"Civil rights movement leader Diane Nash calls former President George W. Bush's attendance at Selma anniversary \"an insult to people who believe in nonviolence.\""},{"comment_id":"10153811400261002","commenter_b":"Just goes to show we know how to do more than you men lol","commenter_a":"I think it's hilarious.Sadly a majority of uptight women will find it offensive,like they do if the wind blows the wrong way. Relax it's not a d**k don't take it so hard.","post_message":"A new jersey for a sports team has washing instructions that has caused an uproar. It reads  this jersey to your woman, it her job."},{"comment_id":"10153415321678812","commenter_b":"Stacey shutup stupid","commenter_a":"So how does something hitting the windshield really effect a train on tracks? It's not like the train swerved to avoid it and hit something...travelling at 106 mph might be the villain in this tragedy.","post_message":"FBI investigating possible links between Amtrak crash and other trains hit by objects: @webpagelink"}]
