[{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."},{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"\"Hero\" or \"heroine\" or are you undecided?","post_message":"This just made our week."},{"comment_id":"10153496475494575","commenter_b":"\"She has since filed an appeal.\" Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.\""},{"comment_id":"4646614632067289","commenter_b":"Need to enforce the laws illegal out of this country!","commenter_a":"Anybody coming into the United States should abide by all laws of the United States for the customs or any other law if not coming through customs legally stay out if you did not come through customs legally get out you have no right to be here illegally that's the law like it or not that's the law abide by it or stay out","post_message":"Do you agree?"},{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"}]
