[{"comment_id":"10153095274501600","commenter_b":"JERK","commenter_a":"there needs to be an (unlike button)","post_message":"“We are entering the curvy girl era and when all eyes are on the bikini babes of Sports Illustrated, it would be a great time to have the conversation about the rise of the curvy girl,” a spokeswoman for Sports Illustrated said."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"10153127700606491","commenter_b":"That females are equal to males. Google the definition of feminism. That's all it is. Males and females equal. No enforced culturally engrained gender roles. It goes very deep.","commenter_a":"Amazing that no one commenting but me is for gender equality! I thought it was 2015 :( oh well you can't teach ignorant adults I suppose.","post_message":"\"Every child is an individual.\""},{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."},{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"\"We don't believe in capitulating to people who are going to tell us how to run our newspaper,\" said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."}]
