[{"comment_id":"10154720750937235","commenter_b":"Michael M you r an ass hole !!! No one cares what you think !! You r ugly and evil with no soul just like Hillary !!! You and Meghan r made for each other !!! You r a disturbed individual !! Making fun of hard working people struggling because of Obamas policies !!!. We all should boycott. All your crap . I will . Those hard working people paid to see your movies ! Thats how u got rich !! Thanks to the deplorable's. You 😤😤ASSHOLE !!","commenter_a":"Michael Moore will do anything for media attention and money.","post_message":"You've no doubt seen folks in your Facebook feed who believe Michael Moore is making the case for Trump.   That is a LIE."},{"comment_id":"578454362315144","commenter_b":"Jesus look at that horse mouth...damn that is one ugly woman","commenter_a":"I wonder if Chelsea knows the blood that comes with that Money?","post_message":"The hypocrisy is thick..."},{"comment_id":"10153541380362093","commenter_b":"@username obviously you think you are what you arent thats why its called a disorder im not going argue... is the sky green? is grass blue.. no... and im not going to argue that it is.... and the problem isnt so much trannies like i said its men who know what they are that are now not looked at twice for going to the womens restroom, nobody will bat an eye even if his intentions are evil...","commenter_a":"As a transgender person, I'm sorry that me having to do a natural bodily function in the bathroom that matches my gender identity affects your life so much. Get over it, we're here to stay. I was born and raised in Texas, regardless of what y'all say about us, I'll still be using the men's room.","post_message":"The founder of the movie theater believes the bathroom debate has gotten out of control and hopes his new design will make the issue a non-issue for customers... @webpagelink"},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."}]
