[{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."},{"comment_id":"10153999056241323","commenter_b":"She is pickled she will last a long while yet","commenter_a":"And when the Queen kicks the bucket we will have our money overhauled yet again. How much does it cost to overhaul the money all these times?","post_message":"To be eligible to appear on the new bill, the woman must be Canadian, either by birth or naturalization, and she must have died at least 25 years ago."},{"comment_id":"10153647894113854","commenter_b":"Leave her alone","commenter_a":"You call this piece journalism? Now that's a long stretch.","post_message":"FLASHBACK: \"Megyn Kelly F**ks Brit Hume to Get a Job at Fox News\""},{"comment_id":"1750200585039682","commenter_b":"Wear a condom then you stupid, despicable woman","commenter_a":"Couldn't just let her be adopted.........","post_message":"What a horrible woman"},{"comment_id":"10154048889111955","commenter_b":"How does Mexico treat even LEGAL immigrants? Far worse than the USA treats illegals: @webpagelink","commenter_a":"Just like in the movie \"World War Z\".","post_message":"Illegal immigrant numbers skyrocket at Mexican border..."},{"comment_id":"10155273538573797","commenter_b":"build a wall...then build another wall around the south side","commenter_a":"I blame the mayor. Its his fault this stuff happens","post_message":"A 74-year-old man has been charged with shooting another man Saturday night in the Park Manor neighborhood on the South Side."}]
