[{"comment_id":"10153396408061130","commenter_b":"Why are these men so obsessed with a uterus? I mean I've never obsessed over a prostate...what is going on?","commenter_a":"The same thing happened to Joe McCarthy. Everyone was all for outing Communists, then they watched him bully people at hearings on the TV and realized what a witch hunt it was.","post_message":"\"This hearing is why everyone hates Washington, D.C.\""},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"},{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."}]
