[{"comment_id":"1436806433003369","commenter_b":"@username Your vagina is showing....","commenter_a":"#NeverHillary #DNCLeaks #DemExit #StillSanders","post_message":""},{"comment_id":"1681074165464529","commenter_b":"All the deplorables need to donate a brick for the wall with their name on it for the illegals to see who wants them gone....","commenter_a":"NO REFUGEES AND SEND THE ONES THAT ARE HERE BACK!!!!!","post_message":"Donald Trump LIVE! WATCH NOW     Best Conservative NEWS-----> Freedom Daily LIKE OUR PAGE!  Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  \"Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.\""},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"574693549357266","commenter_b":"Whores don't have souls, so yeah...","commenter_a":"so legalise drugs, legalise prostituion, are we just going to start legalising everything?","post_message":"\"Being a sex worker isn't about lack of choice. If I really had no choice, I'd be working in a garment factory.\""}]
