[{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"10154520499329705","commenter_b":"Silly women. Tricks are for kids. Everyone knows women aren't real people. We should go back to the original constitution. Only men should vote and black guys should only count as 1/3rd a vote. I think Trump can help make that happen #Trump2016atleastIdidntrapethem","commenter_a":"More mainstream media hype to distract from the real issues. Wake up people.","post_message":"The Times to Donald Trump: Make. Our. Day."},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"1197370603617282","commenter_b":"Larissa Elliot","commenter_a":"Amy Batchelor","post_message":"An attempt to reproduce 100 psychology studies published in leading journals couldn't match the results in almost two thirds of cases."},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"\"It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...\"  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."},{"comment_id":"10153598339119205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"*****Hillary Clinton leads the Nation in overall votes and delegates, than any other Candidate running for the Presidency! She is more qualified and has more experience and will be ready to be our Commander in Chief, on day one. She has exemplary qualification in Foreign Policy, National Security and Diplomacy. Please vote wisely and vote for Hillary Clinton, our next POTUS 2016*****","post_message":"The biggest LOSER of the MSNBC #DemTownHall was..."},{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."}]
