[{"comment_id":"10153224902339411","commenter_b":"Jonathan Toothman","commenter_a":"75% of that data is outdated wrong and non existent. i always give fake info when they ask","post_message":"Quick before NSA snaps it up"},{"comment_id":"10153962547876519","commenter_b":"@username Wrong. No Muslim structures where they killed real Americans. You have a lot of anger. Try whimpering in a corner.","commenter_a":"Oh shut the fuck up you unhinged idiots. By this standard, I had two health episodes yesterday. It's really scorching in this city right now.","post_message":"Clinton was observed \"fainting\" in a departure area..."},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"10154895009386337","commenter_b":"A pussy with a ring...yah right!","commenter_a":"Jefferson has always been a pussy!","post_message":"LOL. Joel Embiid cares not for your veteran status, Richard Jefferson..."},{"comment_id":"10153775506759203","commenter_b":"@username Look over this list....Drugs & guns to YOUR front door, so tell me again how gun control works!!!! @webpagelink","commenter_a":"Gun bans have always had the same effect once implemented: none. They do not create a (sustained) period of increased murders, nor do they reduce the rate of homicides.. @webpagelink","post_message":"\"We can toughen background checks and stop the sale of firearms to folks who have a violent history or history of mental illness.\"  Amy Schumer"},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"}]
