[{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"10152924190906336","commenter_b":"Obama, take lessons from them. Hire illegals to build the wall and when it's done, toss them on the other side","commenter_a":"And america welcomes all through mexico.","post_message":"Saudi Arabia is constructing a 600-mile \"great wall\" along its border with Iraq to keep ISIS and other extremists at bay."},{"comment_id":"10154219980731336","commenter_b":"Oh well....","commenter_a":"Aww. Poor things. I'm sure daddy will throw money at someone to make it happen.","post_message":"“They feel very guilty, but it’s fine.”   Donald J. Trump spoke to 'Fox & Friends' about his children Ivanka and Eric not registering to vote in the New York primary. Plus, hear what he said about choosing Ivanka Trump for VP."},{"comment_id":"10153953664426509","commenter_b":"They will invade us with mountain goats!","commenter_a":"@username so scared ..lmao","post_message":"North Korea threatened the U.S. with attack if military exercises are conducted as planned. Get details here: @webpagelink"},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"\"I did feel at some point I would need to address the complexity about my identity.\""}]
