[{"comment_id":"10153332084960736","commenter_b":"@username You seem to be missing the point. Those appear to be all Cows (baby factories if you would). Kill off all of those and there is no way to reproduce any more. Who ever told you the Elk were overpopulated? Did you read it in a newspaper somewhere? Or have a Fish Cop mention it? Or perhaps just another Liberal with a big mouth and an empty head.","commenter_a":"More like training the young wolves to kill. The meat is then left uneaten and wasted. That's a very good reason to get rid of the wolves before the Elk are extinct.","post_message":"Wildlife officials describe a 'surplus kill' as when animals kill more prey than they can eat, leaving the surplus."},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"10153241049435950","commenter_b":"SHUT THE FUCK UP...","commenter_a":"Is oboma a member of isis/isil?","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"},{"comment_id":"10153598659872434","commenter_b":"@username you females don't have any sense in your head that oppose this kind of thing.","commenter_a":"It is not any feminism I know that tells a person what they can and can't wear. Beach or not. France should stop blaming their bigotry on feminism.","post_message":"French officials have cited everything from hygiene to feminism in order to ban the swimsuit"},{"comment_id":"10154376028466509","commenter_b":"He's dead lady.","commenter_a":"Biden would be a better president than Hillary.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address.   #SOTU updates: @webpagelink"}]
