[{"comment_id":"1511171265602298","commenter_b":"The Swiss do not have to do anything any muslim may demand! These muslims making demands that is not their place.Who the hell do they thik they are, they leave their land and move unwanted into another and they make demands? Sorry bacon lovers that is all the world will offer you. take it or leave!","commenter_a":"Works for me ?!... what hat ?!!!........ @webpagelink","post_message":"Ridiculous!"},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"10154018245628352","commenter_b":"Why kill the woman?... Just get a divorce and carry on with your life idiots!!!","commenter_a":"he was lying to her crazy ass....","post_message":"‘I want you so bad – if only someone was out of the way': Chilling texts Army medic sent to his mistress weeks before his wife was found murdered"},{"comment_id":"10153492850468984","commenter_b":"Tear them down! Burn them - just get rid of them and start a mass deportation of Muslims!!!","commenter_a":"First time I see one I am going to the ACLU and sue Islam is a dangerous cult and it offends me...","post_message":"Some of these claims seem quite bizarre. I wonder how this will be received by the American public.  What do you think?"},{"comment_id":"876414139081949","commenter_b":"You guys should follow the example of other country's. In Panama there is a big movement right now. No more inmigrants! Everybody is taking the social media and demanding that all the undocumented get out of the country! So let your voice be heard!","commenter_a":"Grinning fool. Poster picture for Term Limits.","post_message":"Click to see the back-room deals Republican leaders are making to fund Obama's executive amnesty..."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"},{"comment_id":"10153324817246523","commenter_b":"And this is only the beginning of another year in Wisconsin.","commenter_a":"Oh people quit ur whining an complaining! It's sickening! It SNOWS every year, this is nothing new!!! Blah, blah, blah!!!","post_message":"NEW: We're been upgraded to a winter storm WARNING in southeast Wisconsin."}]
