[{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"},{"comment_id":"949896131712475","commenter_b":"Even the black panthers want to kill white folks, lets start picking them up first and do something about them standing at festivals with AK 47's and other numerous guns, quit harping about only white folks having guns","commenter_a":"IT'S TIME TO DO SOMETHING ABOUT THE IDIOT'S THAT USE THE GUNS TO KILL PEOPLE SENSELESS...JUST CAUSE THEY PISSED OR DON'T LIKE YOUR COLOR!!!!!! NOT THE GUNS FAULT...THAT IS SO STUPID TO THINK IT'S THE GUNS FAULT...THAT'S LIKE SAYING BAN FORKS AND SPOONS FOR ALL THE OBESITY!!! TOTALLY INSANE!!!!!! LET'S BAN CARS FOR ALL THE WRECKS THAT KILL PEOPLE!!!! HEIGHT OF IGNORANCE!!!!!","post_message":"HELL YES!"},{"comment_id":"2004741493095269","commenter_b":"Because he does suck dick","commenter_a":"Why does he always look like he is about to suck a small dick?","post_message":"What an idiot."},{"comment_id":"1136767329692020","commenter_b":"Poor Bill has to wake up next to this. OMG no wonder he did Monica.","commenter_a":"Sorry had to leave, Now back To the Butcher of Benghazi Karma Hillary Clinton","post_message":"Hillary, EXPOSED!!"},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"1402706749758182","commenter_b":"Awesome Donna! Way to #GrabEmByThePussy !","commenter_a":"No to Any replacement for Trump! No to Pence!! He could Never beat Hillary. Remember almost 1/2 of America did not even know who Mike Pence was a week ago and the V debate had poor ratings. 40 percent of America wull stay home on election day.","post_message":"Sen. Johnson kicked off Manufacturing Month with a special video message to students touring Pewaukee manufacturer TLX Technologies during their open house. Hundreds of students visited the business throughout the day to learn about careers in manufacturing."}]
