[{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"1003069729713383","commenter_b":"Can they impeach her?","commenter_a":"Don`t forget she too has her rights, if you think some one has the right to forget his or her gender then she has the right to forget her job","post_message":"Davis, who returned to work on today, told a news conference any marriage licenses issued would not carry her name, title or her personal authorization. She added she would take no action against deputy clerks who issue licenses, although she does not believe they have the authority to do so. Read more: @webpagelink"},{"comment_id":"10154729418265530","commenter_b":"Shut ur mouth Ried,!","commenter_a":"I guess in political land , it's against the law to investigate corruption and scandals to someone who broke the law , but can't be investigated because it may hinder the election ?? Lots and lots of question marks here ?????????","post_message":"\"Through your partisan actions, you may have broken the law,\" Harry Reid tells FBI Director James Comey: @webpagelink"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"},{"comment_id":"10153221769812894","commenter_b":"Bitch u jealous","commenter_a":"I think this is wrong she was not a president she did some great things yeah but to change it from what it is is in my opinion just wrong see this is what's wrong with people they vote for stupid shit like this but don't vote for education or something we really need Gosh America where are your priorities????","post_message":"Harriet Tubman Wins Vote to Replace Andrew Jackson on the $20 Bill"}]
