[{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"10152575387122217","commenter_b":"It should be illegal to sell cigarettes to pregnant women!!","commenter_a":"I think women who smoke during pregnancy are just selfish vile people. ..thinking of themselves and not there babys health....it should be illegal to smoke while pregnant !","post_message":"Should pregnant women be paid to give up smoking?"},{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10155314611590652","commenter_b":"hahaha! this is amazing","commenter_a":"@username apparently the jar of mayonnaise episode anticipated this.","post_message":"\"Life is best when it's a bit strange.\"  This weird new reality show has millions of people pretty much watching paint dry:"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"\"With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.\""},{"comment_id":"1229225200430841","commenter_b":"I do agree though a little white girl wouldn't have been thrown to the ground...","commenter_a":"While the student was wrong in her choices to be disruptive, disrespectful, ignorant and arrogant. The officer also was wrong in the amount of force that he exuded on a MINOR. Regardless of the ignorance and attitude shown by this student. I worked in a school and have 6 children of my own. Some children nowadays are extremely difficult to manage and teach. I agree. My own children know better than to even entertain the thought of being disrespectful, they know their behavior has consequences. Not all children are raised in that type of loving environment. That is NO excuse for this child acting like a spoiled brat with a chip on her shoulder who obviously has authority issues. That being said, back to the police officer who felt the need to use his authority and man handle a child. Simply because you're annoyed and irritated that a child defies ...","post_message":"This video taken from inside a South Carolina high school classroom on Monday shows a police officer body slamming a female student and dragging her across a classroom. The chorus of parties angry over the confrontation continues to grow, as the sheriff's department investigates. @webpagelink"}]
