[{"comment_id":"10152762458196973","commenter_b":"Exactly how would we \"ban transgenders?\" Deport them? Round them up into camps? Or are you for killing them? Smart people don't advocate for bigotry and racism.","commenter_a":"Or we could just ban transgenders altogether.","post_message":"Should Oregon ban \"conversion therapy\" for LGBT youth?"},{"comment_id":"1197295057044376","commenter_b":"I see they bussed them in","commenter_a":"I get guarantee most of these people don't even know what a fascist is.","post_message":"Marching on the deploraball"},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"887798031255619","commenter_b":"@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"},{"comment_id":"10154611725268445","commenter_b":"you are an idiot. I wish you were here right now bitch","commenter_a":"Natives don't want jobs just government hand outs","post_message":"Cannabis becomes the great equalizer and provides a level playing field for tribal nations, including those who did not benefit from casino's."},{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"}]
