[{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""},{"comment_id":"10153866356179087","commenter_b":"@username elillegal means\" elite illegal immigrants living in comfort due to free dows from Obama government, at the expense of us tax payers!","commenter_a":"LOL...Trump is a con artist...serial adulter...pathological liar...crooked businessman who preys on the less fortunate . He uses our vets as campaign props and lies about giving them donations. He funds his own businesses with his political campaign. He refuses to make his tax returns public. Be serious. Trump is the most corrupt individual to be running for office.","post_message":"Donald J. Trump gets standing ovation after saying Hillary Clinton \"may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"1016519435107777","commenter_b":"Yes, and the idea that we should force women to wear a veil in the USA makes me physically ill. Women are NOT 3rd class citizens, which is what they are in strict Muslim households!","commenter_a":"There are many women who are voting republican because they are against abortions and they do not believe PP is anything other than there to do abortions. At age 72 I am with Stevie. I think we worked too hard to go backwards. I remember when I was first married there were states where it was against the law for a woman to use any form of birth control other than abstinence. If abortion is outlawed, how long before birth control will be outlawed.","post_message":"TRUTH."},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"10155558251545354","commenter_b":"If I was her I would bow out of this hot potato that may leave egg on her face!","commenter_a":"Who really cares Baltimore's become the septic system of America","post_message":"Uh oh...."},{"comment_id":"1642358432731311","commenter_b":"She was queen to Obammy's King. Both suck!","commenter_a":"This dumb bitch needs to shut the fuck up!","post_message":"Do you think Oprah is a bigot?"}]
