[{"comment_id":"10153563258578812","commenter_b":"they can have as many wives as they want!","commenter_a":"Consenting adult and there should be a limit .... of wife's for sure .. and later polyandry limit the husbands too","post_message":"Polygamous Montana man seeks legal marriage license with 2nd wife following Supreme Court same-sex marriage decision: @webpagelink"},{"comment_id":"10153254996144099","commenter_b":"Darlene is just another brainwashed white women who think all blacks are \"misunderstood\"","commenter_a":"with all the training they get they can not subdue a guy with a hammer???","post_message":"UPDATE: Police and multiple sources initially said the man was dead, though authorities later said he was hospitalized in extremely critical condition.  #BREAKING: Hammer-wielding suspect shot dead after trying to hit officer, police say @webpagelink"},{"comment_id":"10153759258966694","commenter_b":"Do not compare this to GOT...or dr who....or any other shit please...","commenter_a":"Oh, gee, you don't really mean it's going to make my brain explode, do you? Like The Walking Dead was supposed to make my BRAIN EXPLODE, and Game of Thrones was supposed to make my BRAIN EXPLODE, and Dr. Who was supposed to make my BRAIN EXPLODE...Seriously, how much did Raimi and Co. pay you guys to headline Ash vs. Evil Dead as an exploding-brain event? Because, you know what? Every time @username claims some stupid TV show will \"explode your brain,\" viewers barely end up with a BRAIN TWINGE. So instead of over-hyped praise, why don't you guys try something different? Something along the lines of: \"WE SAT THROUGH THE FIRST EPISODE OF ASH VS. EVIL DEAD AND WE DIDN'T GET CRAMPS IN OUR ASS.\" In short, Lower Expectations = More Pleasurable Viewing Experience. You're welcome!","post_message":"Ash vs Evil Dead is going to make your brain explode in the best way"},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"10152603535532894","commenter_b":"she slept with Jamie Fox, She slept with a fe NBA players. If you go on the internet its all there and on TMZ. She is a whore too","commenter_a":"Greg has his own real estate investments and can stand on his own. Please. Claudia is a whore. She has slept with everyone just like Kenya hoping for a big break. if you start your career on your back you always stay on your back That is a bad practice of sleeping with people to move up. People will never respect you as a woman or a professional like that","post_message":"#RHOA Fans Outraged: NeNe Leakes Hurls 'Half-Breed' Racial Slur at Claudia Jordan [Video]"},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"1059120344128437","commenter_b":"I have a 15 year old daughter. She is very mature and brilliant. Although, she (as well as almost all teens that age I know whose frontal lobe isn't even completely developed and whose lack of life experience just isn't there no matter how much a teen thinks it is) is not ready to consent to domestic slavery, opps I mean marriage. Many organizations are trying to stop child marriages in other countries. I am pretty sure that this is the same thing.","commenter_a":"Sick","post_message":"A debate broiling in the Christian homeschooling community asks a hard-hitting question: just what should the minimum age for marriage be?"}]
