[{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"10154098589214753","commenter_b":"She could be doing a whole lot worse,she is doing what she wants before going to collage,seems like a good idea to me .She may not be so inclined to act foolish when she gets there and will take her studies more seriously.Enjoy your year off","commenter_a":"Wow! This is not news...who cares?","post_message":"Malia Obama has been embroiled in a pot smoking scandal after footage was released of her smoking at the Lollapalooza music festival in late July. The first daughter opted to attend the Chicago event instead of joining her parents for the Democratic National Convention in Philadelphia. It was a decision that led to big headlines for all of the wrong reasons. Images of Malia twerking and partying it up were posted online. It wasn’t just her wild behavior that got attention, but who she was... @webpagelink"},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"},{"comment_id":"1138559072849036","commenter_b":"Are you still w trump ? Onilk Deleon","commenter_a":"If you really want to start sending these people a message. Start taking these videos and comments and send them to their employers.","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC.  #MicBrights"},{"comment_id":"10154538085533812","commenter_b":"\"You gotta take them out\"...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as \"obsolete.\""},{"comment_id":"10153083234283837","commenter_b":"What does sleeping have to do with a woman running over someone with her car?","commenter_a":"Thus is why elderly should not be sleeping","post_message":"APPALLING ACCIDENT - An elderly woman accidentally ran over a man, believed to be her husband, in the driveway of their Fort Lauderdale home."},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."}]
