[{"comment_id":"363657737155854","commenter_b":"She needs to die","commenter_a":"Don't watch her either to me she is just stiring up trouble","post_message":"Is Oprah a race-baiter?"},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."},{"comment_id":"1763050483964389","commenter_b":"@username it's sad that you believe this corrupt liar, she panders to do nothing but destroy American interests. You will have a hard life since you choose to ignore the research that many gave to you on this post. You rather remain blind then actually see the POS that you're defending.","commenter_a":"Here's an idea, everyone who DOESNT like Hillary, don't comment. Go comment on how much you love Donald Trump and how you hate everyone except white people. And how you hate refugees fleeing their countries that are being bombed by USA and how you hate everyone. And if you like Hillary and/or voting for her... Then you comment.","post_message":"Even before his hateful speech this week, Trump has never been vague about his feelings toward immigrants."},{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"1204517232921065","commenter_b":"he's not alone. He has a lot of support!","commenter_a":"He is not alone..he has millions on his side... You got this Mr President..","post_message":"Can Trump do this alone?  @webpagelink"},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"}]
