[{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"566305263572986","commenter_b":"When are they going to be persecuted?","commenter_a":"Vote! Vote Donald J Trump!","post_message":"WIKILEAKS BOMBSHELL.... The election should be OVER. The Clinton campaign admits to Obama having emails from Hillary off her personal server and that the president knew before he heard about it from the press.  SEE EMAIL"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"},{"comment_id":"10153150009791037","commenter_b":"They will bitchhh","commenter_a":"USA ... root cause of evry problem in world!!!","post_message":"#NorthKorea fired two short-range ballistic missiles into the sea and vowed \"merciless\" retaliation as the U.S. and South Korea kicked off joint military drills denounced by Pyongyang as recklessly confrontational."},{"comment_id":"1104163209700456","commenter_b":"Is she as dumb as a rock or what ?","commenter_a":"Just take this ignorant ass in jail.... Trump!!!!!!!","post_message":"Even after being caught cheating in elections, check out Democrats' excuses."},{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"537705639687363","commenter_b":"@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."}]
