[{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for \"being too loud.\" The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"\"There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.\"  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."},{"comment_id":"1614697422150704","commenter_b":"We don't need these radicals in United States we have enough radicals of our own homeborn.","commenter_a":"Let her \"NEXT SPIT\" be in Saudi Arabia !!!","post_message":"Deport these radicals NOW!"},{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"10153058619121051","commenter_b":"She should go to prison for years and starved on a day bases! She is disgusting!!","commenter_a":"Poor little baby","post_message":"Even the police were stunned that someone would treat a dog like this for no reason."}]
