[{"comment_id":"173468886485698","commenter_b":"Well...Bye!","commenter_a":"California says screw you USA, until they want something from the rest of us in the USA.","post_message":"Spread this everywhere!"},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"10154722156744749","commenter_b":"The 'girl who prepared' has a name. Her name is Hilary. When this 'dastardly' person can be called by name why not this lady?","commenter_a":"What a terrible statement...Clinton is a terrible example. She is a garbage","post_message":"\"Ten inches shorter, she towered over her rival. In 42 days’ time, Dastardly Donald deserves to get beaten by the girl who prepared.\""},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"\"Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?\""},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"10153352781442217","commenter_b":"Haha She will never take any more selfies in life","commenter_a":"Pauline Mcgovern","post_message":"An Austrian tourist has had to be rescued from a well, after she fell into it while taking a selfie."},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"}]
