[{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give \"equal time\", since the top candidate from the other party was prominently featured.","post_message":""},{"comment_id":"751318988350209","commenter_b":"Wondering if Melania has to listen to the snorting every night in bed!!!","commenter_a":"Why doesn't he realize that he has this problem with his nose, which only appears at the debates and not at any other occasions.","post_message":"It's just allergies, right? Right?! --Andrew"},{"comment_id":"1554877448153804","commenter_b":"#HellForHer. #FeelTheBern","commenter_a":"I wouldn't vote for Hilary under any circumstances, because she is dishonest and has done nothing to help the cause of human rights in her entire career! In fact, everything she's ever done has been solely for her own promotion and gain! Power is what she's after and we definitely DON'T want someone like her in charge of our country! Bernie is one of us, a man who's worked hard for positive change, who is diplomatic, anti-war and pro-planet, in short, just what we need at this particular moment in time! With Bernie, we would all have a say, whereas, with Hillary, as a people, we would become more suppressed than ever, given her plans for further militarisation, both military and police wise and polluting of our planet in favour of the almighty buck! Bernie puts the needs of THE PEOPLE first, which is why he must be our first ...","post_message":"When we talk about a political revolution, sisters and brothers, we don't just mean the presidency. What this moment  requires is people in the streets fighting for change and legislatures across the country willing to stand with them."},{"comment_id":"10153986549963132","commenter_b":"stupid bs, she feels fat and ugly.grow up kim.","commenter_a":"Oh please. She acts like she is the only woman that has ever had problems while Pregnant.","post_message":"Kim Kardashian West is opening up about what could potentially be a very scary delivery."},{"comment_id":"1215097765244658","commenter_b":"To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Theodore Roosevelt","commenter_a":"Obama top 5 worst presidents ever.","post_message":"President Obama delivers his first news conference since meeting with President-elect Donald Trump."},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."}]
