[{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"10154085235841717","commenter_b":"I believe two females can already, though not commercially available and always produces girls","commenter_a":"Perhaps a little off topic, but I wonder how long it will be- or indeed if it's possible now- for a same-sex couple to have a natural child using a similar method. I imagine it would be complicated, but not impossible for, say, two men to have a biological child using a \"blank\" egg cell.","post_message":"To help women with mitochondria problems from passing them down to their children, scientists remove the nucleus DNA from the egg of a prospective mother and insert it into a donor egg from which the donor DNA has been removed."},{"comment_id":"1681685855452013","commenter_b":"Joke...","commenter_a":"Jail and no bail.","post_message":"President Obama is taking guns out of all forms of entertainment.  This is ridiculous. He can't get away with this.  Do you think he is abusing his power to push his propaganda?"},{"comment_id":"10153588995871943","commenter_b":"With her I the White House nothing will change. Don't forget we will get a sexual predator along with her. What a deal.","commenter_a":"I WANT TO KNOW WHY - OUR PEOPLE WERE ABANDONED?!!! Just like Clinton's hubby refused adequate forces for BlackHawk Down - I'll NEVER get the images of OUR PEOPLE BEING DRAGGED THROUGH THE STREETS.....NEVER. That's the REAL RECRUITING Message: \"America is WEAK!!!\"","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"}]
