[{"comment_id":"10158044055455391","commenter_b":"@username Obama has dumped over 10,000 mostly Muslim Somalis in Minnesota, Tennessee, and other States. A Somali-born student at Ohio State University injured 11 people, one of them critically, when he attacked a crowd of pedestrians on campus in an incident one lawmaker said \"bears all the hallmarks of a terror attack.\" Authorities said Abdul Razak Ali Artan, 18, plowed a small gray Honda into the crowd outside Watts HalI, then jumped out and attacked with a butcher knife. Authorities believe he was inspired by ISIS. The latest from America’s immigrant sex crime epidemic. One refugee, Mohamed Dirshe, raped two boys at a Kansas Catholic high school, after Catholic charities gave him a home and a job there while entrusting him with their youth. In Minnesota, authorities charged Somali born Ahmed Hersi Abdi with two degrees of first-degree sexual misconduct for allegedly raping a 10-year-old girl in her apartment. According ...","commenter_a":"The United States of America should have the right to protect itself from those people who would do it harm it's not about religion or race it's about keeping very bad people out of this country","post_message":"Federal Court Rules Against Reinstating Travel Ban  Your reaction?"},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"},{"comment_id":"10153779129081336","commenter_b":"If she took responsibility where is the jail time?","commenter_a":"The fact that she is actually running in 2016 with all this going on shows me that there major sociopath here... MAJOR!! At least wait till the Bengazi investigation is over and maybe not in the front of our minds.. Can't believe she is running.. I don't get how people could vote for someone who lied straight face to the country ,,,","post_message":"\"I took responsibility, and as part of that, before I left office, I launched reforms to better protect our people in the field and help reduce the chance of another tragedy happening in the future,”  Hillary Clinton said a short time ago at today's Benghazi hearing."},{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":""},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""},{"comment_id":"10152686509170950","commenter_b":"Inbreds","commenter_a":"James Carville writes, \"There was nothing in the law that prohibited Secretary Clinton from using her personal email to conduct business as long as those emails were preserved, which they were. She preserved them and turned over all of them that had to do with State Department business -- 55,000 pages of them. But that's not enough for the right wing, who will continue to obsess over this issue until they find a new one. Let's watch the Clinton Rule in effect: Colin Powell and Jeb Bush also used their personal email, but they are held to a different standard in the press. Colin Powell admitted on ABC's This Week on Sunday that not only did he also use his personal email while secretary of state, but that he didn't preserve them or turn any of them over to the State Department as requested. Everyone went wild when they heard ...","post_message":"An archives expert tells \"Time\" that Hillary Rodham Clinton's methods for determining which emails to hand over to the government \"did not meet best practices.\""},{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"\"The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.\" Read Hillary's ideas for the economy in her own words:"}]
