[{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.\""},{"comment_id":"10153838572646756","commenter_b":"I've heard people complain about steak & lobster, but not produce.","commenter_a":"Odd that many who are not on food stamps complain when those who are eligible have carts full of healthy/quality food: seafood, steak, fresh produce. It's America -where life is a competition. If you need help, you stay at the bottom.","post_message":"People who rely on federal food stamps ate about the same number of calories, but consumed fewer fruits and vegetables and whole grains and more added sugars, according to studies."},{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"1588980671119277","commenter_b":"Agree all the way.the truth is black or white, can be proved.lies can not be proven.the cons get mad because facts on mostly on the liberal side. We can't help it if they love lies and are prejudiced to believe them.warped sub humans.","commenter_a":"Without fake news he and the GOP are dead in the water. Then all they have left is election rigging, voter suppression, and Gerrymandering. Oh yeah, and help from COMMUNIST Russia! And that just ain't enough!! #GOPTraitors","post_message":""},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"912315142139160","commenter_b":"I saw this on Fox & Friends this morning. I am so saddened by what this hero went through. Glad Perry was there to help him. My heart goes out to Marcus and all who suffer without the help they should get for free, for serving our country. Obimbo's leave no soldier behind is such a lie.","commenter_a":"Rick Perry for President or maybe Rand Paul!","post_message":"Do you know the story of Marcus Luttrell and Rick Perry?"}]
