[{"comment_id":"10154588771167178","commenter_b":"Are expecting any more snow or ice around Roanoke Rapids?","commenter_a":"Is it going to be windy today?","post_message":"WRAL Elizabeth Gardner is taking questions now about today's forecast and what you should expect. For the latest weather conditions go to wral.com/weather."},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""},{"comment_id":"481313708745082","commenter_b":"nimby. they do not want to see oil rigs, how ever it is okay to strip mind in my back yard to get sand to build the roads to their beachfront homes. what a bunch of hypicrites.","commenter_a":"Thank you @username for your support for our coast !!","post_message":"With all the updates today, I wanted to make sure that you caught this earlier post with my statement on the Administration’s decision to protect the Atlantic from offshore drilling...so I’m sharing it again."},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"},{"comment_id":"10153303444396051","commenter_b":"JFK worked for no salary.","commenter_a":"Wonderful! No salary or expensive vacations. That should lower the debt that Obama has racked up.","post_message":"Donald Trump plans on working for free if he's elected president. Do you like the move?"},{"comment_id":"10156001828650725","commenter_b":"Every illegal alien is a criminal. Their crime rate is 100%.","commenter_a":"There's barely any crime from an immigrant but way more crime with other ppl just saying","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their \"first-ever ready-to-wear collection.\""}]
