[{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"},{"comment_id":"891951477509756","commenter_b":"Hang the jihadi cunt for spawning the 2 Hajis. She is just as guilty!","commenter_a":"Can you fit two in the gas chamber?","post_message":"The apple doesn't fall far from the tree."},{"comment_id":"10153579142479170","commenter_b":"she's never right !","commenter_a":"Sorry the American voters frustrated you. You can just stay home and learn to deal.","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"10153544457476509","commenter_b":"Thanks","commenter_a":"Why are animals doing what animals do all of a sudden national news?","post_message":"What a catch! Hear photographer John Bailey describe stumbling onto the powerful sight of a bobcat pulling a shark from the ocean: @webpagelink"}]
