[{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"10153186374039497","commenter_b":"If only this were all fiction........","commenter_a":"James Tatham. I very much like @username's humour.","post_message":"This Week Last Year:"},{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"1535105376549586","commenter_b":"We need to deport her ass","commenter_a":"Yes","post_message":"Do you think she deserved 7 months in jail for urinating on a war memorial?"},{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"845590435487585","commenter_b":"There are many ways to keep from getting pregnant and they can be gotten for FREE!!! There is no excuse for getting pregnant!!! Abortion is a crime!!","commenter_a":"Give the moms the hope that they will be helped with expenses after their baby is born...don't vote down programs to help the poor.","post_message":"Tell Congress it's time for them to protect LIFE!  CLICK HERE to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"},{"comment_id":"1439879839405093","commenter_b":"@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"}]
