[{"comment_id":"694571907348646","commenter_b":"Lmao!!! @username","commenter_a":"Josh Wilson Connor Bobthebuilder Bithell","post_message":"Chocolate lovers can't seem to get enough of this nose candy. #MicBrights"},{"comment_id":"10153150465564255","commenter_b":"Because man created god in his image and saw that it was good.","commenter_a":"well one thing it never said JESUS was ethiopian and he was born in bethleham so Jesus 90% chance was not black but i do not see why it makes a difference","post_message":"Why do churches use a historically inaccurate image?"},{"comment_id":"10153370562061336","commenter_b":"Drugs are illegal. I bet you could buy all the drugs imaginable in an hour. Guns would be the same if outlawed","commenter_a":"He is such a big fat piece of trash !! He always point out stuff that is the most stupidest crap Iv ever seen !! That boy could have made a bomb or took a knife or a bat in there and killed people also ! So should we take away knifes and bats ! People around this guy didn't know he was crazy ? I feel like people are trying to set it up where they take away all guns then they could do what ever they want to to us ! Guns don't t kill people crazy people do and if it wasn't a gun itd been some thing else he'd killed people with ! I hate that this happened I'd never want any one to get hurt or killed we all need to be as one !! We are all Americans first !!!","post_message":"“We do know that once again innocent people were killed, in part, because someone who wanted to inflict harm had no trouble getting their hands on a gun.”  President Barack Obama spoke moments ago on the #CharlestonShooting: @webpagelink"},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"1402706749758182","commenter_b":"Awesome Donna! Way to #GrabEmByThePussy !","commenter_a":"No to Any replacement for Trump! No to Pence!! He could Never beat Hillary. Remember almost 1/2 of America did not even know who Mike Pence was a week ago and the V debate had poor ratings. 40 percent of America wull stay home on election day.","post_message":"Sen. Johnson kicked off Manufacturing Month with a special video message to students touring Pewaukee manufacturer TLX Technologies during their open house. Hundreds of students visited the business throughout the day to learn about careers in manufacturing."},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"},{"comment_id":"10154308989386028","commenter_b":"Haha no way","commenter_a":"Screw San Diego all the tight pants wearing hipsters they can keep their f****** team","post_message":"A plan to move the San Diego Chargers to Los Angeles is almost a done deal, multiple sources tell NBC4's FredNBCLA. @webpagelink"}]
