[{"comment_id":"1415056648547094","commenter_b":"Blacks should all go to Africa and start a country called \"obamasthan\"... If they want out, get out. The intelligent blacks and whites and Hispanics will help them leave. No US citizenship. Good bye!","commenter_a":"Show me the money!","post_message":"Check out his plan..."},{"comment_id":"914975468564571","commenter_b":"Yup the woman is a <unt","commenter_a":"The mayor told the police to stand down and let them destroy the city so blame her and your president","post_message":"BALTIMORE: Shop Owners called police 50 TIMES  and no one came!  @webpagelink"},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"10156001828650725","commenter_b":"Every illegal alien is a criminal. Their crime rate is 100%.","commenter_a":"There's barely any crime from an immigrant but way more crime with other ppl just saying","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"10153216182159087","commenter_b":"Your FAILED IRAK WAR, for one, you stupid evil BITCH...","commenter_a":"Hey, Obama, WHY don't you have any decent responses on your EVIL warmongering failures around the world?... just cowardly U.S. policies... your shamed administration should at least stop being so hipocritical...","post_message":"“We can’t have no response,\" says Michael McCaul. \"And this administration has absolutely failed to put any sort of consequence on their actions.”"},{"comment_id":"10153522197479255","commenter_b":"Fuck you, lady.","commenter_a":"This people have been drinking the Kool-Aid!!!","post_message":"Obama is officially the best president the U.S. has had in a long, looong time.  By Daily Kos user PCalith"},{"comment_id":"10154196354922541","commenter_b":"She looks ridiculous","commenter_a":"love it!","post_message":"In case you missed it, Beyoncé’s pregnant."}]
