[{"comment_id":"10153370313159071","commenter_b":"Elaine Daly 😂😂","commenter_a":"Excel is childish approach towards industry of information and finance. Furthermore the database tools it offers is fluid and prone to human mistakes.","post_message":"Mastering Excel puts you way ahead of the competition."},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"10153061326484586","commenter_b":"this is sick how the hell does this go unnoticed","commenter_a":"tangeneng yan!!!!!","post_message":"HARD TO BELIEVE:   Do people know that THIS could be what they're paying for when they buy leather?!   [Warning: Some of the most GRAPHIC footage] #DogLeather"},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"10153554876193010","commenter_b":"Yes send them all back,","commenter_a":"Welcome to socialism.","post_message":"The children at this San Bernardino motel pay no attention to the meth dealers on the sidewalks. To the men in nice cars driving slowly through their makeshift play area scanning the doorways for prostitutes."},{"comment_id":"10157784004785206","commenter_b":"Those poor girls should be removed from her household. Smh.","commenter_a":"SHe WIggity Wack!","post_message":"Nina Peterson has made over $1 million being a companion to older rich men, but she insists she’s not a prostitute."}]
