[{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"},{"comment_id":"828297687360808","commenter_b":"she should be dropped from Food Stamps and made to work to pay for everything she's destroyed that is not right she needs to lose a little weight anyway","commenter_a":"Jobs and multiple job... Life isn't free..","post_message":"This is exactly why people should not be given money for doing nothing.  Are you sick and tired of Welfare leeches taking your money?"},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"10153673371886336","commenter_b":"Exterminate them all","commenter_a":"And they wonder why their lives don't matter?","post_message":"Scott Lattin and his family painted the words “police lives matter” on the back window of their truck.  Then, someone spray-painted obscenities about the police on their car and wrote “black lives matter” in spray paint across the side of the truck.."},{"comment_id":"1256658817687479","commenter_b":"Lady I think you need a snickers bar.","commenter_a":"Yeah be on the lookout! They have white skin, blondish hair, blue/gray eyes and they shoot up movie theaters, churches, schools and clinics! Oh my bad, wrong terrorists!! Please continue! Smh....a bunch of fucktards.","post_message":"After masquerading for months as a newly Americanized housewife, Tashfeen Malik dropped the facade in a burst of gunfire."},{"comment_id":"10152919389451491","commenter_b":"I always knew that America needed more violent rape on TV.","commenter_a":"Patrick","post_message":"Game of Thrones is famous for its tragic weddings, but last night the show pushed that into even darker territory."}]
