[{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"\"You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"}]
