[{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"},{"comment_id":"966904363440661","commenter_b":"Says the liberal tard cat lady","commenter_a":"What would you expect from a woman with 1000's of nude/lesbian porn pics on the internet to wear? She's a hoe and trump a con artist. The Whitehouse is going from class to trash.","post_message":"When people saw what Melania Trump wore to mass, they were simply outraged. Do you think what she wore was appropriate?"},{"comment_id":"1460895663923103","commenter_b":"😂😂😂😂😂😂😂😂😂 anit about that choking life not catching a M charge for no girl 😂 lool","commenter_a":"@username 😂😂😂","post_message":"It really be like that  #WSHH"},{"comment_id":"899421576802371","commenter_b":"Stupid BITCH !!!","commenter_a":"Why don't you release your vitriolic hatered towards the real enemies the Muslims, the Obama administration, Hillary Clinton, the democrats, black lives matter and other groups like that and anyone on the left that thinks like you. Unfortunately the rest of us don't have the money to buy protection so we have to protect ourselves. There is not enough police to protect everyone. I use to like you but I don't anymore.","post_message":"Actress Rose McGowan Unloads Hate-Filled Rant Over Muslim Murderers Syed Rezwan Farook and Tashfeen Malik. Her target: American gun owners and Republicans.    Sorry, Rose, but we poor, regular folks can't afford ARMED bodyguards and a million dollar house like you and your Rich Hollywood Liberal pals.  #elitist #1Percenter"},{"comment_id":"10153159766848701","commenter_b":"Pigs... Sterilize them both!!!","commenter_a":"Slam thier ASS in jail till they both get the hell beat out of them or killed by inmates.. Thier parents are proud of them now ...","post_message":"A man and woman charged with murder are accused of starving their 7-week-old baby to death in Douglas County."}]
