[{"comment_id":"1354339577942641","commenter_b":"Education, do u have?","commenter_a":"I f*****g hate Islam.","post_message":"Behold the peaceful religion..."},{"comment_id":"1000913466673540","commenter_b":"Trounce her lying ass!","commenter_a":"Don't run like Romney....","post_message":"Take our new CLASH Poll. Should Donald J. Trump play nice or ... should he put The Hildebeest on ICE? @webpagelink"},{"comment_id":"10153585954722994","commenter_b":"White people are the terrorist.....not Muslims","commenter_a":".","post_message":"After last week's attack in Tennessee, this man showed up at a military recruitment center with his AR-15 - but preventing another attack isn't why he did it."},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10153369236751051","commenter_b":"Bitch got what she deserved..","commenter_a":"I am happy for the boy to let his real self show that bully get what she needed..","post_message":"This boy tried to stay calm in the face of relentless bullying from a girl on his bus. Finally, he just couldn't take it anymore."},{"comment_id":"10152735279906135","commenter_b":"If there were more moms like here this would not be happening","commenter_a":"Good for Mama!","post_message":"\"What the [BLEEP] is wrong with you?\" Baltimore mom gets fired up after seeing her son cause trouble on TV."},{"comment_id":"10153976851960950","commenter_b":"Hillary husband, Bill Clinton, makes Bill Cosby look like a Saint.....","commenter_a":"Bring it baby. I used to feel sorry for Melania, but she is as bad as her bully pervert of a husband. All Trump cares about is his money. All Melania cares about is Trump's money.","post_message":"She is demanding a retraction and apology."}]
