[{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"10153548365891350","commenter_b":"You girls are so funny I love how jealous women can be towards each other. GET OVER IT! there are lots of work out clothes like this. Just cause YOUR ASs can't fit in it doesn't mean everyone else that looks good in this type of workout clothes has to stop wearing them! Jealouse? Shut up bitch go run in the treadmill then!!!!","commenter_a":"What's the issue...? Some moms look like this, some are chunky. I had a very nice body after my first son, trying to get back to that now after having my second. There's nothing offensive about this at all, some women are just bitter and resentful.","post_message":"This was probably not the reaction Bugaboo was expecting..."},{"comment_id":"10155002829744411","commenter_b":"Leaks: the new news.","commenter_a":"u re a loooooser baby ...so why dont you kill yourself....","post_message":" appears, however, that after eight years the administration has suddenly awoken to the threat."},{"comment_id":"669515329853116","commenter_b":"obama's peaceful religion! muslim Orcs bring intolerance, hate, terror, destruction, and death. The culture and \"civilization\" manufactures nothing else but!","commenter_a":"Just why would you call her crazy. They can flip into terrorism at any time. The parents should not have hired her. Stupid.","post_message":"Russian police arrested the nanny and charged her with murder after she was found at a subway station holding a child’s severed head, yelling \"Allahu Akbar,\" according to reports."},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"},{"comment_id":"892938524096132","commenter_b":"Don't hate immigrants--- hate law breakers. Invaders have to be stopped. Tax payers can't afford them. Do it legal or don't come at all.","commenter_a":"Why do you all hate immigrants? Your grandparents were immigrants.","post_message":"In the U.S. House Judiciary Committee, we introduced legislation to strengthen the interior enforcement of our immigration laws by allowing state and local governments to enforce federal immigration law. By doing so, we remove the ability of this or future Presidents – of either party – to systematically shut down portions of the law to suit their political purposes. WATCH:"}]
