[{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"889715544460386","commenter_b":"So tired of this progressive rant. If you come here illegally you need to go home. PERIOD!","commenter_a":"Are they trying to lose the election?","post_message":"She says the holiday-season roundups were \"mass deportations\" that are sowing \"division and fear.\""},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"},{"comment_id":"10153643721675399","commenter_b":"Couldna said it better! <3","commenter_a":"Well, Clinton IS the least batshit crazy Republican running...","post_message":"He also called Trump a \"narcissistic BULLYionaire\""},{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"1089590774419709","commenter_b":"The most stupid people in America are and has been those always vote against their own economical interests. While the Democrat Party still was the people's party, all the aforementioned idiots were working class Republicans, but not anymore. Now the most disgusting idiots are Democrats whom supporting Queen of Monsanto, Hillary Clinton.","commenter_a":"Vote for the ONLY Candidate who stands up against Monsanto! Bernie Sanders!","post_message":"“If Monsanto gets its way, the American people will pay a high price for corporate greed and political corruption.”"}]
