[{"comment_id":"10153631699856680","commenter_b":"Voter beware..","commenter_a":"We need to Unionize and fight back go on strike. I want those Rust belt Democrats to lean left and far left.","post_message":"They used to be Democrats. Now they really could hand Donald J. Trump the White House."},{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"547509162098460","commenter_b":"I can t push like I push agree!","commenter_a":"sounds like you support clinton ted","post_message":"Our nation is at war. From 9/11 to the Boston Marathon, from Fort Hood to Chattanooga, from San Bernardino to last night’s horrific attack in Orlando, radical Islamic terrorism has declared jihad on America. Early reports indicate the Orlando terrorist had pledged his allegiance to ISIS, and he had previously been investigated by the FBI. And yet, as with the prior attacks, we were not able to act to stop this act of vicious terrorism that has now murdered 50 and injured more than 50 others.   Our hearts go out to those killed and wounded last night. Our prayers are with their families, and with all their grieving loved ones.      It is a time for action. We need a Commander in Chief who will speak the truth, and who will unleash the full force and fury of the American military to utterly destroy ISIS and its affiliates. We need to pass the Expatriate Terrorist Act, so that known ISIS terrorists cannot use U.S. passports to return to America and wage jihad. We need a President who is serious – who will identify the enemy by name and do everything necessary to defeat it.   The next few days will be sadly predictable. Democrats will try to use this attack to change the subject. As a matter of rigid ideology, far too many Democrats – from Barack Obama to Hillary Clinton – will refuse to utter the words \"radical Islamic terrorism.\" They will claim this attack, like they claimed every previous attack, was isolated and had nothing to do with the vicious Islamist theology that is daily waging war on us across the globe. And they will try to exploit this terror attack to undermine the Second Amendment right to keep and bear arms of law-abiding Americans.   Enough is enough. What we need is for every American – Democrat and Republican – to come together, abandon political correctness, and unite in defeating radical Islamic terrorism.   ISIS doesn’t just target soldiers. They don’t just target Republicans. Or Jews. They also target Christians and fellow Muslims. They target each and every one of us. As we saw this morning, they target the gay and lesbian community. Their objective, which they broadcast worldwide, is to murder or forcibly convert every single American.   For all the Democrats who are loud champions of the gay and lesbian community whenever there is a culture battle waging, now is the opportunity to speak out against an ideology that calls for the murder of gays and lesbians. ISIS and the theocracy in Iran (supported with American taxpayer dollars) regularly murder homosexuals, throwing them from buildings and burying them under rocks. This is wrong, it is evil, and we must all stand against it. Every human being has a right to live according to his or her faith and conscience, and nobody has a right to murder someone who doesn’t share their faith or sexual orientation.  If you’re a Democratic politician and you really want to stand for LGBT, show real courage and stand up against the vicious ideology that has targeted our fellow Americans for murder.   Today, all of America stands in solidarity with the people of Orlando. All of us should lift them up in prayer, demand action, and if you have any information about the Orlando shooter or potential radical Islamic terror plots, please act to keep us safe by using the FBI tips website: @webpagelink"},{"comment_id":"10156430237125294","commenter_b":"Lol the military spread photos with weapons like we were suppose to","commenter_a":"As a photographer I wouldn't have taken this picture. A girl and her bow is a great idea. But not in a threatening manner like this.","post_message":"She has to give the school another photo. But, her mom is asking why someone else was allowed to do it in the past..."},{"comment_id":"1074790329229886","commenter_b":"You're going to be the sad one when this country has the problems all countries that Muslims populate have, rape murder persecution. All countries that are being invaded by \" refugees \" are living in fear, there are NO success stories of peaceful Muslims coexisting","commenter_a":"These comments reflect a said piece of America that just wont die... Progress has left you behind, blind and ignorant. You worship a billionarw who says he cares about you while sending your jobs overseas, knows nothing of history, and can't answer direct questions about policy. The world mocks you, I pitty you","post_message":"A GREAT NIGHT IN IOWA! Thank you for all of your support. Get out and VOTE! TOGETHER we will MAKE AMERICA GREAT AGAIN! #IACaucus #FITN"},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."}]
