[{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"},{"comment_id":"1377243338962685","commenter_b":"@username Typical liberal retards dodging the question. This isn't a matter of immigration, it's a matter of letting in the right immigrants.","commenter_a":"Good welcome to all terrorist to Canada ..According to Qubiec attack police arrested two and says......The two suspects are Alexandre Bissonnette and Mohamed Khadir Two students including one of 'Moroccan origin' have been arrested for the slaughter of six people at a Quebec mosque ...Mr. PM you are really trying to kill innocent people ...Idiot. .","post_message":"Six people were killed and eight wounded when gunmen opened fire at a Quebec City mosque during Sunday night prayers, in what Canadian Prime Minister Justin Trudeau called a \"terrorist attack on Muslims\"."},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'\" one parent said."},{"comment_id":"10153079641390950","commenter_b":"Bitch, fuck you and the white man!","commenter_a":"Jorge Ramos can kiss my hispanic behind! Go back to Univision y callate la boca! Legal hispanics are tired of paying for ANY illegals from ALL COUNTRIES (not only Spanish speaking) with our hard earned tax dollars!","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."}]
