[{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"868334796545922","commenter_b":"Heather go live in that cave","commenter_a":"If the public would STOP using Craigslist, it would shut down...as long as people continue using it they will stay open.","post_message":"Georgia police have confirmed that two bodies found Monday were identified as Elrey and June Runion. The elderly couple vanished last Thursday after they went to meet someone who had responded to a Craigslist ad they posted: @webpagelink"},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."},{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"10152949556817061","commenter_b":"Women was created for man , but to reach its own God is not pleased and we all will be judged. If thus world don't change from wicked and evil ways it will be destroyed just as God promised in the wink of an eye like a thief in the night. His timing know one knows but keep it up it'll be soon","commenter_a":"To all you naysayers: IF MARRIAGE IS SO SACRED, BAN DIVORCE.","post_message":"BREAKING UPDATE: US Supreme Court rules same-sex couples have constitutional right to marry: @webpagelink"}]
