[{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"10152793243512144","commenter_b":"They all want to save these illegals l, as long as someone esle does it. I say for every liberal who wants a say in this, place one illegal in thier home. That's immigration reform!","commenter_a":"'Overflowing sewage'.......yes liberals are","post_message":"\"Overflowing sewage\" will do that."},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"1001645919925097","commenter_b":"why don't she shut the f up and leave","commenter_a":"Open her mouth.","post_message":"Rosie O'Donnell isn't qualified to ___________."},{"comment_id":"908443172532257","commenter_b":"She should have NEVER been arrested to begin with !!!!! Anyone who would arrest an AMERICAN for carrying a firearm doesn't deserve to live in AMERICA !!!! PERIOD !!!!!","commenter_a":"Finally!!!","post_message":"Shaneen Allen, a Pennsylvania mother of two who didn’t know she was entering a “gotcha” zone when she drove across the New Jersey state line with a handgun in her purse, is clear of all charges following an 18-month legal ordeal in which a prosecutor had originally hoped to pursue harsh punishment as a caution to others. @webpagelink"},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"}]
