[{"comment_id":"771664696265472","commenter_b":"A 19 year old college student who apparently doesn't know history... It was actually Bill Clinton who trained and armed AlQuaeda","commenter_a":"Shouldn't have been there in the first damn place sleazy ass presidents....point the blame go head, this shit didn't just start....they just got more power...thanks America for taking my tax dollars and funding these weirdos","post_message":"A 19-year-old college student confronted Bush saying,“Your brother created ISIS.”"},{"comment_id":"10154346663693734","commenter_b":"Send this post to the wife's Lawyer. I'm sure the husband wouldn't put up with that if the rolls were reversed.","commenter_a":"This dude can't be serious😕😐😕.","post_message":"\"They need to learn to get along. If they love me the way they say they do, they will learn how to coexist in peace. That's not asking much.\""},{"comment_id":"10153098697497522","commenter_b":"Let's see how \"sassy\" you dumb bitches are when ISIS gets you. Take your #raisesassygirls bullshit to syria.","commenter_a":"#VOTE The Republican Radical Christian Crazy #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #RAISESASSYGIRLS #FeVoteRising #DontBeAwaLLfloWer #VOTE","post_message":"Is Donald Trump suffering from imposter syndrome?"},{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"10153900801473445","commenter_b":"Never mind I've heard it only the oil and certain illness so it's shit like Ga.","commenter_a":"@username get you a card!","post_message":"Big News! Ohio Becomes the 26th State to Legalize Medical Marijuana"},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"}]
