[{"comment_id":"1598931086790902","commenter_b":"The horrid hag hisses!","commenter_a":"The Blonde Deatheater attempted to weasel out of every single question. She couldn't even keep her lies straight (lies she was telling at the moment).","post_message":""},{"comment_id":"10153744058143132","commenter_b":"She's Still A Douche!!","commenter_a":"Doughnuts? I thought she smelled like Dalmatians.","post_message":"You can finally relax, Ariana Grande's fragrance ad is here."},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"1134766366641566","commenter_b":"nasty ass niggas","commenter_a":"Only if they cut it up for me @username @username","post_message":"Would you? #WSHH"},{"comment_id":"10153527716947623","commenter_b":"Trump will get enough advertising on Buzz feed by way of the anti Trump protestors acting like idiots. If you watch a video of people getting assaulted and are ok with it then you don't have much of a moral character. Why should America allow illegal immigrants to keep coming in and why shouldn't we have the ones here deported? There are legal ways of coming to this country use that rout and people will respect you more. Don't want to become legal then don't come to the USA. Stay in the country you are from.","commenter_a":"Wow, this is pretty pathetic. Considering Trump's numbers I believe we can infer he'll continue to do just fine without Buzzfeed's advertising lol. Can't wait to see their reaction this January! #Trump2016!","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"10154350131948145","commenter_b":"Yeah they'll definitely be jailed, they can track everything now","commenter_a":"@username, yep another one. Unbelievable!","post_message":"Hopefully they got to it before identity thieves did."},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."}]
