[{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"},{"comment_id":"1385223764854222","commenter_b":"Drive through these bloody pests.","commenter_a":"drag them off tie them up off the road direct traffic tho. Looking at the photo take to the right hand cuff or tie to the guard rail.","post_message":""},{"comment_id":"10153172465199255","commenter_b":"Bye Felicia!","commenter_a":"Thank God!!","post_message":"Whoa."},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."}]
