[{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"10155421751074062","commenter_b":"Another idiot...","commenter_a":"To late to act like your civil now !","post_message":"Black Lives Matter activists led a peaceful march in Houston on Saturday."},{"comment_id":"890315697769072","commenter_b":"@username boycott the Shamrock inn, this pos. people are more dangerous than animals.","commenter_a":"If the bear was causing harm that's one thing. But he wasn't, he was minding his own business only to be stalked by this idiot. Honestly, why don't we hunt down this creep and see how he likes it?","post_message":"A sad day for the hundreds and thousands of animals lovers who were following the story of Pedals the bear.  The bear that became famous for roaming around New Jersey on his hind legs like a human has been killed during New Jersey hunt.  A hunter shot the bear with a bow and arrow.  The hunter has reportedly been stalking Pedals for three years."},{"comment_id":"10154133539156509","commenter_b":"She is high on drugs of stupidity!","commenter_a":"Lol..","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10153712907532483","commenter_b":"@username, you need be aware that the Christian Bible never tells us to go out and kill others or to be vengeful. Any Muslim who believes the Quran as I believe the Bible would truly be a danger to most Americans.","commenter_a":"I want to speak out and let people know that there are a plethora of southern baptist churches that are very diverse. My pastor adopted his kids from Africa and they are black while he is white. It's a fantastic GODLY southern baptist church. Don't condemn all churches or all baptist churches or all southern baptist churches for what these people have done. This is very sad.","post_message":"\"There was pushback about... the types of children we were bringing in, and I was asked to not invite black children to [Vacation Bible School].\""},{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."}]
