[{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154829556541425","commenter_b":"Go home","commenter_a":"Thank you all for standing up against bigotry and stupid trump!!!","post_message":"We are live at JFK Terminal 4 arrivals #MuslimBan #MuslimBanprotest #nobannowall"},{"comment_id":"10154425895814087","commenter_b":"Let's all pretend Byrd didn't flip on racial issues. Let's pretend he didn't become a staunch advocate for civil rights. Byrd was honored by the NAACP. Your meme is fucking stupid.","commenter_a":"NEWS FLASH !!!! The only people happy with Trump are the ones that hide under sheets and dunce caps, while molesting children and raping disabled people, while burning crosses and churches! ! THIS IS BULLSHIT! !! LOCK TRAITOR TRUMP UP FOR TREASON! !!","post_message":"A spokesman for music producer Quincy Jones -- a Hillary Clinton supporter -- says he will not be attending Trump’s New Year’s Eve party and doesn't know why the Trump team said he would."},{"comment_id":"1071843699548997","commenter_b":"Lol stfu","commenter_a":"God Bless you Donald Jesus has CHOSEN you to lead our country !","post_message":""}]
