[{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"\"Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"1004919146212988","commenter_b":"I absolutely agree, bit discouraged by the corruption of our politicians which when it comes down to it is our own fault. But Liberty, freedom, and the right to self determination are Gods greatest gifts.","commenter_a":"agree","post_message":"Do you agree with Calvin Coolidge?"},{"comment_id":"1245414865499369","commenter_b":"Bad argument ladies...gentleman... Whatever you started out as","commenter_a":"If it's not a mental illness then they don't need therapy, you can't have it both ways... But oh wait, that's what you people do anyway lmmfao","post_message":"The bill goes directly against most counseling associations' codes of ethics. (via The Huffington Post)"},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."},{"comment_id":"1542774025748103","commenter_b":"As usual women come ro the rescue","commenter_a":"What kind of crap insinuating Hillary in this???","post_message":"YES!"}]
