[{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."},{"comment_id":"10155378344568132","commenter_b":"As phoney as her boobs...","commenter_a":"That fantasy world u r capable of living in will soon have u filing for bankruptcy Missie!","post_message":"Mariah Carey says she's \"incapable of being in the real world and surviving."},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"10152939381996770","commenter_b":"That's her right to do so. Now can we just move along here!","commenter_a":"@username's mother is just as big a piece of crap as he was.","post_message":"As the one-year anniversary of the death of Michael Brown nears, his mother says that she will never forgive Darren Wilson, the Ferguson, Mo. cop who killed him."},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10153252921156833","commenter_b":"Good for the homeowner! Its time these THUGS learn that our homes ARE NOT THEIR PROPERTY AND THEY CAN'T ENTER WITHOUT OUR PERMISSION.","commenter_a":"Love this...","post_message":"An Albuquerque Police spokesperson says that a homeowner awoke to noise in his house and grabbed a firearm, thinking there was possibly an intruder. The homeowner checked the house and found a man, identified as 28-year-old Robert Bartley, crouching in his kitchen holding what the man said \"appeared to be knife.\" According to police, Bartley approached the homeowner saying he was going to kill him."},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"}]
