[{"comment_id":"10153376789317550","commenter_b":"They are corrupt!!","commenter_a":"The judge also needs to be dismissed. Mosby is clearly biased and has acted with contempt throughout the whole process.","post_message":"The charges against the six police officers linked to Freddie Gray's death will not be dismissed and State's Attorney Marilyn Mosby will not be recused from the case, a judge ruled today.  Details here ---> @webpagelink"},{"comment_id":"1614697422150704","commenter_b":"We don't need these radicals in United States we have enough radicals of our own homeborn.","commenter_a":"Let her \"NEXT SPIT\" be in Saudi Arabia !!!","post_message":"Deport these radicals NOW!"},{"comment_id":"10153817603534497","commenter_b":"Feminism isn't a hate group.... lol Some feminists are cunts, but you can find cunts in every group of people","commenter_a":"That sad moment that a funny article about the majority of TV shows predictably lacking in certain areas turns into a feminist women hate spree. Need for feminism reconfirmed.","post_message":" part of my brain will just be switched off."},{"comment_id":"1352047571524023","commenter_b":"Lock her up","commenter_a":"Merry Christmas from Michigan","post_message":"Pat Dollard LIVE! The secret Truth of Obama"},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"10154680763616729","commenter_b":"So what makes you think her scores were low? What makes your comment racist is that you assume she was brought in to make quota and you assume she had low scores.","commenter_a":"Shocker! She is a person of color! Don't scream my comment is racist. It is a glaring problem in the military academies that they bring in people of color to meet a quota, thus depriving others that scored better of the opportunity to attend. These cadets have little to no respect for the US, the military or the academy. The all black cadet photo of them with raised fists of black power that went unpunished is a good example. Fuck Obama's America!","post_message":"No wonder this has gone viral."},{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"}]
