[{"comment_id":"10153113933254071","commenter_b":"Anders Rojas","commenter_a":"Jeyhun OrujovMalek MasAdil Mirzayev","post_message":"$10 million over the already insane $50 million asking price."},{"comment_id":"10154221052787869","commenter_b":"Immigrants aren't spending money with local businesses, if they aren't getting paid welfare checks. You're idea would only hurt the citizens of those cities. I agree that the federal funding needs to get cut for processing illegals, but lack of tourism would be cutting jobs, and hours for legal, working citizens that have nothing to do with it. Trust me, the working people in \"sanctuary cities\" want them gone, too.","commenter_a":"Not only should these cities lose their federal dollars, but people should not visit these cities and they will also lose their tourism dollars. Maybe they will cooperate then!","post_message":"One of Donald Trump’s most popular campaign promises was to end “sanctuary cities,” where local officials refuse to cooperate with federal immigration agencies on deportations.  This refusal to enforce the law makes these cities magnets for criminal illegal immigrants seeking to evade arrest and deportation and puts their citizens at grave risk (like Kate Steinle, the young woman allegedly shot to death in front of her family in San Francisco by an illegal immigrant who would have been in custody if local authorities hadn’t released him from jail instead of turning him over to the feds as the law required.)    Trump isn’t even in office, and already, some city leaders are having the same kind of tantrum we’re seeing from protesters in their streets.  The Democratic mayors of Chicago, New York and Los Angeles all defiantly declared that they’ll never give up their “sanctuary” policies and cooperate with federal immigration authorities.  L.A. police chief Charlie Beck also announced that his force will never work with Homeland Security to deport criminal illegal immigrants.  He said, “That is not our job, nor will I make it our job.”   Memo to these mayors and to the L.A. police chief:  As law enforcement officers, your job is enforcing laws, not protecting criminals.  If it takes cutting off your federal funds to force you to do your jobs and put your citizens’ safety first, then maybe that should be the very first cost-cutting measure President Trump takes to reduce the deficit."},{"comment_id":"10155076076173987","commenter_b":"You do realize refugees are the ones fleeing the terrorists right?","commenter_a":"Well, Starbucks, you give 10,000 refugees easy access to kill 10,000 veterans. Yeah, great plan.","post_message":"“To those who would suggest Starbucks is not committed to hiring veterans, we are here to say: check your facts,\" the Starbucks Armed Forces Network wrote in a letter to customers."},{"comment_id":"10154375635804342","commenter_b":"@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"},{"comment_id":"1511171265602298","commenter_b":"The Swiss do not have to do anything any muslim may demand! These muslims making demands that is not their place.Who the hell do they thik they are, they leave their land and move unwanted into another and they make demands? Sorry bacon lovers that is all the world will offer you. take it or leave!","commenter_a":"Works for me ?!... what hat ?!!!........ @webpagelink","post_message":"Ridiculous!"}]
