[{"comment_id":"1207705529241702","commenter_b":"@username the majority of Americans correctly believe these people are nothing more than an a animal. They are correct","commenter_a":"Christian values are under attack. The moral fiber of our country.","post_message":"\"The 'struggle for LGBT rights' in America is and has always been nothing more than a pretext for the complete disenfranchisement of Christians.\""},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."},{"comment_id":"10154455305884087","commenter_b":"Mike I'm with you exept the pre_existing what are people to do just die after the doctors and hospitals have done taking everything that is just morally wrong","commenter_a":"These people are so ignorant and out of touch it is ridiculous, that is one of the issues that got Trump elected. Repeal and replace, I am for a free market insurance health care. We do need to make sure that pre-existing conditions are covered, and letting parents insure their children until 26 is a good idea. If they need medical attention they are insured, and the taxpayer will not have to foot the bill.","post_message":"47 percent of Americans oppose repealing ObamaCare, while only 20 percent want it repealed immediately."},{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."},{"comment_id":"10154363261003816","commenter_b":"Pack your bags libs, because the wall is going up.","commenter_a":"If you're to dumb to get an ID you don't deserve to vote","post_message":"In testimony and filings in the case, the plaintiffs said that blacks and Latinos make up 44% of those seeking a free ID to ensure they can vote but only 9% of the overall voting age population in Wisconsin."},{"comment_id":"10152741444625950","commenter_b":"Well ladies, the Navy Seals BUDS training awaits you . You'll both cry, bitch, and quit within hours.","commenter_a":"I'd be scared too. It's simple - woman are NOT AS STRONG as men. It's a fact and when your dealing with the most dangerous and physically demanding covery ops - woman need not apply.","post_message":"Men in U.S. special operations forces don't think women can meet the physical and mental demands of their commando jobs, according to the survey."}]
