[{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"},{"comment_id":"1181915768493312","commenter_b":"This bitch is just flat out stupid.","commenter_a":"Die cunt!!!","post_message":"Hillary Clinton on Wednesday again criticized Sen. Bernie Sanders, for his stance on legal immunity for gun manufacturers."},{"comment_id":"724107867720000","commenter_b":"send thim all home, they dont belong in the USA.","commenter_a":"you dont like our flag go home","post_message":""},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration.  See more: @webpagelink"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"10155690406614199","commenter_b":"She started it. First of all she knew it would take her long so why didn't she let him go first. Second of all she poured her drink on him. At it sounds like she isn't very honest. And sorry but she looks like she's on drugs. This is what happens when you push people to far","commenter_a":"I think because she lied and she threw the first thing to get the conflict from verbal to physical either she gets punished or he gets off free. This is soo sexist if a guy threw a drink at a lady and she smacked him in response pretty sure she would get away with it.","post_message":"Police have released surveillance video from an alleged attack at a grocery store that tells a bit of a different story than the one the alleged victim gave."},{"comment_id":"967628599952830","commenter_b":"Treason is what most our crooked federal employees should be charged with","commenter_a":"When both the Republican establishment and the Democrat establishment attack the SAME candidate, then you know YOU'VE FOUND YOUR GUY!! DONALD TRUMP for PRESIDENT!! 🇺🇸🇺🇸🇺🇸","post_message":"Uh-oh..."}]
