[{"comment_id":"10152591837062061","commenter_b":"I like this","commenter_a":"For real!!","post_message":"Now that's wearable technology! China apprehends man trying to smuggle in 94 iPhones. abcn.ws/1waWmjv"},{"comment_id":"694546357374506","commenter_b":"Bullshit. She should go back under a rock!","commenter_a":"U MEAN HIS SON IN LAW IS INVISABLE?","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"10153635350921636","commenter_b":"He's definitely got issues!","commenter_a":"So kill urslf wtf","post_message":"'I could just kill myself and I wouldn’t have to face today'"},{"comment_id":"10153785606781636","commenter_b":"@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just \"rent\" a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."}]
