[{"comment_id":"1142286662534251","commenter_b":"Learn English you illegal immigrant","commenter_a":"Republicans or pathetic. I am for Trump as long as he is not for wars. Does not bother me if he is racist. At least I know where he is coming from. It is the ones who try to hide their racism you have to watch.","post_message":"None of the Republican leadership in Congress were at the meeting with Trump (nor were they invited)."},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the \"stone\" rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a \"stumbling stone\" for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"},{"comment_id":"10155472723180603","commenter_b":"Girls what happen to being ladies?","commenter_a":"Inexcusable! They should all be expelled and forced to repeat the school year...","post_message":"\"'All these other girls started jumping off the table into the fight,\" said 10th grader Raejah Bratcher. \"Everybody started screaming and people were on each other's backs. Everybody was just fighting, people running in, getting hit, and running out. It was crazy.\""},{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."}]
