[{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"},{"comment_id":"1306972999355460","commenter_b":"If they come after our guns we are so screwed...This is something we better not let them do...If ever we need to fight it will be when they do come for our guns....Wake up american's...That Muslim snake in the white house is out to get us and it looks like he will stop at nothing to destroy us and our country...","commenter_a":"Yes it will!","post_message":"“An armed citizen is nothing for me to worry about”"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: \"Yes, absolutely.  - via Fox News"},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10154970022528690","commenter_b":"The world and so call United Nation have no interest in alepo people just because they are muslim, if its christian region this is happening the UN will have take action, but we the muslims are just folding our arm doing nothing, the only thing is to back to Allah, by saying; HASBUNALLAHU WANI'IMAL WAKIL, WANI'IMAL MAULA WANI'IMAL WAKIL,","commenter_a":"there is tubelight, internet, electricity bla bla. it seemed she is speaking from hotel pan pacific Singapore. we didn't heard even a sound of bullet fired. weird.","post_message":"Residents of East Aleppo are giving their final messages to the world."},{"comment_id":"10158609012850725","commenter_b":"What an ignorant old hag smfh","commenter_a":"Time to round up all the black scum and jail them all. If found having done a crime they get death. The faster we get rid if those in jail too by death the better it is. They all are scum and should all be destroyed.","post_message":"A suspect has been charged with the murder of Karina Vetrano, whose gruesome death shocked the community and set off a six month search for her killer."}]
