[{"comment_id":"10152961317706636","commenter_b":"What an odious man, he should be stripped of his Irish surname, he's unworthy of it!!","commenter_a":"I'm sure that O'Reilly curses everyday his bad luck of not being old enough to have been part of the glory days he admires and sees as a role model of traditional values .... the book burning and massive rallies in Nuremberg....","post_message":"O'Reilly is rarely shy when it comes to the 'degradation' of conservative values..."},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"},{"comment_id":"596850543832294","commenter_b":"They can. And you have, traitor. I've gone from 80k a yr. income to less than 30k because of your bullshit. F you Brock insane obozo","commenter_a":"They're doing it you idiot. Must live under a rock.","post_message":"On the recent attacks, President Obama says no terrorists \"can ultimately undermine our way of life.\" Do you agree?"},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"}]
