[{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"\"Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.\""},{"comment_id":"10153851389446955","commenter_b":"@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10154449367595470","commenter_b":"Trump means GET RID OF MUSLIMS","commenter_a":"This is typical of the Hillary group","post_message":"Local republicans say they don't think the act of vandalism was done by a Trump supporter but they say they don't condone that type of behavior. They are hopeful it will stop and be replaced by actual conversations about opposing ideas."},{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."},{"comment_id":"10153245501553984","commenter_b":"This is a state matter not federal.If these Muslims can't live by the laws that are already here and set then I suggest they leave.Preferably the latter.","commenter_a":"go girl ... rippem up !","post_message":"Political correctness is NOT in this mayor's vocabulary.   Do you support her stand against Sharia Law?"}]
