[{"comment_id":"899517350083687","commenter_b":"GOD BLESS AMERICA ! We really need His Help !!","commenter_a":"Screw the Muslims and the Camels they rode in on!!!","post_message":"Pathetic! (MUST READ)"},{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"1147635848590103","commenter_b":"that evil woman will cause alot more problems for america","commenter_a":"HAHA!!","post_message":"North Korea has backed presumptive U.S. Republican nominee Donald Trump, with a propaganda website praising him as \"a prescient presidential candidate\" who can liberate Americans living under daily fear of nuclear attack by the North."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"1288485644498385","commenter_b":"she was going to get nailed for perjury and they KNEW IT","commenter_a":"Well.... Bye!","post_message":"In case you missed the bombshell late last night, Ben Shapiro resigned from his post as Breitbart News’ editor-at-large over the management’s “disgusting” treatment of Michelle Fields."},{"comment_id":"1203485969759238","commenter_b":"Send her big wampum","commenter_a":"Senator : Thank you.","post_message":"Great news! Yesterday a Texas court struck down the US Chamber of Commerce’s attempt to overturn a new Labor Department rule requiring retirement advisers to put their customers’ interests first. The decision affirms what we already knew: this conflict of interest rule was lawfully enacted and the rulemaking process took the views, costs, and benefits of all the stakeholders into account. Now President Trump needs to follow suit. He should stand up to the Chamber of Commerce — and the armies of lawyers and lobbyists that brought this frivolous lawsuit — and allow the rule to be implemented in April as planned.  Hardworking Americans saving for their retirement deserve to have a retirement adviser who is recommending the investments that are the best for their retirement security, not the ones that let advisers pocket kickbacks and prizes."},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."}]
