[{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"608123169320865","commenter_b":"F**K Oprah .......she's a Racist Bitch.","commenter_a":"Hey. Heads up. Being gay is no more of sin than lying. Stop being so judgmental. Leave that to God. He says to love one another; guess what, a lot of you are clearly struggling with that.","post_message":".............................yikes"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but \"Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"1151823781577341","commenter_b":"He claims he knows more about Isis than any one else","commenter_a":"As a Vietnam vet I may be able assist in the area of adjectives for Trump. I prefer using the term chicken-hawk. It pairs well with draft doger.","post_message":"This one is PERFECT."}]
