[{"comment_id":"10153241147678984","commenter_b":"They can go crawl up a hog a-- with there counter parts the muslims.","commenter_a":"All the way !!!","post_message":"The stuff liberals are already saying about Ted Cruz is just disgusting...  Do you support Ted Cruz in the face of liberal criticism?"},{"comment_id":"10155447745046509","commenter_b":"HAHAH NNeta Fitria","commenter_a":"She works at Comcast now and has hung up on me 7 times.","post_message":"\"Ain't nobody got time for this.\""},{"comment_id":"519848751523867","commenter_b":"Zel Zainoor and Arez Ezman does this help?","commenter_a":"Psyco people now have an excuse to feel normal.","post_message":"Don't you just want to squeeze him?"},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"10154465654928908","commenter_b":"@username Now you want to talk about owning slaves, I don't know, maybe you do, but it is the year 2016... time for major changes in this world....","commenter_a":"Is this a good thing or a bad thing... killing of new born male chickens is a bad thing, but now genetically creating only females doesn't seem right... maybe people should just quit eating chickens.....","post_message":"Newly developed technology will determine the sex of each fertilized egg before the chick inside develops - enabling the removal of all male-identified eggs from the hatchery. This will eliminate the industry need to heartlessly grind male chicks once hatched"},{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"}]
