[{"comment_id":"1584256221591722","commenter_b":"Donna, STFU!!!","commenter_a":"When my kids were young and one of them had pulled some lame brain stunt but I wasn't sure which I'd start a mild-mannered conversation about it when they were all present. Sure enough one of them would just sort of drift away--go outdoors or to his room. It was an instant notification as to whom the culprit was. So the Puffy Orange Juvenile is drifting away? Bingo! That's enough for this old mom.","post_message":""},{"comment_id":"10153554692703984","commenter_b":"There's whores in all races, and drug dealers don't going stereotyping with that bullshit!!!","commenter_a":"A American should have right before any one from another country, should speak English and love the American way it's not just Mexican it's all.trying to bring their laws. Sorry America needs to stand up and fight for what's right.","post_message":"Hispanic employees were furious after this employer implemented this new rule, so they decided to sue.  But the employer won't be stopped. He says he has a good reason for doing this and they need to get over it...  Do you support the employer's decision?"},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""},{"comment_id":"1109422589147098","commenter_b":"Dumb whores for Trump","commenter_a":"He has no respect for anyone. Scum","post_message":"In a battle between Trump and Intelligence, Intelligence wins."},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"453039741550986","commenter_b":"Pretty and can shoot too !","commenter_a":"This maybe my new favorite person,what a gal!!!! She has more balls than the entire dem party,and half the repubs too!!! Thankyou girl!!!","post_message":""}]
