[{"comment_id":"10154389291904614","commenter_b":"@username....Aka: RACIST!!","commenter_a":"I don't wanna sound racist but did you know 68% percent of rape is commited by African americans in los angeles spew on me all you want I got the statistic straight from the FBI website","post_message":"LAPD is looking for a man who tried to sexually assault an 80-year-old woman in her Hollywood apartment, leaving her in critical condition and still sedated due to her injuries.   The victim opened the door to the attacker after he knocked, apparently targeting her at random, police said. He pushed into the apartment and beat her, but she was \"feisty\" and able to fight him off, an LAPD captain said.  The man, who was caught on surveillance video, is described as a black man 25 to 30 years old, 6 feet tall, 220 pounds. He wore a black Penn State hoodie at the time of the attack."},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"937962582913649","commenter_b":"I think Not... Voting is suppose to be a privilege, illegals don't have that privilege, they are illegal!!!","commenter_a":"I say if they vote, then they should work and pay taxes","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"1495765340483209","commenter_b":"Wow ease up on the drugs girl, you're delusional.","commenter_a":"Hillary, is the only sane choice. Trump is the village idiot. Daily mail must be endorsing trump. Plus, what's wrong with being short?!!","post_message":"She hasn't got her way...and she won't get commercial breaks for coughing fits or fainting spells"},{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"}]
