[{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"},{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"1676742522602038","commenter_b":"#Trump could be 1st in history to win all 50 states according to linguistic #genius. @webpagelink","commenter_a":"This shows you how corrupt the media truly is!!! This was posted 9-15-2001 by the NYPost.com. It has since been deleted because it proves TRUMP is right about them celebrating on 9/11 in Paterson, N.J. : DELETED POST URL: @webpagelink The nice thing about the web is it is NEVER truly gone! Here is an archive of the post they deleted: RECOVERED DELETE POST THEY ARE TRYING TO HIDE! @webpagelink Quote from their article proving Trump is right even though they claim to never have said such things! \"Here in New York, it was easy to get angry listening to Egyptians, Palestinians and the Arabs of nearby Paterson, N.J., celebrate as they received word of the murderous attacks in New York and Washington. But Mayor Giuliani (who has been tireless and magnificent in this crisis) rightly warned New York- ers that it would be wrong to take their anger out ...","post_message":"Look at the editorial I was just sent from the New York Post on 9/14/01 - 3 days after collapse of WTC. Any apologies?"},{"comment_id":"1379793182036339","commenter_b":"because her goal is selfish...not to make HIM successful...not to help America....but to HELP HERSELF....","commenter_a":"They all say they have the answer when they're campaigning. I've always wondered the same thing...why the hell don't they tell someone, then??","post_message":"Here's another question that I have: If Hillary Clinton has the answers for the economy, why doesn't she tell Obama what to do now?  Why do we have to wait until she maybe gets elected and then gets inaugurated and then starts putting her ideas into practice?  If she's got the answers, why wait?  Why doesn't she make it a point to meet with Obama, who's in the Oval Office and say, \"Barack, this is what we need to do to fix the economy\"?"},{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."}]
