[{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""},{"comment_id":"1807363586202385","commenter_b":"Yes WE NEED TO LOCK HILLARY AND HER FRIENDS UP!","commenter_a":"Hell yes !!!!!!!","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"1062072083905575","commenter_b":"@username this is the saddest thing I have ever seen","commenter_a":"AND SOME OF TH AUDIENCE LAUGHED? Grrrrrrr!","post_message":"UPDATE: See the response from Caleb's dad and school, plus CALEB GIVES HIS LAST LINE! WATCH: @webpagelink  PREVIOUS: A 6-year-old boy with autism was brought to tears on stage when a teacher grabbed the microphone away from him when he was about to speak during his school's Thanksgiving play. Caleb was dressed as a turkey, and just wanted to say, \"gobble, gobble.\" STORY: @webpagelink"},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"10154741880843145","commenter_b":"Illegal immigrants? Not for long bye!","commenter_a":"Why should I leave Lisa I didn't make the mistake of voting for his sorry a$$.","post_message":"WATCH: President Trump announces Alexander Acosta as his pick for labor secretary. Here's the latest: @webpagelink"},{"comment_id":"10152808578696130","commenter_b":"Sadly, I could post these articles about pitbulls all day long and never be finished","commenter_a":"The purebreds are a very dangerous breed. Statistics do not lie.","post_message":"\"This bill would make Mississippi the only state in the nation with a statewide policy discriminating against a specific dog breed, and the impact on local communities, animal shelters, and law enforcement would be disastrous.\""}]
