[{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."},{"comment_id":"10152647217041680","commenter_b":"Oh no!!! Millions of jobs added with deficits cut by more than half!!! Stop the tyranny!!!! #TeaPartyFail","commenter_a":"Only 679 days left of Scum Monkey Rule.","post_message":"German Foreign Minister Frank-Walter Steinmeier was reacting to a letter signed by 47 Senate Republicans warning Iran that any nuclear deal it strikes with Barack Obama will be non-binding and easily undone. @webpagelink"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"10153687260803188","commenter_b":"He will make a great mayor of crazy town","commenter_a":"Glenn. Enough. We like Trump. We will figure this out . Let it be. Trump 2016.","post_message":"Oh, now I see why Donald Trump lashed out today.    He got bad coverage in the NYTimes and research on the conservative voting base.  I just thought it was a typical trump circus non sequitur.  I hadn't seen this story until now.  I feel sorry for him.   It just isn't going to end well for him.  Maybe I am wrong but I just don't think the American conservative likes the bully act.  Is everyone who disagrees with him:  fat, ugly, stupid, loser or failing?  It is amazing to see anyone not in the Obama White House with an \"enemies list\" this large.  Be fore he ran for president he was always a nice hotelier to me and my family.     I said four weeks ago that I did not want him on the show as the only thing to be gained was fifteen minutes of ratings and seeing that my ratings have never been higher nor have my commercial rates been higher, I didn't feel it was worth the trade of integrity.  He is welcome on many talk radio shows.  Not mine.  I will stick with Cruz, Carson, Fiorina, Santorium, Paul and tomorrow Bobby Jindal.  My audience rates Donald Trump consistently in tenth place in the race.   We have spend the last 16 years learning about progressives.  My audience is not fooled.  @webpagelink"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."}]
