[{"comment_id":"569672173222127","commenter_b":"Why does this women even receive a paycheck? I'd rather they give that money to a homeless woman in front of a 7-Eleven. You'd probably even get smarter conversation.","commenter_a":"Wasting your breath talking to these Trump members on his staff. They're like the movie The Stepford Wives! I think they all got their brains reprogrammed to say exactly what Trump wants & needs them to say to keep him looking sane!! It's scary!!","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say \"Islamic extremism.\"  \"If Fox didn't talk about this, they’d have nothing else to talk about,\" Holder said."},{"comment_id":"10153000852919197","commenter_b":"Put the plow down !","commenter_a":"Another fun icy Monday! Wha's up with that?","post_message":"It was definitely a slippery morning on most of the roads in the state. Check out this video from an eyewitness on I-84 in Newtown. Stay updated with the latest weather conditions here-->>@webpagelink"},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A \"small\" state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."},{"comment_id":"10153607644803984","commenter_b":"Vote all those dirt bag's out we need people with balls not vagina2","commenter_a":"Now how does everyone feel about this 'War Hero'?","post_message":"BREAKING: John McCain's secret move against arming our troops here at home just got exposed, and what he did is absolutely sickening.  McCain hoped this would never come out, but we're not going to let him get away with this.  If you want to hold McCain accountable for his deplorable actions that endangered our innocent troops, be sure to share this article."},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"}]
