[{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"1849294941953444","commenter_b":"Illegals don't pay taxes, they may pay sales taxes, but one needs a social security card or a legal visa to get a legal job in America. Illegals are not immigrants, immigrants are people that came to the United States legally. American taxpayers should not have to pay for illegal activity, or anyone that came here illegally. I believe that all illegals need to go back to where they came from and return legally. If a child was born here from an illegal alien they need to go home with their parents, come back legally, they were born here illegally does not make them an American. All illegals should be thanking us for allowing them to stay for long, time for them to take what they have learned here in America and help the people in their homeland/country. Wait your turn like legal immigrants! No Mayor, NO state official, or ...","commenter_a":"Good for you NEW YORK!!","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"1711501568866157","commenter_b":"Another fool... how many Muslims are you taking home?","commenter_a":"More than half of the damn country is colluding to get rid of his incompetent dumb ass! On the other hand he doesn't even need to be investigated for colluding with Russia!!!","post_message":"Donald Trump's administration is to charge Barack Obama with treason for colluding with the Deep State to overthrow The President."},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"10150722681504999","commenter_b":"@username It seems to me that you are the uneducated one, very stupid also!","commenter_a":"Bringing a knife to a gunfight, no sane individual would attack a police station full of armed police with a knife. Religion really plays no part in this. Surely the man needed mental health treatment?","post_message":"Officers fatally shot a man who was wielding a knife and yelling “Allahu akbar” as he tried to attack a police station in Paris on Thursday."}]
