[{"comment_id":"10153829711751523","commenter_b":"Eirik, shut up ya punk ass bitch","commenter_a":"I seen him, but I'm not saying nothing!!!!","post_message":"UPDATE: Donald Rozga has been found safe!"},{"comment_id":"10154425895814087","commenter_b":"Let's all pretend Byrd didn't flip on racial issues. Let's pretend he didn't become a staunch advocate for civil rights. Byrd was honored by the NAACP. Your meme is fucking stupid.","commenter_a":"NEWS FLASH !!!! The only people happy with Trump are the ones that hide under sheets and dunce caps, while molesting children and raping disabled people, while burning crosses and churches! ! THIS IS BULLSHIT! !! LOCK TRAITOR TRUMP UP FOR TREASON! !!","post_message":"A spokesman for music producer Quincy Jones -- a Hillary Clinton supporter -- says he will not be attending Trump’s New Year’s Eve party and doesn't know why the Trump team said he would."},{"comment_id":"418283194962942","commenter_b":"They are all criminals, that why they call them Illegals.","commenter_a":"So you want to prioritize sending back students & children before the criminals. I see.","post_message":"This Texas judge is boldly standing up to the White House. Should more follow his lead?"},{"comment_id":"10154759718811178","commenter_b":"The Times does not have to worry about the leak, we all could hear and see how biased the moderator was.","commenter_a":"Birds of a Feather, always stick together....","post_message":"The NY Times let it slip they thought the moderator helped Kaine during the #VPDebate.  But it's what they did next that's getting attention."},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"\"Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?\""},{"comment_id":"10153222530101167","commenter_b":"Ken, We still don't have all the emails she deleted several so we really don't have the entire story. But if we did get anything on Obama that would make Impeachment even better.","commenter_a":"They need to close down the Benghazi Committee and put those resources to the Hillary Email scandal.","post_message":"Stunning news: It's not just that Republicans are using the committee to launch partisan attacks on Hillary Clinton. The committee is also accused of illegally retaliating against an active duty investigator."},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"}]
