[{"comment_id":"1020783114655014","commenter_b":"Hillary is a racist!!!","commenter_a":"always my president hillary clinton the best of live 100% help fanta t jolie kant","post_message":"Hillary Clinton holds a net favorability rating of 58 percent among Democrats -- an increase of nearly 10 points since October."},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."},{"comment_id":"1062574083799120","commenter_b":"Yay! Maybe your daughters can grow up to be war criminals! #progress","commenter_a":"I am joyfully and unabashedly with you Hillary! My two little girls are so excited. It means the world to watch them see the new possibilities in the US with you!","post_message":"The New York Times: Hillary offers \"a vision in which middle-class Americans have a real shot at prosperity, women’s rights are enhanced, undocumented immigrants are given a chance at legitimacy, international alliances are nurtured and the country is kept safe.\""},{"comment_id":"665680246955887","commenter_b":"Fuck u little pussy","commenter_a":"He is committing treason, disrespect for the flag and our country. He deserves jail time and exciled (spelled wrong sorry) from our country. People should not buy his music if possible it should be banned. Exciled him now not later. God bless the USA!!!!!!!!!","post_message":"This is absolutely traitorous. He should be in jail for this.  We're tired of seeing the flag disrespected. Let's start a movement to bring the American flag back...!  Can we get 50,000 'LIKES' for the American flag?"},{"comment_id":"1949307655356344","commenter_b":"Lies alternative facts deceitfulness racism and separation was exactly what Obama and the Democrats have done way before Trump was elected....that is why he won and until democrats realize it then Trump will get 8 years. I am a registered Democrat and I realized in this election just how racist lying criminals they are I voted for Trump and will give him a chance. I will never vote Democrat again as long as they keep doing what their doing by destroying this country","commenter_a":"I am not a Trump fan but I do believe in freedom of expression be it what it may We all have a right to voice our opinion and if she chose do it the way she did we all have to respect that America has always been great and Trump did not bring that greatness he has brought lies alternative facts deceitfulness racism and separation of a great country . I only hope that he is stopped before he deletes all the greatness in which this country was founded on","post_message":"24 Hours After The Grammys \"Make America Great Again\" Singer Posts Stunning News"},{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""}]
