[{"comment_id":"10152737954746051","commenter_b":"She should never have bred!","commenter_a":"It's too bad the parents cannot( will not) just pay the fee and get over it.","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about.  But no Democrat's ever admitted it."},{"comment_id":"1659099987677347","commenter_b":"Silence is a virtue girl, use it.","commenter_a":"why does everything have to be about color. if you dont care about a race then go live somewhere they are not. problem solved. but it sounds to me like you need to get ssaved.","post_message":"She said that “people of color” are always asked to give out awards or entertain, but are “rarely recognized for our artistic accomplishments.”"},{"comment_id":"10154227376546336","commenter_b":"She'll milk it til the end.","commenter_a":"There was never evidence to warrant charges. Hopefully, that reporter had her five minutes in the spotlight, and she's done in the field of journalism. What an insult to journalism!","post_message":"Breaking News: Charges will not be filed against Donald J. Trump's campaign manager Corey Lewandowski, Florida state attorney says."},{"comment_id":"843506072460327","commenter_b":"Nina Turner is wrong and she knows it!","commenter_a":"She obviously never Studied JFK","post_message":"Sanders’ camp: Democrats ‘court disaster’ with Clinton"},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"},{"comment_id":"685676394932163","commenter_b":"Throw her in jail.","commenter_a":"Plus she is now blaming her server stupidity on Collin Powell. Isn't that racist?","post_message":"The double standard..."}]
