[{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"10153123956077452","commenter_b":"🇺🇸😇❤️","commenter_a":"Jose","post_message":"BREAKING NEWS: A Marine has been found dead with a gunshot wound to the head at a shooting range at Camp Pendleton Marine Base."},{"comment_id":"1695824464005067","commenter_b":"@username here I even did your researching for you but you can pick from numerous articles about him dodging the draft. @webpagelink","commenter_a":"Trump you spent all night at your rally tonight, calling Cruz a liar and cheater. Your supporters don't seem to concerned about your non polices and non plans. Keep dodging Cruz in a one on one debate, it just proves that you're the real liar! Since you said you wanted a one on one debate with Cruz, you're a dodger in every way.","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"895578827165435","commenter_b":"nothing ever happens to her for her lies!!!!","commenter_a":"Keep digging, @username.","post_message":"As the Speaker notes— Having finally heard from Secretary Clinton yesterday, we are left with more questions than answers. These public records at issue are broader than Libya and broader than Benghazi. The Secretary of State has enormous responsibility and jurisdiction and the public, the media and Congress have a legal right to access these public records without impediment."}]
