[{"comment_id":"10153142130722235","commenter_b":"Girl/women also have far more uti's then intact men do.. In case you weren't aware.","commenter_a":"It's way cleaner. As a mom of an ADHD child that took several years to potty train and several more to learn to wipe correctly, I don't regret following my Drs & husband's advice.","post_message":"The main reason we have circumcision in the US today is not for the health benefits.   It’s because we’re used to it."},{"comment_id":"10156625299625354","commenter_b":"Give that girl a cigar!","commenter_a":"Oh, look everyone! It's another one of Obama's useful white idiots. She's never held a job in the real world. She's one of those who teaches, because she cannot do, and that's a trend that needs to come to a screeching halt worldwide. Meanwhile, the Muslim in Chief can use the foul mouthed, petulant child to help further his agenda of U.S. Islamization, because using dummies as incidious devices is what radical Islamists do best","post_message":"Liberal Values on grand display..."},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10154126843971254","commenter_b":"Yeah what ever and if the western woman didn't she'd be killed Mu idiots","commenter_a":"If a muslim man approached a western non muslim woman in the middle east and threw a niqab on her asking to wear it because she is in their country it would have went viral and all muslim would have been accused as extremists. We live in a world full of contradictions.","post_message":"'Our Britain, you live by our f****** rules'"},{"comment_id":"10154739260431509","commenter_b":"2","commenter_a":"Let's make a small poll: 1- Donald Trump 2- Hilary Clinton","post_message":"What was meant to be a fun day of riding roller coasters at the amusement park turned into a very scary ordeal for this family."},{"comment_id":"1805645433016457","commenter_b":"Congress stop her","commenter_a":"Hell Yes she's a racist traitor and one ugly Ass HE SHE or whatever it is.","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"}]
