[{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"},{"comment_id":"1809017339318525","commenter_b":"happened in bosnia too.","commenter_a":"...not the only nor first time.","post_message":"These cowards sat back and did nothing for 4 HOURS while this was going on!"},{"comment_id":"10157618931615389","commenter_b":"And Hillary has never lied right? Are you serious right now? Hillary has been exposed for who she is and it's not looking good for her. For she is so squeaky clean, why does she keep hiding from the media? She is always at home resting. She used her position to grant favors to foreign governments and took millions from them when they abuse women. You are worried about Trump being exposed on that debate stage? What a joke!","commenter_a":"The snake oil salesman's chickens come home to roost Monday night. Hillary & moderators will quickly expose the lying fraud artist for the flip-flopping liberal he's always been.","post_message":"\"Because they can't attack him on policy, they try to make it personal. They appeal to the emotions and the sensitivities of not only the black community, but the foreigners and females.\"  Pastor Darrell Scott said the Democrats don't attack Donald J. Trump politically because personal attacks are \"all they have.\""},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10153617966566051","commenter_b":"Becky Jensen sorry but you are a dumb bitch","commenter_a":"Thank God","post_message":"The man noticed that a woman was crying next to him in line. When he asked her daughter what was wrong, he knew he had to take immediate action."},{"comment_id":"1019686794754611","commenter_b":"Words that are meaningless. Go Hillary, really, go (away)","commenter_a":"whole as in Benghazi?????","post_message":"\"Despite what you hear, we don't need to make America great again. America has never stopped being great. But we do need to make America whole again.\"  Moments ago at her #SCPrimary victory speech, Hillary Clinton invoked Donald J. Trump's campaign."},{"comment_id":"1758501704379005","commenter_b":"That cow can't just shut up can't wait till she moves to Canada","commenter_a":"yes she is","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"}]
