[{"comment_id":"10154364606704445","commenter_b":"Guns didn't kill these poor girls their mother murdered them!!! That was her intent!","commenter_a":"Glad she was able to protect....oops, kill her family with her guns. Just another \"legal good gurl\" gun owner turned murderer after her latest hissy fit.","post_message":"Two sisters shot and killed by their mother in Texas are being remembered by friends and neighbors."},{"comment_id":"10153226865953132","commenter_b":"He's happy. That's all that should matter","commenter_a":"Sarah Nemes","post_message":"Bruce Jenner's children are rallying around his decision to transition to female."},{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"1751343418429993","commenter_b":"Bernie is to old and senile to be president. He would die in office.","commenter_a":"Your opponent is wishie washie she says what you want to hear","post_message":"I voted against the war in Iraq and I am vigorously opposed to an endless war in the Middle East that cost us trillions of dollars. What I am for is making sure that higher education is a right and ensuring that every American can go to college without living in debt."},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will \"immediately terminate\" it."},{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"}]
