[{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"946243322102083","commenter_b":"Vote UKIP","commenter_a":"And who listyens to this moron?","post_message":"Russell Brand who called voting 'a massive waste of time' no U-turns and says: 'Vote Labour'"},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"1696327707324773","commenter_b":"Flawless Pre lil ass threw it back in the family bathroom! 😂😂😂","commenter_a":"Flawless Pre TARGET (we had a home just got caught in the moment) 😂😂😂","post_message":"This should be interesting.  Comment below! #WSHH"},{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"10152881213667894","commenter_b":"Ciara can't sing, same songs to a different beat. She can compare herself to Mya or Ashanti who is and was a bigger artist then Ciara","commenter_a":"Hits yes, talent, no","post_message":"Do You Agree? Ciara Says She’s Had Hits 'Just as Big' as Beyoncé and Rihanna"}]
