[{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"\"I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"1031910293529802","commenter_b":"Stick to what u know lady. Some people don't much care for foreigners telling us what US values are","commenter_a":"She's a citizen by a marriage not by birth,besides she is just repeating what she hears loony clooney says","post_message":"DAUGHTER OF SUNNI MUSLIM, George Clooney Wife, Open Borders Activist And British Citizen Says Trump Doesn't Represent \"U.S. Values\""},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."},{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10153161345041336","commenter_b":"Good for the wife!!!","commenter_a":"Hooray!!!!! McDonald is hiring!","post_message":"Donald Sterling gave his mistress V. Stiviano a Ferrari, Bentley, and Range Rover and also covered the majority of her $1.8 million duplex.  But his wife, Shelly Sterling, just got it all back."},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."}]
