[{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."},{"comment_id":"937487649627809","commenter_b":"NO, NO, NO. Why is there even a question about this. Too many illegals in this country already. Do you want more?????","commenter_a":"Everytime I think I hear the dumbest thing ever, something else trumps it. I cant believe how unpatriotic some folks are now days. America is for Americans. Become an American and then you can vote. No intelegent group would ever let an outsider make a decision for them. It doesent make sense.","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"1066102216758740","commenter_b":"DON\"T choose Hillary!! Jump aboard the TRUMP TRAIN 2016! He will work for America!!!","commenter_a":"Why should we choose Hillary ???? Bill didn't he choose every other women BUT Hillary","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\"  President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""},{"comment_id":"10153165284351770","commenter_b":"This woman is so wrong for our country.","commenter_a":"This lady is delusional, don't they do mental checks before putting people in these high ranking positions??","post_message":"Attorney General Loretta Lynch suggested that President Barack Obama could call for Congressional action for increased gun control in the wake of the San Bernardino terrorist attack.  Read more: @webpagelink"},{"comment_id":"10154004285427061","commenter_b":"She is so ugly put a sack over her face","commenter_a":"I tried a similar comment above in my own post. Ppl are to busy thinking they are better or truly know or believe in the government to see the truth right in front of them. A little less attacking the comments of others on Fbk, an you could be smart enough to see the truth. Sure everyone deserves to dress lovely; however people continue to starve. Until you have walked a mile as I have struggling to feed your family/children; enjoy your fancy clothes. I will enjoy feeding my family!","post_message":"WATCH: Fashion forward First Lady Michelle Obama stuns at last night's White House State Dinner: abcn.ws/2ejwQwD"}]
