[{"comment_id":"1004322553035851","commenter_b":"Great point. Now- ALL women use shame to enforce social order among women, and men when they can get away with it. Men are the same with violence. ALL men. (And towards women when they can get away with it) Here a white women leveraged racism to solidify her place in her social order at that time. (The black male victim suffered death for that.) When enough white males clue in that women leverage \"male\" state and personal violence to enforce their own wishes, black lives will be saved.","commenter_a":"Female privilege. Didn't you know?","post_message":"Why Did Tyson Wait So Long to Reveal Carolyn Bryant Donham Lied About Emmett Till's Murder?"},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"10152686509170950","commenter_b":"Inbreds","commenter_a":"James Carville writes, \"There was nothing in the law that prohibited Secretary Clinton from using her personal email to conduct business as long as those emails were preserved, which they were. She preserved them and turned over all of them that had to do with State Department business -- 55,000 pages of them. But that's not enough for the right wing, who will continue to obsess over this issue until they find a new one. Let's watch the Clinton Rule in effect: Colin Powell and Jeb Bush also used their personal email, but they are held to a different standard in the press. Colin Powell admitted on ABC's This Week on Sunday that not only did he also use his personal email while secretary of state, but that he didn't preserve them or turn any of them over to the State Department as requested. Everyone went wild when they heard ...","post_message":"An archives expert tells \"Time\" that Hillary Rodham Clinton's methods for determining which emails to hand over to the government \"did not meet best practices.\""},{"comment_id":"683878711749701","commenter_b":"By the way, good little robot response, Hudson. Care to elaborate?","commenter_a":"I've always admired Colin Powell. Mr. Powell said the Iran deal is a good deal. That's good enough for me.","post_message":"The nuclear deal with Iran risks the safety and security of America and our allies. It must be stopped. #NoNuclearIran"},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"698436883649598","commenter_b":"What's the deal with these frogs.","commenter_a":"One of his few good decisions. General Mattis is a fucking fantastic choice","post_message":"Trump wants a military vet to be secretary of defense for the first time in over 60 years."},{"comment_id":"10152938707421130","commenter_b":"So did God fall of his throne and let Obama take over until he's better . I think not Obamas words are and have the hissss of a ankle butting supreme.","commenter_a":"I agree with the president. BB is a dick","post_message":"President Barack Obama tells HuffPost that he dismisses Israeli Prime Minister Benjamin Netanyahu's backtrack on Palestinian statehood."}]
