[{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…\" -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"1692614590979428","commenter_b":"you have to take care of Americans first..children, the homeless, our Veterans. why do our taxes go to m.f. illegals??????","commenter_a":"Come on congress stop stuff like this. He must to have your ok.","post_message":"Obama's budget sets aside $17,613 per unaccompanied minor that illegally crosses the U.S. border."},{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."},{"comment_id":"1089996267688050","commenter_b":"A woman who is drugged won't remember being raped. Guess that makes it ok?","commenter_a":"at least we don't remember it","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"981872948594888","commenter_b":"Ugly garment..her Mamma didn't teach her well at all.","commenter_a":"Yeah","post_message":"Hillary Perón"}]
