[{"comment_id":"10153235865056680","commenter_b":"Ha ha ha!!! HEY, EVE, IF YOU WANNA WALK LIKE STEVE, YOU GOTTA TALK LIKE STEVE!!! WOMEN, STOP WHINING LIKE GIRLIEMEN. Stupid biatch.,😂😃😆😅😲😱😨","commenter_a":"TRUMP WINS ALL","post_message":"“She’s playing that woman’s card left and right.\""},{"comment_id":"10153959431701756","commenter_b":"10,000 troops + ??? = Peace. Duh.","commenter_a":"Sure, send ground troops, take out Isis on a matter of weeks and then... What?","post_message":"Sen. Lindsey Graham says he wants to send in upwards of 10,000 ground forces as part of a coalition to fight ISIS."},{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"},{"comment_id":"903633816370041","commenter_b":"I saw this when I heard about it on the radio this morning. Lol","commenter_a":"Rudis Fernando Amir Casey Jeremy Jose Antonio damn","post_message":"No Brotherly Love: Eagles Play Drake's Back 2 Back Diss During Practice!"},{"comment_id":"493705967486650","commenter_b":"She should be in prison anyway!","commenter_a":"Finally justice might be done!","post_message":"Hillary's career could be over after she was exposed doing this.  Good. Let's end it right here, right now, once and for all.  Do you agree Hillary Clinton should be relieved of her duties?"}]
