[{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"},{"comment_id":"10153531144626350","commenter_b":"I agree. God bless you Lil child.","commenter_a":"This is courage","post_message":"Looking good, Leah!"},{"comment_id":"10154038010859205","commenter_b":"That's because it turns out she actually is a nasty woman. With a lot to hide.","commenter_a":"Robbie Mook is a terrible liar. Look at that body language!","post_message":"A blog called “True Pundit” said there were reports of Hillary Clinton asking why the government couldn’t just assassinate Julian Assange via drone strike. Hillary Clinton’s denial is less than convincing."},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"10152764552031491","commenter_b":"Yes. A woman can be a missionary or a nun. But why not be a priest too? Why is this off limits? What is it about women that make them unacceptable?","commenter_a":"Ponder on Mary's llife. have a virtue of humility. For the women, if you have calling to the religious life, you can be a missionary or contemplative nun. Be prayerful anyway, the right of women is not violated instead it is transcen! Pray for the gift of wisdom and understanding. Long live Pope Francis!","post_message":"Pope Francis gave a firm no to female clergy, while saying he wants to see a “greater role” for women in Catholicism."},{"comment_id":"10153423270403837","commenter_b":"@username I don't think @username hates gun owners... But @username brings up a good point what are the consequences for this happening? Other then the fact she was shot! She should be fined and her gun license stripped until she completes a gun safety class! Even if she attended one in the first place to own her guns. She obviously wasn't paying attention when the part of trigger locks was brought up! But sadly she will probably not have to change anything about the way she practices gun safety and I'm sorry but that's wrong! Again she's lucky the kid didn't blow its own face off! I really think we should be able to own guns but not if you're not responsible about it! Gun owners are all jacked up about this but, every gun owner I know would never in a million years let this happen! Including you! You're ...","commenter_a":"I read the comments here from people laughing and saying they don't feel bad for this woman. You people are so filled with hate towards gun owners it's sickening. Yes this seams clear cut to me this woman didn't use common sense with her firearm I may even go as far to say she not to bright for leaving a firearm in reach of a kid But the hate that comes from you people I don't understand. What if she left a kitchen knife out and her kid hurt her with it Or had the kid in the car running and got run over by the child Would you all feel bad for her? We all make mistakes and Some worse than others but put you petty gun hate aside and give her a break. Someday you might make a mistake and hit someone with your car It can happen ...","post_message":"MOM SHOT BY SON - A Florida mom who appears to be an ardent pro-guns supporter is in stable condition after being shot by her 4-year-old son."},{"comment_id":"10153208513188812","commenter_b":"WWF on wheels....","commenter_a":"He should b able to race it wasn't his fault his car got stolen they should make an acceptation","post_message":"UPDATE: Police find stolen NASCAR Sprint Cup race car: @webpagelink"}]
