[{"comment_id":"1281011171918910","commenter_b":"I would buy a hitman to kill grammar Nazis","commenter_a":"Your not going to win. Buy a beer instead","post_message":"What would you do with hundreds of millions of dollars?"},{"comment_id":"10153526289392183","commenter_b":"She is one nasty creature!","commenter_a":"You have nothing to worry about you entitled shill. Your we does not include me. Go Bernie!","post_message":"She's setting up the arguments for the general election here."},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"1077262612359760","commenter_b":"She is just nasty.","commenter_a":"That's how classy the liberals are.","post_message":"Today in 2015: Rosie O’Donnell: “I’d Like to Take My Period Blood and Smear It All Over [Pro-Life People’s] Faces”"},{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"10153981552219641","commenter_b":"I could care less how racist this is, but Belgium needs to deport every last Radical Muslim!","commenter_a":"Jai shri krishna Namaste.ji","post_message":"\"We will do whatever is necessary to support our friend and ally Belgium...\": U.S. President Barack Obama comments on Brussels terror attacks. @webpagelink"}]
