[{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"},{"comment_id":"10154767711621729","commenter_b":"There is a possibility that he wont be Trumps VP ,....because he is considering the VP job with Hilary....just saying","commenter_a":"don't wanthe little bitch","post_message":"Never say never?"}]
