[{"comment_id":"825891407559633","commenter_b":"Nothing like putting more American lives at risk and putting us deeper in debt. Frickin buttholes.","commenter_a":"so is it a race to see who we can get attacked by first?!? He says war with mexico Bannon says war with china is inevitable This guy is challenging Iran--- BOOM!!!!!","post_message":"Even if this wasn't a direct threat, Iran will perceive it as one. --SarahB"},{"comment_id":"10153047179116051","commenter_b":"What does being a feminist have to do with anything?","commenter_a":"WHAT an awful person. Take the baby and give it to someone who will love it.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"1153775948001804","commenter_b":"She's still a turd.","commenter_a":"Nancy, your a turd!","post_message":"“Lady Justice has on a blindfold because all victims and all defendants are to be treated equally under the law,\" says Nancy Grace."},{"comment_id":"10158146961425354","commenter_b":"Patton Oswald? Never heard of her. When will the Secret Service pay a visit to this loon?","commenter_a":"King of Queens actor. Weirdo.","post_message":"PROGRESSIVES' HATE TURNS EVEN DARKER   “Holy F*ck. Come ‘n’ get it, terrorists.\""},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"668184586705453","commenter_b":"Yes ; has been, is, and always will be!!! She is truly an ugly American.","commenter_a":"Nice eyebrows, plucked clean and then painted on............banchee","post_message":"Michelle Obama wants to destroy Halloween for kids across America.  There is no chance that we will let her take Halloween away from our kids.  Do you think Michelle Obama is a joke?"}]
