[{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"480214172160463","commenter_b":"Angry old white woman, I wonder where her people came from? Hell?","commenter_a":"The old lady isn't smart enough to know another language.","post_message":"Portrait of a Donald Trump Supporter. (2015)"},{"comment_id":"846989298730657","commenter_b":"I thin Aaran Afalava needs to do some homework about the way marriage has been done in the past.","commenter_a":"Why is this so special? My parents were together for 57 years...... If lesbians and gays want to be treated like everyone else why do they (and you) feel that everything they do is a milestone, or 'historic' or ...something! If they want to be treated like everyone else then they need to quit acting like they are something special.","post_message":"\"People seem to understand our relationship with no difficulty at all. They seem to know what we want them to know, which is that we are a loving couple, living a normal, happy life, just as we hope they are.\"  - Lennie Gerber and Pearl Berlin"},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1412614535483745","commenter_b":"Hey opee what the fuck did you ever do for our country. Not a damn thing. Any thing you have to say a worth shit. And as far as that POS obummer did even less.","commenter_a":"Keep you nose out of politics...you are best doing commericials for Weight Watchers...I am sure you need the money! Why don't celebraties keep their big mouths shut!","post_message":"This is a coordinated, collaborative effort on the part of the news and entertainment media to destroy Donald J. Trump, his administration, and the half of the country who supports them.  But notice the part of the Oprah story the media WON'T want to report."}]
