[{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a \"conspiracy\" that \"we are creating a plot to take everybody's guns away so that we can impose martial law...\" #GunsInAmerica @webpagelink"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the \"chickification\" of the news — which gives it a female-friendly slant."},{"comment_id":"10153938983386051","commenter_b":"It appears that conservatives are pro-Sharia law after all.","commenter_a":"People willing to vote for a guy married to a former supermodel and who used to sponsor a beauty contest object to a halter top? Really?","post_message":"Some people are very upset over how Megyn Kelly dressed on Fox News last night. Here is what she wore. Decide for yourselves if there's anything wrong with it."},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"\"We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10153332153777377","commenter_b":"But yet Megyn cried otherwise. Such a Bimbo.","commenter_a":"BBB gave Trump an A on his Trump University, so Cruz needs to hit the unemployment line","post_message":"Ted Cruz hammered Donald Trump on Thursday, tweeting out what he called a \"Certificate of Deception\" for Trump's now-defunct Trump University."},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."}]
