[{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"10153904664428010","commenter_b":"Illegals deserve to be deported not unseat Americans for health care.","commenter_a":"Anyone who has ever worked in a hospital could have told you. So many before the ACA never would have qualified or been able to afford. Everybody in this nation deserves access to our health care system.","post_message":"California's version of Medicaid will test the power of the Affordable Care Act."},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"1237347102949965","commenter_b":"You and me, (and millions of others, I'm sure), both!","commenter_a":"It isn't because she's a woman. I would stand in line for 5 hours to vote for Elizabeth Warren. Hillary? *shrug* It better be a short line.","post_message":"Here’s a strong but fair piece from the heart on the media establishment in DC by CNN’s Jeff Greenfield, whose long experience in politics and journalism began with Robert F. Kennedy back in the 60s."},{"comment_id":"10153865270269749","commenter_b":"Gillian..you too are vermin! We must make sure that you do not breed indiscriminately!","commenter_a":"Foxes are vermin and very distructive for farmers, not the cuddly toys as always portrayed by the media. However what is the most humane way to cull them.. A bullet is best but only if you are a very good shot as a wounded fox can take days to die. Poisoning is also a slow death. Trapping is just as bad as they can take days to die or try and chew off their own paws. So it looks like there is no easy answer, and no we cannot just let them breed indiscriminately without some control as you would understand if you saw the havoc they can cause especially in the lambing season.","post_message":"\"Fox hunting is a pursuit from the past and like the overwhelming majority of the population I believe that is where it should stay, consigned to history.\""}]
