[{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  \"I told you stop feeding that dog human food,\" the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"},{"comment_id":"10153562923228132","commenter_b":"Please go up and down the beach and tell all of those women to put turtle necks on. I'm sick of seeing all of those boobs hanging out. And while we're at it, low cut shirts too. And tank tops (side boob). Stop being a hypocritical idiot.","commenter_a":"She could show a little modesty! Not everybody wants to see boobs hanging out! We used to be more modest, it's called showing a little class!","post_message":"\"I was really very hurt by this act, because I was in no way bothering him, so what gave him the right to shame me?\""},{"comment_id":"10153026446831336","commenter_b":"I know makes me wanna puke.. she'll finish off destroying what Obama didn't...","commenter_a":"The United States part , we supply job applications to ISIS fighters","post_message":"Iraqi forces backed by Shiite and Sunni fighters have begun an offensive to recapture the northern town of Tikrit from ISIS militants, state TV reported."},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"},{"comment_id":"541066452731681","commenter_b":"Melania Trump speaks 5 languages and has a degree in architecture and design!!! That sets a new HIGH STANDARD FOR THE FIRST LADIES!!! I LOVE Donald Trump","commenter_a":"If we really get to vote and they really count them correctly, Trump will WIN..... but that remains to be seen. Trump one great American for President ! Go Trump !!!","post_message":"Join us at a TRUMP 2016 Presidential Rally near you! Daily updates at www.donaldjtrump.com/schedule - we look forward to welcoming you! Thank you for your continued support!"}]
