[{"comment_id":"10153898072441680","commenter_b":"Hillary has no respect for women! Ask the many rape victims of her husband - they'll tell you so!","commenter_a":"Right on-NBC survey monkey poll!! Ha,ha that's a good one-where was the survey taken,\" at the Bronx and Philly zoos! Did they survey the snakes?? How bout the cheetahs, the rats, the felons??! God help us!!!","post_message":"The NBC/SurveyMonkey poll out Monday finds that 63 percent of likely voters say Trump doesn’t respect women much or at all."},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"908814249264770","commenter_b":"@username did you know it will cost 114 billion dollars to deport 11.3 million people then add in the cost of the wall. Who would pay for that. Our taxes would have to go way up to cover that. I don't think Don can cover that out of his own pocket.","commenter_a":"I am an American. My children are American. My Grandparents and Great Grandparents were immigrants to this country. They came from Poland, Germany and Italy. I am a woman. I am successful in the male dominated auto industry. Donald Trump has spoken against every good thing I have been taught to be proud of in America. He is a ignorant, lying buffoon. #imwithher","post_message":"Yesterday, Donald J. Trump said that the judge presiding over a lawsuit against Trump University should be disqualified from his job because, in Trump's words, he has “Mexican heritage.”   Judge Curiel was born in Indiana—and last I checked, that's in the United States of America. Judge Curiel is as much of an American as I am. He’s as much of an American as Donald Trump is.   Let's be clear about what Trump is saying. He thinks that because Judge Curiel's family has Mexican roots, he can’t do his job. Donald Trump isn't just wrong about this; his words show that he’s wrong about America. He’s wrong about what makes this country great. And on a day that we are mourning Muhammad Ali, let's remember that we live in a country where people can break down barriers, worship their own god, choose their own name, and lead and follow their dreams as far as their hard work and talent will take them. I’ve always believed that in America, it doesn’t matter where your parents were born or what color your skin is—we should be judged by our words and our deeds, not our race, heritage, or religion. Well, it's time to judge Donald Trump by his words and deeds. And I believe that his prejudiced, bigoted words and deeds disqualify him from being President of the United States."},{"comment_id":"10153195743346051","commenter_b":"Bitch need a ass whooping!!!!","commenter_a":"need to stick her head in a toilet a few times til she thinks she's drowning","post_message":"Decide for yourselves if this woman got off too easy."},{"comment_id":"1239107352812458","commenter_b":"And you sir are an idiot","commenter_a":"There is a way to stop and fire Donald Trump is vote against him Donald Trump you are fired ========= Vote blue up and down the ticket==================== ==========hillaryclinton.com for more information, let's unite our voices and vote blue up and down the ticket. I'm an official member volunteer online for @username.","post_message":"Our planet's future depends on the decisions we make now."}]
