[{"comment_id":"10154979828776729","commenter_b":"Is a mean evil witch all she wants to do is kill us Americans in line her Pockets with more money how can she even be running for president? What is this country turned into?","commenter_a":"Bet she has an allergic reaction tonight !","post_message":"Holy cow!"},{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"\"We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"10153974696736943","commenter_b":"Double talk.!","commenter_a":"This is how you stand for law in government?","post_message":"Wednesday, June 01, 2016 Judicial Watch Director of Research and Investigations Chris Farrell appeared on\"America's Newsroom\" on Fox News Channel to discuss the latest developments in the depositions of Former Secretary of State Hillary Clinton inner circle regarding her use of private email while serving at the State Department."},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"}]
