[{"comment_id":"10154416532115575","commenter_b":"And what about Hillary's fat rearend!","commenter_a":"Ha wouldn't you like to see her have to do a daily weigh in!","post_message":"Democrat Claire McCaskill calls for daily weigh-ins for Donald Trump over media hoax from 20 years ago."},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."},{"comment_id":"1059213794114079","commenter_b":"You look like my next door neighbor. No seriously! My next door neighbor wears a hijab. She's one of the sweetest people we know. Even brought us cookies for Christmas!","commenter_a":"Islam is the best","post_message":"She stood up in an incredible way."},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"10152788051453445","commenter_b":"Aussie bastard cannibas its called! Sydney university are offering $10,000 if any1 can find another plant!!","commenter_a":"@username Steven Bains","post_message":"WHAT?!? A new strain of #marijuana has been discovered!"},{"comment_id":"1018828211502577","commenter_b":"Thank you, that's what I'd like to know! B**** needs to SIT DOWN lol","commenter_a":"Wtf for?!?","post_message":"She's up against Malala Yousafzai and Pope Francis."}]
