[{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"920934694585179","commenter_b":"94 MILLION LEGAL AMERICANS JOBLESS LEGAL AMERICANS HOMELESS LEGAL AMERICANS HUNGRY LEGAL AMERICANS HURTING AND THIS DEMOCRAT SLAVE MASTER, WHO GETS A LIFE-TIME SALARY FROM LEGAL AMERICANS VOTED AGAINST THIS BILL WHICH WOULD GIVE JOBS TO LEGAL AMERICANS","commenter_a":"Wrong on many levels....","post_message":"Greater energy security and more #jobs are at stake. Approve #KeystoneXL!"},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":""},{"comment_id":"10153301251374087","commenter_b":"Jesse anderson, another perfect example of a bootlicking crypto fascist","commenter_a":"If police are doing nothing wrong they should have no problem being videotaped.","post_message":"The question of whether police are reluctant to enforce the law because they are afraid of being videotaped has become the subject of fierce debate, as experts struggle to explain an uptick in violent crime in some U.S. cities."},{"comment_id":"604670086348434","commenter_b":"Like that, tbh","commenter_a":"He has the face a typical Republican Tea Party red neck. A Trump voter perhaps who will be voting in jail, if he is allowed. Disgusting asshole punching a physically disabled child.","post_message":"This guy gets my vote for Biggest Jerk of the Holiday season. --Andrew"},{"comment_id":"859693680734640","commenter_b":"That's definitely not how that works. She would have to legally be a woman with identification as a woman.","commenter_a":"totally disgusting, so any guy can say they are pretty sure they are a woman stuck in a man's body and will be welcome in locker rooms and bathrooms, oh come on!","post_message":"\"I was stunned and shocked.\""},{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."}]
