[{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10153968798483352","commenter_b":"Nasty bitch","commenter_a":"What!?","post_message":"Escort madam reveals in explosive tell-all book how University of Louisville basketball team ‘paid her $10K for 22 sex parties’ with troupe of strippers including three of her own daughters"},{"comment_id":"10152742608351491","commenter_b":"I am amazed at how many women are so poorly informed on the issue and then let the world know how little they know. Amin wage woman does not have access to a mike and thankfully Patricia did and took advantage of it.","commenter_a":"Says a women riding home in a limo! Political rant to get attention. She is a actress","post_message":"“It’s our time to have wage equality once and for all and equal rights for women in the United States of America.”"},{"comment_id":"1141577959271788","commenter_b":"Then do you forgive slavery?","commenter_a":"I see nothing wrong with it. It is inappropriate to judge a previous generation by the information and ethics of another generation.","post_message":"\"The first thing I thought when I stepped off the train was, 'I don’t belong here.' \"  - Jim Tanimoto, recounting his life spent behind the camp's barbed wire."},{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"\"watching roaches climb the wall, if you called your dad he could stop it all \"","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"1080222498699420","commenter_b":"#FuckYouHillary","commenter_a":"This old fool is the one who needs work , Go Home Bernie it's over !","post_message":"The Democratic Party must go on record in opposition to holding a vote on this disastrous, unfettered free-trade agreement during the lame-duck session of Congress and beyond. If both Clinton and I agree that the TPP should not get to the floor of Congress this year, it's hard to understand why an amendment saying so would not be overwhelmingly passed."},{"comment_id":"10153672504893812","commenter_b":"Demonstrators showing their ignorance.","commenter_a":"Jade helm time to test what you got","post_message":"JUST IN: State of emergency declared in St. Louis County due to Ferguson unrest: @webpagelink"}]
