[{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"},{"comment_id":"10154506488603487","commenter_b":"Non-issue. Couldn't and wouldn't happen. Too much of our power structure is in Texas.","commenter_a":"If they do not want their Social Security, Medicare, Medicaid, and Veteran Benefits. We will gladly keep their share for the USA. Of course Hillary has a chance to win Texas.","post_message":"Hypothetical question: Would you support or oppose Texas seceding from the United States?"},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"10154360418471729","commenter_b":"...she IS A LIAR !!!...always been and always will...","commenter_a":"Now...that looks like an angry candidate!","post_message":"The truth hurts. Especially if you're Hillary Clinton."},{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":""},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"}]
