[{"comment_id":"10154101943008984","commenter_b":"@username , Why do you people who support only Trump find it necessary To call people names simply because they don't agree with you? Are you that insecure?","commenter_a":"Now do not get me wrong! I am for Trump 100%, think he'll be awesome BUT leave George W. Bush out of it! Take it out on Jeb because he deserves it but I don't think George does, at all!","post_message":"Donald J. Trump railed against George W. Bush for 9/11 at the last GOP debate. It got messy, and now \"W\" has responded like only he could..."},{"comment_id":"1239847632704451","commenter_b":"Hillary is the Unindicted Felon!","commenter_a":"That is exactly what pisses me off the most, to see the wealthy paying zero taxes! I pay taxes so I make my contribution to our government just like millions of Americans do! It sucks, really sucks! And then to say it is smart not to pay taxes on National TV? That is an insult to the American people! Bragging about it makes me think that those who support this clown have something wrong in their heads, period! Is this the kind of Commander in Chief we want?","post_message":"There it is, folks!"},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"987574278005491","commenter_b":"Killary for prison 16","commenter_a":"Very true, Hillary has been called horrible things not just by men but women to. HILLARY 2016.","post_message":"\"I don’t know that a man would be treated the same way that Hillary is.”   - Senator Bernie Sanders"},{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"}]
