[{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"},{"comment_id":"647855782048269","commenter_b":"@username, no, she's a \"feminist\" and \"peace activist\" from Argentina. All my friends would describe themselves as feminists (male and female). None of them support Trump. Funny that.","commenter_a":"The insult 'a basket of deplorables', is the best exhibit of Hillary Clinton discriminating personality. There is a big number of registered democrats (like myself) for Donald J. Trump. So all democrats and independents (forget the republicans) supporting Trump, are that? That is how cheat this woman is. If elected, she will do the same to any ethnic group rejecting her, and will blow up one country after another, starting with Russia. Deplorable, is Hillary Clinton for expressing herself that way about the 75% of US citizens. (Ivan Mintz/Eric Trump)","post_message":"Republicans slammed Hillary Clinton for saying that half of Donald J. Trump’s supporters fit into a “basket of deplorables.\""},{"comment_id":"392468917544370","commenter_b":"He said \"unvaccinated foreigners\" caused this. Read that again... Slowly.","commenter_a":"Fran Cella I agree with Rush.","post_message":"What do you think of Rush Limbaugh's theory on the vaccinations debate?"},{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""},{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."}]
