[{"comment_id":"1026833867373308","commenter_b":"We don;t want or need your amnesty, illegals are criminals.","commenter_a":"If he's all smiles with those morons, he can't be trusted. TRUMP.","post_message":"Sen. Rubio co-sponsored the gang of eight amnesty bill in 2013 that would've granted amnesty to 11 million illegal aliens, weakened border security, weakened interior enforcement, and TRIPLED immigration."},{"comment_id":"665156860339272","commenter_b":"@username God loves Christians and hates all other religions..... Look at how God backed the Christians when they slaughtered 100 million native Indians because they foolishly loved their land and their own spirits, not accepting Christ as the son of God..... so, they were slaughtered... but, they told the men not to waste the ammunition on the women and kids, so they slashed them to death with sabers and machetes.... and God smiled at them...... And, since WW II the Christian Americans have invaded 37 countries killing between 20 and 30 million people, none of them were white Christians though, so God again smiled and nodded with His approval...... We spent $3 trillion on killing 500,000 innocent Iraqi citizens.... or $6 million per person killed..... it is really getting expensive to kill people nowadays isn't it..... Just think if we had spent that $3 trillion on food, we would have ...","commenter_a":"The Hillary and government set up is trying to keep the polls low for trump an high for hilkery, with the media and asking him politely bow out when Hillary wins it's all to hide the fact that they are cheating and they expect to win by their cheating so it will look good when they say she has won and Obama said he would not leave the White House and would blockade anyone coming in but they are trying to make Trump say that he won't fight. Because they know the system is rigged and ready for Hillary but God it's the boss.","post_message":""},{"comment_id":"10153419544317061","commenter_b":"Robach on safari in Africa, probably a better production performance from her than the days she does studio production...She clearly has the ability and clothes to dress for an African safari and lacks all ability to select the correct wardrobe for studio performance...Robach and Spencer are the two worst dressed women on GMA since the show began...Diane Sawyer was one of the best dressed women on this show...","commenter_a":"Cool!","post_message":"WATCH: Our drones capture beautiful live images of elephants as we are on safari in Africa. Interact here: abcn.ws/20PSiVQ #GMAinAfrica"},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":""},{"comment_id":"1016766741752911","commenter_b":"@webpagelink Ninja Warrior Winner Isaac Caldiero $1 million grand prize @webpagelink","commenter_a":"That is because gayness is a disease and not a protected group. I'm so sick of gays - nee homos - queers thinking that they are the same as everyone else. They chose that way.","post_message":"\"Imagine if instead of denying a license to a gay couple, Ms. Davis had sought on religious grounds to deny a license to an interracial couple. She likely would have been fired on the spot, and no politicians would have rushed to stand by her side, no matter what her sincerely held religious convictions were.\"  - George Takei on Kim Davis"},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."}]
