[{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"1151019624929597","commenter_b":"Krissy L Gucciardo Nice mouth. Do you eat with that filthy mouth.","commenter_a":"I actually had a friend say she never sees him with his hand over his heart during the Pledge of Allegiance. I then supplied her with about 25 pics of different events, all with his hand over his heart. I told her google is her friend, and Fox news is not.","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\"  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to \"make America a safer place to live.\""},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"975822185786810","commenter_b":"@username...I never have been a democrate I'm an independent. I chose the best man/woman for the job. And without the independent vote...hrc will lose. So...tell me again HRC is gonna be Prez, cuz it's not gonna happen without us and my fellow Bernicrates","commenter_a":"Yet you lose to Trump. All numbers say he will wipe the floor with you! BERNIE is the only one to Win against all GOP. Numbers show it. And he's winning national polls. I WILL NEVER CAST A VOTE FOR YOU...EVER","post_message":"Know someone in South Carolina who’s not sure who to vote for today? Share this."},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"1311800738876452","commenter_b":"IN YOUR DREAMS !!! #DontBoo #VoteHillary #NastyWomenVote","commenter_a":"Trump will become the next President. I'm saying this because I analysed their horoscope from an astrological point of view.","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"}]
