[{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: \"Yes, absolutely.  - via Fox News"},{"comment_id":"10153843036548984","commenter_b":"She should be in jail!","commenter_a":"Not more than the parents and siblings of the fallen, you arrogant wench.","post_message":"Hillary Clinton was already in a tough spot at the Benghazi hearing. Then she went and said this sentence and buried herself even deeper...  Do you think Hillary should be held accountable?"},{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"\"Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?\" – Sean Hannity"},{"comment_id":"10153798240092869","commenter_b":"Leave this woman alone . A human life always comes first ....","commenter_a":"I disagree raising children is a great responsibility and absolutely no one is perfect that is why we have axcidents. The zoo done what had to be done at the time they were not aware that a child could get into the cage or I'm sure it would have been fixed","post_message":"Cincinnati Zoo keepers had no choice but to kill a gorilla that might have harmed a small child that somehow got into its enclosure.  But the Internet has been lit aflame by animal lovers furious at the parents for allowing the situation to happen.  They’ve reportedly received death threats and demands that they be prosecuted.     But animal expert and TV host Jeff Corwin points out that it’s nothing new.  One study showed that 42% of deaths and injuries from captive tiger attacks involved visitors, many of them kids, and not zoo keepers.  He has an important message for all zoo visitors, especially parents:    “When you go to these places, the zoo is not your babysitter. You have a responsibility.”   I wonder if our constant immersion in TV, movies and virtual reality is making people forget how to behave in “real” reality. The same obliviousness that allows people to yak on cell phones in Broadway theaters just as if they’re sitting at home in front of their TVs is also leading them to assume that real zoo animals are no more dangerous than those in a video game.  In real reality, you don’t get to press the Reset button for an endless number of lives.        Read the full article for some possibly life-saving tips for your next real trip to the real zoo."}]
