[{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."},{"comment_id":"10152765458922452","commenter_b":"What a beautiful woman!","commenter_a":"NoooooooooooH! Whhhhhhyyyyyyyyyyy!! 😢😣😧😩","post_message":"This is the last year that the original version of Kraft Mac & Cheese sold in the U.S. will contain artificial preservatives or synthetic colors. @webpagelink  In January, Kraft says its macaroni and cheese will be colored using paprika, annatto and turmeric."},{"comment_id":"875157552546363","commenter_b":"This is going to happen in every state these Illegas are in!!! Will there ever be a way to get them out of this country.. We need a great Wall of the United States just like the great wall of China!!","commenter_a":"who could have seen that coming? Not Obummer. He's got blinders on.","post_message":"Texas Man Murdered Execution-Style By An Illegal Immigrant Who Had Already Been Deported  @webpagelink"},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for \"Swimsuits For All\", heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"765077356935066","commenter_b":"Gef mir.","commenter_a":"Amen term limits","post_message":"Bernie Sanders is 73, Joe Biden is 72, Chuck Grassley is 81, Barbara Boxer is 74, Nancy Pelosi is 74, Harry Reid is 75, John McCain is 78, Diane Feinstein is 81. Mitch McConnell is 72, Orrin Hatch is 80, Richard Shelby is 79, Carl Levin is 79, Jim Inhofe is 79, Pat Roberts is 78, Barbara Miklski is 77, Jay Rockefeller is 76, Thad Cochran is 76, Tom Harkin is 74, Patrick Leahy is 73, Lamar Alexander is 73,  Bill Nelson is 71.Charles B. Rangel is 83. In the last 30 years, the number of Senators in the Senate for 20 years or more has tripled. Senility and seniority are not serving us well. (some are now older than listed)  The 50 richest Congressmen and women reported a minimum net worth of at least $7.4 million in 2013, Roll Call discovered in it's review. That represents a steep increase from the $6.7 million benchmark set in 2012.  Wealthiest Members of Congress.  California Rep. Darrell Issa (R): $357.25M  Texas Rep. Mike McCaul (R): $117.54M   Maryland Rep. John Delaney (D): $111.92M   West Virginia Sen. Jay Rockefeller (D): $108.05M  Virginia Sen. Mark Warner (D): $95.13M  Colorado Rep. Jared Polis (D): $73.56M  Connecticut Sen. Richard Blumenthal (D): $62.06M  California Rep. Scott Peters (D):$45.04M  California Sen. Dianne Feinstein (D):$43.72M  Washington Rep. Susan DelBene (D): $37.89M  Florida Rep. Vern Buchanan (R): $37.15M  Maine Rep. Chellie Pingree (D): $34.47M  California Rep. Gary Miller (R): $32.97M  California Rep. Nancy Pelosi (D): $29.11M  Ohio Rep. James Renacci (R): $28.08M  Texas Rep. Roger Willams (R): $28.01M  Florida Rep. Alan Grayson (D): $26.18M  New York Rep. Chris Collins (R): $22.50M  New Jersey Rep. Rodney Frelinghuyson (R): $22.21M  Tennessee Rep. Diane Black (R): $21.24M  Massachusetts Rep. Joseph Kennedy III (D): $20M  Idaho Sen. Jim Risch (R): $19.24  Tennessee Sen. Bob Corker (R): $19.12M  Missouri Sen. Claire McCaskill (D): $18.38M  Wisconsin Rep. Tom Petri (R): $15.64M  New York Rep. Richard Hanna (R): $15.3M  Arizona Sen. John McCain (R): $15.17M  North Dakota Sen. John Hoeven (R): $15.16M  Florida Rep. Curt Clawson (R): $13.53M  Wisconsin Rep: Ron Johnson (R): $13.52M  Wisconsin Rep. Jim Sensenbrenner (R): $13.04M  Kentucky Sen. Mitch McConnell (R): $11.97M  Iowa Sen. Tom Harkin (D): $11.85M  Illinois Brad Schneider (D): $11.71M  Texas Rep. Lloyd Doggett (D): $11.51M  Tennessee Rep. Jim Cooper (D): $11.51M  New York Rep. Nita Lowey (D): $11.48M  Virginia Rep. Scott Rigell, (R): $11.29M  Arizona Rep. Trent Franks (R): $11.01M  California Rep. John Campbell (R): $10.21M  North Carolina Sen. Kay Hagen (D): $9.12M  Louisiana Rep. John Fleming (R): $9.06M  Georgia Sen. Johnny Isakson (R): $8.93M  Georgia Rep. Tom Price (R): $8.87M  Ohio Sen. Rob Portman (R): $8.60M  Pennsylvania Rep. Mike Kelly (R): $8.51M  Texas Rep. Kenny Marchant (R): $8.13M  New York Rep.Carolyn Maloney (D): $7.73M  New Mexico Rep. Steve Pearce (R): $7.72M  Florida Rep. Tom Rooney (R): $7.47M  Source: Roll Call"},{"comment_id":"10153756549625667","commenter_b":"No Trump No Hillary, any body else, American have the best.#","commenter_a":"like my page awlad nass","post_message":"As the Iowa State Fair got started 20 years ago, two people were shot dead in the exhibitor campgrounds."},{"comment_id":"10153294608621051","commenter_b":"There are bad waitresses too!! I don't treat one bad because another was bad!!","commenter_a":"All human life is sacred. But I work at a restaurant down the street from the county sheriff's department, and the boys in blue that come in are often disrespectful and rude, and act entitled to walk all over us because they're cops. They once refused to leave after we closed, even though they were done eating. I'll start respecting the blue more when the good ones start publicly, and loudly denouncing the ones who aren't.","post_message":"This officer had just finished a nice meal and was preparing to pay his bill when he noticed something written on the receipt."}]
