[{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"888413677941681","commenter_b":"We are aliens!!!!","commenter_a":"Blacks are the only ones seen. Thats good news. It could only mean that whites are aliens.","post_message":"Google Identifies Black People As Gorillas & Other Image Recognition Fails"},{"comment_id":"10158098604455192","commenter_b":"Awww look at the snowflake. Upset because she can't find the safe room.","commenter_a":"Who really cares what these celebrities think.","post_message":"Streep noted that \"Hollywood\" is a reviled place. But in reviewing the backgrounds of several of her colleagues surrounding her at the Globes, she said that it's really a community filled with people from other places united in the mission to show different people and make audiences feel what they feel."},{"comment_id":"479371038920143","commenter_b":"Put that stupid bitch in a uniform and make her serve!","commenter_a":"no wonder look who shes married to","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"10153880251122217","commenter_b":"No. They should be pure. Virgin skinned, hairless.","commenter_a":"See John for the invisible tattoos.","post_message":"Send us photos of your tattoos! We'll be talking ink in the workplace with tattoo expert Dr Matt Lodder at 13:30 (BST) on #FacebookLive. We'll be showing some of your tattoos as part of our broadcast, so please email your snaps to yourpics@bbc.co.uk"},{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"}]
