[{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"\"This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.\""},{"comment_id":"10154205031258701","commenter_b":"You are clueless chickie....","commenter_a":"Seriously people, faulting the girl for not reporting! It's a small town good-old-boy system. You really think the police chief would arrest his good friend? They were probably laughing about it. Since she went public she is being harassed. Small town politics...","post_message":"A probable cause affidavit states he exposed himself to a female employee at Flowers 'N Fluff at least twice a week for at least two years."},{"comment_id":"1775783539370851","commenter_b":"Idiots arrest them all","commenter_a":"White lives matter more!","post_message":"WATCH LIVE:  Protesters have gathered in downtown Atlanta. We have several Channel 2 Action News reporters with a group that is marching near the King Center and we'll have live coverage starting at 11."},{"comment_id":"10153451405011336","commenter_b":"The sooner the better. We're going to need them to bail us out.","commenter_a":"When are we joining the European Union?","post_message":"JUST IN: The Confederate flag will be taken down Friday. @webpagelink"},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"},{"comment_id":"887259011404129","commenter_b":"She smacked him down with that","commenter_a":"That was my favorite point in last night's debate. It really showed who has done more for our country in the last 30 years.","post_message":"\"I'm happy to compare my 30 years of experience with your 30 years.\" —Hillary to Trump #Debate"},{"comment_id":"1338478099545268","commenter_b":"I really hate that women","commenter_a":"Like that's a surprise. ..Not at all..","post_message":"Is this how Casey Anthony paid for her defence?"}]
