[{"comment_id":"10152852795208717","commenter_b":"@username -- if this Somersworth Daycare is any indication - its quite close to $5/hr over a week -- even for infants at 214/week divide by 5 = ~43/day, and more than likely >8 hr day in daycare as the parents have to work 8+hrs plus travel... @webpagelink","commenter_a":"Daycare rate in nh is $5 per hour. Google it and check the rates. Which I did a pathetic rate.","post_message":"Do you think $13.44 is a fair rate for babysitters?"},{"comment_id":"946547988774787","commenter_b":"Theresa, get a job, I'm retired! Baaaaaaaa, sheep!","commenter_a":"I don't care what Stewart thinks; I'm not one of his unemployed sheep!","post_message":"\"I honestly have nothing other than just sadness, once again, that we have to peer into the abyss of the depraved violence that we do to each other, and the nexus of a just gaping racial wound that will not heal, yet we pretend doesn’t exist.”  -Jon Stewart"},{"comment_id":"10153742314476336","commenter_b":"The woman sounds like a idiot.","commenter_a":"How can they say women's clothes?? I though we didn't have gender clothing anymore??","post_message":"Do you think this mom went too far?"},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"},{"comment_id":"948831575172245","commenter_b":"Women see active duty don't they?","commenter_a":"Isn't he a FELON? Can he even vote?","post_message":"T.I. reveals a woman will not earn his vote in the 2016 presidential election because \"women make rash decisions.\" And he thinks \"you might be able to the Lochness Monster elected before you could [get a woman].”  Apparently, the rash decisions of male leaders did not result in broken levees in New Orleans, a trillion-dollar deficit due to decades-old wars, and a huge gun control problem that results in mass shootings almost weekly.  Amid major backlash, T.I., issued an apology for his sexist comments. MORE ----> @webpagelink"},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel.   (via Strange Inheritance)"}]
