[{"comment_id":"10153603193848132","commenter_b":"That's cause her hair isn't real. It's fake as that tan she has. Your daughters are beautiful btw!","commenter_a":"My daughters are only half African American. Just thought I would lighten this post up some! Was tired of seeing negative comments.","post_message":"The race scandal continues."},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."},{"comment_id":"10153376436094087","commenter_b":"Ok some of you all don't get it. I like Trumps idea on closing our borders for a time being and this is why and a simple example. Please come to my house I have a bowl of 10,000 M&M's and in that bowl I may have 100 but at least 2 M&M's that are poisoned and will kill you the moment you put them in your mouth and slowly corrupting the bowl. So I want you to stick your hand in the bowl and eat a handful! Oh you won't? Why not oh cause the odds are your gonna die? Oh I see but it's ok to let 10,000 immigrants in knowing some are most likely deadly. But won't eat 20 M&M's because at least 2 out the 10 grand will kill you what's the difference??","commenter_a":"The immigration and Nationality Act passed June 27, 1952, revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by , violence or other unconstitutional means. This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission to Islam, which is antithetical to the ...","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10153167392250090","commenter_b":"Take out the trash... She is trash...!!!","commenter_a":"She should not be a president of anything","post_message":"We've seen what happens when our president ignores the American people—we WON'T let it happen again.  It's time for the truth about Benghazi. Demand answers from Hillary Clinton: @webpagelink"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"}]
