[{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"},{"comment_id":"892479024147549","commenter_b":"The majority of people who act out racism, cry about racism, are the most racist...are black people....you want a safe space where whites won't be around...Liberia...Nigeria...Botswana...many places...but here's the thing...no welfare, no food stamps, no healthcare, no free housing(except in the jungle and you build it), no opportunity for education, ....not one of you would survive in any of these African countries.....because you've been spoon fed for to many generations! I've been to Africa many times, I've spoken to hundreds of Africans.....they will rot and die in poverty because of the black government that runs the countries....take a very close look at who's in charge of America now!!! Except in America the white tax payer affords you the life you don't even deserve.....and now he's giving your life...yes your life to illegals...he's done with you....make the best of it...because that stupid monkey president couldn't care less about you!!!!","commenter_a":"Hell No. There are no more minorities","post_message":"Huffington Post:  Deserve Safe Spaces Without White People  A couple of weeks ago, two students from Ryerson University Journalism program were barred from attending an event organized by the ' BECAUSE THEY WERE WHITE!  @webpagelink"},{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"}]
