[{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to \"cut off their heads\". That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about \"infidels\". There would be even more chaos...","post_message":"\"He was brainwashed but we do not know by whom, when or where,\" said a family friend."},{"comment_id":"10153839252314087","commenter_b":"@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"\"Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,\" Ted Cruz said after the Orlando attack."},{"comment_id":"10152603535532894","commenter_b":"she slept with Jamie Fox, She slept with a fe NBA players. If you go on the internet its all there and on TMZ. She is a whore too","commenter_a":"Greg has his own real estate investments and can stand on his own. Please. Claudia is a whore. She has slept with everyone just like Kenya hoping for a big break. if you start your career on your back you always stay on your back That is a bad practice of sleeping with people to move up. People will never respect you as a woman or a professional like that","post_message":"#RHOA Fans Outraged: NeNe Leakes Hurls 'Half-Breed' Racial Slur at Claudia Jordan [Video]"},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"},{"comment_id":"990765034279620","commenter_b":"Not empowering ,because ur shity woman","commenter_a":"I love them","post_message":"Photoshop this."}]
