[{"comment_id":"10153084847781350","commenter_b":"Cheaters","commenter_a":"Latest reports state balls were checked at halftime and found deflated. They were changed out for fully inflated ones. And...PATS won the game in second half! What else is there to say? Enough already!","post_message":"\"It's cheating, regardless of how you may want to spin it.\""},{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"},{"comment_id":"10157328778620354","commenter_b":"Kimberly Dawn Horvath Mullins , most Muslim immigrants are actually highly educated doctors, lawyers, computer engineers. Kimberly, you're just a mailman right? Soon you'll be replaced by a drone LMAO, and go back to your trailer living off welfare again LMAO.","commenter_a":"Still waiting for some idiot liberal to explain to me how importing hordes of stinking uneducated radical muslim savages is good for America. Other than dumbass mouthpiecees spouting the usual \"that's not who we are\" bullshit.","post_message":"\"How did we get in the position where we’re screwed if we’re not in the good graces of the Muslim community? Maybe we should stop doing that.\""},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"}]
