[{"comment_id":"10154509463236162","commenter_b":"Same Jen same","commenter_a":"@username... worried for @username","post_message":"HOT DOG RECALL: Put down the hot dogs!   372,000 pounds of hot dogs and corn dogs are being recalled over concerns of listeria contamination.  Bar-S Foods is recalling five chicken and pork products.   The recalled items include Bar-S bun-length and classic franks made with chicken and pork, Bar-S classic corn dogs and Signature Pick 5 corn dogs."},{"comment_id":"10153549006508984","commenter_b":"Never mind i remember now ......she made one bad porn with that BIG A!!","commenter_a":"I side with Meg Kelly. Kim's a dumb fat ass bitch!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"897302730329476","commenter_b":"and youre famous for? ABSOLUTELY NOTHING","commenter_a":"It's funny how Your ugly dress made you famous more than your music did !","post_message":"#thedress girl speaks: 'It's madness. I feel like I'm living in a dream'"},{"comment_id":"10153700532617894","commenter_b":"Make me. Hip hop is my lane. Silly woman.","commenter_a":"What is she doing at a T.I. concert if she don't want too be questioned.","post_message":"Model Shot at T.I. Concert to Sue ‘Heartless’ NYPD for Treating Her Like a ‘Criminal’ During Their Investigation"},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."},{"comment_id":"1248622855149182","commenter_b":"@username not to mention more people have voted for her","commenter_a":"@webpagelink/ Bernie Sanders is SO close to winning the nomination, my fellow Berners! We will have a contested convention in July where both candidates will have the chance to sway the Super delegates. This is excellent news and shows that hard work does pay off. Our political revolution has put the country on the right track to put progressive policies in motion and that means we can have a better future by working together today. Join the movement! #notmeus #berniesanders","post_message":"Will tomorrow be the beginning of the general election? What’s next for Ted Cruz and John Kasich if Donald Trump wins today? What’s next for Bernie Sanders if Hillary Clinton wins today?  Our editor-in-chief Judd Legum and politics editor Aaron Rupar talk about the implications of the Indiana primary."},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"}]
