[{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":""},{"comment_id":"10153680219934641","commenter_b":"Problem solved!","commenter_a":"I'd still like to know why they need to come HERE? It would be cheaper and safer to house and secure them over THERE. The need to vet them would be nearly eliminated, language issues would be non-existent, violence and criminal acts would be lessened, etc. We can't adequately provide for our nations homeless population as it is. We're going to bring in 10's of thousands of them from another country and shelter THEM, but leave our own (many of whom are veterans) out in the cold? (literally)","post_message":"\"If there's a rabid dog running around in your neighborhood, you're probably not going to assume something good about that dog,\" Dr. Ben Carson said Thursday, speaking about refugees. @webpagelink"},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"},{"comment_id":"647096885477917","commenter_b":"If those prostitutes have balls.","commenter_a":"what could black mail TRUMP","post_message":"It sounded like a major development in the unconfirmed allegations that the Russian government had blackmail material on Donald Trump. It's not."},{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don\"t just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.\"   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"1715971748670504","commenter_b":"@username is not clearly thinking. What the soldiers need and what is spent, often wastefully, through our War budget are two separate things.","commenter_a":"Increase. I bet everyone saying to decrease posts those names on veterans day saying how you support the military. Obama cut meals for troops in a war zone. SMH","post_message":"U.S. Military Size: Increase, Decrease or Stay the Same?"}]
