[{"comment_id":"10153334990238132","commenter_b":"There will always be someone looking for the controversy in something as simple as a picture is a baby in a flag. Move on! Be proud of our flag and the POSITIVE way is being displayed. AMERICANS have done worse to our flag!!!","commenter_a":"Any true American can not dislike this photo. This photo is what patriotism is all about! Anyone that has an issue with this photo must not have been born here, because this is what patriotism is all about. Thank you sir for fighting for our freedom.","post_message":"What do you think of the controversy that this photo is creating?"},{"comment_id":"10150833830084963","commenter_b":"What you should get is that it is too bad your mom didnt see you as cells and abort. Ouch stings like that.","commenter_a":"I can not understand why Republican women believe that their bodies and their minds belong to ANY government. If you do not believe in abortion, do not have one.","post_message":"Though the 2017 Official March for Life is happening today, there are indications that most Americans still approve of Roe v. Wade."},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"10153585034949497","commenter_b":"Eh you know how the hot chicks are...","commenter_a":"Area Gisele fails to properly deflate Tom Brady's balls","post_message":"The NFL has debuted new rules pertaining to the quantity, air pressure, inspection, labeling, and monitoring of game-day balls"},{"comment_id":"10155880167920354","commenter_b":"Uh you don't feel safe here? GO BACK!","commenter_a":"And salon will say that the US military threatened this poor muslim and made him feel unsafe.","post_message":"The Huffington Post Says It's a \"Mystery\" Why Kuwaiti-Born Practicing Muslim Mohammad Youssef Abdulazeez Murdered 4 U.S. Marines During Ramadan."}]
