[{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? \"..recipients (of welfare) choose the day and time of the testing..\" This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"}]
