[{"comment_id":"1111506912205431","commenter_b":"The video basically implied that Donald Trump was a racist simply because he doesn't want illegal immigration in this country. There is an enormous amount of drug trafficking, Sex trafficking and a lot of bad people are coming through our borders. Yes their are a lot of great Latinos in this country and my husband is one of them but what basically everybody is saying is that Donald Trump is a horrible person and a racist simply because he wants to stop illegal immigration in this country. let's not get started on what people are saying about Donald Trump supporters. That we're ignorant that we are racist. And please don't lecture me on how I should respond to things! Like I'm some child in a classroom and you're the teacher. You're being extremely condescending.","commenter_a":"This is total bullshit!!Mexicans that think we are racist because we want to have a wall how about the wall you have between Guatemala and the Mexico border. None of you ever answer that question. (and if you want to get technical it's not a wall it's a huge fence with Barbwire on top of it)And I'm not a racist my husband is Latino and my children are considered biracial so stick it where the sun don't shine,I don't want to hear any of that crap.The people in this country are totally fine with legal immigration it is illegal immigration that Americans have a problem with. I don't see Mexico having open borders and even if they did they certainly wouldn't be giving illegal immigrants welfare food stamps Medicaid I could go on and on and it's all being paid for by the hard-working American taxpayers.it sucks when you live ...","post_message":"The Latino community has a powerful message for Donald Trump.  #MicBrights"},{"comment_id":"10152875043501973","commenter_b":"My husband said he wished there was since we can't just hop in our car and get down there. :)","commenter_a":"Is there an online store too???","post_message":"The sale starts today at 9 a.m. for season ticketholders, 11 a.m. for the general public, and offers up a ton of Ducks' athletic gear."},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: \"Loose lips sink ships.\"","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"10154431713909411","commenter_b":"It would be good only if happen in America, Israel, Saudi Arabia, Turkey, England or some another war spreading and terror supporting country. All what happen in peaceful countries is bad and for regret. Thos who spread death around world, deserve it back in they own country.","commenter_a":"Good.","post_message":"BREAKING: Accident happened in Hualien County on Taiwan's mountainous eastern coast"},{"comment_id":"10153357300516051","commenter_b":"@username what part of illegal don't you get! They come here illegally & then have anchor babies which the government pays for & that includes the whole family while the father works under the table! We are spending millions of dollars on illegals & not just Mexicans when we have our own US Citizens who need our help!!! They are breaking the law! Period! CAN'T WAIT FOR A NEW PRESIDENT TO CHANGE THIS ONCE & FOR ALL!!!!!","commenter_a":"If they are born in USA, they deserve their birth certificates. TEXAS, the most ass backwards state there is!!!","post_message":"Right decision or wrong decision?"},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"}]
