[{"comment_id":"10152908271969753","commenter_b":"You are absolutely right! She's disgusting","commenter_a":"if a man did this he would get prison time she needs this also..she is a guilty..","post_message":"The married mother-of-two admitted to having sex with the student on seven separate occasions both in her vehicle and at her home."},{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."},{"comment_id":"10153031859929024","commenter_b":"Maybe you should jump in front of one of the bullets too lmao","commenter_a":"let them kill each other off","post_message":"Lionel Pickens, 31, was shot multiple times in the chest around 4 a.m. Sunday at Queens Boulevard and 84th Drive in Briarwood, police said."},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."},{"comment_id":"682384888576953","commenter_b":"Dumb woman.","commenter_a":"Well she said she meant it in jest and didn't much care if people are offended. So she did admit she was the person that posted it. Now that the voters know who she is the question is will the party still support her. My guess is yes.","post_message":"And you know it wasn't her fault, right?"},{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"}]
