[{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"10154115326121341","commenter_b":"Simply put - Hillary Clinton is a criminal, and she'll never have my vote","commenter_a":"All lives matter... Sorry but those who still support this man do not see that he is destroying the Democratic Party... For what? He will not be POTUS. For his moment of fame. He is giving Trump an edge in the elections! It is time haaretz realized this!","post_message":"The most successful Jewish presidential candidate in American history is saying that Palestinian lives matter. And he daring Hillary Clinton to disagree."},{"comment_id":"1316090455150672","commenter_b":"Swamp monsters","commenter_a":"tells you a lot about this so called president","post_message":"Truly deplorable.  Thanks to 1533 Days."},{"comment_id":"700248193457289","commenter_b":"@username honey your aluminum cap should b worn at all times ...","commenter_a":"When he opens his mouth he divides. Expected from a 1/3 white 1/3 black and 1/3 Arab who is a closet Muslim. Conflicted hate eVeryone but MUSLIMS. THATS TRUTH NOT A FALLING LYIN' tree.","post_message":"Probably... but we'll never really know will we?  Hostile Politics"},{"comment_id":"1072808739397262","commenter_b":"Oppression? You are way off base here. It is oppressive to want it to be 1959. Here is the bottom line. Do what you want but you don't get others to do what your religious Far right cult says. And I am a Christian.","commenter_a":"Alas...another unintended consequence of liberalism. In their quest to \"help\" people, they made them worse off. To correct their unintended consequence, what will liberals recommend? They will recommend coercing the college into providing the students with birth control... And class...this is another example of liberalism leading to oppression...","post_message":"What would Jesus do?"},{"comment_id":"10152805642283145","commenter_b":"Nope.","commenter_a":"@username te montas?","post_message":"The Orlando Eye attraction will be the tallest observation wheel on the east coast of the United States, and today the first passenger capsule was installed.   Will you ride the Orlando Eye? Check out photos of the progress >> @webpagelink #WFTVat5"},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"}]
