[{"comment_id":"10156327027695389","commenter_b":"Cuff the lying witch already.","commenter_a":"Sounds like a recommendation for an Indictment may be in the new future. If the DOJ rejects it.....Will their be alot of resignations from the FBI??","post_message":""},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"10153400582321051","commenter_b":"She's a bitch? Really???","commenter_a":"Have fun in jail bitch","post_message":"When this man's wife discovered he was cheating on her, here's how she decided to handle it."},{"comment_id":"10153192015881162","commenter_b":"Hell is too good of a place for her, bring her to me.","commenter_a":"They should have allowed me to drive her to hail. She wouldn't make it there.","post_message":"HORRIFIC: A mother is accused of stabbing her 4-year-old son and partially mutilating his genitals. Authorities say the 23-year-old woman then dragged him out and continued the assault in the driveway, beating the boy with a garden tool and slamming him to the ground.   FULL STORY: @webpagelink"},{"comment_id":"536499096509675","commenter_b":"he is absolutely right, this would not be permanent just temporary until we can get a system in place to do more accurate check on these people coming into our country. fdr did it. and for a good reason .....to protect the American people from harm... that was his job.","commenter_a":"Hell Yes!","post_message":"Do you agree with Trump?"}]
