[{"comment_id":"10154940269859614","commenter_b":"Sorry @username but there is no place for white gangs here in California . Many Latino gangs are backed by dangerous cartels. White racist trailer trash should lay low or move to another state and spread their hate. If they try to Lynch a Mexican or African American, they will get decapitated.","commenter_a":"I know I may sound vulgar for saying this but they better not pick fights with the wrong people here they will get shot at lol","post_message":"A white supremacist gang known as the SFV Peckerwoods, which authorities say has operated at three homes close to schools and a library, is the target of L.A. city prosecutors and LAPD.  \"We're now fighting to prevent white supremacist gangs from infesting neighborhoods. They bring with them  this toxic mix of violence and crime and hate,\" the L.A. city attorney said."},{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":""},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"1151797721550248","commenter_b":"@username \"All people of Muslim faith need to be monitored ,suspend any and all travel for them born here or not .\" \" All Mexicans not here legally will be deported and any child born here who's parents are illegal will be deported \" Mexico doesn't send their best,just drug dealers and thieves. \" Maybe because I don't lick windex off of the windows of the Trumpian short bus but sounds racist to me.","commenter_a":"Good bye all the never trumps see you after you realize that not voting for trump is just another vote for hillary who no one wants. Sorry that people didn't vote for your candidate probably because they are tired of politicians saying what you want to hear and not doing any of it.","post_message":"Republican National Committee Chairman Reince Priebus says the meeting with Donald J. Trump was great."},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"583909811799598","commenter_b":"Go away ugly rumors nasty gossip ho away","commenter_a":"So do it already and quit saying you're going to.","post_message":"Obama was just caught red handed in a massive act of treason.  Throw him out of the white house already. He is a criminal?\\t  Would you be happy if Obama was impeached immediately?"}]
