[{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"1332403530152725","commenter_b":"Beautiful doggies on your page","commenter_a":"Yeah and her third set of boobs.","post_message":"She only be 18...but Kylie Jenner is onto her second mansion"},{"comment_id":"10154088028351159","commenter_b":"I wouldn't trust her to clean my toilets !","commenter_a":"The same thing she did with Benghazi!","post_message":"In case you missed it..."},{"comment_id":"470357549819863","commenter_b":"Another Blind Bitch!!!!!","commenter_a":"Wow. How sad he has really done a lot to get us back on track after what GW bush left him with and am sorry that all these post are being done by redneck asshole","post_message":"How would you define President Obama in one word?"},{"comment_id":"10154202111261037","commenter_b":"The real question is why she felt it necessary to do it!!","commenter_a":"Here you go: These are not my words. This was a comment from a woman named Laura Johnson who posted on TYT thread, and I thought it was worth the share. When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, Texas resulting ...","post_message":"In a wide-ranging interview with FoxNews, President Obama says he failed to adequately plan for the day after the U.S. helped toppled Libya's dictator in 2011."},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"}]
