[{"comment_id":"10153937111420695","commenter_b":"Girl you got something to be thankful.","commenter_a":"God bless","post_message":"“Everybody at the church got up and started handing the preacher money, and it was just crazy. So many people got up. They started hugging me. It was just awesome. I couldn’t help but cry. It was just amazing,” the mom said."},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"10154478058311320","commenter_b":"She needs to be fired.","commenter_a":"Angela Russo","post_message":"Shameful...  are going to have to take me off the line, because I am not serving that.  And that was how a uniformed police officer was treated at Noodles & Company when she was denied service. @webpagelink"},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10154734635153797","commenter_b":"I can't believe this! That's why having your ccw's is so important. I will not leave without my .22, might not kill you, but it could save my life. Idk how the laws are there but here in Ohio, especially in Cleveland where I'm from. You need to be carrying. I would've helped her in a heartbeat. No questions asked. Then criminals would think twice, if we all start defending ourselves.","commenter_a":"I'm so mad right now not only at the whole situation but nobody had the compassion to help her I'm thinking of that was my Mother, sister auntie etc... praying..","post_message":"CTA VICTIM ID'D: The woman who was stabbed repeatedly on a crowded Red Line train Thursday afternoon has been identified as 25-year-old Jessica Hampton."},{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"}]
