[{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"},{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"677415119050364","commenter_b":"Yes....","commenter_a":"yes","post_message":"Take the poll!"},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"}]
