[{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"},{"comment_id":"10152949187346130","commenter_b":"Heheheh I don't need a beard to attract women and prove dominance. It's all in confidence and your attitude. You want dominance? Push me far enough and you'll find out your place real quick! ;)","commenter_a":"lol","post_message":"It's just evolution."},{"comment_id":"10152949649721378","commenter_b":"I don't use any drugs...yet your comment is still incomprehensible.","commenter_a":"Disturbing and sinful....","post_message":"IRELAND  MARRIAGE VOTE NUMBERS: 62.1% of voters in Ireland were in favor of same-sex marriage in the world first national vote on the issue.   Ireland's deputy prime minister, Labour Party leader Joan Burton, said Ireland was becoming \"a rainbow nation with a huge amount of diversity.\""},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"10153031134771051","commenter_b":"She should have kicked on his teeth. What an asshole.","commenter_a":"And a bunch of guys rush over to help HIM? Whee were they when she was defending herself?","post_message":"This waitress walked over to give a customer the bill. That's when he decided to grope her. Bad move."},{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."}]
