[{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."},{"comment_id":"10156887460220093","commenter_b":"@username @webpagelink","commenter_a":"Trump is a die hard Liberal","post_message":", I lived in New York City and Manhattan all my life, okay? So, you know, my views are a little bit different than if I lived in Iowa, perhaps. -- Donald J. Trump"},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"},{"comment_id":"10158374477135093","commenter_b":"Furthermore he did write an executive order which took guns away from Social Security recipients","commenter_a":"The morning after the 2008 Obama election I was not nearly as upset as liberals are now. Because unlike Trump who said exactly what he planned to do during the campaign, Obama said he was not trying to take our guns away, was not going to make us lose our doctors, and believed in traditional marriage. Obama lied in order to get elected then began do all the things he planned to do but didn't tell the truth about. Liberals are upset because Trump said exactly what he planned to do and they know exactly what he plans to do.","post_message":"But we didn riot, punch people, block traffic, take a day off school, or go on a fast."},{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"1256741554345872","commenter_b":"Says the guy who looks like Peter griffin....","commenter_a":"So, liberals are proud of the filthy mouthed losers who interrupted good people coming to hear a speaker? Makes sense - birds of a feather flock together and liberals are losers. That is why people who seek to succeed hang around republicans and others who are successful.","post_message":"Watch Donald Trump get interrupted by protesters during his North Carolina rally on Friday. By the end of the night, Trump was heckled 10 different times.  Read full story: @webpagelink"},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"}]
