[{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":" now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."},{"comment_id":"10153642525234411","commenter_b":"Para estar en un paisaje tan encantador vale la pena.","commenter_a":"PROOF THAT RUSSIAN TROOPS ARE FIGHTING IN UKRAINE @webpagelink","post_message":""},{"comment_id":"1083649161732572","commenter_b":"She belongs on the view , just her type 🐀🐀","commenter_a":"This woman is vicious & full of arrogance! Can't believe she can keep a man as her husband! Poor husband! How can he stomach this woman's character. She seems to be high all the time. Wonder if she's in session with Hillary before coming to her show. She deserves to take a hike & disappear from the Fox news screen so we can watch it again! Shooooooo Kitty!","post_message":"HOLY COW...!!!!!!  The TV fight of the century.  Newt tells Megyn she is obsessed with sex and calls her out for her pitiful coverage of Trump.  Megyn laces into Newt by telling him to get help with his anger issues.  It gets vicious.  VIDEO.  This will be the talk of the news tomorrow.  You get to see it now.  VIDEO  @webpagelink"},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"1018828211502577","commenter_b":"Thank you, that's what I'd like to know! B**** needs to SIT DOWN lol","commenter_a":"Wtf for?!?","post_message":"She's up against Malala Yousafzai and Pope Francis."},{"comment_id":"777290672402535","commenter_b":"She is a whiny bitch","commenter_a":"Yes","post_message":"Megyn Kelly Stabs Fellow Fox News Stars In The Back, This Is Horrible   She should be ashamed of herself.  Do you think Megyn Kelly should be fired?"}]
