[{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"10153394565113984","commenter_b":"As my friend @username said, stone the bitch!! I agree","commenter_a":" sorry, I can't take her seriously.","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing...  Do you think this Boston bomber got what he deserved?"},{"comment_id":"10155472723180603","commenter_b":"Girls what happen to being ladies?","commenter_a":"Inexcusable! They should all be expelled and forced to repeat the school year...","post_message":"\"'All these other girls started jumping off the table into the fight,\" said 10th grader Raejah Bratcher. \"Everybody started screaming and people were on each other's backs. Everybody was just fighting, people running in, getting hit, and running out. It was crazy.\""},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."},{"comment_id":"10154064678631336","commenter_b":"@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"},{"comment_id":"10154823170036162","commenter_b":"That is what I called the good work","commenter_a":"@username dammm","post_message":"WOW: Have you seen this? Loyal Cubs fans in Nebraska knocked it out of the park with their Halloween decorations this year, honoring the team! Their decorations include a \"Go, Cubs, Go\" light show!!!  Thanks to Sabrina and Paul Faire for sharing their video with #abc7chicago."}]
