[{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10153127223956800","commenter_b":"Jodi, you are a serious bitch. And an ableist, uninformed, obnoxious bitch at that.","commenter_a":"I urge every parent with a child with autism (I have two children dx autism) to seek out proper IGenex testing for Lyme. Lyme mimics autism. Both of my children recovered from autism w proper Lyme treatment.","post_message":"\"The whole show is about raising money -- not to cure autism. Because a lot of people are working on biomedical research. My wife and I couldn't get our kid into any kind of school or program that was adequate for him until he was 7 years old. And people with fewer resources than us -- it's unimaginable to us what they have to go through. And the kids. They deserve better.” — Robert Smigel discusses Night of Too Many Stars   ► Watch the interview: @webpagelink ► Support autism programs: @webpagelink"},{"comment_id":"1729114903976145","commenter_b":"Every country in the world should sink down these illegal Chinese fishing vessels wherever they are out of their rightful jurisdiction or territorial waters.They are becoming nuisance to every country's territorial water.","commenter_a":"GOOD, THEY ABUSING ALL THE COUNTRIES TERRITORY AND NOT RESPECTING THEM, THEY THINK THEY CAN JUST COME AND TAKE ANYTHING, LIKE WHAT THEY ARE DOING IN THE PHILIPPINES AND NEIGHBORING COUNTRIES.","post_message":"The Argentine coast guard says it chased, opened fire on and eventually sank the Chinese vessel."},{"comment_id":"10154496276031636","commenter_b":"Women are only carriers? What a disgusting mindset to see an entire sect of humanity as subhuman. For the record, men can vanish off the face of the earth tomorrow and humanity will still survive.","commenter_a":"What a sad sight to watch, so many people fighting for the right to kill there own children. Children are the children of the Father. Man can make babies with artificial overs, in a tube, but women can not have babies without a man's sperm, woman are only carrers, all children come from there father first. Maybe instead of worrying about having aborstions, we worry about the decay in society which cases the need for them in the first place. We must raise our standards.","post_message":" intent is to try to put the fathers in the process. My bill would stop the abortion if the father does not agree to the abortion."},{"comment_id":"525854287602864","commenter_b":"Send them all back to whatever country they come from. America has no room and not enough air for any of them. They are poisoning our good air.","commenter_a":"Why should he care she is a rent a kid not even his.","post_message":"Malia Obama at Center of Damming New White House Scandal"},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"}]
