[{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump \"dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.\" @webpagelink"},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"}]
