[{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"},{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"10153159608716833","commenter_b":"Took out the trash.","commenter_a":"The guy with the gun did the right thing!","post_message":"Armed Citizen: Video has been released showing a man armed with a machete kicking in a Pocatello, Idaho, apartment door last year, then getting shot by the apartment resident."},{"comment_id":"10153389397913352","commenter_b":"This women is a rachett ass lier! What a waste of space on my news feed, ya girl aint tellin the truth boo","commenter_a":"So weed paralyzes now sheesh isn't this story bullshit hahahah lmfao weed cures not kills or \"paralyzes\"","post_message":"Mother says her daughter, 17, has been left PARALYZED by a pot brownie she bought from a classmate at high school"},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."}]
