[{"comment_id":"10153316215802377","commenter_b":"\"We're\" what has he got to be mad about - he's part of the problem.","commenter_a":"I'm glad he didn't get it for president.","post_message":"\"Certainly part of what is behind the energy and the passion for Donald Trump on the Republican side and [Vermont Sen.] Bernie Sanders on the Democratic side is the frustration and anger people feel in this country,\" Mitt Romney said."},{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, \"[fill in gap] in America\"","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"},{"comment_id":"10153064860976378","commenter_b":"People need to understand that EVERYONE is entitled to their opinions whether YOU agree with them or NOT! intolerance goes BOTH ways!!!!","commenter_a":"Ummm it is a catholic school?! Maybe she can go get a job in a Muslim school....oh wait","post_message":"TEACHER FIRED - A popular teacher at Merion's Waldron Mercy Academy was apparently fired because she is married to another woman, a marriage that is 8 years old. The school says her lifestyle is not consistent with its teachings. Check out the details here: 6abc.com/@username/ and tell us what you think in the comments section."},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""}]
