[{"comment_id":"902512513119423","commenter_b":"Symbolism over substance. Can't solve problems in the real world. I hope her mommy and daddy are proud...and didn't convert her bedroom...'cause she gonna be needing it for the near future.","commenter_a":"good for them, they are not thinking of themselves but of all the other victims and future victims. God bless every one of them.","post_message":"Hint: The university president was not pleased."},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""},{"comment_id":"10153615401338010","commenter_b":"I live in a beautiful city in LA County. Our city sales tax is 10.25 per cent. I voted for this sales increase to pay for the improvements that put my city on the list of one of the best cities to live. Low crime, lush, great shopping, great roads, many services, about 15 parks, good schools and I live in a well kept condo complex where my HOA dues are over 300.00. The only blight I ever see are the smelly, stained mattresses and unwanted cheap furniture that slobs leave next to the more than amble sized trash areas. They dump in the middle of the night bec they're too cheap to pay to have them hauled away properly. My neighbors and I have concluded it is the renters here. They have no stake in keeping up the complex. The HOA pays for the removal weekly. The trash man ...","commenter_a":"Disgraceful.","post_message":"Do you have a discarded mattress on your block? How long has it been there? How many times have you reported it?"},{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"\"I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,\" New York City Mayor Bill de Blasio tweeted."},{"comment_id":"1785556881731423","commenter_b":"The white house will probably be full of naked stripper","commenter_a":"Trump will bring that back","post_message":"Yes!"},{"comment_id":"10153548977449607","commenter_b":"she wants to get out before all hell brakes loose LMAO","commenter_a":"let her travel who cares","post_message":"Some local activists are shaking their heads over the Mayor's plans to travel out of the country next week, on the one year anniversary of Freddie Gray's arrest."},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: \"A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,\" writes Todd Starnes."}]
