[{"comment_id":"10153720833452098","commenter_b":"@username LOL, Some women are so dumb !!!","commenter_a":"Straight men are so great.......LOL","post_message":"JUST IN... The victim was found lying outside of a vacant home with critical injuries. She later died at a nearby hospital"},{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"10158219481290331","commenter_b":"the regardless part won't happen. if they are illegals with serious crimes on record, they will be deported. if they're citizens of rightful and legal to stay, they won't. no matter how people try to twist the issue into a hate retoric, it is for ILLEGAL IMMIGRATION.","commenter_a":"I wish I was there to ask some students why they walked out of class and I bet half of them don't know or just want to miss class. Bet!","post_message":"Large group of students at Molina HS in Dallas ISD have walked out of class in support of today's \"Day Without Immigrants\" protests. @webpagelink"},{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing...  Is Sharia law in America a major concern of yours?"},{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once \"Obamacare\" is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"}]
