[{"comment_id":"10153076176308188","commenter_b":"Should have called Tiffany. Nothing like a woman to get the boys back on task.","commenter_a":"Did you save the fly or just let it suffer...","post_message":"So a fly landed in my breakfast juice.    Jeffy became fascinated with it struggling to live.  Next thing I know Keith is taking a picture of jeffy taking a picture of the fly and stu on skype with Wilson about the fly.  I had to join in and take a pic of the three of them taking a pic of the three of them with the fly.   Lord please help us.   Sometimes we are small and easily distracted and other times we are positively 12 year old boys."},{"comment_id":"10155938644580354","commenter_b":"OF COURSE NOT! Did anyone actually think these weasels with their blood money in their pockets would do anyting to regulate Planned Parenthood? LOLOLOLOL Fell off the dumb truck, did ya?","commenter_a":"Go back to work useless bastards","post_message":"GOP consultants who hate the grassroots--and their values--continually boast about the historic majority they won in the House, purely by their own DC insider wisdom.  But if these are the best results we can get from that majority, what have they actually accomplished?"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"1665697853729274","commenter_b":"@username How do you know Obama didn't do half the stuff he's accused of? I say he did and another half we haven't heard of yet! There isn't going to be a recount of every state, but if there was Trump probably would win by a landslide. Hillary has done nothing but lose ground!","commenter_a":"I think you guys are forgetting this is a FREE country and people don't have to perform for someone they don't respect. He hasn't earned any respect and indeed, he has done quite the opposite. Insulting people left and right and you guys just cheered. Trump believes people should bow to him and perform for him. He is NOT a king. It is his own people that were crying that no one wanted to come and all of a sudden he wants \"just the people\" Please...don't make me laugh! He is already claiming he helped keep jobs here and claiming success for Obama's successes. He has already been caught in outright lies about it. Oh I saved Sprint, they are coming back...no, that deal had nothing to do with Trump. It's laughable! Why do you ignore it? Is it too uncomfortable for you people to acknowledge he has lied to ...","post_message":"They turned up their nose at our future president."},{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."},{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"983233615058995","commenter_b":"Well, she is guilty and they are doing their jobs.","commenter_a":"Get obama to let the fbi to arest her","post_message":"“I think the bigger problem is not just the media, it’s the FBI.”"}]
