[{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10153810084117169","commenter_b":"Cornelia Gnutow Thompson","commenter_a":"The truth has a way of asserting itself. Thank God.","post_message":"News from NOVA l PBS:"},{"comment_id":"875716175906497","commenter_b":"No Muslim majority country throws gays off of buildings (unless you want to recognize the legitimacy of the \"Islamic State\"). Genital mutilation has no semblance of a relation to Islam. It's a cultural problem endemic of Northern Africa, not Islam (Christians and Jews from this region have the same problems with this practice).","commenter_a":"Yeah, except this ancient religion doesn't through gays off buildings, mutilate female sexual organs, and and want to kill anyone who doesn't become a Jedi! DUMBASS!!!!","post_message":""},{"comment_id":"10154964809584522","commenter_b":"That is very much understood that was real wow","commenter_a":"What a beast! If only the Saints' defense could move like that and cover that much ground!","post_message":"See video of the massive tornado that caused serious damage throughout New Orleans East. Here's another shot of it from another angle in the Michoud area. (Video by Aundra Woodfin)"},{"comment_id":"10152950745681717","commenter_b":"Just like allowing women turned it into a coffee klatsch, eh, Huck? With each passing day, Republicans make the USA more of a laughing stock and pariah state. If we didn't have this economy, we'd be treated like North Korea.","commenter_a":"What does he know about the US Military? He never served in it.","post_message":""},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.”  Read more here: @webpagelink"},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."}]
