[{"comment_id":"252211541884990","commenter_b":"Not worry about it.. woman should be seen, not heard","commenter_a":"Why don't you just take your ball and go home","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law.   Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning.   If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department will hear from all of us, too.   Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist."},{"comment_id":"10153718487658598","commenter_b":"Why can't liberals just coexist?","commenter_a":"Oh, but aren't liberals known for being open minded?","post_message":"Pro-Abortion Activists Freak Out New York Times Putting Picture of Pro-Lifers on Front Page"},{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"1833505306896062","commenter_b":"Oh good....another ignorant ass showing her prejudice for all to see like it should be something to be proud of.....it just shows how utterly stupid she is......but then again by hearing her accent I could have figured that out all by myself.....hey sea cow......why don't you go back to the ocean where you belong???","commenter_a":"Surely someone knows who she is and all of these comments should be sent to her. Sorry excuse for a human being!","post_message":"Ugh... welcome to Trump's America."},{"comment_id":"828297687360808","commenter_b":"she should be dropped from Food Stamps and made to work to pay for everything she's destroyed that is not right she needs to lose a little weight anyway","commenter_a":"Jobs and multiple job... Life isn't free..","post_message":"This is exactly why people should not be given money for doing nothing.  Are you sick and tired of Welfare leeches taking your money?"},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"}]
