[{"comment_id":"10155007053899641","commenter_b":"Wow people","commenter_a":"Good for them. Sad dt did this to them.","post_message":"Mexico is ready to hit the US where it hurts: Corn."},{"comment_id":"10153970648079091","commenter_b":"Just string her up!","commenter_a":"Sick people!","post_message":"UPDATE: New Mexico mom out of hospital, taken to jail after the brutal murder of her 10-year-old daughter in which police say she was injected with meth, raped, killed and dismembered."},{"comment_id":"1081904121885815","commenter_b":"I do believe I posted my suspicions about this yesterday, keep in mind that Hillary is also under scrutiny of her campaign funds and Clinton Foundation.","commenter_a":"What a loser.","post_message":"WHOA!"},{"comment_id":"1092995934129991","commenter_b":"Who has Hillary been taking campaign money from? Can you even make the connection lol","commenter_a":"I wonder why @username won't report the latest WSJ national poll. @webpagelink #ImWithHer #HillYes","post_message":"Electability has become a cornerstone of Hillary's campaign."},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":""},{"comment_id":"589335207936802","commenter_b":"Can some one please explain to her that her relevancy has expired and she has a court date in ND for vandalism to appear for?!","commenter_a":"IDIOT","post_message":"Ha ha ha ha ha ha ha. She's turning into quite the side show."}]
