[{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."},{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! \" Let's Make America Great Again\" yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"1090190811037255","commenter_b":"Dear Charlotte She gonna frack it up","commenter_a":"So proud of you @username! Can't wait to vote for you in Kentucky on May 17th! Hillary 2016!","post_message":"What kind of president would Leslie Knope be? Amy Poehler: \"Full speed ahead!\""},{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"572844126217923","commenter_b":"Before you build the wall could we please shut down all the tunnels underneath the fence?","commenter_a":"Jason Messenger","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."}]
