[{"comment_id":"688195661362262","commenter_b":"You are awesome president Obama! !!! Thank you for all you've done","commenter_a":"This guy is a crook 2","post_message":"LIVE - President Obama on the Election Night win of President-elect Donald Trump."},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"1158452534233281","commenter_b":"All that fighting over an ugly fat chick?!","commenter_a":"White trailer park trash punks","post_message":"We doubt if just one person was to blame in this insane road rage incident caught on tape. But it's clear that this woman refuses to let it go.  And after pushing and pushing the other driver, she gets a wet blast she never expected.  And it didn't end there..."},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT \"EACH AND EVERY MUSLIM\" THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON\"T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"10152694433051045","commenter_b":"twatwaffle.","commenter_a":"Melissa YES HE DOES! Can you imagine just how i said that, YES HE DOES!!!!","post_message":"Alabama Chief Justice Roy Moore sent a letter to probate judges Sunday evening ordering them to refuse to issue same-sex marriage licenses."}]
