[{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."},{"comment_id":"10153865214066680","commenter_b":"Yea she can teach them how to lie, cheat, and steal.","commenter_a":"Oh yeah","post_message":"“Hillary has spent her entire career bringing folks together on behalf of our kids,\" she says."},{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"10153384076168984","commenter_b":"Pussy fks will never face us directly","commenter_a":"Absolutely","post_message":"ISIS is not backing down. Last week’s attack in Texas is only the beginning of its plans to reign terror on the people of the United States...  Would you support wiping out ISIS?"},{"comment_id":"10153733142212708","commenter_b":"Looking at the next Presidential Family.","commenter_a":"Have a blessed Thanksgiving. You have a lovely family and we all have so much to be thankful for on this day. All the best to you on the campaign trail. A special thank you to the brave men and women who are serving in our military worldwide who can't spend the day with their families. They need a Commander-in-Chief who can provide them strength and guidance during troubled times and you, Senator, can do just that. Warm regards.","post_message":"From our family to yours, Happy Thanksgiving"},{"comment_id":"10152948923481336","commenter_b":"Generale brazilian lord me brazilian","commenter_a":"Angel Diaz Stacey Diaz @username Tom Tom Sheppard","post_message":"A breathtaking photo from the U.S. Navy shows a rainbow over the bow of the Nimitz-class aircraft carrier USS John C. Stennis (CVN 74)."}]
