[{"comment_id":"10153993590153203","commenter_b":"Well, Sharon, I'll tell you what. I don't know a lot of women who regretted NOT aborting their baby. I know quite a few women who DID regret aborting their baby. And I know a lot of judgmental, intolerant women who pronounce when they think another woman SHOULD have had an abortion. That, and Margaret Sanger's avid stance on eugenics, says a lot to me about who is pushing the abortion agenda and who is falling for their bs.","commenter_a":"I was assaulted & I chose to keep my baby. For me I only had 2 choices either A. Keep her or B. Put her up for adoption. Killing my baby which is abortion never crossed my mind. Today she is almost 9 months and I thank God for her every day.. She is a blessing to me and God has a plan for us. I can't imagine my life without her. If your Pro-life you believe in LIFE No matter what.. So even in assault/rape or incest a baby should live. It's not the baby's fault what happened. No one knows how a baby was conceived.. God has a plan for ALL unborn babies.","post_message":"Christie and Bush attack Cruz, Rubio for being too pro-life"},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"10153824492221336","commenter_b":"Start packing illegals.....","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"434085210113797","commenter_b":"You've gotta love all the women on here tooting their own horns, huh? lol","commenter_a":"My kids aren't teens quite yet (11 and 6 year old).. But people always thing thy're my brothers... They're in shock when I tell them I've been married for 12 years and my actual age LOL","post_message":"Mom genes.  Which of these women gave birth to the other two?"},{"comment_id":"927016837412270","commenter_b":"So therefore, our tax dollars wouldn't be an issue in that legislation.","commenter_a":"Donald Trump is smeared 24/7 by the media, so I'd say no. Probably the most unfair media coverage I've ever seen. Mainly because he's at odds with the globalists that own almost all the media outlets. Hell time warner owns cnn and they've given the Clinton campaign over $600K.. so what does that tell you.","post_message":"Has the media treated your 2016 candidate fairly?"},{"comment_id":"1659939417632867","commenter_b":"This would be true if Hillary got in! Stupid racist black woman!","commenter_a":"Real Hope and Change is coming to Americans !!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"657506131049235","commenter_b":"Hope she's being watched closely. It's a good bet she's surrounded by other like-minded people. It's women like her that become human bombs.","commenter_a":"Send her home","post_message":"What the mother of the Boston Bomber said after he got the death sentence is SICKENING!"}]
