[{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the \"word.\" The \"word\" is love.","post_message":"\"Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: \"Never stop believing that fighting for what is right is worth it.\""},{"comment_id":"10153778323659497","commenter_b":"Oh, NOW I find out where all the women with things are. You couldn't have said this sooner?","commenter_a":"I grew up in Bloomfield Hills. This is too accurate! 😂","post_message":"Walsh family members confirmed that Mom wouldn be home until later because of her thing."},{"comment_id":"10153656983536813","commenter_b":"Straight up asswipes.","commenter_a":"Lazy , sloppy police work, just pin it on anybody to close the case","post_message":"Children should get to talk to a lawyer before they are interrogated by police."},{"comment_id":"10153792604111746","commenter_b":"Two fools!","commenter_a":"Not at all. I love them both and i hope they are the host on 10/19 which is my Birthday.","post_message":"People on both sides of the aisle thought the two were biased."}]
