[{"comment_id":"1823139327950230","commenter_b":"As long as these people want to be citizens. No illegals allowed. Why are we babysitting other countries people?","commenter_a":"IMPEACH TRUMP Call and write your representative @webpagelink/ talking points 1 wants to lift sanctions on Russia so Tillerson and Exxon can drill big conflict of interest maybe even treason 2 where are his tax returns 2 unconstitutional act re immigration, the 3 Muslim countries NOT banned are those where he has business dealings conflict of interest 4 every president has had a White House medical exam, not Trump is he mentally ill 5 we can't wait for Painter and Eisen (Bush and Clinton ethics lawyers) law suit for disclosure Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist you by matching your ZIP code to your congressional district, with links to your member's website and contact page. HOUSE.GOV Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist ...","post_message":"Americans are making it clear: Trump's unconstitutional Muslim ban isn't going to fly.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We \"ALL\" know that Donald Trump is \"NOT\" afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on \"The Kelly File.\""},{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"10152969881283188","commenter_b":"Leave Sarah alone!","commenter_a":"I agree with ya Glenn. Any dog will let you know if they don't like being bothered- for whatever reason. If the dog had wanted to move, he would have done so. Some people just like causing grief for others.","post_message":"On hate and Sarah Palin  In seeing that we have not seen or spoken to one another in maybe two years, sadly, I would not describe Sarah and I as \"friends\".   With that being said, \"lay off her!\"  As a huge dog lover myself, and two dogs that are like members of the family, I know that NO dog is going to lay around or take abuse.   For their dogs to lay down and allow trig to \"use him as a stepping stone\" shows that this dog loves, understands and is one with trig.  What is wrong with people.  Don't you have any cops to shout down, or chant \"kill, kill, kill\" or worse yet, don't you have any cops to gun down and execute in cold blood?\"  Where is the outrage?  Where is the media?  Where is our God?  Forgive me.  I know where he is.  We have exchanged Him for a cheap electronic, silicon filled or Wall Street version of God.     \"The gods of the copy book heading with terror and slaughter return.\"  Look out here they come.  I have been unplugged from the news for two weeks.  As I am making my final leg home with my dogs by my side, I decide that I would catch up on the news only to click on this story on the blaze.  What a mistake.  My wife always says, \"stop looking, it will all still be there in a week or two.\"   How right she is.  Look at what we have become.   Get a life.   Stop hating people.  We are not all going to agree.  As I said, the well between Sarah and I was poisoned by those who wished to control and hate.  I think.  Maybe I did something to poison it myself.  Could be.  I have done stupid stuff in the past without realizing it.  Her, them or me, makes no difference.  History bends toward justice and this it will all sort itself out.   That is okay.  We are not meant to agree nor am I someone that \"needs\" celebrity friends.   She doesn't always agree with me I am sure AND THAT IS OKAY!     I bring this up for all those on the left that think that we are all cut from the same cloth politically or socially.  We are not.   I have nothing to gain politically here, what I do have in common with Sarah is what I have in common with you too ... HUMANITY.    Do we even understand that concept anymore?  This has nothing to do with dogs, and if it does, you don't know what the hell you are talking about.  Maybe you have one of those little purse dogs.  This is a lab.    A boy and his dog.  This is all about hate for the Palins.    What is the meaning of diversity on the planet on which you live?    Sure there are crazy haters on the right and it is up to those who choose to set examples to shun them from our own personal ranks, but Personally, I have found the most violent and hateful are those who preach tolerance.   If you think it is horrible what a little sweet boy is doing with his dogs permission, Let me show you what millions of girls and women are doing to their children in the death camps of planned parenthood,  Black lives matter!   White lives matter!   Blue lives matter!    ALL LIVES MATTER!  I despise what we are allowing ourselves to become.  I will not join any one on this journey to the gates of hell.    LOVE and charity, forgiveness and understanding are the answers.  We all want to belong to something bigger and better than what we currently see.  We want to know we are being heard and can make an impact and we want control of our lives.  No one in Washington, republican or democrat, is helping us build that world.  The parties, universities and the media are shaping a culture of the silence of the lambs.    I reject that view and personally, because I can only effect me and those around me, I will take the beam out of my own eye first.   I have changed how I say and approach much of what I do, with the understanding that tables need to be upturned from time to time, but I will also work to wake those willing to be awakened about who is helping shape this culture.  Defund the GOP.  Democrats, unite.  When you clean out your house and we clean out ours, with malice toward none and charity toward all, we will be on the road of recovery and maybe our children will be able to live in a world where you income, sexuality, gender or political leanings mean exactly what they should mean:  NOTHING.  \"Forgive them Father, for they know not what they do.\" @webpagelink"},{"comment_id":"10153072554446037","commenter_b":"Feed her to the hogs","commenter_a":"Bye bye","post_message":"#Jordan will execute Wednesday a woman on death row over a failed bombing after the government vowed to avenge the murder of a pilot by the #IslamicState group, an official said."},{"comment_id":"1136992022978933","commenter_b":"Every Bill which shall have passed the House of Representatives and the Senate, shall, before it become a Law, be presented to the President of the United States; If he approve he shall sign it, but if not he shall return it, with his Objections to that House in which it shall have originated, who shall enter the Objections at large on their Journal, and proceed to reconsider it. If after such Reconsideration two thirds of that House shall agree to pass the Bill, it shall be sent, together with the Objections, to the other House, by which it shall likewise be reconsidered, and if approved by two thirds of that House, it shall become a Law. But in all such Cases the Votes of both Houses shall be determined by yeas and Nays, and the Names of the Persons voting for and against the Bill shall be entered on ...","commenter_a":"It'll fail in the Senate, and if not Obama will veto it","post_message":"Even Democrats voted for a 'pause' on the Syrian refugee program."}]
