[{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10153155614114411","commenter_b":"Circumcision removes most of the nerve endings from the penis - so no, it is not good for intercourse.","commenter_a":"curcumstich is good for the sexual intercorse between man woman. But the preast outbreath and homosex agenda and child melest could make Even God leave the churche..and the girls virganity and boys firs blow job...fuck them. Herpes is an evel sicknes related both to rosesicknes that makes your body ..","post_message":"Via RT America: City health officials said 17 cases of infant herpes since 2000 have been connected to the traditional Orthodox practice of sucking blood from the circumcision wounds of infants penises."},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the \"sociopath\" Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"10157017965955206","commenter_b":"The women will rally and vote for a woman... that will be Killary. Just like Obama got his job because of his race.","commenter_a":"Check the men's response compared to the women's response here. You all k ow so.much about what we think. Well, Much of what she says has merit. Whether you like her voice or her face! She speaks for many women. As long as you make this about her voice or her face, YOU are the PROBLEM! WE are HERE! WE have a VOICE whether you think we're pretty or sexy or pleasing or NOT!","post_message":"My whole life, people have told me to settle and accept the way things are. Now, politicians are asking the American people to do the same thing: to settle for a nation that doesn’t reach our potential."},{"comment_id":"962475507142312","commenter_b":"I KNOW!!!!! They've already started. It's so funny!!","commenter_a":"That will drive them crazy","post_message":"Why does Hillary love Snapchat? Watch and learn:"},{"comment_id":"10153624257330695","commenter_b":"She should have gone after her husband instead of the mistress. It takes 2 to tango","commenter_a":"i think she was pissed!!!!! people need to quit cheating on their spouses, i can relate to this!","post_message":"Carroll County deputies say she led them on a chase down I-20 before killing the woman and then herself."},{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."}]
