[{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""},{"comment_id":"10153324817246523","commenter_b":"And this is only the beginning of another year in Wisconsin.","commenter_a":"Oh people quit ur whining an complaining! It's sickening! It SNOWS every year, this is nothing new!!! Blah, blah, blah!!!","post_message":"NEW: We're been upgraded to a winter storm WARNING in southeast Wisconsin."},{"comment_id":"1089823474413307","commenter_b":"Rhonda, your ignorance of reality is amazing!","commenter_a":"This administration MUST GO, PERIOD. Why is O allowed to take actions that have harmed this country in the eyes of the world???","post_message":"Yesterday, the Pentagon announced that the Russians could be told the location of our ground Special Operations troops in Syria, so that their Russian Air Force avoids them. This is a grave mistake. Once again, the President's administration demonstrates their inability to lead as Commander-in-Chief. Because he does not have an effective strategy for defeating ISIL/ISIS, he is putting troops on the ground without the protection of our air forces and asking the Russians, politely, to not bomb them. For over 50 years, our air forces have ensured no member of the American military has been killed by an enemy airstrike. I hope the Administration’s poor decision-making does not change this fact.  @webpagelink"},{"comment_id":"10153291024331509","commenter_b":"They are, dummy. You must be the next Nancy Grace.","commenter_a":"Fact is most of us don't drive around with hundreds of thousands in cash on us. The article barely mentions the fact that this program is geared towards getting drug dealers off the streets. Cops make mistakes because they're human but this article gives two examples that make it sound like cops are robbing innocent people daily of their cash. @username strikes again.","post_message":"You may have never heard of this program, but it's a widespread practice in which police can take your cash without any criminal charges: @webpagelink"},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"10153531144626350","commenter_b":"I agree. God bless you Lil child.","commenter_a":"This is courage","post_message":"Looking good, Leah!"}]
