[{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"},{"comment_id":"1036956366325374","commenter_b":"Your mom is a joke.","commenter_a":"America the land of the free .. Your gun laws are a joke","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"659791487492443","commenter_b":"yes but he is treating America Badly, Screw him,","commenter_a":"Stop talking about obama, you shoul start building for the vets they deserve it, and you can do it Mr, Donny","post_message":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"comment_id":"10153068348838717","commenter_b":"That is true but we all know she will never be a President","commenter_a":"She's just a Lying P.O.S!!! She will NEVER be a President!!!","post_message":"Presidential candidate Hillary Clinton sits down with Josh McElveen on CloseUP."},{"comment_id":"943485965686825","commenter_b":"Hillary wants to have DNA test to see if Chelsea is hers!!! DUH!!!","commenter_a":"Lol..she looks like Bill.","post_message":"Incredible!"},{"comment_id":"10154210673661509","commenter_b":"Sean Small look up The Southern Poverty Law Center. Look at how many WHITE HATE GROUPS that exist. A lot of them have the word AMERICAN in their names. Some of them you probably don't even know they are considered HATE GROUPS. Only 2 black hate groups are listed and BLM is not one of them. The fact that you harp on on BLM just shows you are ignorant. Why don't you focus on the NUMEROUS WHITE HATE GROUPS??? Why don't you focus on getting rid of these people in white hate groups who continue to infect this country with a disease she doesn't seem to be able to cure \"RACISM\"?? Maybe if you and people like you concentrated on fixing your HATEFUL and RACIST THINKING then racism and discrimination wouldn't exist and the BLM would have no reason to be. I don't condone violence at ALL. Violence again police ...","commenter_a":"Strange that this makes news, but when the Black Supremacist from the BlackLivesMatter hate group sends out hits on cops... they are called freedom fighters and said to be striking out against oppression. They are either both evil or both good. You cannot have it both ways.","post_message":"Two Virginia men were arrested on accusations of being white supremacists plotting to bomb black churches and synagogues as part of a race and hate war, federal authorities said."}]
