[{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."},{"comment_id":"10153318704229614","commenter_b":"This is why women live longer than men..","commenter_a":"The stupidity is strong with this one","post_message":"A shirtless man got himself into quite a predicament after climbing up a basketball hoop in Seattle and somehow managing to get stuck upside down.   Hanging by a foot, the man flailed and thrashed about while officers tried to figure out how to get him down.    Eventually, a couple of firefighters came in with a ladder, cut the net down and rescued him.   \"He may be arrested for property destruction, or at least goal-tending,\" the Seattle Police Department tweeted on Friday.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"433011990220428","commenter_b":"good hope the NIGGER DIES","commenter_a":"I likt being mean but he hevhe i loveĉit","post_message":"Will he be able to finish his second term?"},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."},{"comment_id":"1066271903469061","commenter_b":"Illegal drugs are banned.","commenter_a":"None; simply ban them! ..... instead of thinking on wasting American lives and huge amounts of money in pointless wars, we should tackle our home problems first....and gun control is the main one!","post_message":"\"What could possibly be the argument for allowing a terrorist suspect to buy a semi-automatic weapon?\"  - President Obama  More from his address here: @webpagelink"}]
