[{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10158731027245206","commenter_b":"No pair of shoes, living or dead, is worth 700 buckers. Stop it. This makes me miss the old days, when you'd never hear about some spoiled girl and her \"serious,\" attention-getting problems.","commenter_a":"Material stuff irrelevant .. dog love for ever by the way very ugly shoes","post_message":"This mischievous pup sunk her teeth into some high fashion — literally — when she chowed down on her owner’s new $700 Christian Louboutin heels."},{"comment_id":"631924593629516","commenter_b":"STUPID C..T","commenter_a":"Cheers for Hillary from Seddique Mateen, father of Pulse Nightclub Terrorist – and ideologue supporter of the Taliban and Critic of the LGBTQ community! • Seddique Mateen, the father of Orlando Pulse nightclub terrorist Omar Mateen, was spotted sitting behind Hillary Clinton at her campaign rally on Monday, August 8, in Kissimmee, Florida. • Clinton was paying tribute to the victims of the Pulse nightclub massacre at the rally when an employee of NBC affiliate WPTV noticed that one of the rally goers seated directly behind the Democratic presidential nominee was Seddique Mateen, the mass shooter’s father. • When asked about how Mateen received this preferred seating at her rally, Hillary Clinton, walked away without answering any questions. • Who instructed that Seddique Mateen be placed in such prominent seating at the Florida rally and why would they do so? • If it was a judgment error by Clinton’s staff ...","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."}]
