[{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"1440691939283888","commenter_b":"Your point Is right. This woman shouldn't have so many children if she's can't even provide them basic needs for them... oh wait... we the tax payers do that for her!","commenter_a":"I think what Eddie did was fantastic and shows what a caring heart he has. On that note, hell, if it worked for her might as well try. I'm a single mom of a 12 year old. His dad passed several years ago. I'm a veteran of the US Navy and served during Operation Iraqi Freedom. I'm a teacher that works hard for all I have, and I have thousands in student loan debt (like many other college graduates). Would anyone like to give me free money so I can spoil my son with all the latest technological gadgets? *please, before you comment about how I'm greedy, be happy for this woman. I am happy for her and I don't actually expect to receive, nor do I want any money from anyone. It just seems that this story is a \"feel sorry for me\" bit. We all have our hardships, ...","post_message":"Down on her luck, facing eviction with six children hopeful for gifts during the holidays, Tyshika Britten turned to Craigslist for help, and found it with a $10,000 donation from Pearl Jam's Eddie Vedder.  >>@webpagelink"},{"comment_id":"10154966388510329","commenter_b":"She tried to eat my tuna pasta wee bitch","commenter_a":"@username I hope you make nice pals like Pippa 🐶","post_message":"Good girl, Pippa."},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."},{"comment_id":"10153801731062144","commenter_b":"@username I know that every pedophile must have a defense attorney, but I don't want anyone that defended one as a president! I'd quit the freakin job, go hungry, and sleep in my car before I defend a pedophile! No real woman would do what she has done!","commenter_a":"How about talking about Hillary's ethics? Imagine your little girl was brutally raped and beaten, and you had to sit in a court room and listen to Hillary attack your child to get a rapist off. Would you vote for Hillary for president? Yes? Then you must be some kind of stupid. Go Bernie!","post_message":"Democrats just released a devastating ad against Donald Trump."},{"comment_id":"1263844570323065","commenter_b":"yep. Sobbing now.","commenter_a":"Started crying before I even opened the article","post_message":"These Holocaust survivors just regained a lost part of their childhood. - Jon Comulada"},{"comment_id":"10153647321457235","commenter_b":"Hide yo wife, hide yo kids...","commenter_a":"Crazy people with guns, what could go wrong?","post_message":"They're advocating open insurrection.   US Marshals are not BLM and this ain't the Bundy Ranch -- and you know what that means?"}]
