[{"comment_id":"689912921147432","commenter_b":"The left is aligned with the most pathetic in society!","commenter_a":"Very bad Photoshop ! Are you serious?","post_message":"This is really creepy. Look how close he is?"},{"comment_id":"10154036425721336","commenter_b":"Mary yes they will be out, and then be invited right back in as legals. We call that boomerang amnesty.","commenter_a":"Trump belongs in prison along with Hillary and Obama.","post_message":"TONIGHT: GOP presidential candidate Donald J. Trump like you’ve never seen him before – Don't miss 'Watters' World' at 5p and 8p ET."},{"comment_id":"1415056648547094","commenter_b":"Blacks should all go to Africa and start a country called \"obamasthan\"... If they want out, get out. The intelligent blacks and whites and Hispanics will help them leave. No US citizenship. Good bye!","commenter_a":"Show me the money!","post_message":"Check out his plan..."},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the \"alt-right\" in a speech on Thursday."},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."}]
