[{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."},{"comment_id":"467273093466185","commenter_b":"Hello . It is ok to call this guy a f....t ?","commenter_a":"Haven't we learned that terrorist have the greatest amount of patients and will take years and alter thier lives how ever they need to to carry out a plan. Throwing us off course, that's part of thier plan. Taking our attention away, part of the plan.","post_message":"Orlando shooter who killed 49 people at the Pulse nightclub was himself a regular patron of gay clubs in Florida for years, classmates, friends and club employees say."},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10155971884414062","commenter_b":"You wouldn't even bow down to GOD himself but to some woman who \"claims\" African goddess with Indian woman hair.. okaaayyyyy","commenter_a":"I take this performance highly offensive! There is Only One King and that is Jesus Christ! #Stepdown!","post_message":"This was the first glimpse of Beyoncé since her pregnancy announcement hit Instagram at the beginning of February.  Winners' list: @webpagelink Photos: @webpagelink Full GRAMMY coverage: @webpagelink"},{"comment_id":"10155895547455354","commenter_b":"Prayer's for his family and the woman that survived this crime. Where is the FBI, the commander in chief & brother Sharpton?","commenter_a":"There are no words for this outrageous act of hate. Hope they find the black sons of britches that caused this. Praying for the family......GOD BLESS YOU","post_message":"The other person in the car, who survived the wreck, says it wasn't an accident..."}]
