[{"comment_id":"10153447411644087","commenter_b":"Sexist.","commenter_a":"Jennifer Pinto","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153903650539087","commenter_b":"@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."},{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"},{"comment_id":"1349008868469783","commenter_b":"Yes that will be great. Why don't you go hang out with some of those Jew loving Muslims and see how that works for you. She is just like Soros another self hating Jew.","commenter_a":"MOOOOOORRRRROOOOOON","post_message":"Total solidarity ... or something."}]
