[{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"},{"comment_id":"10153222967261378","commenter_b":"Time for her to be shot in the face.","commenter_a":"Time for her to be released from her position.","post_message":"READY FOR MORE JAIL: Back at work and continuing to refuse same-sex marriage licenses, Kentucky clerk Kim Davis said she'll go back to jail again if that's what it comes to. Watch her tearful interview..."},{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"133746713872563","commenter_b":"Burn in Hell scumbag","commenter_a":"You mad!!!!!","post_message":"JUST WATCH: Here's a snippet from the sentencing of Michael Morgan, the man convicted of killing two children in a house fire. @webpagelink  What do you think?"},{"comment_id":"1050118365055120","commenter_b":"I couldn't even watch, turned the channel. Didn't need to hear another black actor bitch!","commenter_a":"Too bad there was not a black actor or actress that was good enough to be nominated or win a oscar!!!!!","post_message":"Well, Chris Rock didn't hold anything back. What did you think of his monologue?"},{"comment_id":"1063108630412332","commenter_b":"Hillary is such a flipflopper!","commenter_a":"If the War in Iraq made your family safer, Hillary is your candidate. If the USA PATRIOT Act secured your family, then Hillary is your candidate. If your family reaps the benefits of institutionalized racism in our justice system, then Hillary is your candidate. If you want more expensive healthcare, vote Hillary. Mine is currently $475/month (compared to my $25/month car insurance from Insurance Panda, or my $10/month dental insurance, but I digress). Hillary is in bed with big pharma, she is your candidate. If you want to vote democrat, but still want to bomb Iran, then Hillary is your candidate. If you really benefitted from the Housing crisis or from Monsanto bankrupting small farmers or Big Pharma price gouging the sick, then @username is your candidate","post_message":"“It’s not just that she’s done her homework—Mrs. Clinton has done her homework on pretty much any subject you’d care to name.”"},{"comment_id":"10153476921072217","commenter_b":"^^ dumb feminist","commenter_a":"Merge the competitions. Let's throw them all together and give them all a shot at the big bucks!! You'd be lucky to see any women get past the first round. Different competitions = different money! Dry your eyes ladies 😬👍🏼","post_message":"\"Sport is not like most of the industries the rest of us work in.\" 🎾"}]
