[{"comment_id":"10152924190906336","commenter_b":"Obama, take lessons from them. Hire illegals to build the wall and when it's done, toss them on the other side","commenter_a":"And america welcomes all through mexico.","post_message":"Saudi Arabia is constructing a 600-mile \"great wall\" along its border with Iraq to keep ISIS and other extremists at bay."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"1825652724337236","commenter_b":"Hillary's plan. More lies, more refugees, more illegals, more foreign enemy money for her favors and direct access to her etc more n more destruction of America. Bravo. TRUMPS PLAN Work with generals create plan within 30 days to defeat ISIS, Increase our military, increase our subs n ships by 350, raises for our military, 1200 more fighter aircraft, Securing our Mexican border, increase border patrol police, no more illegals, catch n release, vetting will be strict, restore our inner cities with jobs, 6 weeks maternity leave, deduct child care expenses n elderly that live in our homes, add incentives for employers t provide childcare, create new dependent savings plan, creating fair trade deals, tax reform and lower taxes for everyone and making corporate tax globally competitive, regulating reform for businesses and reviewing regulations that inhibit hiring in mining. He's for peace and us all banning together, Return our nation ...","commenter_a":"This man is a machine, he does like 16 events a day. If he works as President half as hard as he has campaigned he will be EXCELLENT!","post_message":"THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10157196875835603","commenter_b":"She's still a liar!","commenter_a":"She belongs in jail!","post_message":"#BREAKING: Hillary Clinton has chosen Virginia Sen. Tim Kaine as her vice presidential running mate."},{"comment_id":"1485309454835270","commenter_b":"Yes","commenter_a":"@username are these the leggings you were telling me about?","post_message":"Buyers beware: LuLaRoe is being sued for overcharging customers on sales tax. yhoo.it/2lEtUdq"},{"comment_id":"10152892388271749","commenter_b":"oh, that makes sense, you live in bankrupt California.","commenter_a":"more uninformed people are stating that whites killed blacks (KKK) and somehow this means whites should have no say in the current crisis. However it is necessary to point out the gross inaccuracy of the white vs black default position that is happening. The KKK was started by none other than the Democratic Party. They even held meetings in THE WHITE HOUSE. It was not a white vs black terror group It was A Republican vs Democratic terror group. All blacks were Republican at that time for reasons that are obvious and for some that are not obvious Democratic party wanted to enslave and/or lynch blacks and go figure, Republicans had a problems with that. However of the estimated 5000 people killed by the KKK, 2000 were WHITE Republicans who, just like the Black Republicans, were fighting for equality and liberty that the dems were opposed to. So get off ...","post_message":""},{"comment_id":"10153097755761323","commenter_b":"\"Oh, climate change beat ISIL.\"","commenter_a":"I wish I never clicked on the comments.","post_message":"\"Using the weather as a weapon to subjugate the globe sounds like the modus operandi of a James Bond villain\""}]
