[{"comment_id":"10155993779265389","commenter_b":"Carson and Fiorina PERIOD","commenter_a":"Dr. Carson","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"661665720654565","commenter_b":"NOT NO BUT HELL NO!!! SEND THEM BACK WHERE THEY CAME FROM!!! ANOTHER PLANET!!!!","commenter_a":"No.","post_message":"The Obamas are celebrating 24 years of marriage today. Are you proud to have them in the White House?"},{"comment_id":"10156303577690354","commenter_b":"She should be in jail for her do nothing in Benghazi.She is a liar and I hope she gets what she deserves.She thinks She is above the laws the rest of us must follow.Oh and why is Sharpton not in jail for not paying his taxes.We've got to get rid of all of these politicians.","commenter_a":"Yes she did","post_message":"\"Clinton may have committed perjury, then, when she signed a sworn statement promising that she turned over all of her work-related emails pursuant to a Judicial Watch lawsuit for Clinton’s email records.\""},{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":""},{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"}]
