[{"comment_id":"10153206762797377","commenter_b":"That's right!!! They have started doing everything you have talked about! Next they will start Building the Wall!!!! Lmbo!!!! Go Mr Trump!!!","commenter_a":"They can`t stop the peoples chose for Trump that`s already there!!","post_message":"Trump Tweets: Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!"},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"},{"comment_id":"1157156847640695","commenter_b":"All we need is more illegal Queers !!!!!","commenter_a":"Bullshit people!","post_message":"American taxpayers must now pay for separate facilities for folks who come across the border and don know what gender they are."},{"comment_id":"1834190730158366","commenter_b":"You get out bitch!","commenter_a":"Thank god its her last ! Disgrace America one more Time. ThanX 4 Nothing. Wear w/e ya Want.... Just Get Out !!","post_message":"Gorgeous!"},{"comment_id":"886020504921859","commenter_b":"You are right Mary the bitch owes Haiti","commenter_a":"Shut it down.. take some of the millions and help Haiti which some of it was supposed to be used for. Then rehire ALL NEW PEOPLE IN THE VA HOSPITALS AND HELP OUR VETS. some of those people are the rudest uncaring and unhelpful people around hire enough to take care of the vets so they don't have enough to wait so long for appointments etc. Help Americans for God's sake.","post_message":"Hillary devastated after finding out this about her foundation.  It's all coming crashing down.  Do you think the Clinton foundation should be shut down?"},{"comment_id":"10153546316384714","commenter_b":"Piss off Clinton and go smack your ugly wife.","commenter_a":"You can take the black out the ghetto, but you can't take the ghetto out the black.","post_message":"Johnson was dismissed just hours after a video of him punching a woman was released"},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."}]
