[{"comment_id":"1273278439392985","commenter_b":"This is what the feminist want for women in America","commenter_a":"Very sad! But the good part is that she is a martyr and spends eternity with our God of pure Love!","post_message":"GRUESOME VIDEO: Muslim Mob Tears 27 Year Old Woman Apart Before Killing Her Over False Accusation Of Burning Quran  This horrific \"honor killing\" was caught on video and published by the New York Times. It took place in Afghanistan…These are NOT terrorists. They are just a mob of local Muslim men administering \"justice\" to a woman who was unjustly accused of burning a Quran. ***WARNING***Video is very graphic!"},{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"685676394932163","commenter_b":"Throw her in jail.","commenter_a":"Plus she is now blaming her server stupidity on Collin Powell. Isn't that racist?","post_message":"The double standard..."},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"},{"comment_id":"10155581523315192","commenter_b":"Girl should be held responsible for her actions!!!","commenter_a":"Not news.","post_message":"This came to light when a mom received a nude picture of her daughter in a text message:"},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"975168222494648","commenter_b":"Not really , I was talking about little pussy Libtards like you Chucky boy !","commenter_a":"Yea , all money belongs to the Dear Leader. And he gives us only what we need or deserves ! Just look at how that worked out with Joseph Stalin !","post_message":"Oh no."}]
