[{"comment_id":"718075635009295","commenter_b":"Mrs Trump has nice Tits too lol","commenter_a":"Mrs. Trump, what an elegant peaceful person, a very classy confident individual...reminds me of Nancy Reagan!!!","post_message":"Michelle Obama will be remembered as the most vile and arrogant First Lady in US history!!! Let's get 4,000 SHARES to support our NEW First Lady Melania TRUMP!"},{"comment_id":"10153063599505950","commenter_b":"Hope they change the entire show. Take both women off tv and replace with meaningful entertainment.","commenter_a":"So nice","post_message":"Kathie Lee Gifford returned to TV for the first time since Frank Gifford's death: \"He passed away instantly that morning, all dressed in what he knew was my favorite outfit -- white shirt, very tight black jeans -- having his coffee, watching his TV, getting ready to go, ready for church, and excited about what we were gonna have for lunch.\""},{"comment_id":"10154029813093812","commenter_b":"While we are at it, let's ban people like you for having guns.","commenter_a":"Ban all Muslims from owning guns","post_message":"JUST IN: Man accused of shooting Philadelphia officer pledged his allegiance to ISIS and used stolen firearm, police say."},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"},{"comment_id":"1817577751825895","commenter_b":"Another good \"Christian\" pedophile! Family values liar! Beat him ,castrate him and put his sorry ass in prison for Ever!","commenter_a":"Oh my God, I watched this show, everyone of them were so talented, they are all beautiful, the kids were adorable, always dancing and singing, even the very youngest, the Mom was warm and loving. I really believed they were a great family, this is so very sad.","post_message":"Another \"family values\" hypocrite goes down in flames..."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""}]
