[{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"@username eeeeee","post_message":"These dogs don't know what to do now."},{"comment_id":"383095042054511","commenter_b":"@username who the fuck needs a third world country when animal whore leaches like u and your mom keep my taxes well spent in my own country. Keep up all the hard work in defending the fucking animals in the post and I'll set aside a little part of everyone of my days providing good reading pleasure for all of the rest of us the know a money grubbing whore when we see one. And u would definitely make a great whore make no mistake. Just like your mom was.... Now go out and b the best whore u can b and quit falling back on my taxes to earn a cocksucking living. Thanks","commenter_a":"Limit welfare to 3 yrs unless disabled. ,quit paying for children to be born with taxpayets money. If you have achild and cant pay uour hospitol bill keep thier tax returns n apply them untill bill is paid off","post_message":"This mother of 12 lives entirely off government benefits. She also funds her plastic surgery with taxpayer money. She makes more per year than most people earn at work annually.  A petition has been created demanding that she get her benefits revoked. Do you support revoking her benefits?"},{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."},{"comment_id":"10157272858800389","commenter_b":"This is very inappropriate. It is not the job of Ginsburg to comment on any of the political constituents, democrat or republican. Her job is to interpret the law only and she is way out of bounds in this matter. If she wants to leave the country somebody would have to nudge her and wake her up because every time she is seen on tv she is either falling asleep or looking like she just woke up. It is way past the time for her to retire.","commenter_a":"This old prune needs to retire. She can't even stay awake. She's hateful!","post_message":""},{"comment_id":"443593739098554","commenter_b":"Trump is just what the republican party needs, not a bunch of politians who won't stand up and not do anything but run up the debit and let all these illegals in. Everything he said was right. He did not say all Mexicans are bad. Ya'll need to get your facts straight. I think you jealous because Trump is get more respect and he is leading over ya'll. Trump is a smart man and he wants to make the country better, what are ya'll doing to improve things so far!!!","commenter_a":"Well, so far, Trump is the only one to actually stand up on his hind legs and tell the absolute truth about the ongoing invasion of our homeland. All the others mealy-mouth around and mince words, afraid to offend the \"Latino\" voters, the cheap-liberal-votes lobby, or the cheap-labor lobby. Word mincing won't get it done.","post_message":"Rick Perry had these harsh words for fellow presidential candidate Donald Trump. Do you agree with him?"},{"comment_id":"1576025939362143","commenter_b":"This is America not European dont like America go back to European take DONALD TRUMP with you ok gringo","commenter_a":"Why are people dumb enough to think people who do not want illegals in the US hate Mexicans? Or any other foreigner? It is ILLEGALS that they want to regulate, no those entering the country legally. We could do without the wall, just get more Border Patrol and more bullets...and do like other nations, shoot those crossing illegally, maybe that would satisfy the supporters of illegal immigration... Read up on Mexico's illegal immigration law.","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."}]
