[{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"10153095836953299","commenter_b":"What does she care, it's not her money.","commenter_a":"no wonder she is flopping around like a boated eel.","post_message":"Almost $1 MILLION on polling alone in just a few months...."},{"comment_id":"10153578446431509","commenter_b":"Africa's a mess. Look what happens when the USA forces the colonials out early. If Britain has still been in control these things wouldn't be happening","commenter_a":"Let's not forget what's happening in South Africa too.","post_message":"ISIS operatives beheaded two groups of prisoners, believed to be Ethiopian Christians, in Libya, according to a video released by the terror network's media arm. @webpagelink"},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."}]
