[{"comment_id":"10157109427360354","commenter_b":"but.. its ok if your a doctor and have permission?","commenter_a":"She looks evil!","post_message":"A woman from Boulder, Colorado, was sentenced to 100 years in prison for attempted murder and unlawful termination of a pregnancy after attacking a stranger and cutting her baby out of her womb."},{"comment_id":"947171632075323","commenter_b":"She can put them in her house","commenter_a":"She is insignificant.","post_message":"Now Amal Clooney slams Britain!"},{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."},{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"\"We're not taking anyone, and we're not taking anything, for granted.\""},{"comment_id":"916949761698106","commenter_b":"Stupid woman","commenter_a":"she cant find anyone who has a visa already ! ? :O","post_message":"Some women never learn"}]
