[{"comment_id":"1189205214435858","commenter_b":"Go suck or the black dicks racist bitch","commenter_a":"Look black on black crime is the number death rate among blacks! They need to talk to each other. They also need to fix their family unit, that's how young kids make it in life!","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"420220894769172","commenter_b":"Yep and anyone else. Crazy bitch","commenter_a":"If she can't take it, get out of the kitchen!","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"1210841148970887","commenter_b":"Be honest, if it was anyone other than Trump, would you STILL vote for her? Fact is she would have already packed up her tent and left town to sell more books if this was 't Donald frigging Trump she was running against? That's something to be proud of? The second worst? You see that's where a candidate needs to be a good candidate to get my vote. In my book she's not, if your Presidential standards are that much lower, ok, vote for her. Mine aren't.","commenter_a":"Sorry Bernie, but I can't sit here and watch you degrade yourself into just another shill for her. You used to hate what she stands for. Now you endorse it. I hope you find your way again Bernie. But for now. I gotta unlike ya.","post_message":""},{"comment_id":"10153218039995090","commenter_b":"Stop Hillary!","commenter_a":"REMEMBER THE.LINTL Whttps://www.facebook.com/judy.winders/posts/@username LINTON. MURDER LIST","post_message":"Taking a road trip this summer? Show that you are committed to Stopping Hillary.  Take the pledge & get your free Stop Hillary bumper sticker: @webpagelink"},{"comment_id":"975822185786810","commenter_b":"@username...I never have been a democrate I'm an independent. I chose the best man/woman for the job. And without the independent vote...hrc will lose. So...tell me again HRC is gonna be Prez, cuz it's not gonna happen without us and my fellow Bernicrates","commenter_a":"Yet you lose to Trump. All numbers say he will wipe the floor with you! BERNIE is the only one to Win against all GOP. Numbers show it. And he's winning national polls. I WILL NEVER CAST A VOTE FOR YOU...EVER","post_message":"Know someone in South Carolina who’s not sure who to vote for today? Share this."}]
