[{"comment_id":"10158034065045277","commenter_b":"No","commenter_a":"No","post_message":"Right-to-Work... Right for Missouri? We want to know your opinions, so tell us!"},{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"1059645677404171","commenter_b":"Stop her","commenter_a":"Pero que no fueron capaces de pararlo...","post_message":"LIVE NOW: Police chase in Long Beach, CA."},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1749918878564870","commenter_b":"What a bitch.","commenter_a":"American Ignorance. Do whatever you will anywhere in the world. Act as if whole world is America. He should humbly accept his sentence and after 15 years teach his fellow Americans how to behave abroad. With respect to other countries and their cultures.","post_message":"Otto Warmbier, a 21-year-old economics student at the University of Virginia, was found guilty of committing “severe crimes” against the North Korean state after he was held for allegedly attempting to steal a political banner from the hotel where he was staying."},{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"}]
