[{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"1052426431445034","commenter_b":"You do realise the Weasel is trying to kill the Woodpecker, right ?","commenter_a":"Nature is amazing! Humans could learn from it.","post_message":"This amazing photograph shows a weasel RIDING a woodpecker!"},{"comment_id":"10153138411643717","commenter_b":"FULL SAILS!! SHE CAN TAKE IT!","commenter_a":"Capt. Kenway ?!","post_message":"El Galeon Andalucia, the only galeon class vessel in the world sailing today, will be in Portsmouth Harbor beginning this week: @webpagelink"},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"10155818308010354","commenter_b":"Black thugs.","commenter_a":"Idiots!","post_message":"It wasn't enough for the mob of 50 teens to ransack the Walmart.  When they saw the disabled man in the motorized wheelchair, they wasted no time..."},{"comment_id":"1104531886270791","commenter_b":"She's a pussy cat","commenter_a":"@username take your next vaca with Marina","post_message":"Welcome to dog paradise — tons of land to run free and daily visits from human playmates. (via INSIDER)"},{"comment_id":"790580904351473","commenter_b":"You shouldn't be in office if you can't stand by your convictions! You were elected b/c the voters trusted you! You were given a mandate to turn the tide in this Country! Now do it!","commenter_a":"gutless bast---s","post_message":"What are your thoughts on this reasoning? 'Many' Reps. Afraid of 'Retribution' If They Voted Against Boehner"}]
