[{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can \"vote\" and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the \"Bobblection.\""},{"comment_id":"10156983080310354","commenter_b":"throw his ass in prison HES NOT FIT TO WALK STREETS WITH REAL AMERICANS","commenter_a":"Only 5 years?! When he gets out of prison,strip him of his Texas residency,send him to live where he belongs ,Washington D.C.,with all the rest of the anti-American felons.","post_message":"You heard about this, right?"},{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"},{"comment_id":"1505849332764056","commenter_b":"She needs to be held accountable..!!!","commenter_a":"You honestly can say that about both candidates...","post_message":"If Hillary Clinton hadn't thought that laws don't apply to her, if she had not believed that she was above the law and traditions that everyday people have to follow, she wouldn't be in this mess.  She's in this mess because of what she did.  She is in this mess because of who she and her husband are."},{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"}]
