[{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly \"represent!\"","post_message":"They're so brazen..."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"824116754360678","commenter_b":"Not one of them will be caught, and not one of them feels guilty.","commenter_a":"My gosh, where did these barbarians come from ??","post_message":"“When my son left, he had a broken basket and was hysterically crying,” one mom said."},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10153487799954087","commenter_b":"This was Trumps plan the hole time.... They followed like a bitch in heat... And she did.... Trump just out smarted them again... We will see him on TV along with the debate","commenter_a":"Little baby Trump can't handle having Megyn as a moderator. What a sorry excuse for a presidential candidate.","post_message":"#BREAKING: Donald J. Trump accused Fox News of \"playing games\" and said he would skip Thursday's Republican debate in favor of an event to raise money for Wounded Warriors."},{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."}]
