[{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10153555838691336","commenter_b":"Bring back W. I want the border sealed. Military USA should patrol its own borders. No longer want any language spoken in my country. No longer want to know that the 'immigrants' get to bring everyone. No Welfare, no SSA because you have a work history while an illegal immigrant. I want the next President to Stand for American Values. Jeb Bush only stands for Obama's values. Open Borders and Anyone can use our welfare system.","commenter_a":"he needs the help.....","post_message":"Yesterday, Jeb Bush told Neil Cavuto that he thought his debate performance \"went fine.\"  Do you think so?"},{"comment_id":"10153117964021162","commenter_b":"Killer her","commenter_a":"At the very least, SPAY THIS MONSTER!!!!!!","post_message":"DISTURBING: This mother is accused of deliberately making her 9-year-old son sick by putting feces in his IV.  FULL STORY: @webpagelink"},{"comment_id":"698436883649598","commenter_b":"What's the deal with these frogs.","commenter_a":"One of his few good decisions. General Mattis is a fucking fantastic choice","post_message":"Trump wants a military vet to be secretary of defense for the first time in over 60 years."},{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"867826306655078","commenter_b":"Oooooh ich möchte eine haben!! <3","commenter_a":"Friederike happy Welt-Giraffentag!","post_message":"Happy world giraffe day!"},{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."}]
