[{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"1021126491243474","commenter_b":"And yet a student did intervene verbally and is still alive.","commenter_a":"Shame on that teacher for not standing up for that student. Even if she was being disruptive in class she still deserves to be protected and treated with decency.","post_message":"When a white Spring Valley cop brutally assaulted her classmate, Niya Kenny sprung to her defense.  How could she have known what would happen to her next  just for speaking up? #AssaultAtSpringValleyHigh"},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"\"It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...\"  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"1609502052678904","commenter_b":"That ole man wroke that check that his azz couldn't cash....","commenter_a":"shouldnt have been talkin shit","post_message":"Damn! Racist guy gets handled for saying the N-Word!  #WSHH"},{"comment_id":"1187171674668927","commenter_b":"She has a brain?","commenter_a":"Alote of Americans support her I think we may be the ones with brain damage","post_message":"Is something wrong with Hillary's brain?"}]
