[{"comment_id":"1833505306896062","commenter_b":"Oh good....another ignorant ass showing her prejudice for all to see like it should be something to be proud of.....it just shows how utterly stupid she is......but then again by hearing her accent I could have figured that out all by myself.....hey sea cow......why don't you go back to the ocean where you belong???","commenter_a":"Surely someone knows who she is and all of these comments should be sent to her. Sorry excuse for a human being!","post_message":"Ugh... welcome to Trump's America."},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"10154450153734411","commenter_b":"@username Is there a government on this planet that is not - up to no good - ?","commenter_a":"Why are they bombing their own airport... ISIS Turks are weird","post_message":"BREAKING - #ATATURK #BLASTS:  - at least 50 dead - about 60 wounded - 2 explosions"},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1765146687072705","commenter_b":"Do it dools ya pussy","commenter_a":"Dooley Whitton","post_message":"What you need to know about Flakkathe alleged drug used by an FSU student who fatally stabbed a couple."},{"comment_id":"500239630100631","commenter_b":"Hopefully that little girl will hold a pillow over grandma bitches head later that night! Mean old bitch!","commenter_a":"What kind of monster does this ? I would kill the son of a bitch. Rot in hell !!!!","post_message":"This was too heartbreaking to watch all the way through. What kind of animal does this to a little child?"}]
