[{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"1024212657594017","commenter_b":"Your Emperor said himself 22 times on record that he doesn't have the power to do this. Game over.","commenter_a":"@username, President Obama has only threatened Veto if the try to screw his Immigration E.O.s, which by the way are Constitutional, your party is still playing their very dangerous game of obstructing everything President Obama does. As for your erroneous statement about the First Family's Christmas vacation, I will enlighten you as to the fact that other than Secret Service detail, they paid their own vacation expenses. The taxpayers always pick up the tab for security and use of Air Force One for ALL Presidents while they were in office. Now you go research!","post_message":"Republicans have only been in control for a week and already they are picking an unnecessary political fight that risks shutting down the Department of Homeland Security and endangering our security. Republicans should stop playing games and pass a clean bill to fund the Department of Homeland Security because the pointless, political bill passed in the House today will not pass the Senate.   House Republicans voted to tear families apart and deport young people who came to this country as babies. Tearing families apart does nothing to secure our borders, fix our broken immigration system or strengthen our economy.   This is not a game and it is time for Republicans to take their responsibility to govern seriously, instead of playing to the most extreme voices in their party."},{"comment_id":"10150668295129999","commenter_b":"She ugly","commenter_a":"Colleen Crann Generation Z is going to college.","post_message":"“In short, there’s a strong ‘you do you’ ethos among teens today.”"},{"comment_id":"10153598659872434","commenter_b":"@username you females don't have any sense in your head that oppose this kind of thing.","commenter_a":"It is not any feminism I know that tells a person what they can and can't wear. Beach or not. France should stop blaming their bigotry on feminism.","post_message":"French officials have cited everything from hygiene to feminism in order to ban the swimsuit"},{"comment_id":"10153064860976378","commenter_b":"People need to understand that EVERYONE is entitled to their opinions whether YOU agree with them or NOT! intolerance goes BOTH ways!!!!","commenter_a":"Ummm it is a catholic school?! Maybe she can go get a job in a Muslim school....oh wait","post_message":"TEACHER FIRED - A popular teacher at Merion's Waldron Mercy Academy was apparently fired because she is married to another woman, a marriage that is 8 years old. The school says her lifestyle is not consistent with its teachings. Check out the details here: 6abc.com/@username/ and tell us what you think in the comments section."},{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"},{"comment_id":"10153288026778690","commenter_b":"Spruce your using a fake name little woman . Punk","commenter_a":"I am iranian kurd . This is embarrassing . At the end morons stop fighting in the whole region . U are arabs killing arabs . Who cares about sunni shia garbage . It's like being in gang . Who cares what u believe . It's your choice . Stop cutting heads . Stop killing other minorities in other countries . We are all human being . Relax people . This is what non muslims want","post_message":"Yemen's president asks UN Security Council for military intervention to halt Houthi advance. @webpagelink"}]
