[{"comment_id":"10156286873240389","commenter_b":"As Hillary Clinton would say \"What difference does it make\".....NONE!!! #DefundTheGOP!","commenter_a":"Welcome back John Boehner!","post_message":""},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."},{"comment_id":"10153188400898352","commenter_b":"Do u.not care bout the girl","commenter_a":"Devil dogs","post_message":"Erin Ingram who lost an arm aged 8 in pitbull attack awarded $72M by jury"},{"comment_id":"10153608717341491","commenter_b":"You can't win when 74% of women hate you","commenter_a":"They're saying \"it's the beginning of the end of Donald Trump\" since the first quarter of 2015. It's the beginning of the end of USA.","post_message":"Elise Jordan writes that Donald Trump's treatment of women will destroy his chances of being elected"},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"}]
