[{"comment_id":"731507293614546","commenter_b":"DUMBASSES...HAVE TO KILL THINGS...HUMANS ARE FUCKED UP.","commenter_a":"He should have drug it up on the shore and smashed it's head in with a boat oar. The only thing a fish like that is good for, is seriously limiting the population of other fish in it's habitat. You can't even eat a fish like that, you could try but I wouldn't advise it. #Conservation #BottomFeeders","post_message":"Surprised?"},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."},{"comment_id":"10156471247000354","commenter_b":"Yes...IT IS A WAR AGAINST ISLAM SO...your point is?@webpagelink","commenter_a":"Sticking up for your golden Gose?","post_message":"Can't make this stuff up.   It happened this morning. VIDEO on the flipside..."},{"comment_id":"490189094517729","commenter_b":"USE PEPPER SPRAY TO PROTECT HER......SHE IS A MASTER PHD CROOK LIAR....THIEF....","commenter_a":"Cheating Trump is lying when he open his mouth and lied when he closed it. @webpagelink","post_message":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!"},{"comment_id":"1067809293363821","commenter_b":"Trump is sending all illegal aliens to Mexico even if they are NOT from Mexico?","commenter_a":"Lets see now which border are they coming over? Oh that would be the Mexican border you say. So if they are detained at that border, no matter where they come from, why shouldn't they be sent right back over that border? It should be Mexico's responsibility to police those that are breaking their immigration laws and not letting them flow freely over our border. What is so funny and absurd about this?","post_message":"\"See? Justice isn't blind, she just can't tell Hispanics apart.\""},{"comment_id":"10154997880686350","commenter_b":"Congratulations ...but women have babies every day...","commenter_a":"Kristen Howarth Scott","post_message":"Big sister-to-be Blue Ivy is just the cutest!"},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."}]
