[{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"10153257370521130","commenter_b":"She probably wouldn't be as beautiful as you are","commenter_a":"Mehul","post_message":"He said she looked very beautiful and attractive before marriage, but when he woke up in the morning and found that she had washed the [makeup] off her face, he was frightened as he thought she was a thief."},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed \"Clock Boy\" Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"1590001651301475","commenter_b":"Great she'll be a steady war monger!","commenter_a":"Yeah diplomacy works! First and foremost.","post_message":"The Young Turks #LIVE coverage of the Commander In Chief Town Hall hosted by Ben Mankiewicz, John Iadarola & Ana Kasparian"},{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."}]
