[{"comment_id":"10154474483213812","commenter_b":"Arrested for saving lives........?????? Your mother should have swallowed you.","commenter_a":"Why don't you take care of them too. He should be arrested for illegal immigration. Try and bring Mexicans through the US border and see what happens.","post_message":"Privately owned search-and-rescue company owned by American millionaire has saved 500 refugees and migrants at risk of drowning after only 2 days of searching."},{"comment_id":"401636356691325","commenter_b":"The rule applies to everyone. She needs to \"DEAL WITH IT!\" End of story!","commenter_a":"All should live by the laws!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"1040857019285867","commenter_b":"Go back to Cuba shitstain.","commenter_a":" II Bill of Rights. A well-regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed........................ . MOLON LABE (Come And Take Them). Obama, you pussy, from my cold dead hand!. . \"A well-regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\" \"I ask, sir, what is the militia? It is the whole people, except for a few public officials.\" George Mason, in Debates in Virginia Convention on Ratification of the Constitution, Elliot, Vol. 3, June 16, 1788.. NOT ONE of the new obama regulations will prevent a terrorist or thug from securing a weapon and using it ... That is the issue.... This is just more political BS for resume enhancement..... Terrorist and thugs DO NOT buy their ...","post_message":"This is only the beginning folks..."},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"10152911551916051","commenter_b":"Thats a Black Ass Dumb Bitch... Fry the Bitch.","commenter_a":"She needs a bullet. I hope they get that poor little the home and help he needs. This makes my stomach hurt","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""}]
