[{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"10153470437544726","commenter_b":"Send her ass packing!!!!!!","commenter_a":"She's from florida and hates america. Go away!","post_message":"WATCH: Ariana Grande: 'I Hate America, I Hate Americans'"},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"10155029420463690","commenter_b":"Because women are more corrupt than men","commenter_a":"First Brazil female president now Argentina. Jealousy men and women hounding women for things they continue to let men get away with. Same with Imelda and Gloria from the Philipines and current S. Korea, India's Sonia Ghandhi, liberia's grandmother, Pakistan Benezir Bhutto female presidents/PM etc!","post_message":"Cristina Fernandez Kirchner, the former Argentine president, has been charged in a corruption case and slapped with a $630m asset freeze over public tenders awarded to a businessman friend during her administration."},{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"10152950800096770","commenter_b":"Why doesn't she talk about the women her husband has been with considering her looks I don't blame him.","commenter_a":"I'm offended by the fact she isn't behind bars yet.","post_message":"At a campaign stop in New Hampshire on Monday Hillary Clinton slammed Donald Trump's recent remarks about Fox News host Megyn Kelly as \"outrageous\" but said that other Republican men running for president have made equally \"offensive\" remarks."}]
