[{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"10153748050319255","commenter_b":"Thank you for your service. 🇺🇸🇺🇸🇺🇸","commenter_a":"I am an ex Special Forces Officer and I volunteer to lead The teams that are going to infiltrate Exxon and Shell","post_message":"We can only hope, Karl.  By Daily Kos user Lefty Coaster"},{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"\"...may be the worst thing ever to have happened in the history of cinema.\""},{"comment_id":"783518591838718","commenter_b":"Hillary needs to change her tampon..","commenter_a":"Eat shit bitch","post_message":"Hillary Clinton Says ‘Christians Have To Change Their Beliefs’ Or Else… [VIDEO].  She is the one who should change her beliefs.  Do stand strong behind your faith?"},{"comment_id":"10153364798139877","commenter_b":"Robin! Amen! Everybody wrong for agreeing with that old woman!","commenter_a":"She is so wrong , she is not the Pastor nor is she the head of the Church. So far out of place in the Church , just because you put in a offering or your family started the church its not your church nor are you the Pastor. Dang shame! Guess she wants to go to hell in a hand basket.","post_message":"103-year-old woman who was kicked out of her church clapped back...now the pastor is in hot water. Watch what happened next below.   Grio fam, we're glad she put up a fight. What's your reaction?"},{"comment_id":"10154145894181973","commenter_b":"I sure wish FB had an option to simply unlike a post.","commenter_a":"I have never been prouder to be an Oregonian. THANK YOU, protesters! WE ARE BETTER THAN DONALD TRUMP!!","post_message":"At least 200 protesters marched through downtown Portland and blocked lanes of Interstate 5 early Wednesday to voice their displeasure with Donald Trump's election as the 45th president of the United States."},{"comment_id":"477247782478735","commenter_b":"All of that and his arrogance!","commenter_a":"All of the above and more","post_message":"How will you Remember Obama? www.eaglerising.com"}]
