[{"comment_id":"10153541648111336","commenter_b":"Trump is in favor of obumercare or something like it.","commenter_a":"WE HAD AN ELECTION AND WERE PROMISED BY THOSE WHE ELECTED THAT THEY WOULD DEFUND AND REPEAL OBAMACARE they haven't done either or even tried looks like both sides are out to destroy us!!!!!TRUMP FOR PRESIDENT!!!!!!","post_message":"The first Obamacare-created insurer to go under could cost federal taxpayers up to $140 million, according to a new court filing."},{"comment_id":"10158146730430354","commenter_b":"@username pay up bitch @webpagelink","commenter_a":"No way. Not a sanctuary city.","post_message":"***BREAKING***"},{"comment_id":"1216942571674495","commenter_b":"Deceitful lying criminal. God have mercy on those who vote for monster Hillary. She will destroy this country with her crimes.","commenter_a":"How telling!","post_message":"Hillary v. Hillary!"},{"comment_id":"1604700786499928","commenter_b":"@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"1180033235377842","commenter_b":"Obamo is nothing but a Fuc##^#gJerk that is trying to desroy AMERICA !!!!!!","commenter_a":"Shocked, Hassan rejected Syrian refugees! Of course Obama told the Govenors to pound sand! He's sending them in under the darkness of night on buses!","post_message":"Did your state make the list?"},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."}]
