[{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW \"FACE\": Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"10154094538521955","commenter_b":"If anyone thinks it is going to be easy taking this country back from these marxists.....think again!","commenter_a":"Police, once again are ordered to let Thugs throw rocks at them. These protests are like Disneyland for the Criminal element.","post_message":"UPDATE: RIOT AT TRUMP NM RALLY..."},{"comment_id":"1930654800491749","commenter_b":"Those idiots need to be kicked out of our country, not immigrants","commenter_a":"What a creepy group of corruption.","post_message":"That was quick –> Most national security advisors spend more than two and a half years in the job. Mike Flynn topped out at 24 days before resigning last night. President Donald Trump and Vice President Mike Pence claim they did not understand that Flynn was regularly in contact with Russian officials, including on the day Barack Obama imposed sanctions on Russia for interfering with the US election. That relationship could become the subject of investigation in Congress — at least one Republican, Marco Rubio, wants more information and has suggested combining it with a broader investigation into Russian meddling. To echo a Watergate-era inquiry from the late Sen. Howard Baker, “What did the president know and when did he know it?”"},{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"1623707571270874","commenter_b":"I hope she does and goes to prison and becomes somebody's bitch there ..","commenter_a":"They act like no one has do wrong when it came to Republican establishment, get real. I look at it very differently every dog has there day, sooner or later!!!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."}]
