[{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just \"manage\" from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"1117955828258960","commenter_b":"Smart girl","commenter_a":"Why doesn't he acknowledge Tiffany??--- his daughter with Marla??","post_message":"Donald J. Trump has asked the White House if his adult children can have top-secret security clearances."},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."},{"comment_id":"888413677941681","commenter_b":"We are aliens!!!!","commenter_a":"Blacks are the only ones seen. Thats good news. It could only mean that whites are aliens.","post_message":"Google Identifies Black People As Gorillas & Other Image Recognition Fails"},{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."}]
