[{"comment_id":"10153965474855579","commenter_b":"Oppose...no refugees, period.","commenter_a":"TAKE A LONG PAUSE.","post_message":"Syrian Refugee Program: Your Message to Congress? Support, Oppose or Take a Pause?"},{"comment_id":"10153815226441636","commenter_b":"@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"10153657681658984","commenter_b":"We have lost respect for megan and will not watch her show. I didn't think fox news would stoop to that level of questioning.","commenter_a":"What you call journalism, is piss poor.","post_message":"What Megyn Kelly just said may end the rowdy Trump/Fox feud...then again...  Do you think the Fox News personality did the right thing here?"},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"10154809033061320","commenter_b":"Whoopi goldberg should move now she is very hard on the eyes","commenter_a":"Hillary 2016❤️❤️","post_message":"REPLAY: Donald Trump in Raleigh, North Carolina."},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."}]
