[{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.\""},{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"1743707409231060","commenter_b":"Trump is gonna stomp that old bitch!! Watch and see!!","commenter_a":"They know she is much more qualified, not even close! And even Repubs don't want to be responsible for putting a nut case in the White House.","post_message":"More bad news for the Trump campaign..."},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"}]
