[{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"10156745842795725","commenter_b":"This bitch still talking !!","commenter_a":"These rioters are obvious angry, violent, hateful, ignorant people, who can barely speak their own language. They don't like Thump. Chicago people are the Haters, who seem to hate everyone. They also don't like the 1st amendment, and think they are the only ones who have. They are in for a big surprise. Well, we don't live you either. What a bunch of lying hypocrites.","post_message":"Brawls break out at the Donald Trump rally after the Republican presidential candidate postpones his rally over safety concerns. Live coverage ----> @webpagelink"},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."},{"comment_id":"1174388402587813","commenter_b":"Liars!!!!","commenter_a":"Democrats are for war on women, which is not really a war, except in their feeble minds...","post_message":"When the two Bills—Cosby and Clinton—were accused of sexual abuse, the two wives—Camille and Hillary—led the effort to blame the victims."},{"comment_id":"1048840968488441","commenter_b":"Or is the environment of higher education overwhelmingly dominated by dogmatic liberal and neo-progressive worldviews, while openly and often aggressively shunning anything resembling \"conservative.\"","commenter_a":"You're imposing some causality here, @username... Does education make people more liberal? Or do people with liberal tendencies put a higher value on education?","post_message":"One possibility might be the growing numbers of women (who tend to vote for Democrats more than men) getting college and advanced degrees."},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not \"her turn\" and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""}]
