[{"comment_id":"1099934806735302","commenter_b":"These are the ones that should be deported","commenter_a":"yes go for it1","post_message":"ISLAM GAME OVER: Dutch politicians call for mosques to shut down and ISLAM to be outlawed!   Do you agree? It's a death cult anyway..."},{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10153253558949575","commenter_b":"Just go ahead and remove her from this planet. That kind of person isn't needed here.","commenter_a":"What a POS! Hopefully she will never get custody of her child back! WTH is wrong with ppl!?!....SMH!","post_message":"An Ohio woman has been indicted on charges she trafficked her 11-year-old daughter to a drug dealer in a sex/heroin exchange."},{"comment_id":"10152742802465950","commenter_b":"How come them crazy coloradians cant just flush them like the new yorkers with their alligators.or the floridians with their boas!! Lol","commenter_a":"Time for some catfish!","post_message":"Someone dropped a few goldfish into the water. Soon, those few fish spawned into thousands."},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"734144593405526","commenter_b":"Yes","commenter_a":"Yes.","post_message":""}]
