[{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"},{"comment_id":"10154795972864456","commenter_b":"Happy Birthday","commenter_a":"Happy birthday 🎂🎂❤️❤️🎈🎈","post_message":"Help us wish Ms. Effie of Union Springs a happy 108th birthday!!!!"},{"comment_id":"750991365034044","commenter_b":"Ok idiot if you want to require those mothers on welfare to work \"chain gangs\" to \"earn\" their food stamps does this mean you're willing to pay their childcare while they do so? You think most young mothers WANT to live on assistance you're a bigger Tard than you sound! The only way this maybe possibly would fly is if you held the FATHERS accountable too!!!! Duh.....sorry it's obvious you barely made it through ninth grade TROLLER","commenter_a":"I've been saying this for years, they say our roads suck well get the freeloaders on welfare to go fix them, instead of chain gangs picking up trash make them do it. It's no ones fault but your own if you want kids, make sure you can support them! Welfare should be a times thing like a year after that your done. If you think flipping burgers is beneath you guess what if it means you have food, shelter and clothes it beats nothing at all if you have to work two jobs that's on you, maybe you should have made something of yourself! No more giving illegal aliens good stamps or any kind of government handout. You want to be an American go get a job and pay taxes like everyone else!","post_message":"Take note.....it's damn brilliant."},{"comment_id":"982881765080578","commenter_b":"I hope so how can that woman even sleep much less lead a country would she do that to all Americans how can anybody vote for her","commenter_a":"I look at this picture and am reminded of the horrible torture this man endured, before his death, and wonder what really happened and who was responsible for not seeing the embassy was secured for their safety. It may not matter to Hillary, but it does to us and the the family members of those who died.","post_message":"Could we finally bring Hillary to justice?"},{"comment_id":"1199350936785736","commenter_b":"How much is she paying herself","commenter_a":"Woman has mental health issues. I believe it is called hallucinating. She also has a friend that is also dropping the same acid and she just got smashed in the presidential election!!!","post_message":"CNN HOST To Jill Stein: “Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?”…”Um…no” [VIDEO]"},{"comment_id":"461391564049150","commenter_b":"Well Paid Bitch","commenter_a":"Not surprising, have you listened to her for more than a few minutes? Not impressive to say the least. Where do they find these people?","post_message":"Donald Trump’s national campaign spokeswoman turns out to be a sleazy welfare cheat and conspiracy theorist."}]
