[{"comment_id":"10152591837062061","commenter_b":"I like this","commenter_a":"For real!!","post_message":"Now that's wearable technology! China apprehends man trying to smuggle in 94 iPhones. abcn.ws/1waWmjv"},{"comment_id":"10156920810200354","commenter_b":"Hey Cat, I have a dog that likes cats. She break their necks and use them as a dumnbwitted limp cat as skinny playboy. Maybe I could introduce y'all. Then you and Hillary will have a lot in common except for her long awaited prison cell....Gordon, most elections was closed primaries, which means Donald couldn't continue to empty the democratic party list of intelligent members which was leaving them with the African-Americans voters and dumb and moronic white voter in that party. Anyone who could vote for Hillary must not be capable of reading or hearing...or just hate America","commenter_a":"I'm very proud of my state of Arizona. On to the White House!","post_message":"#Election2016"},{"comment_id":"10154319611824586","commenter_b":"Horrifying! All for money!! Humans are barbaric! Vegan for animals!","commenter_a":"People are killing crops:@webpagelink #PlansLivesMatter #DontGoVegan #JKGoVegan","post_message":"BREAKING: Those hermit crabs you see at beach shops & pet stores may come from this horrifying supplier.  Warning: The way workers crack crabs shells is really hard to watch :("},{"comment_id":"10153939704691178","commenter_b":"With this huge influx of illegals and radicals the REAL AMERICANS are in danger of extinction , wise up Hollywood!","commenter_a":"Must have fallen fron his star ship and landed on his head.","post_message":"Kind of hypocritical coming from a guy who owns tons of planes."},{"comment_id":"10155352061210597","commenter_b":"While I'm not a fan of the president either, I'd like to point out that a terrible congress is not a reflection of the president. That is a reflection of voters failing to elect officials who actually do their job. Our government was originally structured in order to make congress the most powerful branch. Unfortunately, modern Americans think the president holds all of the power and are far too ignorant of what their congressmen are doing. Despite an approval rating below 40%, reelection rates within congress are still at 96%. That is your problem, not the president. Granted, Obama doesn't really help matters, but even as a republican I must concede that it isn't ALL his fault, and quite honestly regardless of the fact that he is a poor president there are no grounds for impeachment.","commenter_a":"Why don't you impeach this man. History is going to show this congress as the most inept and corrupt congress in history and is being complicit in the destruction of our country by inaction","post_message":"Mandatory voting? \"The president whose major policy achievement is mandatory health insurance thinks maybe voting should be mandatory, too.\" What do you think?"},{"comment_id":"1728076730757228","commenter_b":"The pathetic woman never smiled....good riddance!","commenter_a":"I am truly sorry that Carly dropped out. I do think you would make a great Vice President. Your knowledge and experience will go s long way. Thank you for throwing your hat in the game.","post_message":"BREAKING: Carly Fiorina is ending her bid for the Republican presidential nomination."},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."}]
