[{"comment_id":"1735996146651286","commenter_b":"@username You are just a Con Man Two Faced Liar who is spreading false hope promises with zero substance to back up what your saying. You are playing America the same way you played the Americans that went to your scam Trump University","commenter_a":"Clinton is a close friend of the big banks, big pharma, and everything else that corresponds to corporate capitalism, millions of Americans already struggling will sink even further under the waves. Rental and housing prices, already astronomical, will rise to more heights of unaffordability. Drug prices and health care costs, which soared under Obama. Then, police shootings. @webpagelink","post_message":"America led by Hillary will be an AMERICA where things get even WORSE than it is now.  Higher taxes, rampant TERRORISM and MORE CORRUPTION from Washington, DC!  TOGETHER, we WILL Make America Great Again!"},{"comment_id":"773846622745734","commenter_b":"@username Hillary is For everyone . Remember being rich does not make for a bad American. Honesty and integrity and caring about each other is what matters . Turn on ur heart lite ( just like Hillary said ) Everyone matters and together we can be a united people .","commenter_a":"Well, now I feel guilty! Before her uplifting victory speech about sticking together and lifting each other up, I was on another site smacking Bernie Brats upside the head. I'm gonna work a little harder on that \" love each other \" thing! Sorry, Bernie folk! So, gently, respectfully, and with loving patience in my heart: Go Hillary, go!","post_message":"It may seem odd to hear someone running for president say we need more love and kindness in America—but we do."},{"comment_id":"10153517289928352","commenter_b":"They needa kill your ignorant ass.","commenter_a":"Idk but kill it","post_message":"An alien-like creature fished out of a toxic river or a neglected bear: What IS this scary looking beast which can chew through its steel cage?"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling \" Buddhist terrorist\" unless u want to be called ur religion as \" terrorist\" too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"10153904097708984","commenter_b":"She's an American. Deportation isn't an option","commenter_a":"DEPORT THIS TRASH","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ.  This is just disgusting.   She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
