[{"comment_id":"1264276990298713","commenter_b":"Several poor individuals could have food, shelter and job training for the amount of money spent on a wedding that won't probably last, this wedding was just to impress other rich people.","commenter_a":"ugly and ridiculous! Wasted money!","post_message":"How a billionaire gets married"},{"comment_id":"10153906125115736","commenter_b":"So should grabbing pussy.","commenter_a":"It's already beginning to sound like a dictatorship!","post_message":"Trump says burning the flag should be punishable by \"perhaps loss of citizenship or a year in jail.\""},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: \"Never stop believing that fighting for what is right is worth it.\""},{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"\"When I saw her on TV crying, I felt like she did a 360-degree turn here.\"  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."},{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"},{"comment_id":"1676742522602038","commenter_b":"#Trump could be 1st in history to win all 50 states according to linguistic #genius. @webpagelink","commenter_a":"This shows you how corrupt the media truly is!!! This was posted 9-15-2001 by the NYPost.com. It has since been deleted because it proves TRUMP is right about them celebrating on 9/11 in Paterson, N.J. : DELETED POST URL: @webpagelink The nice thing about the web is it is NEVER truly gone! Here is an archive of the post they deleted: RECOVERED DELETE POST THEY ARE TRYING TO HIDE! @webpagelink Quote from their article proving Trump is right even though they claim to never have said such things! \"Here in New York, it was easy to get angry listening to Egyptians, Palestinians and the Arabs of nearby Paterson, N.J., celebrate as they received word of the murderous attacks in New York and Washington. But Mayor Giuliani (who has been tireless and magnificent in this crisis) rightly warned New York- ers that it would be wrong to take their anger out ...","post_message":"Look at the editorial I was just sent from the New York Post on 9/14/01 - 3 days after collapse of WTC. Any apologies?"}]
