[{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"},{"comment_id":"1246176155450245","commenter_b":"And don't come to Canada go back home we don't have any room for you either","commenter_a":"That's so true","post_message":""},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."},{"comment_id":"10154219980731336","commenter_b":"Oh well....","commenter_a":"Aww. Poor things. I'm sure daddy will throw money at someone to make it happen.","post_message":"“They feel very guilty, but it’s fine.”   Donald J. Trump spoke to 'Fox & Friends' about his children Ivanka and Eric not registering to vote in the New York primary. Plus, hear what he said about choosing Ivanka Trump for VP."},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"1224050534299847","commenter_b":"Give her hell","commenter_a":"If this really occurred, the person should be discharged from Military Service.","post_message":"How sad is it that protesting the National Anthem has even extended to here?"}]
