[{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"10156245317395720","commenter_b":"What illegals are we talking about? The ones that invaded on the Mayflower? Or the ones that boldly and brazenly broke into our shores on Ellis Island?","commenter_a":"THE LAW already says certain immigrants can work without fear of deportation. They're called the ones who came here LEGALLY! ILLEGALS, on the other hand, may not work in the United States.","post_message":"184 Members of the House and 34 U.S. Senators filed an amicus brief last night supporting Supreme Court review of President Obama’s executive actions on immigration. We are confident that allowing certain immigrants to come out of the shadows, register with the government, and work without fear of deportation fully comports with immigration law and the U.S. Constitution. Read more here: @webpagelink"},{"comment_id":"1723070871241628","commenter_b":"The Republican party better start listening, the real American People are speaking LOUD AND CLEAR!!!! WE WANT DONALD TRUMP!!!!","commenter_a":"Trump 2016!! The GOP is fighting for his failure, they should unite and back our choice. We need a smart President with common sense can build and secure borders, create jobs and a better future for the USA and puts the American people first. That man is Mr. Trump, lets do this!","post_message":"Thank you AMERICA! So grateful for your support- as we work EVERYDAY to MAKE AMERICA GREAT AGAIN! En route to Wisconsin now!"},{"comment_id":"10153162470033908","commenter_b":"get outta here","commenter_a":"1 & 6 Katarina Koncarevic","post_message":"Here are 8 things you can do to potatoes you probably didn't know:"},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."}]
