[{"comment_id":"10152924291939091","commenter_b":"A woman!","commenter_a":"That's why I like my men clean cut... No beards eww...","post_message":"How dirty is your beard?  A shocking new study found men's facial hair to contain the same bacteria found in human feces: @webpagelink"},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10153365008995329","commenter_b":"ew. She's so disgusting .","commenter_a":"Should. Be. Fired. There are plenty of other \"educated\" people to rep ESPN. Or frankly to do her job you don't need a degree. You need decency.","post_message":"ICYMI (via BuzzFeed News)"},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"},{"comment_id":"10158091047615293","commenter_b":"Even Medicaid charges copays now. Where before ACA it didn't.","commenter_a":"It can't be any worse, drug prices have more than tripled over the last 4 years, Not to mention blue cross going up and more than doubled their premiums over the past few years. Blue Cross gets 300 bucks of our paycheck ever other week, and that's our part the company matches that, you add that up. 1200 a month for family coverage.","post_message":"What will healthcare look like under President Trump?  Tell us what you think in the comments below."}]
