[{"comment_id":"10154061115835530","commenter_b":"Someone blow smoke in this chicks face please","commenter_a":"Gross. Second hand smoke from cigarettes is disgusting enough, I get to choke on obnoxious people's vape fumes everywhere, and now we can add weed to the mix. Wonderful.","post_message":"Introduced by state Sen. Coleman A. Young II, D-Detroit, the bill is being called the “non-medical marijuana code.’’"},{"comment_id":"10154210423796973","commenter_b":"Aleksey Olenin","commenter_a":"What's the deal with this Westworld show? It doesn't look like anything to me... ;)","post_message":"\"Westworld\" has become the kind of watercooler-buzz show HBO loves."},{"comment_id":"10155182978984369","commenter_b":"We are animals no different then lions killing each other in self self-defense. i believe killing for money power drugs and such is a sin. Killing for self-defense would be justified","commenter_a":"A few people on here are saying that a gambling debt or drug debt isnt a good enough reason to kill someone. Maybe not for you but obviously a good enough reason for someone who kills...","post_message":"NEW INFO: The victim girlfriend told investigators she drove her boyfriend to the location of the shooting to collect on a Super Bowl bet and when he exited the vehicle, he was shot"},{"comment_id":"10156397990805354","commenter_b":"Maybe one testical...he is a RINO.","commenter_a":"At least he has balls to stand up to Obama","post_message":"Which do you want: a \"pause\" or an \"immediate halt\"?"},{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."},{"comment_id":"10153176859780667","commenter_b":"Yep..that's what it comes down too. Ungrateful brat & worse money hungry parents !!! Deport them now...but demand payment for his education& for being allowed to live in this great land of opportunities !!! Seriously !!!","commenter_a":"It figures about the money ,but they won't even get 10,000","post_message":"\"The school and city officials involved knew what they needed to do to protect Ahmed's rights. They just decided not to do it.\""}]
