[{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."},{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."},{"comment_id":"1012624708881318","commenter_b":"@username. She speaks 5 languages!! How many do you speak?","commenter_a":"I honestly can't stop crying right now to know that this monster is playing with families like this when his wife can't even speak English herself","post_message":"Watch protests at U.S. airports in opposition to Trump's executive order restricting travelers from specific countries.  Read more details on the travel restrictions issued by President Trump: @webpagelink"},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."},{"comment_id":"10154339068600399","commenter_b":"@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"\"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!\"  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."}]
