[{"comment_id":"729424187224050","commenter_b":"@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"1749284951998475","commenter_b":"I love this","commenter_a":"@username @username me in second year","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"10153609535136680","commenter_b":"Rick seems to forget about that \"Well-regulated Militia\" clause that are the first words of the 2A. It doesn't mean a armed rabble.","commenter_a":"Evil and assault weapons which need to be only in the hands of trained military, not sold to any Tom, Dick or Harry.","post_message":"Rick Scott: \"Let’s remember, the Second Amendment has been around for over 200 years. It didn’t, you know, that’s not what killed innocent people. Evil killed innocent people.\""},{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"998886506840133","commenter_b":"How about Obombas birthday?","commenter_a":"stupid dicision","post_message":"NYC Schools Close for Muslim Holiday for First Time  @webpagelink"}]
