[{"comment_id":"10153060591326955","commenter_b":"This old scant whore should have been gone long ago. She looks horrible!","commenter_a":"Ha, ha, ha!","post_message":"PAPER: Radio 1 bans Madonna, 56, for being 'irrelevant and old'..."},{"comment_id":"10152892200414753","commenter_b":"Bitch","commenter_a":"how incredibly low and self absorbed are you that you could steal money and attention this way.hope you get all the attention you want now.","post_message":"A Florida woman is facing felony charges after cops determined that she faked having breast cancer in order to swindle thousands of dollars out of friends, family, and her supporters in the community."},{"comment_id":"968795919903853","commenter_b":"The woman is so stupid, only reason she is in because of her color.","commenter_a":"Punta","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response.  'LIKE' if you think Rep. Maxine Waters should be kicked out of office for showing such strong support of ShariaLaw."},{"comment_id":"10153028104776037","commenter_b":"She should be in prison!","commenter_a":"What Democrat party lackey will Obama cart out to replace her?","post_message":"#MarilynTavenner, the Obama administration official who oversaw the botched rollout of the #Obamacare website, #Healthcare.gov, announced she will resign as head of the agency that also manages the Medicare and Medicaid healthcare programs."},{"comment_id":"10153184330157507","commenter_b":"Two people committing to care for each other for life serves society and is why government encourages it through 1100+ rights, privileges and responsibilities. If you think it's a hypocritical institution, the solution is simple. Stay out of it.","commenter_a":"Marriage is hypocrisy. The \"Government\" should have no part what so ever in it.","post_message":"That time Fox News forgot to reprogram Shep Smith"},{"comment_id":"10153240442411336","commenter_b":"incest with goats gross","commenter_a":"Guys u don't know abt islam, islam is one of the most growing religion. Coz every is's true and stay forever. People why insult 1/3 believers' religion? If again repeat such insult of us ,next time you will get ponish bY MUSLIC ACT.","post_message":"Four Egyptian kids who dared make fun of ISIS in a harmless video are headed for trial along with their teacher on charges of \"insulting Islam.\""},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."}]
