[{"comment_id":"10153530234038854","commenter_b":"We knew this was coming, all part of the homosexual agenda.","commenter_a":"By Law, Churches are automatically Tax Exempt, so there's no need for them to have an IRS 501C-3 status. If you don't believe it, I suggest you research it.","post_message":"This is going to get ugly… Obama’s Lawyer To Supreme Court: Religious Institutions May Lose Their Tax-Exempt Status If They Don’t Back Gay Marriage…"},{"comment_id":"10153778726835575","commenter_b":"These fuckers are welcome in GB but not Trump. Insane.","commenter_a":"LET'S HOPE ALL OF THESE PROPAGANDA CRAP WILL DISAPPEAR WHEN TRUMP IS SITTING IN THE OVAL OFFICE....OUR ONLY CHANCE..","post_message":"London Islamists think ISIS snuff videos are a riot!"},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"1069898906439694","commenter_b":"Trump’s running out of nonwhite ethnics to demonize. And since he needs to keep interest piqued for his free media advertising to continue, I’ve thought of a few white demographics which would work for him: LGBT people are prime. Recently an evangelist speaker at a Ted Cruz related event called for the death penalty for them because the bible has passages calling for that. And there have been comments such as the one claiming that gays are responsible for most urban violent crime. Another is that they are trying to turn us all gay. So Trump could call for making anything but heterosex illegal. That should excite his base and get hyuge media coverage. Planned parenthood employees and doctors would be favorite victims. Trump could call for imprisonment of all PP employees and the death penalty for any doctor who has any abortions already on their record. They are totally ...","commenter_a":"\"He has not proven to be somebody that has a firm grasp of policy.\" Let alone reality.","post_message":"\"He has not proven to be somebody that has a firm grasp of policy.\"  - Jeremy Peters"},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"}]
