[{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"},{"comment_id":"10154469641506051","commenter_b":"Absolutely not. She's a damn joke too.","commenter_a":"I will never claim Trump as my president. What a damn joke!","post_message":"If this goes the way some expect it to, Donald Trump could very well be impeached."},{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"1134738373236015","commenter_b":"Actually female secretions do have some nutritional value. And ok, and maybe you should suck some more dick.","commenter_a":"Ha! Says a study funded by the patriarchy and trying to get women to scientifically be cool with swallowing men's Semen. If you're gonna be anti media, don't be pro patriarchy. It's all a part of the same machine. It's all part of the same manipulation. Fuck the patriarchy.","post_message":"And now you know..."},{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"10153900410909753","commenter_b":"She seriously thinks you meant the kids! Wow","commenter_a":"how is a fence gonna help if they can just climb up it just as well... they need electric fence for them... its really sad that they r doing sumthing about it after a lil boy lost his life....","post_message":"The Disney World alligator attack that killed 2-year-old Lane Graves in Orlando, Florida devastated the nation. Nearly a week after the tragedy, authorities have just released the chilling 911 call made after the toddler was dragged into the water by an alligator. Calls were made Tuesday evening alerting EMS officials that a little boy was attacked and dragged into a lake by an alligator at the Seven Seas Lagoon resort at Disney World. One of the calls was from a woman presumed to be a... @webpagelink"}]
