[{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"10153107012089474","commenter_b":"By opening her mouth, we can generate all the revenue we need from the gas coming out of her.","commenter_a":"Hey, you nut job, take Sen, Boxer's lead and just retire.","post_message":"Right when Americans are finally feeling some relief at the pump, Nancy Pelosi wants to take it away with higher gas taxes!"},{"comment_id":"1323090797735546","commenter_b":"Woman in prison","commenter_a":"Drain the swamp","post_message":"WATCH LIVE: Bernie Sanders speaks at rally here in Phoenix, Arizona at Central High School."},{"comment_id":"785245424951309","commenter_b":"Girl go sit down somewhere","commenter_a":"those that vote for the \"first female\" president will get the same crap that the \"first black\" man president gave us.","post_message":"President Obama is speaking at a \"Get Out The Vote\" rally in Ann Arbor.  Read more about his visit: bit.ly/ObamainAnnArbor"},{"comment_id":"10154133539156509","commenter_b":"She is high on drugs of stupidity!","commenter_a":"Lol..","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10153635150260950","commenter_b":"Create a sanctuary for endangered animals instead of putting them on display for arrogant humans... This mother is at fault.. That simple.. Cincinnati Zoo should have never been given this gorilla.. They aren't equipted to protect him... If a parents negligence causes the death of an animal like this, it should be treated as a crime.. On the parents.. Shameful.. I will never go back to the zoo.. My grandkids can Google animals until they are old enough to one day take a safari...this is disgusting and unessesary..","commenter_a":"I HOPE THE PARENTS OR ADULTS THAT WERE RESPONSIBLE FOR THIS CHILD WAS IMMEDIATELY ARRESTED..","post_message":"The four-year-old boy spent a terrifying 10 to 15 minutes alone with the adult primate before the decision was made to kill it."}]
