[{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"1729830760638535","commenter_b":"Stfu dumb niggabitch.. let's see you come up with some rhymes.","commenter_a":"That was shit, idk what you people are thinking sometimes 😂","post_message":"That lie really hurt tho"},{"comment_id":"10156102999530354","commenter_b":"If he's not an illegal, he should be. What a POS. If you feel uncomfortable around the American flag, then get the hell out of our country.","commenter_a":"while your education comes out of our pocket screw you anti american crap","post_message":"Look what Matthew Guevara has to say about the American flag..."},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""},{"comment_id":"10154434943826323","commenter_b":"The Arab trade was on a larger scale mate.","commenter_a":"The British Empire and other European nations were not the only ones responsible for the suffering of blacks. For centuries, Arab and Berber traders made big profits from the highly lucrative 'business' of slavery. Millions of black Africans were captured/kidnapped from their homes, abused and sold in slave markets. Today, In places like Saudi Arabia and Qatar de facto slavery still exists. People from the Philippines, Indian subcontinent etc. live and 'work' there in subhuman conditions. This is not a history lesson. It is happening right here and now. None of this justifies in any way the crimes committed by European colonialism in general and the British Empire in particular against indigenous peoples. But I do hope Mr. Gayle (whom I respect) will not hesitate to write/speak about injustice and racism that still exist in other parts of the world - including in African and Arab nations - with the ...","post_message":"Howard Gayle: \"The education system told me nothing but lies about Africa.\""},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"10153582261225950","commenter_b":"Making it easier to make the Darwin awards a picture book.","commenter_a":"Surprise surprise...another one bites the dust.","post_message":"There have been at least 49 selfie-linked deaths on record since 2014."}]
