[{"comment_id":"550730825100820","commenter_b":"Smash these racist fucks with the same pipe, then hit them in the throat with it.","commenter_a":"Public beating","post_message":"Black Thugs Smash White Girl's Face With Metal Pipe For This Unbelievable Reason  This is horrifying. Imagine if this was your daughter.  What punishment would you want for them?"},{"comment_id":"10150700585599999","commenter_b":"Trump is strong enough to protect the country from this invasion. Certainly no one on the Left is even thinking about it.","commenter_a":"Trump is a loud mouth, arrogant, self serving, person. He does not really care about the \"Regular\" folks, he is accustom to just \"Using\" them. I am a republican and can not stand him.","post_message":"Few people can address the circumstances more definitively than John Farmer Jr., who served as senior counsel to the 9/11 commission."},{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"10153396131721130","commenter_b":"Some chick stealing ya flow.","commenter_a":"@username, you could do a better job at this! But either way, I like it.","post_message":"“This s***t was dope as hell.”"},{"comment_id":"10153868198207994","commenter_b":"There is a need to protest because even though this vile cop has been charged, he hasn't been convicted. We know how sympathetic jurors are to police. Hell most of the people commenting here would probably find him not guilty. This is more than just one bad cop. This is institutional.","commenter_a":"I sure hope it don't escalade into a riot and looting, that's all Chicago needs","post_message":"Protesters are beginning to march in Chicago right now just after disturbing video of a white police officer shooting a black teen was released. CAUTION: Viewer discretion is advised."}]
