[{"comment_id":"10153753361057464","commenter_b":"That's right! Those are AR-15s. These gun control people just don't have a clue.","commenter_a":"Ted you need to do something about this gun control crap. Like stop it","post_message":""},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say \"this was a good shoot.\" But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":" is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"1153775948001804","commenter_b":"She's still a turd.","commenter_a":"Nancy, your a turd!","post_message":"“Lady Justice has on a blindfold because all victims and all defendants are to be treated equally under the law,\" says Nancy Grace."},{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"}]
