[{"comment_id":"10153985264843984","commenter_b":"She is hot","commenter_a":"You go girl","post_message":"Fox News superstar Andrea Tantaros just hit Instagram with an awesome selfie.  She's pretty, but it's the t-shirt that makes the pic amazing."},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with \"When Affirmative Action Was White,\" and \"The Half Has Never Been Told,\" to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"10154268169886409","commenter_b":"You are just like all the other trump bashes before u run your mouth have your facts straight instead what other haters say","commenter_a":"Hitler Trump should be impeached we need to start a petition like the U.K. did to ban him from the U.S. because his a embarrassment. He is the real criminal, he committed fraud, his involved with Putin and hacking the election in his favor, he refuses to show his taxes because he probably commited fraud if he doesn't have anything to hide then he should show his taxes. He did not put his businesses in a blind trust he continues to profit from his businesses while his in office. He hasn't paid taxes in over 20 years you Trumpeters created this monster by continuesly supporting him now his out of control.","post_message":""},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"911760225550393","commenter_b":"and she's just ugly","commenter_a":"Gabbie Dib","post_message":"One Direction's Zayn Malik  spotted holding hands with girl who’s NOT Perrie   (Via Daily Mail Celebrity)"}]
