[{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"10153523758249456","commenter_b":"😂😂😂","commenter_a":"If only they had went to college....","post_message":"Today, 13 people were sworn in as Montgomery Police officers. We'll hear from MPD Chief Ernest Finely, coming up at 6. Let's congratulate the new graduates!"},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"},{"comment_id":"10152756027891051","commenter_b":"Let your women drive already !","commenter_a":"Its a respect and courtesy issue in a foreign culture. It doesnt hurt to put a scarf on her head. They arent asking her to put on a Burqa","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"1165586973515562","commenter_b":"ABSOLUTLY","commenter_a":"Why not keep an open mind ( and a closed mouth) until the evidence is in?","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10154048285749087","commenter_b":"She's a flippin' wreck yust waiting to happen....","commenter_a":"Lol they are dragging on the L for her fans","post_message":"BREAKING NEWS: Another very bad poll for Clinton."}]
