[{"comment_id":"906697222720307","commenter_b":"Only people with integrity should be allowed to immigrate to our country! If they don't respect our immigration laws, what other laws will they break? They must be ready to work and learn English to contribute to the economy and not leach off of the welfare system. Cut welfare and close the border. Enforce a high standard for admittance for immigrants .","commenter_a":"Yes","post_message":"Click to see where most American voters stand on immigration..."},{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"10156327692315725","commenter_b":"What are we going to do about that?","commenter_a":"You are right, Mr. Trump. I wish we could impeach Obama","post_message":"We need new leadership- fast!"},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"},{"comment_id":"10153871273143984","commenter_b":"go home and take obama with you !","commenter_a":"OMG. They need to take this list to Iraq and make their demands. Not here.","post_message":"Illegals just issued their new 'Bill of Rights' to the American people, and I definitely don't see many being too happy about it...  Do you think the U.S. needs a president who has a tough immigration stance?"},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"}]
