[{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"1602106276760398","commenter_b":"Yeah well Thats all she does. Thats why she'll never be president.","commenter_a":"Donald J. Trump, Gary Johnson & Hillary Clinton's position on #StandingRock is clear: they ALL support Wall Street's attempts to rape & plunder the natural world (and us) to death. The ONLY candidate who TRULY supports clean energy & kids health is @username. #InvestYourVote #NoDAPL #SilenceIsConsent!","post_message":"My running mate, Ajamu Baraka, and I stood in September with #NoDAPL water protectors at Sacred Stone Camp in North Dakota, where the Dakota Access pipeline is being built in violation of a 19th-century U.S. treaty with the Standing Rock Sioux.  The desecration of sacred land and the 500-year violence against indigenous people must end if we are ever to see a just society that works for all of us, not just the 1 percent.  jill2016.com/standingwithstandingrock"},{"comment_id":"942171079182981","commenter_b":"Pussy","commenter_a":"Looks like a Bitch fight","post_message":"Slam City #Fight In The Park!   One Of The Fights In Last Months Fight Comp!  To submit content for our Upcoming #FightComp download the Worldstar App in the App store goo.gl/CnyR5l and access our brand new camera feature!"},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"},{"comment_id":"10156404407160354","commenter_b":"You dumb bitch","commenter_a":"what an idiot!","post_message":"Terrorists just need a hug and a lollipop...."},{"comment_id":"1071143486278732","commenter_b":"Good point kind sir haha","commenter_a":"Lmao Joshua this would be you...","post_message":"Husband practically demolishes house to build massive fish tank"},{"comment_id":"10153635150260950","commenter_b":"Create a sanctuary for endangered animals instead of putting them on display for arrogant humans... This mother is at fault.. That simple.. Cincinnati Zoo should have never been given this gorilla.. They aren't equipted to protect him... If a parents negligence causes the death of an animal like this, it should be treated as a crime.. On the parents.. Shameful.. I will never go back to the zoo.. My grandkids can Google animals until they are old enough to one day take a safari...this is disgusting and unessesary..","commenter_a":"I HOPE THE PARENTS OR ADULTS THAT WERE RESPONSIBLE FOR THIS CHILD WAS IMMEDIATELY ARRESTED..","post_message":"The four-year-old boy spent a terrifying 10 to 15 minutes alone with the adult primate before the decision was made to kill it."}]
