[{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"801111976648525","commenter_b":"Wow that's all I can muster after reading these comments","commenter_a":"copy that.....","post_message":"This brave, hard-working man has accomplished so much in the face of unprecedented obstructionism and hate. History will treat him kindly.   Thanks to Roy Mark Ramdas."},{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""},{"comment_id":"1668611910083188","commenter_b":"She ain't done nothing I wouldn't have done. I do not think any red blooded American should have to put up with this nonsense!!","commenter_a":"Stacey said what we all think, good for her.","post_message":"Stacey Dash has been suspended by Fox News for saying this to Obama. She needs our support. Should Stacey Dash be reinstated?"},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."},{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."},{"comment_id":"1692614590979428","commenter_b":"you have to take care of Americans first..children, the homeless, our Veterans. why do our taxes go to m.f. illegals??????","commenter_a":"Come on congress stop stuff like this. He must to have your ok.","post_message":"Obama's budget sets aside $17,613 per unaccompanied minor that illegally crosses the U.S. border."}]
