[{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"10155076639181337","commenter_b":"@username Delete yours Racist POS","commenter_a":"How many time during his presidency was Obummer on Fox? So I don't blame trump for not wanting to deal with CNN and their fake reporting.","post_message":"Fox News defending CNN?? Donald J. Trump has inspired the impossible."},{"comment_id":"1342884069080344","commenter_b":"And deport!","commenter_a":"Anyone wearing a mask does not want to get their picture taken when they destroy, throw them in prison and make them pay for damages.","post_message":""},{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"10153215543531519","commenter_b":"She now has to move from comedian to propagandist. Not an easy feat","commenter_a":"Last nights show was unfunny. Amy Schumer was not funny last night IMHO. She's really being pushed right now, and while I think she can be funny, there are way funnier female comedians.","post_message":"Watch: Amy Schumer crushed it on \"SNL\" last night, but this gun commercial parody might be the most brilliant short clip the show has done in years"}]
