[{"comment_id":"10153137487806336","commenter_b":"Because 'not topless' she would never make the cover. Topless, she is on the cover. Follow the money.","commenter_a":"Why the hell do you have to pose topless to represent yourself? She plays golf, she's not a go go dancer so pose with something that represents your sport. As it is all she represents is the moral decay of America.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\"  LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"10154052672876051","commenter_b":"You deserve crooked Hillary!","commenter_a":"LMFAO, Clinton has SECURED enough electoral votes that she doesn't even NEED TO campaign anymore. Nice try there. It's pretty goddam pathetic that the absolute BEST the \"party of values\" could scrape up is a con artist who cheated on wife #1 with wife #2, has FIVE children from three different wives, wife #3 lied about having a degree and may possibly be an illegal immigrant; Trump appeared on the cover of Playboy and owned strip clubs AND gambling casinos; admits he wants to bang his own daughter; mocked the handicapped; supports torture; numerous business failures; bribed Florida AG Pam Bondi; is facing ethics lawsuit regarding Trump University, and that's just off the top of my head - yeah, right. Some \"Presidential\" material. So shove your fake-ass BULLSHIT stories about emails and Benghazi, you cheap phony \"patriots\" supporting Trump.","post_message":"Election swing: Donald Trump is now leading Hillary Clinton by two points in a major nationwide poll. Would you like to see Trump shock the world and win this November?"},{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: \"Loose lips sink ships.\"","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"10153381284694087","commenter_b":"And until tools are in place, ban all Muslim immigration!","commenter_a":"Bubio is a big money lobbyists puppet! Vote for Trump!","post_message":"\"How many attacks on the homeland will we have to endure before the president understands that lawful intelligence tools subject to judicial review are necessary to win the long war against radical Islamic jihadism?,\" Sen. Marco Rubio wrote in a scathing op-ed along with Sens. Tom Cotton and Joni Ernst."},{"comment_id":"1291146050978446","commenter_b":"I really like this nasty woman VOTE BLUE>","commenter_a":"I love Senator Warren! She is a ball buster and has no problem getting her point across. We need more like her in the Senate. Go Elizabeth.","post_message":"She's had it with the hypocrisy and double standards..."},{"comment_id":"1376440642415680","commenter_b":"Women today have lost their values and morals.","commenter_a":"Ugly","post_message":"Dare to bare!"},{"comment_id":"999642010128853","commenter_b":"Close the border! People that come to this country should not try to change it to suit their needs / religion. When they come here they should accept our customs and laws. If they don't like them.STAY THE HELL OUT! simple!","commenter_a":"Bullshit","post_message":"EVERYONE needs to keep this in mind tonight."}]
