[{"comment_id":"10154935119131753","commenter_b":"Ditch her now!!!!! She is the worst choice! All she has done is donate millions to the orange one!","commenter_a":"Senators McCain and Graham are probably already on his enemies list. Please do the right thing here!","post_message":"If a third Republican senator joins the opposition to DeVos, it may not only be unusual; it could be historic."},{"comment_id":"909436415764813","commenter_b":"@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."},{"comment_id":"1055977171151281","commenter_b":"What do you expect from this Muzzie piece of shit.","commenter_a":"...and what did Obummer fight...Oh I know...golf par...didn't happen !","post_message":"***PATRIOT ALERT*** \"It is the inescapable duty of the Congress of the United States today to censure President Barack Obama for casting doubt on the sacrifices and motivations of the Americans who fought the Second World War—on the eve of Memorial Day, no less.\""},{"comment_id":"10154334992691130","commenter_b":"Hillary claims to be for equal rights and pay for women and care for womens rights but she still pays men more than women. She does not care about women it`s only money she cares about .. abortions save money ,that is why she is for abortion..","commenter_a":"Note to these kids: Don't bother asking Trump. He has no answers for you that are going to give you hope. He'd probably tell the children that they need to be vetted first to see if they love American values, even though they're only children.","post_message":"Ahead of tonight's debate, the children of Aleppo ask Hillary Clinton and Donald J. Trump the questions THEY would like to see answered."},{"comment_id":"175417336287166","commenter_b":"#ShesWithStupid","commenter_a":"Are so called democratic people stating that they only want decisions via a democratic process to agree with their views? Is the USA on the verge of Facism and is this coming from so called Democrats.","post_message":"Protesters gather in New York's Washington Square Park to rally against President Trump's policies. Watch on #FacebookLive."},{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"},{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"}]
