[{"comment_id":"1069048556481240","commenter_b":"Really, how is this possible!!! Illegal immigrants are cover in the Constitution???","commenter_a":"NO they do NOT","post_message":"Incredible!"},{"comment_id":"10153264300638433","commenter_b":"Ladies, please, you're both pretty.","commenter_a":"Hillary would say: what difference does it make!!","post_message":"We look at what readers have to say about our fact-checks of Hillary Rodham Clinton. What do you think? @webpagelink"},{"comment_id":"10153430837822061","commenter_b":"beautiful woman","commenter_a":"Beautiful Robin!","post_message":"Robin Roberts looking stunning this afternoon! She's on her way to the red carpet. #Oscars"},{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"},{"comment_id":"1370743996276280","commenter_b":"She knows, because she spent a lot of money buying all those super delegates. Fact is neither will have enough pledged delegates to win outright, so bribed insiders will determine the outcome. That's really democratic isn't it. It really the Clintons and the DNC that are killing the party.","commenter_a":"Vote SANDERS","post_message":"Hillary Clinton said what everybody outside of Bernie Sanders and his supporters are thinking. The Democratic nomination process is in effect over, and there is no way that she won't be the nominee."},{"comment_id":"1106803252686150","commenter_b":"She is a LIAR","commenter_a":"How could Trump have the nerve to accuse Bill Clinton of being abusive to women? Just listen to Megan Kelly: \"You called women slut, pig, dog and disgusting animals. How long will America put up with this low life of a man.","post_message":"“I don't really care about the Monica Lewinsky thing other than I think that Hillary was an enabler,” Donald J. Trump said. \"And a lot of things happened that were obviously very seedy, I mean, he was impeached for Heaven's sake!\""},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"}]
