[{"comment_id":"549469748549029","commenter_b":"That's y he got molested in jail for being a fucking bitch... Some1 should at least throw some boiling water on him so he can see how that feels","commenter_a":"Ryan Smith","post_message":"Heartless: Scumbag Throws Boiling Hot Water On A Cat!"},{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"\"Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.\""},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation \"could be used to target transgender individuals for discrimination and harassment.”"},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year?   Watch live: @webpagelink"},{"comment_id":"10152898604455927","commenter_b":"She will get away with her lawlessness","commenter_a":"As soon as you hold the Bush administration responsible for the millions of emails that disappeared in thin air.","post_message":"Hypocrisy abounds!"}]
