[{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"10154423395266800","commenter_b":"Bitch you trippin","commenter_a":"The way Trevor Noah struggles with jokes, hardest job seems to be Jon Stewart's replacement","post_message":"Think your job is a drag? Try being one of Trump's surrogates."},{"comment_id":"10153258097608984","commenter_b":"And reporting them doesn't help. Even though you should ... This is disgraceful","commenter_a":"The sick part is my neighbor/friend gets 1800.00 a month via foodstamps and cash aid. Crazy huh. And she's an illegal and so is her boyfriend.","post_message":"Wow, I had no idea the government could do this. Now I'm terrified...  Are you tired of getting pushed around by big government?"},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"10153663398345695","commenter_b":"Are you for real, time and money wasted on a couple of idiots that felt the need to drop confederate flags on a church lawn!!!","commenter_a":"Can someone please explain to me how this is a crime .","post_message":"\"What can you do? Nothing but pray for them,\" said Stacy McCrary.   Why the suspects can't be charged with a hate crime starting on Channel 2 Action News at 4 p.m."},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."}]
