[{"comment_id":"875517669161528","commenter_b":"Well here's the problem because of women like you these little Angel can't even make to birth how disgusting!","commenter_a":"The American dictionary says it's a human embryo, human fetus, human unborn baby. Common sense says it deserves human rights.","post_message":"Tell Congress to protect the unborn! Sign your Life at Conception Act petition today!  CLICK HERE to sign! @webpagelink"},{"comment_id":"10153154705006051","commenter_b":"Can't stand your ass either","commenter_a":"Can't stand Al Sharpton!! He is an evil racist!","post_message":"Al Sharpton was asked if the $5.9 million settlement for Eric Garner's death was enough. His response: No. He also has another demand. Do you agree or disagree with Sharpton?"},{"comment_id":"10153875546363352","commenter_b":"Smh girl please...","commenter_a":"Let's see how much he's kicking out for a settlement","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""},{"comment_id":"10153366804443635","commenter_b":"Old testament commands to kill is now invalid. You are beyond ignorant Kyle. You'll do anything to defend any religion except Christianity. Did i say you should be killed, you nut? I'm not talking to you anyways. Get your nose out of my conversation with him.","commenter_a":"Kill the unbelievers wherever you find them.\" Koran 2:191 \"Make war on the infidels living in your neighborhood.\" Koran 9:123 \"When opportunity arises, kill the infidels wherever you catch them.\" Koran 9:5 \"Any religion other than Islam is not acceptable.\" Koran 3:85 \"The Jews and the Christians are perverts fight them.\"... Koran 9:30 \"Maim and crucify the infidels if they criticize Islam\" Koran 5:33 \"Punish the unbelievers with garments of fire, hooked iron rods, boiling water melt their skin and bellies.\" Koran 22:19 \"The unbelievers are silly urge the Muslims to fight them.\" Koran 8:65 \"Muslims must not take the infidels as friends.\" Koran 3:28 \"Terrorize and behead those who believe in scriptures other than the Qur'an.\" Koran 8:12 \"Muslims must muster all weapons to terrorize the infidels.\" Koran 8:60. That seems pretty pure to me, purely evil!","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"10154440357348256","commenter_b":"ANY WOMAN BUT HILLARY!","commenter_a":"Looking forward to the Change!","post_message":"All 50 signed a letter warning that, if elected, Donald Trump \"would be the most reckless President in American history.\""}]
