[{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"10153401105516350","commenter_b":"She was rude","commenter_a":"He was very rude with Savanna this morning with the \"would you rather\" bit.","post_message":"\"I've been to therapy since,\" the America's Got Talent judge said."},{"comment_id":"1136430346423719","commenter_b":"You color blind bitch you was raised by a punk made MF and a hoe","commenter_a":"That was fucking horrible, what the fuck are clowns at #wshh promoting this stooge for? Oh wait, he's in jail for having an illegal gun. Must be a bad as rapper now. Gtfoh","post_message":"Kodak Black was rapping about his real life struggles & facing death at only 14 years old! #WSHH #FreeKodak #KodakBlack"},{"comment_id":"10153396131721130","commenter_b":"Some chick stealing ya flow.","commenter_a":"@username, you could do a better job at this! But either way, I like it.","post_message":"“This s***t was dope as hell.”"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"10154427648451955","commenter_b":"And she is a total lying bitch.","commenter_a":"He's an ASS !!!!","post_message":"Donald Trump, on releasing his tax returns (Source: NYT)"}]
