[{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"642456822585523","commenter_b":"ong! snd the PC powers that be will make a laughing-stock yet again of America & our Right to defend Our Laws!!!","commenter_a":"You get detained or arrested for saying the word \"bomb\" in an airport and this turd gets away with this? If it were a white boy, we'd never hear the end of it.","post_message":"JUST IN..."},{"comment_id":"915165211871817","commenter_b":"@username guns don't kill. Stupid demonRATs with guns kill.","commenter_a":"You're doing great, Bernie!","post_message":"“This may not be great politics, but I think the Secretary is right. And that is that the American people are sick of hearing about your damn emails.\" -Bernie #DebateWithBernie"},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"},{"comment_id":"1746704652254245","commenter_b":"Wow really Michelle Pugh, you put yourself in that situation for sleeping with her father\" a married man: but you won't tolerate public shaming Really looks like an excuse to try to squeeze money out of someone which is his daughter SMH say;s a whole lot of type person you are!!!!!!!!! No class!!!!!!!!!!!!!!!!!!!!","commenter_a":"Nasty is all I can say","post_message":"Michelle Pugh's life has changed dramatically in the short few months since her four-year affair with Ozzy Osbourne was revealed."},{"comment_id":"10152557601575950","commenter_b":"Well they can't come back and tell the others that there are no virgins","commenter_a":"French terrorist ? I never heard viva la France during a plane hijacking and if I hear Allah Akbar I'm knocking that son of a bitch out","post_message":"There is evidence the three dead suspects -- brothers Said and Cherif Kouachi and grocery store gunman Amedy Coulibaly -- knew each other and shared common ties with known terrorists."},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"\"If he says he's a woman, then he's a woman.\""}]
