[{"comment_id":"554388108092251","commenter_b":"Merry Christmas to you and your family","commenter_a":"GOOD+++","post_message":"May your Christmas be filled with happiness and hope. Let us not forget the women and men overseas protecting our freedom. Merry Christmas from my family to yours."},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"10153209825548445","commenter_b":"Not if you make the tincture right","commenter_a":"Don't make edibles at all. If you want an edible high, just buy/make tincture and eat it with cookies. Or just eat the weed in fillable capsules: 1. Decarboxylate your Dry herb 2. Fill swallable capsules with dry herb 3. swallow capsules with food and drink","post_message":"10 Commandments of #Marijuana Edible Safety"},{"comment_id":"1676201889329258","commenter_b":"This is old news, these slimy pieces of shit should be behind bars!","commenter_a":"How is that a bombshell...? The whole thing was fishy from the beginning. It's like I fully expect more shit to come out about the Wall Street Bailout...","post_message":"They lied to us anyway."},{"comment_id":"10153882312643690","commenter_b":"Say this to naked girls and bars in japan .","commenter_a":"What a mistake","post_message":"Islam has never made more than a marginal impact on Japan, although the history of Japanese relations with Muslims stretches back further than most people imagine, the Japanese included."},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"10153376704131051","commenter_b":"Someone needs to beat her the same way","commenter_a":"Dear God in heaven. God bless this poor child.","post_message":"Officials couldn't believe that someone would treat a child like this."}]
