[{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"10153677657398132","commenter_b":"She to good for him it's time she finds a real man","commenter_a":"More like scott dick sack !","post_message":"\"They urge her to never take him back.\""},{"comment_id":"1095436653882721","commenter_b":"Shut the Hell Up!","commenter_a":"this asshole can;t handle protesters and people actually think he can handle trained killers. Yeah DISASTER BELIEVE ME DISASTER IS TRUMP","post_message":"Exactly.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"675287475916889","commenter_b":"so we don't need Muslims, Blacks, Hispanics, French or England immigrants here.....Missing anyone?","commenter_a":"We are having the same problem here with blacks, Hispanics, and muslims. They do not want to assemilate into the American society. They want their old country here with American benefits. Wake up America. We don't need a France or England here... or Sharia Law!","post_message":"Thankful hostages in France have been freed the terrorists have been brought to justice. A valiant and heroic performance by the French police.  UPDATE: Sadly, early reports hostages had been freed were premature. Our prayers are with victims and their families and our thanks with the police."}]
