[{"comment_id":"10153224011251051","commenter_b":"Shoot the the sonofbitch","commenter_a":"Dirt bag!","post_message":"A lot of people considered this man a hero. Then the truth came out."},{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"},{"comment_id":"10153420202186323","commenter_b":"Why do people feel the need to insult disabled people anyway what ever word is used?","commenter_a":"You know what? Decent people will not say 'Retarded' around the mentally challenged, because those are the actual victims who have a right to be offended. I won't say retarded around retarded people. Around non-retarded people, different story. If your feelings are hurt by me stringing a couple letters together to form a word that has had not impact on your life, tii bad.","post_message":"\"It’s not about policing language, but having “a call to action” that will make people think twice about using a term that can hurt and exclude so many people.\""},{"comment_id":"10153558061286037","commenter_b":"Doesn't matter. BUT FOR her illegal arrest, she would not have been in jail.","commenter_a":"aaaand boom goes the dynamite.","post_message":"Waller County prosecutor Warren Diepraam says the injuries that were found during the autopsy of Sandra Bland would be consistent with a suicide."},{"comment_id":"828087617226661","commenter_b":"Do you think if someone wrung her neck her face would pop off???","commenter_a":"I can't see her face without wanting to punch her in it.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"1172821626098535","commenter_b":"She needed to be shut down 20 years ago!!!!","commenter_a":"What kind of a statement would you expect from somebody as stupid as she is. Her brain is lacking in intelligence","post_message":"Whoopi Goldberg got shut down."},{"comment_id":"10154291680908701","commenter_b":"You're right. You're a white pig. ^^","commenter_a":"Your choices are, Trump, Hitlary, and everyone gets everything for free Sanders. We're screwed. No Trump isn't a racist.","post_message":"Donald J. Trump wins the Republican presidential primary in Washington, the Associated Press reports. MORE: @webpagelink"}]
