[{"comment_id":"887276944740413","commenter_b":"@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"10153668595164099","commenter_b":"This woman again? The Nurse who doesn't care if she infects everyone else? Go away! Your 15 minutes are over.","commenter_a":"Why are there so many greedy people in health care.","post_message":" never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie private prison, Kaci Hickox, 34, said. -----> @webpagelink"},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"10152816075404753","commenter_b":"Wtf?? They should def prosecute dem bitches fym.. they gone go and do that same shit over over again smh","commenter_a":"When we know better we do better.so much apparently went wrong way before the baby was born. Let's solve all the issues leading up to the drop off.lack of birth control lack of medical attention for both mother and child.lack of protection from sexuality transmitted diseases.we all failed here.so let's beat up the mother who had the cottage to face up to the fact that she lacked the ability to raise this child.we can do better than this","post_message":"Colorado has a Safe Haven for Newborns Law, which means a parent can drop off a baby at a hospital or fire station within 72 hours after birth without being prosecuted."},{"comment_id":"10154177899058812","commenter_b":"shut up and go away","commenter_a":"and now back to the real news","post_message":"JUST IN: President Obama orders flags flown at half-staff in honor of Nancy Reagan. abcn.ws/1M2M51P"},{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"1376440642415680","commenter_b":"Women today have lost their values and morals.","commenter_a":"Ugly","post_message":"Dare to bare!"}]
