[{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10154164626642293","commenter_b":"This is so very tragic and sad. Based on the videos that have been released, this officer appears to have fired for no reason. Police need to be held accountable, just like everyone else, when they break the law.","commenter_a":"And we need female policepersons exactly why?","post_message":"Officer Betty Shelby has been charged with manslaughter for the shooting of Terence Crutcher."},{"comment_id":"10153416181512217","commenter_b":"if I had to go, this is how I'd do it","commenter_a":"@username this is like your entire sense of humour in one headline","post_message":"Father Stephen Crossan has taken extended leave from the priesthood."},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"652310991589660","commenter_b":"LMFAO. Stupid dumb Bitch.","commenter_a":"@username i can see u doing this. so smart of him","post_message":"When the mother who was in line behind him refused to do anything about her loud, obnoxious child, this man decided to take matters into his own hands."},{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."}]
