[{"comment_id":"1234377609916581","commenter_b":"Euuuuuw you wouldn't bitch!!!!!!","commenter_a":"Shieeet om det här hade hänt... :S xD @username","post_message":"Just going to grab a nice handful of san - WHAT IS HAPPENING."},{"comment_id":"10153866356179087","commenter_b":"@username elillegal means\" elite illegal immigrants living in comfort due to free dows from Obama government, at the expense of us tax payers!","commenter_a":"LOL...Trump is a con artist...serial adulter...pathological liar...crooked businessman who preys on the less fortunate . He uses our vets as campaign props and lies about giving them donations. He funds his own businesses with his political campaign. He refuses to make his tax returns public. Be serious. Trump is the most corrupt individual to be running for office.","post_message":"Donald J. Trump gets standing ovation after saying Hillary Clinton \"may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"10154096917590329","commenter_b":"Grade 6 gym class. Ran face first into a cement wall during a game of dodgeball. I had two black eyes, one of which was swollen shut, and a nasty bump on my forehead. Our picture day was the following week. Best school picture ever!","commenter_a":"Jon Maloney you could add a story to this","post_message":"LOL"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"10153675906043132","commenter_b":"Ben's is too good for her He's lucky she sent him home He had too much class for her","commenter_a":"Shawn wins - there.","post_message":"Last night's The Bachelorette: Let's discuss."},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"}]
