[{"comment_id":"10154736947540575","commenter_b":"Ignorant bitch. You voted hate. You liberal clowns","commenter_a":"Were was Meryl Stereo about the man that was attached and tortured. Oh yes, he was White.","post_message":"BOOM! Kellyanne Conway Schools Elitist Meryl Streep... ---VIDEO"},{"comment_id":"10153548896611323","commenter_b":"Ban all religion, ban all religious dress so all pupils wear the same uniform, then paint all children green ......... There you go, sorted.","commenter_a":"When a system (Teachers & Parents) is not focused on a child's future but instead going through the motions and meeting the targets with least amount of positive role models (especially in single parent families) you are not building future generations that think rationally where the brain itself arrives at a conclusion at a very young age that race is just a social construct, you are instead building a worker drone filled with prejudices and presumptions on top of entitlements that things are owed instead of earned.","post_message":"\"Education should provide an inclusive curriculum that teaches the students respect for other cultures. If schools provided such an education, the climate that allows racist language and behaviour would cease to exist. Promoting such an education should be a priority for government, however in Britain we have a school system that has little interest in education.\""},{"comment_id":"626503050873607","commenter_b":"Man she's one ugly silver back","commenter_a":"I am sick of all the threats and lies on FB have you no shame? This President only has a year to go what do you gain with the BS about him and his family. Crawl back in your hole!","post_message":"Michelle Obama was just hit with a multi-million dollar law suit for this reason.  Totally justified. She deserves prison.  Do you agree Michelle Obama is a criminal?"},{"comment_id":"1109196055770108","commenter_b":"@username You have no morality. Also gays shouldnt be allowed anywhere near kids.. its pure child abuse. If they were meant to be parents, then gays would be able to reproduce.","commenter_a":"I thought MLB was about playing baseball, not trying to promote an immoral, sacrilegious way of life!","post_message":"MLB is DYING to get a gay baseball player."},{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"493375190853061","commenter_b":"Ban muslims from holding a job AND ban them from welfare benefits! Starve them out of our country!!!","commenter_a":"Now I know why CVS has become so powerful in the insurance business. Owned by Muslims, friends of Obama. So many large companies are now making their employees use only CVS to get their medications. CVS charges more for all their medications. So wrong.","post_message":"His Muslim boss tried to harass him for being Christian, be he wouldn't back down.  Amazing. Let's show him we have his back.  Do you support his stand against his Muslim supervisor?"},{"comment_id":"10153292055736367","commenter_b":"This is the problem with the Left: too dogmatic, judgmental and lacking in imagination. There is more than one way to think about this and more than one way to vote one's conscience... @webpagelink","commenter_a":"I'm voting for Stein if Sanders loses the nomination. Here's why... @webpagelink","post_message":"\"It is time to stop playing the game.\""}]
