[{"comment_id":"1175870485808384","commenter_b":"YES\"","commenter_a":"Obama does not want us to abide with that law. What the hell are you talking about. Where do you get your information at.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"\"When I tell people I'm a model, they look at me like I've said I've murdered someone.\""},{"comment_id":"10153579944776438","commenter_b":"If he hates it that much, he can step down and we can keep his paycheck.","commenter_a":"lol @ headline","post_message":"\"He hates it.\""},{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"902172716496023","commenter_b":"I stand corrected. It is Planned parenthood that started with the concept to murder black babies before they were born.","commenter_a":"Aren't the Democrats responsible for the initial abortion idea and practice? Also, the plan was to abort unborn black babies. Who's the racist? Hint...DEMOCRATS!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."}]
