[{"comment_id":"1179430858762542","commenter_b":"@username what an a**","commenter_a":"Not even the president yet, and already proving himself to be the leader we so desperately need!","post_message":"As soon as Donald J. Trump heard the news that 1.5 million people are being asked to leave their homes, he knew exactly what to do..."},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"10154249832173128","commenter_b":"U.S. has a mind-boggling number of minimal wage jobs that do not involve any tipping at all. When was the last time you tipped a cashier at Walmart? Why waiters or taxi drivers are any different? Sure, if they can't cover their basic costs, just raise the rates.","commenter_a":"Oh, wow! This is new. When Uber came out, there was an automatic tip in your setting that you could set for yourself.","post_message":"\"I’m working at rock bottom now, and not having tips is part of the problem.\""},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."}]
