[{"comment_id":"683462628486873","commenter_b":"Thank you for sharing!!","commenter_a":"Every time I attend a sporting event in our great country it infuriates and saddens me at how many \"Americans\" won't remove their hat or stop what they are doing while the National Anthem is played. Well done Mr. Bolt! Thank You for your great respect!","post_message":"A great American..."},{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT \"EACH AND EVERY MUSLIM\" THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON\"T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"1027522093954929","commenter_b":"And she REALLY makes Alaska look like it's full of idiots. How else did she get elected Governor in the first place?","commenter_a":"And to think that was John McCain's pick for VP. Embarrassing.","post_message":"This one is a CLASSIC."},{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."},{"comment_id":"758408480932531","commenter_b":"A BRAVE WOMAN!","commenter_a":"Brave lady. Stay safe!","post_message":"Thanaa Jawabreh prompts a heated debate following a public apology for the ‘horrendous’ shooting attack that killed aIsraeli couple."},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"}]
