[{"comment_id":"404934952964433","commenter_b":"We will be screwed with either of these two jackasses!","commenter_a":"I hope I never hear of either ever again","post_message":"Will Jeb Bush face Hillary Clinton in next year's race for president?"},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"},{"comment_id":"604189559765558","commenter_b":"Hang the fat pig","commenter_a":"Does anybody really think the Demarcate run US justice system is going to Prosecute, NO","post_message":"One can only hope that this ultra left wing hate monger will meet up with some justice soon."},{"comment_id":"1380514481968578","commenter_b":"You're way too late. It's all Hillary now #imwithher","commenter_a":"If you live in a state that has yet to hold a primary, join with Sanders and stop both Hillary and Trump. #nevertrump #neverhillary","post_message":"Ohio Gov. John Kasich will suspend his presidential campaign on Wednesday, a senior campaign adviser tells NBC News."},{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"10153242127461680","commenter_b":"Divided Nation? You people talk about a divided Nation? Kids are being harrassed at school for \"appearing\" to be Muslim, some are Indians. Muslim's are of every nationality and not just middle eastern. Donald Trump has created HATE amongst people of a brown tone. That's more than 3/4 of the Nation. You people are scum that support Trump. American Mexican's are being mis-treated too. I guarantee you that Donald Trump will turn this country 3rd world with his talk of our \"wages are too high\" and \"we must COMPETE with wages of Mexico, Japan and China\". YES, he is a 'business man\" and that's why HE sent his own manufacturing jobs out of the U.S. Think, people, think.","commenter_a":"I find it hilarious when Obama is blamed by Republicans for everything under the sun, but now he's being blamed for helping create Donald Trump. That's a stretch, even by Jeb Bush standards. This country has had a bitter partisan divide ever since Republicans decided they weren't going to allow a Democrat to be successful way back in 1992.","post_message":"Not only is Donald Trump a “jerk” in the eyes of Republican presidential candidate Jeb Bush, but he’s also “a creature of Barack Obama.”"}]
