[{"comment_id":"543574859135802","commenter_b":"Those dang Muslims and their transgender bathrooms...","commenter_a":"No fucking way my child would ever be placed in a school where boys could come into a bathroom with her..fuck is wrong with people?i am SOOOO glad To live in Kentucky these days..in all honesty I've always hated it here but at least my state doesn't go for all this liberal,homo,Muslim bullshit..","post_message":"What can only be described as an absolute shitstorm."},{"comment_id":"10153266860506167","commenter_b":"No, there is something very seriously wrong with the people who think he could run the country and vote for him","commenter_a":"There is something seriously wrong with Carson.","post_message":"A CNN host shuts down Ben Carson's complaints about the media: \"Journalists ask questions. That's the process. And if you don't like journalism, we should talk about that with presidential candidates.\""},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"1135270439841709","commenter_b":"George is just another Clinton Whore!!!!","commenter_a":"clinton news network at it again","post_message":"Donald Trump destroys the liberal media! (WATCH)"},{"comment_id":"909196299140119","commenter_b":"She aint no fun!","commenter_a":"Jack King","post_message":"Virgin wife who won't have sex is trying to set husband up with live-in lover"},{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"845590435487585","commenter_b":"There are many ways to keep from getting pregnant and they can be gotten for FREE!!! There is no excuse for getting pregnant!!! Abortion is a crime!!","commenter_a":"Give the moms the hope that they will be helped with expenses after their baby is born...don't vote down programs to help the poor.","post_message":"Tell Congress it's time for them to protect LIFE!  CLICK HERE to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"}]
