[{"comment_id":"10152967718236545","commenter_b":"White male driving.","commenter_a":"He's going 5 miles an hour. 1 car go in front and the rest block him in. This isn't rocket science. I don't think this is that news worthy. Just let us know what happens when it's over. #annoyed","post_message":"UPDATE: From Fort Worth police: Citizens, for your safety, please do not stop to take pictures, stay in your vehicle.  You may want to avoid east bound I-30 in Fort Worth for a while. Traffic is backed up for miles as police are still in a low speed pursuit of a vehicle.   WATCH LIVE: @webpagelink"},{"comment_id":"10153348075419255","commenter_b":"who would want texass anyway","commenter_a":"I laugh every time I see these two big wusses trying to play badass.","post_message":"Idiots."},{"comment_id":"10154478047941051","commenter_b":"Well one girl just said that is white privilege so thats why you got to play with guns.","commenter_a":"I never liked Sarah Palin but don't see her grandson playing with a toy gun as an issue(key word being TOY here). I recall having a few toy guns as a kid myself and certainly didn't grow up to be a serial killer or anything of the sort.","post_message":"Bristol Palin is coming under fire after what her 8-year-old son is doing in this viral picture"},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"},{"comment_id":"10152977675812690","commenter_b":"Cool...but can't we all agree that there are quite a few ILLEGAL immigrants that do NOT speak English?? I'm not talking about immigrants I'm talking about the ones who are here ILLEGALY!!","commenter_a":"But it is also illegal! Just do it right! Learn the language, support yourself and do it LEGALLY!!! Legally!! That is all!","post_message":"WATCH LIVE: Dual rallies have taken over downtown Dallas Friday evening, forcing several businesses to close early: @webpagelink Photos of the protests: @webpagelink"},{"comment_id":"10154178824428987","commenter_b":"I had guillian.barre in 1976 do i have a greater risk of contracting the disease?","commenter_a":"Nice smile","post_message":"Talk to us. Zika questions?"},{"comment_id":"10156602448280725","commenter_b":"Yes I just got a form in the mail to change so I could vote for Donald Trump Thank you","commenter_a":"To all Trump voters! If you not registered as a Republican, your vote WON count in your State primary election. Your vote will Not be counted if you are not registered as a Republican. You must register as a Republican ASAP. Find out your state rules and register now. Better yet, don wait, Register Now! Make your vote count for Donald Trump 2016!!! Please share this with Donald Trump voters.","post_message":"Many people voted for Cruz over Carson because of this Cruz fraud. Also, Cruz sent out a VOTER VIOLATION certificate to thousands of voters."}]
