[{"comment_id":"10152817308146491","commenter_b":"She's a fatass skank","commenter_a":"We don't have a first lady. She is a low class idiot.","post_message":"“If Barack was a helium balloon, Michelle was the one holding the string.”"},{"comment_id":"10154160437056943","commenter_b":"Of course she did !","commenter_a":"Yes","post_message":"Share if you agree!"},{"comment_id":"10152584446122014","commenter_b":"No money for illegals!","commenter_a":"He's not an immigrant. He's a POS rock-throwing illegal alien coyote that's had 14 prior incidents with the border patrol.","post_message":"The judge ruled that the officer was not justified in opening fire on the immigrant who was crossing illegally into Arizona."},{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"1140315249363924","commenter_b":"Blow these animals off the face of the earth","commenter_a":"If these imagrants can live or vote . Send them all over in middle east to fight for our country , including mexicans. Then see what happens . All of them will leave . Build that wall Donald","post_message":"Muslim Migrants Already Lazy Bums, Veg Out And Drink Liquor All Day on Taxpayers Dime!!!   This is what Obama and Hillary want for America!"},{"comment_id":"1744722422438798","commenter_b":"Fkn pussy","commenter_a":"BS!!!","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker  Our society is getting out of control.  Do you think this is ridiculous?"},{"comment_id":"10152740585827426","commenter_b":"You are happy a man is now dead? Does that make you better than him? If you claim that he was a bad man, how do u know the people he wanted dead weren't bad men too? I'm glad you find satisfaction in a human beings death like some sort of animal","commenter_a":"Heck yeah!","post_message":"An internal investigation into Shannon Crane’s death is underway."}]
