[{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"}]
