[{"comment_id":"652378504952728","commenter_b":"If I were near and could get it down, I'd burn it!","commenter_a":"take it down and rub bacaon on it and wipe your ass then brun the fucking thig","post_message":"A family in Texas has drawn controversy over this flag...  The ISIS flag should never been hung in America and should be considered a traitorous act.  'LIKE' if this is WRONG!"},{"comment_id":"1647670705273781","commenter_b":"This dude is in trouble. He better start working for the people who elected him, or his ass is grass","commenter_a":"Government that works? Republicans are out to prove to us that government is bad by giving us spectacularly bad government.","post_message":"Jason Chaffetz's contentious town hall in deep-red Utah proves Americans care more about a government that works than partisan politics."},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be \"bad mom's\". It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"\"No one had communicated that children under six were not allowed in R-rated movies,\" one of the moms said. \"We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.\""},{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"},{"comment_id":"10154427648451955","commenter_b":"And she is a total lying bitch.","commenter_a":"He's an ASS !!!!","post_message":"Donald Trump, on releasing his tax returns (Source: NYT)"}]
