[{"comment_id":"10153304563395927","commenter_b":"Democrats own guns,.. You Brainwashed idiots...Gullible fools","commenter_a":"Because their agenda is to control the people without being contested against. Don't you read your Bible? How can a government control its people without being toppled - remove the guns.","post_message":"Criminals don't follow the law.  Why is that so hard for the Left to understand?"},{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're \"yucky\"? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"992065330813220","commenter_b":"Nooo! Stay away from Tacoma. We don't need Seattlites messing up the city.","commenter_a":"Stay out of T-town jerks...you'll ruin it just like you ruined Seattle...","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"1844278629192581","commenter_b":"Yep, only the melon and spice tips make sense.","commenter_a":"It's all a bounch of whooie! Put Kerry in the frig and forget about it!","post_message":"Check your fridge ASAP."},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."}]
