[{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from \"Jaws,\" she's either very very smart or very very dumb."},{"comment_id":"10152843284606519","commenter_b":"How about you pay for your own? Why do I and the rest of the taxpayers have to pay for you losers? Stop being a fucking whore or just swallow next. time. Cum guzzling gutter slut sounds about right.","commenter_a":"400 million dollars plus the tax payers have paid to keep Planned Parenthood in operation. I understand it is cheaper to kill the child then pay for it in the form of welfare, Medicaid, HUD and food stamps. 56 million have been dismembered in the womb thus far. My question is where did the idea of the taxpayers paying for people's mistakes come from? Why should I be obligated to pay for other's mistakes? I am not and neither are any taxpayers. You fucked, you knew the results of fucking without birth control....fuck you and your offspring.","post_message":"\"I believe that abortion care is a positive social good. I suspect that a lot of other people secretly believe the same thing. And I think it’s time we said so.\""},{"comment_id":"421520308036263","commenter_b":"What is this group that has an American flag on the ground to be trampled ?","commenter_a":"stupid ASS COPS.","post_message":"\"I went to pick it up because it doesn’t deserve to be on the ground.”"},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"10153665284600163","commenter_b":"and what's wrong with PUSSY? I never had any complaints about it","commenter_a":"What a Bunch of Wussies .. What happened to free speech and \"Sticks and Stones may break my Bones .. But Words will never Hurt Me \" ?????? Damn we are becoming such a Pussy Country.","post_message":"Sad to say, this comes as no surprise... @webpagelink"},{"comment_id":"1782160282048254","commenter_b":"She needs to her big ass and I'll out of the country.oh I'm probably on the hit list now.","commenter_a":"guess time will tell....when he wins it will be interesting to see how some of these people deal with all they've said and done. i wonder if hillary is getting packed to leave the country on the 9th. i heard she's transferred big bucks out of the foundation to another country just in case!!!!! her plans for the white house will be plans for the big house when she looses!","post_message":"Karl Rove says there is no way Trump can win the election because of 'the campaign he's running'. Do you think he is right?"},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."}]
