[{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink   THIS is why they swim in circles in their tanks.   The chart at 0:20 seconds explains it ALL."},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"10153871025190579","commenter_b":"How many more innocent people must die before we outlaw gun free zones?","commenter_a":"😩😫😨😱Smh... ..... How many more innocent people have to die before we regulate gun control? If we can save (((1)))) innocent person then that's 1 less family that have to suffer in pain because they loss their love one to violence. 😒😞😢 Numbers don't lie. It's time for gun regulations NOW!!!! 😒😞 I understand that there's no way you can get criminals to obey the laws, that's why they are \"criminals \" because they break the laws but we need to make it a little more difficult for them to get their hands on a gun like they did in Australia in 1996 after a mass shooting there .... Law abiding citizens still should have their rights to own a gun for protection hunting and recreation. @webpagelink","post_message":" politics has to change. President Obama answers two questions on guns at a press conference.  Watch the full video here: @webpagelink"},{"comment_id":"1075861685791148","commenter_b":"#Bernieorbust #NeverHillary #HandcuffHillary","commenter_a":"Remember any Bernie supporter who does not support the Democratic nominee is doing a disservice to their candidate.........Maybe they tune out the part of every rally of Bernie's that \"slams\" Donald Trump..........","post_message":""},{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"450316191825628","commenter_b":"Fuck that dumb bitch!!!!!!!!","commenter_a":"bye bye Michelle, go peddle crazy some place else. Go ask the thugs in Chicago for their guns first. Try going there without a cop. LOL","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."}]
