[{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"10153939365405329","commenter_b":"Las lamparas y el cosito para escurrir los cubiertos <3","commenter_a":"Invente o si te gustan los elefantes @username","post_message":"Because elephants are beautiful and lovely and perfect. (via BuzzFeed Animals)"},{"comment_id":"10153448398281350","commenter_b":"She lied to get jobs","commenter_a":"Why is ok for Bruce Jenner to claim to be a woman and not ok for Rachel to be black if that is what she wants ?","post_message":"\"I did feel at some point I would need to address the complexity about my identity.\""},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"\"Messing with our veines/immune system, why?\"","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"},{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"\"That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."}]
