[{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""},{"comment_id":"10153242618583132","commenter_b":"First Dr. Nancy Snyderman and now Brian Williams betrayed us!","commenter_a":"Yea a permanent one lol","post_message":"Brian Williams tells staffers that he is taking a break from NBC Nightly News amid his recent scandal."},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million \"Rachel Dolezals\" = 1 million \"less racist\" white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: \"As you probably know by now, there are questions and assumptions swirling in national and global news...\""},{"comment_id":"1239279662765353","commenter_b":"Judi you are correct about Obama, good for you.","commenter_a":"These little things they bring out about Ben Carson are all they can find. It's all they've got! They've got nothin'!","post_message":"#BenCarson should ask the media:  Where are Obama's grades and transcripts? And who checked out the lies in his autobiography?"},{"comment_id":"10153460799391130","commenter_b":"When bitch steals ur face 😠","commenter_a":"Alyse Kozis @username - she makes one of your faces Karlie 😂😂","post_message":"Instagram's @Daddyissues_ hilariously meme-ifies herself."}]
