[{"comment_id":"1386022938105786","commenter_b":"Build a wall all around California lol","commenter_a":"Seriously they had to conduct a study?! I think most of us true natives already knew that without conducting the study and it's been like that for years. We have way too many people coming here from other states and something must be done to control the population here; it's really just a joke now.","post_message":"It's official: California is the worst state for drivers. 🚗"},{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring \"unhealthily underweight\" model is deemed \"irresponsible\""},{"comment_id":"10156761765540354","commenter_b":"Beyonce should eat a bullet.","commenter_a":"just go away already","post_message":""},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for \"wanting to take her guns away\":  \"A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":""},{"comment_id":"10154435373078279","commenter_b":"@username shut the fuck bitch","commenter_a":"Unbelievable. Marissa Alexander gets 20 years behind bars for firing a warning shot at her abuser where no one even got hurt, and the same prosecutor can't get a child-murdering lowlife scumbag like George Zimmerman put away.","post_message":"Angela Corey had been dubbed the \"worst\" and \"cruelest\" prosecutor in the United States."}]
