[{"comment_id":"10152526898447623","commenter_b":"No. The statue was in HONOR of our fallen heroes. You are a disgrace.","commenter_a":"King should be ashamed. ..","post_message":"The kneeling soldier statue will be removed from the King Veteran’s Memorial after Tuesday night's city council meeting."},{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"},{"comment_id":"10153128310892452","commenter_b":"Go get it. Keep pushing 👍🙏🙏","commenter_a":"People that don't know,.... one word,......Research!!!!! Google it up!","post_message":"Selena Gomez has revealed that she's receiving chemotherapy after being diagnosed with lupus. abc7.la/1P0VU5F"},{"comment_id":"10153174163477452","commenter_b":"he better not get fired. @username","commenter_a":"GET SOME!!!!","post_message":"Big Mac attack!   A McDonald's worker wasn't \"Lovin' it\" when an irate and apparently drunken customer launched into a vicious attack at the drive-thru window. But the worker wasn't going down without a fight. abc7.la/1KYEgIq  It's just the latest case of a service worker attacked on the job."},{"comment_id":"1859284991009604","commenter_b":"Niggaz and whites","commenter_a":"I tell you man niggas now a days are dumb ass fuck they don't think","post_message":"Mannequin Challenge got them busted! #WSHH #Alabama #MannequinChallenge"},{"comment_id":"345060612364120","commenter_b":"Can we trust her? What an absurd question! Of course not!!","commenter_a":"She still has no moral compass.","post_message":"Hillary Clinton's Record Begs the Question - Can We Trust Her?"}]
