[{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10154944476018984","commenter_b":"@username but the First Lady Elect wants the Indians to go back to India so how will they be able to go to the White House?","commenter_a":"I do think before the Trumps move in the whole place should having laying of hands and prayers from our faithful people to cleanse the evil that has lived there for so long.","post_message":"As soon as the White House opened its doors to display the Christmas decorations, many Americans were surprised by one item in the background. This is getting a lot of attention, and you'll instantly see why..."},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":" dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."},{"comment_id":"1143755872353195","commenter_b":"If you don't like rules there move back to Kuwait!","commenter_a":"OLD POST, YOU GUYS.","post_message":"Muslim Welfare Diva Refuses To Take Off Headscarf Gets BRUTAL Message From Judge (VIDEO)  BOOM! This judge smacks her silly! Can we get 1K Likes for this awesome JUDGE!"},{"comment_id":"554226841431375","commenter_b":"Hillary is the dispicable one calling Millions of Americans all kinds of names that do not want her for President . So save all your outrage for Hillary , oh that's right . You hypocrites don't have a problem with Hillary doing it and yourselves as well . Shame on you Debbie and all like you .","commenter_a":"The nasty, inconsiderate, unemphatic comments are disgusting & shame, shame on everyone making them. Hillary has run herself ragged & not surprised she's got pneumonia. Coughing a lot lately. She's exhausted. No wonder. Be careful what you say because it'll come back to you tenfold. #KARMA","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10153086379157217","commenter_b":"Paul is absolutely correct. Those are not just mare refugees those are economic migrants that seek to invade Europe and it's borders in order to establish themselves on our continent! They are not here because they need help, they are not here because they are running from War, those are people that abandoned their country , their women and children in order to Exploit Our achievements. To Abuse our LAWS in order to gain access to benefits we have worked for decades! They do not seek help nor assistance nor do they want to return to their country after the War ends. They want to Infiltrate our culture , our lands and when they gain critical mass we will not be able not only to stop them but to even contain them and make them obey the Laws in the countries they live in. This is a deliberate immigration of ...","commenter_a":"Good work to the Hungarians! The only people that protect their country and actually keep refugees in refugee camps as they should ! Good work Hungarian brothers keep strong !","post_message":"Footage has emerged of migrants being thrown bags of food at a Hungarian camp near the border with Serbia"},{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."}]
