[{"comment_id":"1007821319338322","commenter_b":"She's a piece of work.","commenter_a":"She is nothing but a conceded witch, only standing by her unfaithful husband because he was the POTUS, and therefore a untrustworthy, spiteful person who only cares about herself. I see a demon in her when she laughs!!!","post_message":"The book claims she repeatedly screamed obscenities at her husband, Secret Service personnel and White House staffers — all of whom lived in terror of her next tirade."},{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"10154553793429712","commenter_b":"They work harder, are ambitious, and always have the American Dream end goal in mind to own a business. If there are all these loop holes and advantages that a non-native English speaking LEGAL immigrant can utilize, how the hell can a English speaking American familiar with the system not be able to take advantage? The answer is some do and the others complain. Want a hint? Take a job in a profession like trade work, food, cleaning, retail, etc work there for years to establish yourself financially and become experienced. Take a calculated risk in opening up your business with all your set up in mind, keep working your butt off and you've done it. People say ohhh ILLEGAL not legal immigrants, as if a lot of Trump don't already see anyone darker than Macklemore as an illegal immigrant, terrorist, or possible threat.","commenter_a":"Lazy entitled Trump voters think it's unfair how immigrants do better than them by working smarter and harder and willing to be entrepreneurs.","post_message":"In Baltimore, foreign-born residents make up 9 percent of the city's population but own nearly 21 percent of the city's businesses, according to a 2012 report from the Fiscal Policy Institute."},{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."},{"comment_id":"10154153338147908","commenter_b":"@username norway. now stfu","commenter_a":"Commie Bernie vs. Socialist Hillary= end of Freedom.","post_message":""},{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"}]
