[{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"10153802961004411","commenter_b":"@username And your women","commenter_a":"Mean while Modi is busy in saving cows.","post_message":"BREAKING:"},{"comment_id":"653404108149099","commenter_b":"@username the wet behind your ears is showing. Now go wipe the turd stains off your teeth.....turd sucker","commenter_a":"My new hero!!!!!Trump is good on embracing bullying and hate!!! Those are the results!!! Trump should go to a nursing home already!!!!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"1740879046184782","commenter_b":"lock this crooked Bitch up.","commenter_a":"They are untouchable. We all know that by now. Waste of time reporting anything they do. Dems see them as heroes and the saviors of all...","post_message":"It's about time."},{"comment_id":"522223391280988","commenter_b":"@username you do not get it David. Bernie Sanders and Donald Trump are so popular because people are sick and tired of what is currently available. He is not unelectable and Hillary Clinton is going to lose the Donald Trump if she wins and that is not good for anybody in this country. She's going to kill this country","commenter_a":"Why are you so biased towards Hillary? You are supposed to represent ALL democrats!","post_message":"Hillary Clinton was just announced the winner of today's Democratic caucus in Nevada. Congratulations to her and her supporters!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"853953454653203","commenter_b":"Wow::hey woman-let go of her hair and fight,","commenter_a":"Can we please get the blurred trip screen out so we can actually see something?","post_message":"WILD AND VIOLENT BRAWL: An all-female fight goes down outside a gas station and the spectacle was captured on video. Kicking, punching, hair pulling. We can't make this stuff up."}]
