[{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10153764783192235","commenter_b":"Right on!!! Most religious women are thought of as breeders. According to religion they were put on this Earth to procreate and nothing else.","commenter_a":"They're not moms, they're breeders. If they were moms, they'd be in favor of children having loving homes instead of languishing in foster care. If they were moms, they'd have been doing what these guys are doing.","post_message":"This little girl is awesome."},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10153011055951336","commenter_b":"He is against us having freedom from OPEC !! We could be self contained and let the Muslims go to being dependent on us !! If no one byes oil from them they are through! OB knows this, that's why he vetoed pipeline 👿","commenter_a":"Job killer.","post_message":"Breaking News: President Barack Obama has vetoed the Keystone XL pipeline bill."},{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."},{"comment_id":"10154029813093812","commenter_b":"While we are at it, let's ban people like you for having guns.","commenter_a":"Ban all Muslims from owning guns","post_message":"JUST IN: Man accused of shooting Philadelphia officer pledged his allegiance to ISIS and used stolen firearm, police say."},{"comment_id":"10154439047219342","commenter_b":"I will reject him too He doesn't fit the norm","commenter_a":"@username isnt he the cutest thing ever??? 😍 Hes a model now! I love it!","post_message":"Remember little Asher Nash?   He's the 15-month-old with Down Syndrome who was rejected by a talent agency.  After thousands of people rallied behind him, here is his new ad campaign and it will melt your heart!"}]
