[{"comment_id":"10154267977076756","commenter_b":"Really?....Belgium. Some of the nicest people in Europe. There is no reason in these people. They just hate everybody. Sympathy to the Belgian people. I have visited your country and was impressed with your quality.","commenter_a":"So terrible...","post_message":"NPR is following the deadly attacks in Brussels. -- At least 30 people died in explosions at the airport and a metro station.  -- Some 200 were injured, including at least one U.S. service member and his family. -- ISIS has claimed responsibility for the attacks, and police released a photo of a suspect."},{"comment_id":"10153236659491051","commenter_b":"Wait a minute. These girls made threats against someone's life and are suspended from the cheerleading squad for three games? What's wrong with this picture? Are you kidding me?","commenter_a":"OMG criminal charges and other parents need to be involved in their daughters' cruelty towards another student.","post_message":"This mom was horrified when police contacted her and told her what was happening with her daughter."},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"}]
