[{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""},{"comment_id":"10155343627345389","commenter_b":"She is to old to run for President. She is a liar and a cheaters.The women is another socialist like Obama. She need to go away for good.I'am sick of the Clinton and Bushes.","commenter_a":"She is a felon","post_message":"JUST IN: House panel subpoenas former Secretary of State Hillary Clinton's personal emails in Benghazi probe.  Question of the Day: Will the growing list of scandals hurt Clinton if she runs for president?"},{"comment_id":"1623707571270874","commenter_b":"I hope she does and goes to prison and becomes somebody's bitch there ..","commenter_a":"They act like no one has do wrong when it came to Republican establishment, get real. I look at it very differently every dog has there day, sooner or later!!!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"1387099161383134","commenter_b":"No, your mother giving birth to a bitch was","commenter_a":"Oboma is a scared ass chicken shit bitch","post_message":"CHECKMATE."},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10153596385394740","commenter_b":"She lied on the form. If she is able to pass a background check she is going to pass a background check. It's not going to stop her from buying it for someone who can't legally buy it. Criminals will get guns no matter what laws are passed.","commenter_a":"This can't be! Everyone knows that background checks stop gun crime!","post_message":"Prosecutors say her boyfriend, a convicted felon, gave her money and told her what to buy."}]
