[{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10153618033509575","commenter_b":"Seriously? Have some compassion lady","commenter_a":"Dude! Buy an eye patch! Nobody wants to look at an empty socket.","post_message":"An Indianapolis veteran diagnosed with ocular melanoma has filed a tort claim against the VA.  By not ordering an MRI, he says they failed to diagnose a cancerous tumor that not only cost him his eyesight but will take his life."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153218789208132","commenter_b":"What about women who cheat?","commenter_a":"If my husband cheated on me I'd do a lot more then throw a shoe at his face. This man should consider him lucky. Its SAS that people stick up for men when they cheat. And people wonder why women get upset in relationships.","post_message":"\"Wouldn't you be this upset if you came home to this?\" she said when asked if she had thrown the shoe."},{"comment_id":"10157436737495389","commenter_b":"If you are Gay, why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"You don't understand. Obama and cronies want Islam here, and Islam is intrinsically radical. It advances their agenda of Societal destruction, \"social engineering\".","post_message":"\"I think if we don't speak honestly and clearly about what's happening, [then] we can't solve the issue.\"  Karen McWatters, who lost her leg in the Boston Marathon bombing, said the President and other leaders can't solve the problem of radical Islam until they're willing to call it what it is."},{"comment_id":"1000660886660326","commenter_b":"Send her to Pluto to cool off!","commenter_a":"I bet her mother is sooooo proud...","post_message":"'I'm not really ashamed'"}]
