[{"comment_id":"1325820547439790","commenter_b":"I would've knocked this old bitch out, no joke @username","commenter_a":"\"If you don't know the language learn it \"she says.........ok .....maybe this old woman should re-learn her own language but properly because......you're a nobodies......isn't quite right and \"just because you come from another country it don't make you nobody\"....what does that even mean? Double negatives in sentences and conjugation the verb \"does\" wrong,,,,,smart woman yup","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"1114761541897178","commenter_b":"Do me a favor. Never EVER put this ugly bitch's face on my timeline again","commenter_a":"moron","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"},{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"},{"comment_id":"10153483892683690","commenter_b":"Hello all indians! U stop nestle then stop modi too for supporting israel. Huh!","commenter_a":"Pay the bribe...","post_message":"The company insists \"Maggi noodles are completely safe and have been trusted in India for over 30 years\"  @webpagelink"},{"comment_id":"10153732358683984","commenter_b":"And let Sherriff Joe and border patrol do their jobs. The murder rate in Arizona is out of control and it's all illegals criminals","commenter_a":"Amen! TOTAL SUPPORT for Trump!! :-)","post_message":"The Donald just made a BOLD promise to a certain group of people if he becomes president - and boy oh boy, he is NOT messing around.  Do you support Donald Trump's tough position on this?"},{"comment_id":"10154939556251320","commenter_b":"WE DON'T NEED, YET, ANOTHER ROSIE O'DONELL barking her bossy pants ignorance our way!!","commenter_a":"All the comments below ring as TRUTH, but tolerance and inclusion goes a LONG LONG way. Whether OR not you agree with ANYONE's lifestyle choices!","post_message":"Susan Olsen, who played Cindy Brady on  Brady Bunch has been fired from her job as a Los Angeles-based radio DJ after she posted a homophobic rant on Facebook."}]
