[{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."},{"comment_id":"10153987272260667","commenter_b":"Readup Trump's plans for America @webpagelink","commenter_a":"I'm over this, I am over ALL of this nonsense!!! This entire Campaign is an embarrassment to the world!! #AbrahamLincoln2016","post_message":"Here’s how it all started."},{"comment_id":"10153160211535950","commenter_b":"No shame on you for not thinking outside the box, you are a ver naive women","commenter_a":"Why do people think that only adults can die of natural causes?? accusing them of covering something up is truly sick. Shame on you.","post_message":"YouTube star Caleb Logan of the Bratayley family died suddenly at age 13, his mother confirmed: \"This has come as a shock to all of us.\""},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"10154260423564212","commenter_b":"Amen","commenter_a":"I am begining to think that the Democrats are the most dangerous threat to America.","post_message":"Two-thirds of Democratic voters won't say Islam encourages violence more than other religions"},{"comment_id":"10153420202186323","commenter_b":"Why do people feel the need to insult disabled people anyway what ever word is used?","commenter_a":"You know what? Decent people will not say 'Retarded' around the mentally challenged, because those are the actual victims who have a right to be offended. I won't say retarded around retarded people. Around non-retarded people, different story. If your feelings are hurt by me stringing a couple letters together to form a word that has had not impact on your life, tii bad.","post_message":"\"It’s not about policing language, but having “a call to action” that will make people think twice about using a term that can hurt and exclude so many people.\""}]
