[{"comment_id":"10156389241130725","commenter_b":"if the so called good muslims are offened with what Donald Trump is saying why are they not stepping up and reporting the ones that are trying to hurt us,that offens ME!","commenter_a":"On Trump, his blocking Muslim entry is due to terrorists in with refugees, Americans as terrorists coming back not the innocent and good ones, he wants to stop the entering to get the bad ones out first to protect Americans. I agree with @username","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"},{"comment_id":"10154814008013797","commenter_b":"Why feed nd house this p.o.s just torture em till.hes dead","commenter_a":"Piece of 💩","post_message":"LIFE IN PRISON: In the man's car, police found children's toys, chloroform, sleeping pills, cable straps, thumb cuffs, a stun gun, latex skull masks, gags and various strangulation devices."},{"comment_id":"517056128505278","commenter_b":"@username I'm pretty sure much of what you typed is not true.","commenter_a":"Hillary should be forced to work as the next ambassador to Libya. She can hire the Mexican drug cartels as her security since Obama armed them better than he did our embassy in Benghazi.","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"1083178338406653","commenter_b":"Debunked snopes factcheck go away","commenter_a":"I would not vote for Hillary she got off easy a 12 year old child rapist, the Benghazi scandal, Clinton Cash, and emails. Don't forget about Bill Clinton rape cases/allegations. Trump call Hillary: Crooked.","post_message":"“Ella sigue siendo la mejor agente de cambio que he conocido”—presidente Bill Clinton sobre Hillary."}]
