[{"comment_id":"10153540355058984","commenter_b":"It's not just abortion Drs. all Drs. Make obscene salary's. Abortion should only be for rape victims, incest victims !","commenter_a":"it wont do them any good in HELL!!!","post_message":"Here's something shocking that Obama and His Planned Parenthood cronies will not like.   Do you consider these outrageous abortion salaries \"blood money?\""},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"\"Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,\" Bernie Sanders said in a statement. \"Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.\""},{"comment_id":"485248011623976","commenter_b":"Ugly little bitch.","commenter_a":"Bush murdered 4500 American soldiers for a lie in Iraq, got another 50,000 maimed, killed 100,000 innocent Iraquis, allowed 9-11 to happened, bungled the response to Katrina, bankrupted the nation, allowed our enemy bin Laden to literally go free, and had 9 US embassies/consulates attacked with over 90 dead, yet these mother fuckers stiil pretend to be outraged over this bullshit....republicans investigated this 9 mother fucking times, at a cost of millions of dollars, and found nothing. This is perverse. Conservatives are the worst enemy this country has ever faced.","post_message":"The GOP wants nothing less than the total destruction of Hillary. -Clay"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"10154604674038690","commenter_b":"#Bilal_yema we terribly hate the western hypocrites who have kept Muslim lands occupied in Afghanistan!!! tell them to leave Afghanistan we Muslims will solve our own problems!!!!!","commenter_a":"Taliban means terrorist and terrorist means Pakistan Pakistan is cancer for the world","post_message":"Based on reports gathered by Al Jazeera from local police, security forces and the Taliban, here is a conservative estimate of the areas in Afghanistan that are contested, under the Taliban, and under government forces."},{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"842369659142996","commenter_b":"Child abuse has actually increased since Roe v Wade. Abortion logic 101...the baby \"might\" be abused later so we'd better kill her now; the baby might actually get to LIVE in a non-traditional home so we'd better kill her now\". Sheeeesh, the stupidity.","commenter_a":"So many young couples would love to take that precious angel growing inside of you. Please don't murder that innocent baby..","post_message":"You don't get to \"choose\" to kill another human being."}]
