[{"comment_id":"10153762341043869","commenter_b":"look in g good.","commenter_a":"legend cinemas click the here ..... do not insult before trying X-Men: Apocalypse Full Movie @webpagelink Rangoon 2016 @webpagelink All Ladies do it (1992) @webpagelink Monella @webpagelink captain-america-civil war @webpagelink The Jungle Book Full Movie @webpagelink Batman v Superman: Dawn of Justice Full Movie @webpagelink Barbershop: The Next Cut Full Movie @webpagelink London Has Fallen Full Movie @webpagelink zootopia Full Movie @webpagelink Central Intelligence Full Movie @webpagelink deadpool movie 2016 @webpagelink ride-along @webpagelink The legend of Tarzan @webpagelink fifty shades2016 @webpagelink","post_message":"Like most of his predecessors, Barack Obama used the bombing as a generic invocation of the nuclear age—past tense, passive voice, Alex Wellerstein writes."},{"comment_id":"1029260857170166","commenter_b":"What a crock of bull","commenter_a":"Because made in China is cheaper thanks to unions","post_message":"Financial setbacks hit the \"Made in America\" brand."},{"comment_id":"1710894845846679","commenter_b":"somebody please...slap this bitch!!!","commenter_a":"This is interesting as the Black and Hispanic communities are some of the most \"Biblically religious\" communities in this country!","post_message":"Say what?"},{"comment_id":"569607529880232","commenter_b":"Karma is a bitch!","commenter_a":"Reap the whirlwind...","post_message":"The students he ripped off are about to get their revenge."},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":""},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."}]
