[{"comment_id":"1288485644498385","commenter_b":"she was going to get nailed for perjury and they KNEW IT","commenter_a":"Well.... Bye!","post_message":"In case you missed the bombshell late last night, Ben Shapiro resigned from his post as Breitbart News’ editor-at-large over the management’s “disgusting” treatment of Michelle Fields."},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"\"Ronald Reagan would roll over in his grave.\""},{"comment_id":"1824785004425894","commenter_b":"Women who support Trump have severe Stockholm syndrome and suffer insecurity","commenter_a":"Three times divorced, womanizer dares to talk about morality.","post_message":"Let's talk about the debate...what just happened?"},{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"},{"comment_id":"567131713411422","commenter_b":"It is Bloomberg who is the dangerous demagogue and Obama, and Biden","commenter_a":"No body can help us if Hillary.is elected.","post_message":"Michael Bloomberg said \"Trump is a risky, reckless and radical choice,\" during his DNC speech last night. He also asked his fellow Independents to support Clinton because she \"understands that this is not reality television  this is reality.  Do you think his speech will hurt Trump's chances with Independents?"}]
