[{"comment_id":"1711622465785020","commenter_b":"Let us take a look @ a hypothetical example? Every house in your neighborhood left all of their doors & windows wide open when they were home & when they went away. When they returned some had many people living in their home that refused to leave, use everything that they work years for. Took over the master bed room & some decided to kill their pets for religious reasons. Others kill neighbors as they walk home. The neighborhoods within 100 miles of your home became rapid with sex trafficking, drugs, gangs, shootings, suicide bombing, & more. Will U still leave your doors, windows wide open? Would U want better protection from unwelcome intruders? U may even ask for a gated community. So Y would anyone get upset about Trumps logic on protecting America. Build a wall, only let legal immigration through our front doors. Build a strong military & ...","commenter_a":"BELGIUM JUST ENDORSED TRUMP! #BRUSSELS #VOTETRUMP @webpagelink","post_message":"**BREAKING NEWS**  I agree!!"},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"10156446544055594","commenter_b":"That woman needs alot of things","commenter_a":"We all only have so many minutes that make up our lifetime. This is a premeditated act of terrorism for which they should all be jailed for a minimum of a year.","post_message":"LIVE video and coverage as protesters are being removed and traffic is backed up on the Bay Bridge."},{"comment_id":"10154878892083812","commenter_b":"GregOwens, @webpagelink","commenter_a":"That was just a typo. He didn't mean POTUS. He meant P.O.S.!","post_message":"Pres. Barack Obama in response to last night's presidential debate: \"Hillary Clinton went high and showed why she'll be a POTUS for all Americans.\" @webpagelink"},{"comment_id":"1022408774478552","commenter_b":"Why is she walking free?","commenter_a":"since when can a low life irs agent speak with the doj,fbi to cause harm to a tax payer","post_message":"Jaw-dropping abuse of power:"},{"comment_id":"1167920019941418","commenter_b":"@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"1280286192042365","commenter_b":"^^^ That is porn for some women...","commenter_a":"Do some actually people make that face when looking at porn?","post_message":"Browsing porn on your smartphone requires more than just anti-virus protection.   Let us help."}]
