[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"10154507396141051","commenter_b":"Maybe the kid should go to history class and learn how the evil \"white\" people voted to free the slaves. Oh ya, it was only the republicans who voted that. NOT ONE DEMOCRAT. And maybe he should learn that the flag represents freedom from the brits, For all Americans. If he doesn't like it, maybe he should take a year for some overseas education. Say France maybe.","commenter_a":"Move if you don't like America","post_message":"This teenage boy refused to stand up out of his chair for the Pledge Of Allegiance because, in his words, \"America sucks.\" Here's how his teacher responded."},{"comment_id":"918090094974937","commenter_b":"Unless you make over 12 million dollars a year then you'll probably get a big tax break and a yearly stimulus for being a small business","commenter_a":"I'm a proud Tennessee woman, I've never been disappointed in my beautiful state, today is the first. Trump is not for the people. #FeelTheBern","post_message":"Thank you Tennessee! #Trump2016 #SuperTuesday"},{"comment_id":"517121775126150","commenter_b":"@username. Lucile's an idiot. Just ignore her.","commenter_a":"I never defend Obummer but it's probably better to keep him out of the White House and on the golf course.","post_message":"\"There was no movement away from the golf course, according to the White House Press traveling pool, which monitors the president’s movements.\""},{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"}]
