[{"comment_id":"10154746753444657","commenter_b":"@username, while I agree that security along our border is non existent and with the possibility of terrorist using it to their advantage it needs to be dealt with. I think it's a complete fallacy that illegal immigration should be such a focal point in this election. Its not our biggest problem. Our growing deficit and out of control federal government seem to be a bigger threat to our country!","commenter_a":"We are going to loose this election while small minded people focus on small minded things. Stock footage and former adult stars in commercials aren't going to destroy this country the people are! Because they can't seem to focus on the problems we are facing and examine the solutions of the candidates.","post_message":"Oh, the perils of stock footage."},{"comment_id":"10153157305281636","commenter_b":"very wicked woman ! she deserve it.","commenter_a":"The states where the capital punishment extists are muderers on the level of the nation.","post_message":"Even Pope Francis made a last-minute appeal for clemency"},{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"871266669599749","commenter_b":"Liars lie","commenter_a":"It's odd how no one in the comments section mentions the fact he was beaten over and over again. Good one, anglosaxon humanity!","post_message":"'We're gonna teach you about great American sex'"},{"comment_id":"10154290844506323","commenter_b":"I get the picture: not everyone shares my view of the EU but I was trying to make a point that not all the youth are wanting to remain in the EU.","commenter_a":"I am 19 I voted for Ukip and tor the UK yo leave the EU. Not all of the youth are wanting to stay in the EU. I will stay loyal to our ancestors who fought and won two wars to ensure our freedom!","post_message":"Jeremy Corbyn has defended Labour’s campaigning in the EU referendum, telling a heckler at London’s Pride festival “I did all I could” in his first public defence of his role in the remain campaign."},{"comment_id":"10153780693499071","commenter_b":"Nina Puspita","commenter_a":"They look for kindred spirits of greed, just ask Hillary.","post_message":"Here's what Goldman Sachs looks for in a résumé."}]
