[{"comment_id":"718949644953580","commenter_b":"HAHA. Chickenshit. Stay home and tweet like a little bitch.","commenter_a":"chickenshit can't take the heat","post_message":"Pathetic."},{"comment_id":"10153238029913822","commenter_b":"You guys sound like some broke ass jealous bitches!","commenter_a":"How tacky of a wedding pic","post_message":"Personal chefs, fancy cars, an expensive pool & more… at 35,000 square feet, it’s described as the biggest house in Pa.  And now it's the focal point of allegations made in a massive federal tax fraud investigation: @webpagelink"},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":""},{"comment_id":"10153880843542293","commenter_b":"Really? Because people can remember actual facts that happened 15 years ago. Right.","commenter_a":"@username you were right!","post_message":"New details emerge about Omar Mateen, including his strange reaction to 9/11."},{"comment_id":"10153193564170326","commenter_b":"Hell, they should move to texas!","commenter_a":"The GOP and their love for guns should move to Somalia where even children carry guns","post_message":"\"More guns\" is always the answer."},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."}]
