[{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"1203461079770668","commenter_b":"how did you idiots elect this stupid liberal bitch","commenter_a":"So ignorant..","post_message":"ClashDaily.com"},{"comment_id":"1452044741482218","commenter_b":"You need to put down your crack pipe that crap has fried your brain; dumb witch","commenter_a":"Democrats r a bunch if liars ..republicans are honest and classy","post_message":"\"I knew Ronald Reagan. I worked for Ronald Reagan. Donald Trump, you are no Ronald Reagan.\"  -Republican Doug Elmets says he's voting for a Democrat for the first time in 40 years.  More: @webpagelink"},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"},{"comment_id":"10153284807073984","commenter_b":"That thing is female !","commenter_a":"Shame on the university for hiring her and for not firing her......something is mentally wrong with her.","post_message":"Surprise, surprise, she is an extreme liberal.  Does this type of behavior from a teacher make you sick?"},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."}]
