[{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and \"minds\" of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."},{"comment_id":"563277980487645","commenter_b":"What's the difference between Trumps wife's and illegal immigrants? Trumps wife's applied to become citizens through the legal process of American citizenship and now their AMERICANS. Women like u are uneducated.","commenter_a":"Look up the definition of legal immigrants and illegal immigrants... Idiots.","post_message":"Yes, Donald, have you made their travel arrangements yet?"},{"comment_id":"10154890966160329","commenter_b":"Kacie Rodriguez","commenter_a":"Javier Maisonet oh Neville! ❤️❤️","post_message":"They out here. // Harry Potter"},{"comment_id":"10155487950195354","commenter_b":"Then will she pay for all her vacations, her clothes, her helpers!","commenter_a":"44.4 Million on vacations alone...She need to pay that back! ..........She's NOT an elected official.........","post_message":"“I want a big paycheck for Michelle.”"},{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"555875991245538","commenter_b":"Finally a person with some brains","commenter_a":"We should not have even been considering it in the first place. When other muslim nations refuse to take refugees because of the fears of terrorism, why should we take the risk? There's lots of room at the White House- let them stay there.","post_message":"Official Statement from Dr.Ben Carson:  Today, I am asking Congress to stop the Obama Administration’s plans to bring in up to 45,000 Syrian refugees. There is currently no ability to vet these people.  By letting refugees into our country without vetting we are putting America at risk. If our President cannot see the risk, then we must rise to the challenge and protect our country. This morning President Obama announced at his press conference that it was our responsibility to accept these refugees. He is wrong. He took an oath to protect and defend this country. There is simply not a way to vet these refugees.   We should do everything in our power to help these men, women, and children who have been forced to flee their country, but until we can sort out the bad guys, we must not be foolish. I call for increased aid to the refugees. We can and should do more to feed the hungry and shelter the homeless. We must also protect them from being attacked by implementing immediately no fly zone over these camps.  President Obama said this morning that it would be a mistake to send more ground troops. I think plenty of mistakes have already been made. As President, I would give the mission to the Pentagon, and ask them what they need to accomplish the mission. The right number of boots on the ground is whatever number the Pentagon says they need to accomplish that mission and not a single person less. The error of armchair quarterbacking our military will end in my administration. They will get the support they need and nothing less. Both the FBI and former Intelligence Committee Chairman, Mike Rogers, have indicated that it is not possible to fully vet these refugees as there is no Syrian list to vet against. Allowing these refugees to enter our country without knowing who they are is foolish. I am talking to many experts as I can, and I have yet to find one who thinks that the Obama Syrian/ISIL strategy is anything but a failure. The only thing that President Obama seems to have contained is this foolish policy inside his government.   We need to offer more than empty tough talk. We need to say what we mean, and most importantly mean what we say. When we draw a line in the sand or boundary in the air, the world needs to understand that we mean it. Too many people across the world today think that we don’t."},{"comment_id":"1103463889708572","commenter_b":"@username, it's not a C-Section if the spine is snipped. That's not a C-Section, that's partial birth abortion, aka infanticide.","commenter_a":"Hillary has stated that unborn children have no rights and that they can be aborted within hours of birth. Yet, when someone kills a pregnant woman, there are TWO charges of murder. Hmmmm....","post_message":"Trump said the procedure can happen \"as late as one or two or three or four days prior to birth.\" But that is not at all likely, writes NPR's Jennifer Ludden."}]
