[{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their \"music\" in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"10154347399052045","commenter_b":"@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10154520499329705","commenter_b":"Silly women. Tricks are for kids. Everyone knows women aren't real people. We should go back to the original constitution. Only men should vote and black guys should only count as 1/3rd a vote. I think Trump can help make that happen #Trump2016atleastIdidntrapethem","commenter_a":"More mainstream media hype to distract from the real issues. Wake up people.","post_message":"The Times to Donald Trump: Make. Our. Day."},{"comment_id":"956104721172976","commenter_b":"We will build that wall!!!","commenter_a":"After all we give Mexican illegals having them pay for a wall is racist??","post_message":"David Webb: \"Border security is racist to you?\"  Answer: \"It’s not that border security is racist, sir, it’s the whole – you know, he wants to make Mexico pay for the wall.\""}]
