[{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."},{"comment_id":"930066070388844","commenter_b":"ANd Every one seems to have forgotten the 11 airliners still unaccounted for close to a year now","commenter_a":"That means trouble","post_message":"UPDATE: Hundreds of TSA badges missing at airports (VIDEO)  @webpagelink"},{"comment_id":"10156625299625354","commenter_b":"Give that girl a cigar!","commenter_a":"Oh, look everyone! It's another one of Obama's useful white idiots. She's never held a job in the real world. She's one of those who teaches, because she cannot do, and that's a trend that needs to come to a screeching halt worldwide. Meanwhile, the Muslim in Chief can use the foul mouthed, petulant child to help further his agenda of U.S. Islamization, because using dummies as incidious devices is what radical Islamists do best","post_message":"Liberal Values on grand display..."},{"comment_id":"1737148153188324","commenter_b":"That illegal ones should be deported or shot","commenter_a":"Total bullshit! This is a huge part of the democratic voter base by no mistake","post_message":"A Center for Immigration Studies report shows just how much immigration has skyrocketed since 1970. Shocking!"},{"comment_id":"879451945423561","commenter_b":"The Bimbo queen herself Sarah Palin.","commenter_a":"I hope she doth","post_message":"This is criminal!"},{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"},{"comment_id":"1036956366325374","commenter_b":"Your mom is a joke.","commenter_a":"America the land of the free .. Your gun laws are a joke","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."}]
