[{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"10153448119649753","commenter_b":"What a great idea, Helen! Let's all go out and buy guns and have daily shootouts in the malls of America! If I had a choice between keeping you here or one of the Muslims I know, I'd pick the Muslim.","commenter_a":"They were Muslim terriost keep your guns ready if you don't own one get one get a carry permit if you go to the mall take your gun we have to stop them obummer wants to protect them wants to let more in write your govnor insist we don't want them here","post_message":"ISIS has reportedly claimed responsibility for the San Bernardino, CA shooting that took place on Wednesday, December 2. For the past couple days, the Federal Bureau of Investigations has only speculated that the shooting – which claimed the lives of 14 victims and left 19 injured – was an act of terrorism, but have not confirmed. Now, the come forward with a chilling statement about the San Bernardino shooting and the Muslim newlyweds responsible for the massacre – Syed Farook, 28, and his... @webpagelink"},{"comment_id":"10152908271969753","commenter_b":"You are absolutely right! She's disgusting","commenter_a":"if a man did this he would get prison time she needs this also..she is a guilty..","post_message":"The married mother-of-two admitted to having sex with the student on seven separate occasions both in her vehicle and at her home."},{"comment_id":"10155455804716729","commenter_b":"Not to mention the innocent lives that will be saved.","commenter_a":"I don't care who pays for it, just build it. Ultimately it will pay for itself","post_message":"Ain't that something?"},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."},{"comment_id":"577625642398915","commenter_b":"I was going to say not everything you see/read on the internet is true- A very nice friend once told me that- so...where's the link to the factual article or video or actual statement? You can't believe it just because somebody posted it & made a meme out of it!!!😐","commenter_a":"At least at this election I will not be voting for a party that would take such a pledge and perhaps n ever will again.","post_message":"Republicans have been plotting to obstruct Pres. Obama since the day he took office, and now they have the audacity to ask for your vote this November.   Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154091101902042","commenter_b":"Sarcasm at its finest, they should've pulled their pants up!","commenter_a":"All white guys I see","post_message":"THIS CRAZY BURGLARY! These burglars rammed a car through the gated front door of an Indianapolis clothing shop, and then about a dozen spilled in and grabbed whatever they could. It was all caught on tape. More details: @webpagelink"}]
