[{"comment_id":"508820039306289","commenter_b":"This should be in every state. Men that force themselves on a woman do not deserve to have the ability to rape again.","commenter_a":"I dont understand the verbiage \"violent sex offenders\". Isn't rape always violent, are their non-violent rapes I don't know about?","post_message":"This state did it, what about yours?"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10157784004785206","commenter_b":"Those poor girls should be removed from her household. Smh.","commenter_a":"SHe WIggity Wack!","post_message":"Nina Peterson has made over $1 million being a companion to older rich men, but she insists she’s not a prostitute."},{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"\"This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.\""},{"comment_id":"10153289541199614","commenter_b":"Thank God he blessed me! Don't gotta do that","commenter_a":"stupid is has stupid does! Forstes Gump","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family.  The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show.  The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says.  Read KTLA's story here: @webpagelink"},{"comment_id":"1150363668364697","commenter_b":"In other words you won't be out of pocket otherwise you could still go ahead and spend a tiny bit of the fortune you have made from the British people, you'r an utter disgrace to this country. put some back in instead of out you fuckwit arsehole virgin c**t.","commenter_a":"Tell us what the deal was, then we can make a judgement. Could be bs. for all we know.","post_message":"And Richard Branson has cancelled a deal costing some 3,000 jobs..."},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"}]
