[{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"1330438396971266","commenter_b":"Better than the PUSSY approach you girls are doing","commenter_a":"What does Biden know he follows Obama.","post_message":"Biden took on Trump in a recent foreign policy speech, arguing that America doesn't need \"empty bluster,\" or the \"insecurity of a bully.\" What do you think of his comments?"},{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10154319611824586","commenter_b":"Horrifying! All for money!! Humans are barbaric! Vegan for animals!","commenter_a":"People are killing crops:@webpagelink #PlansLivesMatter #DontGoVegan #JKGoVegan","post_message":"BREAKING: Those hermit crabs you see at beach shops & pet stores may come from this horrifying supplier.  Warning: The way workers crack crabs shells is really hard to watch :("},{"comment_id":"10153617966566051","commenter_b":"Becky Jensen sorry but you are a dumb bitch","commenter_a":"Thank God","post_message":"The man noticed that a woman was crying next to him in line. When he asked her daughter what was wrong, he knew he had to take immediate action."},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"}]
