[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10153268989822894","commenter_b":"A marriage should have 3 parties involved at all times!! Furthermore, I don't think women will ever understand how men think..ijs","commenter_a":"Y'all are so quick to judge. Giving him passes to cheat, doesn't necessarily mean he has cheated. And because she's allowing him to do it without being affected means that nothing is wrong with her self-esteem. If she just doesn't want to give her man something, then she leaves it up to him to decide where to get it. And who's to say he's making the decision to cheat? I highly doubt if she's allowing him to do it and not caring, then he isn't. That's so not how men work. And to say that they shouldn't have gotten married is stupid because they've been married for a while and I'm sure she has grown to bring about this decision with her husband. And you're not married for sex anyways. LOL!","post_message":"Mo’Nique Explains Why She Gives Her Husband ‘Free Passes’ to Cheat: ‘They May Give Something I’m Simply Not Willing to Do’"},{"comment_id":"1738235436425110","commenter_b":"TRUMP...u know Osama is in the Bahamas??? and not precisely dead","commenter_a":"The state run media are all Lib Commies ! Run by the Democrats !","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10152762563712894","commenter_b":"I can't stand that Bitch.","commenter_a":"For some reason i like the color & hair, I just don't fuck with Kylie like that tbh . Then again I feel as though she low key disrespecting black folks with this shit. She tried it with the lips & butt but this shit right here just made me feel like she's doing the most now","post_message":"Say What Now? Kylie Jenner Says She Wishes She Looked Like THIS All The Time [Photo]"},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."}]
