[{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"10153040566066051","commenter_b":"WTF.. This bitch don't deserve to be a mom I'm glad they arrested her she needs to fry","commenter_a":"I should hope so!!!!","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"10153464024014087","commenter_b":"Nothing will convince me that illegals not being here would not mean more money in the pockets of people in my nation who are living in poverty today and because my fellow countrymen are the only thing important when it comes to my nation.....my political support will only be for candidates who will remove illegals from my nation as my Constitution requires","commenter_a":"If illegals were back outside our nation....jobs would be much easier to get for our citizens","post_message":"President Barack Obama's three-pronged plan includes wage insurance of up to $10,000 over two years, expanded unemployment insurance coverage and more opportunities for laid off workers to retrain and reenter the workforce. WATCH:"},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"},{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"},{"comment_id":"10152878332246130","commenter_b":"It's always the ugly women throwing shade. This chick has a light-bulb-shaped alien head. #haveseveralseats","commenter_a":"She should never have apologized for anything.","post_message":"We're still cringing."}]
