[{"comment_id":"1647473612211471","commenter_b":"Trump has done nothing against the law and if he did why didn't they file charges or even report it....This is just bull and not important...but on the other hand Hillary can and will be in trouble with these email leaks...statue of limitations is not up on her...so there can be charges brought up on her","commenter_a":"The fact is, that you people have lost all credibility with anyone with the ability to think for themselves...Your obscene bias, is so obvious, it's not even funny anymore....The NY Times has even less credibility, and is viewed as even more bias and corrupt than @username or People, because the previous allegation the Times made a few months ago, was **proven false by the \"victim\" herself**. And you have to understand that the election is *temporary*, and after the election is over, your ratings will still be at records lows, except your reputation/credibility will have been permanently shot, permanently destroyed. This is the price you, your producers and executives have paid to try and skew this election towards Hillary at any and all costs...","post_message":"Ex-beauty queen says it was humiliating for Donald J. Trump to be backstage, \"before you could put a robe or kind of dress yourself, he walked in. Some women were half naked, others were in the process of changing.” @webpagelink"},{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"464935007030413","commenter_b":"Best place in the world for a daily Pork roast.","commenter_a":"Deport their @&$)(;:/,?))&@@&))","post_message":"Should Islamberg Be Shut Down?  Comment 'yes' or 'no'."},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"706998779490700","commenter_b":"I'll help her pack!!! Don't let the door hit your big fat ass on the way out!!!!","commenter_a":"She is as big a piece of shit as her husband","post_message":"Michelle Obama was caught bad mouthing America in this newly surfaced video. If she doesn't like America, she can leave. Would you be happy if Michelle was gone?"},{"comment_id":"406947019493592","commenter_b":"Another ride, but this time take obummer out","commenter_a":"Good for them!","post_message":"Enough is enough for these bikers..."}]
