[{"comment_id":"10154265295731756","commenter_b":"Barriers for woman are more subtle in every field!","commenter_a":"Chet Logue","post_message":"The lingering, less-visible barriers to women in science create a new kind of challenge: People will fail to acknowledge they're there, writes Tania Lombrozo."},{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""},{"comment_id":"1306220052736740","commenter_b":"Trump has everything a person could want so he just wants to pay American back!! Hilary tried to steal furniture from the white house the first time around","commenter_a":"Hillary should be in prison! Treason and lying are her crimes. Benghazi will never be forgotten as she turned a deaf ear to our own and did absolutely nothing! Trump in 2016! 🇺🇸🇺🇸🇺🇸","post_message":"As of now, Donald Trump and Hillary Clinton appear headed for a showdown in November. Who gets your vote in this matchup: Trump or Clinton?  LIKE Opposing Views for more breaking news and analysis!"},{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"},{"comment_id":"10153294608621051","commenter_b":"There are bad waitresses too!! I don't treat one bad because another was bad!!","commenter_a":"All human life is sacred. But I work at a restaurant down the street from the county sheriff's department, and the boys in blue that come in are often disrespectful and rude, and act entitled to walk all over us because they're cops. They once refused to leave after we closed, even though they were done eating. I'll start respecting the blue more when the good ones start publicly, and loudly denouncing the ones who aren't.","post_message":"This officer had just finished a nice meal and was preparing to pay his bill when he noticed something written on the receipt."},{"comment_id":"572505492946269","commenter_b":"If we could just get a forty hour work week and more than minimum wage so we dont have to work 2 or 3 jobs, life would be a little easier. But the government keeps bringing in illegals and sending our jobs to other countries and we cannot get away from living paycheck to paycheck. It is disguting that the most advanced country makes it citizens live like this. We know it is to control the population.","commenter_a":"Well Hillary is done if she does not win. Without her the path to a 2020 boderless world is stopped dead in it's place. Why oh Why do you think both the Republican and Democratic Party and all the World Cartel Leaders have done everything they can to get rid of Trump for a year? Jeb Bush, the heir apparent is a globalist and so is Hillary. So were the past 5 presidents. With both Jeb and Hillary running, it did not matter who won, the road to globalization was on tract. Enter Trump! Boy did he screw up their plans! No matter what they tried he did not go away! No globalization of America for him! Now as their last hoorah, most all of the newspapers have come out for Hillary and are printing every lie they can about Trump. It is only going to get worse the closer ...","post_message":"This is crucial progress in the push for better workplace policies."}]
