[{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""},{"comment_id":"10153378871661130","commenter_b":"@username get a life and get out of the reproductive business of women.","commenter_a":"Planned Parenthood is more than abortions and those who only focus on that are very closed minded. I support planned parenthood.","post_message":"The REAL truth."},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."},{"comment_id":"977688075599947","commenter_b":"Dirty whore","commenter_a":"HOA president needs to remember where she lives!","post_message":"How idiotic!"},{"comment_id":"10153554565881615","commenter_b":"... Murder is obviously horrible... But I would like to expand capital punishment beyond that... To a crime I put equal to murder... Child molestation ... Or child RAPE. Unthinkable. Monsters like that should be eliminated as well.","commenter_a":"Will waste even more money to keep him in our prison system or on \"death row\" ... Please use capital punishment in cases like this and actually FOLLOW THROUGH WITH IT!","post_message":"BREAKING: Allen Wade has been found guilty on all counts in the murders of Susan and Sarah Wolfe, who were killed in their East Liberty home more than two years ago."},{"comment_id":"840046962805763","commenter_b":"GREAT! Then we don't have to build the wall!!! But will Mexico take them back?","commenter_a":"Hey, have at it.","post_message":"LOL."},{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"}]
