[{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"},{"comment_id":"1211910735512691","commenter_b":"Duck you you racist old bitch","commenter_a":"Stop drinking you juice head.","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant  and no one did anything to stop her.  More on this story here: @webpagelink"},{"comment_id":"10155542841313362","commenter_b":"Get well soon Senator Susan Collins and Merry Christmas.","commenter_a":"Thank you for the well wishes!!!","post_message":"Due to a slip on the ice, both Rob Gronkowski and I will be on Injured Reserve for the playoffs.  My ankle was broken in two places, but thanks to a successful surgery at St. Joseph Hospital with Dr. Jacob Brooks and his team, I am on the road to recovery."},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."}]
