[{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."},{"comment_id":"1041548139262556","commenter_b":"I applaud those who came to discuss the matter at hand. To those who just want to attack me...lmao you have to do so much better than pulling your \"trump\" card","commenter_a":"Good. Maybe the Republican Party can stop killing our soldiers and blaming it on Hilary","post_message":"\"I'm worried that I will be the last Republican president,\" said Former President George W. Bush"},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"1171128359565299","commenter_b":"How's he going to pay for the bloody wall????","commenter_a":"Showing a total and complete ignorance of understanding of the root of the problem.","post_message":"A big wall is the Swiss Army Knife of Republican politics."},{"comment_id":"10155066289616336","commenter_b":"@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"673748802758301","commenter_b":"She is probably really a white man","commenter_a":"Bitch is dumb and racist","post_message":"Give it up Mosby."}]
