[{"comment_id":"10153307243877217","commenter_b":"Holly Allcock sucks all cocks","commenter_a":"Trump is the most hated man in the world. What a disgrace!","post_message":"About 568,000 people have called for action against the presidential hopeful."},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that \"commit suicide\" with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"930249893698207","commenter_b":"@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"10153633872565950","commenter_b":"Yeah! Lets send everyone back to where they came from! Build a wall ! Its back to Europe with you my friend:)","commenter_a":"And this is NEWS , Why??? Don't even care or know who this guy is... Stay out of Mexico and South America and guess what?? You will be safe...","post_message":"25-year-old Alan Pulido is a forward for Olympiacos of Greece and was part of Mexico's 2014 World Cup team."},{"comment_id":"1096005223798926","commenter_b":"Here we go with the wall...","commenter_a":"Trump would have never left that Marine in Mexico like Obama did...","post_message":"Donald J. Trump and Mexican President Enrique Peña Nieto give statements after meeting in Mexico City."},{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"\"I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.\" – Donald J. Trump"},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"}]
