[{"comment_id":"838550182928031","commenter_b":"i feel bad 4 you girls cuz i used my dick tip","commenter_a":"Christoffer Kindmark","post_message":"@webpagelink"},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"},{"comment_id":"391857781002516","commenter_b":"Animals! That's why they're in prison!","commenter_a":"They would live there no matter what the conditions are! They destroyed it now let them lay in it!","post_message":"The corrections officers could only watch as the thousands of inmates broke the heating, cooling, and ventilation systems, and forcefully shook the gates in the prison lawn..."},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10153093946344205","commenter_b":"Illegals idiot","commenter_a":"He realizes that Mexicans aren't the only immigrants in America, right? Over half of Americas population would be kicked out if he tried to do that, and that's only recent immigrants. If you wanna get technical, the only people that aren't immigrants are Mexicans and Native 741915279236631s. They were here first.","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"@username Teresa Oanh Hoang","post_message":"She had something much better in mind."},{"comment_id":"1242112452475449","commenter_b":"REMEMBER!! ..The Leftist Liberal News Agencies, pushed very hard for the E.U. to take in the Islamic Immigrants with Islamic Ideologies.","commenter_a":"Islam is a cancer and needs to be removed","post_message":"President Obama says the killings in Paris are \"an attack on the civilized world.\" For more coverage: @webpagelink"}]
