[{"comment_id":"473377599519487","commenter_b":"Leave the man alone. That goes for all you Muslims.","commenter_a":"He will never back down and kiss their butts he's not Obama....","post_message":"Muslims want Clint Eastwood's head, but he's not backing down.  This is outrageous, let's show him we have his back.  Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10153503592741336","commenter_b":"LOVE HIM!","commenter_a":"I CAN NOT TRUST THIS GUY NO A biT I RATHER VOTE FOR NOBODY TO GIVE HIM MY VOTE, HE COULB BE WORST THAN OBAMA. WISHY WASHY GUY.","post_message":""},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"628929223957206","commenter_b":"By Bitch.","commenter_a":"And don't forget to take Rosie, Whoopi, Kanye and the rest of the we're-leaving-if-Trump-wins morons with you! Good riddance to all!","post_message":"Miley Cyrus packing her bags and taking off after trying to take on Donald Trump. Say goodbye! Good riddance. Can we get 30,000 'LIKES' to have Miley leave the country?"},{"comment_id":"10154229905709170","commenter_b":"Stop it. This kind of game playing makes you look more the fool. Most people today couldn't pick a transgender out of a line-up of people. They've been using our public bathrooms according to the sex they identify with, live and dress as, all these past decades to no uproar. Now all of the numskulls have come out of the woodwork claiming their women and children will be raped in the toilet stall because men are going to swarm into the ladies room because the law says they can. Get this: sexual predators don't follow laws in the first place and no law will stop them from getting their next victim be it in a bathroom or anywhere else.","commenter_a":"I will be packing better know what you are doing or you will be peeing like a girl for real !!!","post_message":"You want to try using the ladies' room, bro . . . the politicians and the media might be OK with you, but as for the ladies themselves, I wouldn't be so sure."},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"10153482997507550","commenter_b":"All illegals go back to where you came from. You are breaking the law. Get out.","commenter_a":"Arrest. Deport. Go back to Mexico and protest.","post_message":"View from #Chopper11HD of the #HB318 (immigration bill) protest in Raleigh abc11.tv/20e0DVL"}]
