[{"comment_id":"10155303562011756","commenter_b":"@username stfu and gtfo. Now.","commenter_a":"I get where the author is coming from and she makes a valid point. In this case though I think the mommy comments were engendered by Beyonce's show stopping 10 minute celebration of being black, being a woman, and being pregnant. Her presentation as an Isis figure/fertility goddess all flowed into the dynamic she created, so it's understandable that Adele and Faith related to her that way. Beyoncé was the mother of the night and that's how she planned it. If she performed formation and wasn't pregnant for example, this article would be more warranted. I think the whole mammy/mommy comparison arises because it's impossible to escape the history and application of white supremacy whenever colored people deal with Western institutions like the Grammy's. The concept of disposable black women, which Beyoncé essentially demolished in her performance, is baked into our society and forms a large part of the reason ...","post_message":"On the Grammy stage, both Adele and Faith Hill commented that they wanted Beyonce to be their . Those comments came across as absolutely bizarre for Denene Millner, writing for NPR's Code Switch:"},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"},{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"10153241049435950","commenter_b":"SHUT THE FUCK UP...","commenter_a":"Is oboma a member of isis/isil?","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, \"The Bluest Eye.\" Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"},{"comment_id":"811711869019390","commenter_b":"I wouldnt trust that asshole with my worst enemies life","commenter_a":"He should have never been trusted in the first place.","post_message":"Obama Scrambles And Goes Into Hiding After This Investigation Leaks.  He's doing whatever he can to keep this quiet.  Do you think Obama should not be trusted?"}]
