[{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried \"academic freedom\" and got away with showing porn in a music class and \"relating it to music\". Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they \"justify\" it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""},{"comment_id":"10153192857784087","commenter_b":"TRUMP 2016","commenter_a":"Our tax dollars hard at work!","post_message":"The sight of GOP presidential frontrunner Donald J. Trump’s plane surprised reporters traveling with the vice president, and they quickly snapped photos of the scene."},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"},{"comment_id":"10153618510960329","commenter_b":"How bad do you want to see picture number 4s titties?!","commenter_a":"Dave David Craig so Mark was right all along...","post_message":"Drinking beer in the shower is a thing and you should all be doing it."},{"comment_id":"872258432910129","commenter_b":"Really Kathy? I can't believe any woman would ever even think of voting for the dumpster","commenter_a":"If you vote Hillary, you're voting for babies to be murdered, etc. She needs to stay home and clean house. She can't even do anything with her husband. How can she run a country.","post_message":"WATCH LIVE: Former NYPD commissioner talks about election day security  — who will win, Donald J. Trump or Hillary Clinton?"},{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."}]
