[{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"},{"comment_id":"925751947552361","commenter_b":"oul don","commenter_a":"303253143368344u after kellys when kfc was still open","post_message":"Great afternoon in Ohio & a great evening in Pennsylvania - departing now. See you tomorrow Virginia! #MakeAmericaGreatAgain"},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"10153239066656491","commenter_b":"No he wouldn't lol. Hagrid wouldnt be close to slytherin","commenter_a":"All muggles should be sorted to Hufflepuff.","post_message":"J.K. Rowling isn't afraid to tell Harry Potter fans when they're wrong."}]
