[{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"10154635398261037","commenter_b":"To impregnate your mom? Yes.","commenter_a":"And she'll be knocked up again within the month","post_message":"Panna Krom, now 26, was convicted at 17 of killing her newborn in a toilet to hide the pregnancy from her parents."},{"comment_id":"549265795241268","commenter_b":"Those boarders should never been opened... Obama fault all the evil happening in the world, is all due to Obama turning loose the Muslim maggots and Mexicans by mostly the Muslims... Their eating up all the good stuff in the world just like maggots do and ruining everything!!!!","commenter_a":"Yes","post_message":"BREAKING: Mexican Military Invading US, Begin Shooting Texas Residents.  We Trump's wall now. This is getting out of hand.  Do you think we should close our borders?"},{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"10152787006691545","commenter_b":"What time?","commenter_a":"I can't believe they just showed up out of the blue. There should have some fore-warning. *drum snare*","post_message":"About 30 members and supporters of Bloodstained Men, a nonprofit group based in California, held signs that read, \"Foreskin is not a birth defect.\""}]
