[{"comment_id":"10153394886826336","commenter_b":"Mexicans run America now and there is nothing u can do about trump ur screwed...don't run for president no more there is no way ur going to win piece of","commenter_a":"Sue them to Mexico and back!","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153482227782377","commenter_b":"The corruption mongers who have like leeches suck the blood and financial life out of this country find being with Trump is of no benefit to them therefore its a matter of running scared when we find out who they are their done!","commenter_a":"were never conservitves in the first place @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2","post_message":"In the wake of his Indiana primary victory, some Republicans are breaking with party tradition and refusing to support Donald Trump under any circumstances."},{"comment_id":"1239208946099133","commenter_b":"Both moms need to get sterilized","commenter_a":"First it said she wasn't charged then it said she was charged with manslaughter and she has been released on 15,000 dollar bond. They should take all her children away from her. These children are her responsibility not the 8 yr old boy. If she would rather be in a bar then put her behind them for the rest of her life.","post_message":"A boy is being charged with beating a 1-year-old girl to death while they were left home alone as their mothers went to a nightclub, police said"},{"comment_id":"1722780531335461","commenter_b":"That's what my husband says, so why does he get to run.","commenter_a":"@username, answer the question - how can Ted Cruz run for President and be born in Canada.","post_message":""},{"comment_id":"10154397036584205","commenter_b":"Way to stop women success!","commenter_a":"I work for Overstock and voted to pull all Trump, both he and his spawn, off our website. Proud of our CEO for putting it to his employees to make the final cut. I can't wait for the results!","post_message":""},{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"}]
