[{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"},{"comment_id":"926192544193565","commenter_b":"TO BAD THEY HAVE TO CHANT THAT!!! IF LEGAL SYSTEM HAD DONE THEIR JOB,SHE WOULD ALREADY BE IN ORANGE!!!!!!!!!!","commenter_a":"Apparently Kate Bolduan is the only one left that dosen't know what is PAINFULLY OBVIOUS...\"Slick Willie\" either bought out Lorett Lynch or threatened her with death in that plane meeting and Obama threatened Comey with his job and political future...Her problem is that she thinks we're all as dumb as her...smh","post_message":"CNN anchor Kate Bolduan whined about the \"lock her up\" chants directed at Hillary Clinton during the Republican National Convention on Wednesday while expressing doubt that it was the right \"message.\""},{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"1089868204425048","commenter_b":"Ugly racist bitch","commenter_a":"Leave the Sgt alone he is right she shouldn't have done that it took me two times watching it to figure out what she was doing and it not right","post_message":"This officer thought he could speak his mind about Beyonce's halftime performance... but as soon as he spoke out, he got some VERY bad news.  He never though this could happen....  Welcome to Obama's America."},{"comment_id":"10155025508527577","commenter_b":"Ya genius. We don't want to pay for more illegals shit.","commenter_a":"maybe he just doesnt want to pay for someone else shit .. just like any normal person doesnt want to pay for anyone elses shit .. especially for something as stupid as a wall . didnt work for china back when they made one what makes you think itll work today.. there will always be someone smarter than the measures put in place to stop advancement ... explosives arent hard to get in mexico especially if you are a well connected cartel ... people will be getting killed while the wall is being built kidnapped and the likes the wall if stupid for so many reasons .. just increase personnel and the available resources to combat the problem and it will in turn become easier to manage the flow of illegal immigrants coming in ... and if you think we as the u.s. government doesnt profit off cartel youre dumb","post_message":"The Mexican President was funded by the Juarez Cartel and that’s why he is against the Trump border plan:"},{"comment_id":"10153272091283271","commenter_b":"lol. And the elephants will inherit the earth and as the most intelligent animal.","commenter_a":"This is why the aliens won't talk to us","post_message":"Kentucky clerk Kim Davis is free as of Tuesday. Former Arkansas Gov. Mike Huckabee stood alongside Davis outside the jail, calling her \"incredibly brave.\" Hear her words in the video. What's next for her career? ---> @webpagelink"},{"comment_id":"883740348483208","commenter_b":"Where are you FBI Ophry openly threatening to Murder White's. Do your duty and arrest her. Where did she get all her Million's from. She is a Racist herself.","commenter_a":"You mean all Blacks are full of hate for Whites including you get your facts straight from one generation to the next on and on forever it is taught to HATE all WHITES","post_message":"Do you think Oprah is a bigot?"}]
