[{"comment_id":"10152969085332623","commenter_b":"Lock up your wives.","commenter_a":"Filling out that trophy case.needs that one for the set!lol","post_message":"Tiger Woods has entered to play in next week's Wyndham Championship in Greensboro:"},{"comment_id":"10153938983386051","commenter_b":"It appears that conservatives are pro-Sharia law after all.","commenter_a":"People willing to vote for a guy married to a former supermodel and who used to sponsor a beauty contest object to a halter top? Really?","post_message":"Some people are very upset over how Megyn Kelly dressed on Fox News last night. Here is what she wore. Decide for yourselves if there's anything wrong with it."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"},{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"},{"comment_id":"10153612119195530","commenter_b":"Nobody at the restaurant saw anything?","commenter_a":"How come nobody saw anything?","post_message":"So what really happened that Wednesday afternoon in 1975?"}]
