[{"comment_id":"10153278165616336","commenter_b":"Put down the assault fork and nobody will get hurt!","commenter_a":"Ummm.. Say what fattie? You can't handle food ownership.","post_message":"\"Americans do not seem to be able to handle gun ownership in a way that permits maintenance of a civil society.\""},{"comment_id":"10153990525422452","commenter_b":"Jayleen Guadarrama","commenter_a":"LAPD. Respect the rights of the people.","post_message":"Anti-Donald Trump protesters marched through downtown Los Angeles for hours before LAPD tactical officers blocked in the crowd and began dispersing people in small batches. @webpagelink  The protests were generally peaceful, aside from scattered reports of bottle throwing and graffiti."},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."},{"comment_id":"10153137487806336","commenter_b":"Because 'not topless' she would never make the cover. Topless, she is on the cover. Follow the money.","commenter_a":"Why the hell do you have to pose topless to represent yourself? She plays golf, she's not a go go dancer so pose with something that represents your sport. As it is all she represents is the moral decay of America.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\"  LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"405482309640063","commenter_b":"Sharia is contrary to the Constitution and as such cannot coexist with our laws. If muslims want to live by sharia then they need to return to the hellholes they came from. I can guarantee that if a muslim male were to attack me or even confront me that I would take him out. And he would not get his 'virgins' either.","commenter_a":"yep, we enough corruption without this law adding to it.","post_message":"If you don’t believe that sharia law is already creeping into the United States of America, then you need to watch this video."}]
