[{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"},{"comment_id":"422148361459748","commenter_b":"Disgusting 😡 Hope they lose their seats next election! #CrookedBastards","commenter_a":"Continued disappointment!","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."},{"comment_id":"1112320072187475","commenter_b":"Comparing this flooding to hurricane katrina is like trying to compare Benghazi to Iraq 😂😂💦","commenter_a":"What\"s happening in the US of A before the election happened in the Philippines. The big news network had been obviously bias against one candidate and it seems that this candidate cannot do anything right for them for obvious reasons. Even the Roman Catholic hierarchy are all bent on preventing our presidential candidate to win the election. But lo and behold the people have spoken and are up in arms against these giant nerworks and rallied their candidate of choice to win decisively. Wake up America you are being manipulated by a few who have selfish interest and only have themselves to enjoy if their will be done.","post_message":"President George W. Bush was torn to shreds in 2005 by mainstream media commentators for his initial response to Hurricane Katrina – yet President Obama’s detached response to the recent Louisiana floods has been met with resounding silence from those same outlets."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"}]
