[{"comment_id":"450484615139832","commenter_b":"Who give dam who she is jealous hater","commenter_a":"He sucks period!","post_message":"White House panicked..."},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"\"Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.\""},{"comment_id":"978703995520079","commenter_b":"And so does everyone else or they would not even bother if they did not","commenter_a":"The comments are always good for a laugh. You put up something positive & life affirming & there are sad, silly people feeling sorry for themselves who bad mouth it because it came from a successful actor. Ever wonder why he's successful? Maybe he had the right attitude & didn't blame all his problems on someone else!","post_message":""}]
