[{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"952878738162068","commenter_b":"Than go home! Are laws not yours","commenter_a":"mix bacon with it .../","post_message":"\"The Islamic form of slaughtering animals involves killing through a cut to neck when the animal is still alive. An Islamic prayer is then read as the blood is drained from the body. In the UK animals are legally required to be stunned before their neck is cut, but some Muslim argue this is against their religion.\""},{"comment_id":"10153253558949575","commenter_b":"Just go ahead and remove her from this planet. That kind of person isn't needed here.","commenter_a":"What a POS! Hopefully she will never get custody of her child back! WTH is wrong with ppl!?!....SMH!","post_message":"An Ohio woman has been indicted on charges she trafficked her 11-year-old daughter to a drug dealer in a sex/heroin exchange."},{"comment_id":"10153562677106680","commenter_b":"She wouldn't work for him with a gun to her head.","commenter_a":"Please please trump get CONDOLEEZA RICE as ur running mate. I understand that u do not want to pander, but like it or not, this elections , the woman card has been dealt unfairly by crooked Hilary. But i think looking at it positively , trump has an opportunity with CONDOLEEZA RICE. She was a magnificent SOS. Hardworking as hell , logged more air miles then any other SOS. By choosing CONDOLEEZA , trump will also show to the American voters a good example of a SOS. Besides she has great Christian values, very very qualified and better then most of her male counter part","post_message":"Paul Manafort said he'd also be 'surprised' if the front-runner put out his tax returns."}]
