[{"comment_id":"1757450071143314","commenter_b":"Get your foot off the furniture! What an embarrassment she is!!!","commenter_a":"Chewbacca!!!! Lol","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153163723737377","commenter_b":"She belongs in jail!","commenter_a":"And Huma's email said something about after her nap. Seriously this evil woman is too old to hold the highest office in the United States of America!!!!","post_message":"\"These new Benghazi emails are disturbing and show why Hillary Clinton and the Obama administration had to be forced to disclose them,\" said Judicial Watch President Tom Fitton in a release to Newsmax. Watch more on this tonight on Newsmax TV- Directv 349, Dish 223, Verizon FiOS 115, or Newsmax App."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"10153263682739342","commenter_b":"Bill I don't want white people dead I want bush dead","commenter_a":"Good now hang him","post_message":"Former President George W. Bush surprised a crowd at a Dallas courthouse Wednesday when he appeared for jury duty."},{"comment_id":"10156113293015725","commenter_b":"all you haters can eat a bag of liberal dicks!","commenter_a":"That's okay - Presidents don't have time to run Celebrity Apprentice! You will be busy saving our country!","post_message":"Congrats to my friend Arnold Schwarzenegger who is doing next season’s Celebrity Apprentice. He'll be great & will raise lots of money for charity. To all my fans, sorry I couldn’t do The Apprentice any longer— but equal time (presidential run) prohibits me from doing so. Love!"},{"comment_id":"10152873663099877","commenter_b":"She tried it, smh.","commenter_a":"I Hate when racist retract what they say! \"You're a racist\", you said it therefore you meant it!","post_message":"Giuliana Rancic Disses Zandaya's Locks: 'She Smells Like Patchouli Oil Or Weed.' Watch and read more on this including Zendaya's and Twitter's response.  Grio fam, what do you think of Zendaya's response?"},{"comment_id":"10154119887406167","commenter_b":"LOCK HER UP!","commenter_a":"Why hasn't Hillary been arrested for money laundering and racketeering?","post_message":"It's not just Trump that's the problem -- it's his family too."}]
