[{"comment_id":"1400798166615856","commenter_b":"Bye bye bitch","commenter_a":"KICK ROCKS, THAT'S RIGHT RUN RABBIT RUN","post_message":"BYE! You won't be missed."},{"comment_id":"10153814775523797","commenter_b":"A woman being drunk is not a license to violate her. Go Sit Down somewhere....","commenter_a":"exactly she was drunk she dk what he was saying or doing she just wanted n excuse to sue these officers n live off our tax dollars rest of her life n not work","post_message":"CITY PAYS DRUNK WOMAN: Well, not exactly. #Chicago taxpayers will shell out money to compensate an inebriated woman who accused two police officers of sexually assaulting her. What do you think? Details here:"},{"comment_id":"841503402609382","commenter_b":"IDIOT!","commenter_a":"Fat White Asshat","post_message":"Shame on him.  \"According to New Jersey Watchdog, Christie reportedly spent over $82,000 of taxpayer money on concessions at MetLife Stadium.\"  Read more here: @webpagelink Image by Occupy Democrats"},{"comment_id":"903935252988832","commenter_b":"That strategy has never once worked. In fact, we created ISIS by doing exactly that to Iraq.","commenter_a":"Just another reason to bomb them into little pieces. If done correctly, these vermin could be wiped out in a matter of weeks.","post_message":"\"Since ISIL declared a caliphate in Iraq and Syria in July 2014, the group has become one of the world’s most well-financed terrorist organizations.\""},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":""},{"comment_id":"10153400582321051","commenter_b":"She's a bitch? Really???","commenter_a":"Have fun in jail bitch","post_message":"When this man's wife discovered he was cheating on her, here's how she decided to handle it."},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."}]
