[{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"528240787342392","commenter_b":"she looks like a fat ape","commenter_a":"What a wonderful First Lady!!! Prayers for Candy & Ben Carson!!!","post_message":"Candy got to meet some great people this weekend in New Hampshire! #BC2DC16"},{"comment_id":"669515329853116","commenter_b":"obama's peaceful religion! muslim Orcs bring intolerance, hate, terror, destruction, and death. The culture and \"civilization\" manufactures nothing else but!","commenter_a":"Just why would you call her crazy. They can flip into terrorism at any time. The parents should not have hired her. Stupid.","post_message":"Russian police arrested the nanny and charged her with murder after she was found at a subway station holding a child’s severed head, yelling \"Allahu Akbar,\" according to reports."},{"comment_id":"1499235536803237","commenter_b":"Oh I am pissed, then the ones that need help, can not get it. And that lazy ass gets everything for free and that for 15 years. They should tell her to get her ass out and work, and stop spreading her legs.","commenter_a":"parasites","post_message":"Are you angry yet? Just listen to what she has to say about it!"},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"}]
