[{"comment_id":"10155963781495354","commenter_b":"Kick that racist bitch out.","commenter_a":"Socialist pig","post_message":"Stephanie Rawlings-Blake insisted that, in the last few weeks, she has “seen a lot of progress”--and by that, she meant tax dollars going to “recreation centers” and spending on schools."},{"comment_id":"650282881785927","commenter_b":"She is such a fool. And not even a human. She needs to be in jail","commenter_a":"Putin looks at Killary, like you are in way over your head old lady. Don't even try to match wits with me.","post_message":"Busted: Clinton News Network's \"Fact-Check\" Proven 100% False!"},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: \"I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.\" @webpagelink"},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"894646007249901","commenter_b":"Go home","commenter_a":"Shut your eyes or put a bag over your head !!!","post_message":"This is the real agenda of radical Muslims."}]
