[{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as \"scummy\" and a \"damn liar\" in a leaked email published on Friday by Wikileaks."},{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"\"The government believes it owns your body.\"  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"1632662777034101","commenter_b":"Hope she cheats on you!","commenter_a":"I did the same thing to my fiancee. I told her if didn't register to vote, I'd be mad. She did register. When it came the time to vote early, she feet - dragged. And I told her if you didn't vote for Hillary Clinton, our relationship would be over. She voted. Emails or no emails, Hillary all the way!","post_message":"\"If you didn't vote for Hillary Clinton ... I'll seize your phone, I'll seize the car.\"  Watch this mom's impassioned plea for her son to vote for Hillary Clinton."},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"1906450522914712","commenter_b":"Also, men have their own issues. To claim that MRAs are bad people is simply a generic shaming tactic often employed by feminists. Reminds me of the White feather movement...","commenter_a":"Pretty discouraged reading many of the comments to this post. Fellow Bernie supporters, it would be great if you stopped living up to the misogynist label Clinton supporters have put on us as a group. Piling on here to deny that the wage gap exists is not helping.","post_message":""},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."},{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"}]
