[{"comment_id":"10153464723413734","commenter_b":"Take that child away from these monsters! Do NOT allow him back in that \"home\"!","commenter_a":"That's the kind of monster that deserves the death penalty.","post_message":"#BREAKING news out of Maryland.  The mom's boyfriend has reportedly been charged.  More details as they become available."},{"comment_id":"10153025279926491","commenter_b":"What's the deal with communist people looking at all the post in this feed? Makes me wonder if they sent people like in Ukraine to start protest and eventually riots and killings. So far 5 have msg me and I've called their bluffs. Busted","commenter_a":"American Folks are in desperate need of a National Refresher course on the Civil War and American Reconstruction, so with that been said, let just stop framing the Confederate Battle Flag issue as a \"free speech\" issue and call it what it is, TREASON !!, and that's a fact jack","post_message":"Many still support the current flag."},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10153507892259203","commenter_b":"Figure out how to get guns from criminals. They won't follow the law and they the criminals are the problems. Use a little common sense. Let's fix places like Chicago were control is not working. Or do no lives matter.","commenter_a":"If you go by empirical data from countries with gun restriction laws to those that don't. ...it's a no brainer decision. ...gun control and restrictions DO work. The data shows less of these types of crimes. Does it completely stop gun related violence (where a gun was used to commit a crime)....NO. Does it lessen the chances of these crimes from happening. ..YES! Its been proven that there are less crimes where guns are used within countries with solid gun control laws...period. Every country that has gun restrictive laws and gun control is a prosperous nation whose avid hunters and gun clubs (shooting ranges) also prosper. Now if your argument and reason for no gun control is because you have the right to defend yourself...THEN you must also believe that the world would be a safer place if every country in the world had nuclear weapons to defend themselves... the ...","post_message":"Bill Maher blames right-wing media and Fox News for Charleston: \"They present a really twisted view.\""},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"10153882229389062","commenter_b":"Man she looks like a man!","commenter_a":"I don't think she got the memo.","post_message":"The 6 officers charged in Freddie Gray's death have been released on bail @webpagelink"},{"comment_id":"983233615058995","commenter_b":"Well, she is guilty and they are doing their jobs.","commenter_a":"Get obama to let the fbi to arest her","post_message":"“I think the bigger problem is not just the media, it’s the FBI.”"}]
