[{"comment_id":"10153737198202235","commenter_b":"Fucking dumb women.","commenter_a":"Carson will never be elected because the majority of American women will never vote for this clown","post_message":"What a horrible person he is. Just awful."},{"comment_id":"852403371522583","commenter_b":"Deport Europeans!!!","commenter_a":"deport them all...","post_message":"5,000,000 undocumented immigrants may be left in limbo..."},{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."},{"comment_id":"10154617717319255","commenter_b":"\"...ignorant and moronic assumption...\" \"...liberal mindset of free everything...\" I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"1750200585039682","commenter_b":"Wear a condom then you stupid, despicable woman","commenter_a":"Couldn't just let her be adopted.........","post_message":"What a horrible woman"}]
