[{"comment_id":"419169165087070","commenter_b":"@username nobody wants your Ukranian ass here either. Plastic bitch.","commenter_a":"People with Green cards and visas are also being denied access. So don't tell me it's about \"coming here legally\" This is a hate based act. Period.","post_message":"This significance of the court's ruling and the power of protest cannot be overstated.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"629306997259879","commenter_b":"Well listen up you stupid, IGNORANT BITCH! If your planning to remove the word BOSSY, well then you might want these words removed also. BOSSY,BITCHY, MOODY, HORMONAL, ON YOUR PERIOD, shall I say more. All these words have the same meaning. Of all people Michelle Obama, I believe that you've been quite the fucking BOSSY ONE lately so don't fucking start PREACHING your BULLSHIT TO THE AMERICAN PEOPLE. By the way BITCH you must not have anything to do and to much time on your hands to open your BIG FUCKING MOUTH ABOUT A WORD THAT HAS MICHELLE OBAMA WRITTEN ALL OVER IT. TELL YOUR BIGOT husband your pathetic issues.","commenter_a":"I vote to ban Michelle","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"10154150197679714","commenter_b":"It'll crack her make-up!","commenter_a":"Maybe they want to see you smile because they want to see you happy. Happy is a beautiful thing. It's not show me your boobs and make ME smile.","post_message":"So how should Hillary Clinton — or anyone — respond the next time it happens?"}]
