[{"comment_id":"10153312472421323","commenter_b":"Over kill..............","commenter_a":"It's a wonder the shells didn't bounce off the medals.","post_message":"Hyon Yong Chol, who heads the isolated country’s military, was purged and then executed by firing squad with an antiaircraft gun, watched by hundreds of people, South Korean media reported on Wednesday."},{"comment_id":"10153570672510667","commenter_b":"Are you kidding!? Heartbreak isn't legal punishment - she needs to be jailed!&","commenter_a":"This is horrific! My heart aches for the mother...I know they all should have had their seat belts on, but they were old enough to know this. I don't think the mother should be charged because she will relive this over and over and over and over again...it will haunt her for the rest of her life. God be with her.","post_message":"Three girls were killed and six others injured when an SUV carrying 11 people had a tire malfunction and crashed on I-95 in Titusville, Fla. @webpagelink"},{"comment_id":"624113881076675","commenter_b":"He's a freaking idiot!! Hitler reincarnated!! Good on Miley","commenter_a":"No, obama acts like that, lol","post_message":"Miley Cyrus is not a Donald J. Trump fan."},{"comment_id":"945163755529692","commenter_b":"The teacher needs the bag a brown bad cause she butt. Ugly","commenter_a":"What the hell","post_message":"An after-school elementary teacher is accused of putting a plastic grocery bag over a child’s head until he could no longer breathe: @webpagelink"},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"}]
