[{"comment_id":"10153684998979228","commenter_b":"Crime has gotten out of hand?? Thank you Captain Obvious.","commenter_a":"Should have been in Chicago to make St. Louis feel safe.","post_message":"St. Louis Mayor Francis Slay says crime in the City of St. Louis has gotten out of hand."},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"10153409489988010","commenter_b":"AIR COOLED vs. WATER COOLED. Not all motorcycles are designed alike. Bikes also have a tendency to overheat in higher/hotter temperatures.","commenter_a":"I've heard a common argument in favor of lane-splitting from motorcyclists that it's a necessary practice due to the lack of cooling on motorcycle engines. To avoid overheating, motorcyclists cannot sit idle very long as automobiles do. I've always wondered what the full truth is behind that.","post_message":"Motorcycle lane-splitting — the rush-hour time saver for bikers that enrages many drivers — may be poised for formal legalization."},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"}]
