[{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"1698524737097189","commenter_b":"Thanks gents for proving not only is the patriarchy alive and well, but it's also angry and ugly. Your mothers must be so proud.","commenter_a":"Just goes to show you no matter how powerful and important a woman is, men still feel that she is there for their entertainment and enjoyment, and they are entitled to direct her in her appearance and behavior. I'm pretty sure not one of them has said to Donald Trump or Bernie Sanders or John Kasich or Ted Cruz they should smile more, or made comments on the tones of their voices. They respect male candidates and don't see those things as important to a good male leader. But a woman leader? She has to be twice as qualified as the men to be considered competent, and has to be constantly critiqued on elements only seen as important to women: posture, poise, attitude and looks. I'm glad these neanderthals are being called out on their sexist tweets. But this is only the beginning. The ultimate glass ceiling is about to ...","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"581929555264971","commenter_b":"They need to be sent back to their own country, period! !","commenter_a":"I am getting to the point I really do dislike the new media, they are a bunch of useless asses","post_message":"The city of Twin Falls first made headlines when Muslim migrants sexually assaulted a five-year-old. Now another sex crime, this time against a disabled girl, has rocked the community. You won't see this story in the mainstream media."},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."},{"comment_id":"1034922753266951","commenter_b":"Dumb bitch","commenter_a":"Sarah Palin humiliates herself every time she opens her mouth. Do us all a favor - shut up.","post_message":"She just picked the WRONG fight."},{"comment_id":"337708566573297","commenter_b":"Trimp for president......HOW SCARY IS THST IDEA !!","commenter_a":"Vi a una persona que se preparo para el debate asi como se ha preparado para ser presidenta del pais. Por otro lado vi a un empresario que oculta sus deudas, que ha hecho su fortuna estafando a mucha gente.","post_message":"Donald J. Trump says he did President Obama a favor by being racist."}]
