[{"comment_id":"10155089338768984","commenter_b":"AND WHY SHE NOT IN JAIL.","commenter_a":"Seat her in the last row.","post_message":"The Clintons' plan for President-elect Donald Trump's inauguration were just revealed, and it's leaving everyone speechless."},{"comment_id":"10153930448466323","commenter_b":"And you are a very unattractive white woman","commenter_a":"She is a fat, untalented negro who should have made the best political statement by boycotting the super bowl... It's disgusting that stupid entertainment pays people so much while so many are suffering... My husband saves lives for a living and paid way more for his education than any of those people and makes a fraction of what they do... All of them disgusting","post_message":"\"This is not some sudden awakening for Beyoncé – she has given millions to the homeless in Houston, her home city, she and her husband Jay Z have bailed out Black Lives Matter protesters in Ferguson and Baltimore. But now she is moving this highly visible assertion of identity centre stage. Her blackness, her femaleness, her pride, her politics, are not some kind of mysterious subtext.\""},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"872563469430677","commenter_b":"2 delightful trolls. Get a life, ladies.","commenter_a":"militant? Lets be honest: muzlim terrorists/murderers","post_message":"A policewoman was killed in a shootout in southern Paris, triggering searches in the area as the manhunt widened for two brothers suspected of killing 12 people at a satirical newspaper. Read more: @webpagelink"},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."},{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that \"The Matured Feminine Approach\" (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."}]
