[{"comment_id":"861219497357519","commenter_b":"Natalie, that is wrong. His opinion absolutely matters. Knock it off. Francisco, if you want to discuss this rationally, you'll have to like my comments so I know you've replied, no notification on a public post for me. Don't worry about the trolls. If you wish to have an objective conversation, I'm game.","commenter_a":"Chanting that you are going to make America great again is pathetic it's not the leader that makes America great it's the people that's why the revolution war was fought this country will always be a country of immigrants from all over the and we are who make America great not a \"leader\" in search for power claiming that he will make America great","post_message":"MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10153460771654575","commenter_b":"Ian Gibson watch the video. Youre screwed.","commenter_a":"Lol this is news?","post_message":"What does your birth month reveal about your health?  Researchers who compiled the birthdays and medical records of patients found that people born in May are the healthiest. People born in October might be at the highest risk for contracting diseases."},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"\"Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."},{"comment_id":"10152871258752411","commenter_b":"Tradition in high school sports.....especially football.........Give it a rest already!","commenter_a":"Lol omg. To all these people saying how mean it is. It's called having a sense of humor. It's awesome. And I'm SURE the neighborhood helps him clean it up;) relax;)","post_message":"ANYONE NEED TOILET PAPER? Coach Q's house was TP'd after Chicago Blackhawks Stanley Cup win.  Full story: @webpagelink"},{"comment_id":"735467686595927","commenter_b":"Immigrants are welcome here. Illegal aliens are not.","commenter_a":"I'm very proud of my family's race. I'm white my stepfather is Mexican and he's from the states my grandparents are from Mexico so I believe that they have the right to come to the United States and make something out of yourself and y'all want to say here and criticize them being immigrants and using us for money when they're the ones that will work harder than any other people . So as I was raised this post be a free country and we supposed to love each other not hate each other and be there for each other. But with everybody with all this hate and everything yeller going to regret it because the day that you have to go and speak to the heavenly father is the date you're going to have to answer for how your reactions are everybody should be equal. So I'm very proud ...","post_message":"Live from Donald Trump protest in River Oaks: coverage all day on Eyewitness News"}]
