[{"comment_id":"1851225291776966","commenter_b":"well said ,","commenter_a":"Trump's Victory, in another term (American people's Victory) has proven that the good citizens of the USA are great at determining their future, and changing the game and the whole regime for a better living and even world because America has a big influence on the whole world. Despite the massive media war that had been trying and pushing hard to find a way to put Mr. Trump aside or down to fail him by any dirty politics, means and ways... BUT they couldn't do you know why? Because he is capable and honest and most of all I believe that the church of humble believers everywhere have had an input in this victory asking the Good Father for this amazing nation to shine His face upon America again as He did in the past...!","post_message":"Former President George W. Bush had this message for President-elect Donald J. Trump."},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"10155058445841509","commenter_b":"Well shoot - if Queen says no to him, how dare he run for President...lol - let the woman with the impeached husband take over!","commenter_a":"Not only was part of Melania Trump's speech plagiarized (word-for-word) from Michelle Obama... Also...Both the guitarist and the record company for Queen refused to authorize Trump Inc (and all political groups) to use their song \"We Are The Champions\"...but of course that boundary was disrespected by Trump. Is this a Prank Show ??? THIS is stranger than fiction. When are they going to say: \"Ta-Dahhh!!! Y'all just got Punk'd!!!\"","post_message":"JUST IN: Speaker Paul Ryan announces Donald J. Trump \"has been selected as the Republican party nominee for President of the United States.\" @webpagelink"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."}]
