[{"comment_id":"1573634599333254","commenter_b":"I know smh that's it I'm looking for new locations tomorrow","commenter_a":"@username Eder Marure","post_message":"A drive-by shooting left 1 person dead on Cypresswood Drive on Monday night."},{"comment_id":"10153830223561756","commenter_b":"why were they refugees and not called migrants... humm good for the goose good for the gander..","commenter_a":"Thank you for calling them migrants. The \"refugees\" stayed in Turkey, Greece, Lebanon etc. The ones migrating all the way to Germany - some 10 countries' borders away! - are economic migrants who risk their and their poor kids lives to get to the country with the highest GDP and best social services about 2,000 miles away. Hungary has had enough of them coming through, demanding food and services all the while disrespecting Hungarians laws and badmouthing the country. Enough! Go around or go back, Hungary has no interest in catering to this group, the country has enough problems already with unemployment etc. Watch this video, Hungarian cops trying to disperse food and drinks to migrants and refugees: @webpagelink","post_message":"The scene at at least one processing area in southern Hungary is starkly different from recent days. Aid agencies are dismantling huge tents. Cleanup crews rake trash into piles.  Migrants who slept in a cornfield here for days have been bused to the Austrian border. The Hungarian border is now closed."},{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"665938460232774","commenter_b":"heard it thinking it wouldn't be thattttt bad, me after: ok he's officially a pig","commenter_a":"Jasmine","post_message":"\"When you're a star they let you do it.\" -Donald J. Trump"},{"comment_id":"667824530017395","commenter_b":"THROW them out of the country after incarceration. This disgusting behaviour does NOT belong here","commenter_a":"Yet no justice for the douggler girls.......","post_message":"GROSS."},{"comment_id":"10153750072683352","commenter_b":"Or she was a trashed up slut waiting to get picked up by anyone..","commenter_a":"She was probably a law abiding citizen he only calls felons and degenerates","post_message":"‘We’ve not heard a word': Relatives of woman shot dead on San Francisco pier criticize Obama for not contacting them as they demand tougher immigration laws"}]
