[{"comment_id":"1142484579135691","commenter_b":"It will recover","commenter_a":"Guess what the pound is at a 31 year low at the moment, figure out for yourself what will happen to your economy in about an year, idiots.","post_message":"\"And we'll have done it without a single bullet being fired\" - Nigel Farage @webpagelink #EURef"},{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"10152930337971749","commenter_b":"Gramma Cankles will NEVER be President...","commenter_a":"Can't wait for Hilary. All the brain dead idiots heads will explode.","post_message":""},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"891987007503062","commenter_b":"Death row for that bitch!","commenter_a":"DEATH!!!!!!!!!!","post_message":"The trial has finally started for this officer, after witnesses say they saw him pull out a knife and slit the dog's throat open, even though the dog was already restrained.  If you were the judge in this case, what would you sentence him to?"},{"comment_id":"10152997147654411","commenter_b":"All the western puppets are traitors,DIVIDING AND CONQUERING USING IMMIGRATION AS A TOOL TO PUT THERE SOCIALIST POLICIES THROUGH.","commenter_a":"wheres ya burka merkel,traitor bitch","post_message":"Angela Merkel has accused leaders of Pegida anti-Islamic movement, which is gaining popularity in Germany, of hijacking the slogan of 1989 Berlin Wall demonstrations,  sind das Volk ( are the people) for their xenophobic purposes."}]
