[{"comment_id":"997480703647380","commenter_b":"Give me a break already,sick & tired of catering to immigrants thy don't need holidays,they need to be deported Muslims & Illegal Mexicans.","commenter_a":"It will be great when Obama change s his address to any o","post_message":"WHITE HOUSE CALL PARTICIPANTS: Want To Change This Holiday to  Immigrants Day (VIDEO)  @webpagelink"},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"933345140100891","commenter_b":"Linda Farrell, do you really think that the lying millionaire has a clue or even care about our struggles? Putting her in office gives 4 more years of Obama , open borders and 65,000 more refugees in our country! It's called NEW WORLD ORDER look it up! I'll take the skittles and America the way it was! And yes I am women TRUMP 2016","commenter_a":"Hell no","post_message":"Do you want to see the Trumps become America's next First Family?"},{"comment_id":"1082304031883694","commenter_b":"@username \"butt hurt\".... It is a comment about grammar.","commenter_a":"What is a \"one and three chance\"? Does that mean we will get hit with four storms? The spelling and grammar people are nonexistent in the media these days.","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10156327050085725","commenter_b":"A HUUUUUGE WALL. the next 11 months are gonna be a nightmare. Get in there and fix it asap donald trump. Please","commenter_a":"Caught and turned themselves in are two different things.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"1830025417217655","commenter_b":"Maybe he was looking at her pussy to grab it.","commenter_a":"Maybe he needed help figuring out how to fill out the ballot","post_message":"LOL!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""}]
