[{"comment_id":"898217656867757","commenter_b":"That dress >>>>>","commenter_a":"She looks absolutely stunning~","post_message":"And finally Miss Viola Davis! #HTGAWM #Oscars"},{"comment_id":"1319359411443456","commenter_b":"LOL...she needs to put her fake boobs away....","commenter_a":"Totes newsworthy!","post_message":""},{"comment_id":"10152774860755927","commenter_b":"Is this wife beater and Obama DNA guzzler still relevant?","commenter_a":"The question is does Reid understand the U.S. Constitution? He should not try and put pressure on the Supreme Court. Reid is a pathetic old ugly man. He is mean and unhappy in life. Can't wait till he is standing before his Maker. Won't be a pretty sight for sure","post_message":"WATCH as Senator Harry Reid maligns the U.S. Supreme Court on forthcoming Obamacare decision "},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"979192058784862","commenter_b":"LOL! You are So Silly. That Will Be The Last Win For Cruz in The Primary elections now. There is NO way Cruz can Get Anywhere Near The Delegates Trump Has and after the Next 5 elections all in the Northeast Where Trump Will Win In a Landslide, Cruz is Now Done!!! BYE BYE LYIN TED!","commenter_a":"thanks Gov. @username for endorsing Ted Cruz! I always respected you and prayed for you when all those protesting liberals gave you a hard time. and I don't even live in Wisconsin. we are 741915279236631s and we do need to pray for each other. 2 chronicles 7:14.. prayer does help!. Congrats to Ted Cruz for a great win. thank you Lord!","post_message":"Thanks Wisconsin for showing that common sense conservative leadership is valued! #TedCruz"},{"comment_id":"10154080413671162","commenter_b":"You must be a star chaser or useless female cop.","commenter_a":"What a bunch of ignorant aholes....do me a favor and NEVER CALL THE COPS to help your pathetic selves...none of you are worth it....all loser thug scum bags","post_message":"Police say they were trying to pull a car over when it smashed into their patrol SUV in the Loop."},{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."}]
