[{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out \"Purple Rain\" amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"},{"comment_id":"10153979603521509","commenter_b":"Time for all illegals to go home","commenter_a":"Rather have trump in kkk then black panther party","post_message":"Former Ku Klux Klan leader David Duke said Donald J. Trump is the \"best of the lot\" -- but didn't endorse him for 2016: @webpagelink"},{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."},{"comment_id":"843581439108369","commenter_b":"I hope God rolls videotape. I HAVE to see this evil bitch explain this at Judgment Day.","commenter_a":"I hear a lot of people saying that abortion should be legal in rape cases. I tend to disagree. We shouldn't punish an innocent baby because of the sins of the father. I mean how many of us would be here if we were punished for the sins of our mothers and fathers?? Murdering your baby doesn't make you any less raped. My opinion is the morning after pill should be available with every rape kit.","post_message":"What the hell is wrong with this woman?"},{"comment_id":"10153245617818908","commenter_b":"So, let me get this straight, a man with his foreskin is unhygienic, but a woman with her parts all tucked away inside is hygienic? How does that logic make any sense? It's called basic hygiene practices. FYI, as men age (much older) their penis could fold inside of him and it will need pulled out to keep clean. This could be the issue your Family member was talking about. It's no different than when you wash your own genitals.","commenter_a":"I have 3 boys and all are circumcised. As a person that has family in the medical field it's for cleanliness when they get older. My mother worked in a nursing home and she has horror stories from having to bath uncircumcised men. It's gross not to be. Infection and bacterial growth is more common if the foreskin is still intact","post_message":"Why do Americans go out of their way to remove this part of human anatomy, when the rest of the world does not?"},{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"}]
