[{"comment_id":"10153160211535950","commenter_b":"No shame on you for not thinking outside the box, you are a ver naive women","commenter_a":"Why do people think that only adults can die of natural causes?? accusing them of covering something up is truly sick. Shame on you.","post_message":"YouTube star Caleb Logan of the Bratayley family died suddenly at age 13, his mother confirmed: \"This has come as a shock to all of us.\""},{"comment_id":"10153964436169705","commenter_b":"@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"406947019493592","commenter_b":"Another ride, but this time take obummer out","commenter_a":"Good for them!","post_message":"Enough is enough for these bikers..."},{"comment_id":"10155379093015354","commenter_b":"This is why we need to deport these criminals. The illegal aliens are all criminals. They broke the law and came into our country uninvited. Deport them.","commenter_a":"obozo lied and innocent people died. Any questions? Criminal aliens are WMDs. How many must die before obozo and his minions are held accountable?","post_message":"This story has it all."},{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."},{"comment_id":"10154496276031636","commenter_b":"Women are only carriers? What a disgusting mindset to see an entire sect of humanity as subhuman. For the record, men can vanish off the face of the earth tomorrow and humanity will still survive.","commenter_a":"What a sad sight to watch, so many people fighting for the right to kill there own children. Children are the children of the Father. Man can make babies with artificial overs, in a tube, but women can not have babies without a man's sperm, woman are only carrers, all children come from there father first. Maybe instead of worrying about having aborstions, we worry about the decay in society which cases the need for them in the first place. We must raise our standards.","post_message":" intent is to try to put the fathers in the process. My bill would stop the abortion if the father does not agree to the abortion."},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."}]
