[{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."},{"comment_id":"10153031134771051","commenter_b":"She should have kicked on his teeth. What an asshole.","commenter_a":"And a bunch of guys rush over to help HIM? Whee were they when she was defending herself?","post_message":"This waitress walked over to give a customer the bill. That's when he decided to grope her. Bad move."},{"comment_id":"1751343418429993","commenter_b":"Bernie is to old and senile to be president. He would die in office.","commenter_a":"Your opponent is wishie washie she says what you want to hear","post_message":"I voted against the war in Iraq and I am vigorously opposed to an endless war in the Middle East that cost us trillions of dollars. What I am for is making sure that higher education is a right and ensuring that every American can go to college without living in debt."},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"10153547660103854","commenter_b":"Hates those who serve. Loves the illegals","commenter_a":"Scum of the earth","post_message":"ULTIMATE BETRAYAL: Obama To Cut Healthcare Benefits For Active Duty And Retired Military"},{"comment_id":"1659698577423598","commenter_b":"she is just cheap fat trash...who cares?","commenter_a":"Get off whatever you are on Mariah!","post_message":"... Oh my god...  I had no idea this happened."}]
