[{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."},{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"},{"comment_id":"10153852384658822","commenter_b":"Women wanted equal treatment in the military.. This makes them a little more equal. Be careful what you wish for you just might get it","commenter_a":"I had 3 sons and they all registered when they turned of age. I would have not wanted them to go but if I had a daughter which I don't I would not want her to be drafted and put in the position of getting captured. It is bad enough what they do to men when captured you can imagine what they would do to women before doing to them what they do to men. I do now have a grand daughter and a grandson. I hope neither of them ever have to go thru a war. I also hope everyone else's kids don't either.","post_message":"The Senate voted this week to require women to register for the draft.   What do you think of the change?"},{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"825939240815639","commenter_b":"Us as well!!!!! IF people do not want the AMERICAN FLAG, THEY SHOULD GET THEIR BEHINDS OUT OF AMERICA......PERIOD!!!!!!! Jo","commenter_a":"Fidiots, this is America, the laws they are SUPPOSED to enforce are AMERICAN laws. I'm so tired of the constant assault on my flag and my country.","post_message":""},{"comment_id":"10153847161829203","commenter_b":"He probably didn't know the virgins are 20 year-old males who still play Pokemon.","commenter_a":"Enjoy the virgins, shithead.","post_message":"CONFIRMED: Paris Mastermind Dead"},{"comment_id":"666544360165278","commenter_b":"@username, Mexico has a wall on their Southern Border and they swear it has dropped the amout of illegals in their country from Guatemala by 2/3rds. That's 66% less illegals if you can't understand what 2/3rds is. And No, Mexico can't do us more harm, only our Politicians like Clinton, Johnson and Stein can. Don't let them give America away.","commenter_a":"Sadly, we have become a society where protecting borders is not even an issue. It must be done because of the outside terrorists. Then our people could concentrate efforts significantly more on internal ones. I cannot believe I just wrote that. Trust in God.","post_message":"Truth."}]
