[{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"},{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"1044742995559452","commenter_b":"Na lock her up n throw away the key, dont need her back in society","commenter_a":"Thanks for posting 3 separate mug shots of a clearly mentally ill person to parade her in front of your audience. Maybe you can sensationalize more Halloween hoarder homes while you're at it. I am glad Nickcole Dykema didn't actually hurt any Deputies (and she most likely could have, ambushing them in her own home like that), and glad the Deputies didn't kill her. This is a lesson for Police dealing w/ the mentally ill everywhere. I do hope this woman gets access to proper mental healthcare, and that through treatment she can find her way back into the world with peace and dignity.","post_message":"Multiple deputies received injuries at the \"house of horrors\"   From removing weapons from the \"booby trapped\" home"},{"comment_id":"1648860662067713","commenter_b":"Why doesn't that useless cunt step in front a speeding train??","commenter_a":"Rosie O'Donnell is against guns, but it's ok for her body guard to carry one to protect her!!! Crazy!!","post_message":"YES!  This is why we love you Tom Selleck."},{"comment_id":"10154336245354740","commenter_b":"Sheep not waiting for facts to fully come out.","commenter_a":"Notice when blacks are killed by other blacks the liberal media, Democrats, Obama, Sharpton, Jackson, Black LIED movement etc don't think twice nor make a sound","post_message":"Hundreds of people marched through the streets Thursday to protest the recent officer-involved shootings in Minnesota and Louisiana."},{"comment_id":"1511171265602298","commenter_b":"The Swiss do not have to do anything any muslim may demand! These muslims making demands that is not their place.Who the hell do they thik they are, they leave their land and move unwanted into another and they make demands? Sorry bacon lovers that is all the world will offer you. take it or leave!","commenter_a":"Works for me ?!... what hat ?!!!........ @webpagelink","post_message":"Ridiculous!"},{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"}]
