[{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"10153238696686813","commenter_b":"@username Oh yea you and and stupid California is a payer State... you dumb asses pay twice as much to live in pollution surrounded by painted hills of immigrants. You people have made mad bank off the backs of Immigrants, thus the reason you want more. Dumb Blonde wow, I thought that was a cliche!","commenter_a":"The people of this Country are tired of being worked into Slavery to merely exist... The continuous need to help outsiders with no regards to the effects of the US Citizens that do not need anymore competition for jobs and affordable housing is Un-Patriotic and a spit in the face to every working class American and their children and grandchildren. We are asking the Federal Government to listen to the People's request but they are blatantly ignoring and denying our request to stop this invasion. Anyone that stands for the Big Federal bully tactics should go down with them when the Civil unrest begins.... It's coming, just wait for it! There are far more Citizens on this land than the Police, Military and Government goons combined! KEEP POKING THE BEAR! NO REFUGEES OR IMMIGRANTS are Welcome here don't you get it.... Take your ass to California and mooch off the ...","post_message":"GOOD NEWS: Court denies Texas motion to block Syrian refugees, and finds Texas unlikely to win lawsuit.   “There is nothing in the law that gives the state veto power over any decision of the federal government or permits any state to discriminate against certain refugees based on their nationality, in fact the law says just the opposite,\" said ACLU of Texas’ Rebecca Robertson. #refugeeswelcome #allfaithswelcome"},{"comment_id":"10155429913146509","commenter_b":"But his enabler wife is","commenter_a":"Supporting a blatant sexual predator. Nice. And btw bill is not running for office","post_message":"House Speaker Paul Ryan said he will no longer defend Donald J. Trump, but he did not say whether he'd reverse his endorsement of the GOP candidate."},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":""},{"comment_id":"10154473534223812","commenter_b":"@username a female misogynist is what you are","commenter_a":"there are many good women in politics - not Hillary or Elizabeth Warren however.","post_message":"JUST IN: Elizabeth Warren endorses Hillary Clinton for president. Clinton is not ruling out the prospect of having her on her ticket as vice president."},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"}]
