[{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"\"This is what happens when you f*** with mother Syria all of your blood will be spilled.\""},{"comment_id":"10155121941959614","commenter_b":"Over that wall!","commenter_a":"This is how Normal Americans see trump n trump supporters.","post_message":"Far from targeting only  hombres, as Trump has said repeatedly, his new order allows immigration agents to detain nearly anyone they come in contact with who has crossed the border illegally.  People could be booked into custody for using food stamps or if their child receives free school lunches."},{"comment_id":"10153409124091955","commenter_b":"End and rescind birthright citizenship, build the wall, kill el shorty, deport the stragglers.","commenter_a":"kinda gives credence to Mr. Trump's assertions on illegals huh","post_message":"EL CHAPO WARNS TRUMP TO SHUT MOUTH"},{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"},{"comment_id":"702518316605413","commenter_b":"What is wrong with these kids???!!! They're turning into barbarians! Totally unacceptable!!!!","commenter_a":"Now the parents most likely were at the welfare office getting stamps like all the other unemployed shit they can't flip a burger over that's too hard","post_message":"Three students were arrested yesterday at William Allen High School In Pennsylvania.  Other students stood by and watched as they did this to her. Will you pray that this officer will be ok?"},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."}]
