[{"comment_id":"10156672074140725","commenter_b":"Americans have done that stuff for years. Illegals do it cheaper because they work under the table and cause greater unemployment and then somehow get welfare!","commenter_a":"hey stupid Donald trump if you stop immigration who will work on the farms or will clean the bathrooms , American people won't do that stuff , think on what you are saying trump","post_message":"WOW! THANK YOU Atlanta, Georgia! LETS MAKE AMERICA SAFE & GREAT AGAIN! Heading to Nevada- now!"},{"comment_id":"1147435038611171","commenter_b":"Really then why are they successfully managing to pay this in states,who have adopted the 15.00 an hour wage. Stop the lies. The people on top are only concerned with their grossly extravagant life styles. It's time to say enough is enough! No one is buying this line of crap anymore pay people a damn wage they can live on!!","commenter_a":"just read poll conducted....sample of just over 3,000 small business owners with 25 or less employees.....67% said they would sell out if could receive a purchase price of 20% loss of amount of capital invested.....wow.....would sell out if offered 80% of capital investment, going concern.....\"going concern', a reference to business in operation.","post_message":"He doesn't say it but a $15/hour minimum wage will crush many restaurants. Even higher end restaurants."},{"comment_id":"10155098907990329","commenter_b":"I'm always grateful to be corrected, especially when someone is able to be patient with me even though I'm not owed it :)","commenter_a":"My family has been calling this season's theme \"A Haunting\" because of the reenactments and stuff. I like the season so far but guys, what happened to the people of Roanoke really isn't that big of a mystery. Most likely after part of the group left to get supplies more colonist died from a mix of starvation and attacks. They then most likely moved to settle with the Croatoan tribe for both help feeding themselves and protection. It also helps explain the upsurge in Croatoan children with blonde hair or other features that are rare, though not unheard of, in their genetic pool. Basically, your elementary school teacher lied to you. Other lies you learned in history class: the Mayans didn't just mysteriously disappear. They over farmed the valleys they lived in and could no longer continue to occupy large cities and began living in smaller groups. They're are still ...","post_message":"Mind blown. // American Horror Story"},{"comment_id":"843581439108369","commenter_b":"I hope God rolls videotape. I HAVE to see this evil bitch explain this at Judgment Day.","commenter_a":"I hear a lot of people saying that abortion should be legal in rape cases. I tend to disagree. We shouldn't punish an innocent baby because of the sins of the father. I mean how many of us would be here if we were punished for the sins of our mothers and fathers?? Murdering your baby doesn't make you any less raped. My opinion is the morning after pill should be available with every rape kit.","post_message":"What the hell is wrong with this woman?"},{"comment_id":"10154331327221320","commenter_b":"Sounds like Jane is drunk. See Jane get drunk.","commenter_a":"The Dad was making a legal turn on red. The child didn't understand that this was a legal thing to do. I know plenty of kids who have become upset, because their parents take a sip of a soft drink while driving. They take \"don't drink and drive\" literally.","post_message":"A little boy rats his dad out to 9-1-1. Listen to the call: @webpagelink"},{"comment_id":"461391564049150","commenter_b":"Well Paid Bitch","commenter_a":"Not surprising, have you listened to her for more than a few minutes? Not impressive to say the least. Where do they find these people?","post_message":"Donald Trump’s national campaign spokeswoman turns out to be a sleazy welfare cheat and conspiracy theorist."},{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."}]
