[{"comment_id":"10154328122239641","commenter_b":"Right after you @username..... she will right after you.","commenter_a":"I hope Hillary drops dead before November.","post_message":"BREAKING NEWS: Donald J. Trump comes out of the Republican convention ahead of Hillary Clinton in the polls."},{"comment_id":"538972829636804","commenter_b":"Stupid lady","commenter_a":"I don't anything about this conflict, and it seems like this woman is being pretty rude. However, it is also true that anyone living in this country should be speaking English in their public lives.","post_message":"\"Speak English, b****. It's America. Put me on YouTube.\"  What starts as an argument over a dog quickly escalates into a vicious tirade about language, nationality and entitlements. Now this parking lot rant, seen by millions, is quickly going viral. Why it's touching such a nerve. @webpagelink"},{"comment_id":"1265496813476971","commenter_b":"Angry black priviledged woman.","commenter_a":"He likes ugly women , that's as close to nice as I can get.","post_message":"People say during the #Christmas season I should say something nice about Obama, so I wrote Michelle to see if she can think of anything..."},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"1187041288042639","commenter_b":"How is she even allowed to run for president with all of this disgrace","commenter_a":"They all need to be arrested clean the White House and all the corruption--- this needs to be done ASAP","post_message":"In response to the revelations about the pay-to-play scandal tied to former Secretary of State Hillary Clinton non-state.gov email system and the Clinton Foundation, Judicial Watch announced that it will host an educational panel discussion:   Scandal Update  Emails and the Clinton Foundation.  Panelists include author of the New York Times best-seller Clinton Cash and President of Government Accountability Institute Peter Schweizer; Joe diGenova, former U.S. Attorney, Independent Counsel and founding partner of the Washington, D.C., law firm diGenova & Toensing; and Chris Farrell, director of investigations and research at Judicial Watch. Moderator will be Judicial Watch President Tom Fitton.  [for higher volume touch sound icon on screen  ]"},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"}]
