[{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"},{"comment_id":"10154725073385935","commenter_b":"So many silent racist ppl out there that voted for him. It's so sad","commenter_a":"That's what you think you orange buffoon!!! #FuckTrump #Resist","post_message":"President Donald J. Trump says his executive order banning immigrants from seven Muslim-majority countries is \"working out very nicely.\" @webpagelink"},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."},{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":""},{"comment_id":"535720006552593","commenter_b":"There's a hot, firery place in hell waiting for this bitch!!!!","commenter_a":"Thank God they found them.","post_message":"A woman in Texas is charged with child abuse after police find two toddlers tied in the backyard of a home, and six other children, ages 10 months to 13-years-old, alone inside. Disgusting."}]
