[{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"10154082308022293","commenter_b":"Perfect boot lickers. Masters proud of you idiots. More dumb girls.","commenter_a":"I'm sure you liberals celebrated their death too.","post_message":"The discovery of two Catholic nuns found slain in Mississippi on Thursday sent shock waves through their rural community."},{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."},{"comment_id":"1263988416963489","commenter_b":"@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"971423549572732","commenter_b":"Girl, is there any other?","commenter_a":"Dukes!!","post_message":"FOLLOW UP: We asked this morning about whether you like banana and mayonnaise sandwiches….if you say YUM, what mayo are you using?"}]
