[{"comment_id":"10152619754670950","commenter_b":"So than move Israel and let him be your leader, see ya, we don't need ya!!","commenter_a":"The only backlash is from the white house... I welcome him anytime.","post_message":"Israeli PM Benjamin Netanyahu is going forward with plans to speak to Congress next month @webpagelink"},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"10157525764140293","commenter_b":"These people need to back off, no one understands the loss of a child much less one that is missing and not knowing if the child is alive or dead...this is their way of dealing...let them alone..","commenter_a":"I can't imagine how you go on with the uncertainty of their situation. The banner isn't hurting anything. Empathy is what's needed here.","post_message":"FEEDBACK: The parents of a child that's been missing since 2011 just want her back, but their plea is apparently someone else's eyesore.  What do you think about the way this is being handled?"},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : \"The Republican nominee is unfit to serve as president.\""},{"comment_id":"10153248558026336","commenter_b":"Is eating pussy a sin??","commenter_a":"Just absolutely heartbreaking. So glad their little one survived. Prayers for all involved in this devastation.","post_message":"Melissa and Michael Mooneyhan died shielding their young daughter from a tornado in Arkansas. The girl, who is about 18 months old, survived."},{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"}]
