[{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"422988511194831","commenter_b":"Drunk girl not girls","commenter_a":"How is a drunk girl gonna pull out her gun and shoot if she is passed out?","post_message":"Everytown for Gun Safety: “By saying that guns will prevent rape, they’re putting the burden on the victims.”"},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"10153123956077452","commenter_b":"🇺🇸😇❤️","commenter_a":"Jose","post_message":"BREAKING NEWS: A Marine has been found dead with a gunshot wound to the head at a shooting range at Camp Pendleton Marine Base."},{"comment_id":"10153179398831051","commenter_b":"I wouldn't make my daughter wear a sign as punishment. I would just give her a spanking.","commenter_a":"I like it!","post_message":"This is how a dad decided to punish his teenage daughter. Good idea or bad idea?"},{"comment_id":"10153825599556770","commenter_b":"Crooked Hillary's campaign is doing what they do best, and that is to take the focus off of her current health problems and turn the attention on to what Mr. Trump said in 1996 about a pageant queen. What's even more troubling is that the media is in their back pockets, treating her like she just won the presidency, while slamming Mr. Trump! Sorry, but who was it again who had 33,000 emails wiped from her private server using BleachBit that can never, ever be recovered? Who was it again who had staffers destroy their Blackberry phones with hammers? Who was it again who blatantly lied to the FBI? Who was it again whose \"key witness\" staffers were given amnesty from testifying? Who was it again who called tens of millions of Americans deplorables? And, of course, the list goes on and on and on! Isn't it amazing how crooked ...","commenter_a":"This is coming from a man who paraded his mistress around the city and let his wife be the last one to know he was divorcing her...he has as much room to talk about Hillary and Bill as Trump does...","post_message":"Former New York City Mayor Rudy Giuliani has some harsh words for Hillary Clinton."}]
