[{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"976666089019811","commenter_b":"You're all correct....but the easiest clue is the shadows on the stairs. Show the cat is clearly going down.","commenter_a":"down, the trim and the lip on the edge of the stair confirms that.","post_message":"No dress or Llamas in this morning's big Internet debate ..."},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"602469266610319","commenter_b":"Your 15 mins of fame is running out!","commenter_a":"She needs help, yes.","post_message":"Sarah Palin was just hit with a massive curve ball, she needs your help.  This is horrible, we love her. Let's show her we have her back.  Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."}]
