[{"comment_id":"970311343085644","commenter_b":"Sick perverted inbred barbarians!!","commenter_a":"He'd get a face full of beer then we take it from there.","post_message":"We were drinking at local brewery in Dripping Springs last Sunday. I DARE these little hajjis to try THIS crap @ that establishment. What would YOU do? @webpagelink"},{"comment_id":"10153935429529726","commenter_b":"That motherfucker is insane. Period.","commenter_a":"It couldn't be her dishonesty and lack of personality.","post_message":"WATCH: Howard Dean: Sexism to Blame for Hillary's Communication Problems"},{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"},{"comment_id":"10152746929711167","commenter_b":"Name a lie, Grace? You've apparently chosen to forget the lie about \"sharia no-go zones in France!!!!\" that Fox had to retract. Of course you forgot it--you wipe your brain before turning on Fox News, don't you?","commenter_a":"You've got to love the weasel attempt by the corporate media to create a special category of \"non-journalism journalism\" for Fox News and Bill O'Reilly, whereby they get to brag about being \"Fair and Balanced No-Spin Zone\" news reporters and join the White House press corps, but get a free pass to lie to their audience.","post_message":"Normally, you can't get this many Americans to agree what color the sky is."},{"comment_id":"10156714822180354","commenter_b":"I'm with you Francesca ! Beyonce is just trash !","commenter_a":"That was beautiful and classy from Lady Gaga. I will NOT be watching trashy Beyonce.","post_message":"Lady Gaga's performance of the National Anthem at the #SuperBowl lights up social media.  WATCH:"},{"comment_id":"10153198594904342","commenter_b":"Really!!! Fix the F***** System. And make her suffer for what she did. Why let her out?","commenter_a":"If that's the case, then let her go 3 or 4 days w/o food. Just give her nothing but Water, and/Gatorade/Powerade. The Human Body can go 3 or 4 days without food; just not Liquids. The Human Body, can run off it's Reserves, If We have Excess weight, don't worry. You'll only feel hungry for a little while, then whenever Our Body's stop growling; that means, that your Body will start Eating off it's reserves.","post_message":"A story working on for Eyewitness News today -- a Houston mother is facing multiple charges on allegations of child abuse.  Investigators say her son  \"like a prisoner of war who had been starved.\"   @webpagelink"},{"comment_id":"10153869230258352","commenter_b":"Wtf? The sorry bitch nees LIFE!","commenter_a":"i think life without parole is better","post_message":"Mom who gave her baby methadone ‘to help her sleep’ and killed her will serve up to 30 years in prison"}]
