[{"comment_id":"10153040566066051","commenter_b":"WTF.. This bitch don't deserve to be a mom I'm glad they arrested her she needs to fry","commenter_a":"I should hope so!!!!","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"951268851580640","commenter_b":"Nadia: You must one miserable bitch in real life. you have the nerve to pretend to know Shannon well enough make the unfounded assumptions you just made. You have no idea what her function at Walmart even is yet you make this idiotic comment. Let me guess, you hate YOUR job and so have this need to crap on others? Her simple point was that it's a myth that all Walmart employees are on or qualify for foodstamps. Keep on hating and being ignorant!","commenter_a":"I have worked at walmart for ten years. I don't even qualify for wic because I make too much money! And with my first baby on the way I could have used the assistance. Not every single walmart employee is on food stamps. Oh and I also bought a house, got a nice car, all while working there....crazy","post_message":"That's a one cent difference, folks. Only *one* cent.  Many thanks to Slate.com for the image (and the facts)!"},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"665156860339272","commenter_b":"@username God loves Christians and hates all other religions..... Look at how God backed the Christians when they slaughtered 100 million native Indians because they foolishly loved their land and their own spirits, not accepting Christ as the son of God..... so, they were slaughtered... but, they told the men not to waste the ammunition on the women and kids, so they slashed them to death with sabers and machetes.... and God smiled at them...... And, since WW II the Christian Americans have invaded 37 countries killing between 20 and 30 million people, none of them were white Christians though, so God again smiled and nodded with His approval...... We spent $3 trillion on killing 500,000 innocent Iraqi citizens.... or $6 million per person killed..... it is really getting expensive to kill people nowadays isn't it..... Just think if we had spent that $3 trillion on food, we would have ...","commenter_a":"The Hillary and government set up is trying to keep the polls low for trump an high for hilkery, with the media and asking him politely bow out when Hillary wins it's all to hide the fact that they are cheating and they expect to win by their cheating so it will look good when they say she has won and Obama said he would not leave the White House and would blockade anyone coming in but they are trying to make Trump say that he won't fight. Because they know the system is rigged and ready for Hillary but God it's the boss.","post_message":""}]
