[{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"1011356012327296","commenter_b":"The lady must go to prison","commenter_a":"Looney toon","post_message":"Should the Hillary Clinton investigations continue?"},{"comment_id":"573261456173658","commenter_b":"Praying for you Dr.Carson you can do this","commenter_a":"they don't persecute christians alone. innocent people of all faiths and lack of faiths are persecuted, i think its wrong to focus on only the christian victims","post_message":"Our country faces grave national security threats. We must act boldly and decisively to protect American citizens from terrorists at home and abroad. We can no longer dawdle while ISIS continues to persecute Christians, enslave young girls, oppress civil societies and perpetrate terrorist attacks against the free world. We must destroy their caliphate and prevent their terrorists from infiltrating our homeland. We must also secure our borders, identify radical Islamic extremism by name and root out its agents and collaborators in our own country. My \"Seven Steps for a Safer America\" offers a path forward for confronting these threats and protecting this great country.  1. Congress should immediately issue a formal declaration of war on the Islamic State, which is also known as ISIL or ISIS.  2. The United States should lead the immediate formation of – and provide substantial advisory, financial and military support to – a military coalition in the Middle East to wage war against ISIS. Such a regional coalition would consist of countries such as Egypt, Saudi Arabia and Jordan.  3. The United States should urge its allies and partners in the Middle East to engage in massive recruitment and training of Sunni Syrian men based in Saudi Arabia and the Gulf and of Sunni Syrian male refugees in Jordan – to establish a military force to destroy ISIS and to establish a protection zone for the victims of the terrorist state.  4. The United States should deploy its military resources and work with moderate Arab nations – as well as extend strategic support to Kurdish, Christian and Sunni tribes in the free al-Hasakah Province in northeast Syria – to establish a refugee safe zone in the Province. All refugees should be directed to that free area and to other liberated areas later, and be put under international protection.  5. Congress should immediately establish a war-time emergency visa and immigration policy; establish an emergency inter-agency task force to review all visa and immigration policies; and limit visitor visas to three months with mandatory check-ins for extensions no longer than three months.  6. President Barack Obama and Congress should immediately deploy the National Guard and military troops to patrol the U.S. southern border as well as designated spots along the northern border.  7. The Department of State should designate the Muslim Brotherhood and other organizations that propagate or support Islamic terrorism as terrorist organizations, and fully investigate the Council on American-Islamic Relations (CAIR) as an offshoot of the Muslim Brotherhood and a supporter of terrorism."},{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"1454008947960907","commenter_b":"Just stop we will help them build a wall gladly","commenter_a":"Not going to happen. Not only has it been deemed unconstitutional, isolationism DOES NOT WORK in a multinational economy. This makes me roll my eyes just like when Texans were crying the same thing after Obama was elected (both times).","post_message":"Group calling for California to secede from the U.S. hopes to put question on the ballot authorizing vote on independence."}]
