[{"comment_id":"598112180339217","commenter_b":"@username buzz off back to the Rove hive","commenter_a":"How to Steal an Election 101...Despite winning Wyoming 56-44 percent on Saturday, Bernie Sanders will split the pledged delegates evenly with @username, plus Clinton gets the state's 4 superdelegates, tilting the delegate count to her favor, 11-7.","post_message":"We need a leader who will bring us together—not drive us apart."},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"1722240001356259","commenter_b":"@username the woman who thinks he looks oh so sexy cuz she on the same drugs lmaoooo wanna try em??","commenter_a":"@username no comment","post_message":"he was definitely turnt up..."},{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."},{"comment_id":"1776830319009844","commenter_b":"Maybe Cat is looking for a sanctuary city for cheap labor .","commenter_a":"Thanks","post_message":"Hardworking men and women from Peoria have always taken great pride in knowing their community has been home to Caterpillar, and there’s no denying this news is a real blow. Two years ago, I joined with officials from across our region as Caterpillar announced its intention to expand its footprint and keep its headquarters in Peoria – so this news comes as a shock. Our local economy is tied to the success of Caterpillar. My hope is that Caterpillar will keep the promise it made today for Peoria to remain its largest manufacturing site. I stand with all Peorians in expressing my deep disappointment with this decision."}]
