[{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10153838572646756","commenter_b":"I've heard people complain about steak & lobster, but not produce.","commenter_a":"Odd that many who are not on food stamps complain when those who are eligible have carts full of healthy/quality food: seafood, steak, fresh produce. It's America -where life is a competition. If you need help, you stay at the bottom.","post_message":"People who rely on federal food stamps ate about the same number of calories, but consumed fewer fruits and vegetables and whole grains and more added sugars, according to studies."},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10153793064907452","commenter_b":"We have to go bail him out!!! 2,000 pesos!!!","commenter_a":"Sal zorro is at it again 😂😂","post_message":"As officers rushed to the Los Angeles International Airport amid false reports of shots fired, they encountered a man dressed as Zorro outside Terminal 7. @webpagelink"},{"comment_id":"1238686566209877","commenter_b":"Well said! Agree 100%","commenter_a":"The norm in our country any more. White on black, is racism. Black on white, poor black kids had no daddy & raised in a poor neighborhood! That half an half in the White House. He has no compassion for his \"white\" heritage, only the black side. Pathetic man!","post_message":"A white pizza delivery kid was out working hard, trying to make ends meet. Then he got a call to deliver a pizza to these two thugs.  What happened once he got there will turn your stomach.  This should outrage the entire nation, but the media, Al Sharpton, and Barack Obama don't want to say a word."},{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."}]
