[{"comment_id":"1239208946099133","commenter_b":"Both moms need to get sterilized","commenter_a":"First it said she wasn't charged then it said she was charged with manslaughter and she has been released on 15,000 dollar bond. They should take all her children away from her. These children are her responsibility not the 8 yr old boy. If she would rather be in a bar then put her behind them for the rest of her life.","post_message":"A boy is being charged with beating a 1-year-old girl to death while they were left home alone as their mothers went to a nightclub, police said"},{"comment_id":"1799477110270557","commenter_b":"IF CROOKED CLINTON GETS IN, IT WILL BE THE END OF AMERICA AS WE KNOW HER. GOD HELP Donald J. Trump WIN.","commenter_a":"Of course Donald Trump is low in the polls if that's all your polling are Democrats hello","post_message":"\"I think, frankly, he's going to end up beating Hillary by a surprising margin.\"  On Fox & Friends, Newt Gingrich touted Donald J. Trump's \"two historic speeches\" this week."},{"comment_id":"10154137971976323","commenter_b":"You cannot stop it, it's a done deal. The pacific couldn't stop the TPPA, North Americans couldn't stop NAFTA. These deals are done above our heads, I very much doubt you would be allowed to leave the EU even if you wanted to.","commenter_a":"Have you read the EU's conditions on public services they want within TTIP? It looks to me as though these would offer considerable protection to NHS services; are we sure that our Government would have similar protections? See @webpagelink I was very much against TTIP and concerned about EU position until a colleague brought this to my attention.","post_message":"\"If being in the EU has brought us TTIP, it has also brought us the means to stop it.\""},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"10156463430895354","commenter_b":"Look another bitch working for Obama","commenter_a":"What about anti american hate speech from scuzzy muslims ? Real americans dont like having to suck up to people who want to kill real americans !A plot by our government to change America into a third world craphole !","post_message":"Obama prepares the muzzle to silence Americans who are FED UP with his coddling of terrorists."}]
