[{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"\"I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.\""},{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"},{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"}]
