[{"comment_id":"1059120344128437","commenter_b":"I have a 15 year old daughter. She is very mature and brilliant. Although, she (as well as almost all teens that age I know whose frontal lobe isn't even completely developed and whose lack of life experience just isn't there no matter how much a teen thinks it is) is not ready to consent to domestic slavery, opps I mean marriage. Many organizations are trying to stop child marriages in other countries. I am pretty sure that this is the same thing.","commenter_a":"Sick","post_message":"A debate broiling in the Christian homeschooling community asks a hard-hitting question: just what should the minimum age for marriage be?"},{"comment_id":"1538992396141613","commenter_b":"Are these women able to drive their car alone?","commenter_a":"Sorry, I may sound ignorant of the culture, but these women appear to be upper class, mostly because they speak English well, they are educated. I wonder what life is like for poor Muslim women, if their freedoms are the same?","post_message":"These Muslim women are calling out stereotypes, throwing out labels, and asking others to see them as people first and foremost. (via Bustle with more info at u.pw/1qv4Eb0)"},{"comment_id":"10153252207146509","commenter_b":"Look at yourself and get off your high horse, lady.","commenter_a":"It's only free for freeloaders and illegal immigrants! The rest of us r still going to be up to our eyeballs in debt!","post_message":"President Barack Obama says he'll propose making two years of community college free \"for those willing to work for it.\" Do you agree? More details will be announced Friday: @webpagelink via CNNMoney"},{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."},{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."}]
