[{"comment_id":"387550718099889","commenter_b":"That is a good point.","commenter_a":"It's time to blame and hold congress accountable for allowing him to stay in office.","post_message":"I cannot believe it..."},{"comment_id":"1191127007601184","commenter_b":"Sometimes it takes longer for the other egg. They don't always lay both at the same time. And if was a bad egg she would get rid of it.","commenter_a":"It's crop never seems to look full?","post_message":"AFTERNOON #HATCHWATCH2017: Anytime now, the second eaglet is expected to hatch. A New Year's Day birth, perhaps? Video courtesy of Dick Pritchett Real Estate @webpagelink"},{"comment_id":"10152939538841051","commenter_b":"what a stupid bitch duh","commenter_a":"It seems to me that they have no control of their sexual needs and have to use children because they can't get anyone their age to have sex with.","post_message":"This woman thought the photos she sent via Snapchat would disappear. Well, they didn’t. Police took one look at them and had all the evidence they needed."},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"},{"comment_id":"10153900410909753","commenter_b":"She seriously thinks you meant the kids! Wow","commenter_a":"how is a fence gonna help if they can just climb up it just as well... they need electric fence for them... its really sad that they r doing sumthing about it after a lil boy lost his life....","post_message":"The Disney World alligator attack that killed 2-year-old Lane Graves in Orlando, Florida devastated the nation. Nearly a week after the tragedy, authorities have just released the chilling 911 call made after the toddler was dragged into the water by an alligator. Calls were made Tuesday evening alerting EMS officials that a little boy was attacked and dragged into a lake by an alligator at the Seven Seas Lagoon resort at Disney World. One of the calls was from a woman presumed to be a... @webpagelink"}]
