[{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10152872037516316","commenter_b":"YES! I don't understand some of my friends who like her. She's evil.","commenter_a":"As gratitude my wish is that she receives a free year supply of GMO foods! :)","post_message":"Hillary Clinton continues to dodge the press after being revealed as the Bride of Frankenfoods: @webpagelink"},{"comment_id":"10152709650356051","commenter_b":"Daila Gonzalez, if you are here illegally, it's time for you to leave!","commenter_a":"We should spend more money on our mentally ill americans then we do illegals.. It is such a shame they get so much while we neglect our own...","post_message":"Police saw that a man at IHOP couldn’t pay his tab, so they decided to pay for him. A few hours later, they made a grisly discovery in his apartment"},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""},{"comment_id":"619582968232282","commenter_b":"She has to go","commenter_a":"Yea","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"},{"comment_id":"10154244618664205","commenter_b":"Hillary Clinton is the Jerk of the year, because she put her personal ambition to be President, ahead of the welfare and safety of the vast majority of the American people!!!! Now we are all faced with the train wreck, of Donald Trump, with the nuclear launch codes at his incompetent finger tips!!!","commenter_a":"I vote Yank Jerkin \"off\" as #1. :-)","post_message":"Get in your last minute votes, before it's too late. @webpagelink"}]
