[{"comment_id":"985301294841116","commenter_b":"@username woman you dip.","commenter_a":"Can’t we call Ted Cruz by his real name Rafael Eduardo Cruz? He never misses a chance to call the President “Barrack Hussein Obama“. including his middle name to make sure we all know he’s a “Muslim“….and good old “Ted” was born in the united states of CANADA!","post_message":"Do you agree with the ruling?"},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"10153173313535090","commenter_b":"<(\") Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"},{"comment_id":"908423465917375","commenter_b":"And all this time the US is an OLIGARCHY","commenter_a":"Never could understand how socialist was an insult to Americans","post_message":"Do they even really know what that word means?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155261002826509","commenter_b":"I can tell you as a white American that she's not going to help me or my family either.","commenter_a":"I love how all you white Trump supporters are trying to convince African Americans how Donald Trump can help them and Hillary Clinton can't when you probably have no freaking idea what the African American Community needs. Hysterical. I know you don't like the analogy, but it would be like Adolf Hitler's supporters trying to convince Jews that the Nazi party is better for them.","post_message":"Senator Jeff Flake says, \"I simply can't\" support Donald J. Trump. cnnpolitics.com"},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of \"correcting\" her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."},{"comment_id":"10153634086331130","commenter_b":"It's not the point! The point is that it was NOT any of her, or YOUR, for that matter, business what that girl should or should not wear in this FREE society!! Put on your Spanx, cover your own fat, & shut the hell up!","commenter_a":"Sorry but in order for the dress to have the smooth look she does need spanx. She getting upset when she know damn well she put on spanx under her dresses. Many women fat or skinny wear spanx it's part of a woman's closet.","post_message":"\"I hope this is shared and gets back to you...\""}]
