[{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"},{"comment_id":"952513631455776","commenter_b":"No big deal. Mrs Bush did the same thing.","commenter_a":"Why is it so outrageous that an American woman does not do unculturally American things? Why is it that anything the President and his wife do so politically charged and subject to the idle chatter of people who have no interests outside of demeaning and denigrating people who are doing their level best for this country and its citizens? When you demean the President and his wife, you make us all small, meaner people, and this country seen as acollection of barbarians and yokels.","post_message":"How do you feel about Michelle Obama not wearing a headscarf while visiting Saudi Arabia?"},{"comment_id":"884398511671457","commenter_b":"This woman is an absolute idiot","commenter_a":"Love to see you going to jail have a nice day by by.","post_message":"The message of Hillary Clinton's victory speech last night could not have been more different than Donald Trump's. Whose message is better for the country?"},{"comment_id":"10154980169065789","commenter_b":"@username poor little bitch, guess what trumps your president now ! Lol","commenter_a":"He's accomplished so much in such a short period of time, compared to the last administration. So thankful we have someone who will strengthen our nation and our military. God bless you President Trump!!","post_message":"Donald Trump has been in the White House for 13 days. Do you like or dislike what you've seen from his administration so far?"},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"971252449561175","commenter_b":"Hat's off to this chick!!!! Good for her! To bad she didn't kill the s.o.b.!","commenter_a":"Well done! I would want to do the same thing. These perverts cannot be rehabilitated.","post_message":"The woman took matters into her own hands when she caught  her boyfriend trying to sexually assault a 12-year-old -- by running him over with her car. >> kiro.tv/RunOver  She, and her boyfriend, were arrested."},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."}]
