[{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"10153689692760530","commenter_b":"Are you on crack?","commenter_a":"15","post_message":"Fill in the blank: The Michigan State Spartans will finish with ___ wins this season."},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"\"Messing with our veines/immune system, why?\"","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"949896131712475","commenter_b":"Even the black panthers want to kill white folks, lets start picking them up first and do something about them standing at festivals with AK 47's and other numerous guns, quit harping about only white folks having guns","commenter_a":"IT'S TIME TO DO SOMETHING ABOUT THE IDIOT'S THAT USE THE GUNS TO KILL PEOPLE SENSELESS...JUST CAUSE THEY PISSED OR DON'T LIKE YOUR COLOR!!!!!! NOT THE GUNS FAULT...THAT IS SO STUPID TO THINK IT'S THE GUNS FAULT...THAT'S LIKE SAYING BAN FORKS AND SPOONS FOR ALL THE OBESITY!!! TOTALLY INSANE!!!!!! LET'S BAN CARS FOR ALL THE WRECKS THAT KILL PEOPLE!!!! HEIGHT OF IGNORANCE!!!!!","post_message":"HELL YES!"},{"comment_id":"1174959735872779","commenter_b":"They reported that in Oklahoma only Blue Cross/Shield was still in it and that they will be dropping out as well.","commenter_a":"I hope so...","post_message":"It's official!"},{"comment_id":"1806351676274393","commenter_b":"My body is mine Mario, and a pregnancy I would carry, would also be my decision. You get no say. Your ignorance proves you shouldn't have any. You think no women in your country get abortions? No, they get unsafe back-alley or home abortions. Men should absolutely not get to make legal decisions over what occurs within a woman's body.","commenter_a":"Your body is your choice only when your body will have 2 heads 4 arms 4 legs..if you want a choice you should buy a pack of condoms or close the oval tubes..stop abortion in Gods name.","post_message":"In Mike Pence's name"}]
