[{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."},{"comment_id":"1606743262959812","commenter_b":"Run cock roaches run!","commenter_a":"If only","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"},{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."}]
