[{"comment_id":"979011448820924","commenter_b":"she would have just committed suicide another time someplace else","commenter_a":"Had her relatives posted bail, she would still be with us today. Shame!","post_message":"So close to the holidays...  A Texas grand jury has decided not to issue any indictments in the mysterious prison cell death of Chicago woman, Sandra Bland. Despite video evidence showing a display of excessive force from the arresting officer, the case now remains at a standstill.  MORE ---> @webpagelink"},{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"10152697644391770","commenter_b":"Thank you for giving me a laugh at your attempts to be of value to society","commenter_a":"Honesty is not an option in Obamas picks.","post_message":"Cruz explains what McConnell SHOULD have done."},{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"\"You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1025596987461312","commenter_b":"Sure, blame the illegals. What do you Morons know?","commenter_a":"Kristen Kirschner","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"10153979570636378","commenter_b":"@username shut your trashy face","commenter_a":"Hey NFL PLAYERS, you guys got something you can do before the game to protest the mistreatment of POLICE OFFICERS??? HMMM??? Yeh, nothing, I thought so....","post_message":"DEVELOPING: Seven people were shot, including two police officers, after an ambush-style attack that led to a fatal shootout in West Philadelphia. A civilian and the gunman are dead. --> @webpagelink"},{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."}]
