[{"comment_id":"567943360046309","commenter_b":"How did you get where you are if that is true and by the way lady, the last time I checked the White House was occupied by a Black Family !Stop feeling sorry for yourself ! Get therapy and get over yourself !","commenter_a":"When hate is all you got to sell","post_message":"“This country was founded on racism and sexism, point blank.\""},{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"},{"comment_id":"908423465917375","commenter_b":"And all this time the US is an OLIGARCHY","commenter_a":"Never could understand how socialist was an insult to Americans","post_message":"Do they even really know what that word means?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1873334889566400","commenter_b":"I'm thinking entertainment value. After he leaves office, it will be obvious what a loser he is.","commenter_a":"Idiot","post_message":"President Barack Obama plans to speak out when he believes he needs to during the presidency of Donald Trump."},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"481049412085639","commenter_b":"Send her ass back over there fucking trader.","commenter_a":"Hate it!!!","post_message":"A woman who left home to join ISIS just got served up some karma.  Good. Anyone supporting ISIS is a traitor to America.  Click 'LIKE' if you agree!"}]
