[{"comment_id":"10153035783794877","commenter_b":"hes right yall hoes more worried about her hair then her policies..","commenter_a":"Pretty amazing the priorities of the majority of blacks. Grio post an article about a federal investigation on police, and folks talking about how the Mayor hair and lips... Then we wonder why black folks are look down on.","post_message":"The Baltimore Police Department probably isn't happy with what Mayor Stephanie Rawlings-Blake just asked for. Get the scoop below.  Grio fam, was this the right move? Will it pan out? Sound off..."},{"comment_id":"671681693020122","commenter_b":"Donna should be in jail!","commenter_a":"She is a cheater","post_message":"Does she DESERVE TO BE ARRESTED?"},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."},{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"1839777972919599","commenter_b":"Ja i steh drauf ❤️","commenter_a":"@username 😂😂😂","post_message":"yassss"},{"comment_id":"1286179581424362","commenter_b":"And she is a liar and murder!","commenter_a":"He can talk about Hillary all day, but he has no real plan for this country, he's an imbecile.","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."}]
