[{"comment_id":"10155176603990389","commenter_b":"Don't know of anyone who did. Won by fraud.","commenter_a":"I didn't vote for this useless President!!!","post_message":"ICYMI: Republicans cheered as President Barack Obama said “I have no more campaigns to run.” Obama, cracked a smile and responded: “I know because I won both of them.”"},{"comment_id":"725563637631927","commenter_b":"The wall around the vatican was bild to keep the muslums out.","commenter_a":"I am not Catholic,He is not my pope. We do not have an established religion in the USA. Which was the whole reason for the whole revolutionary war, pilgrims, etc. He is welcome to his opinion, that's all it is....move on Pope....btw, why do you have a wall around the Vatican, just curious","post_message":"The Pope got TAKEN TO SCHOOL by Trump supporters!"},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."},{"comment_id":"10154385047759714","commenter_b":"Mmm seems she has friends in high place above the law she is!","commenter_a":"RIP America....","post_message":"1916: The first woman is elected to Congress.  2016: The first woman wins the Democratic race for president. #Election2016 @webpagelink"},{"comment_id":"10154184245291943","commenter_b":"This evil woman needs to fall, through what ever means necessary.","commenter_a":"Oh quit messing with us. Either do it or s t f u!!!","post_message":"With 75 days before voters pick their new president, email revelations are threatening to overtake Hillary Clinton campaign  with WikiLeaks founder Julian Assange hurling another log on an already raging fire with a vow to release  Clinton documents.  In an exclusive interview Wednesday night with Fox News Megyn Kelly, Assange was asked whether new information culled from Clinton emails would be released before the general election: \"Yes, absolutely.  - via Fox News"},{"comment_id":"880245452022083","commenter_b":"@username // Lets jail women for miscarriage oh wait we already are -_-// Who's advocating to throw woman in jail for miscarriages. Again how many time's have been through this? Hiring, a contract killer to end the life of ANOTHER HUMAN BEING is NOT a miscarriage. Miscarriage's happen naturally, not by FORCED.","commenter_a":"People who cannot distinguish a fetus from an infant have no right legislating against abortion","post_message":"Tell Congress to protect ALL babies.  Click here to urge your Congressman and Senators to cosponsor the Life at Conception Act! @webpagelink"},{"comment_id":"1003834523018162","commenter_b":"Fuck her she hates white's. She only hires blacks.","commenter_a":"she had made millions off the white people and i do mean millions.let her take some money and give it to street people or vets which i doubt she will she would only let them starve!!!!opra disappoints me as i thought she wouild be the last person to say something like that!!!!!!","post_message":"Oprah Claims White People Are The Cause Of Racism In America.  What a hypocrite, she is the racist.  Do you think Oprah is bigot?"}]
