[{"comment_id":"10153811785661486","commenter_b":"Aamen","commenter_a":"Wow","post_message":"A relative of Princess Diana, Prince William and Prince Harry has moved one step closer to sainthood."},{"comment_id":"10154964857609885","commenter_b":"Stfu","commenter_a":"Best. Winter. Classic. Ever.","post_message":"St. Louis and the Blues nailed this one."},{"comment_id":"1279009012178004","commenter_b":"Fuck that girlfriend","commenter_a":"I woulda just gave her the pipe since the gf it a dumb bitch anyways","post_message":"Dude passed the test!  #WSHH"},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."},{"comment_id":"10153007103196336","commenter_b":"Yes, teachers do hve input as to curriculum. No teacher nor educator has the right to instill their political views on to their students.","commenter_a":"These teachers need to be replaced if they are inserting their political views in the classroom and have only One answer which the see as correct whether it is correct or not! This is MY opinion! This does Not need to be taught in school anymore than religion! Go argue on someone elses opinion if you don't like mine. I will Not be called ignorant by anyone!","post_message":"“The Democrat is building. The Republican is destroying.”  According to an 8th-grade teacher in Wisconsin, this was the correct answer for a social studies assignment on immigration policy."},{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"}]
