[{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"},{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out \"Purple Rain\" amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"},{"comment_id":"804744199625733","commenter_b":"The Progressive white wash is to say \"America did this\" No You Progressives did this!!!","commenter_a":"BOOM!!!!","post_message":"Watch me take down Cenk Uygur from The Young Turks LIVE at Politicon! Cenk should be a little less smug after this debate. #Politicon2016  Learn more about Hillary's America, in theaters on July 22: hillarysamericathemovie.com."},{"comment_id":"10154072971081756","commenter_b":"what is the average age of someone on Medicaid? If it's what I think, I think the horse the barn long ago with these folks quitting smoking.","commenter_a":"Wellbutrin, as pictured, is often used to help people quit smoking and is used as an anti depressant BUT (there's always a but.....) it can cause mental health issues itself such as hallucinations, manic symptoms, etc.","post_message":"Despite one-third of Medicaid participants being smokers, many states aren't doing enough to help people in their Medicaid programs quit."},{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"\"Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"10150612418424999","commenter_b":"A hoe is a garden tool, ferchrissakes.","commenter_a":"Being a hoe ain't new or modern..No matter how many flowery. Words u use.","post_message":"\"If an open relationship was necessary to prove how well I loved my boyfriend, I was happy to comply.\""}]
