[{"comment_id":"909813239056017","commenter_b":"And ya wonder why his kids are so messed up...duh. apple doesn't fall far from the tree.","commenter_a":"Who cares, ?","post_message":"\"I'm so happy after such a long struggle to be living my true self.\""},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"10153436372151337","commenter_b":"But Mariah has the booty","commenter_a":"The only reason this game sells is because of kate upton's nice tits. Big mistake","post_message":"A NEW \"FACE\": Those Game of War - Fire Age commercials will no longer feature Kate Upton..."},{"comment_id":"661168074035043","commenter_b":"She has problems","commenter_a":"Dylan Ballzy","post_message":"Ermmmm..."},{"comment_id":"923666907700065","commenter_b":"That hoe better learned how to fight cuz we gon square up lmao","commenter_a":"@username if I ever find out my daughter sucking dick idgaf she can get it . lmao go to her school and embarrass her. lmao","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"1190989584254403","commenter_b":"Abortion is legal in this country. If you have to murder physicians who perform a legal medical procedure, heavily edit videos to try to discredit an organization that is doing nothing illegal and burn down their clinics, then who is really the violent killers and terrorists here? All in the name of Christianity? Not my Christianity certainly. Reminds me of the middle east, however. Islamic terrorists/Christian terrorists. There is no difference when you cross the line into violence.","commenter_a":"Damm","post_message":"\"It's deeply disappointing that we still see the kind of hateful rhetoric in our state that fuels this kind of violence.\""},{"comment_id":"10156563321065354","commenter_b":"She is such a fucking idiot.","commenter_a":"A lying bitch just a lot of talk. Her proposals want ever work. Hillary though will never be president","post_message":"#6 and #7 will INFURIATE you..."}]
