[{"comment_id":"1690937014458022","commenter_b":"Stupid Swede!","commenter_a":"Another nut","post_message":"This is INSANE..."},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"1285345191558532","commenter_b":"She is the Bitch.!","commenter_a":"love Hillary...Kill Babies.... $$$$$%","post_message":"The star actress makes an excellent point.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for \"being too loud.\" The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"789545591173673","commenter_b":"Some states are allowing people to vote through the DMV instead of going to the polls....most of these states are where the illegal immigrants are.....that is where it is not fair, because illegals can have a drivers license now in some of these states and will vote democrat illegally . That is why it is more important than ever to get out and vote if you want a republican to win.","commenter_a":"I hope the election isn't rigged. The government we have now doesn't want Trump to win. He,will find out too much truth and tell us like it is. No more secrets no more lies. Trump 2016!!!!","post_message":"Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had. He brilliantly tells it like it is -- the real deal! Read it!  @webpagelink"},{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"\"If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?\"  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."}]
