[{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"954102247963967","commenter_b":"Yes women! Stay home! In the kitchen!","commenter_a":"Feed your kids before you go out in public......","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"10153323546831747","commenter_b":"Now plural marriages are next.","commenter_a":"What a crock! States rights were dealt a severe blow today. Yesterday SCOTUS-care, today five judges ignore the constitution to impose more leftist agenda on the entire country. Overall a bad week for the USA!","post_message":"I've had some time to think about today's historic ruling. Here are my fuller thoughts...  Today, the arc of history bent further toward justice. We are a country that embraces the ideal of life, liberty, and the pursuit of happiness for everyone. With today's Supreme Court ruling guaranteeing the right to marry for LGBT couples, we came even closer to making that ideal a reality.  This decision is a reminder that we should come together as a nation in support of civil rights for all. LGBT Americans and their allies are joyously celebrating today’s landmark decision, as they should. On this same day, in Charleston, South Carolina, Reverend Clementa Pinckney, a martyr to the civil rights struggle, is being laid to rest. He was one of nine African Americans robbed of life in an act of white supremacist terrorism.  Our work to build a more perfect union never ends. Marriage equality is now the law of the land, yet there are no federal safeguards protecting LGBT Americans against employment and housing discrimination. The same Supreme Court that ruled today in favor of marriage equality two years ago gutted the Voting Rights Act, and to this day, Congress has failed in its duty to restore vital voting rights protections. Rights can be won, and rights can be lost.  We’ve helped create a fairer and more just society today, but new and longstanding civil rights struggles are on the horizon. I’m prepared to wage those battles too, because I want my grandchildren to see progress in their time. I want them to believe as I do that America’s best days are still to come."},{"comment_id":"10153087486466162","commenter_b":"She is hot","commenter_a":"Sicko","post_message":"STUDENT SAYS THEY HAD SEX AGAIN: A high school teacher charged with having sex with several students is back in jail after one student claimed that they continued to have sex while she was free on bail @webpagelink"},{"comment_id":"10153981552219641","commenter_b":"I could care less how racist this is, but Belgium needs to deport every last Radical Muslim!","commenter_a":"Jai shri krishna Namaste.ji","post_message":"\"We will do whatever is necessary to support our friend and ally Belgium...\": U.S. President Barack Obama comments on Brussels terror attacks. @webpagelink"},{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"}]
