[{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"1868657266690469","commenter_b":"Talking about Melanie trump class haha she need a pole and dancing,center for the entertainment industry.","commenter_a":"She is such a beautiful person, so graceful and such class she brings to the WH, something g we Havn't had in several years.. What a great change","post_message":"Michelle Obama doesn't think Melania is fit to serve as First Lady.  'LIKE' if she's WRONG!!!"},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."},{"comment_id":"10154885084089411","commenter_b":"we all good woohoo like riding a wave..","commenter_a":"Leah stay safe. Xx","post_message":"URGENT New Zealand civil defense warns of tsunami, urges people on South Island to move to higher ground"},{"comment_id":"10155341100780725","commenter_b":"So put that bitch down","commenter_a":"Obviously she has mental and emotional illness. Maybe people shouldn't be so quick to throw her to the firing squad.","post_message":"The woman accused of viciously cutting open a mother-to-be's womb to steal her fetus was apparently faking her own pregnancy, which gives a clue as to why she committed the horrendous crime, according to a police affidavit ----> @webpagelink"},{"comment_id":"705392762974353","commenter_b":"Lol too bad she does more for this country than you ever will","commenter_a":"She's awful. She's a spoiled brat that needs attention. We need to stop giving her a second of our time and let her slither back to wherever she came from. Maybe she can go live with Heidi and Spencer.","post_message":"Newly-uncovered video proves Tomi Lahren changed her position on climate change to appeal to misinformed conservatives. SHARE to spread her shame!   Video by Occupy Democrats, like our page for more!"}]
