[{"comment_id":"996296000407740","commenter_b":"You are going to deal with it...as he repels the illegal invaders","commenter_a":"Trump does not get it wrong when it comes to policy","post_message":"\"Wait, wait, wait...\""},{"comment_id":"10154344957028753","commenter_b":"@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":""},{"comment_id":"618837121600063","commenter_b":"bitch","commenter_a":"Donald Trump is beginning to understand why they did want him involve, right? @webpagelink","post_message":"Paul Ryan is a ___________."},{"comment_id":"1520211998272919","commenter_b":"Amanda Murphy Maldonado they can take their kids with them. No families have to be busted up. Then when they kid is of age he can come back as a citizen. LAWS are LAWS...what laws are you CHOOSING to break?","commenter_a":"SEND THEM HOME. This isn't just \"politics\" anymore, this is the deliberate destruction of America from within. When they jumped the wall the broke the law!","post_message":"Breaking News: The Supreme Court says it will review President Barack Obama's orders to shield up to 5 million illegal immigrants from deportation. @webpagelink"},{"comment_id":"10154653842272639","commenter_b":"No they don't, they just have a problem with a stupid woman lying and telling everyone it's Alternative Facts..... You are a White Neo Nazi KellyAnne and that is what the problem is.....You don't have power, you have NOTHNG!!!!!","commenter_a":"No we have a problem with fact challenged people","post_message":"“It turns out that a lot of women just have a problem with women in power,\" Kellyanne Conway said about the historic Women's March on Washington."},{"comment_id":"10153291024331509","commenter_b":"They are, dummy. You must be the next Nancy Grace.","commenter_a":"Fact is most of us don't drive around with hundreds of thousands in cash on us. The article barely mentions the fact that this program is geared towards getting drug dealers off the streets. Cops make mistakes because they're human but this article gives two examples that make it sound like cops are robbing innocent people daily of their cash. @username strikes again.","post_message":"You may have never heard of this program, but it's a widespread practice in which police can take your cash without any criminal charges: @webpagelink"},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."}]
