[{"comment_id":"10153664920821636","commenter_b":"The appointment of this known Moldovan pimp and thug proves beyond any doubt that the so called \"Jewish state\" is actually a fascist state built on violence ,murder and colonialism.","commenter_a":"Hitler would be so proud of these two!!","post_message":"In 2016"},{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, \"crazies\" but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"10153740988490530","commenter_b":"This Bi..ch ran him over!! WITH HIS OWN TRUCK!!! She must pay!!!","commenter_a":"wow that's just a tragedy all over... All those lives destroyed forever","post_message":"Police say addiction led a suburban mom to carjack and run over a senior citizen in a Burger King parking lot."},{"comment_id":"10154690577255329","commenter_b":"Yeah, like. Hey white girls: YOU ARE FREAKING EVERYWHERE. Chill.","commenter_a":"Please don't come on here saying white girl magic and all prom dresses are beautiful cause i swear to god.","post_message":"#BlackGirlMagic is real."},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"}]
