[{"comment_id":"10153846533754641","commenter_b":"A VOTE FOR HILLARY WILL BE THE END OF WHAT WE KNOW OF A FREE AMERICA , NO MORALS, ONLY PROMISES AND MORE LIS ! I WAS SHOCKED AT HOW MANY PPL STILL VOTED FOR HER AFTER KNOWING SHE HAS COMMITED TREASON ALONG WITH OBAMA AND THOSE TOP SECURITY TAPES BEING EXPOSED FOR JUST ANYONE TO SEE , THEY CAUGHTBOTH OBAMA AND HER IN LIES WHEN ASKED ABOUT THOSES TAPES . EVEN IF SHE DID MAKE IT TO BE PRESIDENT SHE BETTER NOT GET SETTLED IN TO QUICK , iI HAVE A FEELING SHE WILL BE INDICTED AND OBAMA WILL BE ALSO !","commenter_a":"Every other one is a liar and owned by big $$. What will they do to help you directly? I don't know any millionaires so I guarantee #Bernie2016 s policies will give you more spendable money. He's not really giving anything away, we already pay for most of it and he's found ways to pay for MORE than the rest, the excess will pay down the deficit. He will create jobs and raise wages, which will lift millions of people out of poverty and they will rely less, or not at all, on welfare. (No, this will not cause massive job loss or inflation. When poor people earn more money, they spend it, giving businesses plenty more money to use to pay the higher wages, usually with little to no increase in price.) He will implement a small tax on wall street transactions and other UNEARNED income, and will invest ...","post_message":"Donald J. Trump after a projected 2nd-place finish at Iowa caucuses: \"We will go on to easily beat [ Hillary Clinton ] or [ Bernie Sanders ], or whoever the hell they throw up there.\"   Live updates from the Iowa caucuses: @webpagelink"},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, \"I felt like this weight had just been lifted out of me, and people knew where we stood.\""},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"10153719642089091","commenter_b":"@username so you've gotten an infection from using a public restroom ?","commenter_a":"Why would you let your 8 year old daughter go to a public bathroom by herself??!! Smdh.","post_message":"Thank goodness for the customers and staff members who helped rescue the 8-year-old after her mother heard her scream. Police say the man was caught carrying the unconscious girl into a bathroom stall."},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"}]
