[{"comment_id":"1109196055770108","commenter_b":"@username You have no morality. Also gays shouldnt be allowed anywhere near kids.. its pure child abuse. If they were meant to be parents, then gays would be able to reproduce.","commenter_a":"I thought MLB was about playing baseball, not trying to promote an immoral, sacrilegious way of life!","post_message":"MLB is DYING to get a gay baseball player."},{"comment_id":"10153219350514486","commenter_b":"She should EAT SHIT AND DIE !","commenter_a":"Should have been the day after she was elected","post_message":"Now that Harry Reid has announced his retirement, some Democrats think it time for Pelosi to do the same..."},{"comment_id":"1003724273013669","commenter_b":"This woman is dumber than a box of rocks!","commenter_a":"freaking nut case!","post_message":"Dems know where to get their votes..."},{"comment_id":"10153250256602439","commenter_b":"All female firing squad","commenter_a":"His last meal should be bacon. Pour pig's blood all over his body before firing squad. Don't forget to soak those bullets in pig's blood.","post_message":"Death penalty is too good for this savage. Boston (CNN)[Breaking news update, posted at 2:32 p.m. ET] Jurors in the Boston Marathon bombing trial have found Dzhokhar Tsarnaev guilty of all 17 counts that carry a possible penalty of death. The jury …"},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration?  Via In The Know"},{"comment_id":"873586192785317","commenter_b":"U feel sorry!!! Speak up your no better than them if u witness it and say nothing. Damn","commenter_a":"When I worked at the hospital in the lab..I can't tell you how many times I saw cops get unnecessarily rough with women ..women of any color. Not all but a lot..it actually made me start to feel sorry for their wives . If they do that on the job I hate to see what happens when they know they aren't being watched","post_message":"BRUTAL CONFRONTATION: Pennsylvania police officer charged after being caught on video appearing to punch a woman during a traffic stop: @webpagelink"},{"comment_id":"1696327707324773","commenter_b":"Flawless Pre lil ass threw it back in the family bathroom! 😂😂😂","commenter_a":"Flawless Pre TARGET (we had a home just got caught in the moment) 😂😂😂","post_message":"This should be interesting.  Comment below! #WSHH"}]
