[{"comment_id":"10154568633769411","commenter_b":"@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just \"no means no\" and \"yes means yes.\""},{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"\"Davis is simply wrong,\" lawyers for Kentucky Gov. Steven Beshear said."},{"comment_id":"658477470966222","commenter_b":"I'm sorry this woman is no good for this country I'm sure there is the woman that be a Great president for this country but she is not the one she is evil and corruptive I see a whole lot of old women who think I got 1 foot in the grave I should vote for a womanwrong","commenter_a":"It still look's like a trash bag on her.","post_message":"Hillary Perón"},{"comment_id":"511120385679668","commenter_b":"Our government pushes meth, heroin and every other drug, but its OK because they say it is?","commenter_a":"Let's not forget that a large portion of the prison population in the U.S. has been incarcerated because of nonviolent drug charges.","post_message":"Listen here: @webpagelink"},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"}]
