[{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"726552340811280","commenter_b":"this female is an ignorant scumbag","commenter_a":"I guess that means yes....","post_message":"I'm not afraid to say these are FAKE TEARS!"},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"827359944060385","commenter_b":"Hillary is truly a liar.","commenter_a":"Hillary, always evolving while taking corporate money for corporate favors. Show me the speeches from Goldman Sachs so I can see exactly how much of my back you really have... #FeelTheBern","post_message":"Too many trans Americans still face violence and discrimination, just for being who they are. Together we'll fight for safety, respect, and full equality for the trans community."},{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"2076295639262230","commenter_b":"Who is Jill Stein?????","commenter_a":"Throw your support behind TRUMP all of you Bernie supporters!!!!","post_message":"Breaking News: Democratic National Committee Chairwoman Debbie Wasserman Schultz will not preside over her party’s convention in Philadelphia following email leak suggesting anti-Bernie Sanders bias, Fox News confirms. @webpagelink"}]
