[{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"685160418299400","commenter_b":"He going to build a wall!!!!! What an asshole","commenter_a":"Oh, Jennifer....I LOVE your post....thank you....you just made my day....","post_message":"Oh this is precious."},{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a \"roll call vote.\" RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"10154141987653145","commenter_b":"@username Yes! Thugs with guns and badges paid by our tax dollars.","commenter_a":"This is where we are today: Killer cops kill civilians and get away with it. Civilians kill cops and either get killed by other killer cops, or if very lucky, they get arrested, charged, and sentenced. Killer cops have no empathy for civilians they kill, or their families. The copsuckers show no empathy for the victims of killer cops who again, get away with it. If the killer cops, along with their apologists don't show empathy for the victims of police killings, why should civilians show empathy for the killed cops? If the killer cops won't shed tears when civilians get killed by cops, why should civilians shed tears when cops get killed? If the killer cops along with their apologists think it's OK for the civilians to be killed by cops (the unjustified killings), why shouldn't the civilians think it's OK for the cops to be killed? Only if ...","post_message":"The slain officer was a special agent with the Georgia Bureau of Investigation. Police say the gunman remains at large this morning."},{"comment_id":"10153548977449607","commenter_b":"she wants to get out before all hell brakes loose LMAO","commenter_a":"let her travel who cares","post_message":"Some local activists are shaking their heads over the Mayor's plans to travel out of the country next week, on the one year anniversary of Freddie Gray's arrest."}]
