[{"comment_id":"1044948272235591","commenter_b":"The RINOS & Dumocrats ALL SLEEP IN THE SAME BED. THEY are disgraceful group of piglets!","commenter_a":"Your a lier just like Obama you have so many people out here out of work and homeless what planet are you living on why don't you idiots venture outside the District of Columbia and visit the real Americans.","post_message":"Get in line, Americans. Paul Ryan knows best."},{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"10154360418471729","commenter_b":"...she IS A LIAR !!!...always been and always will...","commenter_a":"Now...that looks like an angry candidate!","post_message":"The truth hurts. Especially if you're Hillary Clinton."},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"10152693166980047","commenter_b":"Get out of our lives and leave us alone you can not even run your own country leave our children alone also","commenter_a":"No way","post_message":"Schools are forcing our children to \"pretend\" to be Muslim for a day?  We must stop Islamic indoctrination in our schools.   Sign and Share the petition to defend the religious liberty of our students:  @webpagelink"},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"}]
