[{"comment_id":"1167920019941418","commenter_b":"@username and real men don't use emojis to other men over the Internet","commenter_a":"Donald trump used to endorse boxing a lot. That's why don king and Tyson support him. They actually know him instead of judging him based on the Internet and tv","post_message":"#DonKing is advocating for #DonaldTrump now! #WSHH"},{"comment_id":"1724899471110412","commenter_b":"And what did she sound like a complete or just partial idiot","commenter_a":"Scared Bitch? Sure sounds like you are!!","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"10154091613326491","commenter_b":"@username, being dumb is a choice. Well done. Did you decide to be straight ?","commenter_a":"Stop... you are American or you arent. Quit separating people by what body parts a person likes to sleep with and what color of skin they have... Just stop","post_message":"“When you don’t have data about a community, at times it can seem like the community doesn’t exist.”"},{"comment_id":"689708227853298","commenter_b":"Evidently the back of your father's hand never helped you because you're still talking crap go home Joe go home","commenter_a":"Hypocritical scum. \"This is a Big f---ing deal\". Didn't you say that?","post_message":"Vice President Joe Biden: Donald J. Trump's language would have gotten me \"the back of my father's hand\" abcn.ws/2fOBDpy"}]
