[{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"229274887547012","commenter_b":"Total hero! Heart of gold💛 Communities need to set up places where showers and washer/dryers are available to those in need.","commenter_a":"That was so awesome God bless you it should be more people like you in this world I'll be a better place to live in if people learn to help each other no matter what color we are","post_message":"A California man helps a homeless man get a job."},{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"957930547633333","commenter_b":"If she finds it so offensive get another job quit inflicting her stuff on us","commenter_a":"Let her rot there.","post_message":"Some people just never learn."},{"comment_id":"10156580556107228","commenter_b":"No sweetheart they don't have no idea what fighting for their rights is about. I don't recall any civil wars that were fought to free the transgender. How many transgender have had crosses burned in their yards, how many transgender have been hung in trees? How many transgender were murdered for being transgender? Special kinda of stupid are the folks that think that the struggles the black community have faced and continues to face compares to Johnny who wants to wear a dress!!!!","commenter_a":"Sorry but to try to compare the two is insulting. I don't recall transgenders ever being enslaved, I don't recall transgender ever having to fight for their civil rights. Being transgender is a choice you make, wether you feel you were born this way or not is debatable. Black is black, no debate there.","post_message":"I sat on the plane this week with a beautiful family.  The mother introduced her three children to me and opened up to me that her youngest daughter is a trans child. She is actually a documentary producer and is working on a film about trans children, a film that will try to confront and dispel the wide spread fear, ignorance and bigotry that surround trans Americans. She allowed me to watch the trailer and the beauty, struggle and courage of the families she highlighted resonated with me deeply. I pray that we all grow more courageous in our empathy, that we all seek to understand each other more and that we all become better agents of love and justice. As for me, I condemn the actions of the Trump administration in their reversal of transgender student protections. I will not yield in the fight for equal rights and equal protection under the law. We all owe an obligation to those freedom fighters who fought for civil rights, women's rights, workers rights and human rights over the past generations. We can not pay those heroes of love back, we can only pay it forward. Now is the time that history calls on us to make for a better future for all. #protecttranskids"},{"comment_id":"910810348978714","commenter_b":"Showing her big fat backside...","commenter_a":"Why is it always about Kim Kardasian? And by the way, can somebody tell what she's famous for?","post_message":"Kim Kardashian leaves no curve unseen  (Vis Daily Mail Celebrity)"}]
