[{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"10156228497460725","commenter_b":"Evil woman with lying eyes.","commenter_a":"Socialist controlled media ?","post_message":"Hillary Clinton is on the front page of The New York Times waving to 200 people in New Hampshire. My crowd next door was 5,000 people – no pic!"},{"comment_id":"10157985698230594","commenter_b":"Hillsborough residents don't want the riffraff coming through their fancy neighborhood? Mountain lions can eat your pets.","commenter_a":"And the point is?","post_message":"Peter Rauenbuehler has posted video online showing a mountain lion attacking a deer and then dragging the limp animal away from his Hillsborough home."},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"10154959360378812","commenter_b":"She's a nasty nasty woman","commenter_a":"charge her for what.......whats the charge...stop interfering in the election......","post_message":"Congressman Bob Goodlatte: FBI – Federal Bureau of Investigation Director James Comey \"very conscious of the controversy\" within the bureau over decision not to charge Hillary Clinton. @webpagelink #thisweek"},{"comment_id":"1083781141676265","commenter_b":"It has proven once more that U.S are serving the Wahhabism in the region in return it get many from the Saudi Royal family. no matter to U.S how dangerous the wahabi are what extreme threat poses to civilization.","commenter_a":"Muricaaaa","post_message":"The Russian foreign ministry said the attack had jeopardised the US-Russia agreement on Syria."}]
