[{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"},{"comment_id":"704711463000234","commenter_b":"Time to take her out of her tower.","commenter_a":"Nice job with Bill","post_message":"“I have a lot of experience dealing with men who sometimes get off the reservation in the way they behave and how they speak,” Hillary Clinton said."},{"comment_id":"1046361932108447","commenter_b":"Wow, stupid bitch","commenter_a":"Kiss off Obama you are worthless !!! Go Donald Trump For President !!! Would be Great if Obama was for us Americans like he is for all the out siders !!!","post_message":"President Obama is urging the Senate to pass a bill to help Puerto Rico with their recession and debt crisis. What do you think about this?"},{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT \"EACH AND EVERY MUSLIM\" THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON\"T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"234297206973807","commenter_b":"I can't stand this woman. She makes me sick","commenter_a":"Lying bitch","post_message":"Kellyanne Conway just took \"alternative facts\" to a whole new level by mentioning a massacre that never happened."}]
