[{"comment_id":"10154086020097024","commenter_b":"Build that wall","commenter_a":"Prosecute every elected official in every sanctuary city as being complicit in evey crime committed by illegal aliens.","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"10154212521629087","commenter_b":"The best present she could give America would either be a full confession of her crimes or better yet, get a pistol, load it, put it in her mouth and pull the fucking trigger.","commenter_a":"I believe it was the other way around. Liberal loons twisting facts to make it look good for them. Lol. Happy birthday Hillary! The best present you can offer to the American people would be to quit! :) #NeverHillary!","post_message":"\"Can we call Megyn Kelly’s total obliteration of Newt Gingrich on live television the kick off to Hillary Clinton’s 69th birthday celebration?\""},{"comment_id":"952513631455776","commenter_b":"No big deal. Mrs Bush did the same thing.","commenter_a":"Why is it so outrageous that an American woman does not do unculturally American things? Why is it that anything the President and his wife do so politically charged and subject to the idle chatter of people who have no interests outside of demeaning and denigrating people who are doing their level best for this country and its citizens? When you demean the President and his wife, you make us all small, meaner people, and this country seen as acollection of barbarians and yokels.","post_message":"How do you feel about Michelle Obama not wearing a headscarf while visiting Saudi Arabia?"},{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"10153782447389094","commenter_b":"Ppl are making it one. So just fix it where only one person can use the restroom by themselves.","commenter_a":"Just make all businesses have two restrooms with one stall. And a lock on each door. Problem solved","post_message":"The states allege the government action has “no basis in law.”"},{"comment_id":"10153171709824456","commenter_b":"HISTORY","commenter_a":"I am so glad I took part in history glad to be a Masonic brother","post_message":"The march to Montgomery is underway...  @webpagelink"},{"comment_id":"10154225245793483","commenter_b":"Wtf is wrong with this woman. She needs to be arrested for abuse. I take care of elderly people and this is despicable!!","commenter_a":"That's disgusting. Has she been arrested?","post_message":"A 94-year-old woman was supposed to be taken care of by a home health care provider. But she was screamed at and even hit by the woman.  \"I told you stop feeding that dog human food,\" the worker screamed at the 94-year-old woman. FOUL LANGUAGE WARNING FULL STORY --> @webpagelink"}]
