[{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."},{"comment_id":"10154520353580329","commenter_b":"All humans have breasts, relax","commenter_a":"Not all people with boobs/breasts identify as women.","post_message":"I love you AND I hate you."},{"comment_id":"696420180548560","commenter_b":"Personally I am glad that Texas is not taking any refugees. Imagine the amount of terrorist polluting the state.","commenter_a":"Good for you Texas Gov.!!!! Let's hope that our spineless president doesn't stymie this action.!!!","post_message":"Texas Gov. just released this very bad news for all refugees. The are setting a trend. Let's spread this. Can we get 75,000 'LIKES' for the great state of Texas?"},{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"10153101911354877","commenter_b":"Give an inch and they take a mile.... true, but knowing that why even give an inch? She's just trying to get attention. If she were a normal woman she would be on every comment feed talking about \"like me on instagram\"","commenter_a":"I don't understand why some celebs consider sharing EVERY aspect of their lives but when they are judged or talked about they immediately ask for 'privacy'.","post_message":"'I demand that I climax': Nicki Minaj gets candid about her sex life in Cosmo - and where she sees herself in ten years.   Grio fam, do you find it refreshing when celebs open up like this? Or is it T.M.I?"},{"comment_id":"1171553619565468","commenter_b":"I can't even watch the View. Those women are bullies and *itches and make me want to slap them.","commenter_a":"Whoopie and Joy make me sick. They are so rude and disrespectful that I'm amazed they still have jobs.","post_message":"Whoopi and Her Liberal Hacks at 'The View' Tried to Bully Trumps Manager, But She Knocked Them The Hell OUT in Front of MILLIONS! (VIDEO)  Everyone's SICK of Hillary's scandals! Lets get 4000 SHARES if you are too!!!"}]
