[{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1152177854802243","commenter_b":"She's a POS lire!!! Qualified! Gimme a break!","commenter_a":"I don't believe a word she says. Right now the most important thing to her is more excuses...","post_message":"A young boy asked Hillary Clinton \"What is the most important part of life?\" Here's her response."},{"comment_id":"1834190730158366","commenter_b":"You get out bitch!","commenter_a":"Thank god its her last ! Disgrace America one more Time. ThanX 4 Nothing. Wear w/e ya Want.... Just Get Out !!","post_message":"Gorgeous!"},{"comment_id":"1280019028698326","commenter_b":"The football players that choose to disrespect all of the heroes that have died for this country, this anthem, this flag and unfortunately for them are lowest ungrateful humans that are part of the big problems of this country. I will not support the NFL in any form until they get rid of the garbage.","commenter_a":"BOYCOTT! Stop giving these spoiled brats their millions of dollars to play around. Then they will respect US!","post_message":"\"To protest against the flag, which stands for the United States of America, it's a disgrace. And if they don't like it they should go play football in Canada.\"  Jim Riches, whose son Jimmy was a firefighter killed on September 11, responded to NFL players like Colin Kaepernick and Brandon Marshall who are choosing to protest the national anthem."},{"comment_id":"10152984956631378","commenter_b":"Alan. Yes, it is murder. Abortion isn't done at 8 months.","commenter_a":"If abortion is totally banned, get prepared for this kind of thing to happen far more often.","post_message":"POLICE: TEEN BEATEN TO ABORT BABY: Police say four family members were arrested after a 14-year-old girl impregnated by a relative was beaten in order to induce an abortion: 6abc.cm/1Q7wchn"},{"comment_id":"10153660324311491","commenter_b":"@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"},{"comment_id":"570057943197857","commenter_b":"Agree with you @username","commenter_a":"That too faced Lib says things a sailor wouldn't say on a drunken night","post_message":"Jamie Lee Curtis ripped Donald Trump for his \"lewd\" comment on Lindsay Lohan."}]
