[{"comment_id":"1143690625715878","commenter_b":"Good thing I'm pregnant!!!!","commenter_a":"Jennie!","post_message":"Warning!"},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"},{"comment_id":"10154142762821756","commenter_b":"Carol Andrews Wilfork ....\"Concerned about appearances?\" Good one! Hillary Clinton would never be allowed to be an angry, cantankerous revolutionary with wild hair like Bernie....she would not make it in American politics. Women have to play a completely different game...and look good doing it or they are toast!","commenter_a":"Perhaps true criticisms of Rubio, but along with Rand Paul find them to be the most rational and reasonable persons at the debates.","post_message":"Some say the first-term Florida senator is inexperienced. Some say he's inconsistent. And others question how his loss in Iowa is being spun into a quasi-victory."},{"comment_id":"10153764783192235","commenter_b":"Right on!!! Most religious women are thought of as breeders. According to religion they were put on this Earth to procreate and nothing else.","commenter_a":"They're not moms, they're breeders. If they were moms, they'd be in favor of children having loving homes instead of languishing in foster care. If they were moms, they'd have been doing what these guys are doing.","post_message":"This little girl is awesome."},{"comment_id":"10154099091164203","commenter_b":"No BITCH, .it's a blog like TRUMP my mind works faster than my finger on a kindle and this blogging is not the most important issue in my life, now run along I graduated HS over 40 years ago, so you grading me is MEANINGLESS......specially since your from Canada.......","commenter_a":"Really? Bull SHIT BLACK LIVES MATTER have been showing up to all the rallies. Only TRUMP supporters are standing up to the fucking ghetto rat's. Go ahead talk OUT both sides of your MOUTH, you just keep confirming the NEED FOR THE TRUMP MOVEMENT.","post_message":"\"My own personal observation is that there is a cycle of behavior that is escalating and it's happening exclusively at Donald Trump events.\""},{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."}]
