[{"comment_id":"1242469175793552","commenter_b":"Righto. Execute the little bitches! That will teach them a lesson!","commenter_a":"Sorry. If you watch the news you cannot just let things go with kids anymore. This time it was pepper that choked the teacher, who knows what would have happened in a few years if another teacher pissed them off........rat poison?? Good lesson to learn early.......being a little psycho bitch is not going to pay off.","post_message":"Three 12-year-old girls have been charged with first-degree felonies in the latest example of America’s insane rush to criminalize children."},{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""},{"comment_id":"979292718775058","commenter_b":"Y hell yeah. I know is I do stupid stuff I would be locked up. She should be treated the same. That don't mess with her because she has money. The poor folks pay the price. The rich walk around like that are untouchable. It bs.","commenter_a":"False!","post_message":"BREAKING: FBI Finally Makes Move To Arrest Hillary Clinton…   Her time is coming to end. Say goodbye.  Would you be happy if Hillary was arrested?"},{"comment_id":"10154796667456037","commenter_b":"#NeverTrump #MakeAmericaGreatAgain","commenter_a":"LMFAO Surprise Surprise !!!!!!!","post_message":"“Why should he get part of my rent, and why should his name be on there?”"},{"comment_id":"234297206973807","commenter_b":"I can't stand this woman. She makes me sick","commenter_a":"Lying bitch","post_message":"Kellyanne Conway just took \"alternative facts\" to a whole new level by mentioning a massacre that never happened."},{"comment_id":"513245565531981","commenter_b":"I rarely say bad things on fabebook , but she 's a real bitch.","commenter_a":"Coulter and FOX's best days are wayyy behind them. Here's hoping this ideology of thiers dies a slow death","post_message":" know what this convention really needed? An angry Muslim with a thick accent,\" she said."}]
