[{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"590662824455343","commenter_b":"This article is a joke. She is telling girls in a country where they are oppressed to believe in themselves. It has nothing to do with hating America or race.","commenter_a":"Get out if you don't like it, and keep your racist mouth shut, you and your husband have been nothing but a thorn in Americas side, glad your done not soon enough.","post_message":""},{"comment_id":"10156552625375354","commenter_b":"Let me try this again without hitting the return button prematurely. The Hijrah is mandated in the Qu'ran. It seems to be proceeding according to their plan. So long as Merkel and her other Western apologists permit unfettered entry in their respective countries, Islamic conquest via mass immigration will have been accomplished even ahead of schedule.","commenter_a":"Islam is not a religion or a race. It is an illegitimate organized group of murderous thugs and has been since it began. Their modus operandi is always the same. The videos in the links are about Islam. @webpagelink . There is more here @webpagelink . Watch the first one. The second link has many more videos by Dr. Bill Warner.","post_message":"Tensions are rising on the Mediterranean Island of Corsica, a province of France, where authorities have banned all public protest..."},{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"606361476221098","commenter_b":"WAKE UP AMERICA! The racists in our White House have no intentions of getting out. *Note* the race baiting going on now and the targeting of police departments. Obama is trying to start a race war so he can federalize law enforcement and declare Marshall Law so he can stay in office. Too many Americans are distracted by gay marriage and flags to pay attention to his real agenda. Look how he has the South stirred up... he knows that's his biggest problem, freedom loving, gun carrying Christens he knows will defend their rights! GOD HELP US ALL!","commenter_a":"Good grief! What do these people want! I have been picked on and had blacks make racist remarks to me all my life! I just keep on keepin on with the Lord! She only feels inferior because she wants to and as usual the whites get the blame!","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."}]
