[{"comment_id":"1824334044515363","commenter_b":"She won't do anything","commenter_a":"Undocumented immigrants pay more taxes than Donald Trump plus a lot of them bring fresh vegetable and cheap food to american tables.. Hillary President !!","post_message":"Donald J. Trump on immigration during final presidential #debate: \"We have some bad hombres\" @webpagelink"},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"569916976504180","commenter_b":"@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the \"Gay panic defense?\" @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"\"Some things are more important than a rock show.\""},{"comment_id":"494457030748305","commenter_b":"Bitch u should forgive me","commenter_a":"@username hope u forgive me","post_message":""},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"1274246805922508","commenter_b":"Of course it's happening in England and if Americans don't wake up, you will see it here too. Open the Bible and read it with your family. it will show you who God is and who this muslim god is. Protect your family at all costs.","commenter_a":"If this is allowed to happen in the US, then mistakes have been made, and someone will need to pay!","post_message":"This school has taken things WAY too far. This is ridiculous. Is this school committing a crime?"},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"}]
