[{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"},{"comment_id":"10153258279033010","commenter_b":"Just give her a whiff!","commenter_a":"The trophy wife gets the gold mine and the kids will get the shaft.","post_message":"Robin Williams' three children are at odds with his third wife over what constitutes \"memorabilia.\""},{"comment_id":"10153720250674877","commenter_b":"And then his white gf walks in the video shot. Lmao","commenter_a":"He's a confused brother. I'm sad for him","post_message":"Black cop’s pro-Trump, anti-protester video goes viral: I felt safe with Trump fans!  Grio fam, what do you think of what he has to say? Would you feel safe at one of these rallies?  Share your thoughts below."},{"comment_id":"10156647323865725","commenter_b":"Marco Rubio supports illegals and anchor babies, no thanks!","commenter_a":"Bring the law suit against that lying politician. His ads are nothing but LIES and the only thing he does with any certainty is to lie about others and make the dishonest ads on TV trying to start a smear campaign. He's an underhanded ,sneaky and despicable person.","post_message":"RESPONSE TO THE LIES OF SENATOR CRUZ:   Ted Cruz is a totally unstable individual. He is the single biggest liar I’ve ever come across, in politics or otherwise, and I have seen some of the best of them. His statements are totally untrue and completely outrageous. It is hard to believe a person who proclaims to be a Christian could be so dishonest and lie so much.   Cruz said I would be appointing a liberal judge when in fact I will appoint a great conservative and I am the only candidate who has gone so far, at the debate, as to suggest two individuals I feel would best represent the conservative values we need to protect: William “Bill” Pryor Jr. and Diane Sykes.   Cruz says I am pro-choice, when in fact I am staunchly pro-life and have been for a long time. Like Ronald Reagan, on many issues, I have evolved.   Cruz says I am in favor of ObamaCare, when in fact I have spoken about repealing and replacing this disaster of a system at every speech throughout my campaign and since it’s inception. Meanwhile, Cruz was responsible for getting Bush to put in the judge that failed to vote against ObamaCare twice.   Cruz says I will try to take away your second amendment rights, when I am one of the strongest proponents of the right to bear arms and I say so in every speech that I have made for years. I am a proud member of the NRA and so are my sons.   Cruz has become unhinged and is lying with the hopes that his statements will go unchecked until after the election and he will save his failing campaign.   In Iowa, Cruz told thousands of Ben Carson voters that Dr. Carson had left the race and to instead vote for Ted Cruz. He apologized when the race was over. Likewise, his fraudulent voter violation form sent to Iowa voters. If Ted is going to continue to lie with such desperation, I have no choice but to fight back.   One of the ways I can fight back is to bring a lawsuit against him relative to the fact that he was born in Canada and therefore cannot be President. If he doesn’t take down his false ads and retract his lies, I will do so immediately. Additionally, the RNC should intervene and if they don’t they are in default of their pledge to me.   I am the strongest on the borders and I will build a wall, and it will be a real wall. I am strongest on illegal immigration, strongest on ISIS, strongest on the military and I will take care of our Vets. I will end common core and preserve the second amendment. I will renegotiate our trade deals and bring our jobs back to our country. I am the only person who will Make America Great Again."},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"1076190982460519","commenter_b":"She has never been distinguished! She has always been a fraud and an embarrassment to our country!","commenter_a":"Stop muddying the waters, Democrats. SMH","post_message":"FBI  Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"}]
