[{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"554818391394376","commenter_b":"@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"10153817887769203","commenter_b":"Michelle will body slam Barry!","commenter_a":"Coming from the first female POTUS this is funny. Obummer, you can't handle your own angry wife let alone Putin....get out of the White House you effeminate jackass","post_message":" can handle a bunch of CNBC moderators at the debate. Let me tell you, if you can handle those guys, then I don think the Chinese and the Russians are going to be too worried about you."},{"comment_id":"10154345885036051","commenter_b":"No second chances for this crazy woman!! That poor girl going thru all those surgerys...","commenter_a":"The sister is right she is not a monster!! She is a crazy bitch! And to me the sister is as bad, would she want the mom released if it had been her that had been put in an oven!! I mean seriously what the hell is wrong with people?? And myself i have a hard time buying the insane bit anymore, to many times it is used to try to get away with doing wrong!","post_message":"When she was only 14 months old, Ashley's mother put her in the oven and turned it up. Her father was able to save her. She spent the next 10 years in and out of surgeries. Now she is 15 and ready to start high school - and she just got some unexpected news about her mother."},{"comment_id":"1225587407484516","commenter_b":"@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."}]
