[{"comment_id":"10153801088312690","commenter_b":"But that's just it. It's not about the transgender. In fact its nothing against them. It's about the fact that it now opens the door to any man out there. How do they want to strip women who were born women from there rights??? How do they want to take our safety and security. And yes a sexual assault can happen anywhere. We get it.","commenter_a":"Show me one article where a transgendered person assulted someone in a bathroom and I'll show you 10 where a priest, football coach, or teacher did the same thing.","post_message":"President Obama will issue an executive order that public schools must permit transgender students to use bathrooms consistent with their gender identity. Who should make that decision?"},{"comment_id":"579018038952469","commenter_b":"Safi Cedrick Varda this actually aired like today ..... in 2016!!!","commenter_a":"What was the point of this?","post_message":"They actually aired this."},{"comment_id":"723350911147017","commenter_b":"All this after making remarks that all Mexicans are criminals and rapists and we need to isolate ourselves from them by building a wall between the United States and Mexico at the expense of the Mexican Government. Then hiring undocumented Mexicans to work in his hotels and casinos with no unions to represent them, offering to compensate them under the minimum wage, then refusing to pay them. Now, trying to entice them into voting for him? Unbelievable!","commenter_a":"Say whatever?","post_message":"This should go over good with the GOP! ~Kay"},{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."},{"comment_id":"10153203354164071","commenter_b":"I also voted for Romney and would do it again. The Presidency was 'stolen' from him.","commenter_a":"Vice President Romney","post_message":"Mitt Romney just unloaded on President Barack Obama's foreign-policy legacy."},{"comment_id":"10153824514356336","commenter_b":"Yeah, build a wall. That'll do...uh ABSOLUTELY NOTHING.","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the \"stone\" rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a \"stumbling stone\" for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"}]
