[{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"},{"comment_id":"968965946477597","commenter_b":"Because boys can't Nadia.","commenter_a":"BOYS get to MAKE lightning??? All I got to make was BABIES!!","post_message":"Wellllllll, that's disappointing to see. (via The Huffington Post)"},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."},{"comment_id":"10153656490006107","commenter_b":"Mrs. Paul rocks!!!! Ron put down that economics book and take Carol to dinner!!!","commenter_a":"This election cycle by far has been the craziest one I've ever witnessed. The one question I can't seem to get an answer to is this,,, WHY??? Why are both sides attacking Trump? Why is China attacking Trump, Why is the pope attacking Trump? Why is Mexico attacking Trump? Why are the Republicans going against their own pledge and attacking their own front runner? Why is HilLIARy so afraid of Trump? Why does Trump have this Republican Party split? Why is Mitt Romney going after Trump? Why are the Koch brothers dumping in 75 million dollars to go against Trump? This isn't normal, something doesn't add up and we need to be smart enough to see through the the smoke and mirrors why they are quickly exposing themselves as the try to take down Trump before #SuperTuesday Here's my theory, it goes back to the age old question how to ...","post_message":"Happy Birthday to Carol Paul, an amazing woman, mother, and advocate for liberty. Thanks for making me the man I am today, Mom. Happy Birthday."},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."}]
