[{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  \"Under whose authority?\" she was asked. \"Under God's authority,\" she said."},{"comment_id":"664601907063721","commenter_b":"What a FFFFFFFFFFing Bitch.","commenter_a":"Yes","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , \"ay 3 big Macs to the front, this fatass just walked in here...\" built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* \"uhh tf I'm supposed to do with that?\" Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' \"Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph\" lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass \"wanna hot dog on a stick?\" Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"},{"comment_id":"10153513260681770","commenter_b":"I have something to say to this wet back. Guess.","commenter_a":"Yeah I don't like him at all !","post_message":"George Lopez has something to say about Donald Trump."},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10154584633716955","commenter_b":"I think she should move to Mexico!!!","commenter_a":"I'm thinking she would have done that whether she won or lost.","post_message":"TIRED HILLARY"}]
