[{"comment_id":"1372477109489879","commenter_b":"She can take a shower and be clean afterward! Lol","commenter_a":"If the girl wanna be clean.. Let her be in peace...","post_message":"'Alaikum salam'"},{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"590455354461864","commenter_b":"FEELTHEBERN AMERICA ! With occupy we had no leader ! Now with the peoples political REVOLUTION we have Bernie Sanders ! Look out corporations were coming to take our government back , your trickle-down has trickled out !","commenter_a":"He one ONE more delegate in MI and LOST by 20 in MS! That is not a win!","post_message":"WOW!"},{"comment_id":"10153971816072869","commenter_b":"Ugly nasty ol bill has givin her what she never wanted ol monica. Diseased up hoes.","commenter_a":"Why isn't the Mainstream Media talking about this Story?? News - 1) ABC News executive producer Ian Cameron is married to Susan Rice, Obama's National Security Adviser. 2) CBS President David Rhodes is the brother of Ben Rhodes, Obama Deputy National Security Adviser for Strategic Communications. 3) ABC News correspondent Claire Shipman is married to former Obama Whitehouse Press Secretary Jay Carney. 4) ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama Deputy Press Secretary. 5) ABC President Ben Sherwood is the brother of Obama Special Adviser Elizabeth Sherwood. 6) CNN President Virginia Moseley is married to former Hillary Clinton Deputy Secretary Tom Nides.Etc... etc... Get the picture? Please copy and share *Muslim influence in America*: John Kerry's son in-law is an Iranian Muslim and, the best man at their daughter's wedding was the son of the man Kerry negotiated the Iranian Nuke Deal with. John ...","post_message":"NO deed goes unpunished..."},{"comment_id":"598112180339217","commenter_b":"@username buzz off back to the Rove hive","commenter_a":"How to Steal an Election 101...Despite winning Wyoming 56-44 percent on Saturday, Bernie Sanders will split the pledged delegates evenly with @username, plus Clinton gets the state's 4 superdelegates, tilting the delegate count to her favor, 11-7.","post_message":"We need a leader who will bring us together—not drive us apart."},{"comment_id":"10154262927371519","commenter_b":"What a faggot","commenter_a":"She was just on Rachel Maddow. I was in tears. This has to stop.","post_message":"He also threatened to rip off her hijab."},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"}]
