[{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"449954205192873","commenter_b":"\"IF YOU CAN'T FEED'EM DON'T BREED'EM! Stop breeding all these kids you expect the taxpayers to feed.","commenter_a":"A border, by definition, is a division. Do they expect us to forfeit our sovereignty ?","post_message":"They think our borders create division..."},{"comment_id":"10153308382443145","commenter_b":"How sad ! Ban the Frat !!","commenter_a":"Two bills allowing guns on college campuses are about to be introduced. Alcohol, hubris, testosterone, guns. What could go wrong?","post_message":"The UCF chapter of the Sigma Nu fraternity was suspended after a video surfaced of a member chanting the word \"rape\" and encouraging sexual violence toward women, the university said. The organization will have a formal hearing Thursday. #wftv"},{"comment_id":"1044120348961770","commenter_b":"Whore...like she has any brains...","commenter_a":"Paula you've had your 15 minutes.","post_message":"The woman who sued Bill Clinton for sexual harassment two decades ago doesn’t want him back in the White House."}]
