[{"comment_id":"10154965744184641","commenter_b":"I would agree that would be a good reason to March however that March said absolutely nothing about this. As a matter of fact the lady running the March believes in Sharia law and in her belief system this is perfectly acceptable","commenter_a":"This why we march. This is not acceptable for ANY culture.","post_message":"When she was 12, she was sold into \"marriage\" with a 70-year-old man -- and there are hundreds like her."},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"848274368622676","commenter_b":"I tryed to watch it but everything else came up.... I agree with her 100% they are to demanding going into a new country.... You Muslims have good strong boy's ( can;t call them men chicken shits) send them back to fight you own war and not us !!!!!","commenter_a":"Makes me wonder what the hell is the matter with Islamic women? Can anyone answer why any women, with the way they are treated under Sharia, would want to be part of that? Disturbing","post_message":"OMG. If you only watch one video tonight, watch this Brit go off... on a Religion Of Peacer who told her to 'Shut Up!' This is an EPIC, unscripted, blast that you will probably love. @webpagelink"},{"comment_id":"10153086796225927","commenter_b":"That's funny cause white asain Mexican Irish an all the others can do it..but somehow the black father is the victim for leaving families an going to make another broken home","commenter_a":"That's crap. You choose your own way like everybody else.","post_message":"LISTEN as Reverend Cecil Blye CONDEMNS government's role in destroying the black family:  \"[T]here can be no Great Society when government involvement incentivizes family disintegration, making it more profitable to cohabit than to be married. ...\""},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"1100928479922812","commenter_b":"Do you even beleive in smart women?","commenter_a":"Maybe compared to all the stupid people who support them they seem smart. The one eyed man is king in the land of the blind !","post_message":"I am not one of these people that thinks Hillary Clinton is The Smartest Woman in the World.  I don't think Elizabeth Warren's The Smartest Woman in the World.  What happens here is that whatever liberal female rises to prominence, it's just standard operating procedure that the media and everybody's gonna refer to them as The Smartest Woman in the World."}]
