[{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"10153869953961680","commenter_b":"I'd rather see him on the Supreme Court.","commenter_a":"My dream for \"O\" is that he picks up where MLK left off. That he becomes a source of moral courage and reconciliation and justice for all of us here in America and around the world.","post_message":"President Obama: “He knew better than the cynic that if you look at the arc of history, human beings should be filled not with fear but with hope.\""},{"comment_id":"10155447745046509","commenter_b":"HAHAH NNeta Fitria","commenter_a":"She works at Comcast now and has hung up on me 7 times.","post_message":"\"Ain't nobody got time for this.\""},{"comment_id":"10153507892259203","commenter_b":"Figure out how to get guns from criminals. They won't follow the law and they the criminals are the problems. Use a little common sense. Let's fix places like Chicago were control is not working. Or do no lives matter.","commenter_a":"If you go by empirical data from countries with gun restriction laws to those that don't. ...it's a no brainer decision. ...gun control and restrictions DO work. The data shows less of these types of crimes. Does it completely stop gun related violence (where a gun was used to commit a crime)....NO. Does it lessen the chances of these crimes from happening. ..YES! Its been proven that there are less crimes where guns are used within countries with solid gun control laws...period. Every country that has gun restrictive laws and gun control is a prosperous nation whose avid hunters and gun clubs (shooting ranges) also prosper. Now if your argument and reason for no gun control is because you have the right to defend yourself...THEN you must also believe that the world would be a safer place if every country in the world had nuclear weapons to defend themselves... the ...","post_message":"Bill Maher blames right-wing media and Fox News for Charleston: \"They present a really twisted view.\""},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"},{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":""}]
