[{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."},{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":""},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"535308666651013","commenter_b":"Go Hillary!","commenter_a":"One thing is clear, They are terrified of Hillary and they hate America. Smh","post_message":"A twisted mindset."},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""}]
