[{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""},{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"},{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"884398511671457","commenter_b":"This woman is an absolute idiot","commenter_a":"Love to see you going to jail have a nice day by by.","post_message":"The message of Hillary Clinton's victory speech last night could not have been more different than Donald Trump's. Whose message is better for the country?"},{"comment_id":"460222577435670","commenter_b":"Build the Wall, send all illegals home with the babies, end sanctuary cities, take care of our Vets and end abortion. Yippee!! Go Trump.","commenter_a":"Everyone like how he \"tells it like it is\"---after he becomes president and tells YOU the truth about yourselves, don't call for impeachment!","post_message":"When asked for the reason behind his recent political success, Donald Trump gave this simple answer."}]
