[{"comment_id":"10152989925996234","commenter_b":"Guess women will always be in danger after all. Even from those who sworn to serve and protect. Never marry to a cop with a badge, a gun, and a bad attitude","commenter_a":"Wow They did not hesitate to shoot an unarmed blacks. But hesitated when one of their own goes rough and shoot his wife killing her.","post_message":"A witness had a front-row seat to the tragedy that unfolded as Sgt. Phillip Seidle, police said, ambushed Tamara Seidle with a hail of bullets before surrendering."},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"490189094517729","commenter_b":"USE PEPPER SPRAY TO PROTECT HER......SHE IS A MASTER PHD CROOK LIAR....THIEF....","commenter_a":"Cheating Trump is lying when he open his mouth and lied when he closed it. @webpagelink","post_message":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!"},{"comment_id":"10154364862976336","commenter_b":"Shes an accomplice then! Lock her up too!","commenter_a":"Put her in jail or kill him. Sounds like she knew!!!","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."},{"comment_id":"10152932852611378","commenter_b":"Give her a better intersection ! I'll take the intersection. ! This intersection should be for a young person , a person that's quick on their feet! Firing her doesn't solve nothing ! Crazy intersection","commenter_a":"Her attitude is disgusting; it's like I'm entitled to get paid just for showing up!","post_message":"A lot of people were talking about this 6abc Action News HIDDEN CAMERA Investigation before it even aired! Now here's the whole story. A crossing guard, who is paid to walk kids across a busy intersection, stood by as groups of children bolted across traffic, but she didn't help walk them across to safety. Plus, hear this public servant's interesting response, when we ask why she isn't doing her job to keep students safe!"},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"}]
