[{"comment_id":"480862922104288","commenter_b":"Let them go swim in there on country. We dont need them polluteing our pools.All that goat hair will mess the pool up.You want be able to drain it.","commenter_a":"Send these people packing","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"1119027841463579","commenter_b":"Julie, if you want perky get a coffee maker. Geez.","commenter_a":"Wouldnt Dr Carson be a more appropriate choice for Dr Jeffers to endorse? Dr Carson doesnt bash anyone like Trump does. Trump is so rude. Im embarrassed for First Baptist Church.","post_message":"\"It's not that Evangelicals have given up on their values, but they no longer believe that government can uphold those values.\"  Today on \"FOX & Friends Weekend,\" Dr. Robert Jeffress explained the \"huge paradigm shift\" in what Evangelical Christians are looking for in a candidate."},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"10155133952496162","commenter_b":"@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.\" Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"},{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."}]
