[{"comment_id":"1404388792935308","commenter_b":"For those of you that vision oriented. 😝","commenter_a":"Michael is a cutie, btw. 😉","post_message":"You have to admit that this is a pretty great way to highlight the hypocrisy of anti-trans politicians."},{"comment_id":"1142218742523327","commenter_b":"No just Hillary now get back to your cat.","commenter_a":"They go together both fruit cakes","post_message":""},{"comment_id":"10153304672057377","commenter_b":"@username, you are just giving me TONS OF REASON ! As i said............, if there are no \"illegals\" to pick it up...............IT ROTTS on the ground.........! They are the ones who pick the fruit and vegetables !","commenter_a":"Trump will be in New York next year ! If anyone thinks that he can win the Presidency calling names to every minority in this Country, better have something else to sleep well because Donald Trump will never be President of the United States of America !","post_message":"The Rev. Franklin Graham Thursday suggested that Pope Francis \"build a bridge\" to Republican front-runner Donald Trump because \"who knows where he may be this time next year.\""},{"comment_id":"10153244727383352","commenter_b":"such a bitch whore ,","commenter_a":"And In \"Other Breaking News...\" Kim Kardashian is laughing all the way to the bank! !","post_message":"Kim Kardashian gets slammed on Twitter for her new Super Bowl T-Mobile ad where she shows off her body while taking selfies"},{"comment_id":"10154365677768008","commenter_b":"I just hope she don't hide when she delivers.","commenter_a":"Your Holiness, thank you for all you do for the world if you are watching!","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"980159212038244","commenter_b":"build a wall around this state.","commenter_a":"Hang the son of a B... Sheep F'r! Make an example of him!... we don't tolerate this crap in our Country!","post_message":"BREAKING: ISIS SUPPORTER Arrested In Michigan Before He Could Carry Out This Plan [Video]  “It is my dream to behead someone”"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"}]
