[{"comment_id":"923311821095206","commenter_b":"Mexicans never botherd me. Keep'em! Deport Trump!!-","commenter_a":"Not a good idea!!! Go Trump","post_message":"Excellent idea! Share if you support this.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153515139311680","commenter_b":"Hillary already knows she's becoming the POTUS. There's nothing stopping her. We will have a female president! Can't wait. #ImWithHer","commenter_a":"It's just riding off of the success of Bill because nobody likes her","post_message":"Hillary Clinton: \"I’ve told my husband he’s got to come out of retirement and be in charge of this, because you know, he’s got more ideas a minute than anybody I know.\""},{"comment_id":"10153429350692623","commenter_b":"She would have gotten her old azz beat. Period!","commenter_a":"My question is what did these people do to provoke the volunteer? Why did they not comply with her request to leave and then they could have gone to someone else for help. I have seen people treat the volunteers like dirt- maybe this woman couldn't take it any longer. Don't judge unless you were there and saw the entire event unfold.","post_message":"Wake Forest Baptist Medical Center is responding to a disturbing incident caught on camera involving one of their volunteers."},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."},{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"\"The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."},{"comment_id":"10153161344347507","commenter_b":"with balls like that, she is a man","commenter_a":"Maybe she'll find same sex love in jail and change her tune","post_message":"If she didn't want to do the job she was elected to do, why is she still there?"},{"comment_id":"1021077537953055","commenter_b":"Stupid assbag thug asshole !! Stupid is as stupid does !","commenter_a":"yes","post_message":"Chevez Antwann Fiason wasn’t expecting this homeowner to be armed. This is why Americans have the right to bear arms. Can we get 70,000 ‘LIKES’ for the Second Amendment?"}]
