[{"comment_id":"977342359028683","commenter_b":"I HAD SEVERAL FRIENDS AND FAMILY MEMBERS KILL IN AUTOMOBILE ACCIDENTS !! WE NEED STRICTER LAW AGAINST AUTOMOBILE OWNERSHIP","commenter_a":"all of you who do not think ammunition and gun availability should not have stricter laws have never had a loved one killed by some mentally handicapped person who had access to this. and if the ammunition and gun manufacturers did not feel there would be laws suits then why did they pay Congress to pass laws so they could not be sued?","post_message":"\"We are relegated to second class citizens. Our civil rights have been taken away from us through this lawsuit. We cannot sue for someone that sold the ammunition. Who's turned out to be a mass murder ... sold him everything he needed to commit this heinous act.\"  Lonnie Phillps"},{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."},{"comment_id":"10153369808282377","commenter_b":"GOD BLESS PRESIDENT TRUMP...Donald Trump For President","commenter_a":"I guess I am again confused. A few days ago there was a story about Donald Trump giving both Dr. Carson and Sarah Palin a potential job in his administration should he get the Presidency and there was a great cry from many who said \"That is illegal\" Now Cruz names an entire National Security Team and it is OK? I have no problem with either of them talking about their potential teams, I just wonder why Trump's potential plans are \"illegal\" and Cruz's potential appointments are OK?","post_message":"Ted Cruz's national security team includes former Assistant Secretary of State Elliott Abrams, former Missouri Sen. Jim Talent, and former U.S. Attorney Andrew McCarthy."},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"1345340232144440","commenter_b":"@username, strong women do not build economies on murder of other countries and arming terrorists. That is a woman in bed with Big Money.","commenter_a":"I thought I was following an intelligent, thoughtful and insightful site, obviously not. Frightened of a powerful women I see, like most insecure men. We're use to it, but good luck with that ideology going into the future.","post_message":"EDWARD S. HERMAN: Hillary Clinton is a neo-liberal and pre-eminent war-monger. I think she is the most dangerous person living in the world today, given her highly likely election victory and her likely performance as president.   Trump is a self-promoting windbag, racist and dangerous, unpredictable phony. We have a ghastly choice in these two. Jill Stein offers a protest opportunity, more so than not voting. On the line that either voting for Stein or not voting would constitute a vote for Trump, one might argue that a vote for Hillary Clinton is a vote for war with Syria and Russia"},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"},{"comment_id":"10154406846618734","commenter_b":"Really lady get over yourself. All you want is Money!!","commenter_a":"This is where feminism has brought womyn: seeing themselves victimhood is the highest calling of all.","post_message":"Do you think the claim is too much? Or just right?"}]
