[{"comment_id":"10153527716947623","commenter_b":"Trump will get enough advertising on Buzz feed by way of the anti Trump protestors acting like idiots. If you watch a video of people getting assaulted and are ok with it then you don't have much of a moral character. Why should America allow illegal immigrants to keep coming in and why shouldn't we have the ones here deported? There are legal ways of coming to this country use that rout and people will respect you more. Don't want to become legal then don't come to the USA. Stay in the country you are from.","commenter_a":"Wow, this is pretty pathetic. Considering Trump's numbers I believe we can infer he'll continue to do just fine without Buzzfeed's advertising lol. Can't wait to see their reaction this January! #Trump2016!","post_message":"\"We don't run cigarette ads because they are hazardous to our health, and we won't accept (Donald J. Trump) ads for the exact same reason.\""},{"comment_id":"10157053250220354","commenter_b":"She can't keel over soon enough. Evil beast!","commenter_a":"She's choking on all her lies!","post_message":"“You all right? Any mouth to mouth CPR?” one of the hosts joked, trying to lighten the mood.  “Senator, you coughing like you have something medicinal,” another host said.  LISTEN:"},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"1137397219630950","commenter_b":"Hey Josh this chick is tripping. Lol","commenter_a":"#newyorkvalues","post_message":"“I don’t want money, I’m going to rape you.”"},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"10153253849621955","commenter_b":"Poor rich spoiled brat she thinks she's and her stupid husband ruthless she no First Lady you wouldn't see Jackie Kennedy acting like her.","commenter_a":"WTF.","post_message":"MICHELLE OBAMA: Emotional toll of being a black first lady..."},{"comment_id":"1789863337898793","commenter_b":"NO !","commenter_a":"Like a dog misses fleas!","post_message":"Will you miss having President Obama in office when his term ends?"}]
