[{"comment_id":"1859557927611142","commenter_b":"Will be done if u pulled this shit lmao","commenter_a":"@username lol😂😂😂","post_message":"Cold! #WSHH"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the \"chickification\" of the news — which gives it a female-friendly slant."},{"comment_id":"1817577751825895","commenter_b":"Another good \"Christian\" pedophile! Family values liar! Beat him ,castrate him and put his sorry ass in prison for Ever!","commenter_a":"Oh my God, I watched this show, everyone of them were so talented, they are all beautiful, the kids were adorable, always dancing and singing, even the very youngest, the Mom was warm and loving. I really believed they were a great family, this is so very sad.","post_message":"Another \"family values\" hypocrite goes down in flames..."},{"comment_id":"10153897957233352","commenter_b":"Stfu","commenter_a":"He was a menace to the world. He destroyed so many lives so that he can so call keep the children of Columbia to stay away from drugs. What a bum. He destroyed lives right here in the USA., way too many.","post_message":"My life with the world’s most infamous drug lord: Pablo Escobar’s son reveals the heartbreak, fear of violence and how his father once burnt $2MILLION in cash to keep warm one night on the run"},{"comment_id":"10154894938720295","commenter_b":"Victoria bc watching","commenter_a":"I see it","post_message":"We're on baby watch again! Will today be the day that April the giraffe gives birth? Thousands of people have been glued to this video for days, waiting for any sign of her calf!  (Video courtesy: Animal Adventure Park)"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"1056097081119075","commenter_b":"These lowlife Muslims are doing that in every country they are aloud into ! It's even going on here in America . It's how they take over a country without fireing a shot , they just out reproduce the natives and within a decade or two they will out number and be able to inpliment sharia laws ! We know Muslims have completely taken over one American city and are working on many more ! All these Muslims Obama has been bringing in are sent to certain cities for a reason ! Obama and Hillary are traitors and she will just pick up were Obama left off !","commenter_a":"Surprise, surprise.","post_message":"Muslim Pig Explains How He LIED To European Authorities To Bring In 4 WIVES  They are all about gaming the system and abusing our freedoms.   @webpagelink"}]
