[{"comment_id":"450316191825628","commenter_b":"Fuck that dumb bitch!!!!!!!!","commenter_a":"bye bye Michelle, go peddle crazy some place else. Go ask the thugs in Chicago for their guns first. Try going there without a cop. LOL","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"},{"comment_id":"10153689557537434","commenter_b":"Always. I have a dirty job so it is necessary.","commenter_a":"Nope.","post_message":"Please take this poll so we can figure out how gross we all are."},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."},{"comment_id":"998886506840133","commenter_b":"How about Obombas birthday?","commenter_a":"stupid dicision","post_message":"NYC Schools Close for Muslim Holiday for First Time  @webpagelink"},{"comment_id":"511888302293280","commenter_b":"this man deserves the right to express himself he fought for our freedom and i thank him and all vets it was not a bullshit war no war is bullshit lives are lost and families are destroyed we need to get back on track in this country starting with respect for each other","commenter_a":"Just because you fought in one bullshit war doesn't mean you automatically get a platform to spout your opinion about crooked cops claiming BULLSHIT on disenfranchised citizens are starting another war! Those killed by cops are ALSO AMERICANS...just FYI.","post_message":"When  asked if he was concerned about his safety, he said, “I’ve seen more than all this. I’ve been through the riots already.”  -Linda"}]
