[{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"},{"comment_id":"621932114627042","commenter_b":"NO MORE POLITICIANS. OR WORSE, A POLITICIAN/LAWYER #TRUMP2016","commenter_a":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. DETAILS: @webpagelink","post_message":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. ---------------------------------------------- The Donald is coming to Pittsburgh."},{"comment_id":"10153008527037894","commenter_b":"Women can preach, but I don't feel like doing bible study to prove it.","commenter_a":"I thought the bible said that women weren't allowed to preach...","post_message":"Watch: Distraught ‘Christian’ Lady Loses Her Everlasting Mind Over Marriage Equality [Video]"},{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"}]
