[{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"10152702377667869","commenter_b":"Praying that God leads you to serve in the best way possible.","commenter_a":"We will miss your show","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10153312043927061","commenter_b":"I'm sure she is a smart cookie, given her education, but why can't these men date women their own age?!","commenter_a":"Such mean comment .. Wow!!! I sure she's a very nice person.","post_message":"Congratulations, Ryan Phillippe! The actor is reportedly engaged to his longtime girlfriend. @webpagelink"},{"comment_id":"724107867720000","commenter_b":"send thim all home, they dont belong in the USA.","commenter_a":"you dont like our flag go home","post_message":""},{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"10153165727051770","commenter_b":"No to Muslim Migrants..call congress..made four calls today..totally agree..Europe is in chaos..rapes and violence..and the media does not talk about it","commenter_a":"Yes sir, exactly what we need. Thank you for caring for the true Americans.","post_message":"BREAKING: Donald J. Trump calls for a moratorium on allowing Muslims to enter the United States.  \"Until we are able to determine and understand this problem and the dangerous threat it poses, our country cannot be the victims of horrendous attacks by people that believe only in Jihad, and have no sense of reason or respect for human life.\""},{"comment_id":"1349633901749900","commenter_b":"@username, real women protect their babies, not kill them","commenter_a":"Any \"man\" who wants to try to control what women do with their body is a worthless piece of feces and they will be treated as such.","post_message":"The gift of life must be protected from the slaughter!  Click here to sign your petition in support of the Life at Conception Act!  @webpagelink"}]
