[{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"},{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"\"Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.\""},{"comment_id":"942535009139581","commenter_b":"get over yourself girl","commenter_a":"So girls/ladies do you go phoarrrrr when poldark shows you his chest? If so you cant complain.","post_message":"The wolf whistling debate has got VERY heated"},{"comment_id":"1602419506718167","commenter_b":"Ah yes blame everything on women. Typical","commenter_a":"Maybe because women control everything and dont put out these days unless you're a fucking broke ass bum loser with no future","post_message":"So higher house prices, higher tax, higher tuition AND less sex??"},{"comment_id":"10154153338147908","commenter_b":"@username norway. now stfu","commenter_a":"Commie Bernie vs. Socialist Hillary= end of Freedom.","post_message":""},{"comment_id":"10154111897691813","commenter_b":"Do illegal aliens have constitutional rights?","commenter_a":"Good to know. But I was told one time, Border Patrol agents can effect a search of your vehicle WITHOUT a warrant, and up to 12 miles from an international border.","post_message":"ICE is targeting families who have fled some of the world’s deadliest countries – escaping persecution and uncontrolled domestic and gang violence. Know your rights.  More information at: @webpagelink"},{"comment_id":"10153198327501051","commenter_b":"Love the whole idea!!","commenter_a":"They have French one's in Canada","post_message":"Are you okay with requiring all businesses to conduct their dealings in English only?"}]
