[{"comment_id":"10153445603501051","commenter_b":"If I was the Dad I would be the one in jail...I would had killed that bitch over and over again","commenter_a":"Sorry if I was dad he wouldn't be in Jail he would be in the ground dead!","post_message":"When the boy's 11-year-old sister saw what was happening, she threw herself at the attacker and screamed for her father. But at that point it was too late."},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."},{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"}]
