[{"comment_id":"10153266875433010","commenter_b":"Except for leaving him to near starve and die for 66 days","commenter_a":"God is good all the time... :-)","post_message":"His family reported him lost at sea 66 days ago. He said he survived by rationing his food and drinking rainwater.  “...everyday I was like, 'Please God, send me some rain, send me some water.'\""},{"comment_id":"10154847976925560","commenter_b":"This is so sad and disgusting...and women kill for these bags.","commenter_a":"This is just bullshit","post_message":"This is why Hermes & Louis Vuitton bags have those bumps on them. [GRAPHIC]"},{"comment_id":"10156113293015725","commenter_b":"all you haters can eat a bag of liberal dicks!","commenter_a":"That's okay - Presidents don't have time to run Celebrity Apprentice! You will be busy saving our country!","post_message":"Congrats to my friend Arnold Schwarzenegger who is doing next season’s Celebrity Apprentice. He'll be great & will raise lots of money for charity. To all my fans, sorry I couldn’t do The Apprentice any longer— but equal time (presidential run) prohibits me from doing so. Love!"},{"comment_id":"10152968850756519","commenter_b":"Affirmative action laws are in place. Maybe she could work to eliminate them all so that we all get a equal opportunity in education, employment and business instead of posing as a woman of color and cutting in front of EVERYONE ELSE in line..lol, Caitlin Jenner can cut in right behind her.","commenter_a":"1 Rachel Dolezal = appropriation/ race traitor and an abomination. 1 million \"Rachel Dolezals\" = 1 million \"less racist\" white people, who are fighting for the advancement of colored people. Weird to think about.","post_message":"Rachel Dolezal finally speaks: \"As you probably know by now, there are questions and assumptions swirling in national and global news...\""},{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10152838610772144","commenter_b":"We get it, dude. Strong, intelligent women scare you.","commenter_a":"Filing charges for social media is ridiculous, it wont stick","post_message":"\"The amount of gender violence that I experience is absolutely extraordinary. And a significant part of my day today will be spent filing police reports at home about gender violence that's directed at me in social media.\"- Ashley Judd"},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."}]
