[{"comment_id":"10154431713909411","commenter_b":"It would be good only if happen in America, Israel, Saudi Arabia, Turkey, England or some another war spreading and terror supporting country. All what happen in peaceful countries is bad and for regret. Thos who spread death around world, deserve it back in they own country.","commenter_a":"Good.","post_message":"BREAKING: Accident happened in Hualien County on Taiwan's mountainous eastern coast"},{"comment_id":"10155254328488690","commenter_b":"ALL THOSE WOMEN AND THEIR HUSBAND ARE ALL TERRORIST ..THEY SHOULD HELP THEM SELF'S AND SOLVE THEIR PROBLEMS NOTING ONE CAN DO TO STOP THEM FROM DOING EVIL IS INBORN IN THEM ....THEY ARE BORN WITH EVIL AND GROW UP WITH EVIL SO LET THEM PAY FOR THEIR EVILS","commenter_a":"Is today that you learned to join in hand to fight boko haram... What kind of leaders are you... You waste much time and innocent people lost their lives... The same thing happens in Libya president was been killed. Non of African leaders contribute a trip to help him... Everything UN and we gain nothing... Africa let's stand for our own... Bob Marley was a mixed blood yet he loves Africans and fight for you throughout his musical... Africa unit...","post_message":"\"The governments of Cameroon, Chad, Niger and Nigeria engaged in fighting against Boko Haram must take seriously their responsibilities to protect civilians.\"  - Winnie Byanyima & Jan Egeland"},{"comment_id":"1677003925887340","commenter_b":"@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say \"bomb them and take their oil\". How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"10153085951882507","commenter_b":"no problem at all, as long as the part of the ----> well regulated militia <------ is the main factor, and not as is current, --> any inbred psychopath can buy any number of military grade weapons and high capacity magazine and then proceed to walk into restaurants with them.","commenter_a":"So this of course applies to second amendment rights also, correct?","post_message":""},{"comment_id":"10156122397820354","commenter_b":"Hang her worthless ass for treason!!!","commenter_a":"Sickening","post_message":"Yesterday, a defiant Hillary told the AP she wouldn't apologize for endangering U.S. national security with her unprecedented secret server scheme. Today, she flipped.    FACT: No other Sec. of State in American history has EVER set up a secret private server. Period."},{"comment_id":"10152981477461717","commenter_b":"Sissy bitch is not a word used to just discriminate against gays. Sheesh. Stop trying to be a victim.","commenter_a":"Donald Trump for president! Fuck that sissy bitch Anderson.","post_message":""}]
