[{"comment_id":"10152816075404753","commenter_b":"Wtf?? They should def prosecute dem bitches fym.. they gone go and do that same shit over over again smh","commenter_a":"When we know better we do better.so much apparently went wrong way before the baby was born. Let's solve all the issues leading up to the drop off.lack of birth control lack of medical attention for both mother and child.lack of protection from sexuality transmitted diseases.we all failed here.so let's beat up the mother who had the cottage to face up to the fact that she lacked the ability to raise this child.we can do better than this","post_message":"Colorado has a Safe Haven for Newborns Law, which means a parent can drop off a baby at a hospital or fire station within 72 hours after birth without being prosecuted."},{"comment_id":"10154113353450329","commenter_b":"@username the souls one makes me think of you lol","commenter_a":"Elyse Landolfi","post_message":"keep it simple"},{"comment_id":"10152814272036973","commenter_b":"Dogs hurt others to protect themselves, their pack, or their belongings out of instinct. Humans have the ability to think before they hurt others, yet they still choose to do it. This is why I care about animals more than most people.","commenter_a":"To bad people don't care bout homeless people as much as they care about dogs. Smh","post_message":"Every day, on average, three dog bites serious enough to break this skin are reported to authorities in the Portland area. In round numbers that's roughly 1,000 people injured annually."},{"comment_id":"10152647217041680","commenter_b":"Oh no!!! Millions of jobs added with deficits cut by more than half!!! Stop the tyranny!!!! #TeaPartyFail","commenter_a":"Only 679 days left of Scum Monkey Rule.","post_message":"German Foreign Minister Frank-Walter Steinmeier was reacting to a letter signed by 47 Senate Republicans warning Iran that any nuclear deal it strikes with Barack Obama will be non-binding and easily undone. @webpagelink"},{"comment_id":"10153227457334170","commenter_b":"Rush says Ted Cruz is one of the most intelligent people he's ever talked with.thats good enough for me.so tell old has been Pete go jump and take all the other old pretenders with him.if we r only left with the tea party just think what we could do!!!","commenter_a":"Please do.","post_message":"Pete King says he may \"jump off a bridge\" if Ted Cruz is nominated...."},{"comment_id":"10154969261539575","commenter_b":"That's supposed to be the case","commenter_a":"I was once told that the firechief is boss of a fire what he said goes","post_message":"The Cannelton Fire Department chief was arrested after police say he shoved an officer multiple times at the scene of a fire."},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."}]
