[{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10154512852146350","commenter_b":"@username I'm well aware that her mother is white. Someone should let HER know that","commenter_a":"Alicia Keys is so talented and beautiful. It's really a shame that she's a racist.","post_message":"\"It's about just being who you are and not letting anybody tell you who you should be, Alicia Keys said."},{"comment_id":"10155066289616336","commenter_b":"@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10152896825378635","commenter_b":"What cowards!!! Five against i woman!! Day of judgement belongs to the Father\" Animals!!! There will be no rest , or prizes , at end of life for you .. How C an you be so dumb!!!! .so so evil ... Under the control of satan, and do not even know it!!!","commenter_a":"There are bad people in every religion.","post_message":"\"The five Muslims took hold of me, and they raped me there,\" the church source quoted the daughter as saying. \"I tried to scream, but they threatened to kill me. One of them said, 'Your father should stop this prayer meeting of trying to change Muslims to become Christians and close the church building — we have warned him several times.'\""},{"comment_id":"10153964436169705","commenter_b":"@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"10155662877255354","commenter_b":"She is f#$%&@+ stupid.","commenter_a":"Fucking stupid liberal fuckers","post_message":"And look how much the fine would be if you didn't."}]
