[{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"10153264086439342","commenter_b":"All you women bashing this woman are evil! Women are the quickest & most harsh to tear another female apart! Low life, heartless, evil women!","commenter_a":"The amount of alcohol that it would take for me to touch that would kill me...","post_message":"A Spring woman says she was sexually assaulted by a deputy during a traffic stop earlier this summer."},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"},{"comment_id":"10153899711236509","commenter_b":"I'd hate to see when an STD breaks out lol!!!","commenter_a":"Mahalia","post_message":"Imagine living in a town where everything you need is under one roof. Welcome to Whittier: @webpagelink #GreatAmericanStories"},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"10152619091801636","commenter_b":"Read, stupid cow, before you open mouth: @webpagelink","commenter_a":"Smart people. Never vaccinate your baby!","post_message":"'The UK's anti-vaccination movement is alive and well, and we can't ignore it'"},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."}]
