[{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"},{"comment_id":"10153771560244060","commenter_b":"in America, a black male is sixty times more likely to be imprisoned (In the US) than a Chinese citizen in China. So China, in my estimation, has a long way to go with their threats before they infringe on the liberties of their population to the degree to which \"we\" have ours.","commenter_a":"How does a person spread a rumour? It's nonsense. Rumours are spread by masses, not individuals. I suppose the whole country is a prison anyway.","post_message":"Chinese whispers: \"spreading rumours\" online is now punishable by seven years in prison"},{"comment_id":"10153037067141636","commenter_b":"Gays must be slaughtered like pigs","commenter_a":"The most easiest and simplest HIV aid prevention, is don't commit gay, rather is an animals behave. Don't forget you're human kind.","post_message":"The drug successfully reduced the risk of HIV infection by 86 per cent"},{"comment_id":"1172778402818410","commenter_b":"the media just didnt air BERNIE enough! didnt get his ideas and platform out there,for all to hear. too busy showing stupid trump./","commenter_a":"Hillary 2016","post_message":"384 pledged delegates are at stake today, nearly twice as many as in New York last Tuesday."},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"769355346496407","commenter_b":"I am on Pam side screw the rest of them assholes.","commenter_a":"Bullshit she clearly antagonized this lame ass broad","post_message":"She believes she saved lives by hosting the contest."}]
