[{"comment_id":"751484411652421","commenter_b":"It's designed to expand and contract no matter what the fuck it is you do. Stop acting like Waist Training is associated with organ ruptures because it isn't. No woman has ever died from using a waist trainer in our society because we have made vast improvements in it's design. You can't be like \"WELL WHEN YOU'RE PREGNANT YOUR BODY NATURALLY CONTORTS\" It contorts either way. The organ placement isn't even permanent when using a waist trainer it is almost the same exact process except rather than an expand you are placing the pressure in other areas making it look evenly distributed. The entire point is that nobody drinking, smoking or who is Obese (Yes we can tell when someone is obese) should be complaining and bitching at women who are using waist trainers periodically to go out, or to exercise about \"health\" without sounding like an absolute hypocrite. We ...","commenter_a":"So...insanely tight corsets are coming back into style? Didn't we learn anything from the history of these awful garments?","post_message":"Waist trainers are terrible for you, but the media keeps pushing them on women.   To learn more about the health risks associated with waist trainers, follow this link: attn.link/1T22tWr."},{"comment_id":"10152922830971491","commenter_b":"@username, you killed my sides.","commenter_a":"So many hateful comments. Why?!","post_message":"“God chose us to take care of these babies.”"},{"comment_id":"787010171427640","commenter_b":"so much for tolerance","commenter_a":"I'd of accepted her resignation effective right then!","post_message":"Citing \"separation of church and state,\" the councilwoman resigned.  What she did almost immediately afterwards is raising eyebrows."},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"1377436272296841","commenter_b":"Go girl.","commenter_a":"Iowa thanks you Hillary! God, what an embarrassment King is to our great state.","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"10153608717341491","commenter_b":"You can't win when 74% of women hate you","commenter_a":"They're saying \"it's the beginning of the end of Donald Trump\" since the first quarter of 2015. It's the beginning of the end of USA.","post_message":"Elise Jordan writes that Donald Trump's treatment of women will destroy his chances of being elected"}]
