[{"comment_id":"981060928642821","commenter_b":"are these women important? I never heard of any of them.","commenter_a":"Disappointed","post_message":"Television producer and writer Shonda Rhimes joined forces with the leading actresses from her various ABC shows in a campaign ad for Hillary Clinton..."},{"comment_id":"10153420149016350","commenter_b":"Awesome!!!!!!! Congrats to the graduates!","commenter_a":"This is Awesome!!","post_message":"The seniors only took two days to learn the performance!"},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10153623182969714","commenter_b":"Misspelled here.....lol","commenter_a":"Ouch! Whitney Karp","post_message":"Talk about a teachable moment."},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself \"Christians\" because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."}]
