[{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on \"alternative\" news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1058824504164459","commenter_b":"@username are they in mexico legally? if they aren't, they'd be in a mexican jail. if they are. then go after your gvt for not preventing the assaults. the fact is this.. ILLEGAL entry to any country, including mexico, is against the LAW. Mexico has enforced their law and the US MUST TOO. That means a wall since mexican cartels have made another business out of smuggling people into the us and those who can't pay the cartels, find a different way. Mexico didn't like it when Guatemala did it to them and we don't like it here either.","commenter_a":"Mexico has the largest border wall on earth bordering Guatemala to the south in order to protect it from the violence and to protect its mexican culture. It shows the historically true nature of mexican politics since Maximilian was executed. Nothing in mexico is good for America at this time. We dont need there people drugs or crime.","post_message":"\"Suicide bombings in Israel went from 1,000 a year to zero a year once they put that fence up.\"  Yesterday, Mike Huckabee spoke to Uma Pemmaraju about walls, using Israel as an example of why they work."},{"comment_id":"10152741444625950","commenter_b":"Well ladies, the Navy Seals BUDS training awaits you . You'll both cry, bitch, and quit within hours.","commenter_a":"I'd be scared too. It's simple - woman are NOT AS STRONG as men. It's a fact and when your dealing with the most dangerous and physically demanding covery ops - woman need not apply.","post_message":"Men in U.S. special operations forces don't think women can meet the physical and mental demands of their commando jobs, according to the survey."},{"comment_id":"10153114659021336","commenter_b":"i just hope she is prosecuted for her crimes, and they let her know she is NOT above the law....she is a disgrace.","commenter_a":"Right on schedule.","post_message":"Let us know your thoughts on Rep. Trey Gowdy asking that Hillary Clinton agree to a transcribed interview over her deleted records and tune in to 'Special Report with Bret Baier' at 6p ET."},{"comment_id":"858343807629738","commenter_b":"Yes! Lock her up!!!","commenter_a":"She looks much better BEHIND BARS !!!!!!","post_message":"Trump Nominated - Christie Calls for Prosecution of Hillary: “Lock Her Up” @webpagelink"},{"comment_id":"10156988779965500","commenter_b":"Exactly. These are sick women.","commenter_a":"This is sick! As the mother of that boy I would go psycho on her! Check out this loser, @username!","post_message":"TEACHER IN TROUBLE! She told investigators that the boy's family was supportive and excited when they found out she was pregnant. @webpagelink"}]
