[{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"10154186263231336","commenter_b":"@username how did she give in to he bully? By becoming strong and accomplishing something at 9 that her bullies will likely never even attempt? By showing them that she has more aptitude and resolve in her pinky than her bullies do in their entire body? That she doesn't need to bully someone else to make herself feel better, but instead made herself better? If you ask me, that's not giving, that's stepping up and issuing a whole new challenge. There are 29 year olds in this world that could stand to learn a few things from this young lady.","commenter_a":"We need more parents who inspire their kids to do somethng like this. Instead of creating a safe space for their feelings for those who are bullied or feel bullied by micro agression.","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"1005179532861447","commenter_b":"Jail her for life","commenter_a":"What a screwball! Have a heart attack but don't beat your child! Moron!","post_message":"A Florida woman is accused of beating her child after the juvenile flushed more than $700 down the toilet: @webpagelink"},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"10153529159371770","commenter_b":"That's another reason he is known as lying Ted!","commenter_a":"what do you have to say now cruz? ha ha","post_message":"'Donald J. Trump is not getting to 1,237. No one is getting to 1,237.' #ThrowbackThursday"}]
