[{"comment_id":"10153326702079877","commenter_b":"It doesn't make no sense for a woman to get sloppy drunk","commenter_a":"I just don't understand","post_message":"Man finds wife naked in bed with her father...then gets stabbed after an altercation. Read more of the details below.   Grio fam, we can't imagine. What would you do?"},{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's \"Saturday Night Live\" after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"10153990525422452","commenter_b":"Jayleen Guadarrama","commenter_a":"LAPD. Respect the rights of the people.","post_message":"Anti-Donald Trump protesters marched through downtown Los Angeles for hours before LAPD tactical officers blocked in the crowd and began dispersing people in small batches. @webpagelink  The protests were generally peaceful, aside from scattered reports of bottle throwing and graffiti."},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"\"America was never great.\" Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant \"Mexican Power!\"...\"America was NEVER great!\" PHOTOS...VIDEO..."},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"10154995182613812","commenter_b":"All the liberal whiners calling racist. Typical","commenter_a":"its a trump or Hilary is American citizens decision no other nation have right to comment any thing about it...stop spreading hate","post_message":"On Wednesday morning the world will wake up to a new American president. Here's what news outlets across the globe are saying."},{"comment_id":"699361250167548","commenter_b":"Terrorist and traitor!!! And an illegal!!","commenter_a":"The Wall of China has worked tremendously for China. Id expect the same results here","post_message":"“Good luck with that…We’ve got serious problems here.”  President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."}]
