[{"comment_id":"444470795746949","commenter_b":"It's all about him he really doesn't care about us what a dick","commenter_a":"He has zero fuks to give.","post_message":"As 43 Americans are killed by tornadoes during the Christmas holiday, Obama golfs (again)..."},{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."},{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"},{"comment_id":"10156207727725354","commenter_b":"another fucking scumbag please americans this has 2 stop we need term limits or our country is going down the tubes","commenter_a":"We want Trey Gowdy","post_message":"He's the odds-on favorite, but will likely face a strong and credible challenge..."},{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."}]
