[{"comment_id":"10153554399159087","commenter_b":"Naw a wall sounds great how's how is he going to pay for it? Oh it's free lol fool","commenter_a":"Trump offering free stuff, free deportations, and a free wall. damn national socialist","post_message":"If Donald J. Trump is victorious in several March 15 winner-take-all contests, including Ohio and Florida in which he is currently leading, it would take an “extraordinary effort to defeat him,” Karl Rove said."},{"comment_id":"10154234196571509","commenter_b":"Maybe if you realized the obvious. Terrorists would not attempt entry as refugees. They'd arrive as illegals and criminals along with the rest of the parade crossing into the US via our unprotected southern border.","commenter_a":"Try telling this to republicans and they won't listen, only people with commonsense know that it would be difficult for terrorists to enter the U.S. as a refugee. Maybe if fox news told them they would believe it.","post_message":"Here's how the refugee process stacks up to other ways of getting into the U.S."},{"comment_id":"10153229649411770","commenter_b":"Spank her, then send her to jail where she belongs!!","commenter_a":"If we are going to keep Hillary out of office we need Trump and Cruz to team up. That's a ticket that would put the republican's in office and would reverse all of this crap. But it's going to be left up to us to flush this Muslim crap down the toilet and out of our country. It does not belong here, it will never get along with western culture.","post_message":"Ted Cruz warns Hillary Clinton that \"in America the voters have a way of administering a spanking.\""},{"comment_id":"1137213316374919","commenter_b":"I'm loving it. Turn it Megyn Kelly. you'll enjoy her hate.","commenter_a":"WHY is @username giving stage to these Republican pundits all the time?? Its disgusting! This network has become a pro-Trump propaganda and pro-Repub stage! Two thumbs DOWN!!","post_message":"JUST IN: John Kasich is the projected winner in the Ohio GOP primary.   More: @webpagelink"},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"}]
