[{"comment_id":"1247078658692220","commenter_b":"Bitch no it ain't, ole flat volleyball shaped head ass","commenter_a":"John H. Gonzales III this is @username hair style rn","post_message":"He needs a fitted cap asap!  #WSHH #Haircut"},{"comment_id":"10157633958190389","commenter_b":"@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with \"words\" but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":""},{"comment_id":"1677003925887340","commenter_b":"@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say \"bomb them and take their oil\". How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"\"I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.\" – Donald J. Trump"},{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"10154658880931178","commenter_b":"just some dumb f****** n*****","commenter_a":"I still have no idea who this guy is.","post_message":"Under fire music star Chris Brown ranted against the cops and praised #BlackLivesMatter."}]
