[{"comment_id":"10153011050796717","commenter_b":"Exactly what does that have to do with anything!","commenter_a":"Why does it matter what his sexual orientation is?!","post_message":""},{"comment_id":"10153230146462439","commenter_b":"Why do you say that?","commenter_a":"The use of the Neutron Bomb comes closer.....","post_message":"Iran is the world’s leading state sponsor of terrorism. Hizb’Allah is its client in Lebanon. Hussein Obama has apparently joined the axis of evil…and that will be his legacy. “Iran is placing guided warheads on Hezbollah rockets,'” by Yaakov Lappin, …"},{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"\"We as Europeans\" Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"\"Hitler did nothing wrong! I feel like there are two sides.\" - Tila Tequila"},{"comment_id":"443733605833672","commenter_b":"Mr. Trump, Your idea of building a wall to slow / prevent illegal immigration is far too narrowly focused. Here is what I think a solution to the problem could be. No matter where the immigrate is coming from. Though not my original idea it is a workable one - All immigrate males between 18 & 50 to be immediately inducted into the military to receive basic training, After completion, sent back to their country of origin, then given their weapons and told to defend and reclaim their own country. After they accomplish that we send them their families because they would have no excuses to come here. If they refuse to do this then they and their families can find another country that will take them because they would never make an AMERICAN anyway. We should not have to send OUR military to their country to fight and die ...","commenter_a":"We don't need 1,400 years of cosanguineous brain damage. We have enough of our own in the Republican Party.","post_message":"Our country is in trouble. We’re going to stop people from coming into our country illegally. #GOPDebate"},{"comment_id":"10152718156506051","commenter_b":"yea-their called street whores--oh-and get arrested sometimes","commenter_a":"Why don't people mind their own business?","post_message":"A man heard strange noises coming from a nearby car dealership. When he walked over to see what was going on, he couldn’t believe his eyes."},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."},{"comment_id":"614337382087891","commenter_b":"you people get ready for WW 3 because that's where this is heading","commenter_a":"Hillary not trump","post_message":"Join Ohio State students on their ride to vote early LIVE with Jo Ling Kent.   Get all your election coverage here: @webpagelink"}]
