[{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: \"Seems like the more people you kill, the more you're in the limelight.\""},{"comment_id":"487739541416626","commenter_b":"She is an Ass","commenter_a":"Ann is not afraid to speak out she is a very brave lady","post_message":"This brave woman just called Obama a primate on national television.  She made a huge stand against our president, let's show her our support.  Do you endorse her public defiance against Obama?"},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"1695653017364810","commenter_b":"@username And she is not even bad.","commenter_a":"careful how you word that, don't say \"The GOP is the Party of White People,\" it implies all white people are Republicans. I am white, definitely not Republican.","post_message":"Because of Donald Trump, Republicans are finally being forced to admit that their party is a racist haven that caters to whites only."},{"comment_id":"1106079576120034","commenter_b":"Islam believe in cuting off heads and raping children.","commenter_a":"Ali didn't want to because it was supposedly against his religion, Islam! Not a good reason. He could have served as. Medic or in other capacities .He was not a hero. He was just an ordinary man but a good fighter . Let's not glorify him.","post_message":"\"The headlines may call him a hero for dodging the draft. But common sense calls him a hypocrite.\""},{"comment_id":"10154843667759170","commenter_b":"I'd like to kick whoopi in her dick..","commenter_a":"Whoopi is downright rude to Conservative guests. She has no shame. Conway handled Whoopi's mockery and aggression with class.","post_message":"Oh yes. If you must go on The View, at least make the most of it and do this:"},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."}]
