[{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10153373196639877","commenter_b":"Girl bye !","commenter_a":"SIT UR FACT AZZ DOWN ..AINT GONNA HAPPEN .","post_message":"Wendy Williams wants Terrence Howard fired from 'Empire' because of past abuse allegations. Check out the video clip below.  Grio fam, what do you think of Wendy's remarks? Sound off."},{"comment_id":"927870117281087","commenter_b":"How many illegitame grandkids does it take to keep her quiet","commenter_a":"I'm with you Sarah","post_message":"Sarah Palin goes off on Obama to his face. What a woman. Let's show her our support. Can we get 10,000 'LIKES' for Sarah Palin's stand against Obama?"},{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"1111151122296756","commenter_b":"This makes Chicago sound a lot like Baltimore for the \"quality\" (corrupt, criminal) of incumbent leadership (I grew up in the south side of Chicago all the way back to the 60's - and am not much impressed with what the present day enthusiasts think of my opinion. I also lived for a while in Viet Nam, and there we were allowed to call the other guys \"enemy\", and to shoot back at targets of opportunity, ... just sayin\") @webpagelink","commenter_a":"I knew there was a dirty Democrat involved in that ruckus!","post_message":"Inside scoop, here . . ."},{"comment_id":"1219528801419908","commenter_b":"^^^dumb bitch","commenter_a":"The one and only way it could have been prevented was if he complied with the officers instead of resisting after being tasered twice and thrown to the ground.","post_message":"CASE CLOSED....  @webpagelink"}]
