[{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"},{"comment_id":"10153869230258352","commenter_b":"Wtf? The sorry bitch nees LIFE!","commenter_a":"i think life without parole is better","post_message":"Mom who gave her baby methadone ‘to help her sleep’ and killed her will serve up to 30 years in prison"},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"10154108531615950","commenter_b":"Wrong. Abortion is a huge problem and IS murder. IF A PREGNANT WOMAN GETS MURDERED ITS DOUBLE. HOMICIDE..DOUBLE STANDARDS","commenter_a":"Why are people so fixated on someone's death? That is, ONLY if the tool used happened to be a firearm? Why not by other tools and means? #1. There is no gun death epidemic in America. In fact, many more people are killed each year by abortion, alcohol, tobacco, obesity, vehicles, prescription drugs, drownings, STDS... #2. Murder is not on the rise in America. In fact, violent crimes across the board are down some 50%, and have been falling for the last 20 plus years. This despite the fact that firearm ownership is quickly rising more each year. Studies even show where private firearm ownership is the highest, crime is the lowest. #3. Many of the same people who are supposedly against the deaths of a small percentage of people by firearms, are perfectly happy to murder their own sons and daughters by the millions each year. Talk about hypocrisy! ...","post_message":"Police locked down a South Florida mall after one person was killed and another was injured in a shooting."},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"}]
