[{"comment_id":"10153772364848132","commenter_b":"Such a strong woman...","commenter_a":"What a wonderful tribute to your husband this morning Kathie Lee... May God be with you and your family at this difficult time...","post_message":"This emotional tribute from Kathie Lee Gifford is so touching."},{"comment_id":"1247572008614366","commenter_b":"Her pants should have caught fire. She needs a choke collar.","commenter_a":"Yes","post_message":"Surprised? Neither are we."},{"comment_id":"10152814296572377","commenter_b":"Creepy lady","commenter_a":"and Obama has invited them...","post_message":"Geller stands tall saying \"Give Me Liberty or Give Me Death,\" even though she is being targeted by ISIS. But they aren't just coming for her she says..."},{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's \"Saturday Night Live\" after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"10154831956721350","commenter_b":"Isn't she supposed to be in Canada?","commenter_a":"why is she here? I thought she was leaving the country?","post_message":"WATCH: We love Amy Schumer's powerful message to body-shamers! @webpagelink"},{"comment_id":"1001534043242046","commenter_b":"Nice thought but it's an AMERICAN FLAG on a WHITE MAN'S PROPERTY that's also a VETERAN. Need I say more Nick as sad as it is he is still defending his FREEDOM, his CONSTITUTIONAL RIGHTS, the AMERICAN FLAG and this ONE NATION UNDER GOD.","commenter_a":"I just hope he called the cops because it could be a hate crime, and its attempted arson,","post_message":"Marine Vet Who Flown an American Flag in His Front Yard for 15 Years Wakes Up to a Sad Sight:  Can They Do That? (VIDEO)  PROUD AMERICANS ARE UNDER ATTACK!   @webpagelink"},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"}]
