[{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. \"I guess it was desperation.\""},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"10152817661912623","commenter_b":"like I say the only good snake is a DEAD ONE, since they ate my baby turkeys-I HATE THEM MORE","commenter_a":"Time to move. Fr.","post_message":"WATCH: What one North Carolina couple found in their spice cabinet will shock you.   Warning: There is some language in the video."},{"comment_id":"950390221741940","commenter_b":"here comes people saying. \"no deport them all\" and stuff. and yet they forget who really made America. found by immigrants. the Irish had a very hard life back then, the hate saying this word, African Americans had a harsh life, people whats the difference between illegal immigrants and legal immigrants. a legal immigrant can be much more dangerous than an illegal. look what happen in 9/11. Boston bombing. ect. and how is it that an illegal can have a job, without knowing the English language. no American education?? the come here, and still believe that the American dream is still alivem but we Americans are the ones that destroyed it.","commenter_a":"THAT'S the way! No one is \"illegal\". We are ALL human beings and should treat one another accordingly.","post_message":"\"We need to take 11 million undocumented people out of the shadows, out of fear, and we need to provide them with legal protection,\" Sanders said."},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"10157077224085354","commenter_b":"Ignorant slut","commenter_a":"Crazy socialist bitch","post_message":"The only thing \"ludicrous\" about it is what Debbie Wasserman-Schultz said this morning.  WATCH:"},{"comment_id":"10153163783266135","commenter_b":"When the death penalty came up, the idea was to deter people from killing. This is why I wrote, death penalty for killers. Killers should know that gas chamber is their end. But when the law starts making up excuses for their actions, every law goes out the window. Illegals guns hit the streets because its about money. When someone chooses to be stupid, is not about money, the culprit list will be long, and everybody should be hold accountable. So, should we shot everybody and ask later? There are some people who are paying the consequences for not thinking ahead, trying to uphold the laws in their hands, like some kind of hero. What exactly is a THUG? and what exactly is a GOOD person?","commenter_a":"Screw the 2nd ammendment, this clowns can not handle this right. Killer, death penalty right away!!!","post_message":"#BREAKING One person killed in shooting at Taylor Sportsplex, according to Taylor Police Chief."}]
