[{"comment_id":"10154905959166320","commenter_b":"Women hate liars...","commenter_a":"no they just hate the mean ones 😬","post_message":"What do you make of this? In an interview Madonna said, 'Women Betrayed Us' by Voting for Donald Trump.  Also she said that she has not had a good night's sleep since the election.  (Image: Fox News/AP)"},{"comment_id":"1035891609764351","commenter_b":"^ Africa has the most terrorism on the daily and Nigeria in particular last three months schools had radical Muslims go in and blast kids! Hundreds dead No Americans there...","commenter_a":"Terrorism in Canada is only in the mind and children shouldn't suffer because of a bunch of paranoid adults...","post_message":"The Edmonton Public School Board has put all trips on hold as well."},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"10152950805022452","commenter_b":"Donald Trump should be proud that an \"Illegal Immigrant\" did not win. We don't want them to take the jobs from the \"White\" women! Next year they are going to have a new catagory called guess who is behind the sheets.","commenter_a":"Awesome","post_message":"Miss Oklahoma, Olivia Jordan, has won the 64th annual Miss USA contest. @webpagelink  This year's contest, held in Baton Rouge, Louisiana, had been largely overshadowed by comments made by pageant co-owner and real estate mogul Donald Trump while running for president."},{"comment_id":"10155127148590652","commenter_b":"What we need to do is educate them so that they leave that vile disease that is ISLAM. That's the only way we will rid society of ALL the barbaric Bronze Age religions that have no place in the 21st century...","commenter_a":"At last someone actually making a speech about the idea that wearing a headscarf doesn't necessarily mean that women are (always) submissive, that it's part of a culture as well, and that not ALL women are forced to wear them. Ten years ago and even before i used to be seen as an alien if i said that, not being a Muslim myself. pppffff Yes!! let them get on with their lives, and us ours!","post_message":"\"We need to create the space to hear Muslim women for who they are individually and not to judge them merely as a monolithic community.\""},{"comment_id":"967111676633636","commenter_b":"What a couple of dicks....","commenter_a":"Bigots.","post_message":"It's that important, huh?"},{"comment_id":"10152942742574753","commenter_b":"I have learned a lot about you guys","commenter_a":"this goes to show you the high levels of stupidity and ignorance that exist in the white race. they think they are so smart; that they know everything. yet, they do not know that there are people as Black as me with full heads of blonde hair in this world. she should have gotten more money. there is no excuse for this degree of ignorance, today.","post_message":"An arbitrator awarded an ex-Hooters waitress $250,000 in lost wages and attorney compensation after she was allegedly fired for having blond highlights in her hair. Hooters denies the allegations and says many African-American women have worked at the chain of restaurants while having various shades of hair, including blonde, without any difficulty whatsoever."}]
