[{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"},{"comment_id":"773327109450736","commenter_b":"Sounds like she know how to have a good time.","commenter_a":"Billy Mills, Joshua Hill.. Here's an opponent for yall!","post_message":"Fighting a girl is a lose/lose proposition. @webpagelink"},{"comment_id":"10156672074140725","commenter_b":"Americans have done that stuff for years. Illegals do it cheaper because they work under the table and cause greater unemployment and then somehow get welfare!","commenter_a":"hey stupid Donald trump if you stop immigration who will work on the farms or will clean the bathrooms , American people won't do that stuff , think on what you are saying trump","post_message":"WOW! THANK YOU Atlanta, Georgia! LETS MAKE AMERICA SAFE & GREAT AGAIN! Heading to Nevada- now!"},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"1125703734163047","commenter_b":"@@username, The same amount as your kind that got arrested for having sex with goats and dogs. Bitch ass.","commenter_a":"George Zimmerman and Dylan Roof both caught beat downs in the same day. Today was a good day.....","post_message":"George Zimmerman was punched in the face for bragging about Trayvon Martin's death! After the well deserved sock to the face he called 911 in a panic #WSHH #GeorgeZimmerman #TrayvonMartin #RIP"},{"comment_id":"1202081159878082","commenter_b":"Good one! Except I hope SHE would HAVE BEEN ABORTED LONG BEFORE NOW!","commenter_a":"So, I am reading that Hillary is really upset that the FBI is \"dumping\" on her right before the election.... I want to say to Mrs. Clinton, \"So Hillary, how does it feel to be aborted 8 days before delivery?\" Stole that comment, but it is awesome!","post_message":"The website announces it has moved to \"Phase 3\" of its \"election coverage.\" Here are the latest headlines. #WikiLeaks #Clinton"},{"comment_id":"10153011198456717","commenter_b":"Time to jail her ass","commenter_a":"Yay!","post_message":""}]
