[{"comment_id":"10153608463849440","commenter_b":"You are so uneducated, illiterate and pathetic. Worthless. Parasite. A rodent of no worth or accomplishment.Stop #WhiteGenocide 14/88","commenter_a":"Colorado is the epicenter of #WhiteGenocide and the GOP here is allowing it because they're afraid of calling Amy E. Brown and her #Blacklivesmatter5280 terrorist friends out.","post_message":"Editorial: Colorado Republicans made a big mistake in abandoning the 2016 presidential caucus."},{"comment_id":"1078684138859436","commenter_b":"How far out to sea is that wall going to stretch? Must be like that wall in Game of Thrones that can keep all the nasty people from taking to boats. Once Trump develops this wall technology he will make billions selling the idea to Europe and I bet they let him put his name on it in big gold letters!","commenter_a":"There will be no wall","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"},{"comment_id":"10152881213667894","commenter_b":"Ciara can't sing, same songs to a different beat. She can compare herself to Mya or Ashanti who is and was a bigger artist then Ciara","commenter_a":"Hits yes, talent, no","post_message":"Do You Agree? Ciara Says She’s Had Hits 'Just as Big' as Beyoncé and Rihanna"},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."},{"comment_id":"10154722156744749","commenter_b":"The 'girl who prepared' has a name. Her name is Hilary. When this 'dastardly' person can be called by name why not this lady?","commenter_a":"What a terrible statement...Clinton is a terrible example. She is a garbage","post_message":"\"Ten inches shorter, she towered over her rival. In 42 days’ time, Dastardly Donald deserves to get beaten by the girl who prepared.\""},{"comment_id":"1166997406690286","commenter_b":"We also have an excess of employers giving jobs to illegals. So really we don't have an illegals problem we have an employer problem. If there were no jobs to be had there would be no illegals.","commenter_a":"I don't want more foreigner coming in. that is for sure.. but.. there are right now 10 jobs for every man women and child in this country.. way way more jobs than people.. way more.. so..","post_message":"Do you agree with Senator Sessions on this?"}]
