[{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"10153148829377235","commenter_b":"Sure she doesn't work for FOX? Oh same difference, WSJ/FOX. I got confused there for minute her hair is yellow instead of blond. I guess that's why Murdoch doesn't have her on FOX, put some peroxide on that hair and Murdoch will make you a star! You too can be another FOX bimbo, if your legs are nice enough along with your cleavage.","commenter_a":"Oh my gosh ... it is so shocking to listen time and time to this rampant, severe stupidity.","post_message":"How dare Barack Obama talk about the suppression of minorities at an event showcasing the suppression of minorities!"},{"comment_id":"10153351172732439","commenter_b":"When will Americans recognize that these bitches in our country are breeding our enemies.","commenter_a":"Deport her ass NOW","post_message":"@webpagelink"},{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"475707345887193","commenter_b":"If they don't like it here I will help them pack and kick there a##es out of here","commenter_a":"I'm sick of hearing about muslims. How abov you?","post_message":"A butcher was selling this to Muslim customers without them knowing. Now he's going to jail."},{"comment_id":"1661303277474551","commenter_b":"Municipalities the masses? Did you maybe mean manipulates? Lol","commenter_a":"The more bias tords trump just show how mutch media manipulates the masses and is shooting themselves in the foot","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."}]
