[{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"},{"comment_id":"642441049213821","commenter_b":"Crying over spilled milk. She should move on","commenter_a":"Our system does NOT invite tampering, if you asshats didn't decide to cheat. Pure and simple! And the fact that you and your ilk can so easily rationalize your way around the rules suggests that you're definitely part of the problem.","post_message":"Green Party presidential candidate Jill Stein says a recount is needed because the current voting system \"invites tampering\" and there have been many \"red flags\" with votes in the election. Should there be a recount?"},{"comment_id":"10153141566354641","commenter_b":"She is one of the terrorists in this world","commenter_a":"The time is now, change in governance of UNCLE SAM, time for good women of UNCLE SAM to vote for Hillary Clinton, what a man can do a woman can do it better. Let's give her a chance. She will surely make the difference. UP DEMOCRATIC PARTY.","post_message":"First on CNN: Hillary Clinton’s press team is growing: @webpagelink"},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"579876898863510","commenter_b":"that chick with the bad bouttabe me in a second","commenter_a":"How cooked Darnell Fraser-Carroll Darnell Rea","post_message":"Ghosts from The Ring and Grudge opened a Japanese baseball game"},{"comment_id":"1684672748486504","commenter_b":"Just what is with these piece of shit that will videotape it and allow this to happen without breaking it up. They see a child standing there and they continue to videotape and not stop this fight. They are just as sick as the women that are fighting.","commenter_a":"Lowest of the lowest ignorant white trash. Why can't these fools go back and at least get a third grade education?","post_message":"WHAT!?   I can't believe what I just witnessed..."}]
