[{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10155508321034778","commenter_b":"Round \"us\" up ans ship us out? Why would they round up and ship out legal immigrants or citizens?","commenter_a":"No. they are here to serve and protect us. Not round us up and ship us out. That's not part of their job. That's ICE's problem and a federal issue. They want people out then they can do it themselves.","post_message":"Should local police departments participate in immigration raids?  Explain why and your comment could be used on #OffScriptOn9 at 7 p.m.  Full story-->@webpagelink"},{"comment_id":"1222586881085915","commenter_b":"I can't believe a woman would even consider voting for Trump unless they are Transgender.","commenter_a":"It's pretty obvious that TRUMP will be President --- and I can't wait -- Hillary would be a disaster ---No one can say that TRUMP would be worse than Obama or Hillary --- Remember don't listen to polls or media -- they are just media bias--- TRUMP TRAIN all the way to DC ---- Don't forget to VOTE in the remaining Primaries","post_message":"An honor to receive the support from golfing legend, Jack Nicklaus. I will defeat Crooked Hillary Clinton in November, and we will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"461391564049150","commenter_b":"Well Paid Bitch","commenter_a":"Not surprising, have you listened to her for more than a few minutes? Not impressive to say the least. Where do they find these people?","post_message":"Donald Trump’s national campaign spokeswoman turns out to be a sleazy welfare cheat and conspiracy theorist."},{"comment_id":"904920249698551","commenter_b":"Fuck this bitch in do care who sings at this bitch shit he's not my president fuckem","commenter_a":"No","post_message":"What they just confirmed about the Trump's inauguration... This is just what we've been waiting for. Are you excited for Trump's inauguration?"},{"comment_id":"569853826519212","commenter_b":"So how was your nap after clearance today then?","commenter_a":"@username this is you","post_message":"Facts"},{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"}]
