[{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"},{"comment_id":"10153155003323812","commenter_b":"Dip out? Only women bleed.","commenter_a":"\"Hardest moment of her life\" it was pretty easy for her to dip out before this story got national attention though wasnt it?","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life: @webpagelink"},{"comment_id":"1662251920662029","commenter_b":"White thugs!!","commenter_a":"Love the broncos, but just for this I would have they're title taken from them and given to the panthers","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"10153478653615950","commenter_b":"Here come the pro-trump/Hillary is the devil comments. I stand by Hillary and will gladly vote for her in November. #Hillary2016","commenter_a":"She does not care, just wants them votes!!!","post_message":"Hillary Clinton  takes a swipe at Donald J. Trump's \"neutrality\" during her AIPAC speech: America \"can't ever be neutral when it comes to Israel's security or survival\" @webpagelink"},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."}]
