[{"comment_id":"10153153254808822","commenter_b":"You mothersfuckers are assholes","commenter_a":"5 kids and pregnant at 26? Jesus.","post_message":"Targeted or a random act?  Police are trying to figure out why someone shot and killed a local mother of 5, who was also pregnant."},{"comment_id":"10153103899511336","commenter_b":"HEHEHEHEHEHEHEHEH YEP THEY DO BELIEVE WE THE PEOPLE ARE STUPID\" WHAT A INSULT TO OUR INTELLIGENCE GRRRRRRRR....@webpagelink","commenter_a":"I didn't vote for obama or agree with any of the daily mistakes this administration makes. With that being said, we the people must find a way to be heard and stop any deal with Iran. Our congress can't let one man with no foreign policy skills, put the world in danger. Everyone knows that Iran can't be trusted and after the Bergdahl disaster, can we trust Obama.","post_message":"The U.S. is considering letting Iran run hundreds of centrifuges at a once-secret bunker in exchange for limits on centrifuge work and research and development at other sites."},{"comment_id":"476505799211632","commenter_b":"What an Idiot... Just Deport this Idiot out of here NOW!!!!!","commenter_a":"\"Faith Derangement Disorder\" or FDD is a Liberal description of Christianity I became acquainted with during Obama's presidency. The honorable definition of holy matrimony and any public expression of Christianity was outlawed and was destroyed during Obama's presidency. The enemies of the western world and Christianity, worldwide, are emboldened and murdering Christianity. It is Obama's use of Liberal leadership in the US and his lack of leadership outside the US that is directly responsible for Trump and the Trump movement. No one else should be held responsible for the violence worthy, deep, fundamental, divide Obama has created.","post_message":"Tommy DiMassimo, the man who was tackled by Secret Service trying to rush the stage at a Trump rally, told CNN he did it because \"Donald J. Trump is a bully.\""},{"comment_id":"558942897646607","commenter_b":"If killery wins we WILL NOT HAVE A COUNTRY! !! ...NWO...WILL SUCK!!!!","commenter_a":"@username, Hermain Cain is a staunch supporter of the Second Amendment!","post_message":"Live Now: Donald J. Trump's running mate Mike Pence addresses supporters at a rally in Atlanta, Georgia."},{"comment_id":"695691723946745","commenter_b":"She has no clue !","commenter_a":"Talia Crichton","post_message":"The look on her face when Al Franken calls Betsy DeVos out for being so damn IGNORANT about education policy is simply priceless!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"}]
