[{"comment_id":"925848087500236","commenter_b":"SHE BE A COMMIE SOCIALIST. FIRE HER!!!","commenter_a":"he needs to take about three weeks of anger management and then come back child behavior period","post_message":"BOMBSHELL!!  This changes everything..."},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."},{"comment_id":"10153527478874586","commenter_b":"Make this slaughter illegal! So immoral!","commenter_a":"Go to JAIL OR PRISON!!!","post_message":"Want it to be ILLEGAL for hunters to bring back lion \"trophies\" to the U.S.?  SIGN THIS NOW FOR #CecilTheLion!"},{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"10156457619055354","commenter_b":"She's only fit to lead her prison cell block at this point.","commenter_a":"Well, Hillary, if you hadn't enabled the enemy by letting the Benghazi attack go on, sending arms to our enemies, selling, for your own profit, 1/3 of our uranium to Russia and in many other ways letting terrorists know that it's open season on Americans, we wouldn't be having to listen to you whine that you want us all unarmed so we can't fight back.","post_message":"Unserious and out of touch."},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"1201785943175748","commenter_b":"The unvaccinated will always be a problem...you know why? Because you're all fucking dumb as shit! That's why.","commenter_a":"From another article. It's not the unvaccinated that started this. It's the vaccinated. \"The WHO said the two cases were in the southwestern part of the country -- bordering Romania, Hungary, Slovakia and Poland -- and that the strain responsible, vaccine-derived poliovirus type 1 or cVDPV1, may still be a threat to the region.\"","post_message":"Vaccinate your kids folks."}]
