[{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"},{"comment_id":"10153060591326955","commenter_b":"This old scant whore should have been gone long ago. She looks horrible!","commenter_a":"Ha, ha, ha!","post_message":"PAPER: Radio 1 bans Madonna, 56, for being 'irrelevant and old'..."},{"comment_id":"10154298505504411","commenter_b":"stfu goat lover","commenter_a":"Go police go, do not let bastards ruin the day!","post_message":"Police deployed tear gas to disperse some particularly hostile demonstrators"},{"comment_id":"1797347700498169","commenter_b":"If a cop ask you multiple times to put your hands where I can see them you do it!","commenter_a":"How you raise a black son in America? Tell them not to break the law and do what a cop is telling you to do. That's how","post_message":"It's an important question, without easy answers."},{"comment_id":"10153854891839032","commenter_b":"Get guns out of the hands of THUG CRIMINALS and TERRORIST and problem solved","commenter_a":"Being around guns isnt safe... who would have though","post_message":"The study also found that in many self-defense cases, use of a gun didn't lead to a better outcome for the victim."},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"}]
