[{"comment_id":"913163888732635","commenter_b":"Another NJ Dem on the take.","commenter_a":"n j Need to re think He will stand up to Obama. I wouldn't be surprise that Obama is behind this to start with","post_message":"Pressure is growing..."},{"comment_id":"10155207615341037","commenter_b":"No politics?!?!?! You are not paying attention. 😂😂😂 LOVED it. AND what she stands for....only few understand. Good for her. NASTY WOMEN!!!!!!","commenter_a":"There was a subtle political statement in her opening songs but I felt it was out there to move people together. She was nothing less than I expected. She brought down the house. The show was amazing","post_message":"Did Lady Gaga win the Super Bowl?"},{"comment_id":"10153577696206337","commenter_b":"yeah.. IM gross wonder how many old fat bitches are just jealous that some 16 year old whore was getting his footlong? \"young teen: my azz, she was advertising on craigslist looking for the D 16 is legal in his state moron for good reason. id pound the shit out of some 16-17 (contingent on state) year old pussy fuck yall","commenter_a":"God damn it, Jared. We don't have to worry about Ronald FUCKING McDonald FUCKING AN UNDERAGE GIRL!","post_message":"BREAKING: Former Subway spokesman Jared Fogle allegedly bragged about paying for underage sex in a series of lewd, sexually explicit texts..."},{"comment_id":"750651481734699","commenter_b":"Sounds to me like the other parrents in the school system should demand the girls immediate expulsion for the good of their own children.","commenter_a":"Fuck that cop if that was my daughter he'd be a dead mother fucker","post_message":"This could be BIG. Does this change your opinion on the whole incident?"},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"},{"comment_id":"1134617029988407","commenter_b":"GET HER OUT","commenter_a":"Firer her now","post_message":"The death stare comes easy for her because she can blink with all those Botox injections she has had. How many of you wish this chick was on her way out? I know I do. @webpagelink"}]
