[{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"10153762499342483","commenter_b":"@username but she taking millions of dollars from terrorist country and support Obama funding Iran and terrorist","commenter_a":"Why would anyone vote for lying Hillary","post_message":"Forecasters give Hillary Clinton a big chance to win, noting that the odds of her losing the race are about the same as an NFL kicker missing a field goal from the 20-yard line."},{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"10153589265781782","commenter_b":"Honestly I don't care if she kills herself or what she does rot in hell ask forgiveness I don't care but the hurt she caused the family and the pain she caused that sweet innocent baby is my concern that lady is no concern of mine whatever happens to her happens I just pray peace to the parents of a baby that they don't have any more and she is accessory to that !!!","commenter_a":"I don't understand how any one can have sympathy for this lady she killed some ones child are you kidding ...there ain't enough stress in the world to cause you kill someone else's child kill yourself for God sake !!!!!!","post_message":"DAY CARE DEATH: Jonathan Cooper goes through the court documents that say a Noble day care operator, who now faces a murder charge, admits to throwing and dropping a baby last week. @webpagelink"},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"},{"comment_id":"10153359922053984","commenter_b":"No more Muslims in this country. Enough is enough. Send the Muslims and Obama packing.","commenter_a":"Trey I love you to the moon and back, you are our only hope!!!!!! Keep up the wonderful things you are doing.","post_message":"Classic Trey Gowdy. State Dept. wants to send Muslims to these U.S. states, but they'll have to get through him first.  Do you agree with Gowdy's demands?"},{"comment_id":"826509020778685","commenter_b":"LEGAL immigrants, please learn the difference.","commenter_a":"Not surprised ... Coming from a nation of immigrants, you have to be the right kind of immigrant #theyaregonnabusthellwideopen","post_message":"BREAKING"}]
