[{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"10154077308573128","commenter_b":"would they let someone come in and do this to the liars Scruz and Ruby!","commenter_a":"When's the next GOP Debate?","post_message":"Republican leaders who had hoped Trump would stumble on Super Tuesday now face tough choices, writes Gerald F. Seib."},{"comment_id":"1061797757169218","commenter_b":"Save Western Civilization? You mean save white people.","commenter_a":"And where was our so called president ??????","post_message":"The prime minister of Israel, Benjamin Netanyahu, gave an historically important speech. A speech that any previous American president could have and maybe would have made, a speech to rally and save Western civilization."},{"comment_id":"1140671769377398","commenter_b":"This lady is such a trash!","commenter_a":"Why didn't they do this when Obama was in office?","post_message":"Thankfully we have Elizabeth Warren in the Senate to call him out.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"},{"comment_id":"1017021978357279","commenter_b":"Her daughter is a whoring little bitch.","commenter_a":"She is a screwball & her daughter is just like her. What is sexy about a big mouth drunk who is an idiot. I don't know any men who think she is hot stuff, they all say she is stupid & loves herself.","post_message":"Sad but true."}]
