[{"comment_id":"10153011055951336","commenter_b":"He is against us having freedom from OPEC !! We could be self contained and let the Muslims go to being dependent on us !! If no one byes oil from them they are through! OB knows this, that's why he vetoed pipeline 👿","commenter_a":"Job killer.","post_message":"Breaking News: President Barack Obama has vetoed the Keystone XL pipeline bill."},{"comment_id":"10156224607550354","commenter_b":"Thought she was an illegal immigrant.","commenter_a":"Is it any surprise she is black","post_message":"The Obama Administration continues to deny the food stamp fraud crimewave exists.   Instead, it continues to balloon the already exploding program. Check out the numbers..."},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":""},{"comment_id":"514464205408539","commenter_b":"I think I'm going to be sick. These cockroaches need to get the hell out of the US and take your brother Obama with you.","commenter_a":"God is watching.....","post_message":""},{"comment_id":"1364883926864562","commenter_b":"Go tell her that bitch","commenter_a":"You are nothing but a disgusting pos Michelle after the sex scandals you have had, you are a freakin hypocrite lady, at least Trump's children were brought up right and with class unlike your daughter, you just need to shut the Fk up.","post_message":"Michelle Obama says Trump is guilty of \"bragging about sexually assaulting women, and this has 'shaken' her. What do you think about her comments?"},{"comment_id":"1204607766260053","commenter_b":"Crazy woman","commenter_a":"Why is she even in the news? What is wrong with people that will send her money for this fruitless action...how stupid can you be?","post_message":"WOW! JILL STEIN'S 'FIRESIDE CHAT' Exposes Her Delusion On Recount [Video]   Jill Stein trying her best to remain relevant!"}]
