[{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"937660539681364","commenter_b":"He did not say the wall was to keep you or anybody else in...but to keep out Drug Dealers...I agree !!!","commenter_a":"What the hell? Now Trump want to build a wall both Mexico and Canada boarders. So the Americans are going to be imprisoned in his Presidency?? Dump Trump","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."},{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"971724402865796","commenter_b":"Why does having a child who is American entitle one to come to USA to live? Child should leave when parents leave due to illegal status or visa expiration. They can come back on their own when of age.","commenter_a":"this is not all that is in the 14th amendment. It is only a part. there are other antiquated clauses that really formed America after the Civil War. Section 2 guaranteed that southern people would not have a say in politics for at least 2 decades. We have a president now that should be impeached for treason per this amendment, bill Clinton should never had been allowed in politics per this amendment, America's judiciary ignores whatever they want. the entire amendment needs reviewed not just one sentence.","post_message":"This may surprise a lot of liberals and Republicans alike. Spread this everywhere!"},{"comment_id":"10153165834319411","commenter_b":"Errrmm... only one that i can think of.","commenter_a":"Russian threat !! NATO's a war monger since its creation,based on Anglo Saxson ,Viking ,etc...of blood thirsty tribes !","post_message":""}]
