[{"comment_id":"10153672228046130","commenter_b":"She's not plus size... She's average!!!!!","commenter_a":"How hilarious.","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"},{"comment_id":"10153902791784087","commenter_b":"@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"10152813335961770","commenter_b":"What is he smoking???","commenter_a":"He lies!","post_message":"Whatever you say, Mr. President."},{"comment_id":"10154385390083132","commenter_b":"GORGEOUS","commenter_a":"@username kitchen","post_message":"We can't decide which we love moreBritney Spears' marble kitchen or her breathtaking view.  (via People Great Ideas)"},{"comment_id":"1027501837293064","commenter_b":"What a lying bitch , she tried to be the center if attention and it didn't work out for her. There is nobody left for her to blow, so she wants to quit. Awe.... poor little helpless girl who swallowed so much she is choking on it. Lol","commenter_a":"She brought it on herself","post_message":"Megyn Kelly has stunned her fans and Fox News with an announcement that changes everything.   She's put Fox in a VERY hard position and disappointed a lot of her fans."},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."}]
