[{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"10154452810413812","commenter_b":"Kick her out.. Back to Honduras, then she can sue the Doctor there...","commenter_a":"I'm waiting for liberals to come on here and blame Trump somehow I'm surprised ABC didn't blame Trump for it","post_message":"Mother of infant born in NJ with microcephaly says doctor in Honduras told her everything would be \"fine\" after she reported having a fever. “He said, ‘Don’t worry, everything will be fine. I don’t think you will be affected.' Then I had an ultrasound, and everything looked fine.\""},{"comment_id":"1112320072187475","commenter_b":"Comparing this flooding to hurricane katrina is like trying to compare Benghazi to Iraq 😂😂💦","commenter_a":"What\"s happening in the US of A before the election happened in the Philippines. The big news network had been obviously bias against one candidate and it seems that this candidate cannot do anything right for them for obvious reasons. Even the Roman Catholic hierarchy are all bent on preventing our presidential candidate to win the election. But lo and behold the people have spoken and are up in arms against these giant nerworks and rallied their candidate of choice to win decisively. Wake up America you are being manipulated by a few who have selfish interest and only have themselves to enjoy if their will be done.","post_message":"President George W. Bush was torn to shreds in 2005 by mainstream media commentators for his initial response to Hurricane Katrina – yet President Obama’s detached response to the recent Louisiana floods has been met with resounding silence from those same outlets."},{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"\"One man's sexual assault,\" one said, \"is another man's flirtation.\""},{"comment_id":"10158241911570405","commenter_b":"That part about Kansas is not true. Our state is so far in the hole and we do not have the \"workers\" with that income. It was a pipe dream. The state just passed the largest tax increase in history because of the lack of income. Our budget fell short ever since this governor installed is plans.","commenter_a":"Once again @username when you source things from right wing rags, you lose credibility. Most won't even read it and those who do already support you. It's concerning that these are the only sources you can reference...","post_message":"Welfare Reform & Wisconsin: Walker Is Leading the Way | National Review @webpagelink"}]
