[{"comment_id":"10153372677575950","commenter_b":"And Kaye Townsend you are an example of an ignorant Bitch","commenter_a":"Screw going to the hospital to better anymore. Lets post getting shot and see how many likes i get","post_message":"Shortly after being shot in her car, a woman turned to Facebook to send a video message to loved ones: \"Mama I'm bleeding. I know they shot me but it's good. It's good.\""},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana  @webpagelink #HighProfits"},{"comment_id":"1011674828909358","commenter_b":"The thought of that ticket is NAUSEATING but a SURE WIN for you DT! The Witch and Crow will cause Havoc where ever they go!","commenter_a":"I am a Trumper and together we will defeat Hillary and her running mate.","post_message":"I hope corrupt Hillary Clinton chooses goofy Elizabeth Warren as her running mate. I will defeat them both."},{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."}]
