[{"comment_id":"10153936248091336","commenter_b":"American homosexuals bring HIV into the world.Nobody condemns them but Africa has Ebola everybody condemns Africa","commenter_a":"Nothing good comes out of Africa!","post_message":"More than 2,700 babies have been born in Brazil with microcephaly this year, up from fewer than 150 in 2014."},{"comment_id":"10154635406324726","commenter_b":"@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"364748327062015","commenter_b":"get rid of her","commenter_a":"You just can't fix STUPID !","post_message":"Nancy Pelosi says Math is Hard  Can Understand the Difference Between a Funding Hike and a Funding Cut"},{"comment_id":"536456796544900","commenter_b":"Go home.. This is not ur country.. To bring ur confusion here....","commenter_a":"Amen !","post_message":"Muslims try to pass Shariah Law in Alabama but these patriots refused to back down.  We are not in the Middle East. No Shariah Law here.  Do you support these patriots’ stand against Shariah Law?"},{"comment_id":"671681693020122","commenter_b":"Donna should be in jail!","commenter_a":"She is a cheater","post_message":"Does she DESERVE TO BE ARRESTED?"},{"comment_id":"10153811362959087","commenter_b":"She's too busy partying","commenter_a":"Dean Forest: your party is losing what it needs more of. Susana Martinez will seitch to the Dems if trump isn't careful.","post_message":"A Hispanic official with the Republican National Committee is resigning after telling coworkers she is uncomfortable in a job where she has to work to elect Donald Trump."}]
