[{"comment_id":"10153273051101051","commenter_b":"The idiotic responses of this lady, smh","commenter_a":"Really? I've never heard Obama saying anything that is anti police.","post_message":"Ted Cruz just made a serious accusation against President Obama. Do you think Cruz is right about this?"},{"comment_id":"10154259987641955","commenter_b":"Lilla Williams","commenter_a":"Good lord. I was watching a news person on Fox this morning lifting off in a balloon and thought, what if it caught on fire. Saw this later and it's so sad","post_message":"HORROR: HOT AIR BALLOON CRASHES IN TX...  16 DEAD..."},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"\"How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?\""},{"comment_id":"10153612601766336","commenter_b":"You know they wont. Shes gonna get a slap on the wrist.","commenter_a":"Lock er up!!!","post_message":"The DIA, the NSA, and the NGA, which oversees U.S. government spy satellites, confirmed to Catherine Herridge that the information was classified at the time and remains classified now."},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY \"CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: \"Tonight we close one chapter in history and we begin another.\" Watch complete speech here: @webpagelink"},{"comment_id":"10153229649411770","commenter_b":"Spank her, then send her to jail where she belongs!!","commenter_a":"If we are going to keep Hillary out of office we need Trump and Cruz to team up. That's a ticket that would put the republican's in office and would reverse all of this crap. But it's going to be left up to us to flush this Muslim crap down the toilet and out of our country. It does not belong here, it will never get along with western culture.","post_message":"Ted Cruz warns Hillary Clinton that \"in America the voters have a way of administering a spanking.\""},{"comment_id":"1026093827483671","commenter_b":"Build big beautiful wall and put it inside Trump's Ass.","commenter_a":"Good idea!!!","post_message":"They recognize the danger that Trump poses to our nation."}]
