[{"comment_id":"10155189729959199","commenter_b":"Kill the mother.or hang up.her...","commenter_a":"Sick twisted and very disturbing","post_message":"Police say this mother killed her baby by feeding her a teaspoon of salt in order to get back at the child's Dad >>> via.q13fox.com/zXtwH"},{"comment_id":"1799477110270557","commenter_b":"IF CROOKED CLINTON GETS IN, IT WILL BE THE END OF AMERICA AS WE KNOW HER. GOD HELP Donald J. Trump WIN.","commenter_a":"Of course Donald Trump is low in the polls if that's all your polling are Democrats hello","post_message":"\"I think, frankly, he's going to end up beating Hillary by a surprising margin.\"  On Fox & Friends, Newt Gingrich touted Donald J. Trump's \"two historic speeches\" this week."},{"comment_id":"10153026446831336","commenter_b":"I know makes me wanna puke.. she'll finish off destroying what Obama didn't...","commenter_a":"The United States part , we supply job applications to ISIS fighters","post_message":"Iraqi forces backed by Shiite and Sunni fighters have begun an offensive to recapture the northern town of Tikrit from ISIS militants, state TV reported."},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"10153855309638010","commenter_b":"too late on the troops - we're up to 5000 in country","commenter_a":"Just may be very well a Trump supporter making America GROSS again!","post_message":"The woman, who works for the Department of Corrections, was filmed ridiculing a Muslim man for praying and then hitting him with an umbrella and throwing coffee at him."},{"comment_id":"10153484658844060","commenter_b":"Let me clue you in on something: just saying \"I won, you lost\" doesn't make it so. In the adult world, you must present logic, facts and empirical evidence, which I did. Which enables me to say \"I win, you lose.\" It's ludicrous to even debate about how badly CA has done over the past 20 years due to liberal socialist policies. They're more in debt than most third world countries. Jobs and people are fleeing the state and illegal immigrants are destroying CA. I'd no more debate this than 2 +2 = 5. In summary, you're not only a loser but a leftist idiot. Ciao stronzo.","commenter_a":"America is the same. Some strong states like CA and some very weak states like SD.","post_message":"This week's KAL's cartoon @webpagelink"}]
