[{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"1173335299353316","commenter_b":"Lady...Just give it up and go home!!!!","commenter_a":"Pathetic!!","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"},{"comment_id":"10153964489889024","commenter_b":"FRICKING POS","commenter_a":"This is more truth than what comes out of his mouth","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153013974226323","commenter_b":"Sam Dean Errrrrrrrr orthodox jews DO go around killing people and they are not fussy if it is children!. They have been doing so for decades while the world turns a blind eye to Israeli atrocities.But then probably too busy reporting extremists who are the minority in comparison.","commenter_a":"If a Jew does such things he is orthodox but if a Muslim happens to to involved in such things he is 'an extremist and even terrorist.Sheer madness and discrimination against female gender in Israel is DECENCY and MODESTY whereas a fraction of such acts in Muslim society is viewed and portrayed by so called free media as brutal discrimination against women .","post_message":"Something is missing here..."},{"comment_id":"10155060869437439","commenter_b":"(HOW DID A MUSLIM GET IN THE POLICE FORCE ANYWAY WE ARE AMERICANS????????????","commenter_a":"a phony bitch sitting next to an absolute idiot.....","post_message":"Police officers are being targeted for murder. Black Lives Matter has put a bounty on their heads. NYC Mayor Bill de Blasio has not supported the police. But Mayor Bill de Blasio calls an urgent press conference on \"anti-Muslim\" crime after a Muslim police officer claims to have been offended."},{"comment_id":"10155549473141729","commenter_b":"She's a deranged scumbag","commenter_a":"You have to feel for this poor delusional \"woman\". Her whole way of life is disintegrating & she needs to complain as loudly as possible so people actually hear her. Soon her dementia will kick in full blast & she will be confined to a nursing home. I can only hope she doesn't suffer. It's just too bad her legacy will be one of HATE & DIVISION !!!","post_message":"Whadd'ya think?"}]
