[{"comment_id":"10152664925256717","commenter_b":"A business that is open to the general public should not be allow to discriminate . If I knew she belonged to the southern baptist I would have never given her by business anyway. Too many businesses out there would have loved to cater to your wedding.","commenter_a":"She looks a bit of a lesbian herself. Maybe a frustrated one! But anyway.... take that mama!","post_message":""},{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"998273030249779","commenter_b":"Men use mens room women use womens room","commenter_a":"obama done it allready","post_message":"Once again the president wades into a state issue, ignoring the will of the people.   @webpagelink"},{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"\"For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.\"  In his \"Talking Points\" tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"750991365034044","commenter_b":"Ok idiot if you want to require those mothers on welfare to work \"chain gangs\" to \"earn\" their food stamps does this mean you're willing to pay their childcare while they do so? You think most young mothers WANT to live on assistance you're a bigger Tard than you sound! The only way this maybe possibly would fly is if you held the FATHERS accountable too!!!! Duh.....sorry it's obvious you barely made it through ninth grade TROLLER","commenter_a":"I've been saying this for years, they say our roads suck well get the freeloaders on welfare to go fix them, instead of chain gangs picking up trash make them do it. It's no ones fault but your own if you want kids, make sure you can support them! Welfare should be a times thing like a year after that your done. If you think flipping burgers is beneath you guess what if it means you have food, shelter and clothes it beats nothing at all if you have to work two jobs that's on you, maybe you should have made something of yourself! No more giving illegal aliens good stamps or any kind of government handout. You want to be an American go get a job and pay taxes like everyone else!","post_message":"Take note.....it's damn brilliant."},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"},{"comment_id":"10153596460999486","commenter_b":"She needs to be in prison for it!!!!","commenter_a":"Funny how that works for a lying, cheating,sneaky,and generally lousy human being!!! She needs to apologize to the 4 families for their murder in Benghazi!!!","post_message":"Talk about a flip-flopper..."}]
