[{"comment_id":"10153904523824705","commenter_b":"ask your \"celebrity\" wife to hand over some cash","commenter_a":"Boohoo rich boy! Would he have helped me out of my problems?","post_message":"#SaveKanye"},{"comment_id":"10154061115835530","commenter_b":"Someone blow smoke in this chicks face please","commenter_a":"Gross. Second hand smoke from cigarettes is disgusting enough, I get to choke on obnoxious people's vape fumes everywhere, and now we can add weed to the mix. Wonderful.","post_message":"Introduced by state Sen. Coleman A. Young II, D-Detroit, the bill is being called the “non-medical marijuana code.’’"},{"comment_id":"10152575387122217","commenter_b":"It should be illegal to sell cigarettes to pregnant women!!","commenter_a":"I think women who smoke during pregnancy are just selfish vile people. ..thinking of themselves and not there babys health....it should be illegal to smoke while pregnant !","post_message":"Should pregnant women be paid to give up smoking?"},{"comment_id":"10154081807932212","commenter_b":"Women are not a minority.","commenter_a":"The DNC proves once again that dividing the people is their mantra. These women are being used and they do not even know it. The Democrats are using these women the same way as they use all minorities. It's disgusting..... @webpagelink","post_message":"#WomensMarch OK about to begin at the Capitol. Grant Hermes News 9 says an OCPD officer just estimated up to 6,000 people there right now. #News9"},{"comment_id":"912105055515910","commenter_b":"The reality is that the absence of a father or a mother is felt by children who have grown up in single-parent household. Perhaps we should then outlaw divorce/sex outside marriage to contravene this?","commenter_a":"Hoe the HELL she this she is? Talk about being 2 FACED! No RESPECT! YOOT! Of 2 day . Viva the Women who had and still have LOVE 4 you! !!! X","post_message":"'Another mom could never have replaced the father I lost'"},{"comment_id":"10153539588391037","commenter_b":"these pigs should have never been given the attention.","commenter_a":"If anyone believes the Duggars are all better now, please let your kids do a sleepover there and let us know. We'll wait for your report","post_message":"After weeks in limbo stemming from revelations of Josh Duggar’s sexual misconduct, the reality show \"will no longer appear on the air.”"},{"comment_id":"10154845355999705","commenter_b":"Omg this is perfect","commenter_a":"@username lolol we need one","post_message":"Someone reverse engineered the umbrella - and it totally works."}]
