[{"comment_id":"10153907055674199","commenter_b":"She's a straight up hood rat.","commenter_a":"I normally don't comment on things like this, but she has to be very cold hearted to cheer the death of anyone. The actions of some do not represent all. #alllivesmatter","post_message":"\"This behavior is unacceptable & does not represent our brand's values & ethics. The franchisee has terminated the employee.\""},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"1727798617495109","commenter_b":"She's a hottie","commenter_a":"Megyn Kelly is a dream come true.. Smart and beautiful","post_message":"“When I am wounded, I go after people hard, okay? And I try and ‘un-wound myself.’” — Donald J. Trump"},{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."},{"comment_id":"10153263682739342","commenter_b":"Bill I don't want white people dead I want bush dead","commenter_a":"Good now hang him","post_message":"Former President George W. Bush surprised a crowd at a Dallas courthouse Wednesday when he appeared for jury duty."},{"comment_id":"387651254692803","commenter_b":"Really Kathy tell that to the vets that the repubs cut spending on you dumb woman!","commenter_a":"GOP don't give a G/D about anyone America please wake up !!!","post_message":"What did you think of this response to the President's State of the Union address?"},{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."}]
