[{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."},{"comment_id":"10153721123493132","commenter_b":"Just another hoe looking for her five minutes of fame smh","commenter_a":"Remember when it was shameful and embarrassing to be the other woman.","post_message":"She is no longer an employee of the family."},{"comment_id":"10154425089776509","commenter_b":"Shut up you feminine POS","commenter_a":"Classic example of a Bernie supporter","post_message":"\"Bernie's like a kush, like the best kind of weed you can get,\" Tommy Chong said of Bernie Sanders."},{"comment_id":"10154233423376179","commenter_b":"@username - He wants an empire. Fascism 101 lesson, from 1947: @webpagelink","commenter_a":"Wow, another white man! What could possibly be up with that?","post_message":"Trump #SCOTUS nominee revealed"},{"comment_id":"1091574534232574","commenter_b":"Why this government is all B/S! Why this government is all B/S! It left over 180,000 tailor and mobile homes in Louisiana that the people never used and this sh**hole of a government could have added to that number and moved them all over the Midwestern farms for many of this countries people living off long term benefits! Just relocate mom and her 2-3-4 or more kids out there to work the farms! I think that this would be much healthier for the kids than being raised in many respects in slum cities and neighborhoods This bullshit about Americans are unwilling to work the farms, well, maybe if they are forced to, or all subsidy will end, maybe they with their children will learn a healthier way! And other women, who may consider this lifestyle, may think twice! The only reason that this government wants the border open is to ...","commenter_a":"Yes","post_message":"\"Cuban nationals should be treated under the same immigration rules as nationals of other countries.”"},{"comment_id":"10154690577255329","commenter_b":"Yeah, like. Hey white girls: YOU ARE FREAKING EVERYWHERE. Chill.","commenter_a":"Please don't come on here saying white girl magic and all prom dresses are beautiful cause i swear to god.","post_message":"#BlackGirlMagic is real."},{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."}]
