[{"comment_id":"538972829636804","commenter_b":"Stupid lady","commenter_a":"I don't anything about this conflict, and it seems like this woman is being pretty rude. However, it is also true that anyone living in this country should be speaking English in their public lives.","post_message":"\"Speak English, b****. It's America. Put me on YouTube.\"  What starts as an argument over a dog quickly escalates into a vicious tirade about language, nationality and entitlements. Now this parking lot rant, seen by millions, is quickly going viral. Why it's touching such a nerve. @webpagelink"},{"comment_id":"10153525074207994","commenter_b":"I have one get a wifeyou lesbian","commenter_a":"Gay people should respect non-gay people's Rights and don't be having sexually Haviar out in public keep it in your own home because I don't want to see it","post_message":"Pres. Obama's opening statement on #gaymarriage ruling: \"Our nation was founded on a bedrock principle: That we are all created equal.\" Watch more: @webpagelink"},{"comment_id":"10155005314954062","commenter_b":"@username Gale Adams @username @username Christina Marie 👀😒😔","commenter_a":"Justin Irwin","post_message":"Please be careful to all of our friends in the Conroe area. This was shared by Heather Dungan from Conroe 105 and I45 near Home Depot.  If you encounter high water, turn around. @webpagelink"},{"comment_id":"10153212648798690","commenter_b":"West & their illegal wars do. Racist Christine","commenter_a":"Dont go to Australia and the likes. There are a lot of other muslim friendly countries.","post_message":"\"The prime minister of Australia acted to firmly entrench in the national psyche not only that Australian Muslims are not to be trusted, but that Islam and Muslims are complicit in the 'death-cult' ISIL.\"  @webpagelink"},{"comment_id":"883241831711239","commenter_b":"@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"10152995336151037","commenter_b":"This chick is nuts lmao. Anyone who pretends to know what happened is dillusional.","commenter_a":"This was NEVER about a RACIST Cop shooting someone. The Lame Stream Media made Darrin Wil\\bson into a Racist, despite NO Evidence ever being presented that showed Mr. Wilson as being racist. It is sickening.","post_message":"A member of the grand jury that declined to indict the white Missouri police officer who fatally shot an unarmed black 18-year-old sued the prosecutor in the case, criticizing the way evidence was presented to grand jurors and seeking court permission to speak publicly about the way the case was handled."}]
