[{"comment_id":"10154492654832690","commenter_b":"@username Your belief in polls probably left you disappointed on November 8th didn't it? SMH","commenter_a":"Who actually goes to an inauguration? Ask how many people are happy Obama will no longer have any control. Your poll will be more meaningful.","post_message":"Are you going to President Trump's inauguration?"},{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"992775434136459","commenter_b":"That is all these losers have.","commenter_a":"Screw that ignorant pido, GO TRUMP GO","post_message":"Here are the 6 TWEETS..."},{"comment_id":"386189561505639","commenter_b":"Keep it open and all prisoners.","commenter_a":"Open","post_message":"Do you think Guantanamo Bay prison should be closed as promised or kept open?"},{"comment_id":"10154408157211926","commenter_b":"You too, think of humanity stupid or hang yourself with him!","commenter_a":"This liar again! So he's preparing another false flag?","post_message":"Israeli Prime Minister Benjamin #Netanyahu yesterday accused #France of supporting groups that reject #Israel’s right to exist and call to #boycott it."},{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"}]
