[{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"456392161152491","commenter_b":"i dont spank my daughter and she is extremely well behaved. she says please and thank you and your welcome at the appropriate times. she is VERY advanced for her age. I am enrolling her in MMA classes to teach her not to be a little \"bitch\" as you put it. and because she came from my loins, she will be a force to reckon with","commenter_a":"Spanking children teaches them consequence for actions. It also teaches you not to be a little bitch.","post_message":"So what are the alternatives? We look into them:"},{"comment_id":"10152875043501973","commenter_b":"My husband said he wished there was since we can't just hop in our car and get down there. :)","commenter_a":"Is there an online store too???","post_message":"The sale starts today at 9 a.m. for season ticketholders, 11 a.m. for the general public, and offers up a ton of Ducks' athletic gear."},{"comment_id":"10153837028166130","commenter_b":"I have a right NOT to have a gender confused individual peeing next to me ! What about MY rights as an average Joe peeing in \"comfort\" like I have my entire life . Yes, peeing next to a drag queen is disturbing - no difference in my mind .","commenter_a":"For all you folks who think people just wake up and decide to become a different gender just to be a pervert - think about this: why would anyone want to put themselves through all of that ...hormones, family dynamics, ridicule from idiots, discrimination? Just for fun? Because they are some sort of sexual deviant? For all of you who say women should be women and men should be men because that's what God created...he created us all as individuals with our own thoughts and feelings - and yes, he even created those who feel trapped in the wrong body. Respect people for who they are, not where they came from, or who they become. Discrimination disgusts me.","post_message":"Yep, this pretty much says it all."},{"comment_id":"10156269605955354","commenter_b":"This is so illegal and so disrespectful of those who have risked all for this country. Illegals are invaders.","commenter_a":"Another reason to leave this GD socialist state!","post_message":"It's starting."},{"comment_id":"1018456324917286","commenter_b":"It's not Trumps place to judge. Isn't that what the gays and muslims are always complaining about?","commenter_a":"I can hardly believe that I even watched that whole segment on The Last Word With Lawrence O'Donnell.","post_message":"Donald Trump lets a supporter calling President Obama a Muslim slide."},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, \"single payer will never ever come to pass\"? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."}]
