[{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."},{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"10153814775523797","commenter_b":"A woman being drunk is not a license to violate her. Go Sit Down somewhere....","commenter_a":"exactly she was drunk she dk what he was saying or doing she just wanted n excuse to sue these officers n live off our tax dollars rest of her life n not work","post_message":"CITY PAYS DRUNK WOMAN: Well, not exactly. #Chicago taxpayers will shell out money to compensate an inebriated woman who accused two police officers of sexually assaulting her. What do you think? Details here:"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153661295271955","commenter_b":"You have the hots for Hillary... admit it already :)","commenter_a":"Weak weak weak.","post_message":"BEING BORING: CBS ENDS DEM DEBATE 7 MINS EARLY"},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"}]
