[{"comment_id":"1332051730168629","commenter_b":"She hasn't killed anyone idiot","commenter_a":"Now if only the Hilary haters would stop throwing around the word \"murderer\" as if it were a complement. The blatantly hateful behavior of so many Americans makes my heart ache and makes me ashamed to be counted among them.","post_message":"They finally collapsed."},{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"\"Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' \" Donald J. Trump said. \"They say, 'We want deal.' \""},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"},{"comment_id":"1372477109489879","commenter_b":"She can take a shower and be clean afterward! Lol","commenter_a":"If the girl wanna be clean.. Let her be in peace...","post_message":"'Alaikum salam'"},{"comment_id":"10155542841313362","commenter_b":"Get well soon Senator Susan Collins and Merry Christmas.","commenter_a":"Thank you for the well wishes!!!","post_message":"Due to a slip on the ice, both Rob Gronkowski and I will be on Injured Reserve for the playoffs.  My ankle was broken in two places, but thanks to a successful surgery at St. Joseph Hospital with Dr. Jacob Brooks and his team, I am on the road to recovery."},{"comment_id":"607961416030479","commenter_b":"Make America Mexico! Isn't that what the dumbass idiots where chanting when they where protesting Donald trumps rallies! Trump 2016 build that fucking wall!","commenter_a":"God damn! @username","post_message":"The Zetas tortured and killed around 150 people, and then incinerated the bodies or dissolved them in acid."},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."}]
