[{"comment_id":"10153732358683984","commenter_b":"And let Sherriff Joe and border patrol do their jobs. The murder rate in Arizona is out of control and it's all illegals criminals","commenter_a":"Amen! TOTAL SUPPORT for Trump!! :-)","post_message":"The Donald just made a BOLD promise to a certain group of people if he becomes president - and boy oh boy, he is NOT messing around.  Do you support Donald Trump's tough position on this?"},{"comment_id":"902740889761333","commenter_b":"Who would want her??","commenter_a":"Oh really that would make for a honest President, not","post_message":"BREAKING!"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"556755621195285","commenter_b":"@username y'all race invented HIV and experimented on other races but that heroin epedimic spreading HIV all thru the white folks Hood. Keep sharing needles junky..","commenter_a":"Same white dudes screaming how they would beat her ass are the same ones who scream don't hit a woman when it's a white woman !!! Good news is that it is fact that by 2030 the white race will be a minority ! 😉. So that always makes me smile when I see the racist still holding on to a failed system ! But that's ok the rest of the world has moved on! Just look at the population ... your country is now little Mexico right under you nose while you tried so hard to oppress the blacks you let in millions of mexicans , Muslims , Somalis! Now you mad !","post_message":"She took his crowbar away and went crazy! "},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"1841512796060882","commenter_b":"@username till the wall is complete lol there isn't going to be anyone picking lettuce you better grow your own","commenter_a":"Well Boston Mayor...... you are not the President so you don't get to decide what he focuses on. He's up holding his priority promises to his supporters first then comes the rest. Not the Democrats vision the Trump vision","post_message":"Boston Mayor Marty Walsh says President Trump should focus more on creating jobs and addressing urban issues such as homelessness.  Watch more: @webpagelink"},{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."}]
