[{"comment_id":"10154364862976336","commenter_b":"Shes an accomplice then! Lock her up too!","commenter_a":"Put her in jail or kill him. Sounds like she knew!!!","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"10153936928466130","commenter_b":"Tell his ex wife that. She's the one plastering the photos to every tabloid she can find.","commenter_a":"This is so incredibly none of anyones business--","post_message":"Amber Heard claims she’s the victim of repeated incidences of domestic violence."},{"comment_id":"10154129058346509","commenter_b":"Please stay the f**k in Africa!","commenter_a":"With 18 proven ways on overcoming Homosexuality, George's Diary presents to you words of life relevant to this present generation. Homosexuality is not the worst and unbeatable lifestyle, God doesn't hate gays and lesbians. That understanding alone brings hope of overcoming it! You may not be a lesbian or gay but so many people around you are homosexuals, some are secretive about it while some are not! Some wants to change their lifestyle while some doesn't. Your next of kin or even close friend may be a victim of Homosexual without you realising it. Read this article and learn to overcome or help others overcome homosexuality. You can as well do your neighbour good by passing on this article to him or her...... OVERCOMING HOMOSEXUALITY.... Read now!!!!! @webpagelink Or download George's Diary on your Android device @webpagelink","post_message":"Like it wasn't scary enough already. This glass walkway hangs more than a half-mile up a mountain and the glass panel cracked, sending visitors fleeing and screaming. @webpagelink"},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."},{"comment_id":"10154499778649091","commenter_b":"Edwin, you only sound ignorant.","commenter_a":"I proposed a law in which all pit bull owners and their dogs take obedience training. The dogs and owners should take some test to see if dog can handle being around people. Too many times do I read stories about pit bull attacks. I know they all aren't bad, but some tend to snap and kill or severely injured people. Let's all write to trump so he can executive order this law","post_message":"After a young boy was seriously injured after being mauled by one of two pit bulls inside his Brooklyn home, his uncle says the 5-year-old took the brunt of the horrific attack to protect his younger siblings."},{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"684786888378556","commenter_b":"everyone has a right to their opinion, some are better than others, Go Clint","commenter_a":"He is furious with Clint but LOVES all the celebrities that pander to him........","post_message":"Obama wants Clint Eastwood finished, but he is holding his ground. H's in trouble. Let's show him our support. Can we get 100,000 'LIKES' for Clint Eastwood?"}]
