[{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"10153563758934607","commenter_b":"Are you a democrat? Yes you are. No thanks","commenter_a":"NO.. Cummings supports Clinton.. Anyone connected to her is a NO VOTE..","post_message":"Congressman Elijah Cummings, who announced Tuesday morning that he was backing Pugh, said she has a proven record of passing meaningful legislation not just in Annapolis but during her time on the Baltimore City Council."},{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"},{"comment_id":"10153072204470329","commenter_b":"Girl I'm trying to kick it with u","commenter_a":"Leida Maria1020806391970270610210023845541574Alicia Jo","post_message":"We all have that one co-worker who is obsessed with Beyoncé...  via BuzzFeed BFF: @webpagelink"},{"comment_id":"928788953880826","commenter_b":"What a dumb bitch","commenter_a":"One less cracker...","post_message":"Because death is better than letting two people celebrate their love for each other."}]
