[{"comment_id":"1693302644277794","commenter_b":"Great news. She does anything to get publicity","commenter_a":"Good the left wing nut.How does this broad even have a job?","post_message":"Melissa Harris-Perry is refusing to host her show this Saturday due to weeks of pre-emptions that she says has left her \"silenced.\""},{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"\"This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.\""},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10154960801467232","commenter_b":"@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"}]
