[{"comment_id":"10153030983541051","commenter_b":"I would sue tjat fucking bitch and that guy","commenter_a":"Soooooo?! Why was that day different from any other?","post_message":"This woman turned to the Border Patrol officers and said: What are you going to do, arrest me? Turns out, they had something else in mind."},{"comment_id":"10153652189710530","commenter_b":"Save the geese. Ban airplanes.","commenter_a":"Doug smith- what are they going to do? They can potentially set fire to a blanketed horse causing severe burns or death. It's all fun until it's one of your loved pets. Caroline Torr This horse was in a field when a Chinese lantern landed on top of the horse's blanket and set the horse on fire! Chinese lantern may look amazing when let off but do you know where yours lands after you have seen it fly away??? What do u think happens to the wire frame of the lantern? The ban of Chinese lanterns needs to happen and can't come fast enough for me!!","post_message":"Should there be exceptions to Canton's sky lantern ban?"},{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"1438428362916880","commenter_b":"No, we, the REAL constituents, are not there and we are upset because we're working to pay our bills, support our families, fund illegal aliens, fund refugees, fund multi-generational welfare families, fund single mothers who don't know who their babies daddies are, pay for the prisons to hold baby daddies who make kids then get thrown in jail etcetera etcetera etcetera...","commenter_a":"Oops shouldn't have texted both when I offered 3","post_message":"Spot on."},{"comment_id":"10153091761007016","commenter_b":"Please take me off Your facebook","commenter_a":"Obama: Pardon Chelsea Manning","post_message":"\"The U.S. intelligence community is in a very poor position to be trusted with protecting civil liberties while engaging in intelligence work,\" writes Manning. \"When you’re a hammer, everything looks like a nail; when you’re a skilled intelligence professional, everything looks like a vital source for collection.\""},{"comment_id":"10153349077816051","commenter_b":"I don't care if she black or white or Asian or Hispanic welfare queen trash should have her insides ripped out or kicked off the system sink or swim","commenter_a":"60 000 for 12 kids!!!! That's borderline poverty! Why are people making a big deal out of this.","post_message":"This mom of 12 gets more than $60,000 per year in benefits. And that's not the worst of it."}]
