[{"comment_id":"1172654749497442","commenter_b":"I don't get the talk of someone \"forced\" on us . She has millions more votes , sorry but except in the final Presidential election (ala 2000) the person with the most votes wins .","commenter_a":"Screw @username","post_message":"The numbers are revealing a slow but steady climb for Hillary Clinton"},{"comment_id":"10153921301277217","commenter_b":"@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"1046312712073631","commenter_b":"Back in the,day, I was called a baby killer. My response to the pussy was that I was ALSO A MOTHER FKR, SO KEEP YOUR MOMMA OFF THE STREET.","commenter_a":"All those who believe in abortion so passionately, please line up on the left for your very own personal post partum abortion. Lead by example........ :-)","post_message":"Does this about sum it up?"},{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"10157030256485615","commenter_b":"\"The Tennessee hardware store owner who banned \"the homosexual people\" and posted a \"No Gays Allowed\" sign at his business last year recently constructed an outhouse that he's calling a \"Transgender Bathroom.\" @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells \"choose god or gays\" hats, too..."},{"comment_id":"1349008868469783","commenter_b":"Yes that will be great. Why don't you go hang out with some of those Jew loving Muslims and see how that works for you. She is just like Soros another self hating Jew.","commenter_a":"MOOOOOORRRRROOOOOON","post_message":"Total solidarity ... or something."},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"}]
