[{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"},{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"10154743598641323","commenter_b":"Yep. Greedy bastards.","commenter_a":"Ladies and gentleman. I present to you - Capitalism at its finest......","post_message":"Michelin-starred TV chef Michel Roux Jr. has been paying some kitchen staff at his Mayfair restaurant less than the minimum wage, the Guardian can reveal, while charging over £60 for one starter."},{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"10152697342252894","commenter_b":"Having a major craptastical, mitch, attituded 24/7 365 makes him a loser!! He is a jack hole!!","commenter_a":"Father, CEO, 100+ million in album sales from his music production (Jay-Z, Madonna, Mariah Carey, Ciara, Janet Jackson etc.), 30+ million in album sales and 21 Grammys. Being successful makes someone a loser? Ok","post_message":"Petty! If You Visit Loser.com, It Redirects to Kanye West's Wikipedia Page"},{"comment_id":"536499096509675","commenter_b":"he is absolutely right, this would not be permanent just temporary until we can get a system in place to do more accurate check on these people coming into our country. fdr did it. and for a good reason .....to protect the American people from harm... that was his job.","commenter_a":"Hell Yes!","post_message":"Do you agree with Trump?"},{"comment_id":"927016837412270","commenter_b":"So therefore, our tax dollars wouldn't be an issue in that legislation.","commenter_a":"Donald Trump is smeared 24/7 by the media, so I'd say no. Probably the most unfair media coverage I've ever seen. Mainly because he's at odds with the globalists that own almost all the media outlets. Hell time warner owns cnn and they've given the Clinton campaign over $600K.. so what does that tell you.","post_message":"Has the media treated your 2016 candidate fairly?"}]
