[{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"10154860386705470","commenter_b":"So why are you flocking to America?","commenter_a":"Of course we should. We should also stop doing drugs, selling drugs, prostitution, eating high cholesterol. What kind of a story is this. No one is advocating hate crimes and there are more hate crimes in India from Hindus and Muslims than almost anywhere else in the world.","post_message":"It’s been a long day for Srinivas Kuchibhotla’s widow, his coworkers at Garmin, those in his home country of India, members of the Olathe community, and those with Indian heritage who live in the US.  “Even though that guy was talking so discriminately about his race, he was still minding his own business... He did not deserve a death like this.\""},{"comment_id":"618975741614411","commenter_b":"She's just mad no one wants to grab her pussy","commenter_a":"🙄","post_message":"Can you believe this, folks?"},{"comment_id":"598432576983363","commenter_b":"No it's only ok for racist rednecks to say shit like that. Those lost European immigrants who assume they're original Americans.","commenter_a":"Too bad Trump wasn't on it.","post_message":"\"Looks like yet another terrorist attack,\" Trump tweeted. French and Egyptian authorities have repeatedly warned against such speculation."},{"comment_id":"1051072661621517","commenter_b":"Get them the hell out of America!","commenter_a":"Sadly delusional.","post_message":"THIS IS ISLAM: Typical Muslim Cockroach  And Tortures Co-Worker For 5 Days To Make Her Convert  @webpagelink"},{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"10152849572156336","commenter_b":"Democrats have lost their minds .Send all illegals home.","commenter_a":"Ridiculous!","post_message":"Not only can illegal immigrants now pay in-state college tuition in at least 20 states, student activists and graduates of Smith College are actually raising money for a scholarship for undocumented students."}]
