[{"comment_id":"10154239816884197","commenter_b":"@username Oh, you're so right. High capacity horsepower cars are designed to kill people. High capacity weight vehicles are designed to kill people. We need to ban all cars. They are designed to kill people.","commenter_a":"Maybe we should hold automobile manufactures accountable for deaths caused by automobiles. We should hold knife manufactures accountable for stabbing deaths. Train manufacturers accountable for death by trains. I can keep going on but the PERSON is to blame not the object.","post_message":"It's been a hot topic. Where do you stand? Vote in our poll: @webpagelink"},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."},{"comment_id":"1013898135398451","commenter_b":"He'll yes. Put them back in there own country then nukem. All","commenter_a":"Time to fight back.","post_message":"The religion of Peace Strikes again! This time muslim migrants welcome their hosts...   Do you agree we should deport them all!?"},{"comment_id":"10153898072441680","commenter_b":"Hillary has no respect for women! Ask the many rape victims of her husband - they'll tell you so!","commenter_a":"Right on-NBC survey monkey poll!! Ha,ha that's a good one-where was the survey taken,\" at the Bronx and Philly zoos! Did they survey the snakes?? How bout the cheetahs, the rats, the felons??! God help us!!!","post_message":"The NBC/SurveyMonkey poll out Monday finds that 63 percent of likely voters say Trump doesn’t respect women much or at all."},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"}]
