[{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"763958360369439","commenter_b":"A child should not have that choice any more than she can legally choose to smoke and drink.","commenter_a":"With all the people out there fighting for a woman's right to make choices for her body (abortion and birth control) how can you justify forcing medical treatments on someone? Either a person has total control of their body or they don't. Can't have it both ways.","post_message":"After treatment, she's in remission."},{"comment_id":"957861980892726","commenter_b":"Allowed, not aloud. Here, not hear. You're, not your. Go back to school, Linda.","commenter_a":"No one should be aloud in this country without being vaccinated period! No matter if you lived hear your whole life or your just coming in. Unless there is a medical reason it's just common sense.The risk of spreading these diseases is too high.","post_message":"The current measles outbreaks sweeping the country are the fault, at least partly, of Barack Obama lax illegal immigration practices, according to former Johns Hopkins neurosurgeon and possible 2016 GOP presidential candidate Dr. Ben Carson.   Read more at @webpagelink"},{"comment_id":"10156679024980354","commenter_b":"She is one wacky broad.","commenter_a":"I love that she's calling Hillary out for who she really is, but then again she's backing Bernie.... So, she can't be that bright.","post_message":"And that's not all she said about Hillary Clinton either..."},{"comment_id":"10153748749906336","commenter_b":"I want to applaud those that entered our country illegally and their main priority was to become legal and accomplished it. Talked to some that did just that as a priority. Yet, we have the illegals that come and breed like rabbits for an anchor babies. Free benefits. Or men that leave family in other countries, shack up with a women here and start rutting to produce too. Instead of becoming legal. Some have been here over 20 years. If only all would follow the steps to be here legally we would not be as we are today.","commenter_a":"I'm Hispanic and I support Donald J Trump for president Donald J Trump for president","post_message":"WATCH: Donald J. Trump invites a woman onto the stage at a Nevada rally. “I’m Hispanic and I vote for Mr. Trump!”"},{"comment_id":"1151019624929597","commenter_b":"Krissy L Gucciardo Nice mouth. Do you eat with that filthy mouth.","commenter_a":"I actually had a friend say she never sees him with his hand over his heart during the Pledge of Allegiance. I then supplied her with about 25 pics of different events, all with his hand over his heart. I told her google is her friend, and Fox news is not.","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\"  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1758550144422291","commenter_b":"73% approve and still got 4 more months. Dam fine job sir! Hillarys new add kids are watching is stupid thats all she has. Ok hillary kids are watching as you say who cares soldiers are dieing! What a piece of garbage she is time to take out the trash Trump we love you. Voters get out and vote Trump 2016","commenter_a":"Finally a strong leader to be. Mr Trump a country with no borders is not a country. Make America great again.","post_message":"I will not let this country down. I am grateful for everything I have ever been able to accomplish. I want to give back. I want to MAKE AMERICA SAFE & GREAT AGAIN!  -DJT"}]
