[{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"},{"comment_id":"10153536003698967","commenter_b":"God... I would love to work here JUST so that I can belittle upper management when they fire my ass for pulling an \"Office Space\"... Also... I can see a documentary in their near future.. Similar to the one about Walmart... ... Can't wait!!!","commenter_a":"I hate to hear that they run Amazon like a Randian dystopia. I use them for so much stuff now. What a shame.","post_message":"Amazon's corporate culture is terrifying."},{"comment_id":"10152581007932894","commenter_b":"She too old to want that hoe bag to be her damn role model.. Smh lol","commenter_a":"^^^^ Shes your Role Model???? Sis....","post_message":"Mag Swag: Kim Kardashian & Her Bleached Eyebrows Cover LOVE Magazine [Photo]"},{"comment_id":"10153981335574060","commenter_b":"While we're at it, how bout you just shut your sass mouth, too.","commenter_a":"I love you, Economist. I do. And I'm no Trump supporter. But my reaction to this is the same as any time you tell America how to run itself: Mind your own damned business.","post_message":"The Economist cover story in the Americas and Asia Pacific  Donald Trump is unfit to lead a great political party, let alone America. It's time to fire him.   February 27th - March 4th  Read free via @webpagelink"},{"comment_id":"10152658308576680","commenter_b":"I don't know why your playing around with her. You need a special prosecutor ,this way she needs to comply or go to jail.","commenter_a":"WHY!!!??? SO she can try to hide more stuff??","post_message":"The House Committee on Benghazi has given Hillary Clinton an additional two weeks to respond to a subpoena asking for her private emails on Libya and the 2012 terrorist attacks."},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"}]
