[{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"10153961213080579","commenter_b":"Right wing ammosexual Xtians kill more people in this country than Muslims.","commenter_a":"obama Will NOT FIGHT HIS BROTHER MUSLIMS.. BUT He WILL Help them.","post_message":"\"France is at war.\" French President Francois Hollande to Joint Session of Parliament.  Watch complete video here: @webpagelink"},{"comment_id":"10153526627596636","commenter_b":"She is full of hatred","commenter_a":"Burma/Myanmar is a country with many problems, including persecution of muslims. From what I've read of the interview the journalist only wanted to talk about the problems of the muslims and presumably that was not what Aung Suu Kyi was expecting since no one had bothered to tell her that the main topic of the interview would by the persecution of the muslim minority. No politician likes to go into an interview unprepared.","post_message":"According to the man who revealed it"},{"comment_id":"10153158036376756","commenter_b":"Haha or they're super annoying beats made on a computer by another artist.. Then they take that same beat again change a few things and bam another two chains song!","commenter_a":"Modern day hip hop is way worse! All the beats are the same n the lyrics are garbage!","post_message":"Maybe you've noticed that many hit country songs sound the same. Now you have proof."},{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10152805642283145","commenter_b":"Nope.","commenter_a":"@username te montas?","post_message":"The Orlando Eye attraction will be the tallest observation wheel on the east coast of the United States, and today the first passenger capsule was installed.   Will you ride the Orlando Eye? Check out photos of the progress >> @webpagelink #WFTVat5"},{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"}]
