[{"comment_id":"10153405463063132","commenter_b":"5 year cancer survivor right here. I flew everywhere, because I didn't want to stay at home alone, my guy is a commercial pilot and I can fly for free..so why not?Because my cbc count was low, I had to fly with a mask on, because I had to. I even flew on Alaska airlines from Denver to anchorage. I believe this to be an isolated incident...I was always treated with dignity and respect and allowed to go down first because I said I felt weak..Because I did! So tell me what's the difference between if an elderly person says they feel weak and a cancer patient says it?","commenter_a":"Dear America, your bottom line is not more important than common courtesy or basic human rights.","post_message":"\"We need to make sure that ... corporations aren't so concerned with liability and bottom line that they overlook common sense and common decency.\""},{"comment_id":"10153248022411336","commenter_b":"John V Salazar","commenter_a":"We had a similar issue at a university I worked at years ago. The guy was just a creepy freak but he cried \"academic freedom\" and got away with showing porn in a music class and \"relating it to music\". Oddly enough, once he FINALLY retired, the class was discontinued as it had no value. There are times academic freedom goes too far and yet that is the basic premise of any university and with tenured faculty your hands are tied if they \"justify\" it.","post_message":"Parents, what do you think of this? A professor at UC San Diego is reportedly asking students to be naked to pass the final exam."},{"comment_id":"1115809875115612","commenter_b":"So basically since federal funds cannot go to abortion services you are going to punish tens of thousands of citizens who rely on the other 97% of services that they offer. Nice job. I see you really are the pro life party.","commenter_a":"How can it be that after viewing the videos and seeing the sonograms that people can STILL only talk about the \"rights of the woman\"? How can that be? And the sad thing is the terrible damage abortion does to women and many men.","post_message":"BREAKING: The House has passed #HR3134, my bill to freeze all federal funding to Planned Parenthood. Grateful to every Member of Congress who stood for life and supported this compassionate measure. The fight is just beginning!  #ProLife #DefundPP"},{"comment_id":"10156156980300615","commenter_b":"You think most women are going to wear a gun strapped to their hip or chest so that it is visible? Are you serious?","commenter_a":"Open carry idiots should connect with this, since they are such dickheads.","post_message":"What's wrong with this picture? In Texas it will soon be legal to carry a gun on campus but not a red plastic penis."},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about \" he's carrying the baby , \" or \" his girlfriend looks like a man\". Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert! "},{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"10153377527143984","commenter_b":"Are some people just figuring out she's a LIAR and always will be!","commenter_a":"People need to wake up & research the person they are going to vote for....She is hiding so many things....","post_message":"Supporters of Hillary Clinton are reconsidering their choice for president after learning some stunning facts.   Are you glad to see Clinton's hypocrisy exposed?"}]
