[{"comment_id":"10153364439113010","commenter_b":"Marie, I know. That's what the vaccines are for - preventing hepatitis. I'm saying 1,000,000 people could've potentially lived if they'd had access to a vaccine, and a million is definitely more than two.","commenter_a":"Well done to the Senators who care about the health of California children!","post_message":"The California Senate passed a controversial bill that would require children to be vaccinated by eliminating the ability of parents to opt out of the mandate based on personal beliefs."},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"\"Will you go out and pick the strawberries?\"  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"1014349388612957","commenter_b":"931389766893258R931389766893258o931389766893258c931389766893258h931389766893258e931389766893258l931389766893258l931389766893258e931389766893258 931389766893258C931389766893258h931389766893258a931389766893258r931389766893258l931389766893258e931389766893258s931389766893258","commenter_a":"931389766893258C931389766893258a931389766893258r931389766893258l931389766893258e931389766893258t931389766893258t931389766893258a931389766893258 931389766893258S931389766893258t931389766893258e931389766893258w931389766893258a931389766893258r931389766893258t931389766893258 931389766893258y931389766893258o931389766893258 931389766893258c931389766893258o931389766893258m931389766893258e931389766893258 931389766893258l931389766893258o931389766893258o931389766893258k931389766893258 931389766893258a931389766893258t931389766893258 931389766893258t931389766893258h931389766893258i931389766893258s931389766893258 931389766893258b931389766893258s931389766893258","post_message":"Slavery Happened A Long Time Ago?  Scientist Are Now Saying the Trauma May Be Encoded In The Genes of Black People"},{"comment_id":"1768830776662660","commenter_b":"Lock Her UP!","commenter_a":"Obama is starting civil unrest with the black lives matter movement in Milwaukee, Wisconsin. The black social movement killed one white man and more than hundreds were injured at the crazy riot yesterday.","post_message":"Live now: Governor Mike Pence holds a town hall in Albuquerque, New Mexico."},{"comment_id":"10154075834221336","commenter_b":"Jen Beth -I'll probably do that too, but if Trump wins the nomination, Hillary becomes President.","commenter_a":"The only ones surprised at this are fox news , democrats and rinos. The people will put Donald J. Trump in as president","post_message":"\"I'm going to win states that nobody else is going to win on the Republican side... And we will get a lot of Democrats and Independents to cross over.\" – Donald J. Trump"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"1105899882819941","commenter_b":"@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"}]
