[{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"1149779331709743","commenter_b":"Bastards of the ocean!","commenter_a":"The arseholes of the sea. Cha Henry @username","post_message":"Wow, what an asshole."},{"comment_id":"10152936707532377","commenter_b":"She is a moron","commenter_a":"Nothing","post_message":"What's the Difference Between Democrat, Socialist?"},{"comment_id":"828526300671280","commenter_b":"Hillary can't control own husband......let alone our country.","commenter_a":"incompetent bitch would not have far to go thanks to obummer .","post_message":"This is the worst thing that could of possibly gotten out.  America has to do whatever it takes to keep them away from the White House.  Do you think Hillary will run our country into the ground if she gets elected?"},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"10153169789203855","commenter_b":"She's a self-hating traitor.","commenter_a":"I thought Caitlyn was a Republican -- not at all a liberal. I'm sure I read that. Maybe Rush thinks party change is part of gender reassignment.","post_message":"A hateful man."},{"comment_id":"10156761765540354","commenter_b":"Beyonce should eat a bullet.","commenter_a":"just go away already","post_message":""}]
