[{"comment_id":"10154276693141037","commenter_b":"Hillary needs to start leaning a bit further left, and start actually addressing the issues that the voters she's not getting care about. Her \"don't be so pie-in-the-sky\" attitude will cost her the election, and God only knows the price this country will pay with Trump in the Oval. Bernie is hanging tough because Hillary is not!","commenter_a":"I will only cast my vote for Bernie Sanders. Period. I will write him in if need be.","post_message":"Despite Hillary Clinton’s insurmountable delegate gap, Bernie Sanders coasted to victory on Tuesday, yet again."},{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: \"Who pays?\""},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"671135826344343","commenter_b":"Kick her off the team","commenter_a":"👎move um out! Respect us or live in another country! If your parents don't make u respect our country move them out too!","post_message":"This high school volleyball player decided to honor Collin Kaepernick by protesting the National Anthem at one of her games. Guess how that worked out for her."},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""},{"comment_id":"694546357374506","commenter_b":"Bullshit. She should go back under a rock!","commenter_a":"U MEAN HIS SON IN LAW IS INVISABLE?","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"1110454952404615","commenter_b":"She is nasty and mean.","commenter_a":"Yes she has","post_message":"MULTIPLE CHOICE QUIZ time, kiddies! Which answer did YOU choose? A or B? Enjoy and SHARE with 1M peeps! @webpagelink"}]
