[{"comment_id":"903394569805665","commenter_b":"Blow them out of the water.","commenter_a":"Ok ok this time only send them $20 million","post_message":"New Video: Four ships belonging to Iran's Islamic Revolutionary Guard Corps (IRGC) \"harassed\" an American destroyer in the Strait of Hormuz Tuesday, a U.S. Navy official confirmed to Fox News. @webpagelink"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"},{"comment_id":"960118844029903","commenter_b":"Umar hayat, do u know people are injected with relegion, so they r blind what happent to u , u r a muslim and should not speak like this. See irain is only state which helps palsitane , a sunni state but our Arab the grand state of muslims is quite , wht does that mean. Leave blindness and b a responsible muslim","commenter_a":"which islamic republic ? Iran is a shia majoosi state dont use the name of islam with a sheetani state","post_message":"The Iranian president says the Islamic Republic will firmly deal with any acts of aggression: @webpagelink"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""}]
