[{"comment_id":"10153268798664170","commenter_b":"I'm sure asexuals all over are just shaking their heads and thinking the rest of the world is delusional in this quest for \"happiness\" which Hollywood and Madison Avenue thrive upon.","commenter_a":"Gay conversion therapy.... Sounds like a good way to convince gay youth to commit suicide. Let them be who they are. Perhaps we should have idiot religious zealot therapy","post_message":"I think families can make this decision for themselves, don't you?"},{"comment_id":"1024965370917718","commenter_b":"@username Agreed!","commenter_a":"Being vegetarian doesn't change much in the lives of cattle however. Nor hens. It's better than being an omnivore, yes, but still not cruelty free. Although nothing truly is. From medical treatments, medicine, to our pets sustenance, to palm oil, to beauty and household products, etc. As for diet, we are naturally omnivorous. We would not have survived very well as a species without meat as sustenance and the remainder for clothing/tools, along with plants, fruits, nuts, etc. Especially in the North.","post_message":""},{"comment_id":"10153265498530047","commenter_b":"@username over 5million LOL. Dead people and illegals","commenter_a":"SIGN THE PETITION / CLICK ON WEB SITE Justice Scalia one of the most brilliant and ardent defenders of the Constitution has just passed away. This is a huge, deeply felt loss. We must not forget that the next justice could impact the Court and the direction of our nation for decades. The American people deserve a voice in this decision: @webpagelink","post_message":"President Obama will stop at nothing to force his nominee for the U.S. Supreme Court through the Senate before his last year in office comes to an end.      But we can stop this from happening.  SIGN & SHARE our urgent petition to the U.S. Senate today: @webpagelink"},{"comment_id":"10154623463961336","commenter_b":"and she wants us deploables to pay for their free ride 😡🙄","commenter_a":"Hillary wants more illegals and she cannot even speak Spanish!","post_message":"Chris Christie slammed Tim Kaine for comments he made accusing Donald J. Trump of inciting violence at his campaign rallies, on \"Fox News Sunday.\" @webpagelink"},{"comment_id":"10154054009251337","commenter_b":"God Damn I want some fries now.","commenter_a":"Fuck Topher Grace. He ruined Venom.","post_message":"IT'S NOT A REUNION! Curb Your Enthusiasm's reunion for Seinfeld finally gets edited together..."},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."},{"comment_id":"968873019828099","commenter_b":"Some dumb uuuugly woman","commenter_a":"Who is Kim Kardashian and why must I look at this?","post_message":"#KimKardashian felt #liberated, Bette Midler didn't!"}]
