[{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"10157007310710354","commenter_b":"Arrest her. There is no such Allah.","commenter_a":"Could she be a worse POS?","post_message":"Here's the deleted TWEET..."},{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling \" Buddhist terrorist\" unless u want to be called ur religion as \" terrorist\" too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"},{"comment_id":"10154260914771130","commenter_b":"@username and she's gonna tell her fake mom too!","commenter_a":"@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"10153958872340695","commenter_b":"@username gotta love these white SLOW voter. I bet you probably one of the slos that was going to vote that dunmy Sarah Palin in who thought Africa was a country....thank God for uninformed black voters","commenter_a":"Go Obama!","post_message":"In a rare Oval Office address President Barack Obama sought to reassure Americans shaken by recent terror attacks."},{"comment_id":"10153011614414586","commenter_b":"Yes!!! Yaay! Way to go Peta!!!","commenter_a":"Amen","post_message":"KORA NEEDS A HOME!  #PETA fieldworkers found Kora tied outside 24/7 with little shelter or water. Her chain was so tight that it had become partially embedded in her skin. :( She is now in foster care & looking for her FOREVER HOME.  SHARE to help her find one: @webpagelink"}]
