[{"comment_id":"1593183134313238","commenter_b":"Lol, not true bitchhhhh.","commenter_a":"Jensen Beale","post_message":"\"5 minutes\" "},{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"10156189535540354","commenter_b":"@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"\"Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.\""},{"comment_id":"10154843667759170","commenter_b":"I'd like to kick whoopi in her dick..","commenter_a":"Whoopi is downright rude to Conservative guests. She has no shame. Conway handled Whoopi's mockery and aggression with class.","post_message":"Oh yes. If you must go on The View, at least make the most of it and do this:"},{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER \"NEW PET\"  READ & COMMENT BELOW:"},{"comment_id":"10153850185846770","commenter_b":"Women talk about men in all women groups too.... no one ever talks about that but women can get raunchy too....","commenter_a":"So guys can't be guys and talk in private? I bet 100% of the people whom have a problem with this are guilty of doing the same thing in some fashion in there own lives but let's make a big deal about ABSOLUTELY NOTHING","post_message":"Her name is..."},{"comment_id":"1192837800775695","commenter_b":"@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."}]
