[{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10153000852919197","commenter_b":"Put the plow down !","commenter_a":"Another fun icy Monday! Wha's up with that?","post_message":"It was definitely a slippery morning on most of the roads in the state. Check out this video from an eyewitness on I-84 in Newtown. Stay updated with the latest weather conditions here-->>@webpagelink"},{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"},{"comment_id":"10153005003572377","commenter_b":"Obama in the Alaskan wilderness? Ha, Grylls will be smothered by the Obama entourage!","commenter_a":"Guess I won't be watching that show any more unless. .......Obama doesn't make it!","post_message":"President Obama will soon be running wild Bear Grylls in the Alaskan wilderness."},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"}]
