[{"comment_id":"10153235865056680","commenter_b":"Ha ha ha!!! HEY, EVE, IF YOU WANNA WALK LIKE STEVE, YOU GOTTA TALK LIKE STEVE!!! WOMEN, STOP WHINING LIKE GIRLIEMEN. Stupid biatch.,😂😃😆😅😲😱😨","commenter_a":"TRUMP WINS ALL","post_message":"“She’s playing that woman’s card left and right.\""},{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous \"paper or plastic\" question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"1489236791096346","commenter_b":"Only 7% of the illegal aliens work in the fields, most work in the construction jobs, fast foods etc etc. 95 million unemployed americans need jobs, deport all illegal aliens and open up jobs for citizens not criminals.","commenter_a":"Hey Trumppets if you need a job...go apply in the fields....there's always jobs available! You got a teen that needs work, send them to pick out in the fields....give them those American jobs you ppl keep claiming immigrants are taking away!","post_message":"Donald J. Trump doubled down on his stance on immigration this week. Here's a breakdown of U.S. immigration by the numbers.  Read more about Trump's immigration speech: @webpagelink"},{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."},{"comment_id":"1450281048346082","commenter_b":"@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"},{"comment_id":"1716476818593163","commenter_b":"Well she is a WITCH.","commenter_a":"what a joke. anyone with any brains would look at her trend to not do the right thing. we have had enough bad behavior in the white house the past 2 elections we do not need more.","post_message":"According to Hillary's campaign manager, voters trust Hillary because she's completely upstanding, honest, and scandal-free. Claims to the contrary are nothing more than a GOP witch hunt."},{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."}]
