[{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10152707448786051","commenter_b":"Are you calling ma a stupid whore","commenter_a":"Humans aren't very nice they are constantly making fun of people for every reason possible so don't be shocked","post_message":"When this police officer heard his co-workers mocking special needs children, he lost it."},{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"},{"comment_id":"1071940456151087","commenter_b":"the medias role should be to challenge state lies... now their main role is to amplify it","commenter_a":"this is not good.","post_message":"Barry Grey: Addressing the United Nations General Assembly on Monday, President Barack Obama portrayed himself and the US government as the preeminent defenders of international law and diplomacy. He did so even as the catastrophic consequences of the illegal wars of aggression he has overseen continued to send waves of refugees fleeing the ruins of entire countries—including Afghanistan, Iraq, Libya, Syria and Yemen—and as Washington took new steps to turn Eastern Europe into a militarized zone for eventual war against Russia."}]
