[{"comment_id":"988150574624052","commenter_b":"They are acting like school kids, so the best way to handle them is to ignore them.","commenter_a":"get off the dang eggs birdXD","post_message":"EAGLE CAM DAY 4: One egg has cracked and we spotted an eaglet. Watch it fully hatch now: @webpagelink"},{"comment_id":"10152885159374342","commenter_b":"That witch would be 6 ft under! !!","commenter_a":"@username lol","post_message":"A 30-year-old woman faces criminal charges after a video surfaced that appears to show her storming onto a school bus and slapping a 5-year-old she believed was bullying her child.  FULL VIDEO/STORY --> @webpagelink"},{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"\"I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.\"  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as \"senseless violence of the few.\" @webpagelink"},{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"10152980541131336","commenter_b":"These creeps need to be exterminated.","commenter_a":"Islam is winning...","post_message":"German police canceled a popular carnival street parade less than 90 minutes before it was set to begin, because of fears of an imminent Islamist terror attack."}]
