[{"comment_id":"1732731136976178","commenter_b":"@username STFU","commenter_a":"No one will care! Liberals will vote for this criminal no matter what she does!","post_message":"New details about the investigation into Hillary's pay-to-play scheme while she was Secretary of State."},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"10154382177016756","commenter_b":"Kyle, bad news for you. I'm a Bernie supporter. I'm just not up my own ass about it like so many of the rest","commenter_a":"Thank you for stating the obvious @username. This isn't about winning anymore. It's about spreading the message. This movement isn't going away. And we'll keep donating to see him through, because the message is important. Bernie Sanders, the nobody socialist senator from the boonies, almost took down the strongest possible candidate the establishment could put forward. He did it against rigged elections, big money, money laundering, and voter suppression. Him and our 27 dollar donations.","post_message":"As of March 31, there were 896 people on the Sanders payroll. The campaign says it will retain more than 300 staff."},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"1266389850103907","commenter_b":"@username, do you kiss you're mail man with that mouth? Ms classy","commenter_a":"Every responsible voter should remember these days of how badly the democrats have acted after the Trump win and NEVER AGAIN vote for or put a democrat into a position of power, as they become once elected monsters absent completely of morals and integrity.","post_message":"Georgia Secretary of State now asking Trump to look into why the Department of Homeland Security has been trying to hack the Georgia voter database"},{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."}]
