[{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."},{"comment_id":"387361158112432","commenter_b":"the WHAT?","commenter_a":"A lot better then the B.N.R. CRAP","post_message":"What did the Christian left do to draw the ire of Fox News?"},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."},{"comment_id":"10153606250119778","commenter_b":"You look beautiful and happy!!! Congrats to you!!","commenter_a":"Stupid","post_message":"A woman vowed that she'd marry herself if she hadn't found true love by 40. And for her 40th birthday, that's exactly what she did."},{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":""},{"comment_id":"986494124719342","commenter_b":"Who cares! Go home where u b long","commenter_a":"They have their country they can go back home anytime. We do not need to have them visit anymore","post_message":"Donald Trump's promise could change EVERYTHING!"}]
