[{"comment_id":"1199159113429677","commenter_b":"Pay for your own abortions, which you can find probably within a couple of miles of your campus. Grow up, get a job and don't bother adults.","commenter_a":"Keep your legs together and study.","post_message":" who are condemning my bill because it is   having the right to live a healthy life is NOT immoral and every student should have access to safe and accessible abortions especially because being a student at Cal is already so demanding. [] This is a womxn [sic] issue, a students issue, and a humxn [sic] issue. If you do not support abortions, don get one."},{"comment_id":"1004322553035851","commenter_b":"Great point. Now- ALL women use shame to enforce social order among women, and men when they can get away with it. Men are the same with violence. ALL men. (And towards women when they can get away with it) Here a white women leveraged racism to solidify her place in her social order at that time. (The black male victim suffered death for that.) When enough white males clue in that women leverage \"male\" state and personal violence to enforce their own wishes, black lives will be saved.","commenter_a":"Female privilege. Didn't you know?","post_message":"Why Did Tyson Wait So Long to Reveal Carolyn Bryant Donham Lied About Emmett Till's Murder?"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""},{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":""}]
