[{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"1342427385796715","commenter_b":"Lock her up!","commenter_a":"How can people be voting for this woman I just don't understand we are doomed","post_message":"BOOM.... !! Judicial Watch comes out with a powerful STATEMENT.  @webpagelink"},{"comment_id":"1767802863447868","commenter_b":"Dirty old lady","commenter_a":"So, Madonna sexually assaults a minor, but it's all good because she's a female. Yay equality. #BecauseFeminism","post_message":"“Seriously, why would I sue Madonna for the best moment of my life?”"},{"comment_id":"10155433619800500","commenter_b":"The article says nothing about the use of donor eggs, just that she sought fertility treatments.","commenter_a":"High risk of having babies w/birth defects !!!!!","post_message":"TOO OLD or OKAY? This woman is 65 years-old and pregnant with quadruplets. @webpagelink"},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"10154872951699445","commenter_b":"She's a nut","commenter_a":"no, I would like to see Elizabeth Warren","post_message":"Would you like to see Vice President Joe Biden make a run for president in 2020? @webpagelink"},{"comment_id":"1052520311437414","commenter_b":"STUPID AMERICANS!!!!!WAKE UP!!!!!!","commenter_a":"Kick all muslims out of America.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"}]
