[{"comment_id":"10154355731201051","commenter_b":"stupid bitch.","commenter_a":"it doesn't matter what trumpie ever says His repugnant followers don't care about anything even if it affects them They lost out on the education they sorely needed..and they will never complain because they are too dumb to know it","post_message":"Actor Tom Arnold says he has secret recordings of Donald Trump doing something so bad that it could change everything."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"1454008947960907","commenter_b":"Just stop we will help them build a wall gladly","commenter_a":"Not going to happen. Not only has it been deemed unconstitutional, isolationism DOES NOT WORK in a multinational economy. This makes me roll my eyes just like when Texans were crying the same thing after Obama was elected (both times).","post_message":"Group calling for California to secede from the U.S. hopes to put question on the ballot authorizing vote on independence."},{"comment_id":"10152979533166438","commenter_b":"I love Katy, But I did noticed that and it made me laugh. She has no swag! But I think that's part of who she is she knew she couldn't dance for shit but she went and did her thing with a fresh face.","commenter_a":"What makes me laugh is how people are talking about the shark... Did we not notice Katy herself completely unable to move as a quasi-good dance partner with Elliott's dancers?!?!","post_message":"\"We should leave Left Shark alone.\""},{"comment_id":"10152892388271749","commenter_b":"oh, that makes sense, you live in bankrupt California.","commenter_a":"more uninformed people are stating that whites killed blacks (KKK) and somehow this means whites should have no say in the current crisis. However it is necessary to point out the gross inaccuracy of the white vs black default position that is happening. The KKK was started by none other than the Democratic Party. They even held meetings in THE WHITE HOUSE. It was not a white vs black terror group It was A Republican vs Democratic terror group. All blacks were Republican at that time for reasons that are obvious and for some that are not obvious Democratic party wanted to enslave and/or lynch blacks and go figure, Republicans had a problems with that. However of the estimated 5000 people killed by the KKK, 2000 were WHITE Republicans who, just like the Black Republicans, were fighting for equality and liberty that the dems were opposed to. So get off ...","post_message":""},{"comment_id":"1824334044515363","commenter_b":"She won't do anything","commenter_a":"Undocumented immigrants pay more taxes than Donald Trump plus a lot of them bring fresh vegetable and cheap food to american tables.. Hillary President !!","post_message":"Donald J. Trump on immigration during final presidential #debate: \"We have some bad hombres\" @webpagelink"}]
