[{"comment_id":"10152821814048717","commenter_b":"Lmao truth hurts!","commenter_a":"good job Rivas. leave the cheaters behind","post_message":"After helping the New England Patriots win the Super Bowl, Darrelle Revis has decided to go back to New York. The cornerback agreed to terms with the Jets Tuesday, his agent said. @webpagelink"},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: \"Party Unity My Ass!\") were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to \"line up behind her.\"","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"},{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"},{"comment_id":"430612380465476","commenter_b":"And what about the.over a million citizen muslims already here?","commenter_a":"Muslim immigration should be halted in this country and every other civilized country. Radical Islam is killing the world's people while government ignorance (Political Correctness) stands by and allows it to happen. Obama needs to stop apologizing for America and start protecting the American people.","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10157445323790093","commenter_b":"Because they wanna control things...U know the hands on your mind effect","commenter_a":"REMEMBER THE REPUBLICANS WARN US ABOUT AFFORDABLE HEALTH PLAN.","post_message":"Thanks Obamacare."},{"comment_id":"1081904121885815","commenter_b":"I do believe I posted my suspicions about this yesterday, keep in mind that Hillary is also under scrutiny of her campaign funds and Clinton Foundation.","commenter_a":"What a loser.","post_message":"WHOA!"},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."}]
