[{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"},{"comment_id":"639140816274210","commenter_b":"Just like your whore mother.","commenter_a":"She is a pig.","post_message":"I am sick and tired of Michelle Obama and her family in the White House...GET OUT!"},{"comment_id":"10154151440809087","commenter_b":"Hillary is for women. I don't blame her one bit, those whores knew Bill was married!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":"#BREAKING: Former Utah governor Jon Huntsman's shocking call for Trump to quit comes one week after saying he planned to vote for him."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"1579733685658472","commenter_b":"But let's bring them here, and take our guns.","commenter_a":"If the FBI AND Homeland Security interviewed the shooter 3 times and still let him go, then with those standards how are we supposed to believe that Syrian Migrants are going to be properly vetted and America still be safe?","post_message":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening."},{"comment_id":"10154346663693734","commenter_b":"Send this post to the wife's Lawyer. I'm sure the husband wouldn't put up with that if the rolls were reversed.","commenter_a":"This dude can't be serious😕😐😕.","post_message":"\"They need to learn to get along. If they love me the way they say they do, they will learn how to coexist in peace. That's not asking much.\""}]
