[{"comment_id":"10153817760650950","commenter_b":"@username HILLARY IS A EVIL OLD WOMAN THAT DON'T CARE FOR NO ONE BUT HERSELF","commenter_a":"People always want to have selective memory about who commit most of the mass shootings/killings. They are American born and home grown terrorists that are mainly one demographic. Trump and his supporters are jokes. Trump is ALWAYS putting himself in the news. EVERY time he opens his mouth his words will be scrutinized. Trump can always dish it out but HE can't take it. Presidential candidates aren't suppose to be whiners. I hope he and the Republican party go down in flames. Most of the Republican party is spineless and/or ignorant to have the guts to publicly stand up to Trump when he's wrong. So they defend him instead. Trump is a liar and dangerous! He's the KING of denial and deflection. His goal is to divide and conquer through fear and hate. We can't let them win! WE CAN'T IGNORE the fact that the Republican platform is that ANYONE ...","post_message":"The former New York City mayor introduced Donald J. Trump at his national security speech and left out one little detail."},{"comment_id":"1332051730168629","commenter_b":"She hasn't killed anyone idiot","commenter_a":"Now if only the Hilary haters would stop throwing around the word \"murderer\" as if it were a complement. The blatantly hateful behavior of so many Americans makes my heart ache and makes me ashamed to be counted among them.","post_message":"They finally collapsed."},{"comment_id":"10152727652141051","commenter_b":"LOL dumb ass bitches","commenter_a":"Wow how sick.could they wait until they got home","post_message":"These two women were chased out of a movie theater bathroom because the security guard thought they looked too much like men."},{"comment_id":"517409361772081","commenter_b":"Gina, Your hypocrisy is the true embarrassment to this country","commenter_a":"That gold digger hooker and Trump is everything that is wrong with corrupt capitalism. Trump and his bailouts and bankruptcy. People think he loves this Country when all his jobs are overseas! He makes me sick with all his lies. I will turn democratic before that bozo clown gets my vote. Donald Duck is a embarrassment to the American people, especially to the Republicans!! He needs is a psychologist not the White House","post_message":"\"When I don't agree with something, I tell him.\"  Melania Trump, wife of Republican frontrunner Donald J. Trump, said she is not a \"yes person\" to her husband, and in fact told him to go lighter on Jeb Bush earlier in the campaign. @webpagelink"},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."},{"comment_id":"10153218585709614","commenter_b":"You're right .... She probably knew he wouldn't leave his wife ... She needs death penalty ....","commenter_a":"Her \"married boyfriend\".... So 1 baby couldn't keep him, she needed 2??","post_message":"This 3-week-old baby, kidnapped and discarded in a trash dumpster, was the innocent pawn in an \"evil\" woman's elaborate plot to convince her married boyfriend that she had given birth to his twins, police said.  Giseleangelique D, 47, of Thousand Oaks allegedly sought out young mothers under the guise of a charitable organization looking for women with 1 to 2-month-old infants to assist.  That's how D found Eliza Delacruz, police say. She allegedly stalked the infant's mother and then had a co-conspirator snatch the child. Three other people were also arrested in the alleged plot, which includes an attack on another mother and child in El Segundo.   What investigators say they can't figure out is why 3-week-old Eliza was killed.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":""}]
