[{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"642161199307792","commenter_b":"If she get to say what she wants ,WHY can't the other people say what they want ,She talks down to ALL the people You could say that bitch pist me off and kelly would so you think all women are bitches no just the ONE THAT PIST ME OFF She just think she is everything do no wrong.","commenter_a":"No","post_message":"Megyn Kelly may be getting kicked off the air...  FOX needs our support, let's give it to them.  Do you support FOX News?"},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"10153275307228132","commenter_b":"You're a total dick!!!","commenter_a":"Junkie","post_message":"\"So funny, honest and loving. We lost a great one today.\""},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"1378443058862829","commenter_b":"SHES WAVING TO THE CROWD YOU ASSHOLES..","commenter_a":"Conservatives suck","post_message":"Wait till you see what she appears to be saluting."}]
