[{"comment_id":"660877367410427","commenter_b":"RACISTpig fucker","commenter_a":"Fuck you nigger u suck anyway","post_message":"Can i get a collective \"______this Guy\"?  Shop.tacticalshit.com"},{"comment_id":"825891407559633","commenter_b":"Nothing like putting more American lives at risk and putting us deeper in debt. Frickin buttholes.","commenter_a":"so is it a race to see who we can get attacked by first?!? He says war with mexico Bannon says war with china is inevitable This guy is challenging Iran--- BOOM!!!!!","post_message":"Even if this wasn't a direct threat, Iran will perceive it as one. --SarahB"},{"comment_id":"10154451547182144","commenter_b":"oh just shove a vagina in her mouth and shut her ignorant racist hate filled mouth up #sorryvaginas...but she loves to eat them","commenter_a":"what an idiot","post_message":"Dick Cheney's torture-loving daughter is back in Washingtonand she's very excited to help Donald Trump torture people."},{"comment_id":"10155394034488352","commenter_b":"I used to work as cashier and I witnessed a couple of white people trying to pay for others people groceries so they will get the cash . They will go around asking Hispanics mostly Mexicans to pay for their groceries so the Mexicans could give the cash to them??? Yup cheating the damn system , of course we wouldn't do it for them . This bitch came to me one time and Infront of me she offered to pay this Mexican ladys stuff and I said to the Mexican lady don't do it , she's asking to do something illegal . The bitch was like why you telling her that ,I was like look I can take your name right now , you are on camera and I have this lady as witnessed. I can contact social services right now and tell them what you doing .... You will ...","commenter_a":"If you gave them citizenship most would turn it down. These people don't want that. Then they would have to pay taxes. I work with mexicans and and other immigrants. The legal ones I work with didn't like the illegals on Fridays cause they brought home more. If yaw people want all these immigrants here so bad take them into your homes. Our country can't handle anymore forms of welfare.","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10153649615904199","commenter_b":"The employee aint do nuthin wrong. she got hit. ole white girl lucky she didnt get stomped harder.","commenter_a":"The employee should be fired. People need work ethics. Call for the customer to be removed!","post_message":"Warning this video contains graphic language."},{"comment_id":"10155124264189679","commenter_b":"Lock this old hag up....","commenter_a":"No No No","post_message":"LIKE to support, comment to discuss."},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."}]
