[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"366282870162354","commenter_b":"Shot in head","commenter_a":"Death","post_message":"89 Year Old WWII Veteran Beaten To Death By Thugs. This is tragic. Please send your prayers. What do you think their punishment should be?"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10154760040172293","commenter_b":"Shes an indenity thief. I think Alyssa was referring to actual criminals","commenter_a":"Hopefully every single one who has blatantly broken Federal laws and made a joke of our Justice system. They are all criminals by definition. Round them all up and return them to their homes in Mexico and Central America.","post_message":"This scenario is one that President Trump opponents imagined becoming far more common were he elected."},{"comment_id":"903785579812018","commenter_b":"OH BUT HE\"S BLACK HE DON\"T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"570070006492803","commenter_b":"Beat trump I. Want a Christian men with a back bone .we can live better cleaner an safer","commenter_a":"I bought what I was getting for Christmas before Thanksgiving so that I could concentrate on the ultimate gift , Jesus.","post_message":"Hello everyone, I wanted to make sure we had some time tonight to spend with each other. As always, remember to keep sending me your questions via text to ASKBEN (@username on your mobile phone).   There were many questions from all of you asking “what is one of your favorite things about Christmas?”     Honestly, I love to see the look on everyone’s faces as they open presents – that’s the best part for me, seeing the look children have in anticipation of a gift. During this season, I always try to remind myself of the greatest gift…our savior Jesus Christ.   I know that many of us spend the week leading up to Christmas frantically rushing around buying presents, our time occupied with “how much to spend” on loved ones, rather than spending much time occupied with those loved ones. It’s about relationship, not retail. We should remind ourselves of that more often.   It is easy to become distracted by the world when we are constantly being bombarded with competing priorities, our time becomes monopolized by differing pursuits and positions, fleeting moments that will pass. Our true pursuit should be everlasting, one that cannot be wrapped in bows, it does not perish. It is peace. It is good news, in pursuit of others as we share with those we encounter. Just as we are now, you and I, sitting here together sharing this moment in time, these are the moments that do not fade or wither upon snow’s first falling – this is the season to be joyous with one another, lift others as He has lifted you, our hands united in hope.   That is why Christmas is special to me – I am reminded of the greatest of gifts every time I see my children and grandchildren’s faces. Hope.   Thank you for sharing your evening with me, I look forward to many more.   Goodnight, Ben"}]
