[{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."},{"comment_id":"1065968390113738","commenter_b":"William Tryon WOW...totally makes sense NOW, 10 Celebs Moving that Already Own homes in Other Countries, In Exchange FOR LUNATIC Trump Promising TO Send OUR KIDS to WAR...Excellent Logic!!! NOT!!! Our Country is Not A Business For Trump To Practice HIS Failures ON--IT'S OUR COUNTRY!!! MoonStruck \"SLAP\" Snap Out Of IT!!!! Trump has Infected Our Country With IGNORANCE The Worst EPIDEMIC! Trump Rising! DID the Hiel Hitler Salute On National TV for the World TO SEE..Disgusting!! VOTED For TRUMP & Got KIM JONG UN & Porn Star.... WWIII-- DO WE Want ALL Our Kids To Get Drafted Into A Greed WAR for Trump!! THE Epidemic in Our Country by OUR OWN Citizens Addiction TO Porn, Drugs & Human Trafficking is a Major Problem IT Comes By Boats, Planes, Trains & Automobiles CUT the Consumption Solve The Problem that Huge Problem. MEDIA Has Attached ITSELF TO Trump's BOOB because MASSIVE Orange ...","commenter_a":"Another reason not to vote for Ted Cruz. #Trump2016","post_message":"“The only guy who can beat [Donald J. Trump] is Ted Cruz.”   Breaking News: Carly Fiorina has endorsed Ted Cruz for president."},{"comment_id":"971423549572732","commenter_b":"Girl, is there any other?","commenter_a":"Dukes!!","post_message":"FOLLOW UP: We asked this morning about whether you like banana and mayonnaise sandwiches….if you say YUM, what mayo are you using?"},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10153335788334714","commenter_b":"Still a bitchh","commenter_a":"They named it the failed \"parenting\" tree in honor of welfare checks, EBT cards, and Section 8 vouchers.","post_message":"The trees were chopped off at the trunk"},{"comment_id":"10153632735051636","commenter_b":"@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"}]
