[{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from \"hell\"!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."},{"comment_id":"640840709429112","commenter_b":"QUIT RAPING AMERICA ..........WHY ARE YOU NOT IN PRISON. .........WHY","commenter_a":"oooh, I bet they are shaking in their boots","post_message":"BREAKING NEWS: Obama fires back at Russia..."},{"comment_id":"1006387419398598","commenter_b":"Go away upchuckie!","commenter_a":"Where do these NUTS come from? Is there some unknown idiot tree orchard somewhere in the U.S.?","post_message":"\"Schumer’s proposed anti-gun plan takes government “overreaching” to a whole new level.\"  Blaze contributor Susan Calloway Knowles:"},{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"\"Presidents have the ability to take executive action, but they don’t have the ability to change the law.\"  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10156451475900500","commenter_b":"Fire her","commenter_a":"So this woman or all the people she was ordering food for did not have a cell phone to order lunch? It should have never been done with a 911 phone.","post_message":"DANGEROUS SITUATION- What do you think of her punishment?  @webpagelink"},{"comment_id":"10153072865096717","commenter_b":"She would get beat down","commenter_a":"I'm not surprised. The only person she gets along with is Q-Tip, and his single greatest contribution was a cameo on the Dave Chappelle Show where he told kids to \"do the VD dance.\"","post_message":""},{"comment_id":"10153526289392183","commenter_b":"She is one nasty creature!","commenter_a":"You have nothing to worry about you entitled shill. Your we does not include me. Go Bernie!","post_message":"She's setting up the arguments for the general election here."}]
