[{"comment_id":"10153340551136336","commenter_b":"I don't believed this syory","commenter_a":"If this is true, Airlines are about as out of control as the cops and tsa themselves are.","post_message":"“You wouldn’t want to watch your family member crawl onto a plane, I mean come on, this is America.”  Theresa Purcell said the American Airlines gate agent made her crawl because it was too late to set up a ramp for her to board."},{"comment_id":"1801777286727036","commenter_b":"She won't get paid for this job","commenter_a":"Kellyane Conway you are a pollster and not a campaign manger and it is showing. You have never been part of a winning national campaign your whole political career, and with Donald \" The Crook\" Trump it looks like your record will be kept intact. Your only hope is that everyone has missed this army of Donald \" The Crook \" Trump supporters out there that just can't wait to vote from Donald \" The Crook \" Trump. But the only factual data that we have right now is early voting numbers,and so far Hillary Clinton is leading in the battle ground states including Florida,if Donald \" The Crook \" Trump looses Florida it is ball game over, he will never reach the 270 electoral votes to win the election. He has to win Florida, North Carolina, Colorado, Nevada, and turn a blue state or two red. I guess anything ...","post_message":"\"Apparently the Hillary Clinton team is playing follow the leader, with us in the lead.\"  -Kellyanne Conway"},{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."},{"comment_id":"10153516568789087","commenter_b":"Muslim is not a religion it describes someone who worships Islam. Guess what ISIS stands for? Its the radical group of Muslims you understanding? Its a Muslim group of people that engages in terrorism. Trump wants to ban Muslims from coming here and he wants American Muslims to help us sort out who is good or bad.","commenter_a":"How is Trump a white supremacist? He has never said anything racist okay \"illegal\" is not even a race. Trump has said millions of times he supports immigration. What he does not support are people that are dangerous getting free cards to come here. Also to those who say illegals don't use Government assistance they do. They fucking come here have an anchor baby and then use the babies citizenship to get Government assistance. We have a serious problem I have a Mexican friend who is American with perfect credit and great job. She tried to buy a house and got told no. Guess what same house and a family both illegal except their 2 girls bought the house. How is that fair to anyone? Illegal immigration impacts Mexicans who are already here legally and it's not fair to them if others cheat the system. If you are so damn ...","post_message":"“I would certainly return it if you think it is appropriate,” Donald J. Trump told a voter who asked if he would return the donation he received from noted white separatist William Daniel Johnson. “I would return it. Don’t be so angry, I don’t even know who he is.”"},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"10154698586269641","commenter_b":"Or avoid stealing from worker or outsider, as well as free up labor to provide a cleaner environment","commenter_a":"What they're doing is phasing out people so they don't have to pay $15/hr wages.","post_message":"McDonald's is getting fancy - the chain is rolling out self-order kiosks, mobile pay options, and even table service"},{"comment_id":"10153557927894411","commenter_b":"they should allow rocket launchers and rpg's to blow out anyone who draws out the frigging gun","commenter_a":"We need to make sure movie theater workers all carry guns so they can pull one from their holster and save the day!","post_message":"BREAKING: One of the deceased is the suspect, who reportedly turned the gun on himself."}]
