[{"comment_id":"862806877145701","commenter_b":"Well said @username well said. America was built on the backs of immigrants, the indigenous people were treated and still to this day treated worst than the Buffalo. I hear them cry about migrants coming across the border, when they themselves have no right to the land they call home.","commenter_a":"History will judge him to be one of the best presidents we have had. I hope in the near future we will be able to have another such president.","post_message":"We DEFINITELY have Pres. Obama's back. Do YOU?  Thanks to Roy Mark Ramdas and Being Liberal."},{"comment_id":"611608348972347","commenter_b":"You just broke the Internet with that post!!!! Lmao! I DESPISE HER! And her INNER GODDESS! Freakin lunatic!","commenter_a":"Just seeing Oprah made me want to take a dump.","post_message":"Absolutely brilliant write up."},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"10153146887251955","commenter_b":"She is ugly like hell!!","commenter_a":"Hair fell out because nothing in her head to attach to","post_message":"Bald first lady?   'Jeopardy!' appearance raises questions"},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"10156171659485354","commenter_b":"Get the f away from American . I brought my religion to this country !?? I keep mine in side , Don't wear that ugly scary thing over your face !!! That scares me wear it inside or with you groups . You weren't born with it you're gonna die for not wearing it !?? I don't I promised to accept and care for what was in America . I ve got to see with my eyes . It is deadly scary to me , can't be around them .","commenter_a":"It was a fake bomb the next one won't be if that was a white kid he would be jailed you can't even point your finger because it represents a gun and you get kick out of school. So what gives with this","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"10153050931108984","commenter_b":"unbelievable .... if he would not have fought .. they would not have a chance to protest ... arrest them all, through them put of section 8 housing, take their welfare check and foodstamps away .. tye are scum bags of the worst !","commenter_a":"You can't fix culture none of them have served in the armed forces and never worked that's why they have no respect","post_message":"In case you missed it...This is absolutely disgusting. This hero deserves everyone's respect.  Do you support the brave men and women who fight for our freedom?"}]
