[{"comment_id":"1569576153350573","commenter_b":"Oh, and your fat head out of women's uterine issues!","commenter_a":"The goverment has no right to interfere in a very personal decision, hard enough without some men thinking they can decide for us.","post_message":"Don't doubt him for a second..."},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"},{"comment_id":"10155392185178352","commenter_b":"@username she still immigrant . She come in visa and hurry married for papers like any other person.","commenter_a":"He better deport his wife too","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"10153235359857093","commenter_b":"Same procedure as a mandatory hurricane evac. Some people just have to cause issues tho","commenter_a":"Are they going to arrest people who do? It's interesting that the homeowners aren't allowed to determine if their own home is safe.","post_message":"The Garland Police Department is asking those people who are able to remain safely sheltered in their homes to do so.  Residents who leave the damaged area will not be allowed to return until it is deemed safe.  Officials are working to identify and secure any possible utility hazards such as gas leaks and downed power lines."},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"}]
