[{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"},{"comment_id":"1772017636373096","commenter_b":"Women have no business being police officers. Would you give her the Nuke Codes? Imagine Hillary Clinton","commenter_a":"Surrounded by 5 fellow officers? Whatever! You murdered a father of 4 on a disabled Vehicle call.","post_message":"The attorney for Tulsa Police Officer Betty Shelby says she believed Terence Crutcher was attempting to reach into his car to retrieve a weapon. In her interview with homicide detectives, she said, \"I was never so scared in my life as in that moment right then.\""},{"comment_id":"10154260914771130","commenter_b":"@username and she's gonna tell her fake mom too!","commenter_a":"@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"904920249698551","commenter_b":"Fuck this bitch in do care who sings at this bitch shit he's not my president fuckem","commenter_a":"No","post_message":"What they just confirmed about the Trump's inauguration... This is just what we've been waiting for. Are you excited for Trump's inauguration?"},{"comment_id":"10155528648886729","commenter_b":"Let those people lose a day's wage and let those business' lose a day's earnings. Who cares. We should have no illegals working, instead the long term welfare kings and queens should be working to earn those welfare checks.","commenter_a":"I have a question. If all the Chavez supermarkets, which the Hispanic community supports by shopping there, closes for the day where will a mother go to get that gallon of milk she needs? Also, will the supermarket pay any employee that doesn't work today?","post_message":"Oops."},{"comment_id":"685645904949943","commenter_b":"Go fuck your sister","commenter_a":"59% don't care to show his taxes!!! But I put money on that same percentage CARED about his birth certificate!!!! People of this country make me sick!","post_message":"The Rachel Maddow Show is right –– this is an \"unimaginable corruption scandal.\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."}]
