[{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."},{"comment_id":"10153931656668812","commenter_b":"This is way out of context y'all all sound ignorant specially the one starting this comment","commenter_a":"Waiting to see who blames Obama or immigrants....","post_message":"Long Island town demolishes U.S. Navy veteran's home while he was in Florida recovering from a knee replacement: @webpagelink"},{"comment_id":"1079209208779497","commenter_b":"She got them takin away bc of her psychological problems","commenter_a":"Run, mom, run. I was involved in a custody battle with my ex who had money and guess what? I lost!!","post_message":"Hillsborough Sheriff's detectives are asking for the public's help locating two missing twin girls who are believed to be with their biological mother who just lost custody of the girls."},{"comment_id":"10154879190478812","commenter_b":"Shoot back you spineless worms","commenter_a":"That's a lie. Yemenies love USA soooooooooooo much","post_message":"Two missiles fired at U.S. Navy guided missile destroyer USS Mason in international waters off the coast of Yemen on Sunday, according to the Pentagon."},{"comment_id":"10153521258341990","commenter_b":"Stfu","commenter_a":"Respect to this guy! :D","post_message":"#Update: Police say a man who was arrested for weapons and explosive materials wanted to harm today's LA's Pride Festival. @webpagelink"},{"comment_id":"392258217629139","commenter_b":"Does that mean old fat women can go to a strip club and ask for a job when there is an opening and sue if they are turned down?...","commenter_a":"No it's not \"fair\"...she should conform like the rest of us. What the heck is she doing in the \"fashion world\" in the first place? There is absolutely no fashion in wearing a hijab. NONE.","post_message":"Is it fair that this Muslim girl sues for not being able to wear her headscarf when it goes against company's policy???"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."}]
