[{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"},{"comment_id":"633540503462936","commenter_b":"Whoooo so what. It's not like he left guys to die in Benghazi.","commenter_a":"Jesus who cares. How many years ago was it? Too many! I don't care what crap they find out about him, I will still vote TRUMP!","post_message":"Did he or didn't he? Listen to the recordings here and weigh in below: @webpagelink  (CC: Donald J. Trump)"},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"1234562866583168","commenter_b":"Hillary can sell pieces of our country, lie to investigators, channel campaign money, donations and contributions to her \"charity organization\" into her own personal slush fund, and she uses one technique to keep her out of the limelight for very long........she deflects whatever she does to whomever challenges her. Harry Reid is a complete idiot. Obama's constant comments of ridiculing Trump is the same technique. How dare that piece of trash accuse Trump of not being American!!! He is lawless, devious, lying, aids the enemies to be able to be in a position to kill us, takes money and feeds people who are illegal, criminals and he DARES to call Trump Un-American??!! He is seriously sick in the head...he THINKS he is the ideal American. Why do we still have a nut in the oval office? Shame on anyone who listens to this crap....and I can't wait to have both ...","commenter_a":"Just shut up, sounds like squeaky mice got caught, just go away quietly no one will miss you...","post_message":"HEAVEN HELP US  @webpagelink"},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"985288268192005","commenter_b":"she looks like the Queen of Qualudes.","commenter_a":"Or if she is in jail","post_message":"The Democrat Party WILL NOT let Bernie Sanders be the nominee – no matter how many States he wins, how many delegates he has or an other reason.   Watch this and tell me if you agree:"},{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"}]
