[{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"1130843966969767","commenter_b":"Good keep them there and deport them","commenter_a":"Like packs of hyneas.","post_message":"UNREAL! SOMALI MUSLIMS RAMPAGE Through Mall Of America In Minnesota...10 Arrested [Video]"},{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"},{"comment_id":"820953834667537","commenter_b":"He's not a Muslim.....and if he was so what??? Oh I forgot we live in America where it's screw every other religion but leave Christians alone.","commenter_a":"“I’m not sure what’s more shocking, the atrocities of ISIS or the silence of the Obama administration,”Perkins said. Perkins and Kelly also discussed the Islamic State’s ultimatum, as well as their torching of an 1800-year-old church and destruction of one of the oldest communities of Christians in existence. “That’s the choice of freedom under Islam,” Perkins said. “This administration has been silent continuously when Christians have been persecuted,” he continued. “[It] is more concerned about offending Islamic states and Islamic nations than they are of defending the long standing policy that America has always had — that religious freedom is a human right, not just an American right.”","post_message":"“We will find the people who did this. France is today shocked by this terrorist attack.”   -  French President Francois Hollande"},{"comment_id":"10153277275566336","commenter_b":"Thugs!!! This has got to stop!","commenter_a":"Breaks my heart!","post_message":"Omaha, Nebraska police officer Kerrie Orozco was killed in a shootout a day before she was scheduled to go on maternity leave."}]
