[{"comment_id":"991707680869704","commenter_b":"Sorry ladies - simply not a fan and not willing to jump on her bandwagon because she seems to be the only female who's interested and has the ability to pursue it.","commenter_a":"Wouldn't vote for her if you paid me.","post_message":"If Republicans want to wage a war on women, they'll have to go through Hillary first."},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"\"Hillary was the president already once. You know what I sayin?\""},{"comment_id":"977246632310796","commenter_b":"Wth is a \"male feminist\"? This term is a total failure to understand what a feminist is.","commenter_a":"Amazing! A way for men and women to share the responsibility of contraception. This is the true mark of a male feminist.","post_message":"This is ballsy."},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"1021313581261452","commenter_b":"Nasty bitch","commenter_a":"I hate to admit it but Fiorina is right, maybe the first time in her life, but........","post_message":"Haha, it's true though"},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"}]
