[{"comment_id":"1262067313806885","commenter_b":"@username ...You are a very smart Lady... 100% correct","commenter_a":"Chris Christie is a bully like Trump. Senator Marco Rubio owned him, Rubio was just trying to get across the truth about what Obama has been doing all along. Is Rubio perfect, NO, but show me one politician who is please. As for his youth, remember John F. Kennedy anyone?","post_message":"The pundits expected a pile-on at the #GOPDebate Saturday night, but Chris Christie was relentless in his attempt to take down Marco Rubio."},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."},{"comment_id":"1695494594049179","commenter_b":"And who's fault is it that the cartels exist ?? -- Your people! The youth in your country and their parents . The main fact that ignorant Americans either fail to realize or completely ignore is that America is the #1 drug consumer country in the world ! In order to be a business there needs to be a demand. Your society is demanding drugs you people are raised on terrible values and customs which is why you are heavily consuming drugs ! If your government could find a way to avoid that demand and necessity the business would cease to exist. Your people are indirectly the cause of the blood that sheds south of the border . Of course you didn't do your research properly! BITCH.","commenter_a":"#BringBackJonStewart ... Sorry, but you're misinformed and simply not funny Trevor. You obviously never visited a border town where cartels are actively kidnapping Americans. This is happening right now, while you attempt to make unfunny jokes about the problem","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"1297459886999211","commenter_b":"People, people, people, ain't nothing going to happen to this horrible, discussing bitch 🇨🇱","commenter_a":"Nasty woman.","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."},{"comment_id":"10154453619319030","commenter_b":"@username @username @username Kirsten Kolch Don't call her a bitch, but BUY YO BITCH SOME CHOCOLATE!!!","commenter_a":"Ching Lee Susan Ngo lmao so this is where I heard period sync","post_message":"Key & Peele is gonna teach you dudes something at Menstruation Orientation.  Watch the full episode: @webpagelink"},{"comment_id":"10155911765540389","commenter_b":"hillary can win if they let enough illegals in","commenter_a":"Stay on her, Mr. Trump!!!","post_message":"\"Hillary was the worst secretary of state in the history of our country.” – Donald J. Trump"},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"}]
