[{"comment_id":"10154394600380695","commenter_b":"Girl sit down... Really","commenter_a":"Why is this disgusting waste of human flesh still walking amongst us? Lock this rapist up already and throw thr key in the bottom of the Pacific","post_message":"BREAKING: The 78-year-old actor faces up to 10 years in prison if convicted."},{"comment_id":"1004815269538226","commenter_b":"No im against the pregnant women always tryna make the world owe them for having sex.","commenter_a":"Pregnant women have too much sense of entitlement I have no pity for the broad Much respect to the cops","post_message":"When Charlena Michelle Cooks, 8 months pregnant at the time, would not tell officers her name right away, they pushed her to the ground on her belly and cuffed her. Video: kiro.tv/BodyCam"},{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"10152824464986680","commenter_b":"Its always been a problem, but its never been so widespread and in our faces. Without Snowden we would still think this was a big conspiracy.","commenter_a":"He will force the end of the PATRIOT Act then blame Obama when we are attacked.","post_message":"“I don’t agree with Sen. Paul on this issue, but I think he’s been a constructive guy,” Senate Majority Whip John Cornyn of Texas said just before the week-long recess."},{"comment_id":"288699034881182","commenter_b":"Now, have you been able to fill these jobs with non immigrants?","commenter_a":"What were they expecting to happen...","post_message":"From Oklahoma to New York, bosses fired groups of workers after they didn't show up at their jobs in order to protest at last week's \"Day Without Immigrants\" demonstrations."},{"comment_id":"10153630304246509","commenter_b":"Guess you've never heard of Irish-American clubs. Guess you've never heard of Italian-American, German-American, Polish-American or perhaps people celebrating their ethnic heritage. So apparently pride in one's ethnic origins is not extended to Black Americans. What is the name Rush? English? I'm betting someone in your family came over on the Mayflower? Proud of that? Why not? Apparently if you were taken against your will in irons on a slave ship you also lose your ability to take pride in your heritage as well?","commenter_a":"There is no such place as \"Africa-America\" therefore there is no such thing as an \"African-American\". They are either Americans or they are Africans. Not all blacks come from Africa and not all Africans are black. Why don't they try and be American's for once in their life's?","post_message":"After recording an ode to Baltimore, #Prince has announced a Mother's Day rally and concert there. Concertgoers are invited to wear something gray: @webpagelink #FreddieGray"},{"comment_id":"10154409316811336","commenter_b":"I think like all of us Trump thought no this can't be and thus he thought it was a joke! Then reality of course set in and the man thought as we all do who would expect anything different from the Clintons? My question what is next to come it is something every single day?","commenter_a":"Why would Trump think that such a meeting would be just a joke? All of these democrats are capable of any despicable act imaginable! They have proven it over and over again, but all we ever do about it is whine like little punks! obama should be in prison, hillary should be on trial and lynch should be removed and arrested as well! ENOUGH with the beating around the bush! We need to hit them on the head! They need to be punished severely NOW!!!","post_message":"“I'm flabbergasted by it.”  Donald J. Trump reacted to the news that Attorney General Loretta Lynch met privately with former President Bill Clinton amid the DOJ’s investigation into Hillary Clinton’s emails. Full interview tonight at 10p ET."}]
