[{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"},{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"705392762974353","commenter_b":"Lol too bad she does more for this country than you ever will","commenter_a":"She's awful. She's a spoiled brat that needs attention. We need to stop giving her a second of our time and let her slither back to wherever she came from. Maybe she can go live with Heidi and Spencer.","post_message":"Newly-uncovered video proves Tomi Lahren changed her position on climate change to appeal to misinformed conservatives. SHARE to spread her shame!   Video by Occupy Democrats, like our page for more!"},{"comment_id":"10153712175233352","commenter_b":"So it would be ok to throw down in front of a toddler is that what you are saying? She should have put her down for what huh, for what? Get some sense in your head !! The only guilty party is the lil bitch who hit the girl holding a child she is a straight up coward and thats probably the only reason she hit her cause her hands were full!","commenter_a":"I think all parties are guilty the ones egging it on the mother of the child and her friend. Her friend seen what was going on so she should have taken the baby and the mother... Should have put the baby down as she see the girl kept saying put the baby down and appeared not to give a dam. Believe me all parties played their part in the hatred or what ever that got them to this point. In reality the mother used her child as a pawn thinking it would have saved her from a ass whooping putting her child in danger. Thank God the female was caught and the baby is ok. They all need to get it together... Because believe they all full of shit and played a roll in this fight...","post_message":"Texas girl, 13, who was caught on camera as she launched brutal assault on rival teen holding a toddler is now in police custody"},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"}]
