[{"comment_id":"1385848588104594","commenter_b":"@username orange anus.","commenter_a":"Karma is a bitch. What goes around, comes around. Your day will come, cheeto face, orange anus.","post_message":"UPDATE: Following the publishing of this article, Fox 2 posted a follow-up story saying Mike Hager, who said his mother passed away of a medical condition after being denied entry to the U.S. despite holding a green card, lied to their reporters.  Hager's mother died five days before the ban went into effect, with Trump's de facto Muslim ban playing no role, Imam Husham Al-Hussainy told Fox 2."},{"comment_id":"10154680917183352","commenter_b":"What these women would really look like without the weave an fake eyes an their natural color so much plastic they can make Tupper ware","commenter_a":"Are you removing that photo method man asked you to remove?","post_message":"BREAKING: T.I.’s Wife Tiny Reportedly Caught on Video Fighting and Beating Her Husband’s Alleged Mistress! ---> @webpagelink"},{"comment_id":"1116694178387110","commenter_b":"Jim Kelley who's disingenuous now? Context is everything, two debates are scheduled during major NY sports team match ups. The other during his good morning America interview.","commenter_a":"Bernie is not even registered as a Democrat. He is just running on the Democratic ticket for funds and benefits. He should have run as a socialist, Oops, I mean Independent. Hillary 2016","post_message":"Hillary Clinton cree que la educación es la clave para salir adelante. Lee el artículo."},{"comment_id":"607961416030479","commenter_b":"Make America Mexico! Isn't that what the dumbass idiots where chanting when they where protesting Donald trumps rallies! Trump 2016 build that fucking wall!","commenter_a":"God damn! @username","post_message":"The Zetas tortured and killed around 150 people, and then incinerated the bodies or dissolved them in acid."},{"comment_id":"10153541764830779","commenter_b":"Lmao ugly her ugly ass","commenter_a":"Of course she feeling lemonade considering how many times Bill cheated lol @username","post_message":"Hillary Clinton visited 'The Ellen DeGeneres Show' for an interview that airs today, with the Democratic candidate discussing a variety of topics from potential vice president picks to her admiration for Beyoncés 'Lemonade.' Watch her play \"Who'd You Rather: VP Edition\" below, and see who she would choose as her running mate."},{"comment_id":"741587372614642","commenter_b":"Won what???","commenter_a":"You blind-hearted Zionists, you just can't bear it that the Iranians have won and you lost: can you; the barbarians!","post_message":"A year after war with Israel, Gaza rulers boast of revitalized efforts to prepare its fighters for the next round of violence."},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that \"all that many of us have fought for all our lives is at stake\" following Donald Trump's victory in the presidential election and vowed that \"we are not going down without a fight and Donald Trump needs to know that.\""}]
