[{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"1370743996276280","commenter_b":"She knows, because she spent a lot of money buying all those super delegates. Fact is neither will have enough pledged delegates to win outright, so bribed insiders will determine the outcome. That's really democratic isn't it. It really the Clintons and the DNC that are killing the party.","commenter_a":"Vote SANDERS","post_message":"Hillary Clinton said what everybody outside of Bernie Sanders and his supporters are thinking. The Democratic nomination process is in effect over, and there is no way that she won't be the nominee."},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"479579702230323","commenter_b":"Yes","commenter_a":"Finally!!","post_message":"Do you think Hillary should be facing criminal charges right now? [Watch below]"},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"10153487298809877","commenter_b":"This is a very fine line that people are walking, it's offensive because if you think about it you are saying a woman is a ho and you don't even know why she is dressed how she is dressed. Women are the worst....if you want to wear a form fitting dress...go for it.....if not....that is good for you. Please stop.","commenter_a":"I don't understand where the problem is. That is her choice and I commend her.","post_message":"Ayesha Curry Says She's Not Into 'Barely Wearing Clothes,' Prefers to Keep it Covered Up for Husband Steph. Twitter had plenty to say about that! Read more below.  Grio fam, we say 'do you' when it comes to fashion. What's your reaction?"},{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"\"We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.\" —Vice President Biden  Watch the weekly address: @webpagelink"}]
