[{"comment_id":"10154054028806178","commenter_b":"Crazy woman.","commenter_a":"NYT - suck it.","post_message":"Did you see this coming?"},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""},{"comment_id":"10153396902714270","commenter_b":"There are jobs women cannot do in our military, because they are unable to meet our standards.. (Combat arms) Pretending to be a man would get them in. Unable to meet standards, they would damage our combat effectiveness, ability to adapt, and endanger the mission. That, and people will get killed dragging them along instead of fighting the enemy. IF it is tolerated too long, they will wind up deployed in a combat situation. It will cost lives. Caught unable to meet standards in the rear will cost them a possible career, and they will be processed out. Nothing wrong with that to you?","commenter_a":"Being transgender is not a mental disorder. Both the APA and the AMA agree. Also nearly every single western military in the world allows transgender people to serve openly in the military. Even Israel, a country that has significant treats to their nation allows transgender people to serve openly. Plus there are already 15,000 transgender people serving in the US military right now. Their service should be honored and not conditioned upon whether or not they can keep their gender identity a secret.","post_message":"\"He began to suspect that the military, despite its ban on allowing transgender people to serve, was somehow attracting them at a disproportionately high rate.\""},{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":""},{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"}]
