[{"comment_id":"10154885084089411","commenter_b":"we all good woohoo like riding a wave..","commenter_a":"Leah stay safe. Xx","post_message":"URGENT New Zealand civil defense warns of tsunami, urges people on South Island to move to higher ground"},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians.  The Mind Unleashed"},{"comment_id":"1801266436786153","commenter_b":"Ungrateful bitch what an embarrassment for her team disrespectful I throw her off the team","commenter_a":"Yes","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"356605304542984","commenter_b":"Round them up. Shoot them. Send body bags back.","commenter_a":"with the help of our government they will win. little bush wants to take the walls down and do away with the border guards , it will save trillions of dollars each year. after all most of them are here now","post_message":"Are the Marxists gaining in their Desire to Destroy America?"},{"comment_id":"10153347814342426","commenter_b":"glad they got this on camera so she can't talk any bull about this officer!! crazy women","commenter_a":"Should've knocked all her teeth out period.....","post_message":"Going to the DMV can be stressful, but this Florida woman completely lost it at the counter. After she was asked to leave, the 31-year-old woman would not go without a fight -- with a Florida State Trooper."},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"10153128957476523","commenter_b":"And yet you probably voted for a whore for governor.","commenter_a":"You know what prevents STDs? Not being a whore.","post_message":"Health officials in Racine pass out free condoms to reduce STDs, but not everyone’s happy. FOX6's A.J. Bayatpour has the story:"}]
