[{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"},{"comment_id":"663841097139802","commenter_b":"F the immigrants, it is Thanksgiving, you Effing Retard. Welcome to America, we are Americans.","commenter_a":"fuck him","post_message":"The Obama administration is trying to ruin your thanksgiving.  This is absurd. We can't let him get away with this.  Will you still call it Thanksgiving no matter what?"},{"comment_id":"10154570057689369","commenter_b":"Hillary was dead broke, now worth 100 million. How much taxes did she pay on that? 100% growth should be taxed at a high rate according to Hillary.","commenter_a":"Can Trump shut up for atleast one week. Every day, he is making a point, where more n more people are hating him","post_message":"\"No one should be surprised, though, if Donald J. Trump has paid far less - perhaps even zero federal income tax in some years.\""},{"comment_id":"769057633200701","commenter_b":"She deserved to be sterilized or shot.","commenter_a":"AMAZING THAT THEY WERE THERE TO HEAR THE BABY THANK GOD, BURY THE MOTHER NOW ALIVE! ANGERS ME","post_message":"A newborn girl thought to be only 36 to 48 hours old was found  alive in Compton on Friday.   The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed.   Detectives are now asking anyone with information to come forward.  this post to alert others.   Read KTLA story here: @webpagelink"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"10152888529356051","commenter_b":"Well that's where becoming a mature adult comes into play. He's had three children with more than one woman not married to any of them not stable himself there for you get what you get. Young people and old people to please stop having babies you didn't plan for it. You didn't save for. And you can't afford. Whether or not the mother works as a relevant because at this point she didn't get herself pregnant and cant. Guys wrap it up put on a raincoat run the rubber road or better yet stop treating sex as an entertainment videos. Stop having sex with all these women and not looking at the big picture tell you don't drive your car without a spare so don't live your life that way be prepared","commenter_a":"my son is a father of 3 girls, he pays so much child support that he cant afford to live himself, by the time he gets paid and all the child support comes out he has any where from 20 to 30 dollars to get in through the week..He cant afford to by food, just barley has the money for gas to get back and forth to work with, while in the mean time, the mothers get $500.00 a month in food stamps, don't have to work, They live off of his money, he cant get food stamps because he makes too much..well if they seen his check after everything comes out, then they would see what he is going trough. The laws needs to change..make these mothers get out and work.Cut out the food stamps because the mothers are selling them just for the money..","post_message":"This man has gone without food for days because of all the child support he owes. There’s one big problem with this."},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"}]
