[{"comment_id":"612744012249511","commenter_b":"Absolutely! Prison is where she belongs for many reasons.","commenter_a":"And she should go to the one named after her husband and put in solitary confinement so we never have to hear from this troll again","post_message":"A judge just presented new evidence that could put Hillary away for good.  Finally. Put her in jail already.  Do you agree Hillary belongs in prison?"},{"comment_id":"555357001316722","commenter_b":"@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as \"a fraud\" and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"1905080359721745","commenter_b":"I. Bet money the daughter started it and got in her feelings when white girl wasn't going for the bullshit.","commenter_a":"But yet where were you at when your monkey was jumping around and disrespecting people.","post_message":"Used that right hand like a weapon!  #WSHH #Fight"},{"comment_id":"10153404039272293","commenter_b":"@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"\"I saw the weapon in his hand coming out of his waistband,\" one officer wrote in his statement. \"The threat to my partner and myself was real and active.\""},{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""}]
