[{"comment_id":"10154380383764091","commenter_b":"Hoe shut up!","commenter_a":"Thank gawd he is out! Worst president ever. They want to praise the south side of Chicago,but have done nothing to help the killings in the city where they got their start. Turned their backs on them","post_message":"\"You've made me proud. You've made the country proud.\" President Barack Obama gets emotional as he takes a moment to acknowledge his wife, First Lady Michelle Obama. @webpagelink"},{"comment_id":"10153509190373132","commenter_b":"Let her die with respect!!!","commenter_a":"I'm all for it I had to watch my husband die stage four brain Cancer that spread to all organs and bones to see him in so much pain and high doses of morphine to watch what he went through and reading about Brittany I say go for it the right to die with dignity God bless my heart goes out to you and all of you that are going through hell","post_message":"\"I can't wait. My daughter can't wait. I owe this to myself, and I owe this to my daughter. She's either going to come home and she's going to have to discover my body, or she's going to have to watch me die painfully.\""},{"comment_id":"1016517215129884","commenter_b":"@username why is she disgusting? It was a slap in the face. Hillary is supporting criminals.","commenter_a":"Yeah kind of a huge slap in the face! I like what sheriff David Clark said...it's a convention for the compassion of criminals...DISGUSTING!","post_message":"\"To have [Michael Brown's mother] come speak... is a travesty. It is a slap in the face of law enforcement.\"  Moments ago on \"The Kelly File,\" Kevin Jackson slammed the Democratic Party for featuring Michael Brown's mother at the convention. @webpagelink"},{"comment_id":"10154308673266178","commenter_b":"They have NO rights if they are in this country illegally.","commenter_a":"If you want to protest, you have every right. When protesting and you decide to escalate your actions by using violence, you are not only breaking the law but also trying to infringe on other people's freedom of speech.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is \"too old.\""},{"comment_id":"10150689045559999","commenter_b":"Ha, the wife and dog get all the ink.","commenter_a":"@username who's in the photo?","post_message":"Amazon.com is doing 2 predictably unpredictable things this week."},{"comment_id":"10152861396861051","commenter_b":"Shut up","commenter_a":"Sick. Stay with your own race.","post_message":"A police officer came in, handcuffed this teen and dragged him out of school. When they got outside, the teen realized what was happening."}]
