[{"comment_id":"10153447585542293","commenter_b":"No, it is true. That's why I've been buying men's razors for years. The women's version of the same razor is always more expensive.","commenter_a":"I don't think this is true. We have options now. I buy a lot of products at the dollar store and later find them in retail for $3-4.00. It's always about comparison shopping.","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10154793818836337","commenter_b":"Holy shit you're dumb","commenter_a":"Fake deal. She has run her course and they don't want her anymore. She has been all downhill since she cut her hair. She belongs back playing support for O'Reilly on his show. Demanding a raise? No. On the verge of being fired, but trying to save face.","post_message":"Should she stay or should she go??"},{"comment_id":"1829950227225236","commenter_b":"William, true but there were two shots to the head though.","commenter_a":"These are the kind of people that \"commit suicide\" with two gun shots to the back of the head.","post_message":"He joins a host of whistleblowers who have been saying this for YEARS!!"},{"comment_id":"1258505287549557","commenter_b":"Nah yo Grandma shouldn't have been hoeing around on Christmas eve. Her old ass shoulda been inside","commenter_a":"Damn WsHH with the sad ass news but was santa cryin like that when his reindeer ran Grandma over","post_message":"This is heartbreaking. #WSHH "},{"comment_id":"10153936558477144","commenter_b":"Oh for f* sake leave your vagina at the door please and REALLY look at her record.","commenter_a":"Clinton is a rich aristocrat white woman, check your privilege please, the only thing that she has in common with other women is a vagina. She was first lady, rising to power off her husband's victories she was lifted up to senator and paid well to do nothing, she then ran for President and lost to another man who then lifted her up to SoS, when she ran that office to the ground she left only to win by the efforts of the media and DNC who have a vested interest in seeing her high office. In doing so ruined the chances of America to regain control of our democracy.","post_message":"“That is how good you have to be if you’re a woman running for president. And she still might lose! To this, the least qualified candidate ever to lurch into the public spotlight and shit on Gold Star moms, while cradling Putin’s sweaty sack.\"- Samantha Bee"},{"comment_id":"10153284422191323","commenter_b":"White people are often unaware of their privilege as it is invisible a lot of the time. Happened to me when I got pulled over by a cop for cutting in front of them. I got an angry warning. If I were black, there's a better chance I would have gotten a ticket. I'm not 100% white, but eh, close enough in terms of looks to get the benefits of privilege most of the time. Except at hoity toity Connecticut country clubs.","commenter_a":"Do you understand now white folks?? Its not about you as a person but the system that programs these prejudice biases into you without you knowing consciously.... So when we speak out about institutional racism and bias...its not a direct knock against you as ppl but the fabric your ancestors created and is still maintained today.....","post_message":"Racism is a business. Its marketing is so successful that even Akala looks sideways at a young black man holding a lot of cash"},{"comment_id":"689620071188876","commenter_b":"Then they should Cancel the game until they show some respect for the USA","commenter_a":"I'm done with the NFL!","post_message":"This whole NFL squad will join Kaepernick in protesting the National Anthem on Sunday."}]
