[{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"1659099987677347","commenter_b":"Silence is a virtue girl, use it.","commenter_a":"why does everything have to be about color. if you dont care about a race then go live somewhere they are not. problem solved. but it sounds to me like you need to get ssaved.","post_message":"She said that “people of color” are always asked to give out awards or entertain, but are “rarely recognized for our artistic accomplishments.”"},{"comment_id":"911760225550393","commenter_b":"and she's just ugly","commenter_a":"Gabbie Dib","post_message":"One Direction's Zayn Malik  spotted holding hands with girl who’s NOT Perrie   (Via Daily Mail Celebrity)"},{"comment_id":"1221148801300111","commenter_b":"Such a demented mind-set. Let us all pray that the Lord will convict her and turn her from her wicked ways.","commenter_a":"Evil","post_message":"“Christian” Abortion Doc Says: “I Love” Killing Babies in Abortions, “I’m Proud to Do So”"}]
