[{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"\"We're not taking anyone, and we're not taking anything, for granted.\""},{"comment_id":"10154425895814087","commenter_b":"Let's all pretend Byrd didn't flip on racial issues. Let's pretend he didn't become a staunch advocate for civil rights. Byrd was honored by the NAACP. Your meme is fucking stupid.","commenter_a":"NEWS FLASH !!!! The only people happy with Trump are the ones that hide under sheets and dunce caps, while molesting children and raping disabled people, while burning crosses and churches! ! THIS IS BULLSHIT! !! LOCK TRAITOR TRUMP UP FOR TREASON! !!","post_message":"A spokesman for music producer Quincy Jones -- a Hillary Clinton supporter -- says he will not be attending Trump’s New Year’s Eve party and doesn't know why the Trump team said he would."},{"comment_id":"1121385761232992","commenter_b":"WHY MEN WALK AWAY FROM SOOOO MANY WOMEN .","commenter_a":"So guess they'll be getting rid of the \"women in literature\" as well...?","post_message":"You can't make this stuff up anymore, folks.  Radical feminists just got their way on campus and you can now say good-bye to THIS essential college class. [Read below]"},{"comment_id":"879266582115130","commenter_b":"The Zionists regime knows only the language of the gun.","commenter_a":"What can they have to talk about ? I am a pacifist , but in this case i would urge Iran to start building nuclear weapons, or get someone to supply them immediately , then maybe the Zionists will finally show them some respect.","post_message":"The foreign ministers of Iran and the United states kick off a fresh round of talks in the Swiss city of Montreux."},{"comment_id":"10153095720526051","commenter_b":"You poor sick woman, you must have never gone to school ever.","commenter_a":"Not saying what he did by any means was right.... But blacks are openly threatening to kill us everyday... The Black panthers said they were going to bomb white nurseries and how they need to rape and kill all white women and children. All this can be looked up. There are numerous hate crimes committed by blacks against whites everyday yet finally a white boy snaps and it's everywhere on fb and everyone wants him publicly hung. Obama is now pushing his gun control bs again over this but why doesn't he do that over the thousands of shootings everyday pointed towards the black on black crimes? Open your eyes people... I think you're all missing the much larger picture here.....","post_message":"Dylann Roof just confessed to the #CharlestonShooting. He says he had just one goal in mind when he opened fire."},{"comment_id":"10153817855231955","commenter_b":"@username Dude your girl looks like a dude!","commenter_a":"That's okay. Iowa hasn't picked a winner in 16 years, looks like they are keeping up the tradition. Keep thumping your bibles you inbred corn growing losers.","post_message":"CRUZ WINS IOWA"},{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."}]
