[{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"10155057898721729","commenter_b":"You can't make this crazy stuff up","commenter_a":"So they want equality. They get it but its not the equality they wanted because gasp! The police officers do their jobs. So the black police officers are not REALLY black because they are doing the jobs that the black population wanted them to do (and represent the black community) but didnt expect them to do the job as it is supposed to be done. Eeek! My head is spinning.","post_message":"How's this for a racist stereotype?"},{"comment_id":"1154513944599658","commenter_b":"Open primaries work just fine Terrence.","commenter_a":"Yea- Bernie baby! This was a closed primary and they are near a tie!!!!! Can you imagine if they \"allowed\" everyone to vote?!!!!! #therevolutionishere","post_message":"UPDATE: Sanders wins the Oregon primary, while Clinton appears likely to eke out a narrow win in Kentucky. Sanders' cut into Clinton's 270+ pledged-delegate lead likely will be single-digits."},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."}]
