[{"comment_id":"981060928642821","commenter_b":"are these women important? I never heard of any of them.","commenter_a":"Disappointed","post_message":"Television producer and writer Shonda Rhimes joined forces with the leading actresses from her various ABC shows in a campaign ad for Hillary Clinton..."},{"comment_id":"1316090455150672","commenter_b":"Swamp monsters","commenter_a":"tells you a lot about this so called president","post_message":"Truly deplorable.  Thanks to 1533 Days."},{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"\"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.\""},{"comment_id":"1823139327950230","commenter_b":"As long as these people want to be citizens. No illegals allowed. Why are we babysitting other countries people?","commenter_a":"IMPEACH TRUMP Call and write your representative @webpagelink/ talking points 1 wants to lift sanctions on Russia so Tillerson and Exxon can drill big conflict of interest maybe even treason 2 where are his tax returns 2 unconstitutional act re immigration, the 3 Muslim countries NOT banned are those where he has business dealings conflict of interest 4 every president has had a White House medical exam, not Trump is he mentally ill 5 we can't wait for Painter and Eisen (Bush and Clinton ethics lawyers) law suit for disclosure Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist you by matching your ZIP code to your congressional district, with links to your member's website and contact page. HOUSE.GOV Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist ...","post_message":"Americans are making it clear: Trump's unconstitutional Muslim ban isn't going to fly.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"\"I FELT AWFUL\": All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to \"stop speaking Spanish\" and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"10154780411199228","commenter_b":"She's Caucasian that's why...duhhh","commenter_a":"She is pretty enough she probably could have had any man she wanted. What on earth would posess her to choose a boy? Pretty sickening!","post_message":"The parents were allegedly \"accepting of their relationship,\" even inviting her to family gatherings."}]
