[{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"},{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"1805566076381553","commenter_b":"Leave it alone!!!!","commenter_a":"I vote no!!","post_message":"They are going to change Ole' Glory to this! Leave our flag alone. Do you think the American flag should not be altered?"},{"comment_id":"1222107054548141","commenter_b":"Fucking weird bitch","commenter_a":"@username @username wdf","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."}]
