[{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"}]
