[{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"\"Let's support mothers to breastfeed anytime, anywhere.\""},{"comment_id":"10159170889790206","commenter_b":"Oh he will make it 8. So grow up big sissy babies.","commenter_a":"Good. He's embarrassing enough here. We don't need him going abroad and doing his clown act live for the rest of the world.","post_message":"JUST IN:"},{"comment_id":"1385280774831907","commenter_b":"#NEVERTRUMP #NEVERHILLARY #NEVERBERNIE @webpagelink","commenter_a":"Have stop watch Faux News! #nevertrump","post_message":"\"In Hillary's America we focus on Hillary, but we also focus on the whole sordid history of the Democratic Party. We're telling an unknown story, and it's going to rile up this race.\""},{"comment_id":"10153369236751051","commenter_b":"Bitch got what she deserved..","commenter_a":"I am happy for the boy to let his real self show that bully get what she needed..","post_message":"This boy tried to stay calm in the face of relentless bullying from a girl on his bus. Finally, he just couldn't take it anymore."},{"comment_id":"10156213230310725","commenter_b":"Yes but most came here legally not sneaking across a boarder and none of us got free food free housing free health care or free college. You think all that is fair for us to pay the bills of someone illegally sneaking across our boarder or overstaying there visa. How many Americans have been murdered or robbed or raped by them? Far to many!","commenter_a":"Everyone are immigrants to US America .... Okay!!!!!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"1849294941953444","commenter_b":"Illegals don't pay taxes, they may pay sales taxes, but one needs a social security card or a legal visa to get a legal job in America. Illegals are not immigrants, immigrants are people that came to the United States legally. American taxpayers should not have to pay for illegal activity, or anyone that came here illegally. I believe that all illegals need to go back to where they came from and return legally. If a child was born here from an illegal alien they need to go home with their parents, come back legally, they were born here illegally does not make them an American. All illegals should be thanking us for allowing them to stay for long, time for them to take what they have learned here in America and help the people in their homeland/country. Wait your turn like legal immigrants! No Mayor, NO state official, or ...","commenter_a":"Good for you NEW YORK!!","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10153802961004411","commenter_b":"@username And your women","commenter_a":"Mean while Modi is busy in saving cows.","post_message":"BREAKING:"}]
