[{"comment_id":"1168574929824833","commenter_b":"She's extremely wealthy, money buys votes!","commenter_a":"Wait...Hillary is still leading in overall polls? Americans in general really are stupid.","post_message":"I don't care whatever else you think of Donald Trump, but one thing Trump is doing is killing political correctness.  He's wiping it out.  He's leaving political correctness in a trail of dust.  He has violated tenets of political correctness from day one, and he is leading in the Republican polls and has pulled within six points of Hillary in a general."},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"941193142664131","commenter_b":"Hope it blind the liberal bitch! LOL","commenter_a":"Get more of them","post_message":"Mace to the face = ouch. Did she deserve it? Did the old man deserve getting punched by her? And for a bonus for being nice I've added a video of a high protester doing a backflip and landing on his head. #theplacewecallthezoo @webpagelink"},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"10153303444396051","commenter_b":"JFK worked for no salary.","commenter_a":"Wonderful! No salary or expensive vacations. That should lower the debt that Obama has racked up.","post_message":"Donald Trump plans on working for free if he's elected president. Do you like the move?"}]
