[{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"\"...may be the worst thing ever to have happened in the history of cinema.\""},{"comment_id":"10158110429230206","commenter_b":"We should get rid of both of them . Say no to Armageddon .","commenter_a":"Donald Trump went from selling luxury condominiums to selling empty dreams .","post_message":"“If somebody wants to go out and say that they voted for this person or that person, they can do it. But that ballot is sacred.”"},{"comment_id":"1055522267818446","commenter_b":"We're sick of Reruns. Turn the channel. Clintons are history. Make them go away.","commenter_a":"Close, but no cigar","post_message":"“Donald Trump has called your dad an abuser of women, and your mom his enabler. What do you think of his attacks on your parents?”"},{"comment_id":"1728684567380415","commenter_b":"#NotMeUs hillary just want your vote so she can work hard for the rich people!","commenter_a":"Please exit out of video , share the post by clicking SHARE button on bottom right. Come back and join us❤️","post_message":"Bernie Sanders rally in Pittsburgh: Part I"},{"comment_id":"437504329786414","commenter_b":"pinocchio wants guns taken from the citizens so we won't be able to defend ourselves against his \"refugee military\".","commenter_a":"Maybe that's why Obama wants stricter gun laws, after all isn't he always on the side of the criminals?","post_message":"Gun Bans are Ridiculous www.eaglerising.com"}]
