[{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"1009683892433898","commenter_b":"ILLEGAL ALIENS should be deported not given drivers licenses and free housing and medical care.","commenter_a":"Why don't you add the rest of the story. Not only did 50% of all California driver's licenses go to illegal aliens, but they have motor voter laws so those illegals are now eligible to vote even though they are not citizens. Non-citizen should NEVER be allowed to vote and neither should welfare recipients who have been on welfare for more than two years. They should not be allowed to vote on how the money from tax payers is spent when they are not paying taxes themselves.","post_message":"Did you know HALF of all California driver’s licenses issued in 2015 went to illegal aliens?"},{"comment_id":"10156378664500725","commenter_b":"I have an idea. JDLTI. Just don't let them in. When you become President close all immigration for up to five years. We can take care of the terrorists in the Middle East while weeding them out here in the U.S.","commenter_a":"E","post_message":"I keep saying it. When the President of the United States of America, Barack Obama -  will not issue the words RADICAL ISLAMIC TERRORISM - the problem will NOT BE SOLVED!"},{"comment_id":"887553468004375","commenter_b":"What a pig","commenter_a":"The entire \"occupy\" movement is a collection of unemployed, pot smoking, attention strumpets who receive gov. assistance and don't want to lose their free ride.. Morons!","post_message":"Pass it on.  Image by Occupy Democrats."},{"comment_id":"10153738132321756","commenter_b":"Awesome. catch 'em.","commenter_a":"Loved this story today! Thank you @username! Very interesting and I can't wait to watch the documentary.","post_message":"To track the route of poached tusks, investigative journalist Bryan Christy commissioned a taxidermist to create fake ivory tusks, which he embedded with specially designed tracking devices."},{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The \"conservatives\" who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"1037202013040797","commenter_b":"@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."}]
