[{"comment_id":"1664084467202646","commenter_b":"Then I would campaign for congressional term limits Allow the country to decide if abortion is to be legal or not. The same with gay marriages. The supreme court should not be involved in these maters. If the is challenged and reversed. So be it. I would not allow mass illegal immigration. Illegal is wrong by definition. As to radical Muslims. Not welcomed. Peaceful Muslims who migrate legally are welcomed as long as they assimilate . And do not try to impose sharia law. This country has its laws made by its citizens. If you come here. You need to assimulate. I would ask for voter IDs. Driver license are not proof citizenship. Sorry.","commenter_a":"I would dump Obama care and replace it with something that makes sense. Eliminate the following depts. Education, environment and agriculture. TSA homeland security plus the irs. Treasury dept can handle collecting a flat tax. Eliminate the federal minimum wage. No need for the federal govt to be involved in these areas. Then I would walk away from the Iran nuke deal and global warming. Bad policies. Then I would invite the Mexican president to the white house and bitch slap him. Cut the budget across the board by 10% for each of the 1st 4 years Have a flat federal tax of 17.5 on everyone. Period. No deductions. Nothing. Flat. Period. I would then review all of BHS executive orders and reverse or modify what I decide what is needed.","post_message":"If you were president what is the first problem you would address?"},{"comment_id":"10156463430895354","commenter_b":"Look another bitch working for Obama","commenter_a":"What about anti american hate speech from scuzzy muslims ? Real americans dont like having to suck up to people who want to kill real americans !A plot by our government to change America into a third world craphole !","post_message":"Obama prepares the muzzle to silence Americans who are FED UP with his coddling of terrorists."},{"comment_id":"1046596102028067","commenter_b":"I hope you'll be the pregnant one cause you're a bitch >:(","commenter_a":"Lol wut @username","post_message":"No women required."},{"comment_id":"492872274234399","commenter_b":"Yes , but if an illegal begets an illegal. Guess what it's still an illegal in titled to nothing.","commenter_a":"Just because an illegal baby is born on uur soil does not make them a US CITIZEN. ........","post_message":"Breaking...WAY TO GO TEXAS!"},{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"10153220731196234","commenter_b":"She should be fired and thrown in jail","commenter_a":"Should have had her license taken away!","post_message":"The nurse who re-used syringes for the flu vaccine at a West Windsor company has agreed to a temporary suspension of her license."}]
