[{"comment_id":"1275887962432212","commenter_b":"So people can get to sleep !!","commenter_a":"Seth","post_message":""},{"comment_id":"10153895109342994","commenter_b":"Let Canada take in all the refugees - America doesn't want or need them.","commenter_a":"That's Canada! Friendly and welcoming people :) Wish the rest of the world was like that..","post_message":"A church in Canada is making a statement in the holiday season that's brewing controversy - and they're going beyond the church sign."},{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"\"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.\""},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"},{"comment_id":"10153022135468635","commenter_b":"The Jesus I know of hung around with prostitutes, drunks and gamblers. I imagine he certainly wouldn't have used social media to put down homosexuals because he would have been too busy loving them.","commenter_a":"The strong homosexual, transgender movement today is not surprising. It is a sign of how there will be a new world order. It is disturbing but it also points closer to our seeing Lord Jesus.","post_message":"\"Vines argues that while the Levitical code forbids homosexuality (Leviticus 18:22) it also forbids eating shellfish (Leviticus 11:9-12). Yet, he says, Christians no longer regard eating shellfish as wrong — so why can't we change our minds on homosexuality? Here Vines is rejecting the New Testament understanding that the ceremonial laws of Moses around the sacrificial system and ritual purity were fulfilled in Christ and no longer binding, but that the moral law of the Old Testament is still in force.\""},{"comment_id":"10153716841688132","commenter_b":"Sorry but he's not BLACK!!","commenter_a":"Ok President Obamas mother was white.His Grandparents were white.How can white people who say he does not care about white people Really ! You r all pissed because our President is Black?thats the issue with ignorant people who continue to blame our President.Im sure George Bush would not have done anything","post_message":"Barack Obama won't be intervening in Kelly Rutherford's international custody battle."}]
