[{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"10156224999290551","commenter_b":"Go back to your own shithole country.","commenter_a":"Let's wrap them up in bacon and send em back to where they come from😎","post_message":"Trump was right - Muslims did celebrate 9/11."},{"comment_id":"10152782566181051","commenter_b":"I hope the next time Kanye storms the stage whoever is up there just decks him. What a POS!!!","commenter_a":"I thought west was leaving the USA. What happened? We'll help pack you up and get you out of here!","post_message":"Beck just issued a response to Kanye West’s rant about him not deserving a Grammy."},{"comment_id":"10153903712141051","commenter_b":"Your a bitch !!'","commenter_a":"Black lives matter??????? Nop!","post_message":"You read that right: this man raped not only his 82-year-old grandmother but also his uncle. She had just one question for him."},{"comment_id":"10153122769748145","commenter_b":"Vote the hurricanes out!","commenter_a":"Already started ;)","post_message":"Today is the start of the 2015 Hurricane Season! Are you prepared if a big storm hits Central Florida? #WFTV Check out these must-have supplies: @webpagelink"},{"comment_id":"10153446072426545","commenter_b":"Why would that CRAP sell out? It looks like a hooker dress. Either that or she LOST the other half.","commenter_a":"I want to hear more about why the SWAT team was deployed in W FTW.","post_message":"The sisters, who have previously collaborated on clothing lines with PacSun and Topshop, celebrated the launch of their \"first-ever ready-to-wear collection.\""}]
