[{"comment_id":"1061679133872558","commenter_b":" The US has the highest gun ownership rate in the world - an average of 88 per 100 people. That puts it first in the world for gun ownership - and even the number two country, Yemen, has significantly fewer - 54.8 per 100 people But the US does not have the worst firearm murder rate - that prize belongs to Honduras, El Salvador and Jamaica. In fact, the US is number 28, with a rate of 2.97 per 100,000 people Puerto Rico tops the world's table for firearms murders as a percentage of all homicides - 94.8%. It's followed by Sierra Leone in Africa and Saint Kitts and Nevis in the Caribbean","commenter_a":"Stephen king stick to writing shitty movies. You have no clue. How else can you explain to morons that criminals and crazies don't care about gun restrictions. Guns help protect... There are numerous countries that have worse records for mass shootings than us, that have more gun laws than we ever have had.","post_message":"Stephen King, like most reasonable people, is fed up. His message to fellow gun owners is AWESOME!"},{"comment_id":"10155234645559199","commenter_b":"Kerri Andreson","commenter_a":"Janie Marsh","post_message":"A man in his 30s drowned at the Wild Waves theme park in Federal Way."},{"comment_id":"10153076176308188","commenter_b":"Should have called Tiffany. Nothing like a woman to get the boys back on task.","commenter_a":"Did you save the fly or just let it suffer...","post_message":"So a fly landed in my breakfast juice.    Jeffy became fascinated with it struggling to live.  Next thing I know Keith is taking a picture of jeffy taking a picture of the fly and stu on skype with Wilson about the fly.  I had to join in and take a pic of the three of them taking a pic of the three of them with the fly.   Lord please help us.   Sometimes we are small and easily distracted and other times we are positively 12 year old boys."},{"comment_id":"10154319611824586","commenter_b":"Horrifying! All for money!! Humans are barbaric! Vegan for animals!","commenter_a":"People are killing crops:@webpagelink #PlansLivesMatter #DontGoVegan #JKGoVegan","post_message":"BREAKING: Those hermit crabs you see at beach shops & pet stores may come from this horrifying supplier.  Warning: The way workers crack crabs shells is really hard to watch :("},{"comment_id":"1598931086790902","commenter_b":"The horrid hag hisses!","commenter_a":"The Blonde Deatheater attempted to weasel out of every single question. She couldn't even keep her lies straight (lies she was telling at the moment).","post_message":""},{"comment_id":"1750223515225265","commenter_b":"The other video was funnier and because you didn't get as many likes as her shes a dumb bitch. That's what made this video suck","commenter_a":"She had fun so you call her a dumb bitch. This kinda attitude is what gives pro 2a a bad rap. That and the stupid shit the NRA says.","post_message":"Remember that dumb bitch who went viral for laughing at herself?  @drewhopkins has outdone her.  Shop.TacticalShit.com"},{"comment_id":"10153318281418984","commenter_b":"Racist and Illegal!","commenter_a":"Not very inclusive.","post_message":"Imagine a \"whites only\" field trip. Al Sharpton would be licking his chops and hopping on the first plane to Indiana.  Do you think what this school did is wrong?"}]
