[{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"},{"comment_id":"956895434364622","commenter_b":"Thats what she talks out of.","commenter_a":"Thats yet to be proved!","post_message":"Apparently race and gender are the only qualifications necessary to become President if you're a Democrat..."},{"comment_id":"10154982308074641","commenter_b":"The Russians did it!!!! #CNN the Russians did it","commenter_a":"Is global warming to blame?","post_message":"Avalanches have killed more than 100 people after days of heavy snowfall along the Afghan-Pakistani border @webpagelink"},{"comment_id":"10154389152146955","commenter_b":"It's just what she does","commenter_a":"Its not like she left 4 people to die in Benghazi, Blamed a terrorist attack on youtube video, deleted 33,000 emails and Lied to congress,, accepted money from terrorist countries, or called millions of Americans Deplorable, this was just a small Lie about her health. At this point, What Difference does it make.","post_message":"FLASHBACK: SCARY COUGHING FIT AT BENGHAZI HEARING..."},{"comment_id":"10153869230258352","commenter_b":"Wtf? The sorry bitch nees LIFE!","commenter_a":"i think life without parole is better","post_message":"Mom who gave her baby methadone ‘to help her sleep’ and killed her will serve up to 30 years in prison"},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."}]
