[{"comment_id":"10155087953524726","commenter_b":"wow. nice job ben, and that female twit is the typical young female know it all, what a fucking idiot, they actually think they have it all figured out.","commenter_a":"Ben Shapiro.... man, you're good.","post_message":"This is a must-watch."},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":""},{"comment_id":"1109305832420099","commenter_b":"It's time for a female to make some real changes...","commenter_a":"Hes no match for #Hillary","post_message":""},{"comment_id":"10153515139311680","commenter_b":"Hillary already knows she's becoming the POTUS. There's nothing stopping her. We will have a female president! Can't wait. #ImWithHer","commenter_a":"It's just riding off of the success of Bill because nobody likes her","post_message":"Hillary Clinton: \"I’ve told my husband he’s got to come out of retirement and be in charge of this, because you know, he’s got more ideas a minute than anybody I know.\""},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."},{"comment_id":"1214061615292067","commenter_b":"@username Just WHAT is racist about wanting to put up a wall to help keep illegals out of our country? What is racists about wanting to deport those illegals who are here? Since when did ILLEGAL become a race?","commenter_a":"I got my country back and I'm not giving it up to some drunk retarded ignorant fool like Palin","post_message":"Sarah Palin says it's time for everyday citizens to take our government back. Do you feel the same way?"},{"comment_id":"10153188303164087","commenter_b":"Put this bitch in jail.","commenter_a":"Looks like she gets the \"CHAIR\" same as Ethyl Rosenberg!","post_message":"Hillary Clinton’s personal email server hosted two “top secret” emails, a new report reveals."}]
