[{"comment_id":"10152578962070736","commenter_b":"Women don't have penises.","commenter_a":"If this woman was so uncomfortable being in a locker room with a transgendered person, would she be just as uncomfortable being in the locker room with another female? Because that is essentially what she is complaining about.","post_message":"LGBT activists have applauded the gym's decision, saying the 'no judgment zone' promotes privacy and safety."},{"comment_id":"1743528099240171","commenter_b":"Why did he choose to only visit those living in North Baton Rouge?","commenter_a":"Our great president. A day late and a dollar short","post_message":"We're in Baton Rouge where President Obama is landing to tour the flood-ravaged city after facing criticism for not visiting sooner. (No audio) @webpagelink"},{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."},{"comment_id":"10154345069201491","commenter_b":"The wall will be so \"huge and bigly\" the missiles won't even be able to fly over it!","commenter_a":"Trump doesn't like war!! He likes building a huge wall.. Don't worry guys, he is going to isolate North Korea with his wall, perhaps the nuke can't go through it..","post_message":"North Korea's weapons-grade stockpile has soared dramatically, says South Korea."},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."},{"comment_id":"10155994453335389","commenter_b":"Lady don't hurt me! @webpagelink","commenter_a":"If Trump can't handle a Fox debate against other GOP'ers, how's he going to handle debates in the general election? He may have some good ideas, but he's a sideshow. Always tooting his own horn or would that be a \"Trump\"et?","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"}]
