[{"comment_id":"1202995606404444","commenter_b":"Made all her money from being sexy. Buuuuuwahaaaaaahaaa","commenter_a":"Funny how a party girl talks about porn","post_message":"COMMENTARY from Matt Walsh:  “I don’t have my Bible in front of me, but I’m pretty sure Pamela Anderson being accused of puritanism is a harbinger of the End Times.”"},{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"},{"comment_id":"10153511898009087","commenter_b":"Look at the lies thay have in office today everyone of them for nothing but money .and there's nothing wrong with what trump personally done. .there trash on everyone .","commenter_a":"You will not turn a single vote away from trump support ers .you will only make more people for trump .","post_message":"\"I stand by every question I asked [Donald Trump] and he was not the only one who had tough questions,” Megyn Kelly said. “He was the only one, however, who complained.” WATCH:"},{"comment_id":"1015237518591880","commenter_b":"When I look at her boobs she spins all the way around. Her face goes halfway then comes back","commenter_a":"Prefer not to care","post_message":"Is she spinning right or left?"},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous \"paper or plastic\" question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"10153220185391336","commenter_b":"I bet you that pussy Obama couldn't ride a bike","commenter_a":"How racist of him to ride a bike it's all his fault","post_message":"Former President George W. Bush hosted his fifth annual Warrior 100K bike ride in Crawford, Texas. This year's theme was healing the invisible wounds of war. @webpagelink"}]
