[{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"1187241994648589","commenter_b":"Clinton is dangerous to kids and adults! Lots of her associates end up dead. And she is still married to a pervert! I'm voting for Trump!","commenter_a":"Hillary could care less.","post_message":"CLINTON claims TRUMP PRESIDENCY puts KIDS in DANGER  @webpagelink"},{"comment_id":"10153395223571336","commenter_b":"Pull up your skirt and grow a pair .","commenter_a":"I'm not Mexican but his comments were offensive. There are many honorable Mexican Americans and his words disrespected all Latin Americans. I happen to be a conservative republican, and in favor of tightening up the border issue. Donald Trump is an emotional and impulsive idiot and we don't need that in the White House. We need someone that will unite us, not separate us.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"619138891610023","commenter_b":"that alright. She can just leave the white","commenter_a":"Just shut up","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with.  Nobody cares. What a joke.  Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"604709916395876","commenter_b":"Is it all the bleach that makes Trump women stupid? They should do a study...","commenter_a":"This speech is ridiculous he's supposed to be a leader he's dividing people thinking he has power I'm embarrassed to say he thinks he represents all of us","post_message":"\"We are going to be the first state in the country to fight back on Washington.\" Boston Mayor Marty Walsh gave impassioned remarks at the rally ahead of the Boston Women's March for America.  @webpagelink"}]
