[{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"},{"comment_id":"10153114597787507","commenter_b":"I thought women were the snakes","commenter_a":"An old lady told me about 30 years ago: Some men would screw a snake if someone would hold the head. So there you go!","post_message":"Go get em!"},{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."},{"comment_id":"732442150279696","commenter_b":"close our borders and weed out this cancer trash","commenter_a":"Get registered to vote the right way. Offer your Sr. Neighbors etc a ride to vote. Get things changed in this country!","post_message":"BREAKING: Muslim Civil War Erupts In Ohio After Patriot Rips Apart A Quran [VIDEO] Watch what happens in the crowd right after he started doing this. Do you think we should close our borders?"},{"comment_id":"621932114627042","commenter_b":"NO MORE POLITICIANS. OR WORSE, A POLITICIAN/LAWYER #TRUMP2016","commenter_a":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. DETAILS: @webpagelink","post_message":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. ---------------------------------------------- The Donald is coming to Pittsburgh."},{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"1050187868329829","commenter_b":"Die already you old prick !","commenter_a":"lol I see the libturd heads exploding in here! Deport them all!","post_message":"On the Texas immigration ruling: President Obama is well within his established Constitutional authority and the legal process will bear that out. The only effect of this ruling is to delay justice for thousands of families in Nevada and across the country. Governors, mayors and law enforcement officers have emphasized that these programs are good public policy, help our economy and keep our communities safe.  Courts are only involved in the first place because Republicans have spent years blocking Congress from fixing our broken immigration system. Congress should live up to its responsibility and pass an immigration bill that secures our borders, keeps families together and provides an earned path to citizenship.  There is nothing stopping the Senate from debating immigration legislation immediately. Unfortunately, the Senate is mired in a completely avoidable impasse over funding the Department of Homeland Security. Senate Democrats have a simple solution for getting out of this jam: take up and pass a clean bill to fund Homeland Security, then move on to a robust debate on immigration legislation.  Democrats’ offer to first fund Homeland Security and then debate immigration stands. All Republicans have to do is say yes."}]
