[{"comment_id":"10154584590253812","commenter_b":"HILLARY TO WELCOME 1 MILLION MUSLIMS IN 1ST TERM Clinton's plan to expand refugee resettlement could cost U.S. taxpayers over $400 billion","commenter_a":"So we are being lead into war against each other and to blind to see the obvious of what is happening. When we need to be standing together fighting against these foreign countries and what we have been fighting for way before our time. Instead of allowing the color of your skin be an issue and using it towards one another. If you have so much hate use the energy towards standing up together fighting together working together and being there for one another to stand strong and conquer these hard times. We are giving in to everything we have fought to protect and save. Stop fighting against one another and fight for one another. Stop allowing this society to break us and the government to control us. Stop giving the enemy what they want and give them what they deserve. Stop being that slave to the government and allowing ...","post_message":"President Obama in comments on Nice attack: “These terrorists are targeting and killing innocent people, including Muslims.\" @webpagelink"},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"1070322423019079","commenter_b":"She will drag him down.","commenter_a":"I really thought she'd go Cruz. Kinda disappointed. BUT, if Trump or Cruz is the nominee, I can vote for either without holding my nose.","post_message":""},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"1235851089812062","commenter_b":"You're as ghetto as this chick","commenter_a":"I had my daughter at 16. I hid my pregnancy til the day i had her. My family just thought I was getting real heavy. Yes it was scary I was way too young and I knew my life would change. I had to grow up and do things most 16 yr olds don't have to. But i loved my daughter and can't imagine a life without her. I will never understand this! At 16 you know better!!! Give that child to a hospital, family someone!","post_message":"A infant girl died after being thrown from a second-floor window, allegedly by her 16-year-old mother after the teen gave birth. The child's grandmother was administering CPR when paramedics arrived."},{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"}]
