[{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"},{"comment_id":"1003361709753187","commenter_b":"Coming from someone who puts stupid cartoons of her self on Facebook! Lol. Maybe Leslie could get a brain in the next one and give up on Hillary!","commenter_a":"When trump gets elected maybe this bug eyed freak will leave and take his high girlish voice with him","post_message":"*Shivers*"},{"comment_id":"1391871914162547","commenter_b":"U r an Angela,go take every Muslims come back ur home","commenter_a":"You guys are all so worried about making jokes about Obama. How about we worry about the children who lost their lives and the parents that have to adjust to a life without their babies? My goodness!!!","post_message":"Witness describes seeing the gunman at Munich, Germany, McDonald's, killing children. @webpagelink"},{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"},{"comment_id":"506998642821762","commenter_b":"I'd say a feminist who pees themselves might be drunk.","commenter_a":"Well, that has to be uncomfortable. Only a mental moron would pee themselves. I'm telling you, libs are retarded.","post_message":"How stupid can some people be..."},{"comment_id":"10154189232436603","commenter_b":"Haaaaaaaaa am avut 12!!!!","commenter_a":"@username 11/18 sa vedem daca ma bati","post_message":"Quiz to be taken whilst listening to \"Smelly Cat.\""},{"comment_id":"537705639687363","commenter_b":"@username you are wrong ! All the other religions follow AMERICA Laws!! Only Muslims want to bring in their Sharia laws for their JUSTICE , and their law on us and they can't , because Our Constitution, And We As Real American Citizens Will not change our Laws of Justice, for their BARBARIC 7th century murderous, degrading practice!!! Ship you are a bleeding heart Liberal!! Trump is not trying to divide us , He is trying to save this Country from people like you, Hillary, Bernie and that kiss ass Muslim OBAMA!!","commenter_a":"American Muslims are American. Just like American Catholics. Just like American Jews. Just like American Methodists. Just like American Presbyterians. And all the other Americans of various religions. Stop trying to divide us. Trump wants to secure our borders. Why is that wrong? Trump wants to end ILLEGAL immigration. Why is that wrong? Trump wants to verify that legal immigrants are not here to harm our citizens or create havoc. Why is this wrong?","post_message":"This is what American Muslims think about our presidential candidates. You might not be too surprised by what they had to say."}]
