[{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."},{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just \"no means no\" and \"yes means yes.\""},{"comment_id":"10154307174989411","commenter_b":"the reasons for building a wall are based on racism. Migrants dont steal jobs, dont increase crime, and create more wealth for everyone given the correct conditions. only reason to appose migration is fear of differences.","commenter_a":"Think the candidates suck? vote libertarian. check out Gary Johnson. Some socialists might not get it at first but its really the political party that represents the most freedom. Are you for gay marriage? so are libertarians. Are you for smoking weed? so are libertarians. Are you against foreign wars of aggression? so are libertarians. are you against corporate collusion with the government? so are libertarians. Are you against too big to fail banks? so are libertarians. hold on republicans, theres stuff for you too. Are you for lower taxes? so are libertarians. Are you for property rights? so are libertarians. Are you for a business owners right to deny service to whomever he pleases? so are libertarians. are you for gun rights? so are libertaria","post_message":"#DropOutHillary: 300,000+ tweets"},{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"10152783930412293","commenter_b":"Tom terrorist deserve to be pooped on and have there have there heads cut off","commenter_a":"I could hv done the same thing..those animals hv no respect for life so u respect them in death?","post_message":"The story of a Marine sniper, dead at 28, and the 38-second video clip that became part of his legacy."}]
