[{"comment_id":"1134902403269479","commenter_b":"If they think it's so needed, why hasn't it been in place to stop rape before?","commenter_a":".","post_message":"Things just got seriously DANGEROUS for trans students in North Carolina..."},{"comment_id":"1110149189061308","commenter_b":"criminals do know each other and apparently marry their offspring to each other's families!","commenter_a":"Father a criminal politician, Ex., asked for Clinton's support in Mizzou 2 years ago, not to be, and there is some concern that Hillary supported with information received as Secratery of State, investments made by Mezvinskey the younger, including a deep water construction opportunity...............!","post_message":"Allen West Republic"},{"comment_id":"10156397990805354","commenter_b":"Maybe one testical...he is a RINO.","commenter_a":"At least he has balls to stand up to Obama","post_message":"Which do you want: a \"pause\" or an \"immediate halt\"?"},{"comment_id":"10153861060719411","commenter_b":"what i see is a dead pussy just blown up.","commenter_a":"terrorist*, not jihadist... jihad is a good thing","post_message":"Video shows Jihadi hit by mortar shell mid-interview"},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."},{"comment_id":"10154687828874657","commenter_b":"DEPORT this terrorist!","commenter_a":"Most universities are cesspools","post_message":"Amazing. ISIS recruiters are infiltrating our schools as teachers, now?"},{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."}]
