[{"comment_id":"10153964489889024","commenter_b":"FRICKING POS","commenter_a":"This is more truth than what comes out of his mouth","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1207325982676961","commenter_b":"Epic smackdown","commenter_a":"Loved it. She asked for it.","post_message":"WHOA!!!!! Gingrich went nuclear on the Kelly File and sends social media into a frenzy!"},{"comment_id":"10153875546363352","commenter_b":"Smh girl please...","commenter_a":"Let's see how much he's kicking out for a settlement","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."},{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."},{"comment_id":"10154538085533812","commenter_b":"\"You gotta take them out\"...... for dinner and a movie. Because Hillary, you see, she's a criminal. All my lawyer friends understand this. And we're gonna build that wall, believe it.","commenter_a":"He is such an idiot","post_message":"Donald J. Trump said that he would be open to using NATO forces to fight ISIS despite blasting the alliance in the past as \"obsolete.\""}]
