[{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"},{"comment_id":"10153218789208132","commenter_b":"What about women who cheat?","commenter_a":"If my husband cheated on me I'd do a lot more then throw a shoe at his face. This man should consider him lucky. Its SAS that people stick up for men when they cheat. And people wonder why women get upset in relationships.","post_message":"\"Wouldn't you be this upset if you came home to this?\" she said when asked if she had thrown the shoe."},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"10152900574094071","commenter_b":"I wonder if after building the wall, he will revoke all immigration permits to Scots and Germans and send his relatives back to Europe ... all expenses paid of course! ;)","commenter_a":"I believe that Jeb Bush will become the next president of the United States.","post_message":"Here are all the best moments from Donald J. Trump's presidential announcement."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"}]
