[{"comment_id":"1406386459390310","commenter_b":"OMG this woman is a liar and blowhard","commenter_a":"Does not matter who he picks. Cruz can not win. He will need voters in the general and he has very few of those.","post_message":"This is a big play."},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"455406524619303","commenter_b":"And guess what... that girl who got pinned to the ground.....yeah she has a pass to the pool.","commenter_a":"I love kicking people out from our community Pool. They are not allowed because of \"race\" but because they don't own a house in our \"Gated\" community and pay HOA fees.","post_message":"\"The officer never asked any questions. He jumped out of the car and immediately started running to the black kids.\""},{"comment_id":"10153139725131037","commenter_b":"Hillary won't be in office. Smfh never that","commenter_a":"This guy actually thinks he is a good president. LOL","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"1075446135834786","commenter_b":"She's a sell out!","commenter_a":"I don't know who she is. I've seen her before but in what I don't recall. But I really didn't get the joke or whatever it was supposed to be. ...","post_message":"What did you think of Stacey Dash's appearance at the #Oscars? @webpagelink"},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"1814101218857117","commenter_b":"When you walk into McDonalds they already had yo order ready , \"ay 3 big Macs to the front, this fatass just walked in here...\" built ass, you sitting down eating on a bean burrito & yo bitch walk in butt naked all you can do is *munch munch on food* \"uhh tf I'm supposed to do with that?\" Gay ass outta here","commenter_a":"What kinda fake ass pink sack of waste of human flesh trump supporting stds catching macaroni and cheese smellin diaper full of shit stain 'my dad a lawyer' \"Just bought 2 big nos tanks for my honda and added turbo that way when I drive it goes really fast like 300 mph\" lookin ass damnnn 'Daniel back at it again with the pink verses fruity man' head ass \"wanna hot dog on a stick?\" Head ass normie fuckboi made this meme?","post_message":"This man is a genius ahaha #WSHH"}]
