[{"comment_id":"1783677398519787","commenter_b":"@username TRUMP IS OUR NEXT PRESIDENT.GET OVER IT.","commenter_a":"I am really not a trump fan.. But if his election gets rid of half the asshats that say they will leave he's got my vote","post_message":"She's out."},{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can \"vote\" and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the \"Bobblection.\""},{"comment_id":"10158490372020354","commenter_b":"Hope they make an example out of her","commenter_a":"Jail her.","post_message":"My, my, my..."},{"comment_id":"10156388002150389","commenter_b":"Muslims are the problem!","commenter_a":"He was a Muslim. What else is there to know?","post_message":""},{"comment_id":"512912212228885","commenter_b":"Beyonce!!!!!!!! Gave them the green light.. They wAnt what you have but don't want to educate themselves or help themselves. LAZY","commenter_a":"I think that this man that served alongside of every single race in the world as a brother, was assaulted by black thugs representing their selves as Black Lives Matter. Now let's see if someone from BLM will stand up and condone this behavior, or embrace it. There is racism in every race, but the citizens that stand alongside each other and condone this, are the true brotherhood.","post_message":"*****BREAKING NEWS*****  They said these 6 words..."},{"comment_id":"539258706198723","commenter_b":"Fuck her","commenter_a":"She wrote the book on \"reckless\" and \"dangerous foreign policy\". Just ask Sean Smith's mother.","post_message":"Hillary Clinton took aim at Republican candidate Donald Trump's foreign policy calling it \"reckless\" and possibly \"dangerous.\" Do you agree or disagree?"},{"comment_id":"2029120557147682","commenter_b":"Thanks, Candice......I didn't know about Cooper.","commenter_a":"I feel badly for the cast of Moonlight! They missed out on having their movie called, and all the fan flair that accompanies an Oscar win! Shame in you PWH!","post_message":"Emma Stone: 'It was one of the most horrible moments of my life'"}]
