[{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""},{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? \"Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.\" Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"685160418299400","commenter_b":"He going to build a wall!!!!! What an asshole","commenter_a":"Oh, Jennifer....I LOVE your post....thank you....you just made my day....","post_message":"Oh this is precious."},{"comment_id":"10157525764140293","commenter_b":"These people need to back off, no one understands the loss of a child much less one that is missing and not knowing if the child is alive or dead...this is their way of dealing...let them alone..","commenter_a":"I can't imagine how you go on with the uncertainty of their situation. The banner isn't hurting anything. Empathy is what's needed here.","post_message":"FEEDBACK: The parents of a child that's been missing since 2011 just want her back, but their plea is apparently someone else's eyesore.  What do you think about the way this is being handled?"},{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"}]
