[{"comment_id":"10153002903836323","commenter_b":"Aaaw u want him to suck your lil prick?","commenter_a":"Fuckin Jew cock sucker","post_message":"Rupert Murdoch has been strongly criticised after tweeting that “most Muslims” – even if peaceful – must be held responsible for the religion’s “growing jihadist cancer” in the wake of the terror attacks in France."},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""},{"comment_id":"1705584226349949","commenter_b":"IF HITLER TRUMP GETS IN WE THE LITTLE PEOPLE CAN KISS OUR ASSSSSSSETS GOOD BY CAUSE HE WILL BE FOR THE RICH AND MAILNLY HIMSELF WAKE UP AMERICA BEFORE WE HAVE ANOTHER MAD MAN IN CHARGE","commenter_a":"What an Idiot..mathsssssssss you cant","post_message":""},{"comment_id":"10153117500629342","commenter_b":"#seriously what woman wants to see a man in tight shorts? #smh","commenter_a":"Jenn Nunez I will be going to Dallas soon","post_message":"The restaurant says it offers something for both girls and boys."},{"comment_id":"1659577024311353","commenter_b":"Trump has no chance of beating Hillary---and that is a fact. She would chew him up.","commenter_a":"Just another reason to vote for Trump!","post_message":"I'll help you PACK!"},{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"},{"comment_id":"10153451640786973","commenter_b":"Regarding your Columbus post earlier, in my school he isn't credited with what you are saying. Blanket misconceptions are counterproductive, especially when it comes to school. Much like the Pledge crap that goes around... we do the Pledge, even if Fox news says otherwise.","commenter_a":"When my children are sick, they'll miss school. When they have dentist appts they'll miss school. If I decide it, they'll miss school. I'm the parent, our family's needs come before school administration's needs. Period. The school is LUCKY to havey children attend and i warch them like a hawk. Our childrens mental health is more important than grades and standardized testing!! And @username you've got to be high on meth if you think for one minute every doorstep wants or needs a social worker or, the GOVERNMENT rather, invading their privacy, trying to make parenting decisions or stomping on civil liberties on even the smallest scale. I wouldn't put up with that for a second. And haven't you been paying attention to what a total, corrupt failure DHS is anyway??? Ridiculous notions.","post_message":"Oregon schools have done little to intervene despite having 94,000 students miss at least 10 percent of the school year."}]
