[{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"839189072876028","commenter_b":"Women 4 Trump","commenter_a":"@username is the smartest, strongest, most beautiful woman in America, and she will be our next president. #ImWithHer #SheGotOurBack #WeGotHerBack #HillaryAllTheWay","post_message":"Trump’s attacks on women’s health are inexcusable—and the rest of the Republican candidates are just as bad. hrc.io/1St92h4"},{"comment_id":"904121959720983","commenter_b":"Lock Her up!","commenter_a":"Behind bars fits her","post_message":"America is waking up!"},{"comment_id":"1562229620730818","commenter_b":"Whoopi needs to zip her mouth too!!!","commenter_a":"About time","post_message":"I love ABC for doing what's RIGHT!   Rosie O'Donnell & Whoopi Goldberg have no place on TV."},{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"}]
