[{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":""},{"comment_id":"1360351430654310","commenter_b":"Thank you for your vote of confidence but as of right now my focus is on college classes and getting my degree ASAP .","commenter_a":"Oh god I hate her . She is such a hypocrite. She calls us snowflakes for complaining but her job is literally to sit behind a desk and complain about things she doesn't like . She is the biggest snowflake of them all ( next to lord twitterfingers of course ) . For someone who's a millennial and who \" doesn't like labels \" she sure does like to label everyone else . She's not even a real journalist, she is a glorified YouTube personality .","post_message":"She came after Meryl Streep  and that was the last straw."},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"1687846428128746","commenter_b":"What a nice sounding kid.","commenter_a":"Build that wall for America and make it big and strong! Trump 2016!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building!  LET'S #MAKEAMERICAGREATAGAIN  www.DonaldJTrump.com/Nevada"},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"591748790988611","commenter_b":"She is such a lying two-faced b**** and anybody that believes anything that she says is a moron! That woman has more money and more houses and more luxury than anyone. Everytime she opens her mouth she's lying","commenter_a":"Pot calling the kettle? Except for Trump never having killed anyone","post_message":"Is this hypocritical?  WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"1023152674374447","commenter_b":"This woman is nuts","commenter_a":"She's dumber than a rock.","post_message":"We asked the DNC Chair if her children were human before they were born. She gave a shocking answer..."}]
