[{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"10150722681504999","commenter_b":"@username It seems to me that you are the uneducated one, very stupid also!","commenter_a":"Bringing a knife to a gunfight, no sane individual would attack a police station full of armed police with a knife. Religion really plays no part in this. Surely the man needed mental health treatment?","post_message":"Officers fatally shot a man who was wielding a knife and yelling “Allahu akbar” as he tried to attack a police station in Paris on Thursday."},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"}]
