[{"comment_id":"950131068413281","commenter_b":"Women have had the right to vote for 90 plus years males much longer. We have had no choice in gender on voting. We have a choice now. I believe in choice. Every time s women has tried to run both parties go out to wipe them off the earth. The surprise is people still fall for this game.","commenter_a":"My vote is going to Hillary not another old white man","post_message":"A great point."},{"comment_id":"10154001788011770","commenter_b":"They not that sexy to me at all need some meat on the bones Sarah Palin is sexy","commenter_a":"Mama's baby papas maybe They look nothing alike","post_message":"Gigi and Bella Hadid proved they are the sexiest sisters in the world at the Victoria's Secret Fashion Show."},{"comment_id":"10154184705448525","commenter_b":"Yes, she meant for the child to nearly be injured. It was totally on purpose! What a horrible, horrible mother! We should prevent her from ever reproducing again! Period!!!!!!","commenter_a":"That is not considered an accident!!! That is carelessness and neglect of protecting your child. Plain and simple truth. Period!!!!","post_message":"IT ONLY TAKES A SECOND: This big brother is a hero after racing across the room and catching his baby brother as he falls from the changing table! Their mother hopes this will serve as a reminder to others to remain vigilant - always. Read more: @webpagelink"},{"comment_id":"10153720250674877","commenter_b":"And then his white gf walks in the video shot. Lmao","commenter_a":"He's a confused brother. I'm sad for him","post_message":"Black cop’s pro-Trump, anti-protester video goes viral: I felt safe with Trump fans!  Grio fam, what do you think of what he has to say? Would you feel safe at one of these rallies?  Share your thoughts below."},{"comment_id":"464367687084172","commenter_b":"Please be specific and truthful. Trump is only against ILLEGAL immigration. Trump is only calling for a temporary hiatus on muslim immigration until we can ensure that terrorists aren't taking advantage of the opportunity to come to America. Otherwise peddle your bs somewhere else.","commenter_a":"And of course Trump said nothing of the sort. Bernie is a liar, plain and simple.","post_message":"Watch Bernie Sanders's explanation for Donald J. Trump's rise. -------- Read more on the third Democratic debate: @webpagelink"},{"comment_id":"10156681236645354","commenter_b":"Go Donald Trump make America great again Let's take our Country back Ban muslims God be with you and Stay Safe.","commenter_a":"Trump did NOT say Muslims should wear special ID badges. Clever editing by a hostile press invented that.","post_message":"Fox News Invites Anti-Trump, Hitler-Citing, Muslim Advocate to Join GOP TV-Debate"},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."}]
