[{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"10153489508667439","commenter_b":"Yup, illegal aliens!","commenter_a":"Finally. One law for all. They came here, like everyone else they should obey the law.","post_message":"@webpagelink"},{"comment_id":"10152924291939091","commenter_b":"A woman!","commenter_a":"That's why I like my men clean cut... No beards eww...","post_message":"How dirty is your beard?  A shocking new study found men's facial hair to contain the same bacteria found in human feces: @webpagelink"},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"},{"comment_id":"10157824241580354","commenter_b":"Convert them or kill them.","commenter_a":"People who want to believe in Muslim as a religion should first understand how it was started and read a book called THE STORY OF MOHAMMED BY Harry Richardson .This book is where Islam started and who started it . It's a paper back book takes about 3 hours read it it tells you how thus Prophet Muhammad where it came from and how it all started. It tells you how this guy was nothing more than an outright murder a thief and kill everybody who didn't agree with him now people show up and tell you that Islam is a peaceful religion that guy would be nuts to believe that this book was done a great research and there's nothing peaceful about this guy named Mohammed take it upon yourself to read","post_message":"“We must not be afraid to approach and contend with the complexity of Islamic law and history, the good, the bad, the ugly and the viciously anti-democratic.”"},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim.  Would you sue your neighbor over a disruptive pet?"},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"}]
