[{"comment_id":"10153223251130329","commenter_b":"What a nasty bitch.","commenter_a":"Wow that Katie chick is a bitch.","post_message":"Awesome."},{"comment_id":"627551517435427","commenter_b":"Big mouth cow","commenter_a":"So we'll give her grandmother a free drink.","post_message":"This entitled woman just demanded a free drink... Because of slavery?  This is absolutely ridiculous. We owe her nothing.  Should she be compensated for slavery?"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States.    Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin.  So, how has racism changed over time?"},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"10152995336151037","commenter_b":"This chick is nuts lmao. Anyone who pretends to know what happened is dillusional.","commenter_a":"This was NEVER about a RACIST Cop shooting someone. The Lame Stream Media made Darrin Wil\\bson into a Racist, despite NO Evidence ever being presented that showed Mr. Wilson as being racist. It is sickening.","post_message":"A member of the grand jury that declined to indict the white Missouri police officer who fatally shot an unarmed black 18-year-old sued the prosecutor in the case, criticizing the way evidence was presented to grand jurors and seeking court permission to speak publicly about the way the case was handled."},{"comment_id":"10152910744010779","commenter_b":"I believe that you're a dumb whore.","commenter_a":"Can you guys just NOT send me this one in the mail? Thanks.","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"1082304031883694","commenter_b":"@username \"butt hurt\".... It is a comment about grammar.","commenter_a":"What is a \"one and three chance\"? Does that mean we will get hit with four storms? The spelling and grammar people are nonexistent in the media these days.","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."}]
