[{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"},{"comment_id":"911844395571846","commenter_b":"Hillary is Hillaryous!!!","commenter_a":"Oh great, more solar energy... Solyndra anyone? $535 million more in gov't grants to a failed technology? Better to build a nuke plant AND it doesn't take up as much space, it would take miles and miles of solar panels to even come close to a nuke plants energy output!","post_message":"Do you agree with Hillary Clinton? #DemDebate"},{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10153660324311491","commenter_b":"@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"},{"comment_id":"10153982598576509","commenter_b":"Burn","commenter_a":"@username Angel Castro @username Ivan Longoria noooooooohhhhhh!!!","post_message":"Some retailers are offering Caitlyn Jenner costumes for Halloween, but critics say these costumes mock the transgender community. What do you think? @webpagelink"},{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"676190932571485","commenter_b":"She needs to be committed to a psychiatric ward for life","commenter_a":"OH Puke.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces.  This is absolutely ridiculous. She should be ashamed of herself.  Do you think Rosie O’Donnell needs to keep her nose out of politics?"}]
