[{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1304158649677186","commenter_b":"Pretty woman with a dirty mouth, ,, Perfect Clinton supporter","commenter_a":"Trump had this election stolen. He rigged it. He tampered with an election. That is punishable by law. Why isn't he being prosecuted? His evidence is on his computer. Why haven't they confiscated that and checked it out? This is a joke!! This whole voting system is a scam. We the people have no rights in our voting. Trump was right. It is rigged...in his favor!","post_message":"This is a must read for every disappointed Democrat."},{"comment_id":"10153546316384714","commenter_b":"Piss off Clinton and go smack your ugly wife.","commenter_a":"You can take the black out the ghetto, but you can't take the ghetto out the black.","post_message":"Johnson was dismissed just hours after a video of him punching a woman was released"},{"comment_id":"877406769042769","commenter_b":"Idiot ASS CLOWN","commenter_a":"President trump will take care of that","post_message":"ClashDaily.com"},{"comment_id":"1053645448090460","commenter_b":"Jihad Malik ..get off this post ..your mama was stupid for making you","commenter_a":"Why don't you post a story of the anti Semites throwing people off of buildings in the countries surrounding Israel....they are the people you should be fearing and writing about ...The JP has joined the Shrillary camp","post_message":"Schmitz has called the accusations defamatory, but reports of anti-Semitic tendencies at the top of the Trump team reinforce the narrative."},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a \"black soul.\" @webpagelink"}]
