[{"comment_id":"10153696423508717","commenter_b":"And are spelled out for me in MY bible","commenter_a":"Hi! I'm an ignorant Facebook commenter. I disagree with/HATE anything that makes me uncomfortable and refuse to believe studies that are in contradiction of my beliefs. Only studies that agree with me are real. God bless!","post_message":"A new study in the Journal of Developmental and Behavioral Pediatrics finds that the kids really are alright."},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"10155747108715389","commenter_b":"Not here by illegal means of any kind. LEGAL immigration only.","commenter_a":"Our nation is totally off track right now. We need new leadership, someone who is 100% American and can get us back on track again.","post_message":"\"[I]t is being done as an express plan by the left because they want voters more favorable to liberal policies.\"  Last night, Ann Coulter gave her unvarnished opinion on immigration in the U.S."},{"comment_id":"1141907219179950","commenter_b":"So, she won 3rd and 5th place. So much for any supposed advantage she's supposed to have by having been born biologically male. She was beat by naturally born females.","commenter_a":"We're all equal so we must all be equal physically right? Yeah no.","post_message":"“What happened to protecting naturally born females?”"},{"comment_id":"10154426292152431","commenter_b":"Sending smoke for Jim's family and friends","commenter_a":"Loved his stories!","post_message":"Jim Northrup (1943–2016): Beloved Ojibwe Author, Poet, Marine Veteran Walks On  @webpagelink"},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."}]
