[{"comment_id":"999092436786383","commenter_b":"Somebody needs to go to jail, start with Lois Lerner.","commenter_a":"About fucking time","post_message":"Here at RedState, we’ve already spilled a lot of digital ink covering the IRS scandal."},{"comment_id":"10153776818934255","commenter_b":"eliminate money...take their power...then its not \"too costly\" to protect the planet...and the creatures that inhabit it...its up to the people","commenter_a":"They were also in with Gov. Jeb Bush pushing education vouchers in Fl. that took money from public education.","post_message":"Unreal.  #DailyKosClassics"},{"comment_id":"10153426857830329","commenter_b":"Faketalian !!! Grossest shit ever.","commenter_a":"@username oh my gawd we need to go","post_message":"We all knead this."},{"comment_id":"603295489861030","commenter_b":"Willie is anti-gun. Doesn't really matter what else he says, Willie can go to hell.","commenter_a":"Go getem Willie.....","post_message":"Willie Nelson just made this huge stand against Obama.  We stand behind him 100%. Let's show him our support.  Can we get 10,000 'LIKES' for Willie Nelson?"},{"comment_id":"575299862633901","commenter_b":"@username if he just fired all the illegals that work him would be a start. And then send the visa people back home and hire american . But as we saw with romney they like chinese workers.","commenter_a":"Trump says Bernie should tell his followers to stop the violence....I damn near dropped my phone when I read that","post_message":"Tell him, Bernie!"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"635288009979398","commenter_b":"How silly. Some people will sign anything.","commenter_a":"idiot","post_message":"An online petition to remove all air conditioning from Department of State property has gotten more than 1,800 signatures since it was posted online Sunday."}]
