[{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."},{"comment_id":"378908105805941","commenter_b":"These people are demon possessed. They need to be stopped.","commenter_a":"Trumps fault","post_message":"MUSLIM MEN WHO RAPED 11-YEAR OLD Shout \"Allahu Akbar\" At Sentencing...The Girl Had A Baby At 12   No remorse whatsoever..."},{"comment_id":"10153616192149342","commenter_b":"I can count the ppl, I can really count on on 1 hand.... With fingers to spare for a hot chick!","commenter_a":"Some of your \"real friends\" don't either. js","post_message":"How's your Facebook friend list?  #abc13"},{"comment_id":"10154014053348984","commenter_b":"SHES A RACIST BIGOT ANYWAY","commenter_a":"I don't know anyone that likes that show, or doesn't think that Whoopie is whoopie.","post_message":"Donald J. Trump has had enough with the liberal ladies of \"The View.\" In just one word, he absolutely destroyed host Whoopi Goldberg... this is brutal.  This goes to prove one thing... never pick a fight with The Donald."},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"10154823170036162","commenter_b":"That is what I called the good work","commenter_a":"@username dammm","post_message":"WOW: Have you seen this? Loyal Cubs fans in Nebraska knocked it out of the park with their Halloween decorations this year, honoring the team! Their decorations include a \"Go, Cubs, Go\" light show!!!  Thanks to Sabrina and Paul Faire for sharing their video with #abc7chicago."},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"}]
