[{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"10153253849621955","commenter_b":"Poor rich spoiled brat she thinks she's and her stupid husband ruthless she no First Lady you wouldn't see Jackie Kennedy acting like her.","commenter_a":"WTF.","post_message":"MICHELLE OBAMA: Emotional toll of being a black first lady..."},{"comment_id":"10152826329111130","commenter_b":"Women are a different race?","commenter_a":"Arrogant and controlling and not smart enough yet to hide it. Did anyone else who watched this wonder whether he would have shushed a male reporter?","post_message":"Unbelievable."},{"comment_id":"10154165590671746","commenter_b":"Yes ! Now the lazy legal Immigrants have no excuse of not being able to find jobs","commenter_a":"Please restaurant owners get new workers","post_message":"Two South Shore restaurant owners were put on notice by their staff either early Thursday morning or Wednesday evening: Workers would be no-shows for the 16th \"out of protest.\""},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"}]
