[{"comment_id":"10153647894113854","commenter_b":"Leave her alone","commenter_a":"You call this piece journalism? Now that's a long stretch.","post_message":"FLASHBACK: \"Megyn Kelly F**ks Brit Hume to Get a Job at Fox News\""},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":""},{"comment_id":"10155161723871037","commenter_b":"You are so gross ...","commenter_a":"States where mestizos who refuse to learn English because we made it possible to not have to learn English and tell them assimilation is bad, have horrendous scores.","post_message":"Number 1? Massachusetts."},{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."},{"comment_id":"10153153775676350","commenter_b":"Girls, keep on winning!","commenter_a":"Stop your whinning..","post_message":"\"Please do something about this. Girls read comics, too, and they care.\"  Read Rowan's full (awesome) letter here."},{"comment_id":"10154550046141037","commenter_b":"Bring them here, give them free stuff and they will be lifelong democRAT voters.","commenter_a":"So ...basically illegal immigrates are ok by her standard?","post_message":"The 730,000 young people brought to the U.S. as children without legal status are prohibited from voting, but they are still a powerful political force."},{"comment_id":"10154521229303318","commenter_b":"Start building the wall","commenter_a":"The idiot has border fences all along southern Mexico whats that for. They think they can just come to America an send the money back.","post_message":"Mexico's president just cancelled his meeting with President Trump.  He told Trump Mexico \"does not believe in walls\" and \"demands respect.\"  Do you support or oppose Trump's dedication to the wall?"}]
