[{"comment_id":"10152746114636545","commenter_b":"That's bootylicious","commenter_a":"Kaci, Ryan, Anthony and Cory - get home ASAP but do so in a safe manner.","post_message":"The roads are getting worse everywhere in North Texas and accidents are starting to pile up. Check the traffic conditions if you need to go anywhere.   TRAFFIC: @webpagelink"},{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"},{"comment_id":"802416633249035","commenter_b":"Trump supporters do not listen to reason or facts.. Exhibit A above","commenter_a":"Shameful. Was it a DNC rally??All of those actors from other countries that she showcased... They are not illegal immigrants!!! There's is a huge difference.","post_message":"What did you think of Meryl Streep speech?"},{"comment_id":"10154450700759411","commenter_b":"Not Only Gay, what about all females that Catholic Church burned at dark age?.","commenter_a":"We all need to REPENT turn from our wicked ways and worship the Lord Jesus. Judgment will come to all when the lord returns... Even the Pope will be judged for his words and actions.","post_message":"'The questions is: if a person who has that condition, who has good will, and who looks for God, who are we to judge?'"},{"comment_id":"10153018260001130","commenter_b":"Darin, what exactly, is a slut?","commenter_a":"abstinence based=teachs them nothing and then they get curious and then once curious they start having sex and when that happens boom teen pregnancies and after that begins the slut shaming when the only people who should really be blamed is the schools and parents for not being more educational","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"}]
