[{"comment_id":"10153851537376162","commenter_b":"They are bad dogs they should exterminate that race!!!","commenter_a":"Let me guess it was a pit bull??","post_message":"PET ATTACK: A 34-year-old woman with physical disabilities is in critical condition after she was brutally attacked by her family pet on Chicago's Southwest side."},{"comment_id":"1619826891648925","commenter_b":"@username Killary's hips are evidently widening. Must be all the hot sauce and watermelons she stashes in her pants.","commenter_a":"Why I'm backing D.T., he's against the establishment, can't stand Obama & Hillary, called out lying Cruz, wants America first, he doesn't come from a political family, treats his 30,000 employees with respect, supports law enforcement, will put a border up, deal with illegals & radical muslims, doesn't act like a scumbag politician, he's not part of the \"Good Old Boys\", helps military and families, great family man, very passionate about this country & the citizens, doesn't take BS from anyone and wants to Make America Great Again! #VoteTrump2016","post_message":"FLORIDA -- THANK YOU --- WE CAN WIN! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1193499157336779","commenter_b":"Poor people. Blessed to live but with these memories. Prayers","commenter_a":"Very sad! I can't imagine the horror! God bless you always!","post_message":"\"We were just about to say the prayer to be released,\" said Felecia Sanders, one of three people who survived when a gunman opened fire during Bible study at her Charleston church on June 17."},{"comment_id":"797617833687933","commenter_b":"Angela is brainwashed to believe that she'll suffer in the afterlife if she doesn't believe in Jesus.","commenter_a":"there is no jesus....little ceaser maybe","post_message":""},{"comment_id":"778536202281765","commenter_b":"Lynette Houdek You really need to take a class in comprehension. Trump said he would renegotiate the trade deals so America gets a fair deal. You speak of the Colorado fiasco. What is crooked about it is that they locked the Trump delegates out and removed their names from the ballot. That is called rigging the election. Please take the class I suggested.","commenter_a":"Krauthammer, you think Cruz could handle China. Trump has done business with the Chinese. He know's what he is doing. The business in Colorado is a disgrace. Trump delegates were turned away and their names scratched off the ballot. Does that make you proud of our \"Banana Republic\"???","post_message":"Is Krauthammer right?  WATCH:"},{"comment_id":"910100355702699","commenter_b":"She should have gotten the death penalty!!!","commenter_a":"Hey like they say, you get what you sew!","post_message":"Convicted killer Jodi Arias will now spend the rest of her life behind bars. Watch Travis Alexander's sisters beg the judge for a maximum sentence: @webpagelink"},{"comment_id":"10153824492221336","commenter_b":"Start packing illegals.....","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."}]
