[{"comment_id":"798433503628356","commenter_b":"What the hell is wrong with women???","commenter_a":"Well said Kimberly!","post_message":"Hundreds of thousands of Americans are marching on the streets of the nation's biggest cities for the Women's March"},{"comment_id":"1173282172788559","commenter_b":"Sick sick woman","commenter_a":"How evil can these people be","post_message":"Oh. My. Gosh. Things just got weird really quick. @webpagelink"},{"comment_id":"10154141987653145","commenter_b":"@username Yes! Thugs with guns and badges paid by our tax dollars.","commenter_a":"This is where we are today: Killer cops kill civilians and get away with it. Civilians kill cops and either get killed by other killer cops, or if very lucky, they get arrested, charged, and sentenced. Killer cops have no empathy for civilians they kill, or their families. The copsuckers show no empathy for the victims of killer cops who again, get away with it. If the killer cops, along with their apologists don't show empathy for the victims of police killings, why should civilians show empathy for the killed cops? If the killer cops won't shed tears when civilians get killed by cops, why should civilians shed tears when cops get killed? If the killer cops along with their apologists think it's OK for the civilians to be killed by cops (the unjustified killings), why shouldn't the civilians think it's OK for the cops to be killed? Only if ...","post_message":"The slain officer was a special agent with the Georgia Bureau of Investigation. Police say the gunman remains at large this morning."},{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"550965321772492","commenter_b":"@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to \"cover their tracks\" because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."},{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"}]
