[{"comment_id":"10154482424522144","commenter_b":"White, \"christian\" males should be put in concentration camps as they have killed more Americans than muslims","commenter_a":"They don't fit his fantasy of a dystopian world???","post_message":"Actually, it's Trumpnot the mediawho's ignoring certain terror attacks. Guess why."},{"comment_id":"10153606250119778","commenter_b":"You look beautiful and happy!!! Congrats to you!!","commenter_a":"Stupid","post_message":"A woman vowed that she'd marry herself if she hadn't found true love by 40. And for her 40th birthday, that's exactly what she did."},{"comment_id":"1207167835973058","commenter_b":"It's not true for entrepreneurs but workplace","commenter_a":"What if this statistic isn't true? Check out what John Stossel uncovered: @webpagelink","post_message":"Kristen Bell introduces Pinksourcing, where women are a bargain at the workplace, since you only have to pay them 77 cents on the dollar! It's the first episode of our new series, #CelebsHaveIssues."},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"},{"comment_id":"502464629957050","commenter_b":"NOOOOOOOOOOOO GO HOME WHERE YOU RUINED YOUR OWN COUNTRY","commenter_a":"If they are offended by the anthem of the country they chose to live in....the country that is giving them the right to spew their BS....the country that provides their safety and many welfare services....then I guess they can just GTFO.......","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B?"},{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"10155795275933294","commenter_b":"Bunch of bull lock all of them up @username bond then they stop this crap","commenter_a":"He got what he deserve and they should get the same","post_message":"WATCH LIVE: Protesters have taken to the streets of downtown Portland, calling for justice for Quanice Hayes, who was shot and killed by police last week."}]
