[{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"\"Hillary was the president already once. You know what I sayin?\""},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"10152889447368837","commenter_b":"How about sending your black people to Africa forever ever, so they don't rob, kill , root and continue destroying this country!","commenter_a":"Since the US is working with Cuba, the government needs to eliminate the wet foot dry foot policy. Make sure any Cuban who comes here get citizenship so they can pay taxes versus living here off the grid and sending monies home to screw up the Social Security, retirement and Medicare funded programs built for Americans in this country. Black White Hispanic Asian Haitian alike.","post_message":"Dangerous Voyage."},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"},{"comment_id":"10153731246222217","commenter_b":"VOTE FOR TRUMP!! Screw this hoe","commenter_a":"Isn't that what Trump is actively doing? At least Clinton only accidently put others in danger, where as trump is one bad day away from bringing back Lynching, well try to anyway.","post_message":"He added that she would make \"such a lousy president\"."},{"comment_id":"591316744410090","commenter_b":"Rachel is such a Clinton lover.","commenter_a":"She is as Slimy as he is. All they have is harass Hillary. Guess what. It doesn't touch her. #ConManTrump #Hillary2016 #imwithher #StongerTogether #Trumpstaxreturns","post_message":"What is Donald J. Trump's stance on immigration? Trump campaign manager Kellyanne Conway stops by The Rachel Maddow Show to shed some light.  More from Rachel Maddow's interview with Kellyanne Conway: @webpagelink"}]
