[{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"},{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10153288291318812","commenter_b":"That is great! I had to tell a mom to stop playing games on her phone in the theatre once. She was playing for nearly half an hr into the movie & it was totally distracting cuz of her huge bright screen & she was holding it up right in front of her face.","commenter_a":"Praise God it is so good to know that some people do still believe in kids being obedient and respectful to their elders.","post_message":"\"This rude, disrespectful, and awful behavior is unacceptable and they owe you an apology.\"  Mom's Facebook apology for kids' bad behavior at the movies brings recipient to tears: @webpagelink"},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."}]
