[{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"},{"comment_id":"1665486166837473","commenter_b":"Globalization needs to be ended for this country. Fight against UN agenda 2021/30 with every breathe you have!!!!","commenter_a":"It's a new day the second revolution has come we are taking back America and there will be some changes around here.Joinn us or leave us it's your choice.","post_message":"Everyday patriots..."},{"comment_id":"593124330856614","commenter_b":"@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"},{"comment_id":"10153675187678352","commenter_b":"Trust no Bitch","commenter_a":"On the next episode of Orange is the New Black....","post_message":"‘You might as well go ahead and execute me, because I’m not going to make it to 73′: Woman, 51, who beat her friend to death with a slow cooker in a row over politics is jailed for 23 years"},{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."},{"comment_id":"10154450737471909","commenter_b":"Please do elaborate and share your knowledge with the rest of us","commenter_a":"Anton Deni Pamela Note the what it's about and the symbolism. I found the pine cone staffs to be interesting knowing what they really mean.","post_message":""},{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"}]
