[{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."},{"comment_id":"1131210870268774","commenter_b":"We don't care!!! So don't vote for her and fly off to your birdie page! HILLARY FOR PRESIDENT!","commenter_a":"I am a DEMOCRAT and Hillary does NOT have my vote in the Presidential Election. @webpagelink","post_message":"In 1990, American explorer and marine biologist Sylvia Earle became the first woman chief scientist at the National Oceanic and Atmospheric Administration (NOAA). For nearly six decades, she has led an international community of scientists in the study, protection, and restoration of our planet's marine life. Her unyielding curiosity and commitment to reversing the effects of climate change are a source of inspiration for environmentalists worldwide. Thank you, Sylvia."},{"comment_id":"10153173280761491","commenter_b":"LMAO this is a joke!!!! Yea right, sure. And the first lady, Kim Kardash can show the sex tape she made in 2003 for company to the White House. This is what gave her fame and made her millions, Something she sure can be proud of and maybe even have her pres hubby pass a law that it be played in all public schools. LMAO","commenter_a":"Bernie Sanders","post_message":"It's still unclear if he's serious."},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination\""},{"comment_id":"10153118499596955","commenter_b":"Hemlock, anyone?","commenter_a":"These stories are being given as some form of programming... The nation was taken over and completely changed post Lincoln and forever altered for the globalists post JFK... If they want to move a major agenda forward they throw the nation off by creating spectacular distractions... This is subtext leading to a possible grand piece of theater.","post_message":"'Drunk' Secret Service agents disrupted bomb probe..."},{"comment_id":"1202153396486746","commenter_b":"It takes 2 to tango","commenter_a":"That's not news! Thats standard procedure.","post_message":""},{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."}]
