[{"comment_id":"10156397990805354","commenter_b":"Maybe one testical...he is a RINO.","commenter_a":"At least he has balls to stand up to Obama","post_message":"Which do you want: a \"pause\" or an \"immediate halt\"?"},{"comment_id":"1415272741824926","commenter_b":"If I was as ugly as her I wouldn't be calling attention to my stupidity too !!","commenter_a":"sounds more like Eva Braun more and more!","post_message":"Less than 30 minutes after Donald J. Trump was sworn in as President, MSNBC's Rachel Maddow was calling him Hitler."},{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"},{"comment_id":"1203485969759238","commenter_b":"Send her big wampum","commenter_a":"Senator : Thank you.","post_message":"Great news! Yesterday a Texas court struck down the US Chamber of Commerce’s attempt to overturn a new Labor Department rule requiring retirement advisers to put their customers’ interests first. The decision affirms what we already knew: this conflict of interest rule was lawfully enacted and the rulemaking process took the views, costs, and benefits of all the stakeholders into account. Now President Trump needs to follow suit. He should stand up to the Chamber of Commerce — and the armies of lawyers and lobbyists that brought this frivolous lawsuit — and allow the rule to be implemented in April as planned.  Hardworking Americans saving for their retirement deserve to have a retirement adviser who is recommending the investments that are the best for their retirement security, not the ones that let advisers pocket kickbacks and prizes."},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"10152698391808717","commenter_b":"She's no Zumba instructor but she's not","commenter_a":"She's a hottie","post_message":"Claremont police say two people face charges after selling cocaine, crack cocaine and heroin in a school zone. @webpagelink"},{"comment_id":"10153900801473445","commenter_b":"Never mind I've heard it only the oil and certain illness so it's shit like Ga.","commenter_a":"@username get you a card!","post_message":"Big News! Ohio Becomes the 26th State to Legalize Medical Marijuana"}]
