[{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"},{"comment_id":"10153576413974087","commenter_b":"She is a joke","commenter_a":"Says someone who championed NAFTA and called the TPP the gold standard of trade agreements. #whichhillary","post_message":"“Hillary says you walk out on America, you pay an exit tax. And if you got tax dollars or a tax deal, you’ve got to give the money back. She’s with us,” the Hillary Clinton ad says. WATCH:"},{"comment_id":"10154462849065695","commenter_b":"True and at the end of the day she going to be black im going to be white and nothing can be done about it. Oh and what the crap about drunk like most white girls? Yes that is a stupid remark","commenter_a":"Wow Sabrina why even make it a race thing.","post_message":"Police are asking anyone with information about what happened to Brenda Arreguin to come forward."},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."},{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring \"unhealthily underweight\" model is deemed \"irresponsible\""},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""}]
