[{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10153506495063855","commenter_b":"Stay outta Kohls then Asshole...","commenter_a":"OMG. Is kohls run by the lesbiens now? My wife told me the womens shoe section is full of work and combat boots nowadays.","post_message":"ICYMI: Kohl's melts our hearts."},{"comment_id":"1047811211942074","commenter_b":"I love her and some woman here are simple misogynists!..bitter woman! GO HILLARY!","commenter_a":"Look Hillary, no one likes Lena Dunham.","post_message":"Follow along as Lena Dunham takes over Hillary’s Instagram account today from the trail in New Hampshire: instagram.com/HillaryClinton"},{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"},{"comment_id":"1345340232144440","commenter_b":"@username, strong women do not build economies on murder of other countries and arming terrorists. That is a woman in bed with Big Money.","commenter_a":"I thought I was following an intelligent, thoughtful and insightful site, obviously not. Frightened of a powerful women I see, like most insecure men. We're use to it, but good luck with that ideology going into the future.","post_message":"EDWARD S. HERMAN: Hillary Clinton is a neo-liberal and pre-eminent war-monger. I think she is the most dangerous person living in the world today, given her highly likely election victory and her likely performance as president.   Trump is a self-promoting windbag, racist and dangerous, unpredictable phony. We have a ghastly choice in these two. Jill Stein offers a protest opportunity, more so than not voting. On the line that either voting for Stein or not voting would constitute a vote for Trump, one might argue that a vote for Hillary Clinton is a vote for war with Syria and Russia"}]
