[{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"10154426292152431","commenter_b":"Sending smoke for Jim's family and friends","commenter_a":"Loved his stories!","post_message":"Jim Northrup (1943–2016): Beloved Ojibwe Author, Poet, Marine Veteran Walks On  @webpagelink"},{"comment_id":"10154236917854726","commenter_b":"Hillary must never be allowed into the White House.","commenter_a":"What about these rides on that billionnaires plane!","post_message":"Media pushes war-on-women narrative against GOP while ignoring indiscretions of Bill Clinton."},{"comment_id":"10153694012485779","commenter_b":"Smart women!","commenter_a":"See some women aren't as smart as men","post_message":"Part support group, part grassroots political organization, Republican Women For Hillary was founded in Washington, D.C. where GOP women were commiserating about Donald J. Trump. Meet the Republican women who are backing Hillary Clinton."},{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"10154064678631336","commenter_b":"@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"}]
