[{"comment_id":"480250615511785","commenter_b":"she is a lier","commenter_a":"She's teflon!","post_message":"It really doesn't make any sense... www.eaglerising.com"},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"10156823156490594","commenter_b":"I don't want my great-granddaughters going into to bathrooms where males are also present. I'm not talking about transgender; there are sick people that will use that as an excuse to be were they shouldn't","commenter_a":"I never really shopped at Target's, I will now. I'm glad your taking a stand for the transgender population. So sad that people's lack of knowledge or fear make them judge.","post_message":"\"Inclusivity is a core belief at Target,\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"10153712266449199","commenter_b":"Nutter psycho...we need her out on the streets ..","commenter_a":"She killed him...we all know it..","post_message":"BREAKING:  Hung jury in Jodi Arias case, judge will now decide her fate"},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"10153839252314087","commenter_b":"@username He was a natural born citizen of the US and so was the LA Shooter who is from New Albany, Indiana. Why do you hate the Constitution, there is no racial component to citizenship. We must stomp out Christian and ISIS terrorism!","commenter_a":"I agree we must stomp out Jihadi and Christian Fundamentalism. The LA shooter was a Hoosier (Indiana). A disgruntled white man with fascist leaning aka the type of voter Loser Cruz tried to get but the Trumpster got. Is this un- PC enough for you gusano?!","post_message":"\"Enough is enough. What we need is for every American -- Democrat and Republican -- to come together, abandon political correctness, and unite in defeating radical Islamic terrorism,\" Ted Cruz said after the Orlando attack."},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"}]
