[{"comment_id":"1057942617592596","commenter_b":"@username go choke on some bacon goat humper","commenter_a":"Just so I'm clear, Hillary supports illegal aliens coming over here and doesn't support Donald J. Trump wall, but builds a wall to keep Americans out of the DNC? OK, that makes sense....","post_message":""},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"10153724968238145","commenter_b":"Wow the desperation of perverts grown woman don't want you so you seek a teenager . Get rid of scum bag .","commenter_a":"Glad they got him.","post_message":"BREAKING: This happened at the Publix on SR-434 and Wekiva Springs Road. Angela Jacobs will have a live report at 12pm."},{"comment_id":"780004342132746","commenter_b":"He said he wants all immigrants to be required to carry an ID with their status, which sounds logical to me and he repeated what others said. \"We know not all muslims are terrorists but it appears all of the terrorists are muslims\". When was the last time you saw a Buddhist terrorist, or a sikh terrorist, or for that matter an atheist terrorist? You just don't. Our biggest threats come from the middle east right now. It was perfectly fine while we were at war with the Japanese to pay extra attention to them. It was perfectly fine during WWII to keep an eye on immigrant Germans. What is the difference now? Why are we going to try and justify keeping our sovereign nation secure. Every other country does it. There is no law that says we have to accept immigrants. We are allowed to pick and choose, just ...","commenter_a":"Well, all was well and good until the part that was speaking of hate speech from the presidential candidate. Well he was obviously speaking of Mr. Trump. Unfortunately he is completely wrong. Mr. Trump used no hate speech at all. The only thing said was that he thinks we should stop the middle eastern refugee immigration until we could confidently vet them. This would be a temporary action. But of course the way the bleeding heart liberal media spins it, is that he want to cut off all immigration. This is another one of those stories that is attempting to drive the narrative and falsely force people to have negative opinions without the facts. The media wants people to believe that Mr. Trump said these awful things because the media hasn't been able to manipulate him and force him to fall into step. The media and the establishment are scared ...","post_message":"It's the little things... ;)"},{"comment_id":"10152999247891037","commenter_b":"Women dont fight wars....","commenter_a":"If a woman has a bright future she has an option to abort the baby, men don't. Give Men equal rights!!!","post_message":"A new report out today from the Guttmacher Institute shows that 57% of women now live in a state considered to be hostile or extremely hostile to #abortion rights."},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."},{"comment_id":"10152893596581336","commenter_b":"Oh look, Obama making his own rules again...surprise","commenter_a":"Who's the party of NO now.","post_message":"\"Congress needs to show patience.\"  Moments ago, President Barack Obama said he will veto any legislation from Congress that added new sanctions against Iran. @webpagelink"}]
