[{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"10153563067675667","commenter_b":"@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"1386824984689067","commenter_b":"She's a fucking drunk, wake up, she needs to be removed and institutionalized..","commenter_a":"Someone tie her arms by her side, maybe with a straight jacket!","post_message":"Something seems really off here..."},{"comment_id":"1178312252188803","commenter_b":"The site did not breech their privacy......they all willingly made the choice to put their name and information on there to cheat on their spouse......the site did not do anything negligently....the hackers got in.....they have been able to get into top secret government systems.....how is a website for cheaters supposed to be expected to have better security than the government? The hackers are the ones at fault.....and the idiots who allowed themselves to be exposed by trusting something as insecure as the internet to cheat on their spouse!","commenter_a":"I disapprove of what they did but the site breeched their privacy.... Hope every penny goes to those that were cheated on","post_message":"All allege breach of contract, negligence and violation of various state and privacy laws by Ashley Madison and Avid Life Media LLC"},{"comment_id":"10153366804443635","commenter_b":"Old testament commands to kill is now invalid. You are beyond ignorant Kyle. You'll do anything to defend any religion except Christianity. Did i say you should be killed, you nut? I'm not talking to you anyways. Get your nose out of my conversation with him.","commenter_a":"Kill the unbelievers wherever you find them.\" Koran 2:191 \"Make war on the infidels living in your neighborhood.\" Koran 9:123 \"When opportunity arises, kill the infidels wherever you catch them.\" Koran 9:5 \"Any religion other than Islam is not acceptable.\" Koran 3:85 \"The Jews and the Christians are perverts fight them.\"... Koran 9:30 \"Maim and crucify the infidels if they criticize Islam\" Koran 5:33 \"Punish the unbelievers with garments of fire, hooked iron rods, boiling water melt their skin and bellies.\" Koran 22:19 \"The unbelievers are silly urge the Muslims to fight them.\" Koran 8:65 \"Muslims must not take the infidels as friends.\" Koran 3:28 \"Terrorize and behead those who believe in scriptures other than the Qur'an.\" Koran 8:12 \"Muslims must muster all weapons to terrorize the infidels.\" Koran 8:60. That seems pretty pure to me, purely evil!","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"}]
