[{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."},{"comment_id":"10153693958978010","commenter_b":"It only takes an extra 2 hours in pouring rain. Finally home. BTW, Albert Hammond lied lied to us here. But i love that song. IT NEVER RAINS............","commenter_a":"Thanks.","post_message":"Turn on your headlights!  It's pouring outside. Here's a how-to for Southern Californians confused about driving in the rain.   @webpagelink"},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"\"When I saw her on TV crying, I felt like she did a 360-degree turn here.\"  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."},{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"},{"comment_id":"978703995520079","commenter_b":"And so does everyone else or they would not even bother if they did not","commenter_a":"The comments are always good for a laugh. You put up something positive & life affirming & there are sad, silly people feeling sorry for themselves who bad mouth it because it came from a successful actor. Ever wonder why he's successful? Maybe he had the right attitude & didn't blame all his problems on someone else!","post_message":""}]
