[{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"\"If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?\"  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"10153419544317061","commenter_b":"Robach on safari in Africa, probably a better production performance from her than the days she does studio production...She clearly has the ability and clothes to dress for an African safari and lacks all ability to select the correct wardrobe for studio performance...Robach and Spencer are the two worst dressed women on GMA since the show began...Diane Sawyer was one of the best dressed women on this show...","commenter_a":"Cool!","post_message":"WATCH: Our drones capture beautiful live images of elephants as we are on safari in Africa. Interact here: abcn.ws/20PSiVQ #GMAinAfrica"},{"comment_id":"849061198475049","commenter_b":"She wants no part of it. Very wise classy lady.","commenter_a":"Condoleezza for President, she'd make a wonderful one. Outstanding human, patriotic, religious.......intelligent, classy. She has much more quality than Hillary any day.","post_message":"Just beautiful. I didn't even know Condi was a musician..."},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"},{"comment_id":"480443122154949","commenter_b":"INDEPENDENT WOMEN FOR TRUMP!!","commenter_a":"Saw the Town Hall meeting with you tonight, very on point. I hope people get their heads on straight and vote for you Mr.Trump. Go Trump Go","post_message":"WOW! What an evening in West Allis, Wisconsin! THANK YOU for the incredible amount of support tonight. Everyone get out and VOTE TRUMP on Tuesday, April 5th! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"\"I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,\" New York City Mayor Bill de Blasio tweeted."}]
