[{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: \"The system is rigged, and Donald J. Trump would make it worse.\" @webpagelink"},{"comment_id":"1354018291282776","commenter_b":"Lol a bitch","commenter_a":"Colin, the multi millionaire football player only started feeling oppressed after he began dating a devout Muslim. He now hates everything American, but still takes advantage of everything American!","post_message":"If they thought their fans would blindly go along with any insult to their country, they were sorely mistaken..."},{"comment_id":"10153155404671323","commenter_b":"@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"1082109501809405","commenter_b":"Illegal refugee returns?","commenter_a":"what about the human rights of the children and women raped and molested by islamic immigrants ??","post_message":"Amnesty Secretary General Salil Shetty said that short-term national self-interest and draconian security crackdowns had led to an \"unprecedented assault on human rights\" in 2015. Read more: @webpagelink"},{"comment_id":"805710002902059","commenter_b":"But no one will ever do anything. She is above the law","commenter_a":"My biggest problem with Hillary Clinton is the fact that she condones an abortion minutes prior to birth, leaking national security time limits during a nationally televised presidential debate. She has been held non-accountable for any of her mischievous, murdering, actions. If she gets in she will be following Obama's legacy, and our country is doomed","post_message":"ARREST!"},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"}]
