[{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"},{"comment_id":"10154593663574342","commenter_b":"Okay, she looks stupid with that dress, you ain't royalty Girl... that's something Kate would wear smh...or the Kennedy","commenter_a":"just hate the way he acts , cant even wait for his wife","post_message":"First Lady Melania Trump is wearing a sky blue, mock turtleneck Ralph Lauren dress as she walks into St. John's Church with President-elect Donald J. Trump.  Watch #Inauguration Day live-->@webpagelink"},{"comment_id":"1783246305275728","commenter_b":"@username Yes She did","commenter_a":"I am Dutch. Sylvana Simons said \"All White people are Racists\". Now everybody is angry at her. She never changed her opinion and never said sorry. She is a member of Denk, a Dutch Turkeys political party. The party has very extreme opinions and backs Erdogan without questions. They like sharia law, and child marriage.","post_message":"\"People shouldn't turn it into something negative,\" says one mum whose son dressed up as 'Black Pete' for a parade."},{"comment_id":"10153169803431336","commenter_b":"She put her hands on her kid. I would of laid her flat too.","commenter_a":"every single student involved should be place in juvie. If the teacher isn't given justice she should sue the school for a million. no teacher should put up with that kind of sh&& from a parent or students. School's do not give teachers the support they need when the students act like animals","post_message":"Annika McKenzie allegedly put the teacher into a headlock and threw her on the ground. Then, several students reportedly began kicking and punching her while she laid unconscious."},{"comment_id":"10153428290568487","commenter_b":"?? Do you think it while turn a woman into a fuck machine? Does Viagra turn men into drooling cock monsters?? WTF are you even talking about??","commenter_a":"Am I the only one with a slight concern that this could be used to spike women's drinks? Just a thought in the back of my mind....","post_message":"A FDA panel has recommended approving female Viagra for the market. Is it even necessary?"},{"comment_id":"10153786734045329","commenter_b":"Hahahahahahaha!!!! Omg!!!! It's like we're on the Truman Show!!!","commenter_a":"@username!!!! Holy moly!!! Lmao","post_message":"\"If we're still single when we're both 39, can we have babies together?\""},{"comment_id":"10153644347998188","commenter_b":"Your opinion from your dreams Beck! It is a year before the election it is speculation at this point!","commenter_a":"I have been impressed with Carly for a few months and thought she did really well getting her points across, only wish she would be a little more warm and natural. She needs to be more likable. Rubio was outstanding with his knowledge of world affairs and ability to connect. Very presidential. Dump the Trump!","post_message":"Biggest winner: Carly Fiorina biggest Loser: Trump.  She looked presidential, serious, sharp, well informed, non establishment and tough.  Second place:  tie Rubio and Cruz  Close third: Carson (although because he is so different in volume, pace and style he may surprise me and others)  Biggest loser was so clearly Trump.  He is just not likable.  I just don't believe he is liked by tea party members.   I stood with them and looked into their eyes, is poke with them, marched with them and there is just nothing they have in common except being fed up.   If that is all he has, it is going to crater quickly.   He looked like a bully, sleazy and I just can't imagine good hearted, humble, faithful Americans falling for this arrogant anger much longer.   What average non political woman will connect with them?  Runner up for loser:  Bush.  He was rattled.  It is clear, he hates Donald trump.  While there were a couple of times I felt sorry for Bush. It didn't make me think he would be great if he were rattled by Putin or the mullahs.  This was a mortal wound for bush I think.  Also the big loser:  America.  It was so childish much of it.     #gopdebate #cnndebate"}]
