[{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"10156528431575354","commenter_b":"Screw her","commenter_a":"Boo-fucking-hoo! Lifes tough on EVERYBODY! And not everyone drives their car up on the sidewalk! Now the media will make her out to be the victim! Put her ass in prison and throw away the key!!","post_message":"Changed Name from ‘Lakeisha Holloway’ to ‘Paris Paradise Morton’…"},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""},{"comment_id":"10153909569808717","commenter_b":"Horrible! That poor man and his patient! Dam it!!!! This IS disgusting!","commenter_a":"The cop should be fired and imprisoned","post_message":"The caretaker was trying to get his patient back to a facility from where he had wandered: @webpagelink"},{"comment_id":"557960721079763","commenter_b":"Put it in her butt and see if she still complains about size","commenter_a":"😂😂😂😂","post_message":"Size clearly matters to this girl! #WSHH"},{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"}]
