[{"comment_id":"1136245463077540","commenter_b":"Amen","commenter_a":"I didn't vote for you the 1st. , or the 2nd. , time! Most all of us True Americans want you out. You, and your Obamanites have done nothing but take America to a all time low!!!","post_message":"YES!"},{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"1735932806679169","commenter_b":"Considering those men put their lives on the line to save ours let them fly the American Flag ,","commenter_a":"This is stupid son of a bitch","post_message":"A Rhode Island city official just called local firefighters “terrorists” and compared them to ISIS for putting THIS on their firetruck.  You just can't make this stuff up..."},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."}]
