[{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"1136430346423719","commenter_b":"You color blind bitch you was raised by a punk made MF and a hoe","commenter_a":"That was fucking horrible, what the fuck are clowns at #wshh promoting this stooge for? Oh wait, he's in jail for having an illegal gun. Must be a bad as rapper now. Gtfoh","post_message":"Kodak Black was rapping about his real life struggles & facing death at only 14 years old! #WSHH #FreeKodak #KodakBlack"},{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"},{"comment_id":"10153011056587169","commenter_b":"The go to feminist lie: blame it on \"Patriarchy\"","commenter_a":"I want all my kids to be powerful, my sons and my daughters","post_message":"How do you raise a powerful girl and what does that mean? PBS Parents experts share their thoughts:"},{"comment_id":"10153055647952235","commenter_b":"oh shut up Sarah !","commenter_a":"I'm more left leaning and I know she's a joke.","post_message":"Pass the popcorn!"},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"}]
