[{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"512585862199466","commenter_b":"Anyone who does homework works for his or her education.","commenter_a":"The man","post_message":"Thank you to everyone who has donated to my campaign- we have raised $51,000,000.00 in the month of June-- thanks to you! Lets MAKE AMERICA SAFE AND GREAT AGAIN! You can make secure donations here: @webpagelink"},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."},{"comment_id":"1266265003452033","commenter_b":"YES THIS IS WHAT I HEAR RULES AND LAWS ARE NOT FOR ANY POLITICIAN JUST FOR THE REST OF US","commenter_a":"but we already knew that, it's just nice to see the truth and evidence being uncovered.","post_message":"The rabbit hole just got a lot deeper... the corruption and incompetence that has been put in place to protect Hillary Clinton is mind boggling.  It's time we did something about this."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"}]
