[{"comment_id":"10153925563166037","commenter_b":"SarahMasanana. Animals kill their young, adultery, kill for food and have no remorse, you just described the human race! Wow.","commenter_a":"If this were an atheist country and atheist world we would be a lot better off. Much fewer wars and conflict and nobody pushing their BS onto anyone else.","post_message":"\"I think one of the reasons God has been good to us is that we have done him honor. Unlike the other countries of the world that do not even invoke his name we do him honor.\""},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, \"because there are jobs Americans just won't do,\" He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""},{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"903045683051621","commenter_b":"She embarrassed us once on national TV!!! We good!!","commenter_a":"Ya own kind hate'n why can't we stick together","post_message":"Guess Who Wants To Replace Kelly Osbourne On “Fashion Police”"},{"comment_id":"10156189535540354","commenter_b":"@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"\"Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.\""},{"comment_id":"10154449367595470","commenter_b":"Trump means GET RID OF MUSLIMS","commenter_a":"This is typical of the Hillary group","post_message":"Local republicans say they don't think the act of vandalism was done by a Trump supporter but they say they don't condone that type of behavior. They are hopeful it will stop and be replaced by actual conversations about opposing ideas."}]
