[{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"598432576983363","commenter_b":"No it's only ok for racist rednecks to say shit like that. Those lost European immigrants who assume they're original Americans.","commenter_a":"Too bad Trump wasn't on it.","post_message":"\"Looks like yet another terrorist attack,\" Trump tweeted. French and Egyptian authorities have repeatedly warned against such speculation."},{"comment_id":"10154687828874657","commenter_b":"DEPORT this terrorist!","commenter_a":"Most universities are cesspools","post_message":"Amazing. ISIS recruiters are infiltrating our schools as teachers, now?"},{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"651012365080931","commenter_b":"The most Corrupt Woman in the world","commenter_a":"SEE YOU IN PRISON SOON HILLARY = JAIL TIME FOR #YOU !!","post_message":"La decisión que tomemos en cuatro días tendrá un efecto en nuestro país por décadas. hillaryclinton.com/planparavotar  Comparte esto si estás de acuerdo:"}]
