[{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1252390358183610","commenter_b":"He needs to be removed from office before he does something to endanger us all He is mentally unstable","commenter_a":"Why can't trump voters see this? The guy is mentally ill big time. All I ever hear is, he said he would create jobs! So let's put us all in harms way for the \"possibility of a few jobs.\" Just plain nuts! He's not going to create any jobs and if he does it's by being unlawful. 😡","post_message":"This explains a lot..."},{"comment_id":"10154888478529714","commenter_b":"#FuckTrump #FuckPence #MelaniaFirstWhoreOfTheUnitedStates","commenter_a":"Boycott the show!! This is truly getting out of control. Did this occur when OBAMA became President? \"Of Course NOT\"!! The left are outspoken to the point of embarrassing themselves on a platform of defeat. Protesting, Chanting, Revolting won't change anything!! The American people have made a choice, that choice is for change. \"Get over it, get with it\" The Liberals power(s) were overturned, \"what a beautiful thing\" & they don't know how to deal with it!!","post_message":"\"Vice president-elect, I see you walking out but I hope you will hear us.\""},{"comment_id":"475003736018845","commenter_b":"He SHOULD WORRY ABOUT DOING HIS JOB! ALSO, STOP BEING A RACIST @webpagelink","commenter_a":"Thank you Mr President for being the last President w class and dignity. Im very pleased w what youve done thats affected my life these past 7 years. Too bad Congress coukdnt back you more.","post_message":"Extreme voices in the Senate shouldn't stand in the way of a fair hearing for the next Supreme Court nominee. @webpagelink"},{"comment_id":"10154128479435673","commenter_b":"She needs to go. and you can go to....","commenter_a":"Too little too late Jack","post_message":"The decision not to seek prosecution of Hillary Clinton is plain wrong. I have joined several of my colleagues to do something about it."},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."}]
