[{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"1719965091608675","commenter_b":"Newt Gingrich said on Fox News last night that it is not we the people who picks who runs for president! Now that is one right out lie! It's like our government makes the rules up has they go! Hillary Clinton gets away with right out murder and Breaking the laws. But Donald Trump can't be our president because they know that all of there Dirty Work will come out for all of us to know and that is what they are scared of . Obama did not get enough delicates but they let him run for president and they new that there was a lot of people who where not for Obama. They just was scared of what the Black people would do if he was not picked to run for president. Well you better be scared of all of us people that is fead up with our government ...","commenter_a":"I do love Newt. stay the course Trump.","post_message":"\"Newt Gingrich on ‘Anti-Trump’ Republicans: Should Form Lost Republicans for Hillary.\""},{"comment_id":"10154361925736336","commenter_b":"@username Post the video of your interview with Dr. Jasser!","commenter_a":"Thank you President Obama for speaking up on this issue. It's sad that this event had to happen during Ramadan. Something needs to be done about assault rifles now!","post_message":"“We know enough to say that this was an act of terror and an act of hate.”   Moments ago, President Barack Obama addressed the city of Orlando facing the tragedy of the deadliest shooting in modern U.S. history."},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."},{"comment_id":"10154698586269641","commenter_b":"Or avoid stealing from worker or outsider, as well as free up labor to provide a cleaner environment","commenter_a":"What they're doing is phasing out people so they don't have to pay $15/hr wages.","post_message":"McDonald's is getting fancy - the chain is rolling out self-order kiosks, mobile pay options, and even table service"},{"comment_id":"10153367458031509","commenter_b":"Um you point would be? did you see how america used none violence to change the political system. If Muslims want to be seen as peaceful why did the Arab spring destroy Syria. 9 million Syrians fled the nation against 150 thousand soldiers. they could have easily walked over them and elected a new government. NOPE because they want to come to the west have our system but them implement the flaws of theirs onto ours.","commenter_a":"dont include or blame millions of people for the actions of a handful of nut jobs. learn your history. it wasnt that long ago that some here in the USA were castrating, beheading and burning people because they were simply black. go back a little further and there were once approx 100,000 native americans in california. three years after the gold rush and the land grab occurred, the bounties on their heads (men women and children) our ancestors murdered so many natives that only approx 30 thousand remained. so the next time you wish to include all muslims into the actions of a few...","post_message":"In planning this week's summit on combating violent extremists, The White House has consistently avoided naming Islamic extremism as its central focus. But some terrorism experts say the threat from Muslim-aligned radicals should be addressed directly: @webpagelink"},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."}]
