[{"comment_id":"1719965091608675","commenter_b":"Newt Gingrich said on Fox News last night that it is not we the people who picks who runs for president! Now that is one right out lie! It's like our government makes the rules up has they go! Hillary Clinton gets away with right out murder and Breaking the laws. But Donald Trump can't be our president because they know that all of there Dirty Work will come out for all of us to know and that is what they are scared of . Obama did not get enough delicates but they let him run for president and they new that there was a lot of people who where not for Obama. They just was scared of what the Black people would do if he was not picked to run for president. Well you better be scared of all of us people that is fead up with our government ...","commenter_a":"I do love Newt. stay the course Trump.","post_message":"\"Newt Gingrich on ‘Anti-Trump’ Republicans: Should Form Lost Republicans for Hillary.\""},{"comment_id":"1172756092797846","commenter_b":"Shame shame shame","commenter_a":"Why?","post_message":"What do you think of the decision?"},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."},{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"1288527907860500","commenter_b":"Melissa these manhating proabort feminists don't get the concept of responsibility","commenter_a":"As early as 9 weeks the baby in the womb has all the same organs as you and I but in an earlier stage of development. He/she has a head, ears, nose, eyes, arms, legs, heart, brain, lungs. So tiny and so beautiful. Denying his/her humanity is denying science. Denying a human being his/her rights is against a concept of civilized society.","post_message":"Isn't life precious?"},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."}]
