[{"comment_id":"1140950715967044","commenter_b":"Lying two faced cutthroat hag.","commenter_a":"If mouth is open lies are being told.","post_message":"BOOM! Coal Miner Calls Out Hillary to Her FACE! Watch her try to \"umm umm babble babble\" a way out of it VIDEO  The entitled hag gets slapped with karma! WATCH!"},{"comment_id":"992882130761178","commenter_b":"#__ #__ #StopYazidiGenocide #StandforYazidiWomen","commenter_a":"@username: .","post_message":"A behind-the-scenes look at a historic night. hrc.io/269ym4J"},{"comment_id":"10157067954080354","commenter_b":"FEMINISTS ARE THE NEW NAZIS.","commenter_a":"Where I work at, women who do the same job, get the same pay! It was even like that at my last job! Corporations cannot discriminate based on sex or they will face lawsuits! Feminists are always pushing the lie that women don't get paid the same! I've seen it first hand that it is just a LIE!","post_message":"\"It would be nice to be able to have a more complex conversation and to be able to look at it more than just a quota or numbers.”"},{"comment_id":"10153028815641336","commenter_b":"Netanyahu is a coward he's trying he's best coz he's scared of Iran","commenter_a":"I don't know what history books Obama has been reading but it would do him good to listen to this leader of the free world for America as we know it will disappear from us and our future....","post_message":"Today, Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו will make his case to Congress – and the American people – for why a pending nuclear agreement with Iran would risk his country’s security.  Tune in to Fox News Channel at 11:00a ET for live coverage of Netanyahu’s speech."},{"comment_id":"1042887679092881","commenter_b":"Democraps Are The Cronies....","commenter_a":"What bunch of pussys, liberal Socialist progressive cry babies","post_message":"Democrats are staging a sit-in for gun control measures on the House floor, led by Congressman John Lewis. Congressman Beto O'Rourke is streaming the sit-in from the floor @webpagelink"},{"comment_id":"469971939860053","commenter_b":"look its him the bitch","commenter_a":"No way Michelle we have the right. Guns don't look for people to shoot look and see who are the vandals and thieves that are doing the shooting killing their own people","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."}]
