[{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":" person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.\""},{"comment_id":"10156418277360354","commenter_b":"Hey Rhonda! Cool last name!","commenter_a":"Which is exactly why Obama wants our guns...So we CAN'T take them out.","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"1130198083720905","commenter_b":"Thank you! This woman is a fraud! #imwithher","commenter_a":"\"but while I enjoy my privilege to be shielded from most of the republicans' bullshit ideas, I'll hang around because I want to feel important\"","post_message":"\"I feel most horrible about a voting system that says: Here are two deadly choices, now pick your weapon of self-destruction,\" says Green Party candidate Jill Stein."},{"comment_id":"10153455879676350","commenter_b":"Yeah a good dad would have married her","commenter_a":"Give it up. There are lots of dads out there that do the same","post_message":"\"In my stupid and exhausted brain, I thought only mothers should be that calm with a brand new baby, but it took only minutes of watching Carson with Jack and I knew...he was meant to do this.\"  Read Siri's sweet words about Carson Daly."},{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: \"If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.\""}]
