[{"comment_id":"10153008527037894","commenter_b":"Women can preach, but I don't feel like doing bible study to prove it.","commenter_a":"I thought the bible said that women weren't allowed to preach...","post_message":"Watch: Distraught ‘Christian’ Lady Loses Her Everlasting Mind Over Marriage Equality [Video]"},{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."},{"comment_id":"10153821104831336","commenter_b":"@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"624113881076675","commenter_b":"He's a freaking idiot!! Hitler reincarnated!! Good on Miley","commenter_a":"No, obama acts like that, lol","post_message":"Miley Cyrus is not a Donald J. Trump fan."},{"comment_id":"10156599267875354","commenter_b":"She had him boxed. I think maybe she used to play college basketball. lol","commenter_a":"Did someone get schlonged?","post_message":"You have to WATCH it..."}]
