[{"comment_id":"10158383797715093","commenter_b":"what do we care? get the wall built!","commenter_a":"I BET THE PEOPLE WHO LEAKED WERE DEMOCRATS","post_message":"\"It time for the constitutional system to work. It time for the legislative branch to investigate the executive. Simply put, it time for the truth.\""},{"comment_id":"901805833201774","commenter_b":"Clown in a wig . She makes me sick","commenter_a":"Better to resign before the s--- hits the fan.","post_message":"Why did Democrat Congresswoman Corrine Brown pay the Chinese embassy?"},{"comment_id":"10153618174361051","commenter_b":"America will pay. Cheaper to build wall than to keep paying for the illegals.","commenter_a":"There will only be a wall if the Donald pays for it,because Mexico says they will NOT pay for any wall!","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"},{"comment_id":"479633975574097","commenter_b":"Every time she opens her mouth ... ........I smell !","commenter_a":"BUSTED! What's done in the dark will get exposed to the light!","post_message":"Hillary Clinton has previously claimed that she and Bill Clinton were “dead broke” when he left the White House, but the two have since amassed millions of dollars in wealth."},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"10153097192830090","commenter_b":"No! Don't bring the here we got enough idiots here already","commenter_a":"Move the Capital to Texas, will get it fixed.","post_message":"Since Obama can't provide real \"change,\" we're doing it for him.  Share what our Republican-led Congress must fix in Washington: @webpagelink"}]
