[{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in \"check\" and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"10154993367323245","commenter_b":"legal immigrants OK ILLEGAL immigrants NOT OK any Qs","commenter_a":"Not an easy job.....People need to stop attacking every thing he says and does.","post_message":"LIVE: Trump press conference"},{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"10158132279970153","commenter_b":"Go Israel .. squatters Go home!!!!","commenter_a":"gy","post_message":"LIVE: Amona settlement evacuation underway in West Bank  READ MORE: @webpagelink"}]
