[{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."},{"comment_id":"10153569786727522","commenter_b":"What do American soldiers have to do with restriction of future immigrants?","commenter_a":"Barbara Bell","post_message":"\"When you question a mother's pain...you are attacking us.\""},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"}]
