[{"comment_id":"10154465654928908","commenter_b":"@username Now you want to talk about owning slaves, I don't know, maybe you do, but it is the year 2016... time for major changes in this world....","commenter_a":"Is this a good thing or a bad thing... killing of new born male chickens is a bad thing, but now genetically creating only females doesn't seem right... maybe people should just quit eating chickens.....","post_message":"Newly developed technology will determine the sex of each fertilized egg before the chick inside develops - enabling the removal of all male-identified eggs from the hatchery. This will eliminate the industry need to heartlessly grind male chicks once hatched"},{"comment_id":"10153781983829062","commenter_b":"Yeah!","commenter_a":"Oscar","post_message":"Heads up Ariana, fans... she's coming back to Texas this summer! Did you see her at the rodeo?"},{"comment_id":"999092436786383","commenter_b":"Somebody needs to go to jail, start with Lois Lerner.","commenter_a":"About fucking time","post_message":"Here at RedState, we’ve already spilled a lot of digital ink covering the IRS scandal."},{"comment_id":"10154892441134312","commenter_b":"Shes hot","commenter_a":"And the mother of the year award goes too...","post_message":"The toddler was found inside suffering from hypothermia and frostbite."},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""}]
