[{"comment_id":"392158754326577","commenter_b":"I hope Trump wins the nomination. Then The Americans will for sure vote for a demokrat, whether it be Hillary or Bernie. No way the Americans are that stupid!!","commenter_a":"Isn't his stand against Muslims prohibitive by the Constitution and therefore automatically eliminates him from presidential nomination?","post_message":"Let’s stop the racism. Let’s stop the xenophobia. Let's stop Trump. #GOPDebate"},{"comment_id":"932180273594983","commenter_b":"So these women thought it would be cute to be \"bad mom's\". It's a sad world we live in.","commenter_a":"Selfish mothers. Women who should not have children.","post_message":"\"No one had communicated that children under six were not allowed in R-rated movies,\" one of the moms said. \"We had breastfeeding moms with infants, one 4 weeks and one 7 months, and they refused them entry.\""},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."},{"comment_id":"1227725310657052","commenter_b":"Please don't reproduce.","commenter_a":"Trump incites violence. He is bringing the racists out in droves and he is dividing this country. Since he came on the scene, there has been more hate crimes than I've ever seen. Wake up people!","post_message":"The sniper attack on Dallas police officers now ranks among the deadliest against U.S. law enforcement since 1900."},{"comment_id":"916971715038985","commenter_b":"No fucking way little Marco is a snowflake greasball whore and the newspaper is a yellow rag. Trumpslide","commenter_a":"Blah blah blah....said all the politicians","post_message":"\"The only way the nominee can win in November is by unifying the GOP and appealing to Democrats and independents,\" the Miami Herald said in a special editorial. \"The best candidate to fill that role is Sen. Marco Rubio.\""},{"comment_id":"10153232684759030","commenter_b":"\"Run, bitch! RUN FOR YA LIFE! GET SOME HELP!\"","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities \"in protest\". Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. \"Be the change that you wish to see in this this world.\" This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance \"to divide Americans by promoting the Black Panthers and her antipolice message.\"  Do you agree?"}]
