[{"comment_id":"10152603189787894","commenter_b":"She's Just NASTY & wants White people to think it's a Race thing","commenter_a":"Nasty bitch","post_message":"Say What Now? Naya Rivera Insists White People Shower More Than 'Ethnics' on 'The View' [Video]"},{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."},{"comment_id":"560732980781661","commenter_b":"GOOD, SHE IS SUCH A RACIST, GET HER OWN SECURITY.","commenter_a":"Good for them let her pay for the security and take a little less pay home...she'll get the message","post_message":"HAHAHA!!! THIS NEEDS 10,000 LIKES!!!"},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"1174959735872779","commenter_b":"They reported that in Oklahoma only Blue Cross/Shield was still in it and that they will be dropping out as well.","commenter_a":"I hope so...","post_message":"It's official!"},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."},{"comment_id":"1202477846449826","commenter_b":"Everyone must have nice hair & a nice outfit. Women have to put in more work Rich Nguyen","commenter_a":"You can pretty much say the same thing about men. If you come to an interview without a snazzy haircut or a fine tailored suit, I can bet that it becomes a disadvantage.","post_message":"Women shouldn't have to wear makeup to succeed at work."}]
