[{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"610314089143994","commenter_b":"How embarrassing for all women! Their class level is as low as Trump's. Is there an emoji of a puking face?!","commenter_a":"LOL. I wouldn't count on them voting for Trump. I doubt they've ever been in a voting booth.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10154973031601509","commenter_b":"yah ! you r big brother of DONAL TRUMP .","commenter_a":"Farage is a racist. And Trump is a racist. Racists love each other.","post_message":"Brexit leader Nigel Farage: Donald J. Trump \"dares to talk about things that other people want to brush under the carpet... For the United Kingdom, I think Trump would better for us than Barack Obama's been.\" @webpagelink"},{"comment_id":"10154034198879749","commenter_b":"And here we have it ladies and gentlemen. You see, when you dare to question one of these social justice creatures and it becomes apparent that absolutely none of their arguments hold up to scrutiny, they start with the personal attacks just like they've been taught. Thank you Tracy, for showing us all just what an utter lack of both argument and character you possess. Why don't you pop off back to Tumblr and tell all your sympathetic sisters how the nasty misogynist was harassing you.","commenter_a":"And if they end up working less hours, and being paid less as a result I'm sure we'll hear all about the sexist \"wage gap\" a little more from the social justice cretins.","post_message":"A Bristol firm allows women to work flexibly at different times of the month to tap into employees' \"natural cycle to create happier working environments.\""},{"comment_id":"10154542886848984","commenter_b":"And Whoopie Goldberg and all those cackling The View women!!! BYE FLEICIA!!! Lol","commenter_a":"Gotta go with Ted on this one, but he left off Kanye West off his list. Maybe when West leaves the country, he'll take the Kardoucheians with him.","post_message":"Rock legend and conservative firebrand Ted Nugent has released his 20 reasons to vote for Donald J. Trump, and they've gone viral. No wonder. Look at what he's saying here.  Finally someone will tell the blunt truth about Trump versus the establishment. You've gotta love this!"}]
