[{"comment_id":"10153682330001037","commenter_b":"She's nuts.","commenter_a":"Just sad","post_message":"“I honestly regret what I have done and take responsibility for it,\" wrote Petra Laszlo in a letter to a Hungarian newspaper."},{"comment_id":"1713306218956490","commenter_b":"Way to go. Ivanic","commenter_a":"If any women want an equal chance in any profession, then Donald Trump is their man for President. He has given women great opportunities in his businesses. He will create many jobs for all Americans","post_message":"Wow, great response!  Ivanka Trump is pure class."},{"comment_id":"10154729418265530","commenter_b":"Shut ur mouth Ried,!","commenter_a":"I guess in political land , it's against the law to investigate corruption and scandals to someone who broke the law , but can't be investigated because it may hinder the election ?? Lots and lots of question marks here ?????????","post_message":"\"Through your partisan actions, you may have broken the law,\" Harry Reid tells FBI Director James Comey: @webpagelink"},{"comment_id":"10153823675392235","commenter_b":"Truth hurts bitches!","commenter_a":"Oh you f****** douchebag liberals have your head so far up your asses if it wasn't for us good white heterosexuals paying all the bills for your lazy asses because you want everything handed to you for free because you believe you're entitled to everything that anyone else has and not willing to work your ass off for it Donald Trump is point on need to shut our f****** borders down. If that's racist then I'm proud to be a racist and stand up for my white skin! You f****** liberals can f*** off and die!!","post_message":"This is truly hilarious."},{"comment_id":"893708487388873","commenter_b":"Barbara can't you see what this Idiot is doing to this country?","commenter_a":"I agree. It makes no difference to me if a Republican or Democrat occupies the White House. This HATRED for this PRESIDENT is appalling. In their HATRED they are destroying America! But they're too ignorant to realize it!!","post_message":"Too true.  Image by Occupy Democrats."},{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance.  This seems WAY too coincidental... Beyonce needs to step up and take responsibility."},{"comment_id":"10152947957269342","commenter_b":"Kill her","commenter_a":"Deviks advocate. There are guidelines for murder. She didn't intend for the baby to die and took it to the hospital So the only real charge would be manslaughter, or murder 2/3 if the baby took unassisted breath which at that gestation isn't likely","post_message":"JUST IN -- Prosecutors say the woman accused of luring an expectant mother to a basement and cutting the baby from her belly will NOT be charged with murder.  FULL STORY ---> @webpagelink"}]
