[{"comment_id":"1676201889329258","commenter_b":"This is old news, these slimy pieces of shit should be behind bars!","commenter_a":"How is that a bombshell...? The whole thing was fishy from the beginning. It's like I fully expect more shit to come out about the Wall Street Bailout...","post_message":"They lied to us anyway."},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."},{"comment_id":"1406386459390310","commenter_b":"OMG this woman is a liar and blowhard","commenter_a":"Does not matter who he picks. Cruz can not win. He will need voters in the general and he has very few of those.","post_message":"This is a big play."},{"comment_id":"1125267834218418","commenter_b":"His old ladies big ass!!","commenter_a":"Oh puleeze.....","post_message":"Obama posted this \"Happy Easter\" pic on Sunday, but it didn't take long before people started noticing 1 enormous problem.  Did he just get caught in a sickening lie? Probably... but decide for yourself."},{"comment_id":"10153030361596636","commenter_b":"y'all feminists need some patriarchy","commenter_a":"Well when it comes to equality between the sexes I can easily say that Sweden is equally retarded and out of touch as Saudi Arabia in regards to the rights of women in society. This whole feminism movement has gone totally out of control here in Sweden and become something like the Catholic church.","post_message":"Maybe it's time we did the same?"},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're \"yucky\"? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1017021978357279","commenter_b":"Her daughter is a whoring little bitch.","commenter_a":"She is a screwball & her daughter is just like her. What is sexy about a big mouth drunk who is an idiot. I don't know any men who think she is hot stuff, they all say she is stupid & loves herself.","post_message":"Sad but true."}]
