[{"comment_id":"10154073349643132","commenter_b":"Piss off you twit and merry Christmas","commenter_a":"Why would you congratulate someone who goes out of their way to shame woman for pre-marital sex yet does it herself?","post_message":"Congratulations are in order for new mama Bristol Palin!"},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"618975741614411","commenter_b":"She's just mad no one wants to grab her pussy","commenter_a":"🙄","post_message":"Can you believe this, folks?"},{"comment_id":"10153334889369369","commenter_b":"Crazy btch","commenter_a":"@username Olivia Salvatore","post_message":"At 3 stories high and 3,000 square feet, this might be America's largest closet.  [\"Secret Lives of the Super Rich\" airs tonight at 10p ET/PT.]"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"\"I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.\" A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"},{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."}]
