[{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"10153336327911770","commenter_b":"She looks like a c#m dumpster.","commenter_a":"Hillary is a liar murder a criminal and mocks them what a shame","post_message":"Hillary Clinton's campaign mocked the Thursday Republican debate, calling it a \"dumpster fire.\""},{"comment_id":"1026595164030198","commenter_b":"what was this brain dead bitch watching????","commenter_a":"A dues paying member of the old hag society.","post_message":"When did Andrea Mitchell become an official spokesperson for Hillary Clinton?"},{"comment_id":"1174388402587813","commenter_b":"Liars!!!!","commenter_a":"Democrats are for war on women, which is not really a war, except in their feeble minds...","post_message":"When the two Bills—Cosby and Clinton—were accused of sexual abuse, the two wives—Camille and Hillary—led the effort to blame the victims."},{"comment_id":"10153406625761130","commenter_b":"What sport are the males allowed in the female locker rooms?","commenter_a":"\"Male journalist arrested for trespassing in women's locker room. Charged with trespassing, unlawful entry and sexual harassment\"","post_message":"\"It's still 2015, right?”"},{"comment_id":"825435090838373","commenter_b":"Low life piece of craps lock her away and throw away the key.","commenter_a":"Sick sick sick! Just beat her senseless for this. That poor innocent little girl. Hopes she rots in hell!","post_message":"This woman allegedly faked cancer to cover up a horrific crime:"}]
