[{"comment_id":"10155029420463690","commenter_b":"Because women are more corrupt than men","commenter_a":"First Brazil female president now Argentina. Jealousy men and women hounding women for things they continue to let men get away with. Same with Imelda and Gloria from the Philipines and current S. Korea, India's Sonia Ghandhi, liberia's grandmother, Pakistan Benezir Bhutto female presidents/PM etc!","post_message":"Cristina Fernandez Kirchner, the former Argentine president, has been charged in a corruption case and slapped with a $630m asset freeze over public tenders awarded to a businessman friend during her administration."},{"comment_id":"10154462240499087","commenter_b":"No, former president Bush didn't listen to the Intelligence Community and he didn't wait for their final report: he ordered them to leave to start his war!!","commenter_a":"It seems funny to me that all you Democrats were screaming with President Bush took the intelligence community advice on \"weapons of mass destruction\"! How quickly we change our minds....but now we are to trust the intelligence community?","post_message":"\"Lesson #1: don’t mess with the intelligence community.\""},{"comment_id":"10156404407160354","commenter_b":"You dumb bitch","commenter_a":"what an idiot!","post_message":"Terrorists just need a hug and a lollipop...."},{"comment_id":"10154177685016943","commenter_b":"Quit talking about it and do something! Put her in jail!","commenter_a":"Enough already with the disclosures. I'd be happy with just one little indictment.","post_message":"Hillary Clinton has taken a beating this month over the discovery that donors to her family charitable foundation received special treatment from the State Department when Clinton was secretary of state. And she unlikely to get a reprieve before Election Day, as the organization behind those email disclosures expects several more headline-grabbing document dumps in the next 11 weeks. - via Newsweek"},{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"10156346030730725","commenter_b":"@username We know you're illegal, Pack your bags buddy you're getting deported!!","commenter_a":"We love you here in South Carolina Mr Trump! #MAKEAMERICAGREATAGAIN #TRUMP2016","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"10154350131948145","commenter_b":"Yeah they'll definitely be jailed, they can track everything now","commenter_a":"@username, yep another one. Unbelievable!","post_message":"Hopefully they got to it before identity thieves did."}]
