[{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"10153162579468908","commenter_b":"Unfortunately A LOT of people fall into this category. Sex is everywhere and to too many it is everything.","commenter_a":"When sex rules your life you have zero power and nothing to contribute to society. No better than an addict. No power No control over your own life. Puppet. Set yourself free.","post_message":"Something we should all consider when it comes to porn.."},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"10153809270614454","commenter_b":"Hurrah! Hurrah! Hurrah!!!","commenter_a":"Couldn't happen soon enough. Long overdue .","post_message":"ICYMI: This week, Hong Kong pledged to ban the import and export of Ivory goods. #SaveElephants"}]
