[{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"1949462081947777","commenter_b":"Stupid bitch !!!!","commenter_a":"Just think, if Hillary wins, this stupidity will not only increase, but will be further validated by the government.","post_message":"This is what it has come to..."},{"comment_id":"857891860915718","commenter_b":"They need more time to assimilate into our culture,not us to theirs...This is America...illegals should not have a louder voice than our country's citizen,or if they are here legally they need to learn the laws of our land and quit trying to change the American way or American dream to suit their expectations.","commenter_a":"I recommend going back to a country where freedom of speech is not something you have to concern yourself with. Otherwise, deal with it. Freedom of speech means you don't get to dictate consequences just because you don't like it...","post_message":"What do you think about this?"},{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"10153635543308132","commenter_b":"Yes...I'd bury my chin in her and set up camp!!!","commenter_a":"I love skinny (healthy) women. It's kind of silly to be that jealous of them. @username have all of their 40's n 50's to get 'thicker'.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"}]
