[{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."},{"comment_id":"10154963463661320","commenter_b":"Prayers yes! How about the right time defend themselves with firearms?????","commenter_a":"Praying for peace once again. Sorry for all the victims and their families.","post_message":"The people of Berlin are in our thoughts after today's deadly truck attack at a Christmas market."},{"comment_id":"10152733465191051","commenter_b":"Karma is a ×itch!","commenter_a":"What goes around, come around. Can't feel sorry for a woman who screwed up her own life, and took it out of a child.","post_message":"A woman who killed her daughter and never served any jail time for it has just been found dead."},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"}]
