[{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10152736026831051","commenter_b":"Liberal logic - Ban guns because you can call the police but the Police are Militant racists that can't be trusted so who are we supposed to call again? Ban all guns in the U.S. it will make us safer but keep the borders open so when the black market opens the guns can flow in like water. On an ending note; Police are in no way obligated to protect you from any threat per the Supreme Court so I guess when they do show up they can draw that chalk outline around your fresh corpse.","commenter_a":"Blah blah blah bullshit bullshit bullshit out of all the diehard ammosexual blowhards who love their guns. Europe doesn't have the problems we have in the country with guns. Neither does Canada or Australia. You want to believe what you want to believe. Follow the money. It's the NRA who wants you to keep your guns and fills your head with nonsense that you're just too willing to believe because you have no balls and tiny dicks. Try thinking about things instead of just buying into the rhetoric. The USA is safer now than at any other time in history. Why do you need them? Why focus on fairy tales like imagined revolutions against the government instead of focusing on things that are ACTUALLY happening like kids being killed in schools by LEGALLY OWNED GUNS.","post_message":"A company that worked on ‘Taken 3’ with Liam Neeson didn’t take kindly to his comments about the U.S."},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it!  #WSHH"},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"10153616192149342","commenter_b":"I can count the ppl, I can really count on on 1 hand.... With fingers to spare for a hot chick!","commenter_a":"Some of your \"real friends\" don't either. js","post_message":"How's your Facebook friend list?  #abc13"}]
