[{"comment_id":"10152594464675927","commenter_b":"Go F♤♤K yourself Hussein, and that thing you call a wife !","commenter_a":"speaking OF \" ignorant\"...","post_message":"You should NEVER apologize for being a proud American.  NEVER."},{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"},{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"\"It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...\"  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."},{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"},{"comment_id":"10152748268571491","commenter_b":"No","commenter_a":"Ok ill tryit..... When will the coffee maddness end????","post_message":"If you’re still hungry after your meal."},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."}]
