[{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"905085592863011","commenter_b":"I got 8 right","commenter_a":"Yes","post_message":"Let us know how well you do!"},{"comment_id":"10153677657398132","commenter_b":"She to good for him it's time she finds a real man","commenter_a":"More like scott dick sack !","post_message":"\"They urge her to never take him back.\""},{"comment_id":"1163050380483299","commenter_b":"@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"667207133381416","commenter_b":"She should be fired!!","commenter_a":"Should absolutely be fired!!! This is a prime example of how sad our society is!!!","post_message":"VA Manager Thinks Veteran Suicide Is Funny, Here is Her INFURIATING Email Read more at @webpagelink"},{"comment_id":"10153725058711178","commenter_b":"The tea party is NOT a criminal organization. Black lives matter IS a hate groups.","commenter_a":"There wouldn't be a black lives matter movement, if police brutality didn't exist.","post_message":"Is there a double standard in the media for the Tea Party and Black Lives Matter?"},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""}]
