[{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"824413534273149","commenter_b":"She should point those racist fingers back at self!","commenter_a":"Do you really expect anything else from her? I'm not shocked at all. She's an idiot.","post_message":"This speech is shocking... even for her!  What Michelle says at this graduation ceremony will make you cringe!"},{"comment_id":"1201018046605718","commenter_b":"Why should I support someone who's two faced and and is only changing her opinion because her PR person told her to","commenter_a":"#freekesha....sexual assault is nothing to start arguments over ...she needs all the support she can get....as a survivor, I'm with you....#standtogether!","post_message":"We can all use our voices and platforms too."},{"comment_id":"1026093827483671","commenter_b":"Build big beautiful wall and put it inside Trump's Ass.","commenter_a":"Good idea!!!","post_message":"They recognize the danger that Trump poses to our nation."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"10153089105414753","commenter_b":"I had twin daughters at 18, me and their mother had been married over a year when she got pregnant. My daughters have NEVER been abused, so yes teens can be good parents. This is a fucking offending question","commenter_a":"A lot of adults do the same to. Their children and i was a teen parent without any help and my children are fine and i am married now so it had nothing to do with him being young","post_message":"Should teens be allowed to have babies? What do you think should happen to this 19-year-old father? @webpagelink"},{"comment_id":"1823991571155225","commenter_b":"Wrong.","commenter_a":"Obama and the Democrats rescued the country from the worst economic disaster in our lifetime, while being obstructed at every turn by the very same Republicans who created the financial disaster.","post_message":"President Obama's Legacy?"}]
