[{"comment_id":"10153047000946336","commenter_b":"Send her to Iraq for a month.","commenter_a":"Yeah, that'll piss ya off !","post_message":"A social worker at an Indianapolis VA clinic was disciplined earlier this year after sending emails to colleagues that contained photos of an elf figurine posed to mock the mental health problems of combat veterans."},{"comment_id":"500239630100631","commenter_b":"Hopefully that little girl will hold a pillow over grandma bitches head later that night! Mean old bitch!","commenter_a":"What kind of monster does this ? I would kill the son of a bitch. Rot in hell !!!!","post_message":"This was too heartbreaking to watch all the way through. What kind of animal does this to a little child?"},{"comment_id":"10157246765295294","commenter_b":"Deport this piece of crap!","commenter_a":"He can be charge with a misdemeanor for starting a fire with out a permit","post_message":"An expression of free speech? Or a crime? That's the debate sparked by this man's arrest."},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"10158014853220594","commenter_b":"Mariah Neu and @username. You both say the state of Illinois has lax gun control. In the city of Chicago, not the state of Illinois gun crime very high and so is gun control. Now to my point about Chicago and how gun control affects crime. It is stated that affectguns are imported into the city and these guns are used in the crime. If close carry by law abidi ng citizens was allowed in the city then law abiding could and would protect themselves. It should be of no surprise to anyone that a thug will not follow the gun law, but common citizens will. Gun control laws don't stop crime they just reduce the law abiding citizens ability to protect themselves. You folks use data about the state of Illinois, that has nothing to do with this discussion. Do a comparison of the city of Chicago and the ...","commenter_a":"As is often the case Oreily misses the point, the elites left are the the white spremest. The left just plain want control of all our lives. Taking all freedoms starting with gun ownership","post_message":"The Fox News anchor drew criticism after he said liberals' call to abolish the Electoral College is \"all about race.\""},{"comment_id":"10154355156798812","commenter_b":"Yea these are the very perverted people that will claim to be transgender to gain access into bathrooms...","commenter_a":"The list of perverts who video people in bathrooms is long and does not just stop at Target! My local Old Navy had a perv filming a young girl while she was in a dressing room--her mother caught him in the act. These are not transgenders. These are simply perverted people! I am safer in a restroom with a transgender than I am with \"straight\" people! Transgenders are NOT peeping toms! If men dressing as women and claiming they are transgendered to assault little girls in bathrooms, then maybe there needs to be an anti-creepy men bill, not anti-LGBT bills, targeting Transgenders.","post_message":"Protesters inside North Carolina's statehouse staged symbolic sit-ins outside the offices of top legislative leaders."},{"comment_id":"10154111775125779","commenter_b":"Haha She landed Russell Wilson, she isn't going anywhere.","commenter_a":"We all know how this is going to end - she's going to go back to the Future.","post_message":"Ciara dropped her $15 million defamation suit against her ex-fiancé Future Friday, a year after the singer first accused the rapper of slander."}]
