[{"comment_id":"10152777705324877","commenter_b":"not true.","commenter_a":"True. And she knows and will continue to go along with... People like them are ALL ABOUT money, and will do ANYTHING to keep it coming in their accounts!","post_message":"Mike Huckabee: Jay Z Is Crossing The Line Of Husband To Pimp. Read more of the conservative's tirade on Beyonce and Jay Z.   Grio fam, read his words and sound off with your thoughts."},{"comment_id":"1440691939283888","commenter_b":"Your point Is right. This woman shouldn't have so many children if she's can't even provide them basic needs for them... oh wait... we the tax payers do that for her!","commenter_a":"I think what Eddie did was fantastic and shows what a caring heart he has. On that note, hell, if it worked for her might as well try. I'm a single mom of a 12 year old. His dad passed several years ago. I'm a veteran of the US Navy and served during Operation Iraqi Freedom. I'm a teacher that works hard for all I have, and I have thousands in student loan debt (like many other college graduates). Would anyone like to give me free money so I can spoil my son with all the latest technological gadgets? *please, before you comment about how I'm greedy, be happy for this woman. I am happy for her and I don't actually expect to receive, nor do I want any money from anyone. It just seems that this story is a \"feel sorry for me\" bit. We all have our hardships, ...","post_message":"Down on her luck, facing eviction with six children hopeful for gifts during the holidays, Tyshika Britten turned to Craigslist for help, and found it with a $10,000 donation from Pearl Jam's Eddie Vedder.  >>@webpagelink"},{"comment_id":"689620071188876","commenter_b":"Then they should Cancel the game until they show some respect for the USA","commenter_a":"I'm done with the NFL!","post_message":"This whole NFL squad will join Kaepernick in protesting the National Anthem on Sunday."},{"comment_id":"1134932883194388","commenter_b":"down, look at the squares on the sides","commenter_a":"I think up it is hard to say!!","post_message":"o.O"},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153355011548984","commenter_b":"That mayor is an idiot.","commenter_a":"So what would you call someone who would break out the windows of someone elses property or burn someone elses businesses or homes?","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"10155862004711038","commenter_b":"That is impossible. Teenage girls take up the entire bathroom so you can't share it with them.","commenter_a":"Yeah, teenage boys are gross...but have you ever shared a bathroom with a teenage girl? It's fucking nasty.","post_message":"You love him, of course, but COME ON."}]
