[{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."},{"comment_id":"1014969508525839","commenter_b":"It only matter what the FBI thinks about the emails. It's obvious when obama's FBI investigates it's something serious.","commenter_a":"Socialist nut job or a lying criminal oh the options we have.","post_message":"This is the surprise moment from the #DemDebates everyone will be talking about tomorrow."},{"comment_id":"10154475090187098","commenter_b":"Let's nuke 'em now !","commenter_a":"Can we drop some nukes on them already? What's taking so long?","post_message":"MISSILE TEST: North Korea reportedly fired a ballistic missile in what would be its first such test of the year and an implicit challenge to President Donald Trump new administration."},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"10155779626265725","commenter_b":"@username here @webpagelink","commenter_a":"It's Sad How there's many Mexican's in these comments saying they will vote for Donald Trump. Maybe because some of you don't know the struggle of coming to the United States & been judge just because we want a better life. Donald Trump NOT FOR PRESIDENT. smh","post_message":"Jorge Ramos- Please send me your new number, your old one’s not working. Sincerely, Donald J. Trump"},{"comment_id":"931527210240361","commenter_b":"and why do women wear make-up? Hmmmm . . . .","commenter_a":"What a gent.... NOT!!","post_message":"Look on the face of woman as Lewis Hamilton sprays champagne in her face says it all."}]
