[{"comment_id":"10154034711816770","commenter_b":"You know damn well its the ladies who wizz all over the seat when they do their \"hover\"","commenter_a":"Tired of people thinking they can change the law because they are a part of a small percent of people married to same sex. It's bad enough we have men in a dress pissing all over the toilets in the ladies room.. Being gay shouldn't give you special entitlement.","post_message":"The Supreme Court of Arkansas ruled late this week that LGBT persons who are married to a child’s birth parent but not biologically related to the child do not have a constitutional right to be listed on the child’s birth certificate."},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"1411515005587074","commenter_b":"@username yes you are bitch","commenter_a":"Thank God he is back. Just feel better knowing he is in the USA.","post_message":"Welcome back, President Obama!"},{"comment_id":"1710894845846679","commenter_b":"somebody please...slap this bitch!!!","commenter_a":"This is interesting as the Black and Hispanic communities are some of the most \"Biblically religious\" communities in this country!","post_message":"Say what?"},{"comment_id":"1620928861543005","commenter_b":"No one should hit ANYONE. Its assault. Penis or vagina.","commenter_a":"Im confused....she put her hands on him first. This shouldn't even be a thing.","post_message":"This football star was filmed punching a woman in the face. He's still allowed to play."},{"comment_id":"10156714822180354","commenter_b":"I'm with you Francesca ! Beyonce is just trash !","commenter_a":"That was beautiful and classy from Lady Gaga. I will NOT be watching trashy Beyonce.","post_message":"Lady Gaga's performance of the National Anthem at the #SuperBowl lights up social media.  WATCH:"}]
