[{"comment_id":"10153540749847452","commenter_b":"Yousef Danial","commenter_a":"Mariah Morgan Savannah Marshall wtf hahaha","post_message":"A suspect wanted for attempted murder hits multiple cars while trying to escape the California Highway Patrol during a chase on the 91 Freeway in Orange County. abc7.la/1NlhVx9"},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"},{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"},{"comment_id":"1030946370280768","commenter_b":"She's full of pride, disloyalty and all together wicked.","commenter_a":"I don't think she knows how to be honest","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10154080042346336","commenter_b":"I care what anyone says obama was a good president.","commenter_a":"Yep, detention without trial , without legal representation ,without charge has no place in America .","post_message":"“We can try [terrorists] and put them in our maximum security prisons and it works just fine.” – President Barack Obama on closing Guantanamo Bay facility @webpagelink"},{"comment_id":"870445706335391","commenter_b":"Life starts when your born. Read the Bible partically when god breathed into Adams lungs and life started","commenter_a":"Every life matters!! Save the unborn today","post_message":"Tell Congress to protect the unborn!  Click below to urge your Congressman and Senators to cosponsor the Life at Conception Act!"},{"comment_id":"10153735094753701","commenter_b":"As long as he doesn't use it as a photo op","commenter_a":"Molly in case you wondered, he flew in on a plane THEN a helicopter. Lol","post_message":"President Obama is expected to land in Eugene a little before noon and then take a helicopter to Roseburg to meet privately with families of the #UCCShooting victims. He is not planning any public events."}]
