[{"comment_id":"10153772356976323","commenter_b":"Fuck off cocksucking bitch","commenter_a":"There is no climate crisis. It is a hoax of liberal desperation. There is however CYCLICAL climate changes.","post_message":"The fate of 70 million people rests on what happens to the Mekong river. Featuring extraordinary and beautiful drone footage of south-east Asia’s vast waterway, this important piece meets people struggling to deal with the impacts of climate change."},{"comment_id":"10153216491624877","commenter_b":"I just saw a story about her on the ID channel on Sunday. She's ridiculous and should be ashamed of herself. She actually chose a life of crime over her kids when they were younger. There's nothing cute about what she's doing or has done. She should be locked up.","commenter_a":"She needs to sit her old, thieving behind down somewhere.","post_message":"Notorious jewel thief Doris Payne strikes again. Fresh out of prison, Payne is linked to a missing $33,000 diamond ring. Watch how it unfolded below.  Grio fam, 84 years old and Doris is still doing her. What do you think?"},{"comment_id":"10154725067651341","commenter_b":"Now I wonder which side is truly the terrorist nation","commenter_a":"\"Netanyahu Warned New Zealand It Was Declaring War\" - what, by adhering to international law which was administered to PREVENT war?? Repeatedly violating resolutions and stealing land on some warped justification of ancestors IS a declaration of war!!! Thanks Israel for finally showing your true colours to those who remained unsuspected and blind to your callous actions.","post_message":"EXCLUSIVE: New details on Israel's last-ditch scramble to stop the UN settlements vote"},{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."},{"comment_id":"10157276340925354","commenter_b":"Round up every muslim ship them home unless they are legal immigrants that speak english and have a job and no ties to isis otherwise build a wall shoot everyone of them that comes into the u s","commenter_a":"Vote Billary or Bernie for more lies, deceit, corruption,treason, gun control, Homophobia under Islam and 4 more years of obama. Almost forgot no more Country Girls having fun in the water. Cowboys, Liquor Stores, Smoking Marijuana are next. NOTE: Comments protected under the 1st Amendment.","post_message":"VIDEO:"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"10154420026498984","commenter_b":"If the white house puts up another fence to keep people of its lawn then its only fitting to build a wall to keep people from coming into the country","commenter_a":"I grew up 30 miles from the border of Mexico. You need to be there to understand. Most Americans are clueless about the Southwest.","post_message":"This was NOT what the journalist expected...  Do you think America needs a president with a tough immigration stance?"}]
