[{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"1905080359721745","commenter_b":"I. Bet money the daughter started it and got in her feelings when white girl wasn't going for the bullshit.","commenter_a":"But yet where were you at when your monkey was jumping around and disrespecting people.","post_message":"Used that right hand like a weapon!  #WSHH #Fight"},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."},{"comment_id":"1184326411634277","commenter_b":"Yup they deserve to go home and shouldn't think twice before shooting and it should be shoot to kill do the crime expect to pay the price I don't care what color your skin is point a gun at a cop expect to eat lead","commenter_a":"If you point a gun at anyone, expect to get shot.","post_message":"Do you agree?"},{"comment_id":"1765071860379740","commenter_b":"damn elizabeth coming out swinging","commenter_a":"That was EXACTLY what happened to another person that was supposed to be deposed and speak out against the Clintons years ago, and was found three days later by the FBI after the guy missed his deposition:-(","post_message":"Do you think the Clinton's were involved in his death?"},{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in \"Spring Break\"..."}]
