[{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"},{"comment_id":"476505799211632","commenter_b":"What an Idiot... Just Deport this Idiot out of here NOW!!!!!","commenter_a":"\"Faith Derangement Disorder\" or FDD is a Liberal description of Christianity I became acquainted with during Obama's presidency. The honorable definition of holy matrimony and any public expression of Christianity was outlawed and was destroyed during Obama's presidency. The enemies of the western world and Christianity, worldwide, are emboldened and murdering Christianity. It is Obama's use of Liberal leadership in the US and his lack of leadership outside the US that is directly responsible for Trump and the Trump movement. No one else should be held responsible for the violence worthy, deep, fundamental, divide Obama has created.","post_message":"Tommy DiMassimo, the man who was tackled by Secret Service trying to rush the stage at a Trump rally, told CNN he did it because \"Donald J. Trump is a bully.\""},{"comment_id":"10153442882309087","commenter_b":"@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,\" Speaker Paul Ryan said. \"That’s the kind of reaction I had when those occurred.”"},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT \"EACH AND EVERY MUSLIM\" THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON\"T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"10155027837294411","commenter_b":"I am trying to learn you that you can't blame a whole religion on the wrongdoing of one person.. It's like blaming denmark for a crime a danish man did in Spain... And you are still rude and can't spell.. Please go back to school and learn english and grammar... And maby move to an island with all your other nazi racist friends...","commenter_a":"What??? In most of europe these markets has nothing to do with christianity, but with shopping... Stop trying to divide people based on religion... We all know how you hate muslims now... And maby you should think that the western world, and Russia is bombing and killing the shit out of the middle east... Could be a reason for the hate you know...","post_message":"'A Christmas market which is a Christian symbol is a classic target for Islamic jihadists' (Op-Edge)"},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."}]
