[{"comment_id":"1262067313806885","commenter_b":"@username ...You are a very smart Lady... 100% correct","commenter_a":"Chris Christie is a bully like Trump. Senator Marco Rubio owned him, Rubio was just trying to get across the truth about what Obama has been doing all along. Is Rubio perfect, NO, but show me one politician who is please. As for his youth, remember John F. Kennedy anyone?","post_message":"The pundits expected a pile-on at the #GOPDebate Saturday night, but Chris Christie was relentless in his attempt to take down Marco Rubio."},{"comment_id":"639833176157924","commenter_b":"Data and meta intelligence gathering of phone and internet data has NOT in any way shape or form been Stopped. Theres just been several bills past so that its now need to know disclosed. And America has had the uk parliament put these same laws here. So that from a judge is a downright lie. Also almost every american these days became that way from imigrants. Infact at one point more than half of Scotlands population emigrated to the Usa. To try and scare monger over a handfull of idiots that went mental over the several million who are helping the united states in the military, your hospitals , your restaurants etc. Its just cringeworthy and shamefull. And defending your self is one thing no one would want you to not do. No one wants harm on anyone. But more guns will only mean more dangers and more tragic and ...","commenter_a":"Opening statement? To what!? It'll soon be 2016. How long will you continue to spew this inflammatory propaganda?","post_message":"\"Number one: Get a gun.  Buy one legally.  Learn how to shoot.  And be primed to use it.\"  Last night on \"Justice,\" Judge Jeanine Pirro shared her plan for \"surviving\" in the wake of the #SanBernardino terror attack. @webpagelink"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"1616274731928330","commenter_b":"Did you see where in California they are registering Illagals to vote, guess who they will vote for?","commenter_a":"Obama distracts us while he slips his executive orders by us with out much attention. Democrats weren't for gay and lesbian or transgender rights until Hillary needed more votes. Last election Hillary ran in, she is on video saying marriage is between a man and woman. She flip flopped and so did the party for more votes.","post_message":"Hey, Leftists: you want to stand up for LGBT folks? How about joining conservatives in speaking forcefully and honestly about the MURDER of gays and lesbians by MUSLIM terrorists inflicting SHARIA LAW?  Oh...that's right, Obama doesn't allow you to talk about that. So instead you \"boldly\" focus on men using women's changing rooms and bathrooms and ignore the DEATHS of hundreds of gays and lesbians, because identifying their killers would require you to utter the words \"Islamic terrorists.\"  Gee, how \"noble\" of you, how \"brave.\"  #phonies #poseurs"},{"comment_id":"10154068476123717","commenter_b":"The tea party and Republican Party are two separate entities","commenter_a":"That's because Hillary best represents the ideals of Reagan-era Republican Party. Trump represents the modern-day teabagger nutjob Republican Party. All the corruption and lies of the former with half the brain cells.","post_message":"It may surprise you, but George Bush Sr. knows who he is voting for come November, according to a Kennedy: @webpagelink"}]
