[{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"10154612435337042","commenter_b":"For this comment I sincerely hope you choke on the next dick you suck. LMAO","commenter_a":"There's 83,000 Syrians and BLM thugs available.","post_message":"It's almost the holiday season -- and Macy's is hiring 83,000 seasonal employees.  Here's how you can apply:"},{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"10153535797471336","commenter_b":"That's because they have a thug for a governor ..A Hood Rat..","commenter_a":"It's pretty obvious why there is so much crime in Baltimore. The cops are afraid to do their jobs! I'm surprised most cops haven't left Baltimore!","post_message":"Ten federal agents will work with Baltimore's homicide detectives in the latest bid to curb a surge in violent crime."}]
