[{"comment_id":"10154899725050329","commenter_b":"All of those children have worked since before they were 16. A simple Google search would have told you that. I love how everyone assumes shit like this.","commenter_a":"I bet Ivanka or Donal Jr never humbled them selves like Sasha. It's obviously not about the money but about her learning the definition of hard work. @username Santiago Wolf @username","post_message":"\"You ain't lying around my house all summer.\" —FLOTUS"},{"comment_id":"1136767329692020","commenter_b":"Poor Bill has to wake up next to this. OMG no wonder he did Monica.","commenter_a":"Sorry had to leave, Now back To the Butcher of Benghazi Karma Hillary Clinton","post_message":"Hillary, EXPOSED!!"},{"comment_id":"864626500338540","commenter_b":"God says we must forgive the ones who ask forgiveness. We all make mistakes nobody is perfect. Mr Trump for you to come forward God sees and forgives you! I pray that everyone sees and not to judge it was very wrong what Mr Trump said. God sees his heart remember Saul who did horrible things. God forgiven him and turned him into Paul! Pray for America that our country changes for the better. Pray for our new President that he is on the right path makes the right decisions! We must pray for Mr Trump to show the women that he will help them in every way! For our children to have God back into schools no more hate but love one another in Jesus name!","commenter_a":"Who believes her empty words?","post_message":"On Donald J. Trump's campaign website, Melania Trump released a statement addressing her husband's controversial comments from 2005."},{"comment_id":"10154055005061167","commenter_b":"Oh God! !!! really this happened! What a nasty Woman!","commenter_a":"Artistry, get a clue humans.","post_message":"Beyoncé and JAY Z appeared with Hillary Clinton -- and Fox News completely lost it."},{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"863999693637372","commenter_b":"first lady has no class what so ever id be embarrased sitting next to them","commenter_a":"michelle has the class of fergusson protesters","post_message":"“Michelle Obama looks like she’s part of the cast of...\""},{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."}]
