[{"comment_id":"10154035210569024","commenter_b":"Tap her phone - stop her from murdering people","commenter_a":"Well police next time you see this lard ass limo cross the line pull it over and ticket HER. She is an EX Senators EX dept of state she has NO PROTECTION rights from being stopped and charged.","post_message":"“AFTER SPENDING A ENTIRE YEAR COURTING BLACK LIVES MATTER…”"},{"comment_id":"10153113232077093","commenter_b":"Drum Corps have endured worse sweetie, you're giving us band nerds a bad image, we are not weak...","commenter_a":"She got a bruise you can get that walking into a counter at home. She still continued to perform after. It was accident. My generation because I'm 20 is so weak it's pitiful. I was always told to get back up if it's not broken or bleeding. I played football with a concussion and a separated shoulder. So a bruise is easy to deal with.","post_message":"The father of a high school band member who was hit after one school’s football team crashed the half-time show says his daughter is still in pain...  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"829690333773863","commenter_b":"The black community needs to clean up their act, plain and simple.","commenter_a":"This type of person should not be free.","post_message":""},{"comment_id":"861219497357519","commenter_b":"Natalie, that is wrong. His opinion absolutely matters. Knock it off. Francisco, if you want to discuss this rationally, you'll have to like my comments so I know you've replied, no notification on a public post for me. Don't worry about the trolls. If you wish to have an objective conversation, I'm game.","commenter_a":"Chanting that you are going to make America great again is pathetic it's not the leader that makes America great it's the people that's why the revolution war was fought this country will always be a country of immigrants from all over the and we are who make America great not a \"leader\" in search for power claiming that he will make America great","post_message":"MAKE AMERICA GREAT AGAIN!"},{"comment_id":"951788561528283","commenter_b":"Sociopath with narcissistic delusions of grandeur, infantile anal expulsive ideology and penis envy. The bitch is a mess.","commenter_a":"Is he gonna cwy...poor widdle ting","post_message":"McTurtle can dish it out...but he sure can't take it. SHOCKING!"},{"comment_id":"1248622855149182","commenter_b":"@username not to mention more people have voted for her","commenter_a":"@webpagelink/ Bernie Sanders is SO close to winning the nomination, my fellow Berners! We will have a contested convention in July where both candidates will have the chance to sway the Super delegates. This is excellent news and shows that hard work does pay off. Our political revolution has put the country on the right track to put progressive policies in motion and that means we can have a better future by working together today. Join the movement! #notmeus #berniesanders","post_message":"Will tomorrow be the beginning of the general election? What’s next for Ted Cruz and John Kasich if Donald Trump wins today? What’s next for Bernie Sanders if Hillary Clinton wins today?  Our editor-in-chief Judd Legum and politics editor Aaron Rupar talk about the implications of the Indiana primary."},{"comment_id":"10152961909207894","commenter_b":"Jessica Denise u got the good job, penis all day like that? Well dammmmm","commenter_a":"It was a little 🍆🍆🍆🍆🍆 but I seen it.","post_message":"Woah! LeBron James Accidentally Flashes His Penis on Live Television [Video]"}]
