[{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"},{"comment_id":"10153002903836323","commenter_b":"Aaaw u want him to suck your lil prick?","commenter_a":"Fuckin Jew cock sucker","post_message":"Rupert Murdoch has been strongly criticised after tweeting that “most Muslims” – even if peaceful – must be held responsible for the religion’s “growing jihadist cancer” in the wake of the terror attacks in France."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"1176769975734870","commenter_b":"Hell yes, it's about tyme someone stand up the the World Biggest Bully Obama, You Go Donald Trump.","commenter_a":"Trump is our only way out he is our only Vote we got to stay in touch @ all times","post_message":"Liberals are demanding that Donald J. Trump walk back his rhetoric against President Obama in the wake of the Muslim terror attack in Orlando. Trump isn't going to do that, though... he just doubled down and accused President Obama of TREASON.  This are Trump's most stunning remarks on President Obama yet. Do you agree with what Trump had to say?"},{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."},{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."},{"comment_id":"635245713332674","commenter_b":"Jail her!","commenter_a":"She is corrupt about time she need to come clean.","post_message":"The evidence in the Benghazi controversy just blew up in Hillary's face, it's over.  It's about time. Send her to jail already.  Do you agree Hillary should be arrested?"}]
