[{"comment_id":"978112395570641","commenter_b":"Did all Muslims commit those crimes ?","commenter_a":"It's disrespectful not all Muslims are terrorist or bad people it's in terrible taste it's like me driving around with a plate that says fgirlscouts just cus one gave me the wrong cookies","post_message":"A personalized license plate in Minnesota which read \"FMUSLMS\" has received condemnation from many, including the governor. Read more about how and why it was issued: @webpagelink"},{"comment_id":"10154738183646336","commenter_b":"But who's the hideous woman in the video?","commenter_a":"Well... he's certainly on the right show","post_message":"\"I understand why you're angry. You have every right to be angry – the system has failed you. But he is not the solution.\"  Filmmaker Michael Moore has a message for Donald J. Trump supporters who feel let down by the government. @webpagelink"},{"comment_id":"1585095868182585","commenter_b":"Just go away!","commenter_a":"Isn't mental illness a sad thing?","post_message":"Oh dear god."},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"1801831173397468","commenter_b":"Michelle and Hillary are 2 of the most dishonest people ever!! If Hillary wins then you can tell your daughters and grand d aughters as you watch them being raped by the refugee's , how you are soo happy you voted for this evil..woman .. Get ready for it, with a Hillary win, it will be Sharia Law...","commenter_a":"Want more of THIS, America? Vote Hillary and you just might get it!~ >","post_message":"\"This is a country where a girl like me from the South Side of Chicago whose great great grandfather was a slave can go to the finest universities on Earth. A country where a biracial kid from Hawaii, the son of a single mother, can make it to the White House. A country where the daughter of an orphan can break that highest and hardest glass ceiling and become president of the United States. That is who we are, that is what's possible here in America—but only when we come together, only when we work for it and fight for it.\" —First Lady Michelle Obama today in North Carolina IWillVote.com"},{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."}]
