[{"comment_id":"10153412850346519","commenter_b":"Oh, honey, sweetie, bless your little heart. #Derp #LowInformationVoter #UsefulIdiot","commenter_a":"It's time our tax dollars worked for us instead of the Koch's and their ilk.","post_message":"Free rides are a solution, not a problem..."},{"comment_id":"1739139336348305","commenter_b":"My thoughts are she need to shut up! She belongs being bars!!","commenter_a":"She is a disgrace.","post_message":"\"It's essential that we stop terrorists from getting the tools they need to carry out the attacks and that is especially true when it comes to assault weapons like those used in Orlando and San Bernardino.\" -Hillary Clinton  Weigh in with your thoughts. @webpagelink"},{"comment_id":"10153050931108984","commenter_b":"unbelievable .... if he would not have fought .. they would not have a chance to protest ... arrest them all, through them put of section 8 housing, take their welfare check and foodstamps away .. tye are scum bags of the worst !","commenter_a":"You can't fix culture none of them have served in the armed forces and never worked that's why they have no respect","post_message":"In case you missed it...This is absolutely disgusting. This hero deserves everyone's respect.  Do you support the brave men and women who fight for our freedom?"},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":""},{"comment_id":"10154315697078984","commenter_b":"That whore needs to go to hell","commenter_a":"She DOES NOT HAVE THE AUTHORITY TO DO THIS. ALL WE NEED TO DO IS IGNORE HER. KEEP BUYING IT SHE WILL BE GONE IN 8 MONTHS","post_message":"Michelle Obama has been messing with our children's food for years, but now she's gone to far.  She just banned one of America's favorite cereals, and there's not a darn thing anyone can do about it.  It's time to throw her and her America-hating husband out of the White House for good."},{"comment_id":"1128964310481999","commenter_b":"Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.","commenter_a":"I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...","post_message":"In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a \"Second Bill of Rights\" of an economic nature. They were:  The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education.  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154592077846756","commenter_b":"Good grief. I could pee a puddle deeper than her.","commenter_a":"She will never be first lady.","post_message":"As she readies to address the Republican National Convention Monday night, it's not so clear exactly what kind of first lady Melania Trump would be. But she's left some clues."}]
