[{"comment_id":"1157451387627650","commenter_b":"Another sidetracking trick.","commenter_a":"Ah yeah. That should do the trick.","post_message":"OBAMA'S NEXT MOVE TO SCREW AMERICANS and protect illegal aliens...  @webpagelink"},{"comment_id":"912105055515910","commenter_b":"The reality is that the absence of a father or a mother is felt by children who have grown up in single-parent household. Perhaps we should then outlaw divorce/sex outside marriage to contravene this?","commenter_a":"Hoe the HELL she this she is? Talk about being 2 FACED! No RESPECT! YOOT! Of 2 day . Viva the Women who had and still have LOVE 4 you! !!! X","post_message":"'Another mom could never have replaced the father I lost'"},{"comment_id":"10153366334404024","commenter_b":"I don't trust anything that Obama says or does.","commenter_a":"Get him for war crimes.","post_message":"Doctors Without Borders Rejects Obama’s Apology: Demand Investigation Into What It Said Was An Alleged “War Crime” @webpagelink"},{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."}]
