[{"comment_id":"10155459480226729","commenter_b":"Illegal peoples was unexpected to immigration live our homeland your said them all to their ear daft.","commenter_a":"Mexico’s Enduring Legacy of Failure If Mexican President Enrique Nieto truly believes Donald Trump is a bigot for not welcoming millions of medically and criminally unvetted illegal aliens with open arms and a check made out to \"cash\", then why does Mexico have stricter immigration and foreign work laws than \"racist\" America? Every civilized nation recognizes the absolute necessity of securing their borders and maintaining the integrity of their immigration programs. It's the type of common sense that requires no apology or gratuitous reminders. Perhaps if the Mexican government wasn't so adept at destroying its own country with an endless cycle of incompetence and corruption, their own flesh and blood would not be fleeing their native homeland with nothing but the clothes on their back. And yet these are the same hypocrites who have the nerve to denounce America as greedy capitalists; that transcendent beacon of liberty, opportunity and prosperity ...","post_message":"If there's one thing I truly despise about the progressive socialist left it is their blatant hypocrisy.   One of the fall back positions for the left is always the 14th Amendment's \"equal protection\" clause. In the case of Obergfell vs Hodges (same-sex marriage) the SCOTUS ruled that marriage was an individual right and States must conduct same-sex marriages, making it the \"law of the land\" as many say.   Now, with the executive orders of President Donald Trump on illegal immigration, the liberal progressive left is again decrying the 14th Amendment's equal protection applies to anyone within the borders of the United States.   Well, based upon this, I will henceforth be carrying my concealed weapon anywhere within the borders of the United States.   Look, if all of a sudden, two men and two women have the right to be married anywhere in America, and if folks here illegally have constitutional protections, then my constitutional second amendment right to keep and bear arms shall not be infringed. You know...equal protection.   So, there it is, I just saved Congress a lot of work. Law abiding legal American gun owners can travel anywhere they want with their concealed carry permit. If we can't, then no same-sex marriage -- and no rights and protections for illegal aliens.   End of class."},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."},{"comment_id":"10153289541199614","commenter_b":"Thank God he blessed me! Don't gotta do that","commenter_a":"stupid is has stupid does! Forstes Gump","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family.  The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show.  The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says.  Read KTLA's story here: @webpagelink"},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"10154387812405329","commenter_b":"Pretty ladies :)","commenter_a":"My mom and I get asked if we're sister's whenever we're out","post_message":"Um....................................."}]
