[{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10153352212341162","commenter_b":"So, Michael \"TheArtist\" Louis, what you're saying is- the young man in the meme isn't \"black\" enough for you? That only people who subscribe to the stereotypical depiction of how black people dress and behave are \"real\" black people? If that's not racist against African Americans, I don't know what is... Smh. And isn't the point of ending racism getting AWAY from stereotyping based on the color of a person's skin? The funny thing is, the meme maker -who is presumably black based on what the meme says- is *trying to* say that white people are racist, when in reality - they have such deeply rooted issues of their own that they didn't even realize their meme was racist against themselves. Start with yourself...","commenter_a":"Looks like she for sent home for having a black date nothing's wrong with her dress","post_message":"TOO REVEALING? A girl was sent home from prom because school officials thought her dress showed too much skin. What do you think?   PHOTOS: @webpagelink"},{"comment_id":"862770227128920","commenter_b":"Ted Cruz loves our country Hilary hates our country and all true Americans!! I would never vote for her or any Dem.","commenter_a":"Yes!","post_message":""},{"comment_id":"10153406625761130","commenter_b":"What sport are the males allowed in the female locker rooms?","commenter_a":"\"Male journalist arrested for trespassing in women's locker room. Charged with trespassing, unlawful entry and sexual harassment\"","post_message":"\"It's still 2015, right?”"},{"comment_id":"805029612967642","commenter_b":"She knew and never said anything?? She's should be locked up smh","commenter_a":"So if she knew he scouted both places why didn't she report him?","post_message":"The gunman's wife said that he scouted both Pulse, the nightclub where the mass shooting took place, and Downtown Disney, recently renamed Disney Springs."},{"comment_id":"1197370603617282","commenter_b":"Larissa Elliot","commenter_a":"Amy Batchelor","post_message":"An attempt to reproduce 100 psychology studies published in leading journals couldn't match the results in almost two thirds of cases."},{"comment_id":"10153896841896636","commenter_b":"Let's talk about what about ... 1. What about Christian imperials from England who colonized, enslaved, stole and murdered people during their colonialism , don't they have Christian knowledge, 2. What about Christian Europeans colonizing America and stealing their land, murdering millions of natives, 3. What about white Christians enslaving blacks people in America treating them like animals and killing blacks for sport. Can you blame these crimes against humanity on Christian faith , NO you cannot , and you cannot blame Islam for the actions of ignorant people. Don't lower your intelligence to the level of ignorant people of past and today who are enemies of humanity .","commenter_a":"Are you trying to defend Islam by claiming that, ISIS recruits have very poor knowledge of islam ? ok, what about the radical Muslim clerics all over Europe, Asia and USA, don't they too have any knowledge on Islam ?","post_message":"Incredible"}]
