[{"comment_id":"10152723867461680","commenter_b":"No, LIb. First of all you ASSume that every business owner in the country is a Republican, which is just more made up shyte by a LIb. Secondly, its called supply and demand. By flooding the labor market via illegal immigration and REWARDING illegal immigration, Libs increase the supply of labor in relation to the demand for labor, which lowers the price of labor.","commenter_a":"IT is amazing how those who vote republican seem to forget that Reagan and both Bush's gave amnasty to illegals, Reagan even went on to say that he would like to see an open border where the Mexicans could come and go any time they wanted, For all of you simpleminded republicans who want proof you have a computer look it up,","post_message":"Texas and other states suing over the moves say that only Congress can authorize the kind of sweeping actions Obama took."},{"comment_id":"1816579521955760","commenter_b":"@username please explain since you are, \"so sure\". Provide facts. Also, a bit of advice folks, just because you believe it doesn't mean it's true.","commenter_a":"No matter the outcome, people who voted for him and constantly protect him with ignorant comments, will just keep saying \"we won, we won\". They aren't exactly sure what they won since their candidate keeps back peddling on his entire platform. They'll just know that they won. We all lost. Ignorance, racism, labels, anger, and an immature person won.","post_message":"Computer scientists spot voting irregularities in swing states two weeks on from Trump's election."},{"comment_id":"10154153338147908","commenter_b":"@username norway. now stfu","commenter_a":"Commie Bernie vs. Socialist Hillary= end of Freedom.","post_message":""},{"comment_id":"1394286020597209","commenter_b":"@username Cruz voted in the senate to bring in hundreds of thousands of muslims and TRIED TO PUSH THROUGH AMNESTY FOR THEM AND ALL ILLEGALS because he wants NWO and Open borders! Why do you think for the first time in history the BORDER PATROL HAS ENDORSED A CANDIDATE AND IT IS TRUMP? THEY SAY TRUMP IS THE ONLY CANDIDATE THAT WILL BUILD THE WALL AND ALLOW THEM TO DO THEIR JOB!!!! Trump is the ONLY ONE NOT wanting a PRESIDENTIAL SALARY EXCEPT FOR $1 AND NO RETIREMENT! The ONLY ONE who wants AMERICA AND AMERICANS FIRST! The ONLY ONE That wants to KEEP OUR SOCIAL SECURITY for our ELDERLY! The ONLY ONE That wants to rebuild our MILITARY AND HELP OUR VETS! The ONLY ONE Who WILL UNTIE THE HANDS OF OUR POLICE OFFICERS, BORDER PATROL AND MILITARY! And the ONLY WANT TO CUT GOVERNMENT SPENDING AND BRING DOWN ...","commenter_a":"Cruz what are you then?? You change your tone like Hillary does based on whom you are speaking too. Im not pro trump but least he hasnt changed his speech based on whos around him. That says a lot by itself.","post_message":"\"Donald J. Trump is the master illusionist - he is the Harry Houdini... Trump is a phony.\"  Today while campaigning in Pennsylvania, Ted Cruz slammed his rival for the GOP nomination."},{"comment_id":"1001682469851506","commenter_b":"This lady is so delusional. .... how did this happen","commenter_a":"Does no one get the part where they are wielding skateboards at police? This isnt because a WHITE COP or two BLACK KIDS.... this is because TWO CRIMINALS TRIED TO ESCAPE AND USED SKATEBOARDS TO ASSAULT POLICE!!!!!!!!","post_message":"JUST IN: This footage shows step-brothers, Bryson Chaplin and Andre Thompson, at Safeway -- before they were shot by an #Olympia police officer. >> kiro.tv/SurveillanceOly  They are both expected to survive."},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."}]
