[{"comment_id":"10153326702079877","commenter_b":"It doesn't make no sense for a woman to get sloppy drunk","commenter_a":"I just don't understand","post_message":"Man finds wife naked in bed with her father...then gets stabbed after an altercation. Read more of the details below.   Grio fam, we can't imagine. What would you do?"},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."},{"comment_id":"10154692887376336","commenter_b":"Deplorable Californian here","commenter_a":"Ga.here","post_message":"Live Now: Donald J. Trump speaks in Columbus, Ohio."},{"comment_id":"969122396467721","commenter_b":"i wasnt created to have babies..a lot of women arent..","commenter_a":"God created us to have babies, not kill them he doesnt like it","post_message":"And abortion is NOT healthcare!"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States.    Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin.  So, how has racism changed over time?"},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""},{"comment_id":"10153839178821636","commenter_b":"What exactly is your barometer for being \"ruined\"? You realise Germany is one of the most successful countries in the world right? In terms of GDP, growth, economic viability, social mobility, lower wealth inequality, higher math and literacy, better education, lower incarceration and homicide rates, lower obesity, drug and alcohol addiction etc etc. If being among the top few countries in the world for such things is \"ruined\", you clearly don't know the meaning of the word. Put aside the right wing and sensationalist news outlets for a moment, who's job it is to highlight every transgression of migrants and Muslims, in order to make things seem much worse than they actually are, and instead take a minute to appreciate just how successful and dominant Germany is right now. Merkel is smart, she knows migration is the key to economic growth and sustainability, even if it has some negative byproducts. ...","commenter_a":"Merkel has not only ruined Germany with her idiotic open door fantasies, she has caused havoc for the rest of Europe. In an ideal world we'd all be free to roam. But the world is far from ideal now is it!","post_message":"For one reason"}]
