[{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."},{"comment_id":"10152880521321051","commenter_b":"What did this person drink in her baby bottle??","commenter_a":"I would trip if my kids rode with strangers even if they were cops. I don't trust anyone with my children. You can't trust anyone today.","post_message":"This woman is outraged that the police gave her daughters a ride to school."},{"comment_id":"1397444103681973","commenter_b":"Welcome to the internet hun.","commenter_a":"90% percent of the people calling others cry babies are the same who were crying and complaining when obama was president.","post_message":"This one sums up today's women's rights marches beautifully..."},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised \"great restraint\" while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."}]
