[{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"},{"comment_id":"10153966537634714","commenter_b":"yeah i shut the bathoom door is consdered polite","commenter_a":"He said disgusting then you have no heart. You are not a lovable person.","post_message":"The quote has not been disputed by Donald J. Trump’s camp."},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"1202133839801897","commenter_b":"Charley, you are a part of Racist America too !","commenter_a":"Republican piggish bigoted racist' hate !","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.”  Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"981872948594888","commenter_b":"Ugly garment..her Mamma didn't teach her well at all.","commenter_a":"Yeah","post_message":"Hillary Perón"},{"comment_id":"10154271222713984","commenter_b":"She is a liar and manipulator ..","commenter_a":"A vibrator up her cooze? Call out the nuke-sniffing pig from South Park.","post_message":"Hillary Clinton was about to give a speech when suddenly the reporters heard a very strange noise... they knew immediately that Hillary was hiding something.  We know Hillary can't be trusted and this proves it... everyone needs to know what Hillary just did."}]
