[{"comment_id":"1707461899536305","commenter_b":"This lady is lady has her own set of rules","commenter_a":"From you? Yeah right!. . . The Ambassador and thsoe Marines are - ROLLING IN THEIR GRAVES. . . right now. . .","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10153164083911770","commenter_b":"Good, she needs to leave the country too","commenter_a":"Good","post_message":"An atheist councilwoman in a town amid New Jersey’s suburban sprawl stormed out of a council meeting on Thursday and quit her job after the council decided to name the town’s Christmas tree-lighting event a “Christmas Tree Lighting.”"},{"comment_id":"1698524737097189","commenter_b":"Thanks gents for proving not only is the patriarchy alive and well, but it's also angry and ugly. Your mothers must be so proud.","commenter_a":"Just goes to show you no matter how powerful and important a woman is, men still feel that she is there for their entertainment and enjoyment, and they are entitled to direct her in her appearance and behavior. I'm pretty sure not one of them has said to Donald Trump or Bernie Sanders or John Kasich or Ted Cruz they should smile more, or made comments on the tones of their voices. They respect male candidates and don't see those things as important to a good male leader. But a woman leader? She has to be twice as qualified as the men to be considered competent, and has to be constantly critiqued on elements only seen as important to women: posture, poise, attitude and looks. I'm glad these neanderthals are being called out on their sexist tweets. But this is only the beginning. The ultimate glass ceiling is about to ...","post_message":"Were other (male) candidates called out the same way?"},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"957758620983859","commenter_b":"I don't mean to sound rude on the subject but I'm soooo tired of women having kids (multiple times) and complaining about life is so hard for them. Like honestly, if you wanna take cum and get pregnant maybe you should think before just doing","commenter_a":"If you have kids you deserve the struggle. Don't have kids until you feel ready or accomplished enough to bring a new life into the world. If you have kids before the age of 21 then you are a complete idiot and shouldn't get help from anyone cause stupidity isn't worth saving","post_message":"Great point!"},{"comment_id":"10154937686570329","commenter_b":"They must belong to one sexy mother fucker","commenter_a":"Those are some sexy thighs","post_message":"END OF STORY."},{"comment_id":"1257645944292548","commenter_b":"Why doesn't FR just end this problem by STOPPING all Muslims from entering EU, no pain no trouble--just say NO! Muslims just cant integrate into civilized society.","commenter_a":"Our law is for everyone: no showing of religious appurtenance in schools or public places. That includes Catholics as well. I was not allow to show my catholic cross at school. And I am French. Our country, our laws. France did not became a country of human rights at no cost. If they are not happy there, they can go back in their country. They might remember why they left in the first place. Plus, no one in France is allowed to cover their face expect during winter: it was for security reason, long before Muslims came in France. Women in France fought for their right of Freedom, coming here and wear the veil is an insult to all woman who died for our freedom. The veil or any coverage is not religious, but cultural.","post_message":"It is argued that the ban on head-coverings is unfair because it encroaches the individual freedom to remain covered for religious purposes."}]
