[{"comment_id":"10155464827050354","commenter_b":"Crazy ass bitch.","commenter_a":"Ms. Warren needs to look into the eyes of the youngest victim and then advocate against the death penalty. And then go to the other families that lost loved ones or lost limbs and time. That dear little boy didn't have the chance to live and she wants that piece of sh*t to live a long life.","post_message":"Liberal values..."},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"},{"comment_id":"10153349077816051","commenter_b":"I don't care if she black or white or Asian or Hispanic welfare queen trash should have her insides ripped out or kicked off the system sink or swim","commenter_a":"60 000 for 12 kids!!!! That's borderline poverty! Why are people making a big deal out of this.","post_message":"This mom of 12 gets more than $60,000 per year in benefits. And that's not the worst of it."},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"1050187868329829","commenter_b":"Die already you old prick !","commenter_a":"lol I see the libturd heads exploding in here! Deport them all!","post_message":"On the Texas immigration ruling: President Obama is well within his established Constitutional authority and the legal process will bear that out. The only effect of this ruling is to delay justice for thousands of families in Nevada and across the country. Governors, mayors and law enforcement officers have emphasized that these programs are good public policy, help our economy and keep our communities safe.  Courts are only involved in the first place because Republicans have spent years blocking Congress from fixing our broken immigration system. Congress should live up to its responsibility and pass an immigration bill that secures our borders, keeps families together and provides an earned path to citizenship.  There is nothing stopping the Senate from debating immigration legislation immediately. Unfortunately, the Senate is mired in a completely avoidable impasse over funding the Department of Homeland Security. Senate Democrats have a simple solution for getting out of this jam: take up and pass a clean bill to fund Homeland Security, then move on to a robust debate on immigration legislation.  Democrats’ offer to first fund Homeland Security and then debate immigration stands. All Republicans have to do is say yes."},{"comment_id":"10153220467940950","commenter_b":"Lets hope for something known as KARMA, mf'r.","commenter_a":"That's so wrong","post_message":"A video showing a McDonald's drive-through worker offering a reportedly homeless man a burger and then throwing water in the man's face is quickly moving through social media waves."}]
