[{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink  Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it.  Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"455180294641926","commenter_b":"Why don't the Italians just feed them to the the lions or do they only do that to Christians?","commenter_a":"It's karma for Columbus.","post_message":"Nearly 6,000 people were rescued just this weekend alone."},{"comment_id":"10154346191079411","commenter_b":"I don't even think about you or feel absolutely anything for any of the followers of such cult... But i can tell you something: The members of the Western Civilization are entitled to protect Our values, Our culture and Our true religions from the plague that has overshadow every region it has reached... And there is absolutely nothing all of you can do about it. And if it happens that you are an antisemite like a very big portion of the muslim population, i can tell you that your life wouldn't be the same without Google, Whatsapp, Facebook, Oracle... and so on (Those are jewish invetions). Finally how can such a small country like Israel (You live next to it) defend itself from dozens of enemies and at the same time be so strong with such a small population? The brotherhood defends us all with the power of G'd... not ...","commenter_a":"If french people want to be slaved and force to convert to that filthy and pedophiloc religion then Fuck U All... Just wait to be once again a province from another country","post_message":"'I saw Muslims celebrating in the street during the attack. I saw it with my own eyes. In real time!'"},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""},{"comment_id":"10153428772146509","commenter_b":"Cause she was worthless and weak that's why!!","commenter_a":"Why would you choose the classroom to do that?","post_message":"There was no indication of foul play, and every indication that she took her own life, officials said. @webpagelink"}]
