[{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"10153069431726045","commenter_b":"Don't run pretty girls. You're just gonna trip over that invisible tree branch and fall at his feet.","commenter_a":"90model gold marque mercury. Missing a hub cap. Asking anyone know the CAR...not the man.","post_message":"Huntsville Police hope you can recognize the car this man drove when he robbed the PNC Bank at 1470 Perimeter Parkway Wednesday afternoon."},{"comment_id":"10154151058422756","commenter_b":"To see how idiots can find an angle to go against clean energy. Wind turbines kill birds? A far less amount then any oil spill I have seen. Or pipeline that explodes. We could do this all day but this country is long past the need to go clean energy. I hope you idiots are paid to post all these ridiculous comments.","commenter_a":"Wind and solar don't make any sense, you have to cut down large areas of forest's to put up windmills on mountain tops to construct them, and they end up killing many birds. Same goes for solar, you would have to blanket the continental US with solar panels to replace fossil fuels. It's got nothing to do with \"evil big business\", wind and solar will just never be as efficient and reliable as coal, oil, and natural gas.","post_message":"A natural gas plant in Lycoming County is now complete, and it provides energy to nearly 1 million families in our area and other parts of the northeast."},{"comment_id":"1253236361399557","commenter_b":"This is how much hillary hates women. Hillary wants to bring in illegals who hate women. @webpagelink","commenter_a":"Trump is afraid of Hillary for one good reason and that is why he constantly threatens her with assassination. Hillary can win over Trump by force of argument rather than by force of fear. You Trump supporters aspire to fear and violence. We Hillary supporters to free speech and Civil Rights.","post_message":"On this day in 1973, tennis champion Billie Jean King defeated Bobby Riggs in the “Battle of the Sexes.” King went on to found the Women’s Tennis Association, the Women’s Sports Foundation, and Women’s Sports Magazine to support women athletes on and off the court."},{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"},{"comment_id":"10154352617716880","commenter_b":"Yes. That's correct too. And once it's 10% conquest begins. Not sure if it's even possible to fix now.","commenter_a":"Could it be because there are too many Muslims in France?","post_message":"A French parliamentary report reveals its reasons."},{"comment_id":"709751369215441","commenter_b":"Yea I support Texas and believe no Muslims belong in America","commenter_a":"Rigth on Texas","post_message":"Texas is standing up to the invasion of Muslim refugees. Don't mess with Texas. Do you support the great state of Texas?"}]
