[{"comment_id":"10157270600175389","commenter_b":"Wow... she sure lost her dreadlocks for her 10 minutes on Hannity didn't she!","commenter_a":"Love how she went from braids to foxy diva afro overnight. That's all I got from her. Yawn.","post_message":"\"I don't believe in any cause that takes innocent lives, regardless of what that cause is.\"  Former Miss Alabama Kalyn Chapman James, who referred to the Dallas shooter as a \"martyr\" in a now-viral video, said she believes Micah Johnson thought he was dying for a cause, but was \"evil.\""},{"comment_id":"1349180015160531","commenter_b":"I'm guessing it won't be Christians?","commenter_a":"Now we know what iran is using all that money obama gave them for. Old Valerie has been running the government for some time. Once these nuts get you guns guess who will march in.","post_message":"In a sickening op-ed piece for The Huffington Post, Valerie Jarrett basically \"killed off\" her own grandpa in order to push for her agenda... GUN CONTROL.  This is absolutely revolting... take a look at what she did."},{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"731938580238084","commenter_b":"We need to look at all facts here. It looks like the victim went looking for trouble. YOU DON'T ASK YOUR SON TO GO GET THIS GUN! I have a feeling she could have been alive today if she had acted like a responsible adult and called the police if he had threatened her. Also, if she was the victim of a gun fight which she started. I WOULD JUST CALL THIS SAD! SAD SHE DID NOT HAVE BETTER SENSE AND LESS ANGER!","commenter_a":"WaaaWaaaa!!!!","post_message":"He suffered a severe head injury, records show."},{"comment_id":"10154858254049497","commenter_b":"Hopefully, I last a little longer than 24 hours. 🤔","commenter_a":"@username :) Honestly, I admire this about you. You explore things and excel at them. But it's just kinda funny.","post_message":" crazy. He throwing himself into cooking and collecting vinyl when he only had his microbrewing kit 24 hours."},{"comment_id":"591336634387962","commenter_b":"Build the wall!!","commenter_a":"That's California for ya. I find nothing wrong with what he said in 1971. Things were different then. I said things in 1971. Does that mean I'm a racist today? I am military where everyone's color is either desert camo or woodland camo. I find affirmative action quite racist. Employers should be able to hire people because of their skills not because of the color of their skin. Absolutely ridiculous.","post_message":"California lawmakers refuse to honor John Wayne! and here's why..."},{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"@username LOL DUDE","post_message":"Insanely delicious."}]
