[{"comment_id":"10154831195946729","commenter_b":"Well, turns out Michelle Obama herself was accused of plagiarizing part of her speech. In fact, the Democrats who are using last night’s speech as a means to cast aspersions might have done well to pause and consider the list of their own high-profile leaders who have been caught plagiarizing.","commenter_a":"Melania Trump Did NOT Plagiarize Michelle Obama’s Speech And This Is Why… The accusation is that Melania Trump “plagiarized” a speech made by Michelle Obama in 2008. Well I’m sorry liberals, she did not. Here are the comments from Michelle Obama in 2008: \"And Barack and I were raised with so many of the same values: that you work hard for what you want in life; that your word is your bond and you do what you say you’re going to do; that you treat people with dignity and respect, even if you don’t know them, and even if you don’t agree with them. And Barack and I set out to build lives guided by these values, and pass them on to the next generation. Because we want our children — and all children in this nation — to know that the only limit to the height of your achievements ...","post_message":"Wow..."},{"comment_id":"10155394034488352","commenter_b":"I used to work as cashier and I witnessed a couple of white people trying to pay for others people groceries so they will get the cash . They will go around asking Hispanics mostly Mexicans to pay for their groceries so the Mexicans could give the cash to them??? Yup cheating the damn system , of course we wouldn't do it for them . This bitch came to me one time and Infront of me she offered to pay this Mexican ladys stuff and I said to the Mexican lady don't do it , she's asking to do something illegal . The bitch was like why you telling her that ,I was like look I can take your name right now , you are on camera and I have this lady as witnessed. I can contact social services right now and tell them what you doing .... You will ...","commenter_a":"If you gave them citizenship most would turn it down. These people don't want that. Then they would have to pay taxes. I work with mexicans and and other immigrants. The legal ones I work with didn't like the illegals on Fridays cause they brought home more. If yaw people want all these immigrants here so bad take them into your homes. Our country can't handle anymore forms of welfare.","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10156399276440354","commenter_b":"What are you a freaking psychic? How would you know who is Christian?","commenter_a":"Man look all this Christian compassion.","post_message":"Ex-porn star Bree Olsen: \"It's bulls**t.\""},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"229274887547012","commenter_b":"Total hero! Heart of gold💛 Communities need to set up places where showers and washer/dryers are available to those in need.","commenter_a":"That was so awesome God bless you it should be more people like you in this world I'll be a better place to live in if people learn to help each other no matter what color we are","post_message":"A California man helps a homeless man get a job."},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."},{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"}]
