[{"comment_id":"951876701600434","commenter_b":"Send her AND O'dummy to Gitmo!!!","commenter_a":"Hillary has character and integrity? How easy it is to forget all the criminal activity this woman has engaged in. She's nothing but a liar, cheat and disgrace to this country. She belongs somewhere alright it's called prison.","post_message":"BREAKING NEWS: AP projects Hillary Clinton as the winner of the Arizona Democratic Primary."},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : \"The Republican nominee is unfit to serve as president.\""},{"comment_id":"1301566109863416","commenter_b":"~ Peoples personas don't change without great effort, just ask any addict. ~ Why is it always the retarded republican that thinks they can tell people what to do? Can't quite quantify and validate your reasons for voting for the Trump tard?? ~ Let me help you. Trumps tax plan is a joke that gives radical tax breaks to the rich, while promising 0% tax for people making under 25K. People who make under 25K already don't pay any taxes, and the rich already have enough tax breaks and loop holes. @webpagelink ~ Trump says he wants to stop outsourcing, yet his clothing line and make America great hats are made in China. @webpagelink ~ You might think he's good with money, but Trumps companies filed for bankruptcy 4 times in recent history. @webpagelink ~ Trump wants to build a wall to keep criminals and drugs out, Yet criminals are ...","commenter_a":"Very good & funny","post_message":""},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"932212166798963","commenter_b":"MEN are selfish!","commenter_a":"people can look at ass and other provocative videos all day. Things that children have easy access to and could potentially mess their mind, but yet everyone continues to make a big deal of pregnant/breastfeeding women. We need to get our priorities straight. #FirstWorldProblems.","post_message":"Pregnant meteorologist Kristi Gordon has been getting emails like this: \"... it is not pleasing to look at hump every day PLEASE have her take her mat leave now.\"  (Via The Huffington Post British Columbia)"},{"comment_id":"925335920856271","commenter_b":"What has she done is any of her \"jobs\" ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"10153272091283271","commenter_b":"lol. And the elephants will inherit the earth and as the most intelligent animal.","commenter_a":"This is why the aliens won't talk to us","post_message":"Kentucky clerk Kim Davis is free as of Tuesday. Former Arkansas Gov. Mike Huckabee stood alongside Davis outside the jail, calling her \"incredibly brave.\" Hear her words in the video. What's next for her career? ---> @webpagelink"}]
