[{"comment_id":"10153366804443635","commenter_b":"Old testament commands to kill is now invalid. You are beyond ignorant Kyle. You'll do anything to defend any religion except Christianity. Did i say you should be killed, you nut? I'm not talking to you anyways. Get your nose out of my conversation with him.","commenter_a":"Kill the unbelievers wherever you find them.\" Koran 2:191 \"Make war on the infidels living in your neighborhood.\" Koran 9:123 \"When opportunity arises, kill the infidels wherever you catch them.\" Koran 9:5 \"Any religion other than Islam is not acceptable.\" Koran 3:85 \"The Jews and the Christians are perverts fight them.\"... Koran 9:30 \"Maim and crucify the infidels if they criticize Islam\" Koran 5:33 \"Punish the unbelievers with garments of fire, hooked iron rods, boiling water melt their skin and bellies.\" Koran 22:19 \"The unbelievers are silly urge the Muslims to fight them.\" Koran 8:65 \"Muslims must not take the infidels as friends.\" Koran 3:28 \"Terrorize and behead those who believe in scriptures other than the Qur'an.\" Koran 8:12 \"Muslims must muster all weapons to terrorize the infidels.\" Koran 8:60. That seems pretty pure to me, purely evil!","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"10152782566181051","commenter_b":"I hope the next time Kanye storms the stage whoever is up there just decks him. What a POS!!!","commenter_a":"I thought west was leaving the USA. What happened? We'll help pack you up and get you out of here!","post_message":"Beck just issued a response to Kanye West’s rant about him not deserving a Grammy."},{"comment_id":"10158091047615293","commenter_b":"Even Medicaid charges copays now. Where before ACA it didn't.","commenter_a":"It can't be any worse, drug prices have more than tripled over the last 4 years, Not to mention blue cross going up and more than doubled their premiums over the past few years. Blue Cross gets 300 bucks of our paycheck ever other week, and that's our part the company matches that, you add that up. 1200 a month for family coverage.","post_message":"What will healthcare look like under President Trump?  Tell us what you think in the comments below."},{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"1247431258610235","commenter_b":"Shut Up!","commenter_a":"Black guy shoots a white guy who was trying to help a female. Sad. When do the riots start?","post_message":"SHOOTING CAUGHT ON CAMERA: New Orleans police are searching for the man shown in this video shooting a med student who was trying to stop the suspect from allegedly attacking a woman. The suspect can be seen shooting the student in the stomach after a verbal confrontation, and then attempting to shoot him again when his gun appears to jam. Read full story: @webpagelink"},{"comment_id":"1738737039712860","commenter_b":"Republicans are not racist like the democrats would like you to think we just want a safe and secure country. They blocked him bc he wants to give our country away!!!! Illegals do not belong here!! There should be no sanctuary cities to protect them. Anyone coming here needs to take the steps to be a citizen first!!","commenter_a":"Y all the hate? What have Obama done that is so terrible? To my opinion he is one of the best. They races republicans stop him since day one, cuz they want him to fail. Block him all the way...","post_message":"President Obama's approval rating stands at 55% in a new CNN/ORC poll, the highest of his second term"},{"comment_id":"1038152239553568","commenter_b":"She is dumb","commenter_a":"Guess she will have to work for a living now","post_message":"This model lost everything."}]
