[{"comment_id":"10154944476018984","commenter_b":"@username but the First Lady Elect wants the Indians to go back to India so how will they be able to go to the White House?","commenter_a":"I do think before the Trumps move in the whole place should having laying of hands and prayers from our faithful people to cleanse the evil that has lived there for so long.","post_message":"As soon as the White House opened its doors to display the Christmas decorations, many Americans were surprised by one item in the background. This is getting a lot of attention, and you'll instantly see why..."},{"comment_id":"10153147899391636","commenter_b":"the womans a simpleton","commenter_a":"And MPs should be treated like....... ?","post_message":"What do you think of Kerry McCarthy's comments?"},{"comment_id":"1082383445115167","commenter_b":"Looks like a Transvestite Alien. Brucelyn Jenner looks better","commenter_a":"A new level of trashy. Way to be a good role model (insert slow clap)","post_message":"DAMN, TAYTAY!"},{"comment_id":"1745739655705616","commenter_b":"The university should be pledging NOTHING for illegals! They are criminals. The university should be prosecuted for aiding and abetting crime!","commenter_a":"If anything, this should all be used for American students. They should be the first to receive help not illegals. This is wrong.","post_message":"University of California students criticised a university pledge of $25 million over 3 years to assisting illegal immigrant students as “not enough.”"},{"comment_id":"10153236448557042","commenter_b":"What's she trying to prove? Don't let her use her bank account or any money she has.","commenter_a":"And what about cheap clothes too , as well as cheap beauty products .","post_message":"OSCAR WINNER LIVES OFF FOOD STAMPS: Gwyneth Paltrow, often criticized for elitist comments she made in the past, is going on food stamps.   The actress will live off just $29 in groceries for a week to bring awareness to the difficulties of living under the program."},{"comment_id":"683824238474821","commenter_b":"STFU you pussy. Why don't you go join ISIS.","commenter_a":"Really? This is just pathetic. Who in their right mind would even think if suing someone because they offered a book bible or not. The soldier is not fit to be in the military. All he had to say was he was an atheist. Unless he is to ashamed too.","post_message":"An Atheist soldier is suing a Christian soldier for recommending the bible. This is blown way out of proportion. Let's backup this christian soldier. Can we get 50,000 'LIKES' for this soldiers commitment to god?"},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."}]
