[{"comment_id":"10156213230310725","commenter_b":"Yes but most came here legally not sneaking across a boarder and none of us got free food free housing free health care or free college. You think all that is fair for us to pay the bills of someone illegally sneaking across our boarder or overstaying there visa. How many Americans have been murdered or robbed or raped by them? Far to many!","commenter_a":"Everyone are immigrants to US America .... Okay!!!!!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"10152767856712426","commenter_b":"Hide yo kids hide yo wife","commenter_a":"Michelle Grider","post_message":"Startling!"},{"comment_id":"1297208260357707","commenter_b":"How can she do that from behind bars","commenter_a":"Only three more days of this fake bullshit, then Hillary will shut your lying asses up.","post_message":"The Associated Press may be the most venerable wire service in the world. However, they're now under massive fire after the sickening offer they made to the Clinton camp was just discovered...  The press is willing to do anything to stop Donald J. Trump, and this is yet more proof."},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"891951477509756","commenter_b":"Hang the jihadi cunt for spawning the 2 Hajis. She is just as guilty!","commenter_a":"Can you fit two in the gas chamber?","post_message":"The apple doesn't fall far from the tree."},{"comment_id":"10154430974181756","commenter_b":"The world hasn't forgotten.","commenter_a":"It's sad that it happened 2 years ago yet the world forgot them and nothing has been done to end the ordeal. Smh","post_message":"The young woman reportedly said some of abductees have died but many remain alive in Boko Haram captivity.   The mass abduction in April 2014 sparked worldwide outrage."}]
