[{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"},{"comment_id":"10152602775901636","commenter_b":"She could have kept going, but she also could have allowed the crazy lady to get a great distance away from her. She had a kid in the car. Why engage someone and put yourself and your child in danger? I do not blame the victim, however, she could have made the decision to pull over for 3 minutes or so to put some distance between them.","commenter_a":"Maybe that was the road she needed to take? So it's her fault for continuing to drive like she's supposed to??? Geeze","post_message":"Things take a scary turn when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"1704858546467924","commenter_b":"Ha-Ha! She is starting to look like James Earl Jones. Too bad she's a dumbass.","commenter_a":"Black Mrs Potato Head. yikes.","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"258747511232468","commenter_b":"Struck a nerve didnt I @username? Don't dish out what you can't take Snowflake. Now, y'all enjoy picking those grapes.............","commenter_a":"you and your fucking fox news like spin...he requested...not begged. you are as bad as the right wingers with your lies. is your position so weak you have to spin it? you are why trump is in office because you cant be straight up. fuck you occupy democrats.","post_message":"It's obvious that hypocrisy runs in the Trump family."},{"comment_id":"10153751099450575","commenter_b":"get this ass out of office and then let them rape her!!!!!!!!!!!!!","commenter_a":"Yup!!!!! a little common sense, people....she's the leader of Germany...Oh , sorry, look at the leader of the U.S. He's not smart enough to pick up on this.....well I think he is smart enough , but he's on a fast track to destroy america, so, it can do that!!!","post_message":"Now she admits it after she already destroyed Germany. . . ."},{"comment_id":"1067465993294258","commenter_b":"James Whitehead","commenter_a":"Amanda Henry I squealed multiple times. The author is a great read too!","post_message":"A little something to brighten your day."}]
