[{"comment_id":"10153487799954087","commenter_b":"This was Trumps plan the hole time.... They followed like a bitch in heat... And she did.... Trump just out smarted them again... We will see him on TV along with the debate","commenter_a":"Little baby Trump can't handle having Megyn as a moderator. What a sorry excuse for a presidential candidate.","post_message":"#BREAKING: Donald J. Trump accused Fox News of \"playing games\" and said he would skip Thursday's Republican debate in favor of an event to raise money for Wounded Warriors."},{"comment_id":"1096195137073807","commenter_b":"Why are democratic women so scary looking? See what lies do to your face?","commenter_a":"Obama praising himself Hillary looks like she needs to go to the restroom while being admired","post_message":"A note for 2016: the Democrats are the party that abandoned #Israel, enabled the rise of #ISIS and is now helping #Iran to get a nuclear bomb."},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":" does not represent the man that I know, she added."},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"\"I know my role in the justice system.\""}]
