[{"comment_id":"10153382589804411","commenter_b":"shutup bastard","commenter_a":"Fuck them they are just as much terrorists as Isis","post_message":" we are facing a kind of danger that is unprecedented in history, which targets humanity itself,"},{"comment_id":"10153288827596523","commenter_b":"@username her momma should have taught her manners, and respect, you might consider doing the same.","commenter_a":"That poor little girl just learned she can cause problems, then ignore her teacher and the school administrator and the police. She really learned a lesson, didn't she?","post_message":"The South Carolina deputy who slammed a disruptive student on the floor and tossed her several feet has been fired."},{"comment_id":"533893623467884","commenter_b":"Lol. Fuck off bitch.","commenter_a":"He has the truth. God Blessbhim.","post_message":"Obama is furious after Ted Nuget takes an epic stand against him.  He speaks the truth. Nuget needs your support.  Can we get 10,000 'LIKES' for Ted Nugent's epic stand against Obama?"},{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":""},{"comment_id":"966993893421492","commenter_b":"Republicans and Democrats been divided .. how did he divide us.. two different view points","commenter_a":"Can't wait for Obama to get out of there so things can go back to normal once Trumps in there to clean up the mess!","post_message":"UPDATE: The White House lockdown has been lifted. Secret Service agent shot an armed suspect outside the White House compound after he refused to drop his weapon.  Breaking News: The White House is on lockdown after reports of a shooting nearby. Secret Service members and police officers are getting people off of the White House North Lawn. @webpagelink"},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"1280546775319125","commenter_b":"Is it not a shame that such is good looking woman can make herself look so bad when she open her mouth.","commenter_a":"sick of seeing this woman in the news.. why doesn't she go back to Alaska?","post_message":""}]
