[{"comment_id":"1728567140790384","commenter_b":"Probably gonna be built by the illegals","commenter_a":"Let's do it!! Give jobs to citizens.","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign.  MORE: @webpagelink"},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"10153689557537434","commenter_b":"Always. I have a dirty job so it is necessary.","commenter_a":"Nope.","post_message":"Please take this poll so we can figure out how gross we all are."},{"comment_id":"10154028327039411","commenter_b":"Might have a heart... But she has no brains.... Sadly without that.. She is and 326683984410ard like you :)","commenter_a":"Punished for having a heart and a conscience.....","post_message":"'Military jail frightens me less than our society losing its humanity'"},{"comment_id":"10154766410094714","commenter_b":"Let us wave a wand and turn you into a woman...then comment about this. Have a nice day!","commenter_a":"Wow! All of a sudden women in distress coming forward. I wonder how many more will jump on the dollar filled band wagon? Doesn't this look a little suspicious? Clinton filling their pockets!","post_message":"The Donald J. Trump campaign is planning to fight fire with fire: “We’re bringing out tactical nukes now, with thermo nukes later.” @webpagelink"},{"comment_id":"10153703182846438","commenter_b":"lolz u wot m8","commenter_a":"just look at them..smh ....what idiots and morons","post_message":"Why his supporters stick with him despite all his gaffes and lies."},{"comment_id":"10152573206214071","commenter_b":"You are correct @username people like Sarah Palin and her lambs cannot be fixed.","commenter_a":"Go a way!!! Don't want a dumb president like that!!","post_message":"'Murica is hyped!"}]
