[{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"1598639267107557","commenter_b":"#2ChroniclesChapter7V14 #DrainTheSwamp #OneNationUnderGod #InGodWeTrust #TrumpPence2016 #UCMJ4President #UCMJ4Congress #UMCJ4Senate #USConstitution #BillOfRightsNonNegotiable #Paperballotsonly w/ID #NoAmnesty #AmericaFirst #PledgeOfAllegiance #NationalAnthem #ProNRA #ProLife #Pro2A #NoUN #MAGA #Election2016","commenter_a":"Why are tax dollars being spent on our so called president campaigning for her. ..should be illegal","post_message":"Donald J. Trump finally did it. After taking a lot of punches from the first lady, he unloaded on Michelle Obama, dropping an epic truth bomb on the president's wife.  What do you think about what Trump said?"},{"comment_id":"1095120020511481","commenter_b":"Can you imagine a women asking for that to happen What an ass","commenter_a":"rapper bitch needs to be hung .....","post_message":"BOOM."},{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."},{"comment_id":"1680894471939506","commenter_b":"Other people need jobs. Quit and you don't draw unemployment. Saves tax payers some money","commenter_a":"Which means 28% of our \"public sector servants\" are actually partisan political hacks. Liberals embedded like ticks. About right.","post_message":"I hope they're mostly from the IRS."},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"}]
