[{"comment_id":"649975575168534","commenter_b":"God Bless Heal Comfort Renew & Keep that poor innocent child...as 4 Them(Mr Swollen & Miss Crazy Lookin) ..Vengeance is Mine said the Lord!!!","commenter_a":"😡😡😡😡","post_message":"True tragedy. A 4-year-old was found beaten and zip tied to her bed. Not only that, she didn't know her own name and told police she thought it was 'Idiot'."},{"comment_id":"1342427385796715","commenter_b":"Lock her up!","commenter_a":"How can people be voting for this woman I just don't understand we are doomed","post_message":"BOOM.... !! Judicial Watch comes out with a powerful STATEMENT.  @webpagelink"},{"comment_id":"10152733923177217","commenter_b":"Probably think females don't know anything about cars.","commenter_a":"Another keyboard warrior.","post_message":"TV presenter in Twitter break after Top Gear \"threats\""},{"comment_id":"513866205470626","commenter_b":"This IS STILL AMERICA and I'll go where ever I want, if those pigs fuckers try to stop me it will be the last thing they do before meeting allah in hell","commenter_a":"They need to obey American laws. As all do who live in this great country.","post_message":"Video coverage from the Shariah 'No-Go Zone' has been released.  This is America. If you don't like it you can get out.  Do you agree Shariah Law should be banned in America?"},{"comment_id":"10153411176356509","commenter_b":"I dont see any woman winning nothing by -coming forward- for the lack of proofs Cosby won`t face any compensation neither sentence, but it is a considerable quantity of womens telling the same, you figure it out ...","commenter_a":"Why are they all remembering it now?","post_message":"Heidi Thomas, who was an aspiring actress when she met Bill Cosby, is coming forward about a secret she says she has been holding for 30 years. This story contains graphic language:  @webpagelink"},{"comment_id":"416369798522976","commenter_b":"Cheeko you ignorant slut. Stop acting like you know anything.","commenter_a":"Russia, get your shit together.","post_message":"Last year, fans of the Moscow CSKA team chanted racist slurs during a match against Manchester City. A year earlier, fans of Torpedo Moscow threw bananas at player Christopher Samba, who is from Congo, during a game against another rival Moscow team."},{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"}]
