[{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"804054019696293","commenter_b":"Dumb bitch...","commenter_a":"She just needs to shut her piehole take off her cloths and look pretty!","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10156436861080354","commenter_b":"Barbara is either asleep or as dumb as a box of rocks!","commenter_a":"BABA STREISAND is a LIBTARD MORON, Like her EVIL BUDDY HUSSEIN OBUMMER...!! EAT SHIT BABA SHEEP STEISAND..!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.\""},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"986428001390952","commenter_b":"If she doesn't like it let her go back to where she can ask for what she wants and expect to get it because she's Muslim. If one doesn't like our rules go somewhere else.","commenter_a":"Simple solution open and pour content of can into cup in front of customers","post_message":"Your thoughts?  STORY: @webpagelink"}]
