[{"comment_id":"10154789649578256","commenter_b":"@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, \"The one style lesson you can actually learn from Donald Trump,\" columnist Eric Zorn writes."},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"},{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"10153720833452098","commenter_b":"@username LOL, Some women are so dumb !!!","commenter_a":"Straight men are so great.......LOL","post_message":"JUST IN... The victim was found lying outside of a vacant home with critical injuries. She later died at a nearby hospital"},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."},{"comment_id":"954480501354785","commenter_b":"After all the bitching and complains that one guy did I'm so happy to see this.","commenter_a":"Please don't start with you there goes the racist comments because you're a racist to say","post_message":"LIVE: Special announcement expected at Little Caesars Arena around 10am, regarding \"another Detroit franchise announcement\" - MORE at ClickOnDetroit.com (UPDATE: Kid Rock will open Little Caesars Arena with 4 shows in September 2017)"},{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."}]
