[{"comment_id":"10153197187718132","commenter_b":"The other woman is nuts and seriously needs to commit herself. She's making a bad name for herself doing stupid things like billing other children.","commenter_a":"Both parents failed here!! Poor kids.","post_message":"This is serious business."},{"comment_id":"1019686794754611","commenter_b":"Words that are meaningless. Go Hillary, really, go (away)","commenter_a":"whole as in Benghazi?????","post_message":"\"Despite what you hear, we don't need to make America great again. America has never stopped being great. But we do need to make America whole again.\"  Moments ago at her #SCPrimary victory speech, Hillary Clinton invoked Donald J. Trump's campaign."},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."},{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling \"pigs in a blanket, fry 'em like bacon\"."},{"comment_id":"10153147008285950","commenter_b":"I love a drink but when I got pregnant I stopped and even though I am dying for a cold one in the warm spring sun it has to wait until bub is out and I am not breast feeding. I am due in oct. woman need to realise it isn't about them anymore.","commenter_a":"I remember my Dr saying a drink would be fine","post_message":"Slightly more than 3 percent of pregnant women admitted that they binge drink, consuming four or more alcoholic drinks at a time, according to the report from the U.S. Centers for Disease Control and Prevention."},{"comment_id":"946243322102083","commenter_b":"Vote UKIP","commenter_a":"And who listyens to this moron?","post_message":"Russell Brand who called voting 'a massive waste of time' no U-turns and says: 'Vote Labour'"},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"}]
