[{"comment_id":"10150808006769999","commenter_b":"Minority women...","commenter_a":"i get the point about not many women in software engineering.. but, minorities? umm..just looking around my office floor right now, all i see are minorities (asians and south asians)","post_message":"Why do so few women and minorities work in software engineering? We’re discussing reasons for the gap and what can be done to improve it.  Join filmmaker Robin Hauser Reynolds, whose new documentary, “Code,” explores the issue; Nick Rockwell, CTO at The New York Times; Minerva Tantoco, CTO for New York City; Myrna Soto, Senior Vice President Global Chief Information Security Officer at Comcast; and Jazmine Hughes, Associate Editor at The New York Times. If you have questions, leave them in the comments.  For the second half of this live stream, click here: @webpagelink"},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"653855578126234","commenter_b":"@username so you are ok with men grabbing women's genitalia.","commenter_a":"And this what mango Moussillini's said immediately after Michelle's speech. Trump on the People reporter who said he sexually assaulted her: \"Take a look. You take a look. Look at her. Look at her words. You tell me what you think. I don't think so.” He is grotesque. My husband never speaks like Trump - EVER. And Trumps cult is now tweeting repealrhe19th. Only weak sociopathic narcissist men like Trump, lie, talk and think like Trump. As for women that support it, are beyond words to me right now.","post_message":"Here's the incredible Michelle Obama speech Fox News refused to air: \"Strong men — men who are truly role models — don’t need to put down women to make themselves feel powerful.\""},{"comment_id":"699615530187912","commenter_b":"Its you Liberal Pukes who need safe spaces ! Too bad there are no safe spaces in NJ !","commenter_a":"Newt Gingrich says anyone who believes in Sharia Law should be deported. Hey Newt - I believe in Sharia law! 100%! Muh muh muh muh......MY SHARIA! Now - come try and deport me!","post_message":"\"I'm through trying to understand the sick ideology of Islamism. Instead of trying to understand it, we ought to just try to kill it.\" – Sheriff David Clarke @webpagelink"}]
