[{"comment_id":"10154748214069486","commenter_b":"Fools all of them grrrrd","commenter_a":"WRONG!!!!...ARREST THE CLINTONS NOW!!!!...THEY WILL NEVER STOP ALL THEIR CORRUPTION UNTIL THEY ARE ALL BEHINDS BARS!!!!!!!","post_message":"Is this throwing in the towel?"},{"comment_id":"10153361867349726","commenter_b":"He has no womb case closed Obummer has no morals or common sense","commenter_a":"The country is damn near in chaos and he takes the time to talk about this BS...","post_message":"WATCH: Obama: Caitlyn Jenner Showed 'Tremendous Courage'"},{"comment_id":"802416633249035","commenter_b":"Trump supporters do not listen to reason or facts.. Exhibit A above","commenter_a":"Shameful. Was it a DNC rally??All of those actors from other countries that she showcased... They are not illegal immigrants!!! There's is a huge difference.","post_message":"What did you think of Meryl Streep speech?"},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"1033684776642992","commenter_b":"Really???? No more than white folks killing each other!!! Racist azzes!!!","commenter_a":"where is black lives matter now?","post_message":"A deadly weekend"},{"comment_id":"855684411135567","commenter_b":"what mexicans smuggling drugs into our country? no WAY! shoot them","commenter_a":"Hmmm... hemp mattresses.","post_message":"Nice try."},{"comment_id":"1364883926864562","commenter_b":"Go tell her that bitch","commenter_a":"You are nothing but a disgusting pos Michelle after the sex scandals you have had, you are a freakin hypocrite lady, at least Trump's children were brought up right and with class unlike your daughter, you just need to shut the Fk up.","post_message":"Michelle Obama says Trump is guilty of \"bragging about sexually assaulting women, and this has 'shaken' her. What do you think about her comments?"}]
