[{"comment_id":"512162555660096","commenter_b":"@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."},{"comment_id":"10153623259427623","commenter_b":"@username coming here isn't a right. And yes, it is the same thing. Building a wall to keep people who don't belong here out is no different than you locking your door. You lock your door to keep people out.","commenter_a":"If you lock your doors at night then you agree with Donald J. Trump. I expect my government to be at least as security conscious about my country as I am about my family. This is not racism or rudeness, but common sense safety measures in a time such as this.","post_message":"All of Donald Trump's talk of constructing a wall between the U.S. and Mexico has inspired an artist to build a little border wall around Trump's star on the Hollywood Walk of Fame."},{"comment_id":"10152961317706636","commenter_b":"What an odious man, he should be stripped of his Irish surname, he's unworthy of it!!","commenter_a":"I'm sure that O'Reilly curses everyday his bad luck of not being old enough to have been part of the glory days he admires and sees as a role model of traditional values .... the book burning and massive rallies in Nuremberg....","post_message":"O'Reilly is rarely shy when it comes to the 'degradation' of conservative values..."},{"comment_id":"1629456670679882","commenter_b":"Little Winnie bitch","commenter_a":"Toddler, bigot, lier","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show \"modesty\" When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"}]
