[{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"},{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"897132857052677","commenter_b":"i can deal with trump and cruz. NO RUBIO! or KASICH! let illegals stay here at no price. do not understand why people hate common core. soros giving them bucks. not them!","commenter_a":"Trump/ Carson","post_message":"Who are you voting for?! Let us know!"},{"comment_id":"10153135013122217","commenter_b":"Hopefully, they're one of my favourite bands☺️","commenter_a":"Ahhhhhh how come???? I still don't have my ticket 😳😨😭😭😭","post_message":"Going...going...gone"},{"comment_id":"10154813376179312","commenter_b":"North Country isn't that bad. And the only thugs are in the future new Nazi government.","commenter_a":"Prayers for this couple and their family","post_message":"Oklahoma police are looking for this couple last heard from in St. Louis. They were on the way from McAlester, Oklahoma, to Toledo, Ohio, but called their son from the St. Louis area on Thursday."},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate.  Police are the people that keep her safe.  Do you think Beyonce needs to learn some respect?"},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""}]
