[{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show \"modesty\" When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"1291576474195436","commenter_b":"Gonna be great for tranny sex!","commenter_a":"Private stall restrooms make it no longer an issue for either side of the issue","post_message":"Target will invest in private stalls in response to protests from customers over its policy allowing transgender customers and employees to use the restroom that aligns with their gender identity.  Do you like Target's move toward inclusivity? Or were you opposed to its policy?"},{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."},{"comment_id":"1104163209700456","commenter_b":"Is she as dumb as a rock or what ?","commenter_a":"Just take this ignorant ass in jail.... Trump!!!!!!!","post_message":"Even after being caught cheating in elections, check out Democrats' excuses."}]
