[{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"}]
