[{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"607285086107002","commenter_b":"I didn't know the definition of feminist included wanting to have sex with your daughter. @webpagelink","commenter_a":"idc. I would still rather have him as a president than Hillary","post_message":"Trump has been accused of sexism by his critics"},{"comment_id":"10153571607004411","commenter_b":"Fuck you Kike hook nosed cunt","commenter_a":"Just a usual palestine jewhating fascist lmao, good way of solving the problem Canaan belongs to nobody, especially not to muslims","post_message":"'My hope is that at some time, [Israel] is no longer there, but only Palestine'"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"10154611725268445","commenter_b":"you are an idiot. I wish you were here right now bitch","commenter_a":"Natives don't want jobs just government hand outs","post_message":"Cannabis becomes the great equalizer and provides a level playing field for tribal nations, including those who did not benefit from casino's."},{"comment_id":"10155994453335389","commenter_b":"Lady don't hurt me! @webpagelink","commenter_a":"If Trump can't handle a Fox debate against other GOP'ers, how's he going to handle debates in the general election? He may have some good ideas, but he's a sideshow. Always tooting his own horn or would that be a \"Trump\"et?","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"1295210740519395","commenter_b":"You bitch need to learn manners and parents to teach you some.","commenter_a":"That bitch needs a straight jacket and a rubber room","post_message":"The video of the assault is appalling."}]
