[{"comment_id":"10153964436169705","commenter_b":"@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"1750200585039682","commenter_b":"Wear a condom then you stupid, despicable woman","commenter_a":"Couldn't just let her be adopted.........","post_message":"What a horrible woman"},{"comment_id":"496533153870598","commenter_b":"We will never submit to Islam! Go fuck another goat!","commenter_a":"How do you really know that @username...you have documentation to explain here to that right wingers are like muslims??? Haven't seen a right winger decapitate anyone yet...or did i miss one?? Are right wingers now involved in terror plots against America and are they sneeking into third world muslim countries and blowing people up?? Man!!! I must have missed all the headlines...sure glad you brought us up to page on this!!!","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10154571318628797","commenter_b":"Build The Wall","commenter_a":"She could have easily just left..but she didn't so who's fault is that?","post_message":"DENTAL DEATH: April went to the dentist to have a procedure and she was understandably nervous about it. After it was over, April collapsed and died in the parking lot. Now her family wants to know why the dentist went through with the procedure despite warning signs."},{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"880575888650866","commenter_b":"The christians and jews cause more terror","commenter_a":"muslim are terrorist i repeat","post_message":"An Ohio man accused of plotting a terrorist attack on the US Capitol says before his arrest he was planning to go to Washington, DC and shot President Barack Obama in the head.  Full story: @webpagelink"}]
