[{"comment_id":"926308994070863","commenter_b":"Nope, I kill the bastard and accept id be going to prison my whole life, but at least my child would live.","commenter_a":"It's possibly the worst idea in history to allow the shooting of a cop. Even the absolute worst cop could be clubbing a baby and still, if he were shot and killed in the act he'd die a hero and we'd never hear the end of it. We need to shoot cops, but with our cameras, never ever with a gun.","post_message":"Some states are dealing major setbacks to the Police State."},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"10154290844506323","commenter_b":"I get the picture: not everyone shares my view of the EU but I was trying to make a point that not all the youth are wanting to remain in the EU.","commenter_a":"I am 19 I voted for Ukip and tor the UK yo leave the EU. Not all of the youth are wanting to stay in the EU. I will stay loyal to our ancestors who fought and won two wars to ensure our freedom!","post_message":"Jeremy Corbyn has defended Labour’s campaigning in the EU referendum, telling a heckler at London’s Pride festival “I did all I could” in his first public defence of his role in the remain campaign."},{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"10152998251641045","commenter_b":"She should not be allowed the 10 as pets! Remove all the animals! What if those 10 are someones pets!","commenter_a":"Did she also house cats? I haven't read of any being there, but I wondered what happened to them if there were. Being that she was acting as a shelter for the county there should have been.","post_message":"The ASPCA's disaster response vehicle is now on site in Lawrence County to help remove more than 250 animals from the shelter. Police continue to guard the entrance, admitting only those who are helping with the investigation or caring for the animals."},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."}]
