[{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"},{"comment_id":"10152961317706636","commenter_b":"What an odious man, he should be stripped of his Irish surname, he's unworthy of it!!","commenter_a":"I'm sure that O'Reilly curses everyday his bad luck of not being old enough to have been part of the glory days he admires and sees as a role model of traditional values .... the book burning and massive rallies in Nuremberg....","post_message":"O'Reilly is rarely shy when it comes to the 'degradation' of conservative values..."},{"comment_id":"10153060626041162","commenter_b":"I'm gonna jump a girl I see walk passed me Jk","commenter_a":"Notice how these kids are not American...Im sure it would be a different video here","post_message":"VIDEO: In an experiment designed to explore violence against women, young boys were asked to slap a girl.   Watch how they responded: @webpagelink"},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10153469105041746","commenter_b":"Lol this chick gets her history from Hamilton","commenter_a":"Think about these 2 statements: \"Make America Great Again,\" and \"America Is Not Great.\" If you support the first one, but are angered by the second, you need to take Logic 101. As for the statement on this woman's hat, \"America Was Never Great,\" I strongly disagree. I saw Hamilton: An American Musical and there was a time when greatness abounded. Since then, we've alternated between great and not so great, sometimes concurrently. It's a big country!","post_message":"Meet the 22-year-old between the controversial hat."},{"comment_id":"876368172456238","commenter_b":"You are so foolish. You must be a Hillary supporter? That nasty woman has direct ties with Monsanto. Do you realise that? She is one of the biggest crimals you could ever imagine. Put Google to good use and research just how evil Hillary really is.","commenter_a":"Amen!! Thats how you hurt a man with money right in his pocket. I had told myself i was not going watch nothing with his name on it.","post_message":"Kudos to NBC for doing what's right!  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
