[{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"10153126683228854","commenter_b":"Criminals almost never kill themself.","commenter_a":"So what do you plan on doing about this old info ?","post_message":""},{"comment_id":"10156113293015725","commenter_b":"all you haters can eat a bag of liberal dicks!","commenter_a":"That's okay - Presidents don't have time to run Celebrity Apprentice! You will be busy saving our country!","post_message":"Congrats to my friend Arnold Schwarzenegger who is doing next season’s Celebrity Apprentice. He'll be great & will raise lots of money for charity. To all my fans, sorry I couldn’t do The Apprentice any longer— but equal time (presidential run) prohibits me from doing so. Love!"},{"comment_id":"1178312252188803","commenter_b":"The site did not breech their privacy......they all willingly made the choice to put their name and information on there to cheat on their spouse......the site did not do anything negligently....the hackers got in.....they have been able to get into top secret government systems.....how is a website for cheaters supposed to be expected to have better security than the government? The hackers are the ones at fault.....and the idiots who allowed themselves to be exposed by trusting something as insecure as the internet to cheat on their spouse!","commenter_a":"I disapprove of what they did but the site breeched their privacy.... Hope every penny goes to those that were cheated on","post_message":"All allege breach of contract, negligence and violation of various state and privacy laws by Ashley Madison and Avid Life Media LLC"},{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the \"racism this, and political correctness that\" nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"\"I understand the true nature of the war, and slavery was not the primary issue.\""},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."}]
