[{"comment_id":"10153581421506336","commenter_b":"How do you go so wrong in life before you're even out of high school??","commenter_a":"But they look like law abiding professionals","post_message":"Four high school students have been arrested in the carjacking and kidnapping of a Texas border patrol agent who was vacationing with his family in Florida authorities said."},{"comment_id":"535989533241343","commenter_b":"Stop hating Racist women !","commenter_a":"3 Muslims just went into a Canadian city and opened fire in a bar on innocent people. Canada's Muslim appeaser ignoring it. This is on his shoulders. Trudeau's headline today? Liberal mp going to detox. Watched Obama. Muslim crimes are shush shush. White criminals get detroyed by Obama, cries 'racism' and moves his gun agenda forward. The double-standards by these leaders is taking democracy down a precarious path. Sad.","post_message":"President Barack Obama at State of the Union: \"When politicians insult Muslims, whether abroad or our fellow citizens, when a mosque is vandalized, or a kid is called names, that doesn’t make us safer... It diminishes us in the eyes of the world.\"   #SOTU updates: @webpagelink"},{"comment_id":"1769645119990268","commenter_b":"@username Says a blind woman","commenter_a":"Trump supporters say Trump should not be judged on his past actions, yet when it comes to Hillary Clinton, all they can talk about is the past. Hypocrisy? Also FYI, Hillary Clinton is running for Oval Office not Bill Clinton looks like that needs to be clarified for some people * You want to talk about Bill Clinton, why don't we talk about Melania Trump","post_message":"Donald J. Trump got a heck of an October Surprise."},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153816352544726","commenter_b":"This dumb bitch deserved it!!!","commenter_a":"I'm sure it was a hate crime right?","post_message":"WATCH: Trooper Orders Woman To Leave Florida DMV, But She Refuses...Then Goes Nuts!"},{"comment_id":"10153545151956336","commenter_b":"Megyn deserved the beating from Trump. She's an uppity bleach blonde.","commenter_a":"Tonight Fox sucks","post_message":"“I think the big problem this country has is being politically correct. I don’t, frankly, have time for total political correctness.”    Donald J. Trump responds to Megyn Kelly after she asked him, “How will you answer the charge from Hillary Clinton…that you are part of the war on women?”"}]
