[{"comment_id":"10153615882695329","commenter_b":"Seriously. That woman should have said no or let's go home first. She's just as guilty! Time served smh. Bs","commenter_a":"And why is no one hating on the woman for this? MENISTS","post_message":"A Florida man was sentenced Monday to two and a half years in prison for having sex on a beach in front of other beachgoers, including children."},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"10153867165952144","commenter_b":"Obviously not Mike. If she belonged in jail, they'd have put her there.","commenter_a":"So instead of corrupt it's lazy, stupid, or incompetent...hardly QUALIFICATIONS.","post_message":"This is a really smart piece from David Corn."},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The \"super tunnel\" – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"\"[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,\" said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"1760155984214134","commenter_b":"she makes money that way she is a media whore","commenter_a":"She is worse then a racist, bigot she hates whites and everything whites stand for. It the view comes on a channel any place I am at I change the channel I will not watch a racist show that she is on","post_message":"Whoopi Goldberg Insults TV Host For Being White, See What Happens Next. She is the biggest hypocrite. What a bigot. Do you think Whoopi is a racist?"},{"comment_id":"1090152371065873","commenter_b":"NO! All the illegals should be put there until they can be legalized.","commenter_a":"No,never.","post_message":"The White House says it is committed to closing Guantanamo Bay and will overcome the obstacles Congress is causing to prevent this. Should Guantanamo be closed?"}]
