[{"comment_id":"1379793182036339","commenter_b":"because her goal is selfish...not to make HIM successful...not to help America....but to HELP HERSELF....","commenter_a":"They all say they have the answer when they're campaigning. I've always wondered the same thing...why the hell don't they tell someone, then??","post_message":"Here's another question that I have: If Hillary Clinton has the answers for the economy, why doesn't she tell Obama what to do now?  Why do we have to wait until she maybe gets elected and then gets inaugurated and then starts putting her ideas into practice?  If she's got the answers, why wait?  Why doesn't she make it a point to meet with Obama, who's in the Oval Office and say, \"Barack, this is what we need to do to fix the economy\"?"},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy.  She's the biggest racist we know, and we won't stand for it.  Do you agree Oprah is racist?"},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."}]
