[{"comment_id":"1056254801076607","commenter_b":"That's funny but I don't think you could trust Rubio on the border. He's too in to amnesty and letting illegals in.","commenter_a":"Won't it be great when Trump is President , and Rubio is reassigned to mixing cement on the Mexican border ?","post_message":"BOOM!!!"},{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"\"HELL NO \"","post_message":"Is Hillary Clinton America's best choice for president in 2016?"},{"comment_id":"10152966596170399","commenter_b":"And all these illegal f$^%ers are going to Disneyland!","commenter_a":"Hire a illegal alien get a $5000 fine! A New Border Surge Opens Us To Surge Of Epidemics Border Surge: Secretary of State John Kerry warns of a new surge of illegals, just as Central America is being hit by a new wave of epidemics. No doubt about it: President Obama's open-borders policy is exposing us to disease, too. It's plain what's bringing up this great wave of diseases: immigration politics. President Obama is so obsessed with winning Latino votes for Democrats by neglecting border laws that he's unwittingly opened the U.S. up to a variety of third-world diseases. He's released tens of thousands of medically unscreened illegal immigrants into the U.S., supposedly to prepare for their immigration hearings, which 70% never show up for. The epidemics are small now, but the risk is rising. And with a new wave of illegals in the pipeline, where's the will to stop ...","post_message":"\"Anti-vaccination is tailormade for deeply selfish people, because it gives them a chance to show off how superior they think they are while shifting the cost of their choice on other people.\""},{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."},{"comment_id":"10153173112591130","commenter_b":"Still wished the lowlife bitch had fallen and broke her neck 😁😀😀","commenter_a":"Lol what a retard she is. Her stupid tail is in jail has to pay a large fine ( I'm sure she's part of millions living off working people so it won't matter to her ) and the flag was raised again. Great to see the flag rise again","post_message":"\"We removed the flag today because we can't wait any longer.\""}]
