[{"comment_id":"927580090624348","commenter_b":"@username OMG are you loco? This b&tch kills off people.","commenter_a":"You not being elected the President will make America safer","post_message":"Hillary Clinton: Guns Will Not Make Americans Safer #DemDebate   @webpagelink"},{"comment_id":"1150787404931568","commenter_b":"Trump is only running to give the candidacy to Hillary... or Bernie. He is still very much a Democrat. The \"conservatives\" who joined him have proven that stupidity doesn't necessarily stop with the Democrats only.","commenter_a":"Mr. Trump is not my first choice, but the more the elite republican insiders attack him the more I am inclined to support him.","post_message":"Will Republican attacks work or is Trump unstoppable?"},{"comment_id":"10155218043119411","commenter_b":"But I am American...maybe its not just what is in your dna but what is in your ideals and thoughts","commenter_a":"Just because he lives in one of the countries of europe does't make him a European, Europeans are people just like Asians, Africans or Indians with roots and ancestry from the said places. If I moved to Japan I wouldn't automatically become an Asian.","post_message":"'He European, just like you. [He] has a university degree, a figure that you never have, and a beautiful wife at home (who is white and blond)'"},{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"},{"comment_id":"895006600536681","commenter_b":"You gotta wonder where all these 'virgins' are supposed to come from... What a bunch of head-banging fools.","commenter_a":"They might be running out of virgins soon... The LEO that sent them packing, Thank you","post_message":"Officer who was shot by two gunmen outside free speech event in Texas has reportedly been released from the hospital.   The two gunmen are dead."},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."}]
