[{"comment_id":"984113211608432","commenter_b":"Why are girls doing this! It's so ugly!","commenter_a":"Elle Paiva-Wilson","post_message":"In a dangerous new beauty ritual, teens are sucking on shot glasses to pump their lips, then posting photos of the disastrous results on social media. >>@webpagelink"},{"comment_id":"10154774162911323","commenter_b":"@username, since you agree with @username, how does one load a machine with votes?","commenter_a":"\"The people have spoken\" is such an unfortunate choice of words when they gave your opponent in excess of 2M votes more than you.","post_message":"\"We believe we have an obligation to the more than 64 million Americans who cast ballots for Hillary Clinton.\""},{"comment_id":"10153936248091336","commenter_b":"American homosexuals bring HIV into the world.Nobody condemns them but Africa has Ebola everybody condemns Africa","commenter_a":"Nothing good comes out of Africa!","post_message":"More than 2,700 babies have been born in Brazil with microcephaly this year, up from fewer than 150 in 2014."},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1001040969952432","commenter_b":"Hillary says she landed under sniper fire and had to put her head down and run for cover? Hillary says she and slick Willie were broke when they left the white house? INTELLIGENT PEOPLE DO NOT SUPPORT A proven documented habitual liar for the highest office in the country TRUTH MATTERS","commenter_a":"Hillary 2016! Got my vote!","post_message":"\"I want you to remember: when you vote, when anyone votes, your vote matters as much as anybody else’s. Now, we may be up against super PACs and billionaires, but when the election comes around, Donald Trump and the Koch brothers with all their money, they only get one vote each. One person, one vote. That’s what we believe.  No one should be able to take that vote away. That’s why we cannot turn away and close our eyes from all of the attacks on voting rights that are happening right now. They don’t just threaten the integrity of our elections, although they do. They threaten what it means to be a citizen—indeed, what it means to be an American.\" —Hillary yesterday in Birmingham, Alabama"},{"comment_id":"1751693101711200","commenter_b":"Who is this women?...wait nevermind. I don't care!","commenter_a":"Everything we say anymore is considered to be racist","post_message":"Blake Lively is being accused of racism after using a famous line from Sir Mix-a-Lot’s 1992 song “Baby Got Back (I Like Big Butts)” to describe her assets."}]
