[{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"10154087182591409","commenter_b":"@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":""},{"comment_id":"859150960886345","commenter_b":"You weren't forced to come either bitch!","commenter_a":"It kills me that someone who is not even from America can say such racist crap @username. Just remember or learn about the history of slavery and the continued discrimination today from immigrants like you who wasn't forced on a boat to come here. It's because of African Americans you have the freedoms you have today. Please don't comment on something you know nothing about and actually learn about the injustices African American people are facing today. You sound just like these ignorant people who always got something to say behind closed doors. I guess you wouldn't know about white supremacy because you've bought in to this bs white people have taught you in America. I guess all the killings by white police is something new. You have no idea what it's like to be black and to get even immigrants being racist towards you the same immigrants Martin Luther ...","post_message":"The Debt Collection Industry Is the Epitome of Systematic Racism"},{"comment_id":"10153851827136336","commenter_b":"Deport. Muslin. And. Religion. Stop. Terrorist. America. Now","commenter_a":"Pretty sure there's a lot more than one already in the US.","post_message":"\"We know that ISIS is deliberately using the refugee crisis to insert fighters into Europe. Why wouldn't they do the same in the United States?\"  Tonight on \"The Kelly File,” Sen. Marco Rubio explained that if just one ISIS fighter manages to slip into the U.S. among the refugees, it's a big problem. @webpagelink"},{"comment_id":"10154380401494071","commenter_b":"Uh oh, there it is again \"Nasty woman\". But she is right.","commenter_a":"Hannity. Your rating might be high among poorly educated Trump supporters who love seeing you licking his butt.","post_message":"Sean Hannity railed against Joe Scarborough in defense of top Trump advisor, Stephen Miller."},{"comment_id":"10153746096543984","commenter_b":"shut Obama down, stop paying congress until they do their jobs","commenter_a":"not a dime til this is resolved","post_message":"Obama has just announced the number of Syrian refugees the U.S. will take in, and liberals aren't too happy about it.   What do you think the U.S. should do about the Syrian refugee crisis?"}]
