[{"comment_id":"10153183398771234","commenter_b":"Poor deluded woman.","commenter_a":"Donald Trump you have my vote","post_message":"Has Donald Trump always been, well, Donald Trump? According to his one-time roommate, the answer is..."},{"comment_id":"10153068133586135","commenter_b":"Nope kids do not belong at wedding receptions! Especially with the cost of plates being so expensive!","commenter_a":"Can't stand the non-kid weddings. Just bring them. HA!!","post_message":"After their babysitter cancelled, Jessica Baker and her husband didn't attend the wedding because kids weren't invited. A couple weeks later, they received a bill for $75.90 in the mail to cover the meals they would've eaten at the reception."},{"comment_id":"615645605262622","commenter_b":"She probably wants to take all the women to Venus!","commenter_a":"I thought Elon Musk was a perfume!?","post_message":"Who wants to go to Mars with Elon Musk?!"},{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"10152992734357894","commenter_b":"I hope Nick Gordon get the Death penalty lazy Ass Bastard","commenter_a":"Praying for her...","post_message":"Nick Gordon Could be Charged with Murder for the Impending Death of Bobbi Kristina"},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"}]
