[{"comment_id":"1711501568866157","commenter_b":"Another fool... how many Muslims are you taking home?","commenter_a":"More than half of the damn country is colluding to get rid of his incompetent dumb ass! On the other hand he doesn't even need to be investigated for colluding with Russia!!!","post_message":"Donald Trump's administration is to charge Barack Obama with treason for colluding with the Deep State to overthrow The President."},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"},{"comment_id":"10153694890631323","commenter_b":"What are black women always the ones who show so much ignorance","commenter_a":"If they aren't defined by it than why change your sex medically? Come on","post_message":"They could have made something positive, but the new Channel 4 series Girls to Men is demeaning to trans people on so many levels: \"Greater visibility for trans people should not mean even more close-up shots of genitalia and 'Ooh, don’t they look different – almost like real men' montages. It should be about taking the focus off surgery, suffering and sensation, because a transgender man is not defined by those things any more than the next person\""},{"comment_id":"10154398939341523","commenter_b":"There are TONS of awesome, respectful, wonderful men; just as there are TONS of nasty, evil, sexual predator females.","commenter_a":"I would still like to know which of my rights are being violated.","post_message":"Milwaukee County Sheriff David Clarke reacts to the Women's March in Washington to protest Donald J. Trump's presidency -- calling it \"an absolutely freak show.\" @webpagelink"},{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"718949644953580","commenter_b":"HAHA. Chickenshit. Stay home and tweet like a little bitch.","commenter_a":"chickenshit can't take the heat","post_message":"Pathetic."}]
