[{"comment_id":"570070006492803","commenter_b":"Beat trump I. Want a Christian men with a back bone .we can live better cleaner an safer","commenter_a":"I bought what I was getting for Christmas before Thanksgiving so that I could concentrate on the ultimate gift , Jesus.","post_message":"Hello everyone, I wanted to make sure we had some time tonight to spend with each other. As always, remember to keep sending me your questions via text to ASKBEN (@username on your mobile phone).   There were many questions from all of you asking “what is one of your favorite things about Christmas?”     Honestly, I love to see the look on everyone’s faces as they open presents – that’s the best part for me, seeing the look children have in anticipation of a gift. During this season, I always try to remind myself of the greatest gift…our savior Jesus Christ.   I know that many of us spend the week leading up to Christmas frantically rushing around buying presents, our time occupied with “how much to spend” on loved ones, rather than spending much time occupied with those loved ones. It’s about relationship, not retail. We should remind ourselves of that more often.   It is easy to become distracted by the world when we are constantly being bombarded with competing priorities, our time becomes monopolized by differing pursuits and positions, fleeting moments that will pass. Our true pursuit should be everlasting, one that cannot be wrapped in bows, it does not perish. It is peace. It is good news, in pursuit of others as we share with those we encounter. Just as we are now, you and I, sitting here together sharing this moment in time, these are the moments that do not fade or wither upon snow’s first falling – this is the season to be joyous with one another, lift others as He has lifted you, our hands united in hope.   That is why Christmas is special to me – I am reminded of the greatest of gifts every time I see my children and grandchildren’s faces. Hope.   Thank you for sharing your evening with me, I look forward to many more.   Goodnight, Ben"},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"636643946488247","commenter_b":"WHY DON'T YOU JUST SHUT UP-SAVE YOUR MUSLIM THREATS FOR THE MUSLIMS ! LONDON SURE SCREWED UP WHEN THEY LET SO MANY OF YOU MOVE INTO LONDON-AMERICA WILL NOT MAKE THAT MISTAKE !","commenter_a":"They will try to attack us anyway so if we don't allow them in it will be easier to contain the ones who are here already.","post_message":"The new Muslim mayor of London has issued a warning to Donald J. Trump: Moderate your stance on Muslims, or they will launch more attacks against America."},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."}]
