[{"comment_id":"10152949136921130","commenter_b":"Instinct ?most times women don't know what they want","commenter_a":"This is why women are usually attracted to them. It's instinct. Beard equals protection and strong genes. Science is fun.","post_message":"It's just evolution."},{"comment_id":"991707680869704","commenter_b":"Sorry ladies - simply not a fan and not willing to jump on her bandwagon because she seems to be the only female who's interested and has the ability to pursue it.","commenter_a":"Wouldn't vote for her if you paid me.","post_message":"If Republicans want to wage a war on women, they'll have to go through Hillary first."},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"10153263448855095","commenter_b":"Arguments about religion, politics are a useless battle people nobody wins and about the refugees coming in i'm highly against it, there is no way we will know the good from the bad and I believe there are good and honest people that have been brought to America but you can bet your ass that there's a radical somewhere in the 10,000. I love my country and I'll be damned if we're gonna stand by and let our government bring in a possible threat and believe me it's very possible with the insane actions our president is taking, this will turn out bad and it will be the American people who will suffer in the end","commenter_a":"\" My parents came to this country 45 years ago searching for freedom and a chance.\" But you dont want to afford that same chance to others? What a hypocrite.","post_message":"I cannot tell you what an honor it has been to run for President of the United States of America. My parents came to this country 45 years ago searching for freedom and a chance.  When I was born, we lived in student housing at LSU, and never in their wildest dreams did they think their son would have the opportunity to serve as Governor of Louisiana or to run for President.  They raised me to believe Americans can do anything, and they were right, we can. But this is not my time, so I am suspending my campaign for President.  Going forward, I believe we have to be the party of growth and we can never stop being the party that believes in opportunity. We cannot settle for The Left’s view of envy and division. We have to be the party that says everyone in this country - no matter the circumstances of their birth or who their parents are – can succeed in America.  One of the things I will do is go back to work at the think tank I started a few years ago - where I will be outlining a blueprint for making this the American century.  We must show the way forward on growing our economy and winning the war against terror, and especially defeating radical Islam.  I realize that our country is off on the wrong track right now. Everyone knows that, but don’t forget, this is still the greatest country in the history of the world – and every single one of us should start every day by thanking God that we are fortunate enough to be US citizens.  Now is the time for all those Americans who still believe in freedom and American exceptionalism to stand up and defend it.  The idea of America – the idea that my parents came here for almost a half a century ago - that idea is slipping away from us.  Freedom is under assault from both outside our borders and from within.  We must act now, we do not have a moment to spare."},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."}]
