[{"comment_id":"10154473534223812","commenter_b":"@username a female misogynist is what you are","commenter_a":"there are many good women in politics - not Hillary or Elizabeth Warren however.","post_message":"JUST IN: Elizabeth Warren endorses Hillary Clinton for president. Clinton is not ruling out the prospect of having her on her ticket as vice president."},{"comment_id":"10152963504506130","commenter_b":"What was she thinking? Dumb model!","commenter_a":"Well they can't fire her now that the world is laughing at it. PR, people, PR.","post_message":"Whoops."},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10155483281175231","commenter_b":"They tried to walk out and no is her business she can't just do whatever she want she pulled a gun on to people what was right about that. Just suppose they had weapons you do know the 2nd amendment applies to all citizens and they feared for their lives and shot the stupid white bicth. How ignorant","commenter_a":"her joint she can say and do what she likes......whatever...I would have just walked out..who cares","post_message":"Things reportedly turned into a scene out of Pulp Fiction."},{"comment_id":"1026880740704736","commenter_b":"Crazy runs deep in that family","commenter_a":"Still 'illegal' still a liar and still not eligible for being in Congress or running for president...","post_message":"Da'fuq?"},{"comment_id":"909436415764813","commenter_b":"@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."},{"comment_id":"10154420470022545","commenter_b":"Go kill some more Armenians you cockroach.","commenter_a":"Andrea Loren Bloom watch tomi get shut the fuck down lol","post_message":"This viral rant on #WomensMarch is riddled with fake outrage and hypocrisy where she complains about women complaining."}]
