[{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress.  Take a guess at how much it cost."},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"1841606822750087","commenter_b":"KORDSTAN","commenter_a":"So glad he is gone!","post_message":"President Obama delivered his final address to the American public in Chicago. How will you remember Obama's legacy? #ObamaFarewell"},{"comment_id":"10153261650152507","commenter_b":"Not enough! We need more dogs killer their dumbass, redneck, gun-loving owners. Arm Fido!","commenter_a":"It's not guns that are the problem, it's the dogs!! So don't regulate guns, regulate dogs.....er, wait.....don't regulate dogs right to guns, because guns don't kill people, dogs do.....wait, that's not what I meant.......oh what the hell do I mean?","post_message":"This is just awful."},{"comment_id":"10153210976889726","commenter_b":"The love affair begins","commenter_a":"How much are the promises he made going to cost us this time?","post_message":"WATCH: Obama and Castro sit side by side!"},{"comment_id":"10152877015584071","commenter_b":"Yvon Fugère ton iPad et nos iPhones vont pouvoir avoir iOS 9. Ils l'ont fait beaucoup moins gros, il ne va prendre moins de 2g de place.","commenter_a":"Step 1: Get an Android Step 2: Get Cyanogenmod 11 Step 3: ???? Step 4: $$profit$$","post_message":"Is your device upgradeable?"},{"comment_id":"10154513663831051","commenter_b":"A bitch will always be a bitch","commenter_a":"I am sorry, what is her position in the administration? Oh right nothing.","post_message":"This photo of Ivanka Trump is sparking tons of controversy after people realized something about what's right there in plain sight. Look closer."}]
