[{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of \"real Americans\" it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":""},{"comment_id":"10153912123821409","commenter_b":"Wow she should be kicked out for that!!","commenter_a":"You signed on the dotted line !! Hate to break it to you . Your job is to protect the freedom of this great nation. To bad you will be in the brig CHILE !!","post_message":""},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."},{"comment_id":"1583910615243254","commenter_b":"She's worth no comment","commenter_a":"Illuminate","post_message":"VIDEO! Cops are being slaughtered since Beyonce's Racist anti-cop performance. In 8 days 8 cops were murdered, and many more shot!  SHARE THIS EVERYWHERE!"},{"comment_id":"831862046868801","commenter_b":"You're talking about deregulation. A completely deregulated market would allow child labor and would have zero worker protections, environmental protections, etc. They'd still buy government because they don't really want a libertarian free market. They want a \"free\" market that's rigged in their favor; that's where the real money is. You can't really separate capitalism from corporations trying to exert influence over government. It's the nature of the beast. You have to find ways, instead, to make those attempts ineffectual. Starting a business always requires capital... that doesn't mean you have to be rich, per se. \"Big guys\" have economies of scale that make them hard to compete with even when the market is \"free\". It's not impossible to have a monopoly in a free market and it's not impossible (indeed, it's likely) that you'll have collusion and cartel-like behavior. I mean, the government could step in to put a ...","commenter_a":"Wealth inequality isn't a measure of economic health. Wealth inequality is merely a potential for trickle. It's nothing to be afraid of. It's something to embrace and tap into. Let's tap into that with a free market economy. What are we waiting for? @webpagelink","post_message":""},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"}]
