[{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"10154298251075098","commenter_b":"There's a reason why they're called filthy rich.","commenter_a":"This is so typical of corporate America. The C Level staff walk away with millions and everyone else has to suck it up.","post_message":"What a shock. Despite Trump's assertions that he was going to stand up for working people it turns out that Wall Street and Goldman Sachs are still running the show - and the Trump administration. Among many other billionaires in the Trump administration is Gary D. Cohn, the departing president of Goldman Sachs and Trump's new director of the National Economic Council. Upon leaving Goldman Sachs, Cohn just received an exit package of $285 million. Yes, $285 million.  And that's how the rigged economy and oligarchy works. The middle class of this country bailed out Goldman Sachs to the tune of over $800 billion. Goldman Sachs paid a $5 billion fine to the U.S. Treasury for illegal activity, as did virtually every other major bank. Meanwhile, no top Wall Street executive is prosecuted for criminal activity. Instead, the president of Goldman Sachs becomes the leading financial adviser to the President. And, to add insult to injury, Cohn and the Trump administration will soon end up supporting huge tax breaks for the rich while cutting Social Security, Medicare and Medicaid. Can we stop them? Yes. But only through a powerful and focused grassroots movement which tells Congress to represent us all, not just the 1 percent."},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine?  Talk about our country going to hell in a handbasket…"},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"10153096842961748","commenter_b":"The only thing that is happening is Bigots are being exposed, and shown for what they are!","commenter_a":"As ALWAYS - it is just the opposite! Conservatives are attacking the laws that protect EVERYONE, including themselves, from discrimination. Gays are challenging those attacks in order to preserve and PROTECT freedom. Only backwoods IDIOTS would not understand that.","post_message":"Gay people are lighting America on fire! According to a new anti-gay \"documentary,\" anyone who owns a business or holds public office is under attack."},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"\"When I saw her on TV crying, I felt like she did a 360-degree turn here.\"  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""}]
