[{"comment_id":"10153434419026051","commenter_b":"How does such an ugly and lazy guy find that many women to breed with him.","commenter_a":"Can you say \"vasectomy\"..and a \"JOB\"","post_message":"This guy has 26 kids with 15 women and has been getting $50,000 per year in benefits. Now he’s getting a brand new special gift."},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"10154024287346680","commenter_b":"Thank God we elected a Nazi instead, right?","commenter_a":"Can Obama just pardon her if she promises to stay out of the public for the next 3 decades? It's time to move on.","post_message":"State officials said earlier this year they searched for visitor logs for Hillary Clinton's office and could not find any."},{"comment_id":"10153128310892452","commenter_b":"Go get it. Keep pushing 👍🙏🙏","commenter_a":"People that don't know,.... one word,......Research!!!!! Google it up!","post_message":"Selena Gomez has revealed that she's receiving chemotherapy after being diagnosed with lupus. abc7.la/1P0VU5F"},{"comment_id":"10156102482195615","commenter_b":"State officials are supposed to be non-bias. If she can comply, she can find another occupation.","commenter_a":"You really don't have one KIM!!!!","post_message":"And here we finally have the truth, folks!"},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"771664696265472","commenter_b":"A 19 year old college student who apparently doesn't know history... It was actually Bill Clinton who trained and armed AlQuaeda","commenter_a":"Shouldn't have been there in the first damn place sleazy ass presidents....point the blame go head, this shit didn't just start....they just got more power...thanks America for taking my tax dollars and funding these weirdos","post_message":"A 19-year-old college student confronted Bush saying,“Your brother created ISIS.”"}]
