[{"comment_id":"520985371427355","commenter_b":"Come get it I live in bend oregon I will be waiting","commenter_a":"come and take it buckwheat","post_message":"They are demanding that we give them money for their ancestors slavery. 'LIKE' if you will REFUSE to pay slave reparations!!"},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."},{"comment_id":"10154362175295329","commenter_b":"In the meantime, STFU. :P Because see below? Where she says, \"I considered myself a feminist before it was cool, now everyone is claiming it?\" She said that a while ago. First, tell that to Gloria Steinem, honey. Second, I think it's not really feminism when one woman decides to deride another because she decides that she's not doing it right? Yeah, no. Sorry. That sucks a lot.","commenter_a":"Stfu demi","post_message":"\"How the fuck am I making this about myself?\" – Demi Lovato"},{"comment_id":"10158427286480206","commenter_b":"Where were these feminist when Bill was galavanting around town assaulting women and Hillary was defending him?","commenter_a":"Wonder if they \"smoked\" cigars afterwards, with Bill.... 2016, the year that people protested over a word... terrific.","post_message":"A mostly-female crowd chanted \"GOP, hands off me and \"Trump thinks he runs this town, p---y came to shut it down\" outside of Trump Tower."},{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"}]
