[{"comment_id":"10154306039388812","commenter_b":"How so @username, what was the childish remark. Do tell...","commenter_a":"This is awesome! Every child should have someone to tell them they're loved and accepted. Growing up is hard enough I can't imagine what transgender teens must go through everyday and I'm glad there are people willing to stand up for them and do the right thing.","post_message":"After an uphill battle involving protests and a petition, Wisconsin school will allow transgender high school student to run for Prom King: @webpagelink"},{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"},{"comment_id":"10154428205019087","commenter_b":"@username How is hiring illegal immigrants here in the USA \"putting 741915279236631s first\"? @webpagelink","commenter_a":"As an @username and a veteran I do not understand how anyone, but especially a fellow veteran, could support a disgraceful chickenhawk like Donnie. @webpagelink","post_message":"Several leading veterans groups who skipped President Obama's inaugural parades will march down Pennsylvania Avenue to celebrate the inauguration of President Donald J. Trump."},{"comment_id":"1658721937683357","commenter_b":"It is a machine for women. Google it.","commenter_a":"Who's Sibian?","post_message":"This may be  to a beach near you!  @webpagelink"},{"comment_id":"10154383385775975","commenter_b":"Thank you, OUR President Donald J. Trump❤️🇺🇸 #MAGA","commenter_a":"Loving it loving it","post_message":"\"I didn't come along and divide this country. This country was seriously divided before I got here.\"  President Donald J. Trump addressed the deep division Americans face.  Read more about today's press conference: @webpagelink"},{"comment_id":"10154507396141051","commenter_b":"Maybe the kid should go to history class and learn how the evil \"white\" people voted to free the slaves. Oh ya, it was only the republicans who voted that. NOT ONE DEMOCRAT. And maybe he should learn that the flag represents freedom from the brits, For all Americans. If he doesn't like it, maybe he should take a year for some overseas education. Say France maybe.","commenter_a":"Move if you don't like America","post_message":"This teenage boy refused to stand up out of his chair for the Pledge Of Allegiance because, in his words, \"America sucks.\" Here's how his teacher responded."},{"comment_id":"1765614553704778","commenter_b":"Congress has the power to IMPEACH HILLARY now for all the massive lies & corruption at its highest level. Ask your Congress person WHY THEY ARE NOT?? Where is the integrity of Congress?","commenter_a":"So the White House knew full well about Hillary's email after all .. one false narrative after another. This nation cannot survive another 4 years of corruption like this!","post_message":"\"The IT professionals who whitelist devices at places like the White House only add the email addresses authorized by management.\""}]
