[{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"},{"comment_id":"10157173546425354","commenter_b":"what a stupid whore","commenter_a":"Bill Vito: Gee, I hope she doesn't have any of those baby killing guns around.","post_message":"Democrat Sen. Barbara Boxer says the physical violence among Democrats is \"frightening\" and that she \"doesn't know what would have happened if I didn't have security.\""},{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what \"ATTEMPTED TO KILL THEMSELVES\" you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"941198702643049","commenter_b":"The submissive woman vote republican","commenter_a":"Amazing to me that any woman would vote Republican.","post_message":"Wendy Davis says we're going to see a \"women problem\" with the GOP's presidential candidates. Here's why:"},{"comment_id":"10153203209001336","commenter_b":"THANK GOD THERE ARE MOTHERS LIKE HER I WOULD DO THE SAME THING IF IT WAS MY KID!!","commenter_a":"Lets hope she isn't accused of child abuse!","post_message":"VIDEO: A woman is seen beating a rioter in Baltimore. It turns out he is her son."},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"}]
