[{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."},{"comment_id":"758826910928758","commenter_b":"Those fucking bastards.....we gotta gut em, then kill them, then gut em again, then smoke a blunt or two and plant a tree and then maybe spread their entrails on our enemies lawn so they get the message.","commenter_a":"There's obviously some sort of mysterious group of people who have been trying to hide the advantages of the hemp plant to prouduce many of our products for everyday use.","post_message":"The solution seems obvious, doesn't it?"},{"comment_id":"1202725173156591","commenter_b":"@username Seriously? Class, the next one? Give me a break. Michelle has more class in her pinky than Trump's wife has in her entire body.","commenter_a":"You would make me proud if you would return all the millions and millions of taxpayer money you spent on vacations! p.s. Your fired!","post_message":"Michelle Obama chokes up in final speech: 'Being your First Lady has been the greatest honor of my life.' @webpagelink"},{"comment_id":"10154428914569411","commenter_b":"What refugee crisis? These invaders are not refugees.","commenter_a":"I have never seen such inhumanity as I have seen in the west where personal freedoms are more important than justice and what is right. The REFUGEE crisis is just the latest example of this.","post_message":"'Our chancellor has given up the sovereignty of the country, she has given up our borders, she has given up our rules and regulations'"},{"comment_id":"10153409033281833","commenter_b":"How is it racism the mulford act wasn't supported by the nra?","commenter_a":"In the 1960's when the Black Panthers were arming themselves and encouraging inner city blacks to arm themselves as protection from the government the NRA was an active advocate of gun control....and then they found they could make more money arming back woods, uneducated white guys. @webpagelink","post_message":"Amid a surge in violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases. Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim: \"There no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared."},{"comment_id":"1274246805922508","commenter_b":"Of course it's happening in England and if Americans don't wake up, you will see it here too. Open the Bible and read it with your family. it will show you who God is and who this muslim god is. Protect your family at all costs.","commenter_a":"If this is allowed to happen in the US, then mistakes have been made, and someone will need to pay!","post_message":"This school has taken things WAY too far. This is ridiculous. Is this school committing a crime?"},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""}]
