[{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."},{"comment_id":"10154247544237894","commenter_b":"Damn yo mama mean BUSINESS!","commenter_a":"one year my brother and i unwrapped all our Christmas presents before Christmas and my mom found out and took everything back, i would've much rather gotten the ASS whooping instead.","post_message":"Say What Now? Indiana Woman Arrested After Beating Kids for Opening Christmas Gifts Early"},{"comment_id":"10154071433569778","commenter_b":"You know him or something?","commenter_a":"Gordon","post_message":"A 9-year-old boy beaten by his mother's boyfriend over birthday cake died from his injuries."},{"comment_id":"10155001030118908","commenter_b":"Angie ???","commenter_a":"Simon","post_message":"Science says practicing mindfulness exercises increases gray-matter density in the hippocampus!"},{"comment_id":"1054874157886389","commenter_b":"Well lets start with little jebs mommy! She is one horrible excuse for a human being!!","commenter_a":"whatever happened to divided CHURCH and STATE,,???","post_message":"A Republican strategist had the gall to defend Jeb Bush for supporting the public shaming of women who don't live up to his strict conservative \"Christian\" standards."},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""}]
