[{"comment_id":"10156543098270354","commenter_b":"So he opens the gates to let them in and then starts deporting them. I smell a RAT.","commenter_a":"Great but post it on obama and hillarys pg","post_message":"Obama Photo-Op Head Fake.  Don't Believe the Hype..."},{"comment_id":"10153155195841323","commenter_b":"It's dangerous to be right when the government is wrong. -Voltaire","commenter_a":"reminds me of the USA..","post_message":"Inside B’Tselem, the Israeli human rights group accused of treason for documenting the violations of its own government."},{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"},{"comment_id":"10153863012497042","commenter_b":"Stfu pussy","commenter_a":"Well, The Knicks Can't Hit A Shot, But I Guess Shots Can Hit Them...","post_message":"BREAKING: New York Knicks player Cleanthony Early was held up at gunpoint and shot in Queens just hours ago, NYPD says."},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."}]
