[{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"962475507142312","commenter_b":"I KNOW!!!!! They've already started. It's so funny!!","commenter_a":"That will drive them crazy","post_message":"Why does Hillary love Snapchat? Watch and learn:"},{"comment_id":"753100741547170","commenter_b":"That whore cares so much about the us she built a school in Africa!!!!","commenter_a":"Fuck that","post_message":"Obama Wants To Put Oprah Winfrey’s Face On The New Dollar Bill.  This is ridiculous. Leave the dollar alone.  Do you think they should get the dollar bill as it is?"},{"comment_id":"10153376789317550","commenter_b":"They are corrupt!!","commenter_a":"The judge also needs to be dismissed. Mosby is clearly biased and has acted with contempt throughout the whole process.","post_message":"The charges against the six police officers linked to Freddie Gray's death will not be dismissed and State's Attorney Marilyn Mosby will not be recused from the case, a judge ruled today.  Details here ---> @webpagelink"},{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON \"federal\" reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"},{"comment_id":"647476645408815","commenter_b":"Please don't get me started on this WITCH","commenter_a":"HAHAHA Hillary blasts Trump for being a parent! Trump went to Scotland to support his son for building the golf course! He was being a father! Hillary is the one who can't handle business. She lost $6 billion on her watch.","post_message":"Hillary Clinton blasted Donald Trump, saying during this time the U.S. needs a leader that will \"put the interests of the American people ahead of their personal business interests.\" What do you think about this?"},{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."}]
