[{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"},{"comment_id":"1287419524611131","commenter_b":"Lefty lady","commenter_a":"My peeps","post_message":"It's National Left Handers' Day! Did you know only 10% of the U.S population is left-handed? Comment below if you're a lefty like these celebrities. >> kiro.tv/Famous-Lefties"},{"comment_id":"10153074507087908","commenter_b":"Only Decent Republican President lol !!! @webpagelink","commenter_a":"Today, Ike would be a center-right Democrat.","post_message":""},{"comment_id":"10154992075558256","commenter_b":"I agree","commenter_a":"Nobody equates \"America First\" with WWII references anymore - most of that generation is no longer alive. If you walk up to the majority of Americans on the street they will not be able to identify that historical reference. You are stretching for a story here.","post_message":"The phrase galvanized a mass populist movement against U.S. entry into WWII. While it attracted a wide array of support, its highest profile spokesman, Charles Lindbergh, blamed American Jews for pushing the country into war.  Trump started using the slogan in the later months of his campaign, and despite requests from the Anti-Defamation League that he drop it, he stuck with it."},{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."},{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send \"must pass\" legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"}]
