[{"comment_id":"10154496338258525","commenter_b":"Would love to see more of Bindi, Robert and Terri would love a show from the zoo. Steve will always be one of the greatest wildlife conservationist to have ever graced us with knowledge and just a fun loving man truly missed","commenter_a":"Crykie I miss him","post_message":"REMEMBERING STEVE IRWIN: His daughter, Bindi, who continues to walk in her father's footsteps, posted a touching tribute to The Crocodile Hunter on what would have been his 55th birthday. Rest in peace, Steve Irwin. \"Always in our hearts.\"  STORY: @webpagelink"},{"comment_id":"10153986549963132","commenter_b":"stupid bs, she feels fat and ugly.grow up kim.","commenter_a":"Oh please. She acts like she is the only woman that has ever had problems while Pregnant.","post_message":"Kim Kardashian West is opening up about what could potentially be a very scary delivery."},{"comment_id":"10153641394251350","commenter_b":"I think she would be a skank in a princess gown.","commenter_a":"Hilarious ! She has guts. Good for her!","post_message":"What did you think of Miley Cyrus' first outfit of the night at the MTV Video Music Awards?"},{"comment_id":"10153867280412377","commenter_b":"When illegals, dead people and multiple pollers etc, wait c and see how it goes, did the blm intimidate or black panthers block door or maybe machines were screwed up again Save your voting receipt just incase","commenter_a":"Donald Trump has 0% chance of winning the election. Gary Johnson 2016","post_message":"Pete Hoekstra to Newsmax TV: Trump reserved the right to reject. Watch coverage on @webpagelink"},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"928522093922469","commenter_b":"The plans he has put in place, is FILL AMERICA WITH MUSLIMS AND ILLEGALS....\"GROWTH OF THE ECONOMY IS HIS MUSLIMS AND ILLEGALS IN PLACE FOR A WAR\" SO HE DOESN'T HAVE TO LEAVE THE WHITEHOUSE......WHY DO YOU THINK HE SAID HE WAS GOING TO STAY IN WASHINGTON FOR 2 MORE YEARS, SO \"SASHA\" COULD GRADUATE THERE? HE SURE IS NOT GOING TO PAY THE COST OF HER SCHOOLING OUT OF HIS POCKET....... WAKE UP, AMERICA....THE REASON HE IS NOT IMPEACHED, IS BECAUSE MOST OF THE ONES WHO WOULD HAVE DONE IT, ARE NOT AMERICANS, BUT ARE MUSLIMS.....","commenter_a":"To have a strong economy you need more Americans working and Obama's policies stand in the way of Americans going back to work again. Obama did place an incentive for employers to hire new workers BUT he also put a heavier tax burden on employers to keep their new hires.","post_message":"WATCH Obama:  is pretty darn great right now, and making strides right now...And I don expect that these facts and this evidence will convince some of the politicians out there to change their doomsday rhetoric"}]
