[{"comment_id":"1063108630412332","commenter_b":"Hillary is such a flipflopper!","commenter_a":"If the War in Iraq made your family safer, Hillary is your candidate. If the USA PATRIOT Act secured your family, then Hillary is your candidate. If your family reaps the benefits of institutionalized racism in our justice system, then Hillary is your candidate. If you want more expensive healthcare, vote Hillary. Mine is currently $475/month (compared to my $25/month car insurance from Insurance Panda, or my $10/month dental insurance, but I digress). Hillary is in bed with big pharma, she is your candidate. If you want to vote democrat, but still want to bomb Iran, then Hillary is your candidate. If you really benefitted from the Housing crisis or from Monsanto bankrupting small farmers or Big Pharma price gouging the sick, then @username is your candidate","post_message":"“It’s not just that she’s done her homework—Mrs. Clinton has done her homework on pretty much any subject you’d care to name.”"},{"comment_id":"986494124719342","commenter_b":"Who cares! Go home where u b long","commenter_a":"They have their country they can go back home anytime. We do not need to have them visit anymore","post_message":"Donald Trump's promise could change EVERYTHING!"},{"comment_id":"10153454938709330","commenter_b":"R.I.P","commenter_a":"Just heartbreaking ... Your with your mom...Rest in Gods Grace and Peace.","post_message":"Sad news to report. Bobbi Kristina Brown, daughter of Whitney Houston and Bobby Brown, dies at 22.  More here ---> @webpagelink"},{"comment_id":"10153712266449199","commenter_b":"Nutter psycho...we need her out on the streets ..","commenter_a":"She killed him...we all know it..","post_message":"BREAKING:  Hung jury in Jodi Arias case, judge will now decide her fate"},{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"},{"comment_id":"10156121117545354","commenter_b":"Go after his sorry ass also","commenter_a":"Kerry is a fool. I respect Gowdy. Great research Elizabeth ...","post_message":"You need to see this..."},{"comment_id":"10154048881589753","commenter_b":"They both need to be charged she was sorry as hell to let him do that your kids come first","commenter_a":"I sure hope they don't place that child back with her. Lock her up until she is too old to bear any more kids. Where are the Fathers nd Grandparents of these abused kids?","post_message":"An Arkansas mother and her boyfriend were taken into custody and charged with first-degree domestic battery after the woman’s four-year-old daughter was found zip-tied to her bed, reports KTLA. Jennifer Diane Denen, 30, and her 47-year-old live-in boyfriend, Clarence Eugene Reed, both residents of Hot Springs, were taken into custody last week after a staff member at the Cooper-Anthony Mercy Child Advocacy Center found Denen’s daughter to be severely malnourished and abused, according to The... @webpagelink"}]
