[{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":""},{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"\"Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.\""},{"comment_id":"10152774777037293","commenter_b":"Really????!!!haha...yeah thats funny.Is that why he cherishes illegal aliens more than Americans?","commenter_a":"I believe Giuliani is incorrect....I think Obama would like to see a better America....as many Americans would as well!","post_message":"\"I know this is a horrible thing to say,\" he commented."},{"comment_id":"624113881076675","commenter_b":"He's a freaking idiot!! Hitler reincarnated!! Good on Miley","commenter_a":"No, obama acts like that, lol","post_message":"Miley Cyrus is not a Donald J. Trump fan."},{"comment_id":"10154423395266800","commenter_b":"Bitch you trippin","commenter_a":"The way Trevor Noah struggles with jokes, hardest job seems to be Jon Stewart's replacement","post_message":"Think your job is a drag? Try being one of Trump's surrogates."}]
