[{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"},{"comment_id":"10158125601040615","commenter_b":"America could only be so lucky.","commenter_a":"I think Trump is now afraid somebody just may be planning to 'take him out'. He should have thought of that before.Oh, yes, I forgot, he doesn't have a working brain!","post_message":"But..."},{"comment_id":"10153533558288984","commenter_b":"EXCELLENT!!!!!!!!","commenter_a":"Yes, Christians need to stand together. The Supreme Court opened the door to more then gay's rights.","post_message":"Black pastors just made a drastic announcement about gay marriage... and they're refusing to back down.  This shows just how far they're willing to go to stand for their beliefs... spread this everywhere if you support them."},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"684986371683559","commenter_b":"Emotiotionless phony lying bitch","commenter_a":"Rich & stupid","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"1046361932108447","commenter_b":"Wow, stupid bitch","commenter_a":"Kiss off Obama you are worthless !!! Go Donald Trump For President !!! Would be Great if Obama was for us Americans like he is for all the out siders !!!","post_message":"President Obama is urging the Senate to pass a bill to help Puerto Rico with their recession and debt crisis. What do you think about this?"}]
