[{"comment_id":"10155797026705354","commenter_b":"To someone above, I wash my own car. More Americans are growing their own gardens. I rarely go to hotels. Their whole argument is false though because we have had immigrant worker programs for decades. Obama is intentionally flooding the country with illegals. Read about George Soros and his open border group. The man is evil.","commenter_a":"We are the force that keeps the country afloat.\" is she for reals? we were floating right along wa before illegals came along.","post_message":"\"Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.\""},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":""},{"comment_id":"10153392928479170","commenter_b":"Don't you feel safe now that the country is being run by grunge mosh pit princesses like this character?","commenter_a":"She is a leftist loon with zero common sense. A perfect fit for the Obama team.","post_message":"The woman who gave you \"jobs for Jihadis\" is now working on the Iran nuclear deal. Time to \"Duck and Cover.\""},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"10153992973507439","commenter_b":"Ms Reker is a WHORE","commenter_a":"What is it with the majority of women...do you not get angry, do you not want to beat the crap out of men like that? Whether we like it or not ,women, you are on your own. The only way to fight this is to fight, not because you like it but because we will have to. Your governments and I mean every government is in this together, they have planned the events, they are the movers of the migrants, they are manipulating every inch of this planet..Wake the heck up people. And women you will not only have to physically fight against the men that rape, you will have to fight against the women who are in power. The world for the general population will be returning to a dark time, a time where there were tribes and clans, you will have to be in a group to survive ...","post_message":"The Mayor of the City were hundreds of women were robbed, sexually attacked, molested, even raped on New Years Eve is blaming the victims. Worse still, the Mayor is a woman.  The mayor of Köln, Henriette Reker, intends to publish a behavioral code for the forthcoming carnival in Köln. But if you think that this behavioral code is meant for the muslim mobs, you are wrong. This behavioral code is meant for the victims, the women."},{"comment_id":"765874163568797","commenter_b":"Unfortunately, so true.","commenter_a":"How are you guys able to post, I thought the Obama phones were shut off already?","post_message":"We have nobody to blame but ourselves..."},{"comment_id":"10152601716778837","commenter_b":"Stupid a$$ b**ch...","commenter_a":"Another arrest, more jail. He's a bully and is still playing god. It's just a matter of time before he kills again..","post_message":"BREAKING -- George Zimmerman arrested in Florida @webpagelink"}]
