[{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"10153409124091955","commenter_b":"End and rescind birthright citizenship, build the wall, kill el shorty, deport the stragglers.","commenter_a":"kinda gives credence to Mr. Trump's assertions on illegals huh","post_message":"EL CHAPO WARNS TRUMP TO SHUT MOUTH"},{"comment_id":"10150935121129999","commenter_b":"She did say that but she said it was because of the mother's health.","commenter_a":"As an avid hater of Trump, it's hard to read this because I am so tired of Trump supports blaming all bad press about Trump on the \"liberal media\" but this is supposed to be a fact checking exercise and it is just so obviously biased and sarcastic and the tone does not come off as objective at all. It would be nice to see something written that fuels the \"evil media\" fire a little less.","post_message":"We're fact-checking the presidential debate with Hillary Clinton and Donald J. Trump: @webpagelink"},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"10152731282606051","commenter_b":"She is one sick bitch.","commenter_a":"She takes care of a disaled child and sick husband , I would worry aout what she would do to them as well. The punishment is far to lienient.","post_message":"This lady arranged to have a woman raped after she outbid her for a home. Some say her punishment should’ve been more severe. Decide for yourselves if that’s true."},{"comment_id":"10152908039036491","commenter_b":"Exactly mark. What about people who use PED's? Where is that integrity?! Why isn't their team also punished? Wes Welker violated those rules with Denver. But it got retroactively sustained due to rule changes. Are you kidding?!?!","commenter_a":"In the end his punishment had nothing to do with deflated footballs. It was for behavior detrimental to the integrity of the game and the league. Read the letter to Brady explaining his punishment. Accountability goes a long way, too bad tb, belicheck and Kraft don't know the first thing about it.","post_message":"More bad news for Tom Brady."}]
