[{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"10154991575839170","commenter_b":"Donald Trump our President will repeal it !!! And all politicians will live on the same policies","commenter_a":"He's a turncoat I do not trust him","post_message":"We didn't like it at the time, but let's compare what would have happened then to what's about to happen now."},{"comment_id":"10153224902339411","commenter_b":"Jonathan Toothman","commenter_a":"75% of that data is outdated wrong and non existent. i always give fake info when they ask","post_message":"Quick before NSA snaps it up"},{"comment_id":"10152998251641045","commenter_b":"She should not be allowed the 10 as pets! Remove all the animals! What if those 10 are someones pets!","commenter_a":"Did she also house cats? I haven't read of any being there, but I wondered what happened to them if there were. Being that she was acting as a shelter for the county there should have been.","post_message":"The ASPCA's disaster response vehicle is now on site in Lawrence County to help remove more than 250 animals from the shelter. Police continue to guard the entrance, admitting only those who are helping with the investigation or caring for the animals."},{"comment_id":"948553515267521","commenter_b":"Hillary is a big fat liar and she will never be president.","commenter_a":"Lol","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"708398475965965","commenter_b":"@username You a liberal Troll go away.","commenter_a":"Bullshit. Hillary Clinton is losing and losing badly. Hey liberal media....we're not listening to a damn word you say.","post_message":"Hillary Clinton regained her lead in the polls over Republican challenger Donald Trump after she accepted her presidential nomination Thursday evening."},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."}]
