[{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"1832691560303641","commenter_b":"Good don't want you back in the White House!","commenter_a":"Thank goodness, not that she would ever get elected after her husband's lousy job.","post_message":"It looks like we'll never see an Obama in the White House again. Is that good news to you?"},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"737701373087107","commenter_b":"That's what Americans should be saying. These people killed by this illegal immigrants should have been deported years Ago or been in prison. Many had records and let out of jail anyway. It seems the norm the people we elect turn out to not do what they were elected to do. Get them out from the president on down. Democrats are not the party of the working class anymore.","commenter_a":"This is a great idea","post_message":"Share if you agree."},{"comment_id":"587298078081643","commenter_b":"You dumb bitch","commenter_a":"Pasco ain't little","post_message":"That sort of puts things in perspective, doesn't it?   @webpagelink"},{"comment_id":"10154442937338690","commenter_b":"@username sunni Arabs do not deserve a state.","commenter_a":"Since Iraq invasion, the people have only seen bloodshed, division and their oil is stolen. I guess, this is what 'divide and conquer' looks like!","post_message":"More than 200 people were killed in Iraq's capital, Baghdad, in a suicide bombing attack claimed by ISIL"}]
