[{"comment_id":"10153300908534411","commenter_b":"She doesn't want the truth.","commenter_a":"Blacks kill more blacks if you really want the truth.","post_message":"An analysis released last week shows that more white people died at the hands of law enforcement than those of any other race in the last two years, even as the Justice Department, social-justice groups and media coverage focus on black victims of police force."},{"comment_id":"10153580191021438","commenter_b":"You folks just restored my faith in humanity","commenter_a":"If I didn't live on exactly the opposite side of the USA (SC!) I'd totally be holding a sign up there with her.","post_message":"“I knelt down to a protester's kid and said, ‘Do you know about yeast infections?’”"},{"comment_id":"1736968439901263","commenter_b":"@username - nobody in this world is a bigger liar than Hillary. Period.","commenter_a":"Why is it when her lips move my first thought is liar liar pants on fire...when will she tell how much she took from foreign governments - oh well, what difference does it make anyway","post_message":"Watch: Hillary Clinton suggests Donald J. Trump hasn't paid his taxes."},{"comment_id":"10152857633614753","commenter_b":"why these people even walking the earth...round them up and send them to isis","commenter_a":"Assholes a","post_message":"These people need to be banned from America."},{"comment_id":"616988195096921","commenter_b":"If they don't like it, what can the Republicans offer that's better. We need well educated people.","commenter_a":"Where do I sign?","post_message":"The President just announced something very BIG - a proposal to make two years of community college free for anyone who’s willing to work for it.   #FreeCommunityCollege"},{"comment_id":"1120776417932667","commenter_b":"Whoop-te-do! What an earth-shattering piece of news that is! One loser endorses another loser... ho-hum.","commenter_a":"the end of Jeb","post_message":"Lindsey Graham endorses Jeb Bush for president"},{"comment_id":"488489361275658","commenter_b":"Don't think she will get off easy this time.","commenter_a":"She will get off easy because she's a cops wife","post_message":"A cop's wife did this to another cop's wife. I wonder what on earth she was thinking!"}]
