[{"comment_id":"1186921104703676","commenter_b":"Graciela Rojas","commenter_a":"Unfucking believeable!","post_message":"WATCH: Shocking police shooting of an unarmed black man attempting to help a suicidal man with autism, caught on camera; the man is now recovering: @webpagelink"},{"comment_id":"10153226681651833","commenter_b":"Thanks Jason - the \"next one\" will probably effect me, though.","commenter_a":"I don't even own an AR, but I sent an e-mail to the ATF \"comments\" site opposing the ban on M855. I also sent e-mails to my congressman and both senators and signed a petition about the same issue. I suspect that the motivation is simply that the government doesn't want those who own ARs to have a source of reasonably priced ammo for their guns. I oppose this mindset.","post_message":"A notice from the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) shows the agency is considering a ban on the popular M855 AR-15 round  by re-categorizing the round as  piercing.  Be sure to contact ATF and let them know you oppose this proposal. Then contact your members of Congress and express your opposition to ATF's ammo ban.  @webpagelink/ #M855"},{"comment_id":"10157199580185231","commenter_b":"Congratulations!","commenter_a":"Congratulations","post_message":"This will make her the first African American recipient in the award’s 21-year history. Congrats Gwen Ifill!!"},{"comment_id":"1083743574979986","commenter_b":"nah, bitch. not now.. just getting going :)","commenter_a":"forced depopulation by way of financial and imprisonment threats.. sad..","post_message":"The Australian government will tighten the rules requiring children to be vaccinated in order for parents to receive welfare payments and childcare subsidies."},{"comment_id":"862770227128920","commenter_b":"Ted Cruz loves our country Hilary hates our country and all true Americans!! I would never vote for her or any Dem.","commenter_a":"Yes!","post_message":""},{"comment_id":"10153409033281833","commenter_b":"How is it racism the mulford act wasn't supported by the nra?","commenter_a":"In the 1960's when the Black Panthers were arming themselves and encouraging inner city blacks to arm themselves as protection from the government the NRA was an active advocate of gun control....and then they found they could make more money arming back woods, uneducated white guys. @webpagelink","post_message":"Amid a surge in violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases. Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim: \"There no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared."},{"comment_id":"440337219424652","commenter_b":"If your not Born in Africa, how are u African, He's right, I dont say I'm scottish, I say i'm an American, People need to stop playing this devide and conquer game the rich is playin thru the Media, which they own, thru the military with constant wars which profit the rich, and of CORSE MONEY, the one and only thing the rich care about. EAT THE RICH! They are the enemy!","commenter_a":"This is a very poorly written article","post_message":"A Florida Sheriff is in hot water after a 2013 racist rant he recorded on video has surfaced just before he begins to gear up for re-election. Watch the video then read our commentary by Lou Colagiovanni"}]
