[{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"863999693637372","commenter_b":"first lady has no class what so ever id be embarrased sitting next to them","commenter_a":"michelle has the class of fergusson protesters","post_message":"“Michelle Obama looks like she’s part of the cast of...\""},{"comment_id":"10154620452720575","commenter_b":"She should have had a gun!!!!!","commenter_a":"Was it a Muslim?","post_message":"WIFE OF MISSOURI GOVERNOR-ELECT IS ROBBED AT GUNPOINT IN ST. LOUIS!"},{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"10152902010080950","commenter_b":"I am sick and tired of these calls. I get them all the time on my business phone and my unlisted home phone. Especially Google. They are one of the worst.","commenter_a":"You let them know not to call you again usually by hitting 3 but it doesn't matter as they'll call you again using another number. Most are spoofed numbers. I had my own phone number come up on Caller ID one time! there is a site that you can check out numbers, www.800notes.com to let others know about the callers but the telemarketers don't care about that site. I see a lot of people on there saying to \"Stop calling me!\" yet don't leave their number. Yes, I'm tired of the \"Lower Your Credit Card Interest\" or letting me know about a topical pain ointment. Be aware of those calling saying that they are the IRS or police telling you to pay up using a pre-paid debit card. Callers also try to tell you that your computer has issues and that they are from \"Windows\", not Microsoft. I mess with ...","post_message":"\"If [phone companies] came out with an ad, 'We're going to block robocalls,' I mean, I don't think they could handle the business they would get,\" Missouri Democratic Sen. Claire McCaskill predicted."},{"comment_id":"977002452335214","commenter_b":"Slaves","commenter_a":"the American people need to rebel against this. Citizens of a nation( especially one a great as america) should not have to live in fear of police persecution. The whole police force needs reform. The dirty cops, racist cops and just dam right bad police officers need to go. If your a trigger happy racist peace of shit who hides behind a badge and a gun to only parade around saying your a protector of peace, you need to be weeded out. Police in america don't know how to be police. Other countries around the world have polices forces that can control far greater numbers than america and without the casualties.","post_message":"Very disturbing video shows police killing a restrained man with three shots to the back."}]
