[{"comment_id":"10153974318380496","commenter_b":"Let them protest but not riots, vandalism and violence. These people r starting to scare me. Saw a sign outside trump towers saying rape melania and kill trump. What kind of people r they. Trump has to stay cool and not start tweeting.","commenter_a":"Thank God someone with common sense.","post_message":"While protests in Atlanta and around the country have been peaceful, that isn't the case for all. Now a major city's officials are saying that enough is enough.  “If you’re upset with the election, please don’t come out and protest,” the city's police chief said. “We are done with criminal activity in this city. It’s time to move on and to move forward.”"},{"comment_id":"10153503971232464","commenter_b":"That's an awesome plan, and repeal Obamacare! Defund Planned Parenthood & NO to Iran Deal! Cruz/Trump--2016","commenter_a":"@username 2016!","post_message":"If I'm elected President, the very first thing I intend to do is rescind each of President Obama's illegal and unconstitutional executive actions! #CruzCountry"},{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10154559910664087","commenter_b":"@username: Are Christian refugees beheading non-Christians?","commenter_a":"They can rewrite it. However, they still have the footage of Trump calling for a Muslim ban on the campaign trail.","post_message":"BREAKING: White House attorneys are working on rewriting the language of President Trump's immigration ban following yesterday's dramatic defeat in the appeals court."},{"comment_id":"10154292449213525","commenter_b":"She didn't sleep with babe in bed purposefully by the sounds of it... She fell asleep. Big difference in that one is purposeful, one is accidental. New moms are exhausted.","commenter_a":"So sad..so dangerous. I had my baby in his crib until he was 1","post_message":"\"Do not co-sleep with an infant,\" Sheriff Grady Judd insists.  \"Co-sleeping with infants is just an absolute no.\"  His deputies have arrested a Winter Haven woman after they say her \"horrific negligence\" while co-sleeping with her newborn baby led to his death -- for a second time: @webpagelink"},{"comment_id":"700248193457289","commenter_b":"@username honey your aluminum cap should b worn at all times ...","commenter_a":"When he opens his mouth he divides. Expected from a 1/3 white 1/3 black and 1/3 Arab who is a closet Muslim. Conflicted hate eVeryone but MUSLIMS. THATS TRUTH NOT A FALLING LYIN' tree.","post_message":"Probably... but we'll never really know will we?  Hostile Politics"},{"comment_id":"1419706908060869","commenter_b":"What rights do women not have again?","commenter_a":"Suck it up... lol he won and he IS your president. I love liberal whining people it makes it all that more enjoyable to get on here and see them crying.","post_message":"\"You're orange, you're gross, you lost the popular vote,\" a crowd at the Women's March in Washington chanted today.  Millions marched in D.C. and around the world for women's rights and against President Donald J. Trump's inauguration: @webpagelink"}]
