[{"comment_id":"1131302460296897","commenter_b":"@username let Bill Clinton around them it might really happen.","commenter_a":"Pandering 101 taught by Professor @username. African Americans KNOW that you will ignore them again once the election is over. Your KKK ties and hot sauce lies are blatantly obvious. #NeverHillary #HotSauce #HillaryLies #TRUMPPENCE2016","post_message":"\"You want to give me a good send off? Go vote!\" —President Obama IWillVote.com"},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a \"look\" anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"\"Being Muslim doesn't make me any less American than you are,\" she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"10153147861257060","commenter_b":"That's her dumb ass then.","commenter_a":"She fell for the Kenyan Prince trick, lol","post_message":"A Metairie woman was duped into sending more than $195,000 to man she knew only through Facebook, according to the Jefferson Parish Sheriff's Office."},{"comment_id":"363905233797771","commenter_b":"Stupid wench. I hope her show and all of her movies bomb.","commenter_a":"And the answer to your question, YES. Oprah is a racist....","post_message":"Is Oprah a race-baiter?"},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"},{"comment_id":"1181219778640173","commenter_b":"She's crazy!","commenter_a":"she needs to fall on the other side of her face","post_message":"Typical Hollywood liberal elite, who compares everything she doesn't like with the Nazi regime."},{"comment_id":"753406171459230","commenter_b":"She should be drawn and quartered. That will hush he up.","commenter_a":"Blacks are useless lot of people. over 90% vote democrat and are indoctrinated in marixist doctrine. useless.","post_message":"MSNBC's Melissa Harris-Perry slammed a Latino Republican guest for using the word “hard worker,” because to her, the term “hard worker” only applies to former black slaves.  Here's Mike Rowe's BRILLIANT response. Spread this everywhere!"}]
