[{"comment_id":"1438428362916880","commenter_b":"No, we, the REAL constituents, are not there and we are upset because we're working to pay our bills, support our families, fund illegal aliens, fund refugees, fund multi-generational welfare families, fund single mothers who don't know who their babies daddies are, pay for the prisons to hold baby daddies who make kids then get thrown in jail etcetera etcetera etcetera...","commenter_a":"Oops shouldn't have texted both when I offered 3","post_message":"Spot on."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."},{"comment_id":"10156335806925725","commenter_b":"ahahah im sorry you said lead... omg kill yourself please xD","commenter_a":"President Obama is being a leader - something that Donald Trump only dreams of.","post_message":"What is our President doing?"},{"comment_id":"10155207800518132","commenter_b":"She looks like a drag queen!","commenter_a":"Sad she hates herself so much to keep mutilating her body.","post_message":"Kim Zolciak Biermann is feeling nostalgic!"},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"10155784573999657","commenter_b":"Does this woman ever smile?","commenter_a":"Has she and all other politicians done this already or are planning to follow what she wants?? If not why should Mr Trump do something no other politician has ever done!! Can't hold him to a standard that no one else is following or has ever followed!!!","post_message":"Ethics and Intellectual Consistency."}]
