[{"comment_id":"10152929148789342","commenter_b":"That statement coming from a welfare trashy tattooed old skank. Go figure.","commenter_a":"aand let the killings begin...smh","post_message":"BREAKING -- The Texas Senate has given preliminary approval to allowing concealed handguns in college classrooms, a day after passing a measure allowing open carry of guns most everywhere else in America's second most-populous state.  FULL STORY ---> @webpagelink/  What do you think -- are guns on campus a good idea?"},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"1420023134696147","commenter_b":"She really believes she has the right to treat that man disrespectfully because she disagrees with his views. What is wrong with people? Great job by the airline.","commenter_a":"Need to see more in many other places.","post_message":"WATCH! Anti-Trump Hag Gets Kicked Off Flight After Threatening TRUMP Supporter...Passengers Clap! [Video]"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"371202926416555","commenter_b":"^^^Suck one, racist prick !!!","commenter_a":"What's missing? Blacks!!","post_message":"Real Protest = No Damage www.eaglerising.com"},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"1025085544195452","commenter_b":"@username , are you Canadian ? If so , we will gladly ship a few million muslims to your neighborhood","commenter_a":"That \"teacher\" should be fired!!","post_message":"“My daughter wanted to know why she was asking her that.”"}]
