[{"comment_id":"10153503592741336","commenter_b":"LOVE HIM!","commenter_a":"I CAN NOT TRUST THIS GUY NO A biT I RATHER VOTE FOR NOBODY TO GIVE HIM MY VOTE, HE COULB BE WORST THAN OBAMA. WISHY WASHY GUY.","post_message":""},{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"\"HELL NO \"","post_message":"Is Hillary Clinton America's best choice for president in 2016?"},{"comment_id":"10152741444625950","commenter_b":"Well ladies, the Navy Seals BUDS training awaits you . You'll both cry, bitch, and quit within hours.","commenter_a":"I'd be scared too. It's simple - woman are NOT AS STRONG as men. It's a fact and when your dealing with the most dangerous and physically demanding covery ops - woman need not apply.","post_message":"Men in U.S. special operations forces don't think women can meet the physical and mental demands of their commando jobs, according to the survey."},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"10154377682500575","commenter_b":"She is done. She knows that she can't beat Trump. So she is play the frail feel sorry for me tactic. She is no good for our Country she hates American citizens she hates minority's she is only after fame and fortune from crooked dealings. Drop out of the race Hillary save yourself the embarrassment of getting your ass beat in a landslide.","commenter_a":"What attack in minnasota n when","post_message":"Get this poor tired woman to bed! Hillary looks like she's going to pass out after speech in DC and bombs in New York."},{"comment_id":"10155993779265389","commenter_b":"Carson and Fiorina PERIOD","commenter_a":"Dr. Carson","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"}]
