[{"comment_id":"1283735711683013","commenter_b":"horrible woman","commenter_a":"How bitchy she is...very bad attitude though","post_message":"The Hungarian camerawoman who tripped and kicked migrants has been sentenced."},{"comment_id":"10156121117545354","commenter_b":"Go after his sorry ass also","commenter_a":"Kerry is a fool. I respect Gowdy. Great research Elizabeth ...","post_message":"You need to see this..."},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"},{"comment_id":"10154175784276509","commenter_b":"So how bad do you want a woman elected?","commenter_a":"Bernie Sanders cannot win a national, general election. Social media supporters should probably accept this.","post_message":"Bernie Sanders is signaling that he's increasingly willing to take personal shots at his chief rival Hillary Clinton in the Democratic primary."},{"comment_id":"10153792015980695","commenter_b":"Why white woman","commenter_a":"I'm just saying. I would stop if I hit a deer or a white woman. I can tell the difference also.","post_message":"“For someone to know you hit my mom and never even tried to stop or brake, I don't understand that.\""}]
