[{"comment_id":"10157731504125354","commenter_b":"why are our prisons full of illegal aliens who have broken the law? why don't we deport them? why? why? why?","commenter_a":"She should be held personally liable.... but she won't.","post_message":"So many acts of love..."},{"comment_id":"1862910250609136","commenter_b":"Girl bye, take your dirty mouth with you","commenter_a":"Go to Gitmo you A hole!","post_message":"Lol. Celebs can't even."},{"comment_id":"926693817463797","commenter_b":"Fuck u bitch","commenter_a":"Good :) anything to make more conservatives whine and bitch like the petulant children they are.","post_message":"This is just plain sad..."},{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"10152746311166519","commenter_b":"Thus hes still a bitch!!!","commenter_a":"This igit wouldnt last .5 nanoseconds in the south bronx","post_message":"Ladies and gentlemen, this is pure Fox News: “If I see a group of blacks coming at me with hoods on, I’m walking to the other side of the street.\""},{"comment_id":"10153753811221051","commenter_b":"So tell me, how does a colored woman have a bronzed beachy glow? They want whites only.","commenter_a":"Oh lame. So now every ad for everything (make-up, sports, clubs, restaurants...) has to have a picture of male and female, old and young, straight and gay and transgendered, and ever single culture/race, etc. on EVERY single ad so as not to exclude? STOP IT.","post_message":"It only took a few hours for this photo to spark outrage. Take a look and decide for yourself if it's worthy of the controversy."},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"}]
