[{"comment_id":"961735010603412","commenter_b":"Good job Iowa","commenter_a":"Go trooks","post_message":"Join me in Iowa - attending a great event in honor of wonderful Senator Joni Ernst. Let's MAKE AMERICA GREAT AGAIN! #RoastAndRide"},{"comment_id":"10152923308511130","commenter_b":"Women lie about is ALL of the time, right?","commenter_a":"Imagine if women didn't falsely accuse men of rape because a man \"upset her\". (It happens ALL of the time.......) Maybe more men would reach out. Instead, modern feminists slam men daily then expect to be worshipped?","post_message":"Powerful."},{"comment_id":"464935007030413","commenter_b":"Best place in the world for a daily Pork roast.","commenter_a":"Deport their @&$)(;:/,?))&@@&))","post_message":"Should Islamberg Be Shut Down?  Comment 'yes' or 'no'."},{"comment_id":"10153584553228010","commenter_b":"time for a woman in the white house now","commenter_a":"Don't blame me for the situation of this nation. I did not vote. I opt out.","post_message":"What if you were automatically registered to vote? Oregon has a history as a ballot-box innovator."},{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"10153721168204170","commenter_b":"We have no room for their made up Allah in OUR Country!!!!! Go back to your Motherlands and take Nobama and Moochelle with you!!!!!","commenter_a":"Jeeze. I'm shocked","post_message":"Guess what block of foreign-born immigrants is growing fastest in the U.S?  If you said \"Muslims,\" you win a cookie. Make sure it's halal"},{"comment_id":"10153238029913822","commenter_b":"You guys sound like some broke ass jealous bitches!","commenter_a":"How tacky of a wedding pic","post_message":"Personal chefs, fancy cars, an expensive pool & more… at 35,000 square feet, it’s described as the biggest house in Pa.  And now it's the focal point of allegations made in a massive federal tax fraud investigation: @webpagelink"}]
