[{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"1199029986880444","commenter_b":"give out birth control pills....us older people didn't even have those in our days ....PPH sells baby parts so that's one reason they like abortions......","commenter_a":"And baby mortality will go down","post_message":"Cecile Richards: Maternal Mortality Will Increase if Planned Parenthood Defunded [VIDEO]"},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"},{"comment_id":"567131713411422","commenter_b":"It is Bloomberg who is the dangerous demagogue and Obama, and Biden","commenter_a":"No body can help us if Hillary.is elected.","post_message":"Michael Bloomberg said \"Trump is a risky, reckless and radical choice,\" during his DNC speech last night. He also asked his fellow Independents to support Clinton because she \"understands that this is not reality television  this is reality.  Do you think his speech will hurt Trump's chances with Independents?"},{"comment_id":"1237593022967110","commenter_b":"@username Because God made her a woman, SHE chose to be a sinner!","commenter_a":"Mormons are a religious cult not Christian in any shape or form. The only way that woman will ever change will be by the power of the Lord Jesus Christ and him alone.","post_message":"Beaten and made to carry bags of rocks for 18 hours a day"},{"comment_id":"10153532246695779","commenter_b":"She looks ugly with that hairdo","commenter_a":"This was a beautiful version! She added her touch yet kept the timelessness of this classic in tact. Bravo","post_message":"Sia has covered the Nat King Cole standard \"Unforgettable\" for the upcoming Finding Dory the long-awaited sequel to the Pixar hit Finding Nemo. Watch her debut the track below, during an appearance on 'The Ellen DeGeneres Show.'"},{"comment_id":"10153155479946051","commenter_b":"I take it, SHE is a woman who likes to dress as a man.","commenter_a":"Disgusting","post_message":"This soldier has been told point blank: You must wear a female uniform if you want to participate."}]
