[{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"1782129738697799","commenter_b":"She doesnt know, she just wants to bash him because shes a Kate fan.","commenter_a":"Shameful that these girls have been brainwashed.....the mother is more responsible for the marriage breakup. She treated the father horribly. TLC destroyed this family. Just as you have one mother young ladies; you also have one father. He nurtured you as well when you were babies up to the point your mother ran him off. Look at your old pictures and first episodes of your show. Your father was pretty much left with nothing.","post_message":"“He doesn’t even know us”"},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"},{"comment_id":"1115619658459044","commenter_b":"Yep. We're all whiney bitches to the gov and they'll find any means of manipulation and control. Welcome to the machine as we're all it's little bitch.","commenter_a":"You all are just a bunch of whining bitches!!","post_message":"Go California!"},{"comment_id":"785581448243402","commenter_b":"The people who are voting I know this is past but I can't vote for someone who can't keep our ambassadors safe and than with no feelings states what does it matter their dead well would she say that to if it was her family I as a lifetime dem. has changed my vote to rep. And if woman are smart trump hires woman, his wife's have their own jobs and buisnesses, and despite what Hilary says habout equal rights can woman want equal rights when you say men, have to clean up ,or need to be better looking, but if a man says it we can't take it what's good for the goose is good for the gander than we should be able to take it , rosie deserved what she got , and so did othe trump doesn't hate woman and to tell the truth hilarys open borders ...","commenter_a":"Funny that Hillary claims she wants to follow Obama steps after she has criticized him. Let's not forget this is the woman that as New York Senator voted for the Iraq War and in her own words she did it to thank you for George W bush help to New York during 911.","post_message":"\"She’s battle tested, she’s got a dirty uniform, and that’s who you want fighting for your kids’ future.\""},{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"}]
