[{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"452480794942501","commenter_b":"She's still a bitch! Stfu bitch!","commenter_a":"Fu:-)k her!","post_message":"Should We Ban This Word To Please Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10153260495114087","commenter_b":"She should run to prison!","commenter_a":"100 percent right","post_message":"\"I can tell you this, if that were a Republican that did what she did with the emails, they would have been in jail 12 months ago,\" Donald J. Trump said."},{"comment_id":"731938580238084","commenter_b":"We need to look at all facts here. It looks like the victim went looking for trouble. YOU DON'T ASK YOUR SON TO GO GET THIS GUN! I have a feeling she could have been alive today if she had acted like a responsible adult and called the police if he had threatened her. Also, if she was the victim of a gun fight which she started. I WOULD JUST CALL THIS SAD! SAD SHE DID NOT HAVE BETTER SENSE AND LESS ANGER!","commenter_a":"WaaaWaaaa!!!!","post_message":"He suffered a severe head injury, records show."}]
