[{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"10154373252360329","commenter_b":"Women can wear whatever they want.","commenter_a":"She's very talented & beautiful but please stop trying to normalize the antiquated religious practice of women covering themselves. Women have come too far to regress back to this BS! (That goes for Orthodox Jews, Islam, & Christian nuns.) Little girls all over the world: your body is not shameful! You do not need to be modest to lessen the desires of men or a masculine God! You are beautiful in all of your natural glory!","post_message":"She also does comic book characters and Kardashians."},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"},{"comment_id":"1686607741593351","commenter_b":"Morris @username For President Independent....Thompson say's \"I don't care about the F _ _ _ _ _ _ Wall\"! Under my plan I am going to enforce existing law that requires all employers document its employees right to work. There is an $11,000 penalty per illegal that will be used to pay for the deportation. Former Mexico President Vincente Fox I intend on overwhelming Mexico with illegals","commenter_a":"As they say in Espanol....p..... tu madre.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"642441049213821","commenter_b":"Crying over spilled milk. She should move on","commenter_a":"Our system does NOT invite tampering, if you asshats didn't decide to cheat. Pure and simple! And the fact that you and your ilk can so easily rationalize your way around the rules suggests that you're definitely part of the problem.","post_message":"Green Party presidential candidate Jill Stein says a recount is needed because the current voting system \"invites tampering\" and there have been many \"red flags\" with votes in the election. Should there be a recount?"},{"comment_id":"794164403965442","commenter_b":"F%%+ white people !!!","commenter_a":"This is why I hate white people!!!","post_message":"In an update to our previous coverage; ASU Police Officer Stewart Ferrin's administrative leave has been extended. His case was passed over to the new ASU Police Chief who will decide on the officer's fate."}]
