[{"comment_id":"10152955044437293","commenter_b":"The evangelical pastors insist that only God can change the climate and that is an affront to God to claim that Man can do so. The ideologues constantly scream that the scientists, left-wing and Al Gore are in a conspiracy to 'steal our liberty.' using climate change to bring about global government. --- BTW. I am GOP and have been for decades. I also listen to Rush Limbaugh and Mark Levin, but unlike --- what is the word? sheeple? --- I don't check my brain at the door and believe everything I am told, like someon who listens to that \"lamestream media.\" --- As for today's GOP, it is nothing like the one that Reagan led. He would not have tried to squash any talk about climate change, prevent any reference to it in schools, or cut funding for research into what is happening in our climate. But that is ...","commenter_a":"The deniers have wax in their ears and a blindfold over their eyes--because they prefer to think that their ideology or religion is under attack by all of this (and are encouraged by the oil and coal companies to believe just that).","post_message":"And scientists are concerned."},{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... \"Sharks don attack humans\".... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10156778240410354","commenter_b":"If he can't handle her, Hillary will make him her bitch. The bitch Trump. Has a ring to it.","commenter_a":"Enough of FOX NEWS \"debates\", Time to vote, enough of Rubios super pac trying to make him look good","post_message":"But the campaign's stated reason for the decision may be different than one might expect..."},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"}]
