[{"comment_id":"10153086110919411","commenter_b":"she is a child","commenter_a":"She just got out of jail 2 weeks prior for car theft and now was in another stolen car and tried getting away using the car as a deadly weapon, the cops have no idea who is behind the wheel, it doesn't matter at that point. Dumbass brought it on herself!","post_message":""},{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"10153780264915950","commenter_b":"Dana is a ugly bitch she loves controversy let me see where she works if she works the internet does wonders and ensure her emoloyer","commenter_a":"You're all pissed about a teenage \"KID\" using the N word a couple times in a tweet, (because according to the former Miss Teen, \"it ain't her word,-it should be no ones word, yet black America puts it out in song lyrics etc., that kids sing to) and not up in arms about a political head deleting thousands of emails and being hacked to boot. Oh, and a pretty blonde won so you're pissed there as well. News flash...the last one wasn't white! Get over it . Racism is not going away now or in the immediate future because the liberal media perpetuates most of it.","post_message":"A screenshot of 4 tweets have been making the rounds online."},{"comment_id":"1676742522602038","commenter_b":"#Trump could be 1st in history to win all 50 states according to linguistic #genius. @webpagelink","commenter_a":"This shows you how corrupt the media truly is!!! This was posted 9-15-2001 by the NYPost.com. It has since been deleted because it proves TRUMP is right about them celebrating on 9/11 in Paterson, N.J. : DELETED POST URL: @webpagelink The nice thing about the web is it is NEVER truly gone! Here is an archive of the post they deleted: RECOVERED DELETE POST THEY ARE TRYING TO HIDE! @webpagelink Quote from their article proving Trump is right even though they claim to never have said such things! \"Here in New York, it was easy to get angry listening to Egyptians, Palestinians and the Arabs of nearby Paterson, N.J., celebrate as they received word of the murderous attacks in New York and Washington. But Mayor Giuliani (who has been tireless and magnificent in this crisis) rightly warned New York- ers that it would be wrong to take their anger out ...","post_message":"Look at the editorial I was just sent from the New York Post on 9/14/01 - 3 days after collapse of WTC. Any apologies?"},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""},{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"},{"comment_id":"505124579675835","commenter_b":"Kiss my ass!!","commenter_a":"You have no rights!","post_message":"The most chilling and honest interview about Islam you’ll ever watch…"}]
