[{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"2169846419907186","commenter_b":"Don't listen to Nikki's Parra she needs to go back to school and take a history class or two cause slavery wasn't about a protest and it didn't end cause of one as well","commenter_a":"These people doesn't really know anything. They only wanna learn and hear what they want to hear and learn that is not against to them. Shame on you all! Get back to class and get a better future rather than this. Best revenge is to get educated!","post_message":"Students at East Los Angeles College and more than 100 colleges across the country walked out of classes and held rallies in protest of Donald Trump’s election as president. @webpagelink"},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"10154455180439203","commenter_b":"LOL!","commenter_a":"Lou is a patriot and great American. He is right while Hillary is a liar, cheater, stealer, fake, fraud, and a phoney.","post_message":"Don't worry, Lou. They don't want to become you, either."},{"comment_id":"1265496813476971","commenter_b":"Angry black priviledged woman.","commenter_a":"He likes ugly women , that's as close to nice as I can get.","post_message":"People say during the #Christmas season I should say something nice about Obama, so I wrote Michelle to see if she can think of anything..."}]
