[{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."},{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to \"shut down\" Trump's inauguration. Here's how."},{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10155061741852491","commenter_b":"Drain the swamp!!","commenter_a":"He needs to just let all former Obama people go. He tried not to cause a stir by dismissing everyone from the get go because the media and liberals would have had a hay day as they do with everything else. But now, it's obviously a huge issue. Let them all go asap!","post_message":"A former Pentagon official says 'nothing short of prison is enough' for the culpable officials."},{"comment_id":"905141892877096","commenter_b":"You are a gruberized voter.","commenter_a":"Based on the polling from this thread Roy should keep his money and not bother to get re-elected. @webpagelink","post_message":"Missouri was one of the first states in the nation to reject President Obama’s fundamentally flawed health care law. For the past five years, I’ve heard from countless Missouri workers, seniors, and families who are facing higher costs and fewer choices due to the president’s health care take-over. As we mark the 5th anniversary of #ObamaCare becoming law today, I’m still fighting to repeal this flawed law and replace it with common-sense health care solutions."}]
