[{"comment_id":"10153557014143984","commenter_b":"To the Ignorant person that said I must be an illegal immigrant you just showed you how ignorant you are. I'm an American. A REALISTIC AMERICAN!!!!! I agree with the person that mentioned the abuse of the welfare system, but those are Americans doing that. Illegal immigrants can't get benefits!!! To the person who said that the companies are putting money in their pockets I agree, but as soon as they have to pay minimum wage and provide benefits and go legit the cost will be passed onto the consumer it always does. To the person that mentioned Hispanic, Mexican etc. I never mentioned any group of people I made a general comment about all immigrants. You just showed how stupid you are that just because I mentioned working in Orange fields you automatically stereotype I was talking about Spanish people. Here's a little info for you not only Spanish ...","commenter_a":"This country was built by immigrants both legal and illegal. Im tired of hearing people complain about illegal immigrants!!! Who the hell do you think are working the lowest paying jobs that without them this country would not function. Will any of you go clean toilets for 6 dollars an hour (that's if they can get that much). NO!!! Would any of you go to the orange fields and go pick oranges for hours in over 98 plus degree weather for pennies a bag. HELL NO!!! But you like when you don't have to pay an arm and a leg for orange juice. If there were to be no illegal immigrants the costs of a lot of things people enjoy would sky rocket because the company would have to pay out more for employees passing the increase on to the consumer!!!!!! Everyone needs to back off immigrants because unless your ...","post_message":"There have been many to come out against Trump after his comments on illegal immigration, but one beloved politician just did exactly the opposite.   Do you support this Republican for taking a stand for Donald Trump?"},{"comment_id":"1349008868469783","commenter_b":"Yes that will be great. Why don't you go hang out with some of those Jew loving Muslims and see how that works for you. She is just like Soros another self hating Jew.","commenter_a":"MOOOOOORRRRROOOOOON","post_message":"Total solidarity ... or something."},{"comment_id":"872563469430677","commenter_b":"2 delightful trolls. Get a life, ladies.","commenter_a":"militant? Lets be honest: muzlim terrorists/murderers","post_message":"A policewoman was killed in a shootout in southern Paris, triggering searches in the area as the manhunt widened for two brothers suspected of killing 12 people at a satirical newspaper. Read more: @webpagelink"},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"1238686566209877","commenter_b":"Well said! Agree 100%","commenter_a":"The norm in our country any more. White on black, is racism. Black on white, poor black kids had no daddy & raised in a poor neighborhood! That half an half in the White House. He has no compassion for his \"white\" heritage, only the black side. Pathetic man!","post_message":"A white pizza delivery kid was out working hard, trying to make ends meet. Then he got a call to deliver a pizza to these two thugs.  What happened once he got there will turn your stomach.  This should outrage the entire nation, but the media, Al Sharpton, and Barack Obama don't want to say a word."},{"comment_id":"522223391280988","commenter_b":"@username you do not get it David. Bernie Sanders and Donald Trump are so popular because people are sick and tired of what is currently available. He is not unelectable and Hillary Clinton is going to lose the Donald Trump if she wins and that is not good for anybody in this country. She's going to kill this country","commenter_a":"Why are you so biased towards Hillary? You are supposed to represent ALL democrats!","post_message":"Hillary Clinton was just announced the winner of today's Democratic caucus in Nevada. Congratulations to her and her supporters!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154691937306509","commenter_b":"She's a big crock!","commenter_a":"Great job @username....this debate is @username attacking Bernie Sanders....your agenda is so obvious....I'm not sure why I bother to watch this.","post_message":"\"Talk about the kinds of problems he had answering questions about even his core issue: breaking up the banks...\"  Hillary Clinton criticizes Bernie Sanders' answers to questions from The New York Daily News.   Live updates from the #DemDebate: @webpagelink"}]
