[{"comment_id":"1158715757578534","commenter_b":"Jail house for this chick!","commenter_a":"Sorry don't remember any championships","post_message":"It's just a matter of Hillary living the rest of her life out in prison or free.  Do you want to see Hillary go to JAIL?  @webpagelink"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"1067971246620705","commenter_b":"This is not a college campus, and she already dropped out of college. Go look, shiney object over there ...","commenter_a":"The media should be reporting on the despicable Republican Platform. #shameful","post_message":"The speechwriters who wrote the original speech are among the best, and weren't going to have their good name besmirched by Trump ..."},{"comment_id":"1147448235275205","commenter_b":"Isn't it wonderful how they know everything even you personally. The caps are supposed to be gone according to gore. You can go to nasa and and other gov weather sites and look at the charts. There is nor a warming trend. But when they don't know just guess the insult. Just shows there ignorance","commenter_a":"Climate change happened with or without fossil fuel use. Isn't that interesting?! Well unless dinosaurs and such drove gas guzzling SUVs","post_message":"\"The message to society is clear: Prepare now, or be prepared to face the consequences.\""},{"comment_id":"10153992150958854","commenter_b":"Who's next to meet Satan their Allah. Satan's impatient, don't keep the Virgin hags waiting.","commenter_a":"no more little asshole","post_message":""},{"comment_id":"1015796225098514","commenter_b":"Funny... I keep hearing people say that Climate Change is George W. Bush's fault.","commenter_a":"What's funny is climate change was never a political issue before the republicans made it one after Obama was elected. Even Bush admitted it is real, but the sheeple just keep to their marching orders from fox.","post_message":"Get ready"}]
