[{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"10154264363424071","commenter_b":"@webpagelink Nice keffiyeh scarf right ?","commenter_a":"@username why is it that every single shooter and terrorist has been \"known\" by the FBI. Why wasn't there an alert with TSA to make sure he didn't have firearms etc.","post_message":"Here's what we know so far."},{"comment_id":"694546357374506","commenter_b":"Bullshit. She should go back under a rock!","commenter_a":"U MEAN HIS SON IN LAW IS INVISABLE?","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"10155313897730231","commenter_b":"Oprah, don't do it!","commenter_a":"He need two jobs!","post_message":"Own gives reality show to man with 34 children. ‘Fix My Life’ coach to guide him during the show."},{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10153000077314197","commenter_b":"I prefer the old style plates. And I believe undocumented residents should not be allowed to obtain a driver's license. There must be a hidden agenda here.","commenter_a":"The old one is much better!","post_message":"Which Connecticut license plate do you prefer?  What do you think about undocumented residents getting driver licenses? Watch Dennis House interview the new DMV Commissioner today at 11 on Face the State @webpagelink"}]
