[{"comment_id":"10155194763231178","commenter_b":"why r these liberal women ,so f-in ugly?","commenter_a":"Just another hypocrite.","post_message":"The New York Times reporter smeared the Tea Party as racist a few years ago.... now she's urging the left to start copying it."},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"1025085544195452","commenter_b":"@username , are you Canadian ? If so , we will gladly ship a few million muslims to your neighborhood","commenter_a":"That \"teacher\" should be fired!!","post_message":"“My daughter wanted to know why she was asking her that.”"},{"comment_id":"10154274502374087","commenter_b":"Oh you ALL make me tired. What a bunch of bullshit comments.","commenter_a":"The smartest thing this man has ever said: \"Dr. Carson feels he has no government experience, he's never run a federal agency. The last thing he would want to do was take a position that could cripple the presidency.\"","post_message":"#BREAKING: Dr. Ben Carson has told President-elect Donald Trump that he isn't interested in serving as secretary of Health and Human Services in his administration."},{"comment_id":"997724686914554","commenter_b":"Natenyahu, be a man and accept refugees to Israel!","commenter_a":"Hungry is right!","post_message":"A Syrian father laid to rest his wife and his two little boys in Kobani after they drowned as they tried to flee to Europe. This, as desperation and anger deepens among people escaping conflict and poverty. Read more: @webpagelink"},{"comment_id":"10154945545241002","commenter_b":"Let them fight \" Darwin \" will take over !","commenter_a":"Terrible!","post_message":" loved everyone, said Robert Ybarra daughter. \"He was one of those neighborhood dads that people could count on.\""},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""}]
