[{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"1634982916802334","commenter_b":"I haven't seen this yet!!!","commenter_a":"@username my fav","post_message":"Cubs players sing \"Go Cubs Go!\""},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10153192857784087","commenter_b":"TRUMP 2016","commenter_a":"Our tax dollars hard at work!","post_message":"The sight of GOP presidential frontrunner Donald J. Trump’s plane surprised reporters traveling with the vice president, and they quickly snapped photos of the scene."},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"},{"comment_id":"10154310503686519","commenter_b":"I'm sure the travel site is a very bad site and many people are saying that the site is bad, disgusting and their reviews are a disaster. Trump won't subscribe to the site until they say he is great and then the site will be good. But it's very sad now. His hotel is the greatest hotel and anyone who doesn't think so is a looooser.","commenter_a":"Banktrump International Hotels, get over it!!","post_message":"You have to read their review of Trump's hotel for yourself."},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."}]
