[{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1781336095483197","commenter_b":"She is so darn crooked!","commenter_a":"OMG!!! How terrible......the next thing you know he'll be selling uranium to the Russians, or discussing Top Secret programs on his personal e-mail...or selling influence to the moslems.....","post_message":"Trump has also praised Vladimir Putin, Kim Jong Un, and Benito Mussolini."},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10154245909881130","commenter_b":"Oh, better step back, she threatened him with the janitor!!!!","commenter_a":"Suzane Al Ahmad","post_message":"Boy, bye. 😂"},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"1376440642415680","commenter_b":"Women today have lost their values and morals.","commenter_a":"Ugly","post_message":"Dare to bare!"}]
