[{"comment_id":"10152692190456636","commenter_b":"Because of course it's the woman's fault! We are female, wear thongs and stiletto heels so obviously that translates to \"I want sex and will have it with anybody and my screams of no & stop obviously mean, yes!\" And if you go to court they ask questions about your underwear and what we're you doing out. Never ask the rapist what he was wearing or why he thought you walking down a street by yourself translates to brutally attack and rape me. It's 2015 the world has come far but on certain things importance ranks zero.","commenter_a":"road","post_message":"'I witnessed this years ago, after I was raped myself'"},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."},{"comment_id":"10153829751724060","commenter_b":"Well. The Christians have overcome Crusades. Try yourself to see the present and stop to be a stupid moron","commenter_a":"You mean Islam was used as a vehicle of war?","post_message":"In 2015 religion was used as a vehicle of war. My God versus your God"},{"comment_id":"642441049213821","commenter_b":"Crying over spilled milk. She should move on","commenter_a":"Our system does NOT invite tampering, if you asshats didn't decide to cheat. Pure and simple! And the fact that you and your ilk can so easily rationalize your way around the rules suggests that you're definitely part of the problem.","post_message":"Green Party presidential candidate Jill Stein says a recount is needed because the current voting system \"invites tampering\" and there have been many \"red flags\" with votes in the election. Should there be a recount?"},{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"10153032045224411","commenter_b":"Don't waste your time here Ana! The reason why some of these people have tunnel vision is because their heads are deeeep up the RACIST European and American governments ASSHOLES they can't turn their heads to see what is really happening on side...","commenter_a":"Sadly people are not intelligent enough to draw a line between a religion and extremism. Had these cartoons been about Jesus instead of Mohammed a crazy christian extremist could have done the same thing, but I doubt that would be followed by throwing grenade at a church.","post_message":"'I personally believe that the death penalty should exist in our legal arsenal.'"},{"comment_id":"10154963463661320","commenter_b":"Prayers yes! How about the right time defend themselves with firearms?????","commenter_a":"Praying for peace once again. Sorry for all the victims and their families.","post_message":"The people of Berlin are in our thoughts after today's deadly truck attack at a Christmas market."}]
