[{"comment_id":"10153378846018037","commenter_b":"Exactly!","commenter_a":"KXAN - you love to get a good argument going, don't you?","post_message":"Did the grand jury make the right decision?"},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"1879145055641043","commenter_b":"I bet her husband can't wait to their son Ben turns 18 so he can leave this psycho b****","commenter_a":"She went from 102 pound to 104 pound woman in a matter of minutes. Proves that she's full of shit and gaining.","post_message":"I bet she has at least seven cats.   -Admin Rick Birdsall"},{"comment_id":"10154369349733812","commenter_b":"Take your hate, elsewhere, lady.","commenter_a":"Big f'n deal","post_message":"Pres. Barack Obama and First Lady Michelle Obama announce their daughter Malia will attend Harvard University in the fall of 2017, taking a gap year after her high school graduation next month."}]
