[{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"790486571080388","commenter_b":"Shut up!","commenter_a":"BUSH IS A JUVENILE WHO WORKS FOR THE BUSHES----NO MORE BUSHES---2 tooooooooooo many---TAKE YOUR MILLIONS AND FALSE POLICIES ELSEWHERE-----We do not want another IRAQ!!! and then be left hanging out to dry like your brother did-----VOTING TRUMP ---","post_message":"Question from Cameron, a 5th grader in New Hampshire: What are the top 3 things you want to accomplish in your first term?  Watch to hear my answer:"},{"comment_id":"371470169707944","commenter_b":"This is to Hanoi Jane. Run your bathtub to lukewarm. Get into tub. Have a nice glass of red wine. Take a razor and slit both of your wrists. Go to sleep. The world will be a better place without you.","commenter_a":"She owes the Vets she causd additional harm to in Vietnam. She needs to apologize profusely to all veterans for the rest of her life.","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10153923556708690","commenter_b":"they will unfortunately forever be in western countries, untill all western countries are taken-over by muslims, because western countries have welfare system, none of the arab countries have a social welfare system like western people... so only when social welfare is completely destroyed like in sweden, they will have to get back to survive.. (^_^) sweden has taken in so many muslims it completely destroyed the economy.. destroyed women lives, destroyed everything. welfare is completely drained","commenter_a":"Maybe Muslims should stop migrating to Australia than and instead migrate to the arab countries.. Why don't they? Why do muslims prefer to migrate to democratic Australia and the western countries rather than the sharia-ruled arab states?","post_message":"A November survey by two universities and a research centre suggests that Muslims in Australia experience racism three times the national average. @webpagelink"},{"comment_id":"10154104815247061","commenter_b":"Its the degenerates who voted for a child rapist to run our country!","commenter_a":"I'm sorry.. I noticed some people responded to this story with the \"angry\" emoji... Why would anyone be angry at giving back to the community or better yet, to our vets?","post_message":"WATCH: President Obama and First Lady Michelle Obama serve Thanksgiving meal to residents of a retirement home for military veterans in Washington, D.C. @webpagelink"},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said \"maybe, just maybe the earth is round\"? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"}]
