[{"comment_id":"902740889761333","commenter_b":"Who would want her??","commenter_a":"Oh really that would make for a honest President, not","post_message":"BREAKING!"},{"comment_id":"10155061741852491","commenter_b":"Drain the swamp!!","commenter_a":"He needs to just let all former Obama people go. He tried not to cause a stir by dismissing everyone from the get go because the media and liberals would have had a hay day as they do with everything else. But now, it's obviously a huge issue. Let them all go asap!","post_message":"A former Pentagon official says 'nothing short of prison is enough' for the culpable officials."},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for \"not being black enough\", she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."},{"comment_id":"10153835379166336","commenter_b":"Cause white people suck","commenter_a":"That door was racist against white people! Ban all cruise ships and doors.","post_message":"A jury has awarded a man $21.5 million in damages after he was hit by a sliding door on a cruise ship.   MORE: @webpagelink"}]
