[{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"1435936396466104","commenter_b":"Fool","commenter_a":"Excellent job President Duterte..","post_message":"The death toll has risen to 1,500"},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":" dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."},{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153978615223812","commenter_b":"Go Hillary! 2016!!!","commenter_a":"GO BERNIE","post_message":"Here's what the ABC team is doing in the minutes leading up to the #DemDebate..."},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"}]
