[{"comment_id":"525788244278422","commenter_b":"Look at her eyes, do you really want this ugly, selfish and stupid woman as your president,,,?","commenter_a":"She won`t be done until she takes her last breath. Shes to damn dumb to quit.","post_message":"Hillary tried to hide the truth, but Gowdy refused to give up until justice was served.  This is amazing. Hillary is finally going to pay for her crimes.  Do you agree Hillary Clinton should be arrested for treason?"},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"},{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"},{"comment_id":"10153443850876680","commenter_b":"For her Clinton Foundation....Just say NO to HILL the SHILL!!","commenter_a":"Hillary Clinton will make a great President ! :-)","post_message":"Hillary Clinton name-checked some of her local allies and shared a series of personal stories, such as the recovery following the 9/11 attack and working with Congress to get first responders health care."},{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"}]
