[{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe \"psychosomatic illness,\" according to reports: @webpagelink"},{"comment_id":"10153294608621051","commenter_b":"There are bad waitresses too!! I don't treat one bad because another was bad!!","commenter_a":"All human life is sacred. But I work at a restaurant down the street from the county sheriff's department, and the boys in blue that come in are often disrespectful and rude, and act entitled to walk all over us because they're cops. They once refused to leave after we closed, even though they were done eating. I'll start respecting the blue more when the good ones start publicly, and loudly denouncing the ones who aren't.","post_message":"This officer had just finished a nice meal and was preparing to pay his bill when he noticed something written on the receipt."},{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":" I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"10153880714231509","commenter_b":"It's her baby. If she says no then it's human trafficking.","commenter_a":"It's HER baby. Period. And the father and her can share it.","post_message":"Should the surrogate mother be able to keep her? This baby's future is now in the hands of the courts: @webpagelink"},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"1123039051096182","commenter_b":"@username Y u so MAD!","commenter_a":"Everyone who verbally attacks BLM are silent supporters of the kkk!! Show me why u hate BLM so much. Show us pics of the smiling around a dead white person or any other ethnic groups body!!! U can't so fuck u","post_message":"Lol: #Virginia #police pulls a woman over for driving without an ice cream cone!  #WSHH"},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says \"Down\" so, I'm hoping the other sign, which we can't see, says with... Would spell out \"Down With White Power\". I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"}]
