[{"comment_id":"615536761924441","commenter_b":"It open season on black people out here...I swear..the day when the rabbit has the gun is almost near.","commenter_a":"Well world, what do you think of the greatest country in the world now???","post_message":"Remember little Aiyana Stanley-Jones? She was only 7-years-old and ASLEEP when a Detroit cop fatally shot her in the head. Now it's official: EVERY LAST CHARGE against the cop who killed her has been DROPPED! He will face NO punishment AT ALL!  Are you surprised?"},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"10153785606781636","commenter_b":"@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just \"rent\" a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."},{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"10153128102178145","commenter_b":"NO! She is a murderer!","commenter_a":"only if she tells the truth about what really happened..oh yeah she doesn't know how to tell the truth!!","post_message":"She's been called the \"Most Hated Woman in America\". Now you may soon see Casey Anthony on TV again.  Would you watch her interview? #WFTV  Read more here: @webpagelink"}]
