[{"comment_id":"10155252907224657","commenter_b":"She needs to stay, Debbie and Hillary are the face of the Democrats.","commenter_a":"Dems should stay away from emails..they really suck at it...","post_message":"BREAKING: Debbie Wasserman Schultz Will Not Preside Over Democratic National Convention Due To Email Leak"},{"comment_id":"10154668676208797","commenter_b":"Never mind iam deaf ok that women did it .she just want money ok .","commenter_a":"I don't think johnny deep do that is her she pull her safe for money johnnydepp money I don't like her .is no alway he did her . Johnny Depp don't get married and he have his life .","post_message":"'I LIVE IN FEAR': A judge has ordered Johnny Depp to stay away from his estranged wife after she accused him of repeatedly hitting her during a fight, leaving her face bruised."},{"comment_id":"10155020049345500","commenter_b":"I can see you are a cold-hearted Republican, but are you a veterinarian? Did you ex-ray and scan the dog for injuries? This dog will suffer for this when it ages. You are an evil woman who abuses animals.","commenter_a":"This is ridiculous. I am the biggest dog lover ever and this is blown way out of proportion! The dog is fine!! Geez","post_message":"\"DEAR PETA! CHILL!\" What else Sarah Palin said in response to criticism after posting a controversial dog photo @webpagelink What's your take?  (Image courtesy Sarah Palin's Facebook page)"},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."},{"comment_id":"1843613252518265","commenter_b":"Squirting and peeing may release the same fluids but the acts are totally different. You would know if you've ever made a woman squirt...","commenter_a":"Think the only people who care are the women who can't squirt and the guys who can't make women squirt","post_message":"Happy Valentine's Day!"},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"10153880992094714","commenter_b":"Illuminati right?","commenter_a":"I really can't stand Obama right now nor his latest decisions. He's honestly pissing me tf off no lie Like the earlier comment said, you have plenty room at the white house to throw a traditional Thanksgiving dinner all for them... We'll see how fast you call that a good idea...I'll wait","post_message":"\"[A] woman from Florida told me her family's history dates back to the Mayflower - and she said that welcoming others is part of 'what it means to be an American.'\""}]
