[{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"},{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"},{"comment_id":"524375314431275","commenter_b":"She is a disgusting human being.","commenter_a":"Lord what a pig.","post_message":"President Bill Clinton's accusers are publicly condemning Joy Behar for calling them \"tramps.\" @webpagelink"},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"\"These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.\""},{"comment_id":"1052170041539020","commenter_b":"she sucks","commenter_a":"Great","post_message":"Clinton is clobbering Trump in poll after poll."},{"comment_id":"10154604674038690","commenter_b":"#Bilal_yema we terribly hate the western hypocrites who have kept Muslim lands occupied in Afghanistan!!! tell them to leave Afghanistan we Muslims will solve our own problems!!!!!","commenter_a":"Taliban means terrorist and terrorist means Pakistan Pakistan is cancer for the world","post_message":"Based on reports gathered by Al Jazeera from local police, security forces and the Taliban, here is a conservative estimate of the areas in Afghanistan that are contested, under the Taliban, and under government forces."}]
