[{"comment_id":"10156048486720389","commenter_b":"Anyone is smarter than she is!","commenter_a":"YES!!! She knowingly wiped her server clean or had someone way smarter than her...do it for her!!!!","post_message":"Question of the Day: Do you think Hillary Clinton knowingly wiped her server clean?"},{"comment_id":"10153302293701051","commenter_b":"EVERY country is populated at some point in its history by people who migrated to it ... THAT is how all countries began.... good grief. No one is against LEGAL immigration.","commenter_a":"Nearly 100% Americans ARE immigrants. Through their ancestors. :-))","post_message":"Do you agree with the vast majority of Americans on this?"},{"comment_id":"10153199106634071","commenter_b":"Get her a group of body guards while you're at it","commenter_a":"M","post_message":"A $48.5 million diamond for a 7-year-old girl."},{"comment_id":"10154029813093812","commenter_b":"While we are at it, let's ban people like you for having guns.","commenter_a":"Ban all Muslims from owning guns","post_message":"JUST IN: Man accused of shooting Philadelphia officer pledged his allegiance to ISIS and used stolen firearm, police say."},{"comment_id":"1159189937449759","commenter_b":"WHAT DOES THE OBAMAS AND CLINTONS HAVE TO HIDE FROM THE VOTERS. THEY ALL REMIND ME OF ALI BABA AND THE 40 THIEVES BUNCH OF CRIMINALS DON'T TRUST ANY OF THE CROOKS.","commenter_a":"Gee, funny they can tell who hacked emails showing Democratic corruption but, they have not had any luck finding Hillarys missing 30,000 emails.","post_message":"Whoa!"},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"}]
