[{"comment_id":"10154347399052045","commenter_b":"@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"},{"comment_id":"10153237032465329","commenter_b":"Hahahahaja prateado, claro!!!","commenter_a":"@username Vou comprar o prateado. Gosto dos classicos. Qual vai ser o seu? kkkkkkkkkkkkkkk","post_message":"Updating."},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing...  Is Sharia law in America a major concern of yours?"},{"comment_id":"10150645509299999","commenter_b":"Apple should have made an iPhone 4C. Then all the women can just buy it. Problem solved.","commenter_a":"I visited China a couple of years ago and my guide, a 30 year old woman had written herself off already for ever finding love. She told me women in China look for the 4Cs: car, condo, credit, cash in a man. I laughed. But she wasn't joking...","post_message":"“Even though she’s a successful woman, she would come back home and be nothing in her mother’s eyes because she is a single woman.”"},{"comment_id":"1247969895269376","commenter_b":"So we can take hus away also. He is more privileged than her.","commenter_a":"Are you kidding me? He is simply making a point that she is a privileged elite who lives by one standard of protection and expects the little people--the unworthy stupid masses--to try and survive under a different one. It's called irony. To deliberately misinterpret and inflame his message (as a call to 'assassination'???!!!) is just proving Hillary right--her sheeple are the stupid masses. I say, let's prove her wrong and show some common sense.","post_message":"DISQUALIFYING! This is the SECOND time he suggests that Hillary should be shot. What is WRONG with him?  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is \"estimated\". What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"\"The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,\" Hillary Clinton tweeted. \"No, Trump.\""}]
