[{"comment_id":"10154109773821491","commenter_b":"I watched the video. And I know horrible treatment of animals in factory type production of food. I know a guy right after high school that had a job for one day catching two chickens at a time and melting their beaks with a hot iron. That was done so they wouldn't peck at each other. But that's not what the post is about.","commenter_a":"One egg yolk has 62% of your daily allowance of cholesterol. One strip of bacon has 3% of your daily allowance of cholesterol.","post_message":"Eat those yolks, folks."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"661168074035043","commenter_b":"She has problems","commenter_a":"Dylan Ballzy","post_message":"Ermmmm..."},{"comment_id":"935609056472847","commenter_b":"But they were fat girls","commenter_a":"They must not live near a Mcdonalds","post_message":"She says her two best friends turned on her and beat her for nearly two hours."},{"comment_id":"10152945892703855","commenter_b":"Quit being such a pussy.","commenter_a":"Sigh, more attacks on a man having an opinion and not actually insulting anyone. Give up. I guess you can go back to endorsing Prep.","post_message":"We all get it from time to time."},{"comment_id":"1158452534233281","commenter_b":"All that fighting over an ugly fat chick?!","commenter_a":"White trailer park trash punks","post_message":"We doubt if just one person was to blame in this insane road rage incident caught on tape. But it's clear that this woman refuses to let it go.  And after pushing and pushing the other driver, she gets a wet blast she never expected.  And it didn't end there..."},{"comment_id":"1709198036011185","commenter_b":"@username!!!! Stop!!!!","commenter_a":"Jenna Pitt @username","post_message":"The baby is the first in the continental U.S. to be born with the Zika virus-related brain condition."}]
