[{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were \"no visible signs of injuries found on the bodies.\""},{"comment_id":"10157286687695093","commenter_b":"The same FBI that said Hillary Clinton was to dumb to be prosecuted? Gmafb dude. I tell you what why don't all of the uneducated whites thank think their better than blacks go, than not only will the crime rate be lower but the racial tension will be too.","commenter_a":"I guess they're gonna condemn violence against police when white folks stand and condemn police violence against blacks. Until then we'll continue to lie to one another.","post_message":"Must-see!"},{"comment_id":"10154635406324726","commenter_b":"@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"10154410865644091","commenter_b":"He better be ready for BIG POPPA'S in jail bc there gonna rip his A$$ for raping those little angels...Let's see how he likes it now! #ThrowAwayTheKey","commenter_a":"I hope you get yours in jail you pos","post_message":"JUST AWFUL: This Long Island man is accused of raping 2 young girls -- ages 6 and 7."},{"comment_id":"367714146750213","commenter_b":"To win a war you have to call it war and fight it like a war.","commenter_a":"But Obama or any of his staff was there , how come ??","post_message":"More than 1 million people are marching in Paris to protest against Islamic terrorists"},{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."}]
