[{"comment_id":"10154133539156509","commenter_b":"She is high on drugs of stupidity!","commenter_a":"Lol..","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"\"I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?\""},{"comment_id":"916567641696749","commenter_b":"Book should have been titled; Chicken Shit in the Mango Tree. Married 31 years raised by a mother 2X divorced and once widowed. The families do not get over these Selfish POOR ME decisions. Families are for life.","commenter_a":"Why don't you profile some of the people who have not just dumped their inconvenient families? Let's see a profile of couples who have been bored, or \"grown apart\" and worked at their marriages instead of taking the easy and selfish way out. This guy \"gained so much more\" because he cared only about himself.","post_message":"\"I thought 'I have to do this ... it will be horrible for all the people I love most in life. But I have to do it.\""},{"comment_id":"605402049616235","commenter_b":"@username AMEN! She's just a stupid troll!!!","commenter_a":"He was probably drunk while being on the snowmobile. It will take more than duct tape to shut his wife's mouth.","post_message":"\"Knowing Todd, once he's cognizant, he'll probably ask docs to duct tape him up and he'll call it good. He's tough,\" Sarah Palin said."},{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"},{"comment_id":"1022450851126484","commenter_b":"And let's not forget, all of the terrorist attacks on United States soil have been committed by less then 100 Muslims. How many more United States citizens must die before this insanity is stopped?","commenter_a":"How about we see how she rules on things before we pass judgement? If her rulings are in accordance with the laws then who cares. If she starts using Sharia law to pass judgements then we can raise an issue.","post_message":"This is why we can't have nice things...but SERIOUSLY!"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."}]
