[{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10152835488861051","commenter_b":"What a bitch","commenter_a":"What kind of a person hurts an old lady. Hope she is sued . She needs jail time","post_message":"This 71-year-old woman tried to park in a handicap spot in the Walmart parking lot. That's when all hell broke loose."},{"comment_id":"493375190853061","commenter_b":"Ban muslims from holding a job AND ban them from welfare benefits! Starve them out of our country!!!","commenter_a":"Now I know why CVS has become so powerful in the insurance business. Owned by Muslims, friends of Obama. So many large companies are now making their employees use only CVS to get their medications. CVS charges more for all their medications. So wrong.","post_message":"His Muslim boss tried to harass him for being Christian, be he wouldn't back down.  Amazing. Let's show him we have his back.  Do you support his stand against his Muslim supervisor?"},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"1213918441976908","commenter_b":"She should step down, even if she did win, God forbid , she won't make the first half year..","commenter_a":"Ken put the straw down","post_message":"She's dying!"},{"comment_id":"10153272276901323","commenter_b":"Yeah too right let's let everyone in one big party what could possibly go wrong","commenter_a":"Ella Wellington","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"}]
