[{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"\"We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,\" said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"587298078081643","commenter_b":"You dumb bitch","commenter_a":"Pasco ain't little","post_message":"That sort of puts things in perspective, doesn't it?   @webpagelink"},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"}]
