[{"comment_id":"10154325578499255","commenter_b":"hurry with that wall.and maybe with all the money they make they will build it for you.","commenter_a":"The Republican Establishment goes nuclear.","post_message":"This has to sting.  By Daily Kos user ericlewis0"},{"comment_id":"10153259374526350","commenter_b":"I just got off s cruise ship..I go on a cruise every year..The amount of people in and out of the water of those pools and all the adult drunks. Scares the hell out of me..I have a 7 year old granddaughter and she can swim..but it only takes 2 seconds for a drunk to jump on her w/o supervision. .Thank god my daughter watchers her like a hawk! THEY ONLY CARE ABOUT $$$ ITS TIME FOR LIFEGUARDS AND WATCH YOUR CHILD AS WELL!!!! And all Disney hotels have LIFEGUARDS! I live near them and we take our granddaughter Isabella to one every year for her Birthday!","commenter_a":"It is really no different than at a hotel. You don't have lifeguards at a hotel pool. There are signs posted that no lifeguards are on duty and parents need to watch their kids.","post_message":"There are as many as 1,000 employees aboard large cruise ships, but three major cruise lines employ no lifeguards on their ships. Why not?"},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""},{"comment_id":"746903725500205","commenter_b":"she is a disgarce and should be reprimanded so should cbs and the nfl they truly are responsible for giving this racist cop hating person a platform in which she was able to spread hate and racism","commenter_a":"YES.","post_message":"Congressman Absolutely Unloads On Beyonce For Vile Halftime Show  She completely overstepped her boundaries.  Do you agree with this Congressman?"},{"comment_id":"10153442535983132","commenter_b":"there is tons of transgender models lol","commenter_a":"Beautiful!","post_message":"If 2015 wasn her year already, it sure is now."},{"comment_id":"677415119050364","commenter_b":"Yes....","commenter_a":"yes","post_message":"Take the poll!"},{"comment_id":"661747857265261","commenter_b":"@username in LA-LA Land - Run back to the boarder and GET THE FUXK OUT OF MY COUNTRY!","commenter_a":"Then he obviously didn't listen to the end. Bibi gave 3 more stipulations that were very clear to add to the table","post_message":"US President Barack Obama says that Prime Minister Benjamin Netanyahu “didn’t offer any viable alternatives” to the current P5+1 negotiations in his speech to Congress.   #NetanyahuSpeech"}]
