[{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"1810739472541280","commenter_b":"Recount!! Recount!! Go girl! Hillary for president!!","commenter_a":"Will she be filing in the states won by Her?","post_message":"BREAKING---- Green Party Candidate Jill Stein Files for Recount in Wisconsin.... Where Trump won by almost 30,000 votes! Wow!"},{"comment_id":"866599370042152","commenter_b":"..Immigrants took our jobs? Really? I'll be damned! Well who gave them the jobs in the first place? Employers? They always hired the best I thought. OH! I know, those damned immigrants are the ones that sent our jobs to the Communists too, right? Lol. Watching Professional Bull Riding today. They are all Hispanics..","commenter_a":"If you can't speak our language then go back where you came from and stop taking jobs from Americans","post_message":"Plain and simple.   www.thepoliticalinsider.com"},{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."},{"comment_id":"1119811948055147","commenter_b":"You want a female hero? You've got Samus! Leave Link alone and stop this feminism in video games. Ghostbusters already died and they want all of the world become female, not just video game characters...","commenter_a":"while we're at it, should we change harry potter to female as well?","post_message":"Nintendo's reasoning makes zero sense."},{"comment_id":"10153560600894087","commenter_b":"DUDE ....PAYED FOR? ....REALLY? ....Hillary Clinton is the biggest political whore to ever walk the planet....SMARTIN UP","commenter_a":"Chris Christie is bought and paid for. Don't be surprised when he gets a position in Trump's cabinet. Donald Trump is used to paying off politicians. And some think he will change things in Washington. Lol. What a joke. \"I've got to give to them. Because when I want something, I get it. When I call, they kiss my ass.\" - Donald Trump on giving money to politicians.","post_message":"“Get in the plane and go home,” Donald J. Trump told Chris Christie after the New Jersey governor introduced the real estate mogul at a campaign rally. WATCH:"},{"comment_id":"2125671227658021","commenter_b":"And also a puppet parasite. She made thousands of ill people live in poverty and her life was everything except that. What a lie! ........ the same thing happens with jews, they say they are the people of god! Which one? Money god?","commenter_a":"MOther Theresa ... Love, Hope and Charity... Saint of the people ... Pray for us ... Amen.","post_message":"Mother Teresa is set to be canonized – made a saint in the Roman Catholic Church – on Sunday @webpagelink"}]
