[{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"10154428184215695","commenter_b":"Marely Hernandez leaving a baby alone in an apartment is neglect. I may tell my next door neighbor to watch my dogs while I am gone but if I leave a child I will have someone in the residence with that child. You will see what the definition is when she goes before the judge and faces charges. No one should ever drive without a license regardless of why they are doing it. Breaking the law is breaking the law. A criminal is a criminal! You leave a child alone and all children should be removed from the home until you can prove you are capable of providing a safe environment. It seems that many people need to take parenting classes!","commenter_a":"Just wondering , why did the officers randomly walk into her place ? .. Or should I read the article ? Lol","post_message":"Officers say they found the door unlocked and the child sleeping alone on a bed surrounded by pillows."},{"comment_id":"10158074585980294","commenter_b":"The only thing that woman is in line for is a jump suit with stripes","commenter_a":"Here's hoping Hillary gets 271 at the least!!!","post_message":"By law, the Electoral College meets on December 19. But how does it actually work? Here's a quick lesson on tomorrow's events."},{"comment_id":"1769143673366303","commenter_b":"They just scared of a woman running the country.","commenter_a":"And I am so sick and tired of people saying, \"I just don't trust Hillary.\" Seriously???? So you will vote for this morally depraved lunatic?","post_message":"But Trump has done them all and is somehow their HERO!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152762111222061","commenter_b":"Real FAT women","commenter_a":"It's time that real women get recognized!","post_message":" I happen to be a size 22, but I am sexy...\" -- Lane Bryant takes aim at Victoria's Secret with #ImNoAngel campaign: @webpagelink"},{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"}]
