[{"comment_id":"10153386538275326","commenter_b":"How is he going to run his hotels,if he reports all illegals??","commenter_a":"He mean kill them.","post_message":""},{"comment_id":"10152889795339342","commenter_b":"Thanks to the OTHER hospital! Her hospital didn't even say what Duncan had! They kept it from her!","commenter_a":"Personally, I'd just be happy to be alive.","post_message":"SO CALLED \"EBOLA NURSE\" NINA PHAM PLANS TO SUE: The 26-year-old nurse said that the hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the deadly disease."},{"comment_id":"10155513356146350","commenter_b":"We need a Boog!","commenter_a":"@username Hannah Prior Joel","post_message":"WATCH: A baby bear named Boog meet his new fawn friend. HIS NAME IS BOOG. @webpagelink"},{"comment_id":"1142286662534251","commenter_b":"Learn English you illegal immigrant","commenter_a":"Republicans or pathetic. I am for Trump as long as he is not for wars. Does not bother me if he is racist. At least I know where he is coming from. It is the ones who try to hide their racism you have to watch.","post_message":"None of the Republican leadership in Congress were at the meeting with Trump (nor were they invited)."},{"comment_id":"684042675091009","commenter_b":"Hillary is guilty as sin . She should be in prison along with all of her Clinton Crime Mafia.","commenter_a":"Maybe he is scared of being the next victim to die like the FBI suspected leaking the emails.","post_message":"BREAKING: CLINTON CLEARED...Was This A Coordinated Last Minute Trick To Energize Hillary's Base?   This only proves why we need TRUMP to DRAIN THE SWAMP! We are a Banana Republic!"},{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."},{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""}]
