[{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"951268851580640","commenter_b":"Nadia: You must one miserable bitch in real life. you have the nerve to pretend to know Shannon well enough make the unfounded assumptions you just made. You have no idea what her function at Walmart even is yet you make this idiotic comment. Let me guess, you hate YOUR job and so have this need to crap on others? Her simple point was that it's a myth that all Walmart employees are on or qualify for foodstamps. Keep on hating and being ignorant!","commenter_a":"I have worked at walmart for ten years. I don't even qualify for wic because I make too much money! And with my first baby on the way I could have used the assistance. Not every single walmart employee is on food stamps. Oh and I also bought a house, got a nice car, all while working there....crazy","post_message":"That's a one cent difference, folks. Only *one* cent.  Many thanks to Slate.com for the image (and the facts)!"},{"comment_id":"1707295909299362","commenter_b":"During WWII there was a very true saying: \"Loose lips sink ships.\"","commenter_a":"Nope","post_message":"This whole thing is ugly."},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"967666993287466","commenter_b":"Lying sack of s@&$. Only pigs do that.","commenter_a":"These Muslims make up the most unbelievable lie's .","post_message":"46 Yr Old Millionaire Muslim In Court For Raping Teen: “I fell on her and penetrated her by accident’"},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."}]
