[{"comment_id":"10153177262869205","commenter_b":"Christmas is actually a pagan holiday as is Halloween.","commenter_a":"Saying public schools shouldn't close for holidays includes Christmas people therefore if schools were to remain open on that holiday you'd end up bitching because your kids had to be in class on Christmas! Everyone should have the right to observe religious holidays due their beliefs even if its just a personal day off!","post_message":"Should Schools Close on Muslim Holidays?  h/t AJ+"},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"10153636855342426","commenter_b":"What a tragedy","commenter_a":"R.I.P. D'Marco you fought a good fight","post_message":"D'Marco Jackson passed away this morning. You may remember D'Marco from an inspirational speech he delivered last year at the Hermitage High School graduation.  “If I had to pick a singular piece of advice to give you all, I’d say this … do not let the realities of the past or the possibilities of the future negatively affect the peace, joy and happiness that the present has to offer,” he said.  Read more: @webpagelink"},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""},{"comment_id":"1224337737632979","commenter_b":"I thought it was absolutely hilarious. Maybe the hood rats should have a bit more respect rather than planning their next drug deal.","commenter_a":"If she can't handle her job and behave professionally, then she shouldn't be an educator. Period. Her being a teacher and all you would think she would be able to find another way to get her point across. The way she spoke and behaved was unacceptable. She grabbed that boy and then went on to say racially inappropriate things. She's a disgrace to teachers.","post_message":"Aren't teachers suppose to be the example?  #WSHH"},{"comment_id":"10153294608621051","commenter_b":"There are bad waitresses too!! I don't treat one bad because another was bad!!","commenter_a":"All human life is sacred. But I work at a restaurant down the street from the county sheriff's department, and the boys in blue that come in are often disrespectful and rude, and act entitled to walk all over us because they're cops. They once refused to leave after we closed, even though they were done eating. I'll start respecting the blue more when the good ones start publicly, and loudly denouncing the ones who aren't.","post_message":"This officer had just finished a nice meal and was preparing to pay his bill when he noticed something written on the receipt."},{"comment_id":"10154234462691770","commenter_b":"Typical liberals pay to play she learned from Hillary","commenter_a":"She's got to be a Democrat","post_message":"Liberal Governor Took Last-Minute Donation From A Company With $1 Billion In Contracts"}]
