[{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"},{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."},{"comment_id":"10152813335961770","commenter_b":"What is he smoking???","commenter_a":"He lies!","post_message":"Whatever you say, Mr. President."},{"comment_id":"10153836700616636","commenter_b":" Classic","commenter_a":"Stop your lies and propaganda against muslims! Muslims would never do this cause they are peaceful! Tell the truth! This was an orchestrated conspiracy by the scientologists!","post_message":"He was 84"}]
