[{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"760686517397260","commenter_b":"Stephanie Hathcox","commenter_a":"John Rivera","post_message":"In case training your dog to shake hands weren't impressive enough."},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"1604700786499928","commenter_b":"@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"1349866401695684","commenter_b":"Ember Kellough When the left wants to bring in millions of illegals and Syrian's it isn't from having a heart but instead to eventually expand their voter base, all about power and control with the left. When they do gain that we can kiss our Country goodbye or stand up and fight them in another civil war. When over 60% of births are coming from liberals it's difficult to not see it coming. The commie left will turn America into another Detroit and Baltimore.","commenter_a":"Obama is: 1st.muslim 2.gay 3.communist Don't be surprised, he's doing exactly what he said, fundamentally transforming the country. America \"voted\" for this.","post_message":""},{"comment_id":"1825652724337236","commenter_b":"Hillary's plan. More lies, more refugees, more illegals, more foreign enemy money for her favors and direct access to her etc more n more destruction of America. Bravo. TRUMPS PLAN Work with generals create plan within 30 days to defeat ISIS, Increase our military, increase our subs n ships by 350, raises for our military, 1200 more fighter aircraft, Securing our Mexican border, increase border patrol police, no more illegals, catch n release, vetting will be strict, restore our inner cities with jobs, 6 weeks maternity leave, deduct child care expenses n elderly that live in our homes, add incentives for employers t provide childcare, create new dependent savings plan, creating fair trade deals, tax reform and lower taxes for everyone and making corporate tax globally competitive, regulating reform for businesses and reviewing regulations that inhibit hiring in mining. He's for peace and us all banning together, Return our nation ...","commenter_a":"This man is a machine, he does like 16 events a day. If he works as President half as hard as he has campaigned he will be EXCELLENT!","post_message":"THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"}]
