[{"comment_id":"10153237445176323","commenter_b":"Godddd she's so needy. That hoe def aint loyal. We all know what happens to hoes like that...they get burnt","commenter_a":"@username @username dam Cheryl is annoying... Defriend straight away","post_message":"When is Cheryl's birthday?"},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"},{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"10157152156085354","commenter_b":"BUILD THAT WALL!!!","commenter_a":"I hope he is the first to meet with them. He will only make the news one more time.","post_message":"WOW"},{"comment_id":"1032855700144015","commenter_b":"No one is looking to take away your guns, just like no one is looking to take away your car.","commenter_a":"Taking guns away from citizens violates our rights. Criminals will be the ones with guns. I have a hard time understanding why the hell people dont get this!!!!","post_message":"Nearly 50 years ago, Robert F. Kennedy made an appeal for gun control in Oregon -- just miles from where the recent mass shooting at Umpqua Community College occurred."},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"}]
