[{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."},{"comment_id":"10158609012850725","commenter_b":"What an ignorant old hag smfh","commenter_a":"Time to round up all the black scum and jail them all. If found having done a crime they get death. The faster we get rid if those in jail too by death the better it is. They all are scum and should all be destroyed.","post_message":"A suspect has been charged with the murder of Karina Vetrano, whose gruesome death shocked the community and set off a six month search for her killer."},{"comment_id":"10153273876007377","commenter_b":"Lady!!1 It's Jail time !!!","commenter_a":"She is a LIAR and TRAITOR.","post_message":"This is a clear violation of federal law that has put these agents in harm's way."},{"comment_id":"10154230150699411","commenter_b":"Bastard british dog ottoman sunnis was wrost enemy of wahhabi saudis.check your history motherfucker.your resourceless England speard wahhabism all over world by supporting saudis.check your own history!muslim world is uniting when we unite your britain have large number of street beggars.your Uk have only tourism!end of Uk signs apeared yesterday when English team beat by West Indies!haha","commenter_a":"At least it's not as bad as the destruction of the Giant Buddhas of Bamiyan, or the mass destruction of priceless World treasures like the Hindu, Buddhist & Sikh Temples in India or the destruction at Palmyra!! Sunnism is the World's problem!!","post_message":" vandalism"},{"comment_id":"1011356012327296","commenter_b":"The lady must go to prison","commenter_a":"Looney toon","post_message":"Should the Hillary Clinton investigations continue?"},{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."}]
