[{"comment_id":"1436141653072527","commenter_b":"Europeans, that's a joke all in its self.","commenter_a":"For all those that think protests didn't block traffic in MLK days. Stop using him as your go to pawn thinking you know something about civil disobedience and fighting for rights.","post_message":"It's the image that is defining a protest movement."},{"comment_id":"10153888112799330","commenter_b":"God bless you all.","commenter_a":"I hope they gave you the treat and treatment of the hereo you are. Awesome job Officer Axel.","post_message":"Axel helped save a missing woman after finding her in a pond in Tolland early this morning. ---> @webpagelink  How about some \"likes\" for Axel."},{"comment_id":"10153526551574497","commenter_b":"Now those fuckers will manage to rename their country as \"Aaaamerica\" to undisputably top the list...","commenter_a":"Not if you use America","post_message":"Via ClickHole"},{"comment_id":"10152917753321051","commenter_b":"The bitch cussing in the background should not be near kids!","commenter_a":"Good for you two to look out for that child! She shouldn't be near any children! !!!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10153195743346051","commenter_b":"Bitch need a ass whooping!!!!","commenter_a":"need to stick her head in a toilet a few times til she thinks she's drowning","post_message":"Decide for yourselves if this woman got off too easy."},{"comment_id":"10153448669913984","commenter_b":"All she had to do was say she was to fat to walk any farther and lazy. Should of called the cops and let them tow her.","commenter_a":"I want to have cards printed that say \"Congradulations! You have just won Jerk Of The Year Award for parking in a handicap parking space. Because of you my Mother could not get into her wheelchair. May you never have to be in the same situation.\"","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"496246340568716","commenter_b":"She has been fired for lying / watergate mess -/ all she is corrupt lying old pruney bitch !!!","commenter_a":"Absolutely","post_message":"Hillary is now denying a MAJOR part of her original response to the Benghazi attack. It's unbelievable to think that she believes she can pull this over on the American people. Everyone needs to know about this...  Is Hillary Clinton unfit to be president?"}]
