[{"comment_id":"1152177854802243","commenter_b":"She's a POS lire!!! Qualified! Gimme a break!","commenter_a":"I don't believe a word she says. Right now the most important thing to her is more excuses...","post_message":"A young boy asked Hillary Clinton \"What is the most important part of life?\" Here's her response."},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."},{"comment_id":"727863887335286","commenter_b":", WRONG, No way, get real, he had every right as well as a duty to make the case of Israel to America's ears. I learned more from his talk then from our ever non-transparent utopian president who believes the world will all sing kumbaya together because of his ever lovin idealistic, progressive, warped world view.","commenter_a":"Tha.no Mr john Boehner for inviting The PM. Thank you","post_message":"Do you agree? Jerusalem Post \\\\ Opinion & Blogs"},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"10154104815247061","commenter_b":"Its the degenerates who voted for a child rapist to run our country!","commenter_a":"I'm sorry.. I noticed some people responded to this story with the \"angry\" emoji... Why would anyone be angry at giving back to the community or better yet, to our vets?","post_message":"WATCH: President Obama and First Lady Michelle Obama serve Thanksgiving meal to residents of a retirement home for military veterans in Washington, D.C. @webpagelink"},{"comment_id":"10153377171751320","commenter_b":"scumbag","commenter_a":"When he is in need, they should all turn their backs on him again,but for good. He stinks as a Mayor . 👎🏻","post_message":"ACTIONS SPEAK LOUDER THAN WORDS... NYPD Officer Brian Moore was shot in the head, killed in the line of duty and Mayor de Blasio was a no show at his death announcement. Click here to read why he said he wasn't there: @webpagelink"},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"}]
