[{"comment_id":"458537397670174","commenter_b":"NO She can Stick it !!!","commenter_a":"No way and the kids are not going to either.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants?  Comment 'yes' or 'no'."},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question:   “Have you seen those very, very controversial videos?”"},{"comment_id":"10153098697497522","commenter_b":"Let's see how \"sassy\" you dumb bitches are when ISIS gets you. Take your #raisesassygirls bullshit to syria.","commenter_a":"#VOTE The Republican Radical Christian Crazy #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #RAISESASSYGIRLS #FeVoteRising #DontBeAwaLLfloWer #VOTE","post_message":"Is Donald Trump suffering from imposter syndrome?"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"734144593405526","commenter_b":"Yes","commenter_a":"Yes.","post_message":""},{"comment_id":"10154774162911323","commenter_b":"@username, since you agree with @username, how does one load a machine with votes?","commenter_a":"\"The people have spoken\" is such an unfortunate choice of words when they gave your opponent in excess of 2M votes more than you.","post_message":"\"We believe we have an obligation to the more than 64 million Americans who cast ballots for Hillary Clinton.\""},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"}]
