[{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"},{"comment_id":"10154430974181756","commenter_b":"The world hasn't forgotten.","commenter_a":"It's sad that it happened 2 years ago yet the world forgot them and nothing has been done to end the ordeal. Smh","post_message":"The young woman reportedly said some of abductees have died but many remain alive in Boko Haram captivity.   The mass abduction in April 2014 sparked worldwide outrage."},{"comment_id":"10153634086331130","commenter_b":"It's not the point! The point is that it was NOT any of her, or YOUR, for that matter, business what that girl should or should not wear in this FREE society!! Put on your Spanx, cover your own fat, & shut the hell up!","commenter_a":"Sorry but in order for the dress to have the smooth look she does need spanx. She getting upset when she know damn well she put on spanx under her dresses. Many women fat or skinny wear spanx it's part of a woman's closet.","post_message":"\"I hope this is shared and gets back to you...\""},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152939538841051","commenter_b":"what a stupid bitch duh","commenter_a":"It seems to me that they have no control of their sexual needs and have to use children because they can't get anyone their age to have sex with.","post_message":"This woman thought the photos she sent via Snapchat would disappear. Well, they didn’t. Police took one look at them and had all the evidence they needed."},{"comment_id":"437802309734983","commenter_b":"Wes spoken like a true submissive little bitch. Now go stand in the corner like a good little boy","commenter_a":"Hooray! Now, remove them immediately starting with Ferguson.","post_message":"President Obama is taking a necessary, bold step."}]
