[{"comment_id":"898000640266692","commenter_b":"True sir but he a bitch for that lol","commenter_a":"If he would have kept talking he could have ended up dead. People man have no chill, calling dude a bitch. He avoided confrontation!","post_message":"Cop Goes On A Major Power Trip After Being Asked A Simple Question!"},{"comment_id":"10152900481316336","commenter_b":"Racist bitch^^^","commenter_a":"She must be a Muslim....no sensativity to killing her own new born?","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"557993331054503","commenter_b":"Yes and some she A BITCH from HELL.","commenter_a":"With her freedom.","post_message":"Pentagon Attacks Trey Gowdy, Because He Refuses To Abandon Persecution Of Hillary... He Needs Your Support  He's taking a stand for the soldiers who were left to die.   Do you think Hillary needs to pay for her crimes?"},{"comment_id":"10153755826404062","commenter_b":"Shut up racist b*tch","commenter_a":"He is not the president and she is not the first lady he is Mr George Bush and his mama, I mean his wife, since you Obama haters want to go there!","post_message":"Give a big howdy to President George H.W. Bush and wife Barbara, who are out enjoying RodeoHouston today! :)  Photo: RodeoHouston  RodeoHouston news: @webpagelink"},{"comment_id":"10154217110321770","commenter_b":"We have a lot of work to do in America cleaning our schools of these liberal crazy teachers.","commenter_a":"This country, well the insane left, has lost it completely. Just flat out have gone rabidly insane. They need STOPPED. Now.","post_message":"These are the people teaching your children"},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""},{"comment_id":"10152932838822169","commenter_b":"I like the way you assume everyone is consuming too much. When sitting on our butts all day has more to do with it.","commenter_a":"Makes sense. The explosion of obesity has occurred after the advent and proliferation of fast food restaurants.","post_message":"Fast food kills gut bacteria that can keep you slim, study finds (From PBS NewsHour)"}]
