[{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."},{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"571042013020392","commenter_b":"If this is true, why doesn't every woman in America have problems????","commenter_a":"let them out . turn the puppys loose","post_message":"Every woman needs to read this!"},{"comment_id":"10153374746118812","commenter_b":"Reality check she removed all courage and self respect leadership. What is he but a man in training....... Whites love when we humiliate each other to protect the massa. She need to know she planted a seed that will resp bitter fruit","commenter_a":"Asllan Kacanolli Flamur Kacanolli","post_message":"He's the boy seen around the world being forcefully pushed from the Baltimore riots by his mother. And this is what he has to say about it..."},{"comment_id":"10156089078040354","commenter_b":"Put The Woman In Jail!","commenter_a":"THROW - HER - IN - JAIL - NOW! What the hell are they waiting for? Drag her ass to jail in handcuffs wearing a sign around her neck that says, \"ALL YOU OTHER CRIMINAL POLITICIANS AND BUREAUCRATS ARE NEXT! NO ONE IS ABOVE THE LAW.\"","post_message":"***BREAKING***"},{"comment_id":"10154183673293132","commenter_b":"It's usually the accuser that's doing the cheating. Good for her for getting rid of that douche.","commenter_a":"The same thing happened to my best friend when she started to make a healthier lifestyle for herself. Her now ex wouldn't support her at all! She was supposed to come to the gym with me one day and completely bailed out because she was fighting with her a**hole boyfriend. Turns out he told her that she's fat, will always be fat and that there was no point in going to the gym with me when she'll quit anyway. Now I wasn't aware about what he told her until recently because she was so ashamed of what he told her and knew I'd bash the crap out of him. He'd also accuse her of cheating every single time she went out or \"joke\" to her about texting other guys whenever she pulled her phone out. He was the one who ended up cheating (or so we think but I'm sure ...","post_message":"Alexander's husband started calling her \"fat\" after she dropped weight to save her health."},{"comment_id":"10153663398345695","commenter_b":"Are you for real, time and money wasted on a couple of idiots that felt the need to drop confederate flags on a church lawn!!!","commenter_a":"Can someone please explain to me how this is a crime .","post_message":"\"What can you do? Nothing but pray for them,\" said Stacy McCrary.   Why the suspects can't be charged with a hate crime starting on Channel 2 Action News at 4 p.m."}]
