[{"comment_id":"10153497527962464","commenter_b":"@username Add me..","commenter_a":"from Egypt we Love you. And we will redeem you, Mr. President.","post_message":"Headed into the #GOPDebate. Join us at 9pm ET on Fox News and tedcruz.org/debate"},{"comment_id":"10154068476123717","commenter_b":"The tea party and Republican Party are two separate entities","commenter_a":"That's because Hillary best represents the ideals of Reagan-era Republican Party. Trump represents the modern-day teabagger nutjob Republican Party. All the corruption and lies of the former with half the brain cells.","post_message":"It may surprise you, but George Bush Sr. knows who he is voting for come November, according to a Kennedy: @webpagelink"},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: \"If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.\""},{"comment_id":"10156595993175725","commenter_b":"WHen u get in there the illegals needed to be rounded up.","commenter_a":"and the winner for tonight is @username","post_message":"It all begins tonight - WE WILL FINALLY TAKE OUR COUNTRY BACK AND MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1004046419654835","commenter_b":"This woman is a disgusting human.","commenter_a":"She has A \"TWATTER\" account.......","post_message":"Another Coulter Twitter rant brings out the right-wing idiots."},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""}]
