[{"comment_id":"10153823695146336","commenter_b":"FORGIVE HER AS GOD FORGIVES YOU....PUNISH HER IN OTHER WAYS..NO CELL PHONE..NO XBOX. ..NO TV IN HER ROOM..NO COMPUTER IN HER ROOM (ONLY FOR HOMEWORK OVERSEEN BY YOU)","commenter_a":"It's called tough love. That's what children need","post_message":"Would you cancel Christmas to punish your child for stealing?"},{"comment_id":"638502853006960","commenter_b":"I love this picture, can you see michael adams apple. Women do not have one.","commenter_a":"I wonder if she refers to her own mother that way. Btw, the mother who also lives in the White House at our expense.","post_message":"Michelle Obama just insulted mothers everywhere... You'll be furious.  We're sick and tired of hearing about her. Let's make her go away forever.  'LIKE' if we should kick Michelle out of the White House!"},{"comment_id":"384727298550424","commenter_b":"So twisted. Islam has been illegal here since 1952","commenter_a":"Not my pOtus not my kkk","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country.  WARNING: Viewer discretion is advised"},{"comment_id":"522223391280988","commenter_b":"@username you do not get it David. Bernie Sanders and Donald Trump are so popular because people are sick and tired of what is currently available. He is not unelectable and Hillary Clinton is going to lose the Donald Trump if she wins and that is not good for anybody in this country. She's going to kill this country","commenter_a":"Why are you so biased towards Hillary? You are supposed to represent ALL democrats!","post_message":"Hillary Clinton was just announced the winner of today's Democratic caucus in Nevada. Congratulations to her and her supporters!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154568442846336","commenter_b":"Stupid","commenter_a":" him","post_message":"During a press conference, Secretary of State John Kerry suggested the media should stop covering terrorism \"quite as much.\" @webpagelink"},{"comment_id":"1187550147931680","commenter_b":"It is her job totally, but let's be fair, her job duties changed abruptly in June after SCOTUS ruled. That said, she should resign if she can't/won't carry out her duties and leave her religion out of the office. She can be as devout as she wants, but not on the taxpayer's dime. Those couples are paying her salary and deserve better","commenter_a":"If she don't want to issue gay marriage licenses she shouldn't have to...","post_message":"JUST IN: Kentucky clerk who refused marriage licenses for gay couples taken into custody @webpagelink"},{"comment_id":"10152602108687061","commenter_b":"And a fat hoe","commenter_a":"Michelle looks more like a hoe everyday","post_message":"Pres. Obama: \"I have no more campaigns to run.\"  (audible clapping in chamber; pause)  Pres. Obama: \"I know, 'cause I won both of 'em.\" #SOTU2015 -- (click for audio) abcn.ws/1JbdOLY"}]
