[{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"},{"comment_id":"10155816958010354","commenter_b":"GOD gave some ladies a bushel of beauty and a teaspoon of common sense.","commenter_a":"What a cruel thing to say","post_message":"Desperate..."},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"},{"comment_id":"636990926431695","commenter_b":"Let her go to a country that enforces Sharia law and see how she really likes being beat.","commenter_a":"She is insane!","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"508820039306289","commenter_b":"This should be in every state. Men that force themselves on a woman do not deserve to have the ability to rape again.","commenter_a":"I dont understand the verbiage \"violent sex offenders\". Isn't rape always violent, are their non-violent rapes I don't know about?","post_message":"This state did it, what about yours?"},{"comment_id":"1711366762447074","commenter_b":"@username don't worry when trump gets in office you'll be deported! Hurry up trump get this Mexican out of here!!!! Let's make America great again!","commenter_a":"So unprofessional. What happened to the president being formal. Not making himself a meme. It's pathetic. The Obama administration is an embarrassment to this country.","post_message":"WATCH: In celebration of Star Wars Day, The White House posts video of President Barack Obama and First Lady Michelle Obama dancing with R2D2 and stormtroopers. @webpagelink #MayThe4thBeWithYou"}]
