[{"comment_id":"1211790348838313","commenter_b":"Punk ass bitch mo fos!","commenter_a":"You people who are shooting these schools and theaters up aren't proving nothing to nobody except your a bunch of punks bitches and cowards.","post_message":""},{"comment_id":"10152743176086545","commenter_b":"It actually doesn't take that long anymore for capital murder death sentences for them to be executed.","commenter_a":"To bad the state can't appeal for the death penalty versus life in prison","post_message":"\"I wasn't surprised by the verdict, just based on the overall tragedy of what happened. I was very disappointed that the jury reached a conclusion so fast. We were very kind of shocked by that,\" he said."},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--\"I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...\""},{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"1411157285603697","commenter_b":"Californians will get tired of being victims eventually and deal with these guys.. meantime lets send liberals refuges and illegals to them","commenter_a":"Brown is a two-time failure as governor.","post_message":"More are coming..."},{"comment_id":"10158211660050725","commenter_b":"Ignorance= a basic understanding in economics.","commenter_a":"All the crying liberals on this feed is enough to make me skip my coffee and still be content at work today.","post_message":"President-elect Donald Trump is poised to take his victory lap today, appearing first in Indiana to salute workers at a factory that he made a campaign promise to save and then in Ohio on the first stop of a \"Thank You Tour\" to honor the supporters in states that gave him his stunning victory."}]
