[{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"1759728807637196","commenter_b":"Vicente Fox..You're not welcome in OUR Country!!","commenter_a":"Good then you'll get what you deserve 😉","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"599148503619234","commenter_b":"Yeah bitches","commenter_a":"We all know who... @username Daniel Hughes @username","post_message":"This is so accurate  #WSHH"},{"comment_id":"1004981906294263","commenter_b":"Hillary DESTROYED him.","commenter_a":"I believe Trump won, but barely. What he should have pushed on and pushed really hard are three things. First, he should have looked directly into the camera and said, \"Mrs Clinton has said over and over that she is infinitely more qualified than I to be Commander in Chief. She could not and actually would not protect four lives let alone 320 million. Do YOU trust her with your lives and those of your children? Mrs Clinton has said over and over that she understands the plight of the inner cities and has worked hard to erase the despair that exists in our minority communities. Tell me, Chicago, Baltimore, East Saint Louis, and every other inner city, this woman has had nearly thirty years to help you and other than pander for your vote, exactly what has she done and are your lives better? And lastly, Mrs Clinton has ...","post_message":"The 1st presidential debate in 90 seconds.  Who do you think won – Hillary Clinton or Donald J. Trump?"},{"comment_id":"934295046610968","commenter_b":"Run Sarah RUN!! President Palin has a certain \"RING\" to it !!!","commenter_a":"SHE IS OK WITH TORTURE. REMEMBER?","post_message":"When Sarah Palin posted a picture on Facebook bragging about how her son used their family dog as a \"stepping stone,\" she proved once again that animal abuse doesn't bother her at all, and animal rights groups are now slamming her for it."},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""}]
