[{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."},{"comment_id":"10153397476831336","commenter_b":"What do we do when Hildebeast gets elected? She certainly has no opponent in Jeb.","commenter_a":"What he meant to say was this was another victory over the people of America","post_message":"President Barack Obama called today’s Supreme Court ruling on gay marriage “a victory for America.”"},{"comment_id":"1260941960612940","commenter_b":"To unite for all the right concerns all of them with us in mind because is 100% for and by the people...please for your families...you have to check learn help in anyway you can act and share and share again...because species are disappearing everyday...everyday...for you your loved ones for the nation for the world the planet..hiring humans for humanity and peace for all not the few...www.jill2016.com","commenter_a":"What a lot of people don't know about Trump that support him is, that those same people would not survive him ...Trump would even eat his own kind....it's just his nature.","post_message":"This teen just figured out the perfect question to start asking Trump and his supporters."},{"comment_id":"922274701162393","commenter_b":"Wait, she is the old hag looting America, and the rest of the world.","commenter_a":"@username - Such an inspiring woman. You are okay with a old hag looting America but not a woman with great accomplishment trying to occupy White Office. #Hillary4WH #MadamPresident","post_message":"Hillary's new favorite singer."},{"comment_id":"1115766885107801","commenter_b":"Carly Fiorina is so lame she should be charged for being a Phony! (Fake).","commenter_a":"Her comment alone discourages me from wanting to see more. SILLY","post_message":"Carly Fiorina used the opportunity to bring up the time President Obama once ate dog meat."}]
