[{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"1788538208028189","commenter_b":"those look hellllllla good 😍😍😍","commenter_a":"@username LOL DUDE","post_message":"Insanely delicious."},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"10152650786516491","commenter_b":"^^hoes got problems","commenter_a":"Dont like him, Dont Respect him can care less where , Rapist, Thief and total idiot goes except to jail","post_message":"Winston lost only one game as a starting quarterback."},{"comment_id":"1201018046605718","commenter_b":"Why should I support someone who's two faced and and is only changing her opinion because her PR person told her to","commenter_a":"#freekesha....sexual assault is nothing to start arguments over ...she needs all the support she can get....as a survivor, I'm with you....#standtogether!","post_message":"We can all use our voices and platforms too."}]
