[{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"10157476731040725","commenter_b":"Now get you're head out of his illegal Orange trumpster butt2.. It's over flowing with his B.S for a LIFETiME!!!!!","commenter_a":"This is what I don't understand, Every Trump rally, there are 1000's of people in attendance. Not as many people show up at Clinton rallies. Yet she is ahead in the polls!! Is the media and the poll takers rigging the outcome of the polls?","post_message":"A beautiful evening in Ft. Lauderdale, Florida last night. We need to WIN Florida- so make sure you get out and VOTE this November! I am here all day - attending events -- looking forward to a great day! -DJT"},{"comment_id":"1050118365055120","commenter_b":"I couldn't even watch, turned the channel. Didn't need to hear another black actor bitch!","commenter_a":"Too bad there was not a black actor or actress that was good enough to be nominated or win a oscar!!!!!","post_message":"Well, Chris Rock didn't hold anything back. What did you think of his monologue?"},{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"10154126988050787","commenter_b":"And emma dunsdon, you filty woman.","commenter_a":"Zzzzzzzzz yet more boring posts from the BBC..oo I've got cancer, please feel sorry for me. Yeh we get it, is it a competition to get the most comments ,likes and shares on FB..let's just pull some ..more..on..those..heart strings.","post_message":"Battling cancer with confidence 🙌  Meet Laura, the make-up artist who works with cancer patients in her spare time. (via BBC Three)"}]
