[{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because \"it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.\""},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"},{"comment_id":"10154095475454575","commenter_b":"Fry him.with low power so he feel the pain .","commenter_a":"Just fry him. No need for him to live another day","post_message":"The toddler and the 14-year-old have been diagnosed with HIV, genital herpes and chlamydia."},{"comment_id":"1258430004197187","commenter_b":"It will never happen. Hillary will win and that will be the end of America kiss your freedom goodbye and welcome Hillary Clintons new and improved America you fools!!!!!","commenter_a":"The regular polls are rigged. This is what's actually real. We need to find a way to get polls of our own. @webpagelink","post_message":"Despite getting barely any attention from traditional media, our numbers have been surging on social media.   See what the buzz is about at tonight's #GreenTownHall!"}]
