[{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER \"NEW PET\"  READ & COMMENT BELOW:"},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"10154036554629411","commenter_b":"God I hope Trump gets in not Clinton , he may open his mouth and speak as he feels refreshing Realy , but I'd rather him than warmongering old B like her!","commenter_a":"yes, we can tell them apart very well :D Greetings from Czech republic BTW :D","post_message":"'Death to teetotalers and vegetarians'"},{"comment_id":"10155152237477042","commenter_b":"Everyone without documentation will get deported.","commenter_a":"Here in NY, we have a huge population of illegal immigrants from China, Russia, Israel, and the Middle East. Will they be rounded up too, or do the deportations apply only to Latinos?","post_message":"New guidelines under President Trump greatly expand the amount of people considered a priority for deportation.   Undocumented immigrant suspected, charged, or convicted of a crime (including minor traffic violations) will be at the top of the list."},{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."},{"comment_id":"10153222476276323","commenter_b":"Breasts are breasts. get over it.","commenter_a":"The fact that womens nipples are considered porn and men's not, given the fact that ours are literally NEEDED as a vital source of nutrients for children is a notion that needs to be challenged. How can something that provides the best source of nutrients for a baby be considered too obscene to be observed in public where as men's which are just another body part be considered fine?! Free the nipple doesn't require a woman to bear all. I won't be, I've had no reason either functionally or otherwise to display mine in public (it's a bit cold in this part of the world) but my body is not obscene. I totally support the women doing this. If nipples are so provocative it's the sexualisation that society places on women not the female nipple owners that are the problem.","post_message":"\"It has to be said that, to the casual observer, the #FreeTheNipple campaign is a very confusing thing. Let’s just get this straight, one might say, it’s a feminist movement that encourages toplessness, and which has led to an Icelandic MP, respected as a serious parliamentarian, getting her boobs out for everyone to see. And you’re telling me this is one in the eye for the patriarchy?\""}]
