[{"comment_id":"603381206519125","commenter_b":"Miley is a nasty skank!","commenter_a":"get rid of miley.","post_message":"Miley attacked Christian conservatives, but Bristol had an epic answer for her.  Good. We support Bristol 100%.  Is Bristol Palin a better role model than Miley?"},{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"10154211946341523","commenter_b":"@username shut the hell up. U bitch","commenter_a":"I smell bullshit. Somebody lying","post_message":"“The mother says that in the moments before the crash, the bus driver said something to the effect of ‘Are you all ready to die?’  Seconds later, the bus was on its side and five kids were killed.\""},{"comment_id":"10153469105041746","commenter_b":"Lol this chick gets her history from Hamilton","commenter_a":"Think about these 2 statements: \"Make America Great Again,\" and \"America Is Not Great.\" If you support the first one, but are angered by the second, you need to take Logic 101. As for the statement on this woman's hat, \"America Was Never Great,\" I strongly disagree. I saw Hamilton: An American Musical and there was a time when greatness abounded. Since then, we've alternated between great and not so great, sometimes concurrently. It's a big country!","post_message":"Meet the 22-year-old between the controversial hat."},{"comment_id":"1137213316374919","commenter_b":"I'm loving it. Turn it Megyn Kelly. you'll enjoy her hate.","commenter_a":"WHY is @username giving stage to these Republican pundits all the time?? Its disgusting! This network has become a pro-Trump propaganda and pro-Repub stage! Two thumbs DOWN!!","post_message":"JUST IN: John Kasich is the projected winner in the Ohio GOP primary.   More: @webpagelink"},{"comment_id":"1961690760557329","commenter_b":"How gorgeous is their baby gonna be @username @username can't believe one of my other husbands got someone else knocked up tho wtf","commenter_a":"Montana Cases","post_message":"Congratulations Rosie Huntington-Whiteley!"},{"comment_id":"10153135572561323","commenter_b":"Pigs dirty cunt. Shut your mout bloody pig","commenter_a":"BBC News's journalist didn't have any story to write about Britain's own daughters? Those 1400 plus little girls who were repeatedly raped at the hands of Muslim grooming gangs for over a decade? Why couldn't she manage to that in her own filthy backyard which even produces terrorists who are raping and killing women in Syria & Iraq? Why did she feel that it was her duty to make a celebrity out of a rapist? Besides, the swines who are crying here for her are the same swines who objected to capital punishment for the rapist; who are now making money publishing stories of Nirbhaya. The pimps in Indian media who are talking about this are the same swines who objected to death penalty for the rapists. @webpagelink","post_message":"\"It was not rape, but my reaction was too involuntary, and its intensity too high, to say that nothing bad happened. Something happened. And it had the whiff of rape. I suspect many of you reading this will be eager to tell me what happened...\"  A challenging, deeply personal piece about why we need to talk about sexual assault in all its forms."}]
