[{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"},{"comment_id":"1349633901749900","commenter_b":"@username, real women protect their babies, not kill them","commenter_a":"Any \"man\" who wants to try to control what women do with their body is a worthless piece of feces and they will be treated as such.","post_message":"The gift of life must be protected from the slaughter!  Click here to sign your petition in support of the Life at Conception Act!  @webpagelink"},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, \"because there are jobs Americans just won't do,\" He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"10153836700616636","commenter_b":" Classic","commenter_a":"Stop your lies and propaganda against muslims! Muslims would never do this cause they are peaceful! Tell the truth! This was an orchestrated conspiracy by the scientologists!","post_message":"He was 84"},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"494909614001888","commenter_b":"That's it Chris we're all fucked - fucking wall climbing alligators!!!!!!!","commenter_a":"Abraham Guimaraes","post_message":"Nope. Not photoshopped."},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"}]
