[{"comment_id":"864444063671976","commenter_b":"Super gross. I can't stand that feeling how some women think it's sexy is beyond me.","commenter_a":"Gross","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"},{"comment_id":"1611989915762064","commenter_b":"Women are objects to Trump- not people. Unfortunately, that's nothing new and despite all the changes in the way our society views and treats women today, they are still objectified. Some women today even objectify themselves- Beyonce, the Kardashians, many others who make themselves sex objects in order to \"succeed\". As a female, you can't be an actress, a musical artist, a broadcaster on CNN or any other job in the public eye unless you're young and attractive. So if you're shocked or offended at Trump's words, you've been living under a rock. There are tens of thousands of men who think and talk like him and they're your fathers, brothers, husbands, co-workers, bosses, judges, CEOs, doctors, lawyers, cops and US Presidents. It's nothing new and it will never change.","commenter_a":"Sad for her. He is such a shameful person.","post_message":"JUST IN: Melania Trump issues statement following release of husband Donald J. Trump's 2005 sexually-charged remarks: \"The words my husband used are unacceptable and offensive to me. This does not represent the man that I know.\" abcn.ws/2dmz2yg"},{"comment_id":"961446100576222","commenter_b":"Send the worthless goat-f***ers home!","commenter_a":"Don't send them to America!","post_message":"UNREAL! Muslim 'Refugees' Camp At Terror Memorial And Protest Over Lack Of Housing In Paris [Video]"},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."}]
