[{"comment_id":"1741083142832713","commenter_b":"She plagiarized!","commenter_a":"Keeping it classy!","post_message":"\"On July 28, 2006, I was very proud to become a citizen of the United States – the greatest privilege on planet Earth.\"  Melania Trump, wife of presumptive GOP nominee Donald J. Trump, spoke about her pathway to U.S. citizenship and thanked veterans who protect the freedoms we enjoy as Americans. @webpagelink"},{"comment_id":"10153760611904087","commenter_b":"@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: \"I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president\". Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"10154434943826323","commenter_b":"The Arab trade was on a larger scale mate.","commenter_a":"The British Empire and other European nations were not the only ones responsible for the suffering of blacks. For centuries, Arab and Berber traders made big profits from the highly lucrative 'business' of slavery. Millions of black Africans were captured/kidnapped from their homes, abused and sold in slave markets. Today, In places like Saudi Arabia and Qatar de facto slavery still exists. People from the Philippines, Indian subcontinent etc. live and 'work' there in subhuman conditions. This is not a history lesson. It is happening right here and now. None of this justifies in any way the crimes committed by European colonialism in general and the British Empire in particular against indigenous peoples. But I do hope Mr. Gayle (whom I respect) will not hesitate to write/speak about injustice and racism that still exist in other parts of the world - including in African and Arab nations - with the ...","post_message":"Howard Gayle: \"The education system told me nothing but lies about Africa.\""},{"comment_id":"523485051181568","commenter_b":"Such a lying witch.","commenter_a":"She has dealt ace of spades. Let her bare the consequences!","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!”  Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"631181740405738","commenter_b":"Deport all illegal immigrants. .","commenter_a":"Yes","post_message":"Sheriff Joe and Donald Trump are joining forces to take on illegal immigrants.  It's about time someone put their foot down and stopped this madness.  Do you think all illegal immigrants should be deported?"},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, \"Don't do it\". Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"507737642755232","commenter_b":"Hillary has a list of wars that she provoked go take care of your wives, she be to dangerous for you, she be a backstabbing. Learn to read.","commenter_a":"This man trump will be too dangerious for the oval office he will lead america to another third world war so to all you red necks supporting he's cause do the right thing before you unleash hell on earth","post_message":"Every day I wake up determined to deliver a better life for the people all across this nation that have been ignored, neglected and abandoned. -DJT"}]
