[{"comment_id":"10153606250119778","commenter_b":"You look beautiful and happy!!! Congrats to you!!","commenter_a":"Stupid","post_message":"A woman vowed that she'd marry herself if she hadn't found true love by 40. And for her 40th birthday, that's exactly what she did."},{"comment_id":"10154557773663203","commenter_b":"Its like sayin that one is born an alcoholic or a chain smoker... It is a LEARNED action","commenter_a":"Uh...no, most Americans don't say that!","post_message":"Are gays ‘born that way’? Most Americans now say yes, but science says no"},{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"1077069452383729","commenter_b":"@username she better be overreacting","commenter_a":"Yo this made me think if that shyt gonna hurt @username","post_message":"She's not ready for a tattoo"},{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"877314922325204","commenter_b":"What would you expect him to say? I wonder how this country got to where it is today since we need more immigrants on welfare to advance us.","commenter_a":"rose colored glasses ? Go talk to your Dad and brother !!!!","post_message":"Don't you agree Jeb Bush is WRONG on immigration?"}]
