[{"comment_id":"1028231380578058","commenter_b":"Tha bitch!!","commenter_a":"WHAT DOES SHE OWE THEM IN RETURN...THINK ABOUT IT. WHY WOULD THEY GIVE MONEY","post_message":"Americas Freedom Fighters"},{"comment_id":"635245713332674","commenter_b":"Jail her!","commenter_a":"She is corrupt about time she need to come clean.","post_message":"The evidence in the Benghazi controversy just blew up in Hillary's face, it's over.  It's about time. Send her to jail already.  Do you agree Hillary should be arrested?"},{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"},{"comment_id":"1030788763705100","commenter_b":"Yup, start by getting rid of his useless ass.","commenter_a":"Asshole","post_message":"President Obama talks about the urgency of Climate change, saying \"We've proven that the choice between our environment, our economy, and our health is a false one. We've got to strengthen all of them together.\" What do you think?"},{"comment_id":"801111976648525","commenter_b":"Wow that's all I can muster after reading these comments","commenter_a":"copy that.....","post_message":"This brave, hard-working man has accomplished so much in the face of unprecedented obstructionism and hate. History will treat him kindly.   Thanks to Roy Mark Ramdas."}]
