[{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":""},{"comment_id":"10155963781495354","commenter_b":"Kick that racist bitch out.","commenter_a":"Socialist pig","post_message":"Stephanie Rawlings-Blake insisted that, in the last few weeks, she has “seen a lot of progress”--and by that, she meant tax dollars going to “recreation centers” and spending on schools."},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"},{"comment_id":"10153198594904342","commenter_b":"Really!!! Fix the F***** System. And make her suffer for what she did. Why let her out?","commenter_a":"If that's the case, then let her go 3 or 4 days w/o food. Just give her nothing but Water, and/Gatorade/Powerade. The Human Body can go 3 or 4 days without food; just not Liquids. The Human Body, can run off it's Reserves, If We have Excess weight, don't worry. You'll only feel hungry for a little while, then whenever Our Body's stop growling; that means, that your Body will start Eating off it's reserves.","post_message":"A story working on for Eyewitness News today -- a Houston mother is facing multiple charges on allegations of child abuse.  Investigators say her son  \"like a prisoner of war who had been starved.\"   @webpagelink"},{"comment_id":"10153894992921336","commenter_b":"@webpagelink Wake up my friends. Biological Jihad being preached all over Islam is the most dangerous problem to ever face the world because the world is still ravaged by fake political correctness, and many countries are not united as they once were. Immigration without assimilation is invasion. Be a Guardian for good. #CognitiveAwareness #KnowledgeIsPower #Guardians #ProtectYourCountries #AlwaysBeReady #UniteAgainstIslam","commenter_a":"I heard that Obama does come from a family that is muslim. maybe his father but either way he does believe in their ways and as for Hilary Clinton she is a liar a thief and has no business running for president. we do not need anymore murders caused because she has better things to do like warning her family and not America about anything.","post_message":"“President Obama and Secretary Clinton just won’t say it—radical Islam. And they’re making a big mistake…They somehow think that is a declaration of war on religion. And I don’t know where they get that idea. It’s not. It is specifically identifying the enemy.” – Greta Van Susteren  MORE: @webpagelink"},{"comment_id":"642371742620071","commenter_b":"Her fat ass needs to get a job and off the government tit. She is a disgrace to the white race.","commenter_a":"Th dems way of welfare hz put many ppl out of th mindset of personal responsiDAMNbility!!!?","post_message":"This woman claims she deserves more welfare than others.  This is unbelievable. Let's kick this woman off welfare immediately.  Should she be forced to pay us back?"},{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"}]
