[{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"10153961213080579","commenter_b":"Right wing ammosexual Xtians kill more people in this country than Muslims.","commenter_a":"obama Will NOT FIGHT HIS BROTHER MUSLIMS.. BUT He WILL Help them.","post_message":"\"France is at war.\" French President Francois Hollande to Joint Session of Parliament.  Watch complete video here: @webpagelink"},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10154008398892093","commenter_b":"an old woman did this on her apartment and end up with this, be careful guys","commenter_a":"Well my heater doesn't work right now guess I have to dress warm going to bed. Other than that I love this weather.","post_message":"How are you preparing for the first hard freeze of the season? bit.ly/2gAPzAa"},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."}]
