[{"comment_id":"10152865678521336","commenter_b":"Christ is the answer for the muslims !!","commenter_a":"All muslims are either radical or they support it ! they follow the qoran and that is what the qoran teaches !! their leader was a pedifile and mass murderer !","post_message":"\"I think we should cut out the political correctness. This is Islamic extremist terrorism. It is not the entire Muslim religion.\"  Former NYC Mayor Rudy Giuliani said President Obama appeared weak for describing Wednesday’s deadly terror attack in France as \"senseless violence of the few.\" @webpagelink"},{"comment_id":"1510863505601322","commenter_b":"Probably the shittest article to ever feature on ifl, absolute horse shit","commenter_a":"Read the article! It should say vitamin pills are not necessary, a balanced diet provides all you need","post_message":"Some vitamins can actually be dangerous - but these are the ones worth taking, according to the available evidence."},{"comment_id":"1120776417932667","commenter_b":"Whoop-te-do! What an earth-shattering piece of news that is! One loser endorses another loser... ho-hum.","commenter_a":"the end of Jeb","post_message":"Lindsey Graham endorses Jeb Bush for president"},{"comment_id":"382025331922062","commenter_b":"When pigs fly","commenter_a":"Yes","post_message":"Is this good or bad news for the GOP?"},{"comment_id":"10153642525234411","commenter_b":"Para estar en un paisaje tan encantador vale la pena.","commenter_a":"PROOF THAT RUSSIAN TROOPS ARE FIGHTING IN UKRAINE @webpagelink","post_message":""},{"comment_id":"10153035798681336","commenter_b":"Do you support PETA? They are know as animal killers! And it's part of their manifesto!","commenter_a":"I don't support circuses just for the reason that they are notorious for abusing animals.","post_message":"Ringling Bros. and Barnum & Bailey Circus will phase out the show's iconic elephants by 2018 because of growing public concern over how the animals are treated."},{"comment_id":"1810739472541280","commenter_b":"Recount!! Recount!! Go girl! Hillary for president!!","commenter_a":"Will she be filing in the states won by Her?","post_message":"BREAKING---- Green Party Candidate Jill Stein Files for Recount in Wisconsin.... Where Trump won by almost 30,000 votes! Wow!"}]
