[{"comment_id":"10156171659485354","commenter_b":"Get the f away from American . I brought my religion to this country !?? I keep mine in side , Don't wear that ugly scary thing over your face !!! That scares me wear it inside or with you groups . You weren't born with it you're gonna die for not wearing it !?? I don't I promised to accept and care for what was in America . I ve got to see with my eyes . It is deadly scary to me , can't be around them .","commenter_a":"It was a fake bomb the next one won't be if that was a white kid he would be jailed you can't even point your finger because it represents a gun and you get kick out of school. So what gives with this","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"979496535445797","commenter_b":"Good KICK ASS !","commenter_a":"Good for you","post_message":"BOOM! American's save the French yet again!"},{"comment_id":"1072164979509916","commenter_b":"If sash doesn't get picked","commenter_a":"I'm so done ffs @username","post_message":"The Bachelorette Australia favourite and Sam just happen to holiday in the same place at the same time   (via Daily Mail Australia)"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."}]
