[{"comment_id":"831862046868801","commenter_b":"You're talking about deregulation. A completely deregulated market would allow child labor and would have zero worker protections, environmental protections, etc. They'd still buy government because they don't really want a libertarian free market. They want a \"free\" market that's rigged in their favor; that's where the real money is. You can't really separate capitalism from corporations trying to exert influence over government. It's the nature of the beast. You have to find ways, instead, to make those attempts ineffectual. Starting a business always requires capital... that doesn't mean you have to be rich, per se. \"Big guys\" have economies of scale that make them hard to compete with even when the market is \"free\". It's not impossible to have a monopoly in a free market and it's not impossible (indeed, it's likely) that you'll have collusion and cartel-like behavior. I mean, the government could step in to put a ...","commenter_a":"Wealth inequality isn't a measure of economic health. Wealth inequality is merely a potential for trickle. It's nothing to be afraid of. It's something to embrace and tap into. Let's tap into that with a free market economy. What are we waiting for? @webpagelink","post_message":""},{"comment_id":"581929555264971","commenter_b":"They need to be sent back to their own country, period! !","commenter_a":"I am getting to the point I really do dislike the new media, they are a bunch of useless asses","post_message":"The city of Twin Falls first made headlines when Muslim migrants sexually assaulted a five-year-old. Now another sex crime, this time against a disabled girl, has rocked the community. You won't see this story in the mainstream media."},{"comment_id":"10158510929345206","commenter_b":"Then how do you explain her looking at the camera from a certain angle while wearing a head scarf? Only one woman can pull off that move.","commenter_a":"thats not even her.","post_message":""},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""},{"comment_id":"10153902979083812","commenter_b":"Then please answer the dreams of the other 49 states and build that wall around Texas and secede.","commenter_a":"Texas? Secede already will you?","post_message":"JUST IN: Texas Governor Greg Abbott joins the governors of Alabama and Michigan in saying his state will not accept any Syrian refugees in the wake of #ParisAttacks. @webpagelink"},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"10153108326524197","commenter_b":"So sad just terrible how ppl are raising bullies and don't see anything wrong with it just so saf","commenter_a":"oh dear god what's wrong with these kids disgusting","post_message":"This girl died as a result of bullying, according to her mother. She said the reason her daughter took her own life extended beyond the walls her classroom: @webpagelink"}]
