[{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"10153167392250090","commenter_b":"Take out the trash... She is trash...!!!","commenter_a":"She should not be a president of anything","post_message":"We've seen what happens when our president ignores the American people—we WON'T let it happen again.  It's time for the truth about Benghazi. Demand answers from Hillary Clinton: @webpagelink"},{"comment_id":"10154469965885579","commenter_b":"Why would that surprise you Mr. Brown, Mr. Trump becoming the next President of The United States is a blessing compared to it almost not being America at all thanks to all the corruption of this Government and the Politicians letting it be taken over my illegals that pretty much rule OUR COUNTRY, PRAY TO THEIR GOD ON THE SOIL FOUGHT MY THE MEN AND WOMEN OF OUR VETERANS AND ACTIVE SERVICEMEN , THAT WE OURSELVES AS AMERICAN CITIZENS ARE DENIED, BURN OUR COUNTRY'S FLAG AND I COULD GO ON AND ON, BUT LETS JUST SAY \"CHANGE IS COMING, THOSE GETTING A FREE RIDE WILL BE OVER, THE RICH GOVERNMENT WILL NO LONGER BE LIVING HIGH ON THE HUG, THE POLITICIANS WILL NO LONGER BE MAKING DIRTY DEALS AND ROBBING THE AMERICAN CITIZENS OF THE HARD EARN MONEY !! Yep he made it this far because he's one of US ...","commenter_a":"I'm seriously embarrassed that this man can make it so far in our country. He takes what class the GOP had and throws it to the wind.","post_message":"Donald J. Trump: \"Tonight we close one chapter in history and we begin another.\" Watch complete speech here: @webpagelink"},{"comment_id":"683007381889840","commenter_b":"Shut, your, cunt .","commenter_a":"She has no right to be called a first lady any more than her husband has a right to be called a president!!","post_message":"The White House is trying to cover this up as quick as possible. This comes as no surprise. She is the worst first lady ever. Are you disgusted by Michelle Obama?"},{"comment_id":"10153413861058352","commenter_b":"Keep raping her for the rest of her life like she did to her grands","commenter_a":"Sick piece of shit","post_message":"Woman sent to jail for the rest of her life after raping her four grandchildren is described as the ‘most evil person’ the judge has ever seen. #STILLTRENDING"},{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"10152918751311336","commenter_b":"Because there wasn't technically a government and laws like European style governments didn't give the European invaders the right to grab the land and kill the people that were already living here my ancestors didn't welcome yours","commenter_a":"If you are in a country without the required paperwork, you are an illegal. Check the dictionary please.","post_message":"\"We don't believe in capitulating to people who are going to tell us how to run our newspaper,\" said Scott Steepleton, city editor of the Santa Barbara News-Press on FOX & Friends Weekend."}]
