[{"comment_id":"10153735414097293","commenter_b":"is this part of the gay agenda against heterosexual women? Now they want to send men, dressed as women into women's bathrooms? @webpagelink is it not bad enough that radical lesbians have divided the sexes and have by some accounts taken over womens centers with the help of radical like hillary clinton","commenter_a":"Meanwhile he had no problem playing in middle eastern countries like Qatar where the law punishes homosexuality with prison or death. Stop pretending he did this because of principle.","post_message":"Another day, another prominent rock star canceling a show to protest a controversial new law in a Southern state."},{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"10153210557951336","commenter_b":"She said she \"did not want him to be a Freddy Gray\" meaning dead. And no Sharon P ... If people would stop voting for fools like the ones running our congress 80% of our countries problems would be gone... maybe more..","commenter_a":"What she did was what she needed to do at that moment in time. She is a real Mother..who loves her son and wants him to grow up to be a MAN!","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"1000192243373586","commenter_b":"The little bitch should serve time.","commenter_a":"It's not white privilege. It's called \"daddy is connected\". Still doesn't make it right","post_message":"This girl had so many drugs that her sentence should be more than 200 years -- read on to find out what she's going to actually get."},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"},{"comment_id":"865539350258452","commenter_b":"Just keep trucking along well have a good president in the office finally","commenter_a":"Vote Trump","post_message":"Thank you Connecticut! See you this evening!! Lets MAKE AMERICA GREAT AGAIN!!"}]
