[{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."},{"comment_id":"1184451798317737","commenter_b":"Foolish, foolish woman.","commenter_a":"SHE IS INSANE TO WANT DONALD TRUMP! I HOPE SHE KNOWS THAT SHE AND ALL THE REST WILL BE THROWN OUT ON THEIR HEADS!!! CAN NOT BELIEVE THIS!!!","post_message":"Saba Ahmed is trying to convince other Muslims to support Donald J. Trump."},{"comment_id":"1260826810599396","commenter_b":"Fuck her","commenter_a":"Carla A. Auguste Imani Rice Qiana Lewis Shequla Mason @username","post_message":"For everyone who hates Sallie Mae..."},{"comment_id":"1656487827976632","commenter_b":"\"a balanced choice between having a heart and having a brain.\" Really? Who wants to vote for a thyroid? ha.","commenter_a":"@username is a balanced choice between having a heart and having a brain. The two are not mutually exclusive. #JohnsonWeld2016 #Libertarian #FreedomEquality","post_message":"Sarah Silverman and Bill Maher spent a portion of Real Time with Bill Maher Friday wondering why 29 percent of millennials – many of them former Bernie Bros – have ticketed their vote to Libertarian candidate Gary Johnson instead of Hillary Clinton. \"Gary Johnson is a fucking idiot,\" Maher said."},{"comment_id":"979819422085921","commenter_b":"@username don't curse Canada with the likes of people like her. Send them to mexico!","commenter_a":"Just because a person is an actor/actress does not mean they know their head from their a$$ ... proof right there in that statement","post_message":"Americas Freedom Fighters"},{"comment_id":"859693680734640","commenter_b":"That's definitely not how that works. She would have to legally be a woman with identification as a woman.","commenter_a":"totally disgusting, so any guy can say they are pretty sure they are a woman stuck in a man's body and will be welcome in locker rooms and bathrooms, oh come on!","post_message":"\"I was stunned and shocked.\""},{"comment_id":"10153266860506167","commenter_b":"No, there is something very seriously wrong with the people who think he could run the country and vote for him","commenter_a":"There is something seriously wrong with Carson.","post_message":"A CNN host shuts down Ben Carson's complaints about the media: \"Journalists ask questions. That's the process. And if you don't like journalism, we should talk about that with presidential candidates.\""}]
