[{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"10153237283580329","commenter_b":"Kurt Russell","commenter_a":"Jared padalecki from supernaturals","post_message":"Keanu Reeves or Arnold Schwarzenegger?"},{"comment_id":"10153161345041336","commenter_b":"Good for the wife!!!","commenter_a":"Hooray!!!!! McDonald is hiring!","post_message":"Donald Sterling gave his mistress V. Stiviano a Ferrari, Bentley, and Range Rover and also covered the majority of her $1.8 million duplex.  But his wife, Shelly Sterling, just got it all back."},{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"\"For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.\"  In his \"Talking Points\" tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"1023792714394917","commenter_b":"We already lost it! We've gone backwards for the last 7 years and all that's happened is the Tory Party and it's mates busy enriching themselves from National and Taxpayer assets.","commenter_a":"I worked since I was 14 - paid my share and I say out ! All us pensioners have paid in - but David Cameron wants to open the borders to any one and give them all free hand outs and homes !!! It's not on !!!! We need to stand up for our selfs","post_message":"Britain faces a \"lost decade\" if we vote Leave, says David Cameron. He warned pensioners in particular \"don't risk it\". Is he right? Would leaving the EU really be bad for our pensions? Judge for yourself: @webpagelink"}]
