[{"comment_id":"10153195743346051","commenter_b":"Bitch need a ass whooping!!!!","commenter_a":"need to stick her head in a toilet a few times til she thinks she's drowning","post_message":"Decide for yourselves if this woman got off too easy."},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10152805684357377","commenter_b":"Bout time someone got a pair! Keep your ducks in a row bro. I'd like to see her in a 4x8 with obstructed view!","commenter_a":"They trying to stop Hillary at all cost.","post_message":"Klayman reveals the details on The Steve Malzberg Show. Watch Newsmax TV on DirecTV Ch. 349, DISH Ch. 223 and Verizon FiOS Ch. 115. Get Newsmax TV on your cable system."},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim.  Would you sue your neighbor over a disruptive pet?"},{"comment_id":"1302575163172066","commenter_b":"@username and why isn't Hillary in jail right now? Oh yeah, dirty politics.","commenter_a":"He's a fraud. Last night he said he would (be able to) release his tax returns if Hillary released the emails. So according to Trumb...HE CAN RELEASE HIS TAX RETURNS IF HE WANTS Period","post_message":"“If not paying taxes makes him 'smart,' what does that make all the rest of us?”  - Hillary Clinton"},{"comment_id":"906397572824353","commenter_b":"Wow!! She's got u brainwashed!","commenter_a":"Dear Mrs.Hilary, Sweetness in your speech , talent in your mind, Peace in your eyes, strength in your hands & I wish always victory in your life..Pl accept my heartiest congrats & do your best to bring peace & harmony to the whole world. I am from Sri Lanka & once again pl accept my best wishes for you madam...go ahead go ahead & do your best not only for America but to the whole world madam..May the blessings of the triple gem be always upon you..tc, Gd luck","post_message":"Hillary Clinton supporter screams \"Not your fault\" after candidate says she \"deeply\" regrets the \"angry tone\" of the campaign. @webpagelink"}]
