[{"comment_id":"1323090797735546","commenter_b":"Woman in prison","commenter_a":"Drain the swamp","post_message":"WATCH LIVE: Bernie Sanders speaks at rally here in Phoenix, Arizona at Central High School."},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""},{"comment_id":"1015366121832142","commenter_b":"Get em allll out of our country","commenter_a":"True!!!!!","post_message":"NO Sharia, NO Obama!"},{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."},{"comment_id":"1167985886552093","commenter_b":"Who cares she's a phony crook sanders all day","commenter_a":"I am voting for HRC!","post_message":""},{"comment_id":"1128964310481999","commenter_b":"Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.","commenter_a":"I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...","post_message":"In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a \"Second Bill of Rights\" of an economic nature. They were:  The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education.  Video by Occupy Democrats, LIKE our page for more!"}]
