[{"comment_id":"1684551998460631","commenter_b":"I am not an American, but I and we all are interested in your politics. Because we other part of the world are concern for peace and prosperity. And Why so much hate? Why so many wars? Do you think that is the solution? What is the meaning of diplomacy for you guys? Is it only war? Do you think that in this 21st generation you are again doing politics for religion ? And certain race? Is that how you want to see American politics ? How come you think Obama foreign policy is miss leading you guys? Do you got the proper answer? He talks about climate change, which is happening and strongly scientist also believe that, he try to bring your army back in your country from Iraq and afganishtan, he shown us that diplomacy and foreign policy is not only about to hate and make enemy. He ...","commenter_a":"Trump doesn't back down from our enemies Obama. You are nothing but a coward. Your nuclear and foreign policy has only weakened us, and made it easier for Iran and ISIS to kill us.","post_message":"Speaking at the close of the Nuclear Security Summit, President Obama said Donald J. Trump's nuclear comments show he \"doesn't know much about foreign policy or nuclear policy or the Korean peninsula or the world generally.\" @webpagelink"},{"comment_id":"10153256294124726","commenter_b":"Deport that illegal!","commenter_a":"Put them all on a boat back to Africa and sink it","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump  Find Florida early polling locations: @webpagelink"},{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says \"What the **** is that? I hate Americans. I hate America\" when a tray of doughnuts appears in front of her."},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"832106660178720","commenter_b":"We the people don't need regulations on the internet, stay out of out business!","commenter_a":"execute them","post_message":"YOU HAVE TO PASS IT TO FIND OUT WHAT IS IN IT!.. INTERNET REGULATIONS!  @webpagelink"}]
