[{"comment_id":"10152917753321051","commenter_b":"The bitch cussing in the background should not be near kids!","commenter_a":"Good for you two to look out for that child! She shouldn't be near any children! !!!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10154082239191545","commenter_b":"No, I hope she goes to CNN that's where she belongs!","commenter_a":"I love strong women. She's one to not let anyone run all over her. I like her more and more as time passes.","post_message":"Are you a Megyn Kelly fan?"},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"},{"comment_id":"908443172532257","commenter_b":"She should have NEVER been arrested to begin with !!!!! Anyone who would arrest an AMERICAN for carrying a firearm doesn't deserve to live in AMERICA !!!! PERIOD !!!!!","commenter_a":"Finally!!!","post_message":"Shaneen Allen, a Pennsylvania mother of two who didn’t know she was entering a “gotcha” zone when she drove across the New Jersey state line with a handgun in her purse, is clear of all charges following an 18-month legal ordeal in which a prosecutor had originally hoped to pursue harsh punishment as a caution to others. @webpagelink"},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"911723728894896","commenter_b":"Witnesses lying on the police..glad there was camera...+1 for the good guys 😀","commenter_a":"All \"community leaders/organizers\" who make snap judgments about how an officer handled a situation should be made to go through a re-enactment of what the officer went through while making their decision. Maybe by walking a mile in their shoes they will have an inkling of an iota.","post_message":"Here we go! Witnesses say a white officer shot him in cold blood, this newly released video tells different story"},{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"\"He's put on a paid administrative leave\"!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"}]
