[{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"\"This is what happens when you f*** with mother Syria all of your blood will be spilled.\""},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that \"The Matured Feminine Approach\" (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."},{"comment_id":"1140355262709675","commenter_b":"@username, I see you as the Liberal that you are, crying for this BS, but you'd be the first one to file a complaint AFTER you've been accosted by a perv in the women's bathroom.","commenter_a":"No, I'm not done shopping at Target. Do all these people really believe they'll be attacked? Get over yourselves.","post_message":"Target just announced that transgenders will be able to use any bathroom they want. I'm pretty sure they were not expecting what happened immediately after their announcement...  Are you done shopping at Target?"},{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, \"body fillers\" etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"\"I'm paying now for my vanity.\""},{"comment_id":"10156175589090354","commenter_b":"Arrogant hateful ole hens that arent worth the waste of time!!","commenter_a":"Liver Transplant Recipient of 4 1/2 years. The Doctors saved my life in surgery but the Nurses kept me alive and watched over me and I would not be here without them. Bless them all.","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins.   But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10154770011654330","commenter_b":"Janine Beekman","commenter_a":"Thanks Malloy u duetch bag get out of office u suck !","post_message":"The drug company, Bristol-Myers Squibb, is shutting down several of its facilities, including one in Wallingford. ----> @webpagelink"}]
