[{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"10153958872340695","commenter_b":"@username gotta love these white SLOW voter. I bet you probably one of the slos that was going to vote that dunmy Sarah Palin in who thought Africa was a country....thank God for uninformed black voters","commenter_a":"Go Obama!","post_message":"In a rare Oval Office address President Barack Obama sought to reassure Americans shaken by recent terror attacks."},{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"929346133862318","commenter_b":"If a bank (any bank or business) is going broke, such as Lehman Bros., how is it up to We the Tax payers to bail it out? A business either prospers of fails on its own merits, period! None should be \"too big to fail\"! Throwing trillions of dollars at a sinking ship is madness, it just prolongs the inevitable and hurts those that are being forced to pay for using their stolen tax paid monies, and harming the entirety of the economy, we are here to bail out the billionaires and globalist elites delusional scam they are perpetrating on man kind!","commenter_a":"What an asshole and she probably makes a 6 figure salary, time to clean house","post_message":"Not sure about you, but this REALLY pisses me off!   H/t: Emancipated Human Subscribe: @webpagelink  Join Us: The Free Thought Project"},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."}]
