[{"comment_id":"528240787342392","commenter_b":"she looks like a fat ape","commenter_a":"What a wonderful First Lady!!! Prayers for Candy & Ben Carson!!!","post_message":"Candy got to meet some great people this weekend in New Hampshire! #BC2DC16"},{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"\"Hero\" or \"heroine\" or are you undecided?","post_message":"This just made our week."},{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"10153956190753797","commenter_b":"She better go to juvenile....period.","commenter_a":"those other kids should be charged also for not stopping it and cheering it on! makes me sick!","post_message":"UPDATE:  Last week, a controversial video went viral that shows a 3-year-old child being dragged and beaten by two young girls. Over the weekend, officials identified the girl and brought her in to custody. The shocking details involving the attack, here:"},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted \"Can you hear me now?\" then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"10153243418332411","commenter_b":"That's one ugly sumbitch!","commenter_a":"will someone puuulease show this guy the Gates of Hell !","post_message":"North Korean dictator Kim Jong Un used his annual New Year's speech to warn that his country is ready for war."}]
