[{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"\"HELL NO \"","post_message":"Is Hillary Clinton America's best choice for president in 2016?"},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""},{"comment_id":"10153828669523984","commenter_b":"So tell me what religion does rule the world ! Plus most of you are SCARED because you have either been the bully or profited from the bullying of other countries ! Just admit that you don't know how get your power back ! It seems to me that 9/11 made our county a rape victim and you see the rapist in every Muslim ! But we've used the same tactics! Oh , you didn't mind sending missionaries over there to convert them , but we don't want them here, even the ones that became Christians ! We reap what we sowed and you still don't see it or get it ! You can't kill them off . We tried that already ! Change how we deal with them for starters. Or we can squat to their level and try again ! But if you yourself are not going to ...","commenter_a":"I think this is a good example of why not to allow sharia law in the United States. We have our own laws that need to be enforced. When you come here that's the laws you follow. Muslims don't rule the world. Time to set them straight","post_message":"These Muslims were going around burning churches, but they were in for a RUDE awakening when they showed up at this one...  Concerns about Sharia being implemented in the United States have been escalating, do you think we could see this spread to the U.S.?"},{"comment_id":"10153906125115736","commenter_b":"So should grabbing pussy.","commenter_a":"It's already beginning to sound like a dictatorship!","post_message":"Trump says burning the flag should be punishable by \"perhaps loss of citizenship or a year in jail.\""},{"comment_id":"10153956657931336","commenter_b":"Amen she needs to go to jail u r correct","commenter_a":"112 million raised and supposedly all from minorities and women. This woman is the single biggest threat to our country. She is actually worse than Obama and as we know that is as bad as it gets. The nazi queen needs to go to prison","post_message":"The Hillary Clinton campaign said that puts her total raised in 2015 to spend on the presidential primary campaign at $112 million."},{"comment_id":"660818097425993","commenter_b":"She needs to get Raped to change her opinion. stupid bitch.","commenter_a":"She is a disgusting, lying hag! If she can lie to children, she's a special kind of \"she-demon!\"","post_message":"This is just disgraceful."}]
