[{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"},{"comment_id":"10152744813956094","commenter_b":"What is your alternative, Scott?? Just curious.","commenter_a":"Liz Warren is pissed off. Anyone who •isn't• pissed off, isn't paying attention!","post_message":"Yves Smith shreds the the Obama administration's rebuttal to Elizabeth Warren's critiques of the secret trade panels proposed in the TPP and TTIP treaties."},{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":""},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"10155292793551509","commenter_b":"Look at all the zombies/paid trolls. #imwithher at the hospital HitLIARy will never be president.","commenter_a":"Hillary can't attend a simple ceremony without collapsing, can't lead a nation and not fit to be president! One more reason to vote Donald J. Trump 2016! Those who plant injustice will harvest disaster, and their reign of terror will come to an end. Proverbs 22:8. Hey liberals?? Look what has happened to your Hillary Clinton!! Karma is real!! And justice is being served!!","post_message":"Hillary Clinton's exit from Sunday's September 11 commemoration set off a flurry of questions and concerns about her health.  For the reporters who cover her, there was also frustration."},{"comment_id":"1061797757169218","commenter_b":"Save Western Civilization? You mean save white people.","commenter_a":"And where was our so called president ??????","post_message":"The prime minister of Israel, Benjamin Netanyahu, gave an historically important speech. A speech that any previous American president could have and maybe would have made, a speech to rally and save Western civilization."}]
