[{"comment_id":"10153573221561336","commenter_b":"Give a clipboard to a woman...And this is what you get. I live on land and not in a neighborhood for this reason. If I wanted to have one painted hot pink it would not matter :)","commenter_a":"That's why I would never buy a home in an subdivision with a HOA they try to control living !!!","post_message":"The homeowners association says the purple playground must be “subdued and within harmony with other colors of the community.”"},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"10153814688651337","commenter_b":"Fox might dump it if these rating keep up.","commenter_a":"Nah since fox has money.","post_message":"YIKES!   This big ratings drop should concern all Family Guy fans..."},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"1557919144505066","commenter_b":"Absolutely! The party comes first to Republicans.....the people and the country are not important until they can be used to the advantage of THE PARTY. Sad","commenter_a":"Honestly, I'm worried about 'merica if trump is such an overwhelming decision for them to make. Consider the members of the Republican party, they're going to vote trump because he's not a Democrat. That means, party alliance is more important to them then things like racism and ignorance. Give me a break.","post_message":"President Obama slow jammed the news and also talked about Donald J. Trump, Hillary Clinton and Bernie Sanders."},{"comment_id":"1132943900117478","commenter_b":"Knock that bitch down when he gets in your face. Trump 16","commenter_a":"What a bunch of disgusting, vile, ignorant, hypocritical, liberal scumbags!! Totally revolting behavior typical of the left with absolutely NONE of the \"tolerance\" they preach for anyone who disagrees with them!! Sickening!!","post_message":"Liberals try to portray themselves as the voice of \"tolerance.\" You'll realize just how \"tolerant\" they really are when you see this video, where they made a SICK move at a meeting that supported Donald J. Trump.  This is the REAL face of the left, folks... America needs to see this."},{"comment_id":"899421576802371","commenter_b":"Stupid BITCH !!!","commenter_a":"Why don't you release your vitriolic hatered towards the real enemies the Muslims, the Obama administration, Hillary Clinton, the democrats, black lives matter and other groups like that and anyone on the left that thinks like you. Unfortunately the rest of us don't have the money to buy protection so we have to protect ourselves. There is not enough police to protect everyone. I use to like you but I don't anymore.","post_message":"Actress Rose McGowan Unloads Hate-Filled Rant Over Muslim Murderers Syed Rezwan Farook and Tashfeen Malik. Her target: American gun owners and Republicans.    Sorry, Rose, but we poor, regular folks can't afford ARMED bodyguards and a million dollar house like you and your Rich Hollywood Liberal pals.  #elitist #1Percenter"}]
