[{"comment_id":"1819434894958282","commenter_b":"@username pa la princess 😂😂😂😂","commenter_a":"Melissa Kaplan","post_message":"That pose though "},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"@username some shit you'd do😂😂😂","post_message":""},{"comment_id":"1130900020321866","commenter_b":"@username, it's a meme, I'm not a cop. Ignorant women these days, geez.","commenter_a":"I don't see a problem. Carson is honest and leaves room for error. The ONLY perfect man was crucified. Trump/Carson. Make America Great Again","post_message":"Dr. Ben Carson just made an absolutely stunning statement about Donald J. Trump.  What Carson said has some asking if he's really on Trump's side at all.  NOBODY saw this coming..."},{"comment_id":"10156618428550354","commenter_b":"And why wouldn't he? His father and step father were Muslim...Is it beginning to make sense?","commenter_a":"They will have to air the whitehouse when they finally get because of the smell he will leave","post_message":"The worst terrorist attack in America since 9-11 and what does Obama do?"},{"comment_id":"10154420470022545","commenter_b":"Go kill some more Armenians you cockroach.","commenter_a":"Andrea Loren Bloom watch tomi get shut the fuck down lol","post_message":"This viral rant on #WomensMarch is riddled with fake outrage and hypocrisy where she complains about women complaining."},{"comment_id":"951876701600434","commenter_b":"Send her AND O'dummy to Gitmo!!!","commenter_a":"Hillary has character and integrity? How easy it is to forget all the criminal activity this woman has engaged in. She's nothing but a liar, cheat and disgrace to this country. She belongs somewhere alright it's called prison.","post_message":"BREAKING NEWS: AP projects Hillary Clinton as the winner of the Arizona Democratic Primary."},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."}]
