[{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"},{"comment_id":"10153731246222217","commenter_b":"VOTE FOR TRUMP!! Screw this hoe","commenter_a":"Isn't that what Trump is actively doing? At least Clinton only accidently put others in danger, where as trump is one bad day away from bringing back Lynching, well try to anyway.","post_message":"He added that she would make \"such a lousy president\"."},{"comment_id":"10153706538451680","commenter_b":"Shut the F' Up","commenter_a":"I think it's great that Ghoul-iani and Drumpf both have direct lines of communication open to Russian intelligence, even more so than the CIA or FBI! That will make it easier for them to set up quick and easy direct deposit accounts to collect their paychecks from Putin.","post_message":"By casting the hack as a \"national security issue,\" Giuliani said, Clinton's campaign and Democrats have \"proved ... she's a liar.\""},{"comment_id":"10153204698059712","commenter_b":"It looks like the New Anti Gun Laws are working for the Criminals. It's taking Guns out of the hands of the Law Abiding Citizen and putting them in the hands if the Criminals because Criminals Don't Follow the Law. Good Job Liberals for putting Maryland back at #1 for Murders.","commenter_a":"Violence in Baltimore, gee would neva had thunk that!!","post_message":"Baltimore has had 54 homicides in 2015 — 8 more than at this time last year. Nonfatal shootings are also up 40%."},{"comment_id":"1187297661307572","commenter_b":"@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."},{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"10153011056587169","commenter_b":"The go to feminist lie: blame it on \"Patriarchy\"","commenter_a":"I want all my kids to be powerful, my sons and my daughters","post_message":"How do you raise a powerful girl and what does that mean? PBS Parents experts share their thoughts:"}]
