[{"comment_id":"1043277849065296","commenter_b":"Stupid cow! Needs to get over herself","commenter_a":"What a cow!!!","post_message":"'His career won't suffer, but I've been told I'm ruined'"},{"comment_id":"1859752354244114","commenter_b":"She is very stupid...and very mixed up..crazed..","commenter_a":"FUCK-YOU,YOU LYING ESTABLISHMENT PIECE-OF-SHIT...THIS BOOTLICKING PUBLICATION ISNT EVEN WORTH WHIPING YOUR ASS WITH...NO RIGHT-MINDED UNDIVIDUAL/FREETHINKING PERSON CARES ABOUT THE PARTISAN-CORRUPT GARBAGE THAT YOU CREATE OUT OF FABRICATED LIES...SO,GO SHOVE YOUR HEAD RIGHT BACK UP #MADAMEINMATE666'S FATASS AND QUIT PRETENDING TO BE A JOURNALIST PUBLISHING NEWS...FUK-OFF.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space.  By Daily Kos user BoGardiner"},{"comment_id":"10153415623385329","commenter_b":"Lol","commenter_a":"None of these \"helpful tips\" helped me... not one tit.","post_message":"The nightmare ends today."},{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"10153790439861680","commenter_b":"This woman should shut up since she and her husband were just as corrupt as the current one!","commenter_a":"Mexico is a cesspool. There's nothing we need from them but they rely on everything from the USA. We've bailed them out so many times and the American Government is making taxpayers flip the bill for Mexico's $50 billion bailout. Build the wall, tax their imports and tax the $35 billion the illegals are sending through wire transfers a year. Punish companies leaving the USA and moving operations to Mexico and over seas!","post_message":"\"Mexicans have dignity and repudiate his hate speech,\" she writes."}]
