[{"comment_id":"789545591173673","commenter_b":"Some states are allowing people to vote through the DMV instead of going to the polls....most of these states are where the illegal immigrants are.....that is where it is not fair, because illegals can have a drivers license now in some of these states and will vote democrat illegally . That is why it is more important than ever to get out and vote if you want a republican to win.","commenter_a":"I hope the election isn't rigged. The government we have now doesn't want Trump to win. He,will find out too much truth and tell us like it is. No more secrets no more lies. Trump 2016!!!!","post_message":"Time Magazine has me on the cover this week. David Von Drehle has written one of the best stories I have ever had. He brilliantly tells it like it is -- the real deal! Read it!  @webpagelink"},{"comment_id":"841387199293221","commenter_b":"Lol bitch ass no life","commenter_a":"Who cares about a road named after we want justice for her and her killer or killers in jail for murder so sad hoping we get justice sad it takes this to game a road names after you praying for your family and friends rip Sandra justice 4 Sandra","post_message":"It is the same stretch of road on which she was arrested."},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10153968461605579","commenter_b":"Absurd! There are 50 muslim countries to accept muslim refugees!","commenter_a":"You know why I support the Syrian refugees coming to America? Because I'm not going to let the terrorists dictate my beliefs, ISIS doesn't scare me. What scares me is that we, Americans, are losing our sense of direction. I've thought about this refugee crisis for for quite some time now, if you don't believe me ask the Marines who I taught about the Syrian civil war in 2012. I've been aware of this conflict for quite awhile now, while the rest of the world turned a blind eye. Islamic extremists aren't going to scare me and they are not going to change my way of life or thinking. I am an American and I cower to nobody. When I see people fleeing danger I want to help, we as Americans want to help. If you turn away women and children fleeing death and destruction because of terrorist attacks then ...","post_message":"Should the U.S. accept Syrian refugees?  WATCH: U.S. House debate on #SyrianRefugees  LIVE on C-SPAN @webpagelink    WATCH: House Judiciary Committee SubCmte hearing on #SyrianRefugees,  LIVE on C-SPAN3 @webpagelink    Senate Homeland hearing on #ParisAttacks  LIVE at 2pm ET on C-SPAN3 @webpagelink"},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"},{"comment_id":"10153752322536523","commenter_b":"He sound dumb then a mfa","commenter_a":"#5 don't count on a police presence to deter being shot .","post_message":"Chief Flynn's four-point plan for not getting shot in Milwaukee is as follows, according to a statement from the Milwaukee Police Association:  1) Don't belong to a gang 2) Don't be a drug dealer 3) Don't carry an \"illegal\" gun 4) Assure you're not going up against someone that has a worse arrest record than yours"}]
