[{"comment_id":"10153187291468812","commenter_b":"Sex slaves, good job girls!","commenter_a":"What's wrong with people this world is going crazy","post_message":"NEW: Search on for 3 schoolgirls who have fled home to join ISIS: @webpagelink"},{"comment_id":"1067472230049155","commenter_b":"fuck your wall. period wall wont do shit. 2nd those thousands of lives were addicts, as if you care.","commenter_a":"I am not sure why a man who is responsible for the deaths of thousands through violence and drug overdoses is considered a cult hero by some people. However I think we should consider parole if he will pay for the wall!","post_message":"El Chapo not happy with the prison conditions. #ElChapo #WSHH"},{"comment_id":"1000913466673540","commenter_b":"Trounce her lying ass!","commenter_a":"Don't run like Romney....","post_message":"Take our new CLASH Poll. Should Donald J. Trump play nice or ... should he put The Hildebeest on ICE? @webpagelink"},{"comment_id":"10154095475454575","commenter_b":"Fry him.with low power so he feel the pain .","commenter_a":"Just fry him. No need for him to live another day","post_message":"The toddler and the 14-year-old have been diagnosed with HIV, genital herpes and chlamydia."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"1675805602436783","commenter_b":"Wicked prick!","commenter_a":"That is what happens when you try to work \"across the aisle\" with a group of people that have no desire to work with you.","post_message":""},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"}]
