[{"comment_id":"1269700346456350","commenter_b":"Too bad the women in 296047720780605s life are undeserving.","commenter_a":"I've tried to explain this to friends and family.... and that I have no problems with them being Republicans, it's their blind support of this horrible man that is problematic.","post_message":"Let's get this straight...  Thanks to CAFE."},{"comment_id":"804496683016845","commenter_b":"Fuck pigs","commenter_a":"Beyonce fine do your protest but don't be a hypocrite and be escorted to the stadium by law enforcement. Let the Black Panthers escort you. Don't half ass protest, walk the talk all the way and if you can't then STFU","post_message":"This RACIST liberal meme claims complaints about Beyonce's Superbowl are proof of white privilege and an aggression against blacks. But as usual the left gets it totally wrong and proves they know NOTHING about history.  We take this vile meme and destroy it with historical facts!"},{"comment_id":"1868656350045137","commenter_b":"Jealous lady...","commenter_a":"Whiney baby","post_message":"So great!"},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"}]
