[{"comment_id":"1245414865499369","commenter_b":"Bad argument ladies...gentleman... Whatever you started out as","commenter_a":"If it's not a mental illness then they don't need therapy, you can't have it both ways... But oh wait, that's what you people do anyway lmmfao","post_message":"The bill goes directly against most counseling associations' codes of ethics. (via The Huffington Post)"},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"10153061896611051","commenter_b":"She did nothing wrong. I applaud her.","commenter_a":"What IN the hell is this World coming too this kid don't have MONEY and she was nice too give her food too eat I thank her for her kindness and Love and a heart, caring!!!!!","post_message":"A hungry first grader who didn't have money for lunch started crying in front of this kitchen manager, so she gave her some food. Bad move."},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"10153046284854705","commenter_b":"I wish someone would put that pig back in the barn and close the door. I'm sick to death of her nasty face.","commenter_a":"Who would buy that! ?!","post_message":"Kim Kardashian just out-Kardashian-ed herself."},{"comment_id":"903394569805665","commenter_b":"Blow them out of the water.","commenter_a":"Ok ok this time only send them $20 million","post_message":"New Video: Four ships belonging to Iran's Islamic Revolutionary Guard Corps (IRGC) \"harassed\" an American destroyer in the Strait of Hormuz Tuesday, a U.S. Navy official confirmed to Fox News. @webpagelink"},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."}]
