[{"comment_id":"614194488771130","commenter_b":"Good for them and if was some other county's,or orig,before 1860 or maybe south it before civil main thing is who cares when was adopted by south or when ain't THERE flag now belong's to the SOUTH and USA.now.AND GO SOUTH go TELL THE IDIOT'S TO Get LOST UR FLYING IT FOR EVER OR ANYONE ELSE WANT'S TO FLY IT in THIS CNTRY'S 50 not 57 or 58 states u idiot abomination it's 50","commenter_a":"fantastic!!","post_message":"NASCAR fans at Daytona refused to hide their support of the Confederate flag.  This is true patriotism. They are proud to be Americans.  Do you support their refusal to back down?"},{"comment_id":"1584761528498475","commenter_b":"Women should have the right to decide, but whomever is willing to oblige her and perform the abortion should be arrested and thrown in prison for being willing to be an accomplice to a murder. If it were illegal for doctors to perform abortions then she can decide all she wants. Decide away!","commenter_a":"Nicholas Moore","post_message":"If you think Trump has bad ideas - Gov. Mike Pence has actually taken women's rights away. These two make up one of the most anti-woman tickets in history!"},{"comment_id":"10152908039036491","commenter_b":"Exactly mark. What about people who use PED's? Where is that integrity?! Why isn't their team also punished? Wes Welker violated those rules with Denver. But it got retroactively sustained due to rule changes. Are you kidding?!?!","commenter_a":"In the end his punishment had nothing to do with deflated footballs. It was for behavior detrimental to the integrity of the game and the league. Read the letter to Brady explaining his punishment. Accountability goes a long way, too bad tb, belicheck and Kraft don't know the first thing about it.","post_message":"More bad news for Tom Brady."},{"comment_id":"10156001828650725","commenter_b":"Every illegal alien is a criminal. Their crime rate is 100%.","commenter_a":"There's barely any crime from an immigrant but way more crime with other ppl just saying","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"842653202518126","commenter_b":"Let them go to hell","commenter_a":"Bunch of Stinky Asses","post_message":"In Obamaland... Islam rules. @webpagelink"},{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"}]
