[{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"},{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10153288097452629","commenter_b":"Hmmm. But I'm mixed so do I only get 5% off?","commenter_a":"Ariel help the world is blind","post_message":"If you love BBQ (and you're white), June 11th is your lucky day."},{"comment_id":"919439784782166","commenter_b":"She is a no brainier!","commenter_a":"Sarah Palin has a mental drought that no reservoir will cure.","post_message":"Sarah Palin is here, and she's got some wisdom for y'all."},{"comment_id":"1021163441238000","commenter_b":"The next deaf girl I encounter will hear me cumming","commenter_a":"Lucy Truelove","post_message":""},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"}]
