[{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"},{"comment_id":"10154012875581523","commenter_b":"Dawn did you see this mother fucker?","commenter_a":"Such a thug","post_message":"Was an Alabama man pushed to apologize because of public outrage over a social media post?  It sure seems that way."},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"458794547627679","commenter_b":"Hillary is not worthy of being president. Why would a progressive vote for her?","commenter_a":"These Sanders supporters that would rather see a Trump presidency were never Bernie supporters, they were Hillary haters. Any progressive ideas or policies would be set back decades with a Trump presidency. Not to mention how far back we would be set back with a conservative tilted SCOTUS. It is a sad day for this country. Donald Trump is going to be the next president. God help us all.","post_message":"Trump is in the lead? This is terrifying."},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""},{"comment_id":"399694993488875","commenter_b":"You dumb fuck the president has nothing to do with gas prices.","commenter_a":"Ain't nobody complaining bout them gas prices though","post_message":"Ironically, Manning was imprisoned and nominated for the same act."},{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"}]
