[{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"10153250256602439","commenter_b":"All female firing squad","commenter_a":"His last meal should be bacon. Pour pig's blood all over his body before firing squad. Don't forget to soak those bullets in pig's blood.","post_message":"Death penalty is too good for this savage. Boston (CNN)[Breaking news update, posted at 2:32 p.m. ET] Jurors in the Boston Marathon bombing trial have found Dzhokhar Tsarnaev guilty of all 17 counts that carry a possible penalty of death. The jury …"},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"10155002538802178","commenter_b":"Please NO MORE ! Can't stand that woman, Muted ever time I seen her appear","commenter_a":"Well hopefully I will never have to see that white haired women doing Holdings commercials ever again now that it is over. During the evening news that same commercial ran 4 times an hour.","post_message":"BREAKING NEWS: Three-term 2nd District Congresswoman Renee Ellmers has lost the Republican primary to fellow Congressman George Holding, who ran in her district after a court-ordered revamp of North Carolina's congressional map moved his 13th Congressional District out of the Triangle, according to The Associated Press. Follow the latest developments at @webpagelink"},{"comment_id":"10153591914773132","commenter_b":"Ha","commenter_a":"Well I don't think prada makes sandals his size","post_message":"Looking good, Caitlyn Jenner!"},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an \"explosion\" over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."}]
