[{"comment_id":"10155151407594575","commenter_b":"Illegals have to hide behind walls to avoid deportation. They build their own walls. Saw absolutely no effects from a day without immigrants, Guess they don't really matter.","commenter_a":"Awesome.","post_message":"Business owners are standing behind their decision to fire workers who participated in \"A Day Without Immigrants\" protests.  They say it's not a political stance but rather a business decision.  \"If you're going to stand up for what you believe in you have to be willing to pay the price.\""},{"comment_id":"10153826016756680","commenter_b":"Trump's no. 1 fan has a warning for us. David Duke Warns If Hillary Is Elected Black Men Will Rise Up, Kidnap White Women From Walmart And Rape Them ! The Republicans little secret that Trump exposed. 40 percent of them are racist and were dormant waiting for an opportunity like Trump. Vote blue from the top of the ticket to the bottom","commenter_a":"Thank you Hillary. As a gay man I understood it took you a while to get where you are, but I applaud you for your commitment to stand up for LGBT rights. #ImWithHer","post_message":"The NCAA announced it will relocate all of its championship events from North Carolina scheduled for the current year."},{"comment_id":"10153370562061336","commenter_b":"Drugs are illegal. I bet you could buy all the drugs imaginable in an hour. Guns would be the same if outlawed","commenter_a":"He is such a big fat piece of trash !! He always point out stuff that is the most stupidest crap Iv ever seen !! That boy could have made a bomb or took a knife or a bat in there and killed people also ! So should we take away knifes and bats ! People around this guy didn't know he was crazy ? I feel like people are trying to set it up where they take away all guns then they could do what ever they want to to us ! Guns don't t kill people crazy people do and if it wasn't a gun itd been some thing else he'd killed people with ! I hate that this happened I'd never want any one to get hurt or killed we all need to be as one !! We are all Americans first !!!","post_message":"“We do know that once again innocent people were killed, in part, because someone who wanted to inflict harm had no trouble getting their hands on a gun.”  President Barack Obama spoke moments ago on the #CharlestonShooting: @webpagelink"},{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"1104176122983583","commenter_b":"Fire her sorry Ass!","commenter_a":"traitor, as a senator you have more of a way of fighting for what you believe in than 99.9% of us ....Do what you were elected to do and stand up for flag and country, or get the h out of the goverment","post_message":"What?! Man!!!"},{"comment_id":"10153666561423984","commenter_b":"She doesn't know her ass from a hole in the ground.Correction,she know what her ass is huge.","commenter_a":"Kardashian doesn't have the brain capacity to make those decisions and you better believe Kanye has security we don't have. Go live in the hood, kimmie, and then you can tell us how to protect ourselves.","post_message":"BOOM! Kim K thought she'd talk about gun control laws, and it immediately blew up in her face.   Do you support gun rights in America?"},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."}]
