[{"comment_id":"10153084028785667","commenter_b":"Uhh bc illegals.. This makes it easy for anyone","commenter_a":"Why would people not use their drivers license? Using library cards and Costco cards? Packing your driver's license? Seriously? Stupidity at its finest. Some people should just stay home.","post_message":"A credit card, prescription, student ID or even a Costco card could be enough to convince the TSA you are who you say you are."},{"comment_id":"10152926851271336","commenter_b":"My God leave the Good Doctor alone. Don't see you going after those that treat patients in their mammogram buses and doing blood and plasma draws that happen to be far more dangerous. Give the guy a break. He is licensed to practice in that state, the entire state. Can you blame the Dr. after what Obamacare has done to folks. Jesus Lord...go after POTUS for putting people in this position in the first place, without healthcare, sucking what was left of Medicare that the elderly needed and driving up healthcare coverage so govt gets a buck.","commenter_a":"Need more like him and fewer like Obama.","post_message":"Mississippi health officials are threatening to revoke the medical license of an 88-year-old doctor because he treats patients out of his Toyota Camry. Dr. Carrol Landrum says his patients are too poor to travel to him, so he goes them."},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"},{"comment_id":"513861468804433","commenter_b":"Go home u witch","commenter_a":"Moron Muslims are every where lock and load it's time to to what our own goverment won't","post_message":"Muslim woman makes outlandish accusations about Americans on TV.  What a joke. This is the kind of ignorance that starts wars.  Do you agree this woman needs to be silenced?"},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"}]
