[{"comment_id":"10158490372020354","commenter_b":"Hope they make an example out of her","commenter_a":"Jail her.","post_message":"My, my, my..."},{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"10154456762501509","commenter_b":"Why not?!?!.Woman need to protect them selves.At least they got to train some combat skills hehehe...","commenter_a":"Feminism did not make a stride forward in the fight for women's rights. All they did was to send your daughters and granddaughters to potential war. They themselves didn't get anything out of it. They will never see war most likely. I hope they're proud of themselves.","post_message":"Do you agree?"},{"comment_id":"10155880167920354","commenter_b":"Uh you don't feel safe here? GO BACK!","commenter_a":"And salon will say that the US military threatened this poor muslim and made him feel unsafe.","post_message":"The Huffington Post Says It's a \"Mystery\" Why Kuwaiti-Born Practicing Muslim Mohammad Youssef Abdulazeez Murdered 4 U.S. Marines During Ramadan."},{"comment_id":"844804189043491","commenter_b":"Bye bye bitch","commenter_a":"never did like the ugly bitch","post_message":"Liberal trash has no place on tv. This is the best news all year. Do you think Whoopi deserves to be kicked off the air?"},{"comment_id":"10152995083802869","commenter_b":"Isn't there something about judging a tree by the fruit it bears. This sir, is what you stand for and represent.","commenter_a":"I can't believe he found a woman stupid enough to marry and procreate with him.","post_message":"Janet and I want to affirm our support for the Duggar family.  Josh’s actions when he was an underage teen are as he described them himself, 'inexcusable,' but that doesn’t mean 'unforgivable.'  He and his family dealt with it and were honest and open about it with the victims and the authorities.  No purpose whatsoever is served by those who are now trying to discredit Josh or his family by sensationalizing the story.  Good people make mistakes and do regrettable and even disgusting things.  The reason that the law protects disclosure of many actions on the part of a minor is that the society has traditionally understood something that today’s blood-thirsty media does not understand—that being a minor means that one's judgement is not mature.  No one needs to defend Josh’s actions as a teenager, but the fact that he confessed his sins to those he harmed, sought help, and has gone forward to live a responsible and circumspect life as an adult is testament to his family’s authenticity and humility.  Those who have enjoyed revealing this long ago sins in order to discredit the Duggar family have actually revealed their own insensitive bloodthirst, for there was no consideration of the fact that the victims wanted this to be left in the past and ultimately a judge had the information on file destroyed—not to protect Josh, but the innocent victims.  Janet and I love Jim Bob and Michelle and their entire family.  They are no more perfect a family than any family, but their Christian witness is not marred in our eyes because following Christ is not a declaration of our perfection, but of HIS perfection.  It is precisely because we are all sinners that we need His grace and His forgiveness.  We have been blessed to receive God’s love and we would do no less than to extend our love and support for our friends.  In fact, it is such times as this, when real friends show up and stand up.  Today, Janet and I want to show up and stand up for our friends.  Let others run from them.  We will run to them with our support."}]
