[{"comment_id":"10155761644675725","commenter_b":"The employee should of knocked that bitches teeth out","commenter_a":"Kristin Nugent Grigsby","post_message":"A woman has been arrested after allegedly biting a Macy’s employee over a Michael Kors handbag ---> @webpagelink"},{"comment_id":"10153263146396833","commenter_b":"She dont need a gun anyway, Shes got a face that would stop a train !","commenter_a":"Start living in the real world, hoodlums are not giving up their guns. Wake up and smell the roses gabby","post_message":"On March 4, gun control proponent Gabby Giffords joined Democrat lawmakers on Capitol Hill to push for expanded background checks on all gun sales.  Anti-gun Representative Mike Thompson (D-CA), who supports banning commonly owned semi-automatic firearms owned by millions of American, is spearheading the push."},{"comment_id":"10153315040146336","commenter_b":"If the engine can take the stress of lifting a couple of hundred ton into the air at 700 mph I think it's ok after this girl sat on it......just me but then again I'm not STUPID either.........","commenter_a":"Absolutely not!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""},{"comment_id":"10153964489889024","commenter_b":"FRICKING POS","commenter_a":"This is more truth than what comes out of his mouth","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"10152891097411491","commenter_b":"and because China is seizing Australian colonial territories in Antarctica which is morally wrong","commenter_a":"Asia is Asia, for the ASIANS. Why do we have to stick our noses in EVERYWHERE???? No wonder the U.S. is hated by so many countries.","post_message":"A historic debate over trade is now heating up in Washington."}]
