[{"comment_id":"880219112013511","commenter_b":"Try her for what. This is America. Take your laws and get the hell out of America.","commenter_a":"And the Democrats agree... I am sure..","post_message":"Not in America!"},{"comment_id":"1429758383703081","commenter_b":"Drain the swamp!","commenter_a":"If this is true the whole bunch including the Obamas need to be in prison. All the laws from the last 8 years need to be scaled back, especially the executive orders. So ridiculous that a birth certificate isn't presented before even running for president. So sick!","post_message":"You already know that Barack Obama's \"birth certificate image\" has been demonstrated to be fake. But now, the trail into the deception goes deeper, as the investigator handling the case has concluded that government officials were involved in the fraud that transformed America ..."},{"comment_id":"10154945345047439","commenter_b":"How about America waking up? You have elected a Muslim President and Muslim administration twice, and sat back idly whilst a Muslim has destroyed America and flooded it with millions of Muslims and illegals. Unbelievably, after 9/11 with almost three thousand victims, America elected a Muslim, built a further 1000 mosques and sent $770 million of US tax payers money, to restore mosques overseas. Since 9/11, you have suffered a further 51 Islamic related/honour killing attacks, with another long list of victims. Millions of illegals have simply walked into America and massively include, rapists, drug users, hardened criminals and sex traffickers. Despite thousands upon thousands of unscreened Syrians entering America each month, millions of white Americans are voting a 550% increase in unscreened Muslims, amnesty to over 11 million illegals and 650 miles of open borders. Trump is telling the world that American's are an absolute embarrassment, on how they ...","commenter_a":"Europe needed to wakeup 10 years ago, at this rate they are FINISHED, I hate to say it but this is what You get when You let Females rule countries... I know that sounds sexist, but there are not many M. Thatchers out there!","post_message":""},{"comment_id":"1028264733936445","commenter_b":"It's it funny how liberals say they can get guns from other place but amazing thing is that these people can't make it down to get a ID to vote. Guns we can get cross states lines a ID nope can't do it.","commenter_a":"Cant be. They have banned guns in Chicago. Every one of those murders had guns? Doubt it, cuz guns are Illegal. Hey murderers, stop breaking gun laws and start stabbing people the legal way! #Sarcasm","post_message":"2,326 people were shot in Chicago in 2015."},{"comment_id":"569672173222127","commenter_b":"Why does this women even receive a paycheck? I'd rather they give that money to a homeless woman in front of a 7-Eleven. You'd probably even get smarter conversation.","commenter_a":"Wasting your breath talking to these Trump members on his staff. They're like the movie The Stepford Wives! I think they all got their brains reprogrammed to say exactly what Trump wants & needs them to say to keep him looking sane!! It's scary!!","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it.   Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10153949454199087","commenter_b":"This idiot is a democrat? I bet no one saw THAT coming...","commenter_a":"Send this loser to another planet.","post_message":"Democratic congressman Hank Johnson on Monday compared Israeli settlers to termites while discussing Israel-Palestine relations."},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."}]
