[{"comment_id":"10153258826178812","commenter_b":"women are such babies","commenter_a":"Is it necessary to show this photo? This was someone's child, a little more respect would be great. Rest in Heaven, thank you for your service","post_message":"Navy officials: Navy SEAL killed in parachute accident in California: @webpagelink"},{"comment_id":"1026655844022093","commenter_b":"so, we didn't have Zero cases of measles in the US in 2000 then?","commenter_a":"Wake up. Measles has NEVER been ERADICATED!","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10153332084960736","commenter_b":"@username You seem to be missing the point. Those appear to be all Cows (baby factories if you would). Kill off all of those and there is no way to reproduce any more. Who ever told you the Elk were overpopulated? Did you read it in a newspaper somewhere? Or have a Fish Cop mention it? Or perhaps just another Liberal with a big mouth and an empty head.","commenter_a":"More like training the young wolves to kill. The meat is then left uneaten and wasted. That's a very good reason to get rid of the wolves before the Elk are extinct.","post_message":"Wildlife officials describe a 'surplus kill' as when animals kill more prey than they can eat, leaving the surplus."},{"comment_id":"10153199034456051","commenter_b":"To whom are you directing the \"Lazy whore\" term, Chieng Yang? Just wondering. ..I think that kind of name calling is unnecessary and unproductive.","commenter_a":"Hey lopsided breast implants are her punishment...","post_message":"This woman says she really doesn't care if anyone is offended by her photos - they're staying up."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"},{"comment_id":"10153904904228812","commenter_b":"Yes Danold deport all the white supremacist, terrorising the USA. Too.","commenter_a":"this is not even our country lol. Native Americans were here first. If Trump says he will deport all immigrants, he should deport himself first.","post_message":"\"Anybody that's brought into this country from the migration is going to be out,” Trump said at a rally in Knoxville, Tenn., Monday night. “We’re not gonna do it. We’re gonna have a country again, we’re gonna have borders, we’re gonna have a country again, right now we don't have a country.\""}]
