[{"comment_id":"10153729892456509","commenter_b":"I'm certainly not by any mean defending China's actions but it's quite hypocritical to criticize them while America commits terrible animal crimes too. That chicken, beef, bacon, etc. are almost from animals living in poor conditions and slaughtered. It's just favoritism to defend one animal and not another. To condemn one country and not another. Like Ramapriyan says, stop trying to be the world police.","commenter_a":"Just returned from Singapore and Hong Kong. Both very awesome cities.","post_message":"Plan on visiting any of these cities this year? @webpagelink"},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the \"American Taliban.\" Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"10156577107260725","commenter_b":"Rand Paul is already crying he is your typical corrupt out of touch Washington politician. He wants to rid us of the US military. So that jerk will be at the debate.","commenter_a":"I can make a difference between Winning & Losing & i really want Donald Trump to Win. I have lots of valuable inputs to give. How do i get in touch with you. Warm Regards, @username...","post_message":""},{"comment_id":"10153851537376162","commenter_b":"They are bad dogs they should exterminate that race!!!","commenter_a":"Let me guess it was a pit bull??","post_message":"PET ATTACK: A 34-year-old woman with physical disabilities is in critical condition after she was brutally attacked by her family pet on Chicago's Southwest side."},{"comment_id":"415728535218854","commenter_b":"David, you're the world's largest pussy","commenter_a":"the FACT that America is the worlds largest and foremost terrorist breaks my heart because most of the people in this country are better than that but our government sucks shit and has brainwashed them.","post_message":""},{"comment_id":"872563469430677","commenter_b":"2 delightful trolls. Get a life, ladies.","commenter_a":"militant? Lets be honest: muzlim terrorists/murderers","post_message":"A policewoman was killed in a shootout in southern Paris, triggering searches in the area as the manhunt widened for two brothers suspected of killing 12 people at a satirical newspaper. Read more: @webpagelink"},{"comment_id":"395997370588557","commenter_b":"all these weman want is his money and 15 minutes of fame ,,,REALLY","commenter_a":"Had to tell her name because not getting any attention.","post_message":"Do you believe Jane Doe #2, Jennifer Thompson, considering she said she took the $700 Bill Cosby reportedly gave her after this act???"}]
