[{"comment_id":"10153163783266135","commenter_b":"When the death penalty came up, the idea was to deter people from killing. This is why I wrote, death penalty for killers. Killers should know that gas chamber is their end. But when the law starts making up excuses for their actions, every law goes out the window. Illegals guns hit the streets because its about money. When someone chooses to be stupid, is not about money, the culprit list will be long, and everybody should be hold accountable. So, should we shot everybody and ask later? There are some people who are paying the consequences for not thinking ahead, trying to uphold the laws in their hands, like some kind of hero. What exactly is a THUG? and what exactly is a GOOD person?","commenter_a":"Screw the 2nd ammendment, this clowns can not handle this right. Killer, death penalty right away!!!","post_message":"#BREAKING One person killed in shooting at Taylor Sportsplex, according to Taylor Police Chief."},{"comment_id":"10154298251075098","commenter_b":"There's a reason why they're called filthy rich.","commenter_a":"This is so typical of corporate America. The C Level staff walk away with millions and everyone else has to suck it up.","post_message":"What a shock. Despite Trump's assertions that he was going to stand up for working people it turns out that Wall Street and Goldman Sachs are still running the show - and the Trump administration. Among many other billionaires in the Trump administration is Gary D. Cohn, the departing president of Goldman Sachs and Trump's new director of the National Economic Council. Upon leaving Goldman Sachs, Cohn just received an exit package of $285 million. Yes, $285 million.  And that's how the rigged economy and oligarchy works. The middle class of this country bailed out Goldman Sachs to the tune of over $800 billion. Goldman Sachs paid a $5 billion fine to the U.S. Treasury for illegal activity, as did virtually every other major bank. Meanwhile, no top Wall Street executive is prosecuted for criminal activity. Instead, the president of Goldman Sachs becomes the leading financial adviser to the President. And, to add insult to injury, Cohn and the Trump administration will soon end up supporting huge tax breaks for the rich while cutting Social Security, Medicare and Medicaid. Can we stop them? Yes. But only through a powerful and focused grassroots movement which tells Congress to represent us all, not just the 1 percent."},{"comment_id":"1532037343754150","commenter_b":"Forcing an innocent girl to say sorry to China due to afraid of losing a large profit. Good job Communist China and JYPE!! And if Taiwan and Communist China are the same state. Why Taiwan has her own flag, currency, army and diplomacy? And why does her people have the universal suffrage to vote to elect her own president? Why those chinese doesn't have the right to elect their leader directly? A \"small\" state like Taiwan has so many political parties. And A Big China just rule by Communist Party. How good to see democracy and dictatorship really works in! From those I have mentioned and others have talked with. It shows that Taiwan is an independent State. Try show some respect Chinese. Or even China wants to unit Taiwan. They should have guts to take action to invade Taiwan but not by talking those nonsense. And we shall see ...","commenter_a":"Chinese netizens says Lies Obviously is Chinese netizens because she Holding a Taiwan flag Began to attack She","post_message":"Her name is Chou Tzuyu and she is now the focus of attention."},{"comment_id":"10150798110624999","commenter_b":"@username, the Constitution says nothing about corporations having the same rights as The People, either.","commenter_a":"The constitution says nothing about abortion","post_message":"Oklahoma lawmakers have voted to ban virtually all abortions. That's flatly unconstitutional, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10154055005061167","commenter_b":"Oh God! !!! really this happened! What a nasty Woman!","commenter_a":"Artistry, get a clue humans.","post_message":"Beyoncé and JAY Z appeared with Hillary Clinton -- and Fox News completely lost it."},{"comment_id":"1590050817948698","commenter_b":"Hey, Justine. Did you know that the Quran teaches Muslims to kill you and I? If you think that's religious freedom that Christians should be tolerant of when they come to kill you I'll be happy to tolerate it, but when it's my turn I'll handle it the old American way.","commenter_a":"No America was founded on Christian values","post_message":"Barack Obama continues to show his Muslim roots..."},{"comment_id":"435422649916109","commenter_b":"Look at her scarf. Clearly a terrorist","commenter_a":"Who do you trust these days? Don't call a cop on a cop.FOP same as KKK. FATURNTY ORDER OF POLICE.I see FUCK OTHER PEOPLE.","post_message":"BREAKING: Cop Says He Doesn't Need a Warrant, Forces Way Into Woman's Home  Video posted by Facebook user New York, NY resident Diane Malikah Moomin Pinkston with this caption (Follow The Anti-Media for further updates on this story)  \"Just happened about an hour ago April 9, 2015 2pm they didn't give me their names or badge numbers . They ran like cowards wanting people to do their ob for them and they get paid. they all left without giving me their info. this is what the system allows them to do. And I'm holding the whole system responsible. they keep screwing up n need to pay to make sure this never happens again.\"  Update: the victim of this warrantless search has posted another video responding to this incident: @webpagelink  via The Rundown Live  Full story: @webpagelink"}]
