[{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"1130198083720905","commenter_b":"Thank you! This woman is a fraud! #imwithher","commenter_a":"\"but while I enjoy my privilege to be shielded from most of the republicans' bullshit ideas, I'll hang around because I want to feel important\"","post_message":"\"I feel most horrible about a voting system that says: Here are two deadly choices, now pick your weapon of self-destruction,\" says Green Party candidate Jill Stein."},{"comment_id":"337708566573297","commenter_b":"Trimp for president......HOW SCARY IS THST IDEA !!","commenter_a":"Vi a una persona que se preparo para el debate asi como se ha preparado para ser presidenta del pais. Por otro lado vi a un empresario que oculta sus deudas, que ha hecho su fortuna estafando a mucha gente.","post_message":"Donald J. Trump says he did President Obama a favor by being racist."},{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"1002708926488828","commenter_b":"Syrian refugees will be coming in legally. They will be documented and traced. If they wanted to sneak terrorists in the country they could do it through our southern border without much problem. AND they probably have. I would prefer that we only accept families and no single men.","commenter_a":"This breaks my heart","post_message":"If we don't know our history, we're doomed to repeat it.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"947076032050956","commenter_b":"I agree @username. Just like the woman said about the women that doesn't help other women. Hillary thought that was cute.","commenter_a":"We need to come together against the Republican Establishment to deny Trump and Cruz of the nomination. Their strategy is despicable but simple, keep either candidate from garnering enough delegates and have a contested convention where they will steal the nomination from both men. We Trump and Cruz supporters are wanting an outsider to try to fix the corruption in the political parties and our government. We need to come together to deny the Establishment their strategy. In the meantime, have faith in both of our candidates....Trump and Cruz are both very smart men and understand exactly what the Establishmen plan is. I have hopes that within two to three weeks they will work out an agreement among themselves to make a clear pathway to victory for one of them...to help them do this we need to come together as conservatives who are sick and tired of the corruption and ...","post_message":"Shannon Bream here live from Detroit on the Fox News Facebook page! Hit 'subscribe' in the top right corner to make sure you catch all of our live videos. We'll talk to the moderators during tonight's #GOPDebate and you won't want to miss that!"}]
