[{"comment_id":"10153556310231336","commenter_b":"dumb racist pos","commenter_a":"Dumb niggas","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech.  #MicBrights"},{"comment_id":"10153329238969228","commenter_b":"So what Johnny they were here before you were... immigrants.","commenter_a":"A permanent plaque in the public sidewalk for a kid who tried to kill a police officer in broad daylight?! May as well let all the murderers, rapists, and sexual predators go free and give them all a museum!","post_message":"Mike Brown's dad works to remove the memorial in the middle of Canfield Drive in Ferguson.  This would have been his son's 19th birthday.    A permanent plaque will be placed in the sidewalk after a Ferguson paving project.  The objects will be temporarily stored by Urban League"},{"comment_id":"10153536976196336","commenter_b":"Talk to Moon beam aka governor Brown of California. It is in San Francisco that an illegal alien killed a beautiful person. He encourages sanctuary cities for illegal immigrants and lets them get drivers licenses and so with liberals it's take from the people who work and pay taxes and let them pay for all the illegals. I don't want to give my hard earned money to whatever the state chooses to spend it on but liberals will continue until they are ousted. And that goes for Republicans as well. No one in either party deserves to hold office if \"our\" welfare doesn't come first. And I don't mean welfare as in free stuff.","commenter_a":"what...how can any illegal alien hold a government position? Oh yeah...California the land of goofballs.","post_message":"\"This is worse than sanctuary cities. Now we're giving them sanctuary boards.\" – Neil Cavuto"},{"comment_id":"1673051799421609","commenter_b":"WOW SHE'S AS DELUSIONAL AS HER WACO HUSBAND!","commenter_a":"she is nasty","post_message":"While speaking to a crowd recently, Michelle Obama suggested men viewed her as a sex symbol. She didn't anticipate the response. The video speaks for itself."},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an \"explosion\" over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"1027529210615833","commenter_b":"PLEASE DON'T Watt just leave already ! AND DON'T COME BACK !","commenter_a":"I hope the hell so!","post_message":"Bye Rosie!"}]
