[{"comment_id":"10153189347462550","commenter_b":"Filthy pig","commenter_a":"You almost wanna teach you child at home what's going on these days","post_message":"#BreakingNews - Former Cumberland County school principal David Edwards pleads guilty to sex offenses with students.  More here shortly ---> @webpagelink"},{"comment_id":"479436158913631","commenter_b":"She is a POS that has never done anything but take all she can get. She's an entitlement ho that plays the race card to get her way.","commenter_a":"VETERANS I'VE GOT NO RESPECT FOR THIS WOMAN WHAT SO EVER.","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"10152999953419205","commenter_b":"....They are racist too is hardly an argument. Plus copy and paste from KKK websites ain't the best source. Still laughing","commenter_a":"You mean whitewashed like how the democrat party did about their racist history? The party you blindly support like Pavlov dogs?","post_message":"Texas textbook publishers caught whitewashing American history"},{"comment_id":"10157098525125354","commenter_b":"OR...build a wall to protect OUR country. Go back to Kenya - YOUR HOMELAND!","commenter_a":"Fuck him!","post_message":""},{"comment_id":"10154993367323245","commenter_b":"legal immigrants OK ILLEGAL immigrants NOT OK any Qs","commenter_a":"Not an easy job.....People need to stop attacking every thing he says and does.","post_message":"LIVE: Trump press conference"},{"comment_id":"10154136814559411","commenter_b":"@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"},{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"}]
