[{"comment_id":"1160460537342680","commenter_b":"@username God is with us; not the one @username's people created, but the One who created the rest of us.","commenter_a":"You could make this same argument against every single other country in the world as there is no country that didn't have slavery and there is no race on earth that was not enslaved at some point, I was never a slave nor did my ancestors own any slaves so my question is why in the hell would I owe any reparations? Please explain?","post_message":"U.N. experts believe that the U.S. owes a significant amount of reparations to African-Americans.   With ongoing police shootings, unsolved legacy of slavery and so much more do you believe the U.S. will pay reparations? DETAILS ——> @webpagelink"},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":""},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"1615282505444662","commenter_b":"@username, I get that. I don't think that that's any more serious than foreign interests pouring money into a specific candidates election fund or even the main stream running a biased smear campaign to try and get \"their candidate\" elected. It all needs to be stopped.","commenter_a":"So the Russians hacked the Dems servers and released their emails. So what. What does that have to do with Trump? The main stream media was trying its hardest to influence the election for Hillary. Had she won, would people be calling for an investigation of that?","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"10154884349326509","commenter_b":"Donald Trump would not try to lock the WW2 vets from their own memorial or lock American school kids out of the WH like the pho9ny Obama & dem's did. Pelosi would not even talk to the vets because she was speaking to a group of illegals. However, the scourge is claiming a very fraudulent amount for her retirement, way up in the 6 digits.","commenter_a":"It's still related to DDay and that was sent around by far more than him. Get over it, at least he was honoring the event.","post_message":"Donald J. Trump tried to remember #DDay with a photo that wasn't from D-Day."}]
