[{"comment_id":"1151935354873218","commenter_b":"Nasty hoe","commenter_a":"Some people are seriously fucked up! Mad, evil with a shot of mental illness.","post_message":"Damn  #WSHH"},{"comment_id":"10153447810474575","commenter_b":"Krista, i sure hope your child don't get molested, seems all you Duggar nut huggers have kids.","commenter_a":"Drive into traffic, Palin. Nitwit.","post_message":"Sarah Palin is lashing out against ‘radical liberals in media’ and their portrayal of the family behind the popular TV show “19 Kids in Counting,” after reports of Josh Duggar's sexual misconduct surfaced.  Palin said there was a double standard, stating actress Lena Dunham did not receive the same backlash after she revealed in her book that, as a child, she used ‘anything a sexual predator might do’ to bribe her young sister for kisses and more.   Palin began her rant on Facebook in all caps, writing \"HEY LENA, WHY NOT LAUGH OFF EVERYONE'S SEXUAL \"EXPERIMENTS\" AS YOU HAUGHTILY ENJOY REWARDS FOR YOUR OWN PERVERSION? YOU PEDOPHILE, YOU.”"},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""},{"comment_id":"10154239816884197","commenter_b":"@username Oh, you're so right. High capacity horsepower cars are designed to kill people. High capacity weight vehicles are designed to kill people. We need to ban all cars. They are designed to kill people.","commenter_a":"Maybe we should hold automobile manufactures accountable for deaths caused by automobiles. We should hold knife manufactures accountable for stabbing deaths. Train manufacturers accountable for death by trains. I can keep going on but the PERSON is to blame not the object.","post_message":"It's been a hot topic. Where do you stand? Vote in our poll: @webpagelink"},{"comment_id":"10153366334404024","commenter_b":"I don't trust anything that Obama says or does.","commenter_a":"Get him for war crimes.","post_message":"Doctors Without Borders Rejects Obama’s Apology: Demand Investigation Into What It Said Was An Alleged “War Crime” @webpagelink"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."}]
