[{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to \"fall in line\". I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"10155082864963690","commenter_b":"India and rape can't seem to stop. :(","commenter_a":"indian armies ..............thuuuuuuuuu........","post_message":"\"Victims gave the names of the policemen involved in the barbarity - but nothing has happened.\""},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"537545743072047","commenter_b":"Fuck you you damn racist nut!","commenter_a":"Sounds like she just smoked a fat rock. Good job Vice... Keep throwing the crackheads on the top of my news feed. Not sure what I want more this or cat videos...","post_message":"On the Sea Islands along the coasts of South Carolina and Georgia, a painful chapter of American history is playing out again.  Watch our investigation into why Gullah culture is being replaced by waterfront mansions: @webpagelink"}]
