[{"comment_id":"1147635848590103","commenter_b":"that evil woman will cause alot more problems for america","commenter_a":"HAHA!!","post_message":"North Korea has backed presumptive U.S. Republican nominee Donald Trump, with a propaganda website praising him as \"a prescient presidential candidate\" who can liberate Americans living under daily fear of nuclear attack by the North."},{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"},{"comment_id":"10156335806925725","commenter_b":"ahahah im sorry you said lead... omg kill yourself please xD","commenter_a":"President Obama is being a leader - something that Donald Trump only dreams of.","post_message":"What is our President doing?"},{"comment_id":"10154423395266800","commenter_b":"Bitch you trippin","commenter_a":"The way Trevor Noah struggles with jokes, hardest job seems to be Jon Stewart's replacement","post_message":"Think your job is a drag? Try being one of Trump's surrogates."},{"comment_id":"1343888468964236","commenter_b":"What's Columbus Day? Idk that dude.","commenter_a":"Possibility of a historic windstorm close to the 54th anniversary of the Great Columbus day storm? Wow. The weather here just keeps getting crazier!","post_message":"There is a one in three chance of a “historical windstorm for nearly all of Western Washington that would be long remembered.”  Take today to prepare for possible power outages and have some extra supplies on hand."},{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"}]
