[{"comment_id":"1683425098577634","commenter_b":"It will never happen to that cockroach!","commenter_a":"Yes, it should have happened a long time ago.","post_message":"BREAKING: GOP Threatens Obama With Active Impeachment.  Stop threatening, and just do it already.  Would you be happy if they actually followed through with this?"},{"comment_id":"10153153775676350","commenter_b":"Girls, keep on winning!","commenter_a":"Stop your whinning..","post_message":"\"Please do something about this. Girls read comics, too, and they care.\"  Read Rowan's full (awesome) letter here."},{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."},{"comment_id":"1145710305499191","commenter_b":"Women are insane! All of them!","commenter_a":"Omg Daniel Melchior","post_message":"This woman has said her ex-fiance hit her, causing a black eye and other injuries. But now his attorney says this home surveillance video tells a different story.  STORY: fox32chicago.com/news/@username-story"},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10154024532730950","commenter_b":"Yes, those woman do.","commenter_a":"He is right. A rapist and an evader of taxes like him, is running for president and might win. Indeed, a third world country.","post_message":"“Folks, we’re living in a third world country,” said Trump while talking about Clinton’s emails. @webpagelink"},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."}]
