[{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"695993670581357","commenter_b":"spic is a born liar and sex pervert feel up women in their dreesing room beth midler years ago paid her off .","commenter_a":"Geraldo Rivera .... DISLIKE! Good job, Bill!","post_message":"Clueless liberal Geraldo Rivera and Bill O'Reilly almost had a fist fight live on air when Geraldo said that illegal immigrants haven't broken the law. O'Reilly shoved Rivera's lies down his throat. Man, this is good."},{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"},{"comment_id":"855684411135567","commenter_b":"what mexicans smuggling drugs into our country? no WAY! shoot them","commenter_a":"Hmmm... hemp mattresses.","post_message":"Nice try."},{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"}]
