[{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10154258426436509","commenter_b":"JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. CALL: +@username WE SUPPORT YOU BOTH SPIRITUALLY, FINANCIALLY, PHYSICALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BEING A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL WEBSITE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE. WE DON DISCRIMINATE IF YOU ARE WHITE OR BLACK. CALL: @username OR SEND AN EMAIL TO: ...","commenter_a":"Terrorist can care a crap about climate change their goal is to eliminate all others that do not believe in their religion.","post_message":"\"What greater rejection of those who would tear down our world than marshaling our best efforts to save it,\" President Obama opens up #ClimateChange conference COP21 #COP21Paris"},{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153632198263908","commenter_b":"These girls suck. There's no way around it.","commenter_a":"So enlightened yet judging girls because they take a selfie..","post_message":""},{"comment_id":"10153173280761491","commenter_b":"LMAO this is a joke!!!! Yea right, sure. And the first lady, Kim Kardash can show the sex tape she made in 2003 for company to the White House. This is what gave her fame and made her millions, Something she sure can be proud of and maybe even have her pres hubby pass a law that it be played in all public schools. LMAO","commenter_a":"Bernie Sanders","post_message":"It's still unclear if he's serious."},{"comment_id":"804054019696293","commenter_b":"Dumb bitch...","commenter_a":"She just needs to shut her piehole take off her cloths and look pretty!","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"}]
