[{"comment_id":"556548184511652","commenter_b":"You people seriously think our border with Mexico will keep terrorists out? You think that if we can't tell the difference between refugees and terrorists, that we would actually be able to sort them out at the airport? If we didn't want to take refugees we should not have involved ourselves in the war.","commenter_a":"To the people who support bringing in Syrian refugees: Have you ever thought that some of these \"refugees\" could be disguised and actually be ISIS terrorists taking advantage of this situation with a free pass to get here? I think we need to use common sense and take the obvious security precautions and NOT accept these people!","post_message":"My interview last night with Sean Hannity."},{"comment_id":"1241041889268599","commenter_b":"Kelly is an ass wipe. Acts like a two bit sleazy pig with her bottle cap tits, ya know the ones she like talking about","commenter_a":"Get rid of her","post_message":"Megyn Kelly reacts to Trump's Florida speech.  @webpagelink"},{"comment_id":"10154057367791600","commenter_b":"Exactlyyyyyyy","commenter_a":"My dogs would be out of there before me","post_message":"The cause of the early-morning fire is under investigation."},{"comment_id":"951788561528283","commenter_b":"Sociopath with narcissistic delusions of grandeur, infantile anal expulsive ideology and penis envy. The bitch is a mess.","commenter_a":"Is he gonna cwy...poor widdle ting","post_message":"McTurtle can dish it out...but he sure can't take it. SHOCKING!"},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""}]
