[{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"10153974645223132","commenter_b":"ITS NOT A WOMEN!!!!! Check the DNA!!!! It has not had ANY of the real struggles of a REAL women. Tell it to give birth, have a period, nurse a newborn baby!!!!! Completly undeserving!!","commenter_a":"maybe if the men who hink that they are women should have the gender description of woman and all women change to the smartersex as our descriptive verb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Congratulations, Caitlyn Jenner, who was an honoree!"},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10153743354289614","commenter_b":"He doesn't like illegals","commenter_a":"You know TRUMP is mad!","post_message":"BREAKING: Mexico has defeated the U.S., 3-2, in the CONCACAF Cup match at Rose Bowl Stadium in Pasadena."},{"comment_id":"1784602218530696","commenter_b":"This lady is a clown with money. She is a joke","commenter_a":"gotta laugh at all these haters who are left over from Obamas reign! Its time to shake up the education system!","post_message":"Join us as Vice President Pence holds a swearing-in ceremony for the Secretary of Education, Betsy DeVos."},{"comment_id":"10153101958805329","commenter_b":"I love that now it's called \"fat shaming.\" She made a choice to eat healthy, work hard and raise her kid. What is wrong with that? Society is annoying sometimes.","commenter_a":"What it's bad is telling people what to fucking do!!!","post_message":"“I have a kid, a six pack and no excuse.”"}]
