[{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog \"red alert\" in Beijing"},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."},{"comment_id":"10153352781442217","commenter_b":"Haha She will never take any more selfies in life","commenter_a":"Pauline Mcgovern","post_message":"An Austrian tourist has had to be rescued from a well, after she fell into it while taking a selfie."},{"comment_id":"1407285352638546","commenter_b":"Mama and papas feathers are probably nice and toasty.","commenter_a":"There it is","post_message":"CHIILLLLYYYY! Let's see what our favorite eagles are up to today, hopefully they're staying nice and warm! The little eaglet is getting big(ger)! For more: @webpagelink #HatchWatch2017 (Video courtesy of Dick Pritchett Real Estate)"},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"}]
