[{"comment_id":"931627590204327","commenter_b":"From Shyann Malone - This is the coldness I experienced when getting into the car this morning! 40 In St. Pete at 3am. Heat on Full Blast!","commenter_a":"Mulberry","post_message":"Brrrrrrrrrrr! This was St. Pete at around 3a.m. this morning.  Who's the coldest in the Bay area? Show us how frigid it is at your location. Snap a pic and post it in the comments below."},{"comment_id":"10153507690103812","commenter_b":"They attack to eat. It's a risk of going into an ocean. Yet millions do multiple times yearly. Safely.","commenter_a":"I wish they could stop telling the lie... \"Sharks don attack humans\".... Yes they do!!","post_message":"UPDATE: Officials: Girl and boy may have lost parts of limbs in separate shark attacks on same stretch of NC beach: @webpagelink"},{"comment_id":"10153602111881336","commenter_b":"No Obama already congratulated them.","commenter_a":"Obama will probably prosecute them.","post_message":"Three Americans are being hailed as heroes today for tackling and disarming a gunman on a high-speed train traveling between Amsterdam and Paris."},{"comment_id":"1444053418948017","commenter_b":"That's why those guys never meet a MULAN their whole life. They could not handle a strong woman anyway.","commenter_a":"He's blaming Mulan for progressiveness and equal woman's rights. Someone thinks we belong in the kitchen barefoot and pregnant.","post_message":"Donald J. Trump running mate Mike Pence slammed the kid's film as the brainchild of a \"mischievous liberal at Disney\" bent on causing \"a quiet change in the next generation's attitude about women in combat.\""},{"comment_id":"880575888650866","commenter_b":"The christians and jews cause more terror","commenter_a":"muslim are terrorist i repeat","post_message":"An Ohio man accused of plotting a terrorist attack on the US Capitol says before his arrest he was planning to go to Washington, DC and shot President Barack Obama in the head.  Full story: @webpagelink"},{"comment_id":"1412614535483745","commenter_b":"Hey opee what the fuck did you ever do for our country. Not a damn thing. Any thing you have to say a worth shit. And as far as that POS obummer did even less.","commenter_a":"Keep you nose out of politics...you are best doing commericials for Weight Watchers...I am sure you need the money! Why don't celebraties keep their big mouths shut!","post_message":"This is a coordinated, collaborative effort on the part of the news and entertainment media to destroy Donald J. Trump, his administration, and the half of the country who supports them.  But notice the part of the Oprah story the media WON'T want to report."},{"comment_id":"454038491472779","commenter_b":"What the Hell is wrong with this chick...one week she poses nude and another week she posts pic of her child, are we suppose to say which one we like better....you are a sad piece of work, girl","commenter_a":"Who cares????? Guess she wants him to be seen naked also. So popular for being nothings.","post_message":"Kim Kardashian West's newest snapshot of little Saint is a burst of son-shine!  (via Celebrity Baby Blog)"}]
