[{"comment_id":"1269577516395609","commenter_b":"So your saying CO2 is NOT a gas?? Where did you study chemistry?","commenter_a":"If that was gas.... the fireworks would have gone off as soon as the air was saturated enough to be visible.","post_message":"No, that's not fog. It's a gas leak.  @webpagelink"},{"comment_id":"10154280732936336","commenter_b":"Agree100%","commenter_a":"How is this discriminatory? Use the bathroom according to your plumbing not your frame of mind. What about the civil rights of those who don't want to share the restroom with those of another gender? If a transgender earns money they pay taxes according to their earning not what they think they should pay. I'm really tired of a few people re-writing the moral and cultural standards for the nation.","post_message":"\"I’ll make a decision in 24 hours.\""},{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"},{"comment_id":"460484767469658","commenter_b":"China dont want none!!!","commenter_a":"So we take warnings from communist?","post_message":"TRUMP WIN RATTLES CHINA"},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."},{"comment_id":"10154113353450329","commenter_b":"@username the souls one makes me think of you lol","commenter_a":"Elyse Landolfi","post_message":"keep it simple"},{"comment_id":"10154456636350695","commenter_b":"@username - you sir have won the internet today! That is hilarious!!","commenter_a":"What didn't this guy do during the rampage? I'm sure we're gonna hear he saved 15% on his car insurance next.","post_message":"NEW: Authorities say the shooter texted his wife while he was hiding in a bathroom, asking if she'd watched the news..."}]
