[{"comment_id":"1104531886270791","commenter_b":"She's a pussy cat","commenter_a":"@username take your next vaca with Marina","post_message":"Welcome to dog paradise — tons of land to run free and daily visits from human playmates. (via INSIDER)"},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"\"For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.\"  In his \"Talking Points\" tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"10153061896611051","commenter_b":"She did nothing wrong. I applaud her.","commenter_a":"What IN the hell is this World coming too this kid don't have MONEY and she was nice too give her food too eat I thank her for her kindness and Love and a heart, caring!!!!!","post_message":"A hungry first grader who didn't have money for lunch started crying in front of this kitchen manager, so she gave her some food. Bad move."},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"894821663947420","commenter_b":"more idiots!","commenter_a":"I blame Obama","post_message":"Don't be quick to blame California's drought on plush lawns and swimming pools ..."}]
