[{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153802137316130","commenter_b":"It's almost always a woman too","commenter_a":"How romantic to threaten to blow up a plane full of passengers for your ex-wife.","post_message":"An Egyptian plane was hijacked, and several passengers were held hostage."},{"comment_id":"10153642816391130","commenter_b":"Fk this bitch","commenter_a":"What a horrible article.","post_message":"One reason? Bernie Sanders is \"too old.\""},{"comment_id":"1138559072849036","commenter_b":"Are you still w trump ? Onilk Deleon","commenter_a":"If you really want to start sending these people a message. Start taking these videos and comments and send them to their employers.","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC.  #MicBrights"},{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just \"apply\" to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: \"I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?\" @webpagelink #DemsInPhilly"},{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."}]
