[{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: \"Islam is Not a Religion of Peace!\" www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"},{"comment_id":"1279104212107002","commenter_b":"Women should have curves, she's beautiful!","commenter_a":"Love this woman. She is funny and embraces who she is","post_message":"You're beautiful, Melissa McCarthy!"},{"comment_id":"10152715468475736","commenter_b":"Well, it would also be illegal to shoot undocumented immigrants.","commenter_a":"SHOOT ON SIGHT.","post_message":"The sea lions are making their way into town now! (Well one of them is.)"},{"comment_id":"10153335080543487","commenter_b":"@username - actually that's what women think but if you're not paying attention, between sitting down and standing up, sitting down is far messier.","commenter_a":"They should also sit down to piss. In solidarity.","post_message":"From our archives: An ethicist explains why he and his fiancee rejected this centuries-old tradition."}]
