[{"comment_id":"1022408774478552","commenter_b":"Why is she walking free?","commenter_a":"since when can a low life irs agent speak with the doj,fbi to cause harm to a tax payer","post_message":"Jaw-dropping abuse of power:"},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"},{"comment_id":"1886511228246156","commenter_b":"Illegal aliens.","commenter_a":"What your liberal brains are to small to realize is there is no defending illegal immigrants. They have no right to a trial. They have no right to a defense. They are automatically guilty and only entitled to deportation. If you want to be American there is a legal way. It is not easy nor will it be quick. But if you are willing to do it the legal way then you get to become an American and stay without fear of deportation.","post_message":"Janet Napolitano says the University of California will vigorously protect illegal immigrants."},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"10153443725952293","commenter_b":"O AGORA SOSSEGA E ME DEVOLVE MEU DESODORANTE","commenter_a":"Victoria Dowsley","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"1332904726749996","commenter_b":"It'll never happen - no minorities, no women. He would need 80% of all the white males in America to vote for him.","commenter_a":"This ad isn't even a reliable ad. It's a lying rag. Not been anything on news about this. So it's just another lie. Wake up idiots Trump will be President, no matter what so get use to it. Go Trump","post_message":"Wow...this isn't good for the Republican party."},{"comment_id":"853953454653203","commenter_b":"Wow::hey woman-let go of her hair and fight,","commenter_a":"Can we please get the blurred trip screen out so we can actually see something?","post_message":"WILD AND VIOLENT BRAWL: An all-female fight goes down outside a gas station and the spectacle was captured on video. Kicking, punching, hair pulling. We can't make this stuff up."}]
