[{"comment_id":"10153217644964411","commenter_b":"Lmfao ro. What about the natives in Mexico? Forget about them you spaniard?","commenter_a":"Fuck off back to America - youu are needed there to fight the police!","post_message":"'The whole purpose  is to assure those allies that live closest to the Bear that we are here,' Lt. Gen. Ben Hodges, commanding general of US Army Europe said."},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"939606616115567","commenter_b":"Slaves to Islamic vermin. not MEN","commenter_a":"Sharia and Islam are only good for Muslim Males ................Males get all the advantages............... BUT .women, children, gays, Christians , Buddhists, Jews, Hindu and anyother religion not \"their \" brand of Islam will be punished , raped , enslaved , or killed . Women of the world wake up and see this truth . Fight for freedom .Women Fight for your life....Women you can be more than slaves to men ........","post_message":"They're just sweet refugees', they said. 'Who just want a better life', they said. Welcome, and then .... German girls... cover up... so you don't get raped by the 'refugees'?"},{"comment_id":"729424187224050","commenter_b":"@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."},{"comment_id":"10154741880843145","commenter_b":"Illegal immigrants? Not for long bye!","commenter_a":"Why should I leave Lisa I didn't make the mistake of voting for his sorry a$$.","post_message":"WATCH: President Trump announces Alexander Acosta as his pick for labor secretary. Here's the latest: @webpagelink"},{"comment_id":"1193491007392830","commenter_b":"@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"}]
