[{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were \"no visible signs of injuries found on the bodies.\""},{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say  ----> @webpagelink"},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"10152972310600950","commenter_b":"She didn't have to do or not do anything. Her life doesn't go by some imaginary rulebook that you made up for social and community etiquette in the trans community. She can do whatever she wants however she wants, regardless of who it offends.","commenter_a":"If you have to ask if you are supporting your community the right way, then maybe you should be questioning your actions in the first place and the reasons behind them. He/she should have started a discussion forum with the transgender community prior to his/her transformation","post_message":"Caitlyn Jenner is starting to write about \"serious issues and lessons that I am learning through this process.\""},{"comment_id":"887798031255619","commenter_b":"@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"},{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"\"I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.\" -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"\"Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.\" Via POLITICO Magazine"}]
