[{"comment_id":"595817020606725","commenter_b":"Excellent point!","commenter_a":"If the Hillary Clinton fans were so well-educated, then tell me why they are turning out in Mass numbers to destroy property, assault their fellow Americans, and anyone who doesn't share their beliefs. My guess is that most of these people don't work and probably didn't even vote. If that's your following Hillary, I am so so very glad that you lost.","post_message":"I believe Spiderman once said that a “tree is known by it’s fruit” and “wisdom is vindicated by it’s children.”  No, wait… that wasn’t Spiderman. It was Jesus."},{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"\"ELECTED\" enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"},{"comment_id":"954480501354785","commenter_b":"After all the bitching and complains that one guy did I'm so happy to see this.","commenter_a":"Please don't start with you there goes the racist comments because you're a racist to say","post_message":"LIVE: Special announcement expected at Little Caesars Arena around 10am, regarding \"another Detroit franchise announcement\" - MORE at ClickOnDetroit.com (UPDATE: Kid Rock will open Little Caesars Arena with 4 shows in September 2017)"},{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."},{"comment_id":"10153994015308132","commenter_b":"Chile sit her was down Jim Carey prob has Ebola and she sucked that Dick down","commenter_a":"Ignorant woman.","post_message":"Jenny McCarthy has more to say about Charlie Sheen."},{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"10152950805022452","commenter_b":"Donald Trump should be proud that an \"Illegal Immigrant\" did not win. We don't want them to take the jobs from the \"White\" women! Next year they are going to have a new catagory called guess who is behind the sheets.","commenter_a":"Awesome","post_message":"Miss Oklahoma, Olivia Jordan, has won the 64th annual Miss USA contest. @webpagelink  This year's contest, held in Baton Rouge, Louisiana, had been largely overshadowed by comments made by pageant co-owner and real estate mogul Donald Trump while running for president."}]
