[{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"},{"comment_id":"1140920095928019","commenter_b":"Mexicans and Americans are the same. they both are sheep","commenter_a":"most latinos want everything handed to them so of course they would vote democrat. duh","post_message":"GOP candidates might not want to overlook Latino voters."},{"comment_id":"1294253327262342","commenter_b":"Build a big wall","commenter_a":"Keep a look out for us Jonathon Organ","post_message":"Huge comets could destroy civilization."},{"comment_id":"1082800578422029","commenter_b":"She can squat but that don't put bread on the table!","commenter_a":"who makes up these polls for you ?","post_message":"BREAKING"},{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."}]
