[{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"},{"comment_id":"883241831711239","commenter_b":"@username another liberal who's mother should have swallowed","commenter_a":"I back the police , i hope they do turn their backs on Obama , he is a worthless piece of sh**","post_message":"PLEASE do this, cops!"},{"comment_id":"10154507396141051","commenter_b":"Maybe the kid should go to history class and learn how the evil \"white\" people voted to free the slaves. Oh ya, it was only the republicans who voted that. NOT ONE DEMOCRAT. And maybe he should learn that the flag represents freedom from the brits, For all Americans. If he doesn't like it, maybe he should take a year for some overseas education. Say France maybe.","commenter_a":"Move if you don't like America","post_message":"This teenage boy refused to stand up out of his chair for the Pledge Of Allegiance because, in his words, \"America sucks.\" Here's how his teacher responded."},{"comment_id":"10153138411643717","commenter_b":"FULL SAILS!! SHE CAN TAKE IT!","commenter_a":"Capt. Kenway ?!","post_message":"El Galeon Andalucia, the only galeon class vessel in the world sailing today, will be in Portsmouth Harbor beginning this week: @webpagelink"},{"comment_id":"1088733604470282","commenter_b":"If these teachers are not immediately fired, you can assume that there is something pretty sinister going on at that school. And just where are they getting their lesson plans, and who is allowing this?","commenter_a":"Muslims are the fastest growing bloc of Immigrants published by the Center for Immigration Studies. Also another study by American Community Survey (ACS) finds that foreign-born population in the U.S. hit a new record high 42.4 million in July 2014. Since 2008-2013, according to (ORR) Office of Refugee Resettlement, U.S. has admitted 115,617' Refugees from the Middle East and granted another 10,026 asylum. Granted Green Cards to 308,805 immigrants from the Middle Eastern countries identified by ORR as Refugee Nations making them lawful Permanent resident (LPR`s) eligible for citizenship in [5] years and petition their family members to come to the U.S.. Middle Eastern Refugees are immediately eligible for Public benefits -to the U.S. particularly the Syrian Refugees. ORR defines asylaes from the Middle East as being: Afghanistan, Iran, Iraq, Jordan, Kuwait, Lebanon, Saudi Arabia, Turkey and Yemen. As of 2013, top ten Countries for admission to the U.S. were ...","post_message":"Middle school instructs students to create ISIS propaganda"},{"comment_id":"787320821458495","commenter_b":"F $(; Muslims!!!!","commenter_a":"Fuck Muslims","post_message":"A&E Tells Duck Dynasty To Cut ‘Jesus’ From Prayers To Avoid Offending... We live in a nation with it's foundation built on Christianity. Can we get 30,000 'LIKES' for Duck Dynasty's faith?"},{"comment_id":"10154742011562908","commenter_b":"Stfu","commenter_a":"Raise taxes on corporations they either go overseas or pass the expense on to the consumer. Bernie can't tax enough to pay for free everything.","post_message":""}]
