[{"comment_id":"10152960081691051","commenter_b":"My ex wife is a chupacabra!","commenter_a":"Yeah right !!","post_message":"This woman is confident that she found a Chupacabra - and she has proof."},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"1760785597541885","commenter_b":"Yes I believe","commenter_a":"Yes","post_message":"VIA : God Is Love"},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"},{"comment_id":"10154738132201037","commenter_b":"everything she does is fake.","commenter_a":"Sounds fake to me. She'll have to sue me to I guess.","post_message":"The suit alleges Kim Kardashian West was victimized a second time when the website reported that she faked the robbery and lied about the assault."},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."}]
