[{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."},{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."},{"comment_id":"985729194809437","commenter_b":"Having the private server in itself is breaking the law Please get her out of the nomination cycle now","commenter_a":"Coverup","post_message":"Why did the State Department do this?"},{"comment_id":"10153014740596545","commenter_b":"@username stop right there. No Bush should be allowed in politics anymore. They've controlled things long enough!","commenter_a":"Go away Rick Perry......far away!","post_message":"Rick Perry referred to the Charleston incident as an \"accident\" on Friday; staffers said he had meant to use the word \"incident.\""},{"comment_id":"1204381342954945","commenter_b":"something wrong","commenter_a":"What the hell???????????????????","post_message":"The UK government buildings put in hock to Muslims"},{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."}]
