[{"comment_id":"10158563017270354","commenter_b":"She is too good for you a hole","commenter_a":"All of you hypocrites who are protesting and rioting over Trumps's decision that was very similar to Obama's that you didn't even bat an eye for, is the reason Trump will be here for 8 years.","post_message":"Grammy Award-winning rapper Eminem called President Donald Trump a \"bitch\" and fantasied about sexually assaulting conservative author Ann Coulter in a new song."},{"comment_id":"986428001390952","commenter_b":"If she doesn't like it let her go back to where she can ask for what she wants and expect to get it because she's Muslim. If one doesn't like our rules go somewhere else.","commenter_a":"Simple solution open and pour content of can into cup in front of customers","post_message":"Your thoughts?  STORY: @webpagelink"},{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a \"surplus\" withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on \"The Kelly File\" last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10153041474101051","commenter_b":"Take away the baby and tie her up so she can see how that feels .","commenter_a":"I'm assuming she gave the baby dog food.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."}]
