[{"comment_id":"10154033715125329","commenter_b":"Chop chop woman haha","commenter_a":"@username Brittany Suzanne Pink","post_message":"Gilmore Girls could be getting new episodes on Netflix!"},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."},{"comment_id":"1337533142938860","commenter_b":"an untalented hooker","commenter_a":"That creepy dame who's his spokes person ought to be banned from every network and media outlet.","post_message":"Whoa, CNN grew a backbone! After what was said, he should be banned from America."},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."},{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"},{"comment_id":"2196085043950203","commenter_b":"When is she moving. Shut her up","commenter_a":"She needs ducktape","post_message":"The Left in America is unhinged: why is this woman on TV?"},{"comment_id":"10153249874686051","commenter_b":"Girl... You are so sooo wrong! I guess you think Hillary would have answered the question.. Lol","commenter_a":"Trump had NO intention of ever calling on this great reporter - his questions would have been too complicated for Trump to answer. Even later when the reporter comes back in after his \"time out\", Trump badgers him.","post_message":"Here's how Donald Trump responded when a reporter interrupted his press conference."}]
