[{"comment_id":"10154016179049411","commenter_b":"Merkel admits multiculturalism in Germany a failure, yet continues to accept refugees @webpagelink/ After Muslim rape epidemic, Merkel admits Germany refugee crisis out of control. German Chancellor admitted Europe is 'vulnerable' and said countries do not have control of the situation @webpagelink @webpagelink","commenter_a":"Magyarország <3","post_message":"'If we cannot secure the outer border [of the EU], regardless of how costly or demanding that is, we will destroy the Schengen regime by ourselves'"},{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"10153814761109705","commenter_b":"So are fat chicks!","commenter_a":"It's always amusing when it's celebrated to mock some, but when it's other's it's called \"shaming\" and it's frowned upon. Looking forward to your next article on fat chicks saying fat is cool and healthy!!","post_message":"Twitter is calling it #YallQaeda."},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns.  STORY: @webpagelink"},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between \"us sistas,\" not take part in some of the controversial reality shows out there."},{"comment_id":"10157030256485615","commenter_b":"\"The Tennessee hardware store owner who banned \"the homosexual people\" and posted a \"No Gays Allowed\" sign at his business last year recently constructed an outhouse that he's calling a \"Transgender Bathroom.\" @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells \"choose god or gays\" hats, too..."},{"comment_id":"760301420735133","commenter_b":"She should be Punished!","commenter_a":"Smh so much attention on my comment i got exactly what i was looking for... #Exposed","post_message":"Terrible."}]
