[{"comment_id":"10154079186342541","commenter_b":"@username what are you talking about ?","commenter_a":"Officers do well checks. Would have taken a few seconds for a FB friend to call the cops and have that phone traced.... SMH.","post_message":"\"It's amazing for someone to sit there and see somebody or hear them take their last breath, and nobody did anything.\""},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"500328103497004","commenter_b":"@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"10153823675392235","commenter_b":"Truth hurts bitches!","commenter_a":"Oh you f****** douchebag liberals have your head so far up your asses if it wasn't for us good white heterosexuals paying all the bills for your lazy asses because you want everything handed to you for free because you believe you're entitled to everything that anyone else has and not willing to work your ass off for it Donald Trump is point on need to shut our f****** borders down. If that's racist then I'm proud to be a racist and stand up for my white skin! You f****** liberals can f*** off and die!!","post_message":"This is truly hilarious."},{"comment_id":"10156684390715354","commenter_b":"Pussy.","commenter_a":"Yikes...say goodbye to England","post_message":"Prime Minister David Cameron announced: “I want London to stand alongside Dubai and Kuala Lumpur as one of the great capitals of Islamic finance anywhere in the world.”"},{"comment_id":"10154493895401509","commenter_b":"He's not going to win the general election! Ha!!","commenter_a":"BOOM!!! #Trump2016","post_message":"BREAKING: CNN projects Donald J. Trump has won the #NVCaucus. @webpagelink"},{"comment_id":"10154300951236519","commenter_b":"But Hillary lost. There will be no Gulag.","commenter_a":"Boy, at least He can feel like he has clean hands as we are all marched into the Gulag. Very comforting.","post_message":"One elector defected so far, but not from Donald Trump."}]
