[{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"1716657778577521","commenter_b":"no not true.I have seen proof LOL","commenter_a":"When faced with criticism of their candidate, Trump fans are quick to argue that Trump is better suited to be president than Obama or Hillary. The choice is NOT between Trump and Obama or Trump and Hillary. The GOP is choosing THEIR standard-bearer. The choice before us AT THIS CRITICAL MOMENT is between Trump and anyone of three other Republican contenders. Who will have the moral character to stand up against Hillary or Bernie? I choose CRUZ!","post_message":"Is there a real connection between hand size and penis size? We decided to investigate what the science says on the matter..."},{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"1257498034286119","commenter_b":"I this this guy is secretly obsessed with pussy lol","commenter_a":"QUESTION: How can you call yourself a patriot and support 33 Benghazi hearings but NOT ONE on whether Russia infiltrated the White House...?","post_message":"Drip. Drip. Drip. Republicans in Congress need to drop the political charade and help us get to the bottom of this."},{"comment_id":"10158091047615293","commenter_b":"Even Medicaid charges copays now. Where before ACA it didn't.","commenter_a":"It can't be any worse, drug prices have more than tripled over the last 4 years, Not to mention blue cross going up and more than doubled their premiums over the past few years. Blue Cross gets 300 bucks of our paycheck ever other week, and that's our part the company matches that, you add that up. 1200 a month for family coverage.","post_message":"What will healthcare look like under President Trump?  Tell us what you think in the comments below."},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"10153304672057377","commenter_b":"@username, you are just giving me TONS OF REASON ! As i said............, if there are no \"illegals\" to pick it up...............IT ROTTS on the ground.........! They are the ones who pick the fruit and vegetables !","commenter_a":"Trump will be in New York next year ! If anyone thinks that he can win the Presidency calling names to every minority in this Country, better have something else to sleep well because Donald Trump will never be President of the United States of America !","post_message":"The Rev. Franklin Graham Thursday suggested that Pope Francis \"build a bridge\" to Republican front-runner Donald Trump because \"who knows where he may be this time next year.\""}]
