[{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what \"ATTEMPTED TO KILL THEMSELVES\" you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"1473249136068163","commenter_b":"Men don't walk around campaigning for free the japs eye so why do women do this","commenter_a":"That's bold.","post_message":"Nude York City!"},{"comment_id":"849951858441198","commenter_b":"This guy is a freakin joke.","commenter_a":"Thank you, much respect to you for not being one of the okie dokie.","post_message":"This one says it ALL!   Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"10157152900750206","commenter_b":"I was with the writer until he called Manziel \"talented.\"","commenter_a":"Who cares!! He's a spoiled little brat that had everything handed to him. he has no class and a horrible role model for our youth. He shouldn't even be in the NFL..","post_message":"The football player's own father said, \"I truly believe if they can't get him help, he won't live to see his 24th birthday.\""},{"comment_id":"1236409066433862","commenter_b":"Clifford Maclean Losee","commenter_a":"Save your money you bunch of fruit cakes!!!! You might be able to afford things if you would quit donating to lost causes!","post_message":"Michigan certifies President-elect Donald J. Trump's win in the state, awarding him 16 electoral votes. @webpagelink"},{"comment_id":"10154357788051509","commenter_b":"Escape to Germany or Sweden for safety?! Really?! Do not keep up with the news? Germany and Sweden have been taken over by the same Isis loving Muslims that killed this woman! There is no safe place for Arabic women to go to as long as Arabic men are around.","commenter_a":"There goes a girl who did not leave her country to reach Germany or Sweden for safety and fought as best as she could...she got executed for her tweets about life in Raqqa... Now you know what refugees who are labelled as \"cowards\" \"parasites\" \"are escaping from.","post_message":"She wrote about life under ISIS rule with humor, sadness and a glint of hope."},{"comment_id":"464935007030413","commenter_b":"Best place in the world for a daily Pork roast.","commenter_a":"Deport their @&$)(;:/,?))&@@&))","post_message":"Should Islamberg Be Shut Down?  Comment 'yes' or 'no'."}]
