[{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"10152868223844342","commenter_b":"You all ladies is nutts","commenter_a":"The mom went looking for trouble. This all would not have happened if she would have been the adult and just let it go, but she couldn't. She payed the ultimate price and now this teen is going to have to answer to a judge. No one wins in this situation. Two families lifes are forever changed. Smfh","post_message":"Police tweeted this photo of the suspect in a road rage case that left a #LasVegas mother dead  FULL STORY @webpagelink/  Photo courtesy Las Vegas Police Department"},{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER \"NEW PET\"  READ & COMMENT BELOW:"},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"948811408568971","commenter_b":"so far bro, all i am seeing from you is more words. do you ever do any thing but talk?","commenter_a":"Run for Congress","post_message":"Conservative Sheriff Promises  will fight for your rights.. I will die fighting for the Constitution!"},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"}]
