[{"comment_id":"1191980840884045","commenter_b":"Seth Rich, DNC staffer, suspected of leaking information to WikiLeaks about the Clinton campaign randomly gets shot in the back walking down the street.... Why are so many Americans blind to the corruption in the Clinton campaign? People with credible evidence against Hilary are turning up dead. This is not a random instance. @webpagelink","commenter_a":"Trump will make changes, and yes Obama Trump doesn't think we faked the moon landing.","post_message":"Barack Obama’s greatest strength? “Probably that I’m always early.” hillaryclinton.com/makeaplan"},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."},{"comment_id":"10153398381514364","commenter_b":"Social security is the world's biggest pyramid scheme. It will eventually crumble, and I have no doubt it will do so in my lifetime.","commenter_a":"I'd love to have my social security tax, 6.2% of my income, go into my 401k or Roth. I don't need the government to help me save for retirement.","post_message":"They aren’t being straight with the American people, and they know that."},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."},{"comment_id":"10153328314986051","commenter_b":"she a bitch who needs to be euthanized,,,","commenter_a":"Lost a lot of the respect that I was feeling for the pope. I don't care who he decides to visit, but why the \"secrecy\"?","post_message":"Pope Francis’s message to Kim Davis during their meeting was short and sincere: Stay strong. Do you support or oppose the stand Davis is taking?"}]
