[{"comment_id":"835505926554037","commenter_b":"I bet she get tax breaks on her taxes.take a few seats missy","commenter_a":"C U NEXT TUESDAY !!!","post_message":"Does this woman realize she's shopping at Walmart, where wages are so low that many workers qualify for public assistance?"},{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"},{"comment_id":"422148361459748","commenter_b":"Disgusting 😡 Hope they lose their seats next election! #CrookedBastards","commenter_a":"Continued disappointment!","post_message":"Republicans just sold our public schools to the highest bidder.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"1756313234607564","commenter_b":"Hillary the Corrupt Witch Bitch !","commenter_a":"#NeverHillary!","post_message":"***UNPRECEDENTED CORRUPTION***"},{"comment_id":"10153389617181509","commenter_b":"Tell the pigs this same info.....they dont seem to remember the law and if they need it,give them your info and have them subpoena it...like theyre legally required to do","commenter_a":"No Law or Rule against. As some police assume?","post_message":"A growing number of people are turning their cameras on cops. You can learn more via CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat"}]
