[{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on \"alternative\" news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"10154201657127541","commenter_b":"White terrorists","commenter_a":"When we figure out that words isn't going to change minds of white people best believe if they knew there would be retaliation then they will think twice.","post_message":"Because federal terrorism statutes almost exclusively focus on foreign extremists, he won't face terrorism charges, but he could face 10 years in prison."},{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"1641280749470830","commenter_b":"At the end when she started really going after him is when I would have had her on the ground and I would break her fucking arm and left her there to rot","commenter_a":"Knives are becoming a serious problem. Yet another unintended consequence of terrorism.","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153146203991051","commenter_b":"Caucasian women are most desire able","commenter_a":"I'm not racist but do y'all notice that the teachers who have sex with students be Caucasian? Hum!!!!","post_message":"This teacher was arrested for having sex with her students. While she was out on bail, she got busted doing it again."},{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: \"They are looking for adventure.\""}]
