[{"comment_id":"10152664925256717","commenter_b":"A business that is open to the general public should not be allow to discriminate . If I knew she belonged to the southern baptist I would have never given her by business anyway. Too many businesses out there would have loved to cater to your wedding.","commenter_a":"She looks a bit of a lesbian herself. Maybe a frustrated one! But anyway.... take that mama!","post_message":""},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."},{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."},{"comment_id":"10154231827133797","commenter_b":"How you like them bad apples","commenter_a":"So all of you WANT another war? The Obama hate is getting really old. Let me guess. Your all republican wealthy suburban mini van driving ,entitled Starbucks drinking pricks. I like how you alllll forget Bush's presidency. By far the worst president. Ever.","post_message":"OBAMA ADDRESSES PARIS ATTACKS: President Barack Obama says putting large numbers of U.S. troops on the ground to combat the threat from the Islamic State would be \"a mistake.\""},{"comment_id":"10152929837961130","commenter_b":"He would be a hero. If he were a girl, she would be a heroine","commenter_a":"\"Hero\" or \"heroine\" or are you undecided?","post_message":"This just made our week."}]
