[{"comment_id":"10153633872565950","commenter_b":"Yeah! Lets send everyone back to where they came from! Build a wall ! Its back to Europe with you my friend:)","commenter_a":"And this is NEWS , Why??? Don't even care or know who this guy is... Stay out of Mexico and South America and guess what?? You will be safe...","post_message":"25-year-old Alan Pulido is a forward for Olympiacos of Greece and was part of Mexico's 2014 World Cup team."},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"10153584553228010","commenter_b":"time for a woman in the white house now","commenter_a":"Don't blame me for the situation of this nation. I did not vote. I opt out.","post_message":"What if you were automatically registered to vote? Oregon has a history as a ballot-box innovator."},{"comment_id":"493684487507628","commenter_b":"Keep em out our we go the way of Europe. No Trojan Terrorists!","commenter_a":"Vet everyone coming in","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.”   Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"591748790988611","commenter_b":"She is such a lying two-faced b**** and anybody that believes anything that she says is a moron! That woman has more money and more houses and more luxury than anyone. Everytime she opens her mouth she's lying","commenter_a":"Pot calling the kettle? Except for Trump never having killed anyone","post_message":"Is this hypocritical?  WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"1035891609764351","commenter_b":"^ Africa has the most terrorism on the daily and Nigeria in particular last three months schools had radical Muslims go in and blast kids! Hundreds dead No Americans there...","commenter_a":"Terrorism in Canada is only in the mind and children shouldn't suffer because of a bunch of paranoid adults...","post_message":"The Edmonton Public School Board has put all trips on hold as well."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""}]
