[{"comment_id":"10155114776336509","commenter_b":"Yes lets look at all those years Hillary has been in office but she doesn't handle classified information. So what does she do??? Trump has declared bankruptcy 7 times out of over 500 businesses. Pretty good success rate. I would like to see you try and run two businesses and see how you do. NEVER HILLARY!!!!!!","commenter_a":"Let's compare resumes, shall we? Hillary Clinton: 9 years, First Lady of Arkansas 8 years, First Lady of the United States 8 years, U.S. Senator 4 years, U.S. Secretary of State Donald Trump: At least 15 failed businesses Owns casinos that have filed for bankruptcy no less than 4 times 0 years in public service Now, if you were looking at those numbers, who would you hire? Who would you trust?","post_message":"While introducing Hillary Clinton at an appearance in Omaha, Nebraska, billionaire Warren Buffett challenged Donald J. Trump to release his tax returns: \"I'm under audit too. I would be delighted to meet him any place, any time. ... I'll bring my tax return, he can bring his tax return.\" @webpagelink"},{"comment_id":"767405186757001","commenter_b":"Get them out of America","commenter_a":"At least she learned some ENGLISH😜","post_message":"WIFE OF MUSLIM Immigrant Screams: “F*CK AMERICA!” After Husband Is Threatened With Deportation For Major Food Stamp Fraud In NY [VIDEO]"},{"comment_id":"857891860915718","commenter_b":"They need more time to assimilate into our culture,not us to theirs...This is America...illegals should not have a louder voice than our country's citizen,or if they are here legally they need to learn the laws of our land and quit trying to change the American way or American dream to suit their expectations.","commenter_a":"I recommend going back to a country where freedom of speech is not something you have to concern yourself with. Otherwise, deal with it. Freedom of speech means you don't get to dictate consequences just because you don't like it...","post_message":"What do you think about this?"},{"comment_id":"1137064162981260","commenter_b":"Mold on the apple","commenter_a":"Grrrrrreat. *head desk*","post_message":"A huge new study has confirmed that we are in the middle of an extinction event, the likes of which hasn't been seen since the dinosaurs went extinct."},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."},{"comment_id":"1553360474683977","commenter_b":"This sellout Hispanic wants to sell you some crappy shirt","commenter_a":"As American hispanics, we are tired of how all of these coward racist liberals that hate America like Obama, Clinton, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, we're supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of our skin... disgusting. That's why we support Donald Trump. Show everyone your support for Trump by buying the fantastic Trump Strong t-shirt at: www.teespring.com/trumpstrong . And let's Make America Great Again! Thank you.","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."}]
