[{"comment_id":"10153847623528812","commenter_b":"Na u should go back to Europe and take inbred fascist friends with u","commenter_a":"Beat it and take Obama too","post_message":"14-year-old arrested after a homemade clock he brought to school was mistaken for a possible bomb will be attending school in the Middle East."},{"comment_id":"1066828243360262","commenter_b":"I agree Diane..... but she is NO Lady!","commenter_a":"are you kidding me lady,Do you not get that Obama started this whole thing between races.there shouldn't be black or white there should be strictly American.","post_message":"VIDEO: Cokie Roberts has apparently gone completely insane."},{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."},{"comment_id":"10154139052147869","commenter_b":"Yes, she should move to Berkeley!","commenter_a":"Backward looking. When was the last time she looked in a mirror ...","post_message":"Another thing noticed in the Wikileaks release of the full transcripts Hillary Clinton’s paid appearances for Goldman Sachs: she described Republicans as “backward-looking” and fundamentally un-American.”  So in addition to being rednecks (according to Bill), people who don’t support her politically are racists, sexists, homophobes, xenophobes and Islamophobes; a “basket of deplorables” who are backward, irredeemable and fundamentally un-American.    So I have to wonder: why does she want to be the leader of all us horrible people?  If she hates everyone who disagrees with her that much, instead of running for President, why doesn’t she just run for mayor of Berkeley?"},{"comment_id":"10154343672430329","commenter_b":"Well said @username. BTW...@username who are you to judge who's a feminist and who is not? Worry about your own backyard and sit yourself all the way down.","commenter_a":"If you think she's a feminist. Please reevaluate your life EDIT: She is the definition of WHITE FEMINISM. She doesn't care about anyone but herself.","post_message":"It sounds like Taylor Swift responded to Kanye West in her Grammys speech: @webpagelink"},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"}]
