[{"comment_id":"10153321006269087","commenter_b":"What fucking jobs are the illegal immigrants are taking dum ass?? Please fucking tell me!!!","commenter_a":"94 million Americans are not working. Is it because they have become dependent upon the government? Or is it because the Illegal immigrants have all the jobs? 30 percent of all federal prisoners are illegal immigrants. Immigrants are killing Americans: According to the Center for Immigration Studies, 57 percent of the 76 fugitive murderers wanted by the FBI in 2009 immigrants entering the country illegally have a criminal record in the U.S.: In 2010, the Border Patrol reported that 212,000 illegals were caught in the Tucson, Ariz., sector alone, and as many as 30 percent of them already had a criminal record in the U.S. The Pew Research Center estimated that there are nearly 12 million illegal aliens in the nation and the key word is \"estimated\". What's wrong with deportation of illegals? The answer is: nothing. The country would be greater without them.","post_message":"\"The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American,\" Hillary Clinton tweeted. \"No, Trump.\""},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"1140721385968332","commenter_b":"I like her filthy mouth. Filthy mouths FTW!","commenter_a":"Hardly a roll model really. She's got a filthy mouth.","post_message":"\"We have to be a role model for these little girls, because who do they have? All they have, literally, is the Kardashians!\""},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"10154889313644411","commenter_b":"Well hes planning to shut alot of military bases around the world, and hes said hes not paying into nato waist of money he said, at the end of the day we all have to wait and see what hes going to do, you never know he might do a better job than all the other so called politicians in the past.....see how","commenter_a":"He has a point, and America needs a business man to balance the books and help the American people.","post_message":""},{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""}]
