[{"comment_id":"1775999165978650","commenter_b":"No","commenter_a":"\"HELL NO \"","post_message":"Is Hillary Clinton America's best choice for president in 2016?"},{"comment_id":"1747479275473588","commenter_b":"Fawwwwwk no cuz that proves a bih can't cook fr😩😩😂😂😂","commenter_a":"@username some shit you'd do😂😂😂","post_message":""},{"comment_id":"10154003948143812","commenter_b":"I know it's late but does anyone have her address?","commenter_a":"Thanks to all that helped i know she was happy","post_message":"8-year-old girl who survived a fire that killed her family receives more than 700,000 Christmas cards from around the globe. \"It really moved a whole community.\""},{"comment_id":"10158211660050725","commenter_b":"Ignorance= a basic understanding in economics.","commenter_a":"All the crying liberals on this feed is enough to make me skip my coffee and still be content at work today.","post_message":"President-elect Donald Trump is poised to take his victory lap today, appearing first in Indiana to salute workers at a factory that he made a campaign promise to save and then in Ohio on the first stop of a \"Thank You Tour\" to honor the supporters in states that gave him his stunning victory."},{"comment_id":"10156595993175725","commenter_b":"WHen u get in there the illegals needed to be rounded up.","commenter_a":"and the winner for tonight is @username","post_message":"It all begins tonight - WE WILL FINALLY TAKE OUR COUNTRY BACK AND MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154809272254714","commenter_b":"Says a female....smh","commenter_a":"Shows the ignorance of those who can't be bothered to do their research at this time in that country...and instead ,waste their energy having hissy fits on issues that are harmless, while they invite the she devil herself to continue destroying them... Mercy...","post_message":"It will cost between $3,000 and $10,000 to fix the damage.  (via Good Morning America)"},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."}]
