[{"comment_id":"10154384594879705","commenter_b":"@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."},{"comment_id":"10156923997390354","commenter_b":"She is a hoe so how do you defend that!","commenter_a":"Gee, imagine Trump doing the same to Cruz and his wife. If you don't want bullets shot at you don't start the war. So low class on Cruz's part to attack Trump's wife. She isn't running for president.","post_message":"Legit?   Here's the side-by-side comparison of the 2 lines..."},{"comment_id":"1227897690610317","commenter_b":"She racis af","commenter_a":"Line your Ass up and get on the Trump 🚌 bus get your no 🚿 showering Ass out the U.S. take your stank mama with you.💩💩💩💩💩💩😄","post_message":"He went in with no shame!  #WSHH"},{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."},{"comment_id":"593124330856614","commenter_b":"@username where did she go?","commenter_a":"I hate Donald Trump, but these idiots are playing right into his rhetoric, and not doing anything but acting like thugs.","post_message":"Watch: Protesters set fire to a Donald J. Trump supporter's hat.  Read more about the San Jose assaults here: @webpagelink"},{"comment_id":"1015593815224063","commenter_b":"impeach","commenter_a":"WORSE","post_message":"This is BRUTAL. Obama and his Zombies will NOT like this POLL. Which answer did you choose? This deserves 50,000K 'LIKES & SHARES!' @webpagelink"},{"comment_id":"10153563758934607","commenter_b":"Are you a democrat? Yes you are. No thanks","commenter_a":"NO.. Cummings supports Clinton.. Anyone connected to her is a NO VOTE..","post_message":"Congressman Elijah Cummings, who announced Tuesday morning that he was backing Pugh, said she has a proven record of passing meaningful legislation not just in Annapolis but during her time on the Baltimore City Council."}]
