[{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"10153242127461680","commenter_b":"Divided Nation? You people talk about a divided Nation? Kids are being harrassed at school for \"appearing\" to be Muslim, some are Indians. Muslim's are of every nationality and not just middle eastern. Donald Trump has created HATE amongst people of a brown tone. That's more than 3/4 of the Nation. You people are scum that support Trump. American Mexican's are being mis-treated too. I guarantee you that Donald Trump will turn this country 3rd world with his talk of our \"wages are too high\" and \"we must COMPETE with wages of Mexico, Japan and China\". YES, he is a 'business man\" and that's why HE sent his own manufacturing jobs out of the U.S. Think, people, think.","commenter_a":"I find it hilarious when Obama is blamed by Republicans for everything under the sun, but now he's being blamed for helping create Donald Trump. That's a stretch, even by Jeb Bush standards. This country has had a bitter partisan divide ever since Republicans decided they weren't going to allow a Democrat to be successful way back in 1992.","post_message":"Not only is Donald Trump a “jerk” in the eyes of Republican presidential candidate Jeb Bush, but he’s also “a creature of Barack Obama.”"},{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who \"Follows\" Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling \"long-held fantasy\" of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  \"It was a bloodbath,\" prosecutor John McKinney said. \"They took this man apart.\"  Read KTLA's story here: @webpagelink"},{"comment_id":"1757450071143314","commenter_b":"Get your foot off the furniture! What an embarrassment she is!!!","commenter_a":"Chewbacca!!!! Lol","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153953096951336","commenter_b":"So according to your logic @username driving home after having a few beers is equivalent to shooting a gun into a crowd of people? Am I understanding you correct? I bet you still believe Marijuana makes people go crazy.","commenter_a":"People who drink and drive should serve prison time. At least a 1to 5 year minimum . And if they kill or hurt someone while driving drunk they should serve life in prison.","post_message":"\"Social media led us straight to this suspect to stop him before he was able to hurt himself or others,\" the Franklin County Sheriff's office said."}]
