[{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10153838559734203","commenter_b":"I said it, these muslims terrorists are disgiusing themselves as refugees, it is time for europe to immetiate Autraleria, keep them in prison like camp, then deport them back to where they are coming from","commenter_a":"bull. shit.","post_message":"A Greek official said the Syrian passport holder whose ID was found on the body of one of the Paris attackers landed in Greece last month on a boat from Syria."},{"comment_id":"10154291212970329","commenter_b":"hahahaha!! for real though!","commenter_a":"Hahaha @username Alyssa Purnell Mimi Zink @username @username","post_message":"oh heeyyyy (via So Relatable)"},{"comment_id":"1815699362041993","commenter_b":"Can't stand that wretched woman","commenter_a":"I was gonna click for sound but then I saw a clip of Tomi Lahren pop up and thank god I dodged that bullet #iamsaved #toliveanotherday","post_message":"Republicans think protesters should just get over it and accept the results of the election just like they did when Obama won in 2008 and 2012  Oh wait..."},{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"10154276223602014","commenter_b":"how many illegals??","commenter_a":"i used to be for getting the wall built then I remembered the movie V for Vendetta.... I do not want to live in a society like that... I will not close myself in only to be controlled under the guise of security and safety... the world is dangerous.. protecting oneself from those dangers is paramount before any wall should be built.. and watch out for your neighbors protect them as well... one day you may need the help....","post_message":"They do not want a wall to be built on their land."}]
