[{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"954404074652647","commenter_b":"Hey boys go check the Negro-in-Chiefs record. Highest deficit of all time Biggest deficit than last 5 presidents combined. Highest sustained unemployment in history.","commenter_a":"how true how true","post_message":"A reality check for our Republican friends...  Thanks to Roy Mark Ramdas."},{"comment_id":"10154522868449087","commenter_b":"Fuck this old communist bastard!!!!","commenter_a":"Your anti Muslim propaganda does that! Trump is anti Radical Islamic Jihadists! Got a problem?","post_message":"Bernie Sanders: \"Trump's anti-Muslim order plays into the hands of fanatics wishing to harm America. Love and compassion trump hatred and intolerance.\""},{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"10153268129696782","commenter_b":"$50 charge on all transfers of money to Mexico. Wall built!","commenter_a":"Since illegals sending money back to Mexico props up the Mexican economy, I would propose a fifteen percent tax on all wire transfers and international money orders bound for Mexico. That alone would pay for the wall in a short amount of time.","post_message":"Mexico won't pay a single peso to help build the bigger border wall Republican presidential candidate Donald Trump is proposing, the country's treasury secretary said."}]
