[{"comment_id":"866091750103560","commenter_b":"What do ya expect Dennis. I go out most days an feel I'm surrounded by backwoods hicks!! It kinda sucks being from a big city","commenter_a":"Its a LED light, idiots!","post_message":"A Tennessee mom claims she saw pentagrams in her kid's school bus brake lights. She says it's a threat to God and parents should be outraged: @webpagelink What do YOU think?"},{"comment_id":"10153645294706756","commenter_b":"why is it people still think illegals vote? they cannot unless they are registered, the only thing the federal gov't requires for illegals is emergency care at hospitals in case of sudden illness or accident, otherwise illegals do not get food stamps or welfare and why would they try to register to vote risking getting caught? some people need to get a new talking points, this one is old and stale","commenter_a":"The Republicans made a conscious decision to go after the angry white conservative male vote with everything they had. Now they get to live with that decision, riding into the sunset as a shrinking regional party based on anger and resentment. A modern version of the \"Know-Nothings\", if you will.","post_message":"To put it one way: \"Republicans have been arguing since 2012 about — do we need to change the pizza or do we need to change the pizza box?\" says David Frum, a former speechwriter for George W. Bush. \"And I think the correct answer is we need to change the pizza.\"  But change, however they want it delivered, has come in fits and starts for the GOP."},{"comment_id":"10153103857862377","commenter_b":"I think a woman who has been victimized should be allowed to regain control of her life. She should not be required to Continue a pregnancy she doesn't want","commenter_a":"But what about the women in those cases! Shouldn't they be in control of their bodies after being violated so inhumanly? Of course they should! I just lost lots of respect for you! You can't make judgements on those women or decisions for them! Someone has to stand up for them!","post_message":"\"Rape and incest, I would not be in favor of killing a baby because the baby came about in that way. And all you have to do is go and look up the many stories of people who have led very useful lives who were the result of rape or incest,\" Carson said."},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."},{"comment_id":"10154563996420575","commenter_b":"Obama had better shut and realize all America wants his ass fried!","commenter_a":"Oh, like he did?","post_message":"WOW! Obama says he hope TRUMP will be able to stand up to PUTIN. ---After getting steamrolled by Vlad for eight years!"},{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"10154440121543525","commenter_b":"ARE YOU WITH NO SIN, MAYBE YOU SHOULD NOT THROW STONES AT GLASS HOUSES. YES MICHAEL JACKSON AND PRINCE MAY HAVE BEEN DRUG ADDICTS, BUT THEY WERE BOTH AN INCREDIBLE TALENT, AS WAS WHITNEY HOUSTON ON THE FEMALE SIDE. SHE UNFORTUNATELY WAS A DRUG ADDICT. BUT SHE HAD AN INCREDIBLE VOICE. BUT ALL I AM SAYING IS LEAVE THE JUDGEMENTS TO GOD, BECAUSE I AM SURE YOU ARE NOT WITHOUT SIN.","commenter_a":"Who cares, he was a drug addict just like Jackson. Both were not exactly someone to look up to.","post_message":"Ten years ago today, Prince performed what's been called the greatest Super Bowl halftime show ever -- belting out \"Purple Rain\" amidst a driving Florida rainstorm. #RIPPrince  WATCH HERE: @webpagelink"}]
