[{"comment_id":"967111676633636","commenter_b":"What a couple of dicks....","commenter_a":"Bigots.","post_message":"It's that important, huh?"},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"10154630388634877","commenter_b":"why is anybody still giving Conway any attention at all, unless it is because she is an alien from another planet?","commenter_a":"Ummmm, maybe because she hasnt done anything","post_message":"Is Melania Trump not getting enough attention for being an immigrant herself?"},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."},{"comment_id":"712674415565701","commenter_b":"Fuck off you nasty hoes.","commenter_a":"Her tale is just the beginning...there's getting ready to be an avalanche of women coming forward...","post_message":"\"His hands were all over me. It was an assault.\" Here, Jessica Leeds of New York tells how a three decades ago Trump raised the armrest separating their seats on a plane and reached up her skirt.  Video by Occupy Democrats, LIKE our page for more. Credit: New York Times."},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"}]
