[{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10154635792157599","commenter_b":"The GOP is better than this. The USA is far better than this. Be bold, represent your district, and stand against the unconstitutional, corrupt administration that has taken office. The administration's actions should be leading Republicans and Democrats in Congress to work closely together and assert power as the legislative branch, rather than acting as an extension of the executive branch. #NoBanNoWall","commenter_a":"Congressman Reichert, I believe it is important to remember that the United States of America is a REPRESENTATIVE republic. As our elected REPRESENTATIVE, please REPRESENT the people of your District. You were elected to REPRESENT the people of the 8th Congressional District of the State of Washington (NOT Donald Trump).","post_message":"Careful vetting to ensure the safety of the American people is the responsibility of the federal government and one I take very seriously. Unfortunately what we saw this past weekend was mass confusion and miscommunication between government agencies and the improper apprehension of people legally allowed to be in the US. I urge the administration to work with Congress on solutions that protect our borders while maintaining our nation's dedication to compassion and religious freedom."},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10152883747411051","commenter_b":"Feel attractive and beautiful? Get out. So a 16 or 18 year old kid gave her that? Sick. Lock her ass up.","commenter_a":"Just wait","post_message":"A teacher who was busted with not one, not two, not three, but four students is now looking at a lot more jail time than she initially realized."},{"comment_id":"10153978615223812","commenter_b":"Go Hillary! 2016!!!","commenter_a":"GO BERNIE","post_message":"Here's what the ABC team is doing in the minutes leading up to the #DemDebate..."},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."},{"comment_id":"870392283014938","commenter_b":"Just deport them","commenter_a":"Let them starve","post_message":"ILLEGAL ALIEN CRIMINALS ON HUNGER STRIKE IN AZ PRISON Give List Of Demands Including Removal Of Threat Of Deportation"}]
