[{"comment_id":"10154033715125329","commenter_b":"Chop chop woman haha","commenter_a":"@username Brittany Suzanne Pink","post_message":"Gilmore Girls could be getting new episodes on Netflix!"},{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"},{"comment_id":"10152624556380667","commenter_b":"He was a true man in every word about iranian government. Thanks Mr President","commenter_a":"America gives you billions, trillions over time and when you include weapons, Iron dome, etc and America does it while American children and American poor struggle and as America infrastructure crumbles, really?????","post_message":"Israeli Prime Minister Benjamin Netanyahu pleaded with Congress  on Tuesday to take a harder line against Iran, saying the nuclear deal being negotiated \"doesn't block Iran's path to the bomb; it paves Iran's path to the bomb.\""},{"comment_id":"10153693958978010","commenter_b":"It only takes an extra 2 hours in pouring rain. Finally home. BTW, Albert Hammond lied lied to us here. But i love that song. IT NEVER RAINS............","commenter_a":"Thanks.","post_message":"Turn on your headlights!  It's pouring outside. Here's a how-to for Southern Californians confused about driving in the rain.   @webpagelink"},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":""}]
