[{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":""},{"comment_id":"10154075360053797","commenter_b":"You know her personal","commenter_a":"Wow look at all these people who would vote for a liar to run this country. What an uneducated bunch.go clear back to Watergate with hillary she is a liar.","post_message":"WOW! Rest in Peace Elaine. She was a registered Democrat and not \"a political person.\" However, her obituary says: \"Elaine requests, in lieu of flowers, please do not vote for Hillary Clinton.\" Her reason is getting a lot of attention. See here:"},{"comment_id":"10154216491251943","commenter_b":"WAKE UP AMERICANS .. This May be the Last Chance American and the American people (voters) have to retain and Guarantee, our American Heritages, Customs and Constitutional Rights .. We need to rid American of the Radical Muslims and Illegals who are here and trying to take over America .. Do You want a Clinton Corrupted Government Controlled Life or a Trump Love America Lifestyle for your Children's Children .. SERIOUSLY - that is the Choice Were making and There going to be Living with .. This is more for our Children and there Children than for US but only WE can Guarantee them a life and Future that we had .. Clinton will be a Disaster for America and all Americans .. Surely you can realize that - listen to the news , ,LISTEN .. WE THE PEOPLE - need to Bring back GOD, COUNTRY AND CONSTITUTIONAL FREEDOMS to ...","commenter_a":"Burn the witch!!!","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law!  Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"1357571687635909","commenter_b":"Kidult fan!","commenter_a":"That's what the fans should be saying to you","post_message":"Don't get us thrown out of Euro 2016"},{"comment_id":"1281382285238371","commenter_b":"Well said. If this Jolie live in Muslim country like we do ,then her opinion about Islam will radically change. She should know the Muslim will never compromise with others..stupid","commenter_a":"I don't listen to rich new world order liberal fucking wackos. If the come out and try to tell us all to do something. Its never ever good. This Bitch is rich living in nice safe places. Safe from the hell the rest of us would have to deal with","post_message":"DOES ANYONE CARE WHAT THIS LOSER HAS TO SAY?"}]
