[{"comment_id":"573149506180643","commenter_b":"They don't get nearly enough credit. Donald is right....stop them from entering the U.S. temporarily. We are in danger.","commenter_a":"Obama will probably have him fired for roughing up a terrorrist.","post_message":"Federal Agent Risks Everything To Stop ISIS Terrorist Disguised As Refugee From Setting Off Bomb In Texas  This man is a hero. Let's show him our support.  Can we get 50,000 'LIKES' for this federal agent?"},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"\"Will you go out and pick the strawberries?\"  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"884398511671457","commenter_b":"This woman is an absolute idiot","commenter_a":"Love to see you going to jail have a nice day by by.","post_message":"The message of Hillary Clinton's victory speech last night could not have been more different than Donald Trump's. Whose message is better for the country?"},{"comment_id":"1868657266690469","commenter_b":"Talking about Melanie trump class haha she need a pole and dancing,center for the entertainment industry.","commenter_a":"She is such a beautiful person, so graceful and such class she brings to the WH, something g we Havn't had in several years.. What a great change","post_message":"Michelle Obama doesn't think Melania is fit to serve as First Lady.  'LIKE' if she's WRONG!!!"},{"comment_id":"419169165087070","commenter_b":"@username nobody wants your Ukranian ass here either. Plastic bitch.","commenter_a":"People with Green cards and visas are also being denied access. So don't tell me it's about \"coming here legally\" This is a hate based act. Period.","post_message":"This significance of the court's ruling and the power of protest cannot be overstated.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."}]
