[{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"10154330799961756","commenter_b":"Not true she's probably going to make more blackmailing than having sex eventually","commenter_a":"Why do you do this, it will never go away, it is a fact of our lives. Make it legal, tax it and provide health regulations~","post_message":"Clients will be fined about $1,700 for the first offense."},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"10154576312191037","commenter_b":"@username so if they agree with Her hatefulness that will make them good people? You must have drank her kool-aid","commenter_a":"Most disgusting, despicable woman in America. She and Drumpf are the perfect, hateful, ugly pair that embody everything wrong with the US.","post_message":"She previously called him an \"angry Muslim with a thick accent.”"},{"comment_id":"446887825521787","commenter_b":"Brake down that Wall Pope. Take some muslim refugees in. Oh that's right, Vatican wall built in the 800 century to keep muslims from killing you. Now it's ok if muslims kill Americans.","commenter_a":"a huge wall around the Vatican, not to mention armed guards. Donald Trump is the only one who wants to protect Americans. The Democrats would let this country run wild. Turn it into a third world country. Pope Francis is not sounding very Christian to me.","post_message":"Thank you Franklin Graham."}]
