[{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"10153380246347217","commenter_b":"Gotta look for the soundtrack","commenter_a":"Ly try it","post_message":"Meowvellous! 🐈"},{"comment_id":"10155438408395354","commenter_b":"If she had a brain, she would be dangerous","commenter_a":"she can also take credit for being a slut.","post_message":"\"sooooo bad a$$ Senator Cottons voicemail box is fulllllllllll!\"  ....we didn't forget the apostrophe, Miley did."},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"10153445751101782","commenter_b":"for the people that want abortions i ask you one question why did you allow yourself to get knocked up in the first place?","commenter_a":"Thank God!","post_message":"Gov. Mary Fallin has vetoed Oklahoma's anti-abortion bill."},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"}]
