[{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"1781276175448687","commenter_b":"And she wants to spend her last dying days being president? Really? Think please!!","commenter_a":"Make it sound as bad as you can, @username, you always do.","post_message":"JUST IN: Hillary Clinton was diagnosed with pneumonia on Friday, her doctor says. The doctor revealed the condition hours after Clinton stumbled while leaving a 9/11 event. @webpagelink"},{"comment_id":"10153759258966694","commenter_b":"Do not compare this to GOT...or dr who....or any other shit please...","commenter_a":"Oh, gee, you don't really mean it's going to make my brain explode, do you? Like The Walking Dead was supposed to make my BRAIN EXPLODE, and Game of Thrones was supposed to make my BRAIN EXPLODE, and Dr. Who was supposed to make my BRAIN EXPLODE...Seriously, how much did Raimi and Co. pay you guys to headline Ash vs. Evil Dead as an exploding-brain event? Because, you know what? Every time @username claims some stupid TV show will \"explode your brain,\" viewers barely end up with a BRAIN TWINGE. So instead of over-hyped praise, why don't you guys try something different? Something along the lines of: \"WE SAT THROUGH THE FIRST EPISODE OF ASH VS. EVIL DEAD AND WE DIDN'T GET CRAMPS IN OUR ASS.\" In short, Lower Expectations = More Pleasurable Viewing Experience. You're welcome!","post_message":"Ash vs Evil Dead is going to make your brain explode in the best way"},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"10153953664426509","commenter_b":"They will invade us with mountain goats!","commenter_a":"@username so scared ..lmao","post_message":"North Korea threatened the U.S. with attack if military exercises are conducted as planned. Get details here: @webpagelink"}]
