[{"comment_id":"1820354578210881","commenter_b":"She can't be lazy.....she must spend most of her time on her back with her legs open !!","commenter_a":"She needs to close her legs","post_message":"(But she still manages to spend £20 a week on cigarettes)"},{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"10152957045101316","commenter_b":"that is why... Joran","commenter_a":"\"Messing with our veines/immune system, why?\"","post_message":"#Vaccine industry attempted bribery of #Disney, #ESPN, Oprah and CNN: @webpagelink"},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."},{"comment_id":"10153516568789087","commenter_b":"Muslim is not a religion it describes someone who worships Islam. Guess what ISIS stands for? Its the radical group of Muslims you understanding? Its a Muslim group of people that engages in terrorism. Trump wants to ban Muslims from coming here and he wants American Muslims to help us sort out who is good or bad.","commenter_a":"How is Trump a white supremacist? He has never said anything racist okay \"illegal\" is not even a race. Trump has said millions of times he supports immigration. What he does not support are people that are dangerous getting free cards to come here. Also to those who say illegals don't use Government assistance they do. They fucking come here have an anchor baby and then use the babies citizenship to get Government assistance. We have a serious problem I have a Mexican friend who is American with perfect credit and great job. She tried to buy a house and got told no. Guess what same house and a family both illegal except their 2 girls bought the house. How is that fair to anyone? Illegal immigration impacts Mexicans who are already here legally and it's not fair to them if others cheat the system. If you are so damn ...","post_message":"“I would certainly return it if you think it is appropriate,” Donald J. Trump told a voter who asked if he would return the donation he received from noted white separatist William Daniel Johnson. “I would return it. Don’t be so angry, I don’t even know who he is.”"},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"\"She should get an award from them as the founder of ISIS,\" Trump said Wednesday."}]
