[{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"10153203916923984","commenter_b":"Stand By Him- Military knows they are the boss-but a chaplain has an higher boss. Military should not let this man go.","commenter_a":"Why only a 1 month assignment as assistant? Is that the norm? Missing pieces of this story.","post_message":"This highly decorated vet and former SEAL chaplain is facing something unexpected after 19 years of service...  Do you stand by this lieutenant commander?"},{"comment_id":"1267665493274190","commenter_b":"Well Dana maybe if us \"poor white Trump supporters\" didn't have to pay so much in taxes to support all the welfare democratic trash (of all races) and all benefits for the illegals we would be able to live more the style of the freeloaders or better!","commenter_a":"lindo","post_message":"We are going to build a wall - and make America SAFE again!"},{"comment_id":"10153233251546350","commenter_b":"No she don't she is a young hoe. Celine is why better the Ariana Grande","commenter_a":"I don't think so! Her voice lacks the richness of Celine's.","post_message":"Ariana Grande's impression of Celine Dion is spot on!"},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is \"seriously interested\" in running for president in 2016."}]
