[{"comment_id":"1725002974382878","commenter_b":"Send this fool to the hangman to show that that USA won't put up with this crap, my husband post this","commenter_a":"obama 's sons if had them","post_message":"These disgusting Donald J. Trump-haters showed up to protest Trump as publicly and obscenely as possible.  And part of their protest was a SICK demonstration involving the American flag.  But before they could finish, they heard a voice give 1 order they never expected to hear..."},{"comment_id":"10153789938206680","commenter_b":"yes there is, put her in jail.","commenter_a":"Former \"Bush\" defense official??? Go figure!","post_message":"The United States' adversaries, James Clad says, \"must never hear flippancy or ignorance in America’s voice.\""},{"comment_id":"823419914360098","commenter_b":"Never,never forget the countless acts of murder she committed by her acts against her brothers and sisters!","commenter_a":"I work hard at forgiving. I just can't forget. God told us in order for us to receive forgiveness, we must forgive. That is a tall order in this circumstance. I am trying. It is up to God to cleanse her of this deed. I had to turn it over to him. I still will not watch any movie or show she is on or in.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos.   What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"1201785943175748","commenter_b":"The unvaccinated will always be a problem...you know why? Because you're all fucking dumb as shit! That's why.","commenter_a":"From another article. It's not the unvaccinated that started this. It's the vaccinated. \"The WHO said the two cases were in the southwestern part of the country -- bordering Romania, Hungary, Slovakia and Poland -- and that the strain responsible, vaccine-derived poliovirus type 1 or cVDPV1, may still be a threat to the region.\"","post_message":"Vaccinate your kids folks."},{"comment_id":"10152757562815950","commenter_b":"Who really gives a fuck!! Fuck em both bitches!!!","commenter_a":"Kind of skips the part where police tell the suspect to comply . On the other hand ,it avoided death by cop gun.","post_message":"The police chief said the officer who hit the suspect with his car at full speed made a \"tough, tough, tough decision\" that probably saved lives."},{"comment_id":"10150859256639999","commenter_b":"What a great joke....I mean choice for first woman president! Way to be a role model for young thugs of this great nation! Proud non supporter of the most despicable woman in the world! Rot in prison and may you get your soul back from satan! God bless America and God bless the American dream!","commenter_a":"She'll have plenty of time to read in prison!","post_message":"\"She’ll drop everything for a few minutes of blowing kisses and reading Chugga-Chugga Choo-Choo with her granddaughter,\" Chelsea Clinton said of her mom."},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."}]
