[{"comment_id":"10157399464465093","commenter_b":"A hun will never kill anyone! Its the people that use them! People kill people! Criminals get them illegally and you can't stop that! It is not possible! Give me a reason why you think criminals should only have guns?","commenter_a":"Yes but 100% of gun crimes involve guns, so start with the legal gun owners because it's way easier, and it looks like we're doing something.","post_message":"Pass it on."},{"comment_id":"1136168619776218","commenter_b":"Now he knows what she's capable of. Either he dumps her now and risk her wrath, or stays on knowing he'll be culpable for any harm perpetrated against a woman he cheats with.","commenter_a":"Throw them both off, it takes two to tango, at the end of the day though its best you know sooner rather than later if he/she is a no good for nothing cheat, cheating on your partner is the worst kind of betrayal, you're better off without them","post_message":"Don’t mess with my man!"},{"comment_id":"10153416483736162","commenter_b":"Her heels are scratching up the scoop and that just kills airflow efficiency!","commenter_a":"ALL OF US have pictures like this.","post_message":"A Chicago flight attendant for Spirit Airlines is in trouble for some photos taken on the tarmac at O'Hare Airport @webpagelink  For the stories you care about - \"Like\" ABC 7 Chicago!  Instagram.com/abc7chicago"},{"comment_id":"10153497527962464","commenter_b":"@username Add me..","commenter_a":"from Egypt we Love you. And we will redeem you, Mr. President.","post_message":"Headed into the #GOPDebate. Join us at 9pm ET on Fox News and tedcruz.org/debate"},{"comment_id":"10154513663831051","commenter_b":"A bitch will always be a bitch","commenter_a":"I am sorry, what is her position in the administration? Oh right nothing.","post_message":"This photo of Ivanka Trump is sparking tons of controversy after people realized something about what's right there in plain sight. Look closer."},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"1003201996389936","commenter_b":"Melissa Missael","commenter_a":"Merly Vivanco Albert Perez what a joke Ben Carson is. Lol.","post_message":"This one is for those who ever doubted Trevor Noah's ability to fill Jon Stewart's shoes."}]
