[{"comment_id":"943744942348702","commenter_b":"To those of you who think the federal government can raise incomes do yourself a favor and take an economics class. And pay attention.","commenter_a":"Someone please perform a partial birth abortion on this woman.","post_message":"\"The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans so they can afford a middle-class life.\" Read Hillary's ideas for the economy in her own words:"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"347098928826955","commenter_b":"Liars never apologize! They wouldn't know how.","commenter_a":"Not only are they lying but they are racist as well! They hate white people!","post_message":"Lies www.eaglerising.com"},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the \"freedom\" .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."},{"comment_id":"1508167409203284","commenter_b":"They'd kill all the children if it possibly meant no adult terrorists.","commenter_a":"Build them a safe place in their own country!!!","post_message":"“Every now and then, I’ll get a bad Skittle – but I don’t ban them all.”   - Rep. Luis Gutierrez made a dig at Donald Trump Jr.'s tweet about refugees and Skittles by chewing on the candy during a House Judiciary Committee hearing.   Read more here: @webpagelink"}]
