[{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"604670086348434","commenter_b":"Like that, tbh","commenter_a":"He has the face a typical Republican Tea Party red neck. A Trump voter perhaps who will be voting in jail, if he is allowed. Disgusting asshole punching a physically disabled child.","post_message":"This guy gets my vote for Biggest Jerk of the Holiday season. --Andrew"},{"comment_id":"10152934239186336","commenter_b":"If O had a son!! Hold the phone he would have to be heterosexual!!!","commenter_a":"Home grown terrorist!","post_message":"A former taxi driver from Virginia has been added to FBI's list of most-wanted terrorists."},{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"},{"comment_id":"693348717485384","commenter_b":"Someone beat his ass.......again.","commenter_a":"A disgrace to the American oeople...Harry Reid you are way, way past your usefulness, so why don't you just go home","post_message":"SEN HARRY REID (D) UNLOADS ON THE SENATE FLOOR HATE SPEECH AGAINST TRUMP (VIDEO)  @webpagelink"},{"comment_id":"10157833326000093","commenter_b":"The most hated woman in the world !","commenter_a":"Time to put the Clintons and their never-ending, gross and creepy scandals out to pasture.","post_message":"The Clintons and their minions deserve to be driven from public life."}]
