[{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10154148875398721","commenter_b":"Vagitarian: when you vote for her because she has a vagina.","commenter_a":"In your lying phony dreams","post_message":"For many older women, voting for Hillary Clinton on Tuesday is about making history."},{"comment_id":"10152879286473961","commenter_b":"Only ridiculous and delusional if you think like a liberal Democrat.","commenter_a":"We've had 6 years of progressive liberal foreign policy. It can be summed up as alienate our allies, embolden our enemies, abandon our gains and weaken American prestige throughout the world. Obama has managed to squeeze this in between rounds of golf.","post_message":"It’s time for progressives to outline a coherent, proactive foreign policy vision. Check out my op-ed on Medium where I share my ideas and add yours at www.chanceforpeace.org."},{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":""},{"comment_id":"10154373369462042","commenter_b":"I like Hillary. Good luck Hillary","commenter_a":"Love and support my President and #ImWithHer...","post_message":"President Barack Obama and Hillary Clinton make their first joint campaign appearance in North Carolina."},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"}]
