[{"comment_id":"10152797657587144","commenter_b":"Those \"additives\" include vitamins and minerals. I'll take it.","commenter_a":"Oh yeah, I just remembered why I unliked @username in the first place.","post_message":"\"A jug of almond milk containing roughly 39 cents worth of almonds, plus filtered water and additives, retails for $3.99.\""},{"comment_id":"10153174046691336","commenter_b":"Then stand up and stop him!","commenter_a":"Annddd. What do you intend to do about it? We're waiting.","post_message":"\"Presidents have the ability to take executive action, but they don’t have the ability to change the law.\"  House Speaker John Boehner said that President Obama clearly overreached with his executive action on immigration and changes to ObamaCare on Sunday Morning Futures with Maria Bartiromo."},{"comment_id":"10154858254049497","commenter_b":"Hopefully, I last a little longer than 24 hours. 🤔","commenter_a":"@username :) Honestly, I admire this about you. You explore things and excel at them. But it's just kinda funny.","post_message":" crazy. He throwing himself into cooking and collecting vinyl when he only had his microbrewing kit 24 hours."},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."},{"comment_id":"10153472677806051","commenter_b":"Ugly and a moron. She'll make some desperate man really happy","commenter_a":"😳😱","post_message":"This model decided to remove six ribs to look like Jessica Rabbit. Now she's facing the consequences."},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."}]
