[{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"677232809133964","commenter_b":"The scumbag needs to be fired .... then she needs to be stripped of her teaching certification!!","commenter_a":"Fire her.","post_message":"This teacher threatened her student if they didn't submit to her beliefs.  She has absolutely no right to try and dictate what her students believe.  Do you think this teacher should be fired immediately?"},{"comment_id":"404934952964433","commenter_b":"We will be screwed with either of these two jackasses!","commenter_a":"I hope I never hear of either ever again","post_message":"Will Jeb Bush face Hillary Clinton in next year's race for president?"},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."}]
