[{"comment_id":"1131210870268774","commenter_b":"We don't care!!! So don't vote for her and fly off to your birdie page! HILLARY FOR PRESIDENT!","commenter_a":"I am a DEMOCRAT and Hillary does NOT have my vote in the Presidential Election. @webpagelink","post_message":"In 1990, American explorer and marine biologist Sylvia Earle became the first woman chief scientist at the National Oceanic and Atmospheric Administration (NOAA). For nearly six decades, she has led an international community of scientists in the study, protection, and restoration of our planet's marine life. Her unyielding curiosity and commitment to reversing the effects of climate change are a source of inspiration for environmentalists worldwide. Thank you, Sylvia."},{"comment_id":"1787942078130672","commenter_b":"It's a good thing you are there, because you have no idea how evil and vile that woman is.","commenter_a":"I'm not from america , i live in morocco , but i hope from the bottom of my heart for clinton to win and she really deserves to be the president of the white house because if trump was elected he is gonna make america a hell place on the planet earth","post_message":"Barack Obama was elected the 44th President of the United States on this day 8 years ago."},{"comment_id":"1102356133153121","commenter_b":"dumb bitch","commenter_a":"Yooooooo I Knew She Was A Tranny!!","post_message":"‘I Stand Corrected:’ Wendy Williams admitted fault and apologized for her remarks about HBCUs.  Williams spoke with Roland Martin on Thursday's edition of The Wendy Wiliams Show where the NewsOne Now host eloquently summed up America's troubled past of slavery, segregation, and the oppression of African-Americans. WATCH the discussion and the NewsOne Now recap -> @webpagelink"},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"473377599519487","commenter_b":"Leave the man alone. That goes for all you Muslims.","commenter_a":"He will never back down and kiss their butts he's not Obama....","post_message":"Muslims want Clint Eastwood's head, but he's not backing down.  This is outrageous, let's show him we have his back.  Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1813062615599826","commenter_b":"She was good at taking separate vacations and other unnecessary trips at taxpayer expense!","commenter_a":"Yes","post_message":"Yes or no: Was Michelle Obama a good First Lady?"}]
