[{"comment_id":"10153828561639369","commenter_b":"You know all people do is speculate as to what happened but there was clearly better ways to handle this situation then to get your own self in trouble and have your whole neighborhood thinking there is some psycho out there. No the kids shouldn't be doing that kind of stuff but why would a grown woman behave that way over some toys and trash.","commenter_a":"This woman didn't handle this situation well at all. That being said, don't parents teach their children what respect is any more??","post_message":"News of the weird....   An anonymous threat said, \"The children look delicious. May I have a taste?\""},{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"10153992733094726","commenter_b":"Beautiful, smart elegant lady","commenter_a":"Let Ivanka rest for a while . she will have a new Baby soon .","post_message":"Trump's wife Melania steps into the spotlight, joining his daughter Ivanka"},{"comment_id":"10152979635977483","commenter_b":"Then ban the naacp bitch","commenter_a":"This flag was specifically adopted In response to the civil rights movement.. the confederate flag should be banned across the u.s point blank period","post_message":"\"Just by the outpouring of support I've gotten from all over the world, I know for a fact I'm doing the right thing,\" said Belinda Kennedy, owner of Alabama Flag & Banner."},{"comment_id":"10153270822682061","commenter_b":"My neighbors steal them!","commenter_a":"I had a neighbor take mine. To prevent it from getting stolen. I'm glad I had neighbors watching out for me.","post_message":"WATCH: 'Bait packages' used to catch thieves stealing deliveries from front doors. What is being done to stop this from happening as we enter the holiday season: @webpagelink"},{"comment_id":"10153964436169705","commenter_b":"@username but did he attend the funeral for Lady Bird Johnson? Gasp.","commenter_a":"Obama will probably attend HIS funeral!","post_message":"The co-founder of the annual South by Southwest festival Louis Meyers has died."},{"comment_id":"10153483892683690","commenter_b":"Hello all indians! U stop nestle then stop modi too for supporting israel. Huh!","commenter_a":"Pay the bribe...","post_message":"The company insists \"Maggi noodles are completely safe and have been trusted in India for over 30 years\"  @webpagelink"}]
