[{"comment_id":"10153222530101167","commenter_b":"Ken, We still don't have all the emails she deleted several so we really don't have the entire story. But if we did get anything on Obama that would make Impeachment even better.","commenter_a":"They need to close down the Benghazi Committee and put those resources to the Hillary Email scandal.","post_message":"Stunning news: It's not just that Republicans are using the committee to launch partisan attacks on Hillary Clinton. The committee is also accused of illegally retaliating against an active duty investigator."},{"comment_id":"943618162339946","commenter_b":"^ What an asslicking, apologist bitch.","commenter_a":"It's his fathers fault.... He had warrants and ran.... Then tried to run over police.... Look up the story before u believe this wack ass page- that boys father deserves to be charged with murder","post_message":"Courage, bravery, hero, protect, serve... These words are not affiliated with the cops who killed this boy.   Full story → @webpagelink Police The Police | Filming Cops"},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""},{"comment_id":"10153090646372411","commenter_b":"omg it's getting old","commenter_a":"Madisen AndCody LMFAO! I'm not surprised are you?!?","post_message":"BREAKING NEWS: Chicago Bulls Derrick Rose was injured in practice today after taking an elbow to the face.  He will undergo surgery tomorrow. \"After the procedure, a timetable for return to play will be determined,\" the team said."},{"comment_id":"10153150009791037","commenter_b":"They will bitchhh","commenter_a":"USA ... root cause of evry problem in world!!!","post_message":"#NorthKorea fired two short-range ballistic missiles into the sea and vowed \"merciless\" retaliation as the U.S. and South Korea kicked off joint military drills denounced by Pyongyang as recklessly confrontational."},{"comment_id":"10153922019898812","commenter_b":"Anyone but Hillary!!","commenter_a":"The only thing I fear is a Republican getting elected in 2016","post_message":"President Barack Obama: \"We cannot and we will not succumb to fear.\" @webpagelink"},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take \" street drugs\" have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are \"self-medicating\" themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their \"customers\" died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"}]
