[{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."},{"comment_id":"795368217263025","commenter_b":"I'd go and break it off in her ass, show the Bitch who's Boss","commenter_a":"I think if they are seriously considering removing her, an independent moderator, because Trump backed out of the debate and their worried about ratings, then I think all of this proves what a sham these debates all are. #StandwithRand","post_message":"Should she be removed?"},{"comment_id":"10153639008667098","commenter_b":"Down the street prima","commenter_a":"@username @username not near you guys?","post_message":"WOAH, that's a big sinkhole. It's over in Madera near Fresno and it's almost 20 feet deep.   Read more: kron4.com/2016/04/12/video-giants-sinkhole-swallows-street-in-madera/"},{"comment_id":"10153405844391955","commenter_b":"Cruz is a phony with his evangelical persona","commenter_a":"Trump's record makes him look like the flip flopping, inconsistent political opportunist he is. The right personality and talking the way we like without looking at policies, are the criteria the Democrats selected Obama in 2008. Donald Trump has supported a net worth tax, 35% tarrif, he supports amnesty and a path to citizenship, \"because there are jobs Americans just won't do,\" He's donated to clinton Pelosi & Harry Reid, and has said Bush is the worst president ever. He's a RINO and a caricature of a conservative inartfully voicing every failed mudsling of the left against conservatives. Ted Cruz is a world class debater, with a nearly perfect record who takes on both Democrats and spineless Republicans. He has all the positives and then some without the negatives of Trump. #TedCruz2016 @webpagelink","post_message":"NEW 'SILENT MAJORITY'"},{"comment_id":"1879546605644644","commenter_b":"She should be in jail","commenter_a":"How is she any different that a Timothy McVeigh home grown terrorist?","post_message":"Ugh"},{"comment_id":"1012584022097710","commenter_b":"Yes, it is so obvious, but people in general are very ignorant, they think it will never affect them. Well, it is already affected them in America, in Europe and elsewhere. The Muslim radicalism is taking over the World and nobody cares! Israel is the country that knows what is all about and suffers from constant terror and constant criticising from the stupid World leaders who sold their countries, the culture and civilisation of thousand years to savages.","commenter_a":"Key Positions in our government ! @webpagelink/ CANNOT TAKE THE CREDIT FOR THE BELOW. REPOSTING To President Obama: It was you who told an Islamic dinner - \"I am one of you.\" It was you who on ABC News referenced - \"My Muslim faith.\" It was you who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. It was you who wrote that in the event of a conflict -\"I will stand with the Muslims.\" It was you who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" It was you who bowed in submission before the Saudi King. It was you who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. It was you who exempted Muslims from penalties under Obamacare that the rest of us have to pay. It was you who purposefully omitted - \"endowed by our Creator\" ...","post_message":"Ignorance isn't bliss if it's harming people..."}]
