[{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"897302730329476","commenter_b":"and youre famous for? ABSOLUTELY NOTHING","commenter_a":"It's funny how Your ugly dress made you famous more than your music did !","post_message":"#thedress girl speaks: 'It's madness. I feel like I'm living in a dream'"},{"comment_id":"976055745789876","commenter_b":"Load these pos up and ship them back to where they crawled out from under a rock!","commenter_a":"If things in this category really get bad, just like an ISIS, looking at the black white demographics in the U.S. these guys could be in big trouble if there is ever a major backlash revolt.","post_message":"Woman planning F*ck Your Flag Day on 9/11 says,  White People Must Die (VIDEO)  @webpagelink"},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"973103659397159","commenter_b":"Those girls have shallow, ugly, pugnacious souls. All that effort they put into making their hair into rat's nests would have been better spent reading something other than grocery store gossip rags.","commenter_a":"It's really frightening to see, how intolerant and religiously fanatic people can be. I can't see any difference between Christian or Islamic fundamentalism. Both are as dangerous and frightening. It's really sad, that people will believe more in something people has written ages ago, instead of in the scientific facts we have nowadays, and that they will judge people according to some moral standards from the Middle East (by the way the same moral standards as in Islam), instead of thinking for themselves. And before anyone says the Bible is God's word, show me ONE sentence that is written by God, or Jesus, or even anyone living at the same time as Jesus. There is no such sentence.","post_message":"George Takei says it right. Let's \"kick the ick\" out of our public discourse!"},{"comment_id":"10153046924231519","commenter_b":"@username, when has Ann Coulter ever told the truth?","commenter_a":"I cannot stand the mind of Ann Coulter or the things that she says. But the personal attacks don't add anything to the argument. There's plenty of solid evidence to dispute among the things she says and has written. \"Old and sad,\" \"horse face\" and other things don't contribute to the discussion. They make the left look as bitter and unreasonable as the extreme right.","post_message":"This debate is a perfect example of how right-wing \"facts\" make their way though the delusional echo chamber..."}]
