[{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"1489236791096346","commenter_b":"Only 7% of the illegal aliens work in the fields, most work in the construction jobs, fast foods etc etc. 95 million unemployed americans need jobs, deport all illegal aliens and open up jobs for citizens not criminals.","commenter_a":"Hey Trumppets if you need a job...go apply in the fields....there's always jobs available! You got a teen that needs work, send them to pick out in the fields....give them those American jobs you ppl keep claiming immigrants are taking away!","post_message":"Donald J. Trump doubled down on his stance on immigration this week. Here's a breakdown of U.S. immigration by the numbers.  Read more about Trump's immigration speech: @webpagelink"},{"comment_id":"1769292306444953","commenter_b":"With you in that thought...sad but so true. In jail all his basic needs would be met and even medical. Sad we treat jailbirds better than the homeless.","commenter_a":"Imagine if he'd actually been trying to steal the food so he could go to jail and have a roof over his head and food in his belly. But good on the judge anyways for showing some compassion in a world that is lacking these days.","post_message":"A bit of compassion in the courts can go a long way."},{"comment_id":"10154668676208797","commenter_b":"Never mind iam deaf ok that women did it .she just want money ok .","commenter_a":"I don't think johnny deep do that is her she pull her safe for money johnnydepp money I don't like her .is no alway he did her . Johnny Depp don't get married and he have his life .","post_message":"'I LIVE IN FEAR': A judge has ordered Johnny Depp to stay away from his estranged wife after she accused him of repeatedly hitting her during a fight, leaving her face bruised."},{"comment_id":"10153209922201491","commenter_b":"Yes, let's leave the talk up to celebrities. Why should parents teach their kids anything? Brilliant, world.","commenter_a":"Admins, please contact me through inbox messages","post_message":"Jessica Biel: \"We want girls to know what their [body is going through] so they don’t feel scared or ashamed or gross.\""}]
