[{"comment_id":"974532882587184","commenter_b":"Yeah but what are you going to do about your wife?","commenter_a":"Me too def on the pedophile down low","post_message":"Welcome to this crazy Christian Dad's painfully awkward attempt at sex-ed."},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"10153706067582490","commenter_b":"tell them to come get they're money!!!!","commenter_a":"please remember they hold 46% of our debt right now, sure dont to piss off the banker","post_message":"SENDING A MESSAGE: The Navy plans to send a warship to directly challenge China's recent aggression."},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"\"How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?\""},{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."}]
