[{"comment_id":"1713198075600647","commenter_b":"CRIMINAL WOMAN FOR JAIL!","commenter_a":"Some people in the USA will say anything to keep a woman from becoming president. The most investigated woman in US history has no charges against her, no trial coming, and no convictions. This is the definition of not guilty, and yet so many continue to make accusations! Trial by rumor and innuendo!","post_message":"Americans don’t need conspiracy theories and pathological self-congratulations like those offered by Donald Trump. We need leadership, common sense, and concrete plans."},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":""},{"comment_id":"10153264300638433","commenter_b":"Ladies, please, you're both pretty.","commenter_a":"Hillary would say: what difference does it make!!","post_message":"We look at what readers have to say about our fact-checks of Hillary Rodham Clinton. What do you think? @webpagelink"},{"comment_id":"464367687084172","commenter_b":"Please be specific and truthful. Trump is only against ILLEGAL immigration. Trump is only calling for a temporary hiatus on muslim immigration until we can ensure that terrorists aren't taking advantage of the opportunity to come to America. Otherwise peddle your bs somewhere else.","commenter_a":"And of course Trump said nothing of the sort. Bernie is a liar, plain and simple.","post_message":"Watch Bernie Sanders's explanation for Donald J. Trump's rise. -------- Read more on the third Democratic debate: @webpagelink"},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10154633798866729","commenter_b":"Jamie i am totally sober at all times Jamie…..maybe you are on drugs for believing she is not an Evil Satanic Whore who laughs at Raped 12 year old Girls when she knowingly defends their guilty Rapist ?","commenter_a":"Many in the FBI still do love this country very much and are NOT blind followers of Obama and his Anti American Commie nonsense….it would be a good tactical move to wait till Hillary is nominated as the \"Head Liberal Witch\" before they Arrest her and burn her at the Stake ( like we are all praying) happens on live TV so we can rub one out while watching her salty tears run down her Reptillian Alien face.","post_message":"Finally, the end may be near..."},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"}]
