[{"comment_id":"903785579812018","commenter_b":"OH BUT HE\"S BLACK HE DON\"T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"588617174663431","commenter_b":"Hillary Clinton is a criminal!","commenter_a":"Republican's are the enemy of millenials. They have been ruining America since before we were born. It's time to vote blue and vote for Hillary. We need to stand up against hate and bigotry. #Hillary2016","post_message":"\"And believe it or not there are even some Republicans in Congress who have already said they want to start the impeachment process,\" President Obama says."},{"comment_id":"1700724426879591","commenter_b":"Fuk Oprah. She had her run and time. Its over now. Another billionare who knows whats best for others. Sit down and shut up Oprah.","commenter_a":"Is Oprah muzlim Is whoopie they sure fighting for them hard and they killing all American people plus Christian people","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10153059782796770","commenter_b":"She's a lier","commenter_a":"She is a crook always has been!","post_message":"Hillary Clinton: “I have gone further than anybody that I’m aware of in American history … to try to be as transparent as possible”"},{"comment_id":"557200064439948","commenter_b":"I think Donald Trump was building a wall for the excess humans.","commenter_a":"okay so you are planning to eliminate mosquitoes .. do u have any plan what you guys are going to do with the hundreds and thousands of excess humans?","post_message":"\"Eliminating mosquitoes could leave predators without prey.\""},{"comment_id":"10153054490024877","commenter_b":"This woman proclaims her ignorance every time she opens her mouth. She would do better to be seen and not heard.","commenter_a":"This thing has no soul. Fox News is her God & it dictate that,she say the most outlandished comments.There is a special place in hell for her. #Judgement day is coming soon.","post_message":"Ann Coulter on black protestors: Haven’t we done ‘Enough’ to make up for slavery? And that's just the beginning of what she has to say.   Grio fam, this video clip is controversial to say the least. Check it out and sound off below!"},{"comment_id":"1048840968488441","commenter_b":"Or is the environment of higher education overwhelmingly dominated by dogmatic liberal and neo-progressive worldviews, while openly and often aggressively shunning anything resembling \"conservative.\"","commenter_a":"You're imposing some causality here, @username... Does education make people more liberal? Or do people with liberal tendencies put a higher value on education?","post_message":"One possibility might be the growing numbers of women (who tend to vote for Democrats more than men) getting college and advanced degrees."}]
