[{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"},{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"},{"comment_id":"1080222498699420","commenter_b":"#FuckYouHillary","commenter_a":"This old fool is the one who needs work , Go Home Bernie it's over !","post_message":"The Democratic Party must go on record in opposition to holding a vote on this disastrous, unfettered free-trade agreement during the lame-duck session of Congress and beyond. If both Clinton and I agree that the TPP should not get to the floor of Congress this year, it's hard to understand why an amendment saying so would not be overwhelmingly passed."},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"}]
