[{"comment_id":"10153993590153203","commenter_b":"Well, Sharon, I'll tell you what. I don't know a lot of women who regretted NOT aborting their baby. I know quite a few women who DID regret aborting their baby. And I know a lot of judgmental, intolerant women who pronounce when they think another woman SHOULD have had an abortion. That, and Margaret Sanger's avid stance on eugenics, says a lot to me about who is pushing the abortion agenda and who is falling for their bs.","commenter_a":"I was assaulted & I chose to keep my baby. For me I only had 2 choices either A. Keep her or B. Put her up for adoption. Killing my baby which is abortion never crossed my mind. Today she is almost 9 months and I thank God for her every day.. She is a blessing to me and God has a plan for us. I can't imagine my life without her. If your Pro-life you believe in LIFE No matter what.. So even in assault/rape or incest a baby should live. It's not the baby's fault what happened. No one knows how a baby was conceived.. God has a plan for ALL unborn babies.","post_message":"Christie and Bush attack Cruz, Rubio for being too pro-life"},{"comment_id":"1153087074711321","commenter_b":"we need more sex workers to solve crimes the cops can't","commenter_a":"They should give her an award. She has saved countless lives.","post_message":"Police found what they described as a \"kill kit\" in the trunk of Falls' car — including handcuffs, several long knives, a box cutter, two axes, a machete, a sledgehammer, a bulletproof vest, another gun, shovels, a rubber tub large enough to hold an adult, and bleach and other cleaning supplies."},{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"682882035184939","commenter_b":"Until the war against christians ends. All countries should carefully screen all imigrants. Period","commenter_a":"Yes absolutely!","post_message":"Our children's future is at stake! YOU DECIDE!"},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say \"Islamic extremism.\"  \"If Fox didn't talk about this, they’d have nothing else to talk about,\" Holder said."},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."}]
