[{"comment_id":"10155686821610354","commenter_b":"Please were in Big Trouble if the ASSHOLE gets in. It's bad enough the ASS already in office is dismantling our Country little by little she'll just finish it off. Her and her asshole of a husband.","commenter_a":"She could have changed to state ID if she is no longer driving and that information should have come via letter","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.”  If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10152709650356051","commenter_b":"Daila Gonzalez, if you are here illegally, it's time for you to leave!","commenter_a":"We should spend more money on our mentally ill americans then we do illegals.. It is such a shame they get so much while we neglect our own...","post_message":"Police saw that a man at IHOP couldn’t pay his tab, so they decided to pay for him. A few hours later, they made a grisly discovery in his apartment"},{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"870676293063413","commenter_b":"She can leave anyway. Useless","commenter_a":"Well,bye","post_message":""},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"}]
