[{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"\"Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' \" Donald J. Trump said. \"They say, 'We want deal.' \""},{"comment_id":"1490217797705011","commenter_b":"She's not a Christian,the BIBLE says we will know them by their fruits , her fruit is rotten !!!","commenter_a":"That is because liberals are REALLY, REALLY STUPID!!!","post_message":""},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."},{"comment_id":"10153580364618797","commenter_b":"Lol @username she's definitely stupid and disgusting. ..","commenter_a":"Nothing racist about my comment! i simply wouldn't have called anyone to help. Now be mad if you like so what because","post_message":"WOW! A police officer collapsed on the job. The teen in handcuffs whom he arrested was sitting right there.   What the teen did next saved the officer’s life. See here:"},{"comment_id":"10154493895401509","commenter_b":"He's not going to win the general election! Ha!!","commenter_a":"BOOM!!! #Trump2016","post_message":"BREAKING: CNN projects Donald J. Trump has won the #NVCaucus. @webpagelink"},{"comment_id":"10153624584662235","commenter_b":"Ewwwwwww, Leonard...I don;t know any self respecting lesbian that would be in the room with her much less touch it.","commenter_a":"Usually, those that \"doth protest too much\" likely have closeted feelings and are gay themselves.","post_message":"NAILED IT."}]
