[{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"1234949299869862","commenter_b":"Really irritate me how she copies her speech","commenter_a":"Better to repeat the inteligent words of an inteligent woman, than stupid words of a stupid husband! Since an empty head isn't capable of producing words of her own!","post_message":"Listen to Melania Trump's speech last night vs. Michelle Obama's speech in 2008 @webpagelink"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"\"I cherish women,\" Trump told Hannity on Tuesday night."},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"\"You're going to have a deportation force, and you're going to do it humanely,\" Trump says."},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"}]
