[{"comment_id":"10153141603253352","commenter_b":"Melissa shut the fuck up!","commenter_a":"Those Black Companies are NOT affiliated with ANY Black Supremacy Groups that's the BIG DAMN DIFFERENCE. WAKE THE FUCK UP PEOPLE.","post_message":"KKK erects billboard in Arkansas advertising local White Pride radio station featuring shows 'This is the Klan' and 'White Women’s Perspective'"},{"comment_id":"10154273015234205","commenter_b":"@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"},{"comment_id":"10155696474235389","commenter_b":"Not sure, police officers have a great sense of duty and honor.","commenter_a":"Neuter the police, this is the result.","post_message":"Question of the Day: Do you think Baltimore cops are now less likely to put themselves at risk?"},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"987930937907325","commenter_b":"That's how twisted this pervert is ! Prison !","commenter_a":"well well I never heard that stupid statement made before didn't fly with me","post_message":"UNBELIEVABLE! The audacity...  Story: @webpagelink"},{"comment_id":"1417324464960761","commenter_b":"We were all originally from somewhere else. The wretched refuse remember! You know the statute of Liberty!!","commenter_a":"Remember Americans are paying for their free benefits!!!","post_message":"What do you think?"},{"comment_id":"10154006195498984","commenter_b":"The witches on the view can't understand normal thinking!","commenter_a":"Moron","post_message":"Ouch. It has to be embarrassing for Whoopi to get set straight in front of her own fans like that. She was no match for Rand Paul. After one of Whoopi's famous rants, Rand Paul pointed out exactly what is so ridiculous and silly about her argument.  Do you agree with Rand Paul?"}]
