[{"comment_id":"1317246778287960","commenter_b":"She'd have been funnier if she'd have swallowed her Mic..","commenter_a":"What the he'll is wrong with these mean girls, this country? You don't do that to ANYONE! Not ANYONE EVER! This show allowed this? We teach our children it's wrong, if it was done in school it's called bullying....my God! She should lose her modeling contract!!! Stop this Madness!","post_message":"Gig Hadid threw some serious shade at Melania Trump tonight..."},{"comment_id":"1114298202002104","commenter_b":"What do you mean? It's a horrible thing to say. But we have freedom of speech in this country. Her speech is protected by the constitution. She shouldn't get fired for it.","commenter_a":"So its only freedom of speech if it's against Republicans? If the Democrats played on a level field they would get destroyed even more!","post_message":"The director of a nonprofit agency who called Michelle Obama \"an ape in heels\" has been fired."},{"comment_id":"10152701982362869","commenter_b":"Will miss you on Fox. Now, go get 'em.","commenter_a":"Choice satellite TV doesn't show FOX NEWS anymore so I don't get to see it. All we get is liberal news and I think this is just propaganda and time to cancel choice for violation of our contract.","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. \"Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!\"","post_message":"Nope, not sorry."},{"comment_id":"479299448927302","commenter_b":"Americans mandate Islamic Terrorists be assasinated","commenter_a":"Fuck them shot them in that red dot in there head...","post_message":"New Texas curriculum tells students to refer to Islamic terrorists as 'freedom fighters'.  Spread the truth, let's put an end to this.  'LIKE' if referring to terrorists as 'freedom fighters' is WRONG!"},{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."}]
