[{"comment_id":"10154373142406509","commenter_b":"It's bc she's white and rich.","commenter_a":"When you have money the law work for you and when you're poor it don't","post_message":"Tonya Couch, the mother of so-called \"affluenza\" teen Ethan Couch, had her bond lowered from $1 million to $75,000 at a hearing on Monday."},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"10154448995838812","commenter_b":"@username what makes her uneducated?","commenter_a":"And people seriously want to elect him president?!? Get a clue!!!","post_message":"New York's attorney general says he won't be deterred in pursuing the state’s case against Donald J. Trump and Trump University, just because the defendant is campaigning to be President of the United States."},{"comment_id":"1590001651301475","commenter_b":"Great she'll be a steady war monger!","commenter_a":"Yeah diplomacy works! First and foremost.","post_message":"The Young Turks #LIVE coverage of the Commander In Chief Town Hall hosted by Ben Mankiewicz, John Iadarola & Ana Kasparian"},{"comment_id":"10153694851768352","commenter_b":"A black woman wouldn't marry him because she doesn't want ugly kids! With his Ugly self....","commenter_a":"Trust me we won't! LOL ha ha ha #ugly","post_message":"‘I’m not a racist – but I wouldn’t marry a black woman, I want my children to look like me,’ says ‘white supremacist’ accused of inspiring Dylann Roof’s murder spree"},{"comment_id":"1066188120157365","commenter_b":"You don't know shit lady !","commenter_a":"Those of you that are saying \"cry me a river\" are the same ones who probably laughed along with Trump when he mocked that disabled reporter, but it's all good because you get what you give, karma doesn't forget about anyone","post_message":"Meryl Streep just called out Donald Trump for bullying at the Golden Globes."},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"}]
