[{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"1368989116512954","commenter_b":"This is a poorly done troll job","commenter_a":"How about cutting the businesses taxes and then giving that money to illegal immigrants and other countries and people on welfare who can work?","post_message":"After liberals raised the minimum wage again, this restaurant owner had had enough. Here's how he took matters into his own hands and made sure his customers knew it...  This is what the left does NOT want to talk about when it comes to the \"fight for $15.\""},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"},{"comment_id":"10153089105414753","commenter_b":"I had twin daughters at 18, me and their mother had been married over a year when she got pregnant. My daughters have NEVER been abused, so yes teens can be good parents. This is a fucking offending question","commenter_a":"A lot of adults do the same to. Their children and i was a teen parent without any help and my children are fine and i am married now so it had nothing to do with him being young","post_message":"Should teens be allowed to have babies? What do you think should happen to this 19-year-old father? @webpagelink"},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to \"make\" the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"998273030249779","commenter_b":"Men use mens room women use womens room","commenter_a":"obama done it allready","post_message":"Once again the president wades into a state issue, ignoring the will of the people.   @webpagelink"}]
