[{"comment_id":"996595140397015","commenter_b":"These gun nutters are too chicken to go fight a REAL threat, so they try to intimate normal people. You freaks are just trying to intimidate people. Red beck, Inbreeds!","commenter_a":"You don'y have to give up your guns, and no one is proposing that (I'm a gun owner and a vet), to have sensible regulation.","post_message":"“I grew up in Tucson, Arizona, and I live there now. And I'm a gun owner and a supporter of the Second Amendment. But I couldn't give you more credit that we need to deal with the wrong people getting guns, especially with mental illness. As you know, in Tucson we had a person who had all kinds of trouble and was able to buy a gun. In Virginia Tech. In Louisiana… So from a gun owner, from a reddest of red states, and a person who owns guns, more power to you.” —an attendee at Hillary’s town hall on gun violence prevention in Manchester, NH"},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"10154383385775975","commenter_b":"Thank you, OUR President Donald J. Trump❤️🇺🇸 #MAGA","commenter_a":"Loving it loving it","post_message":"\"I didn't come along and divide this country. This country was seriously divided before I got here.\"  President Donald J. Trump addressed the deep division Americans face.  Read more about today's press conference: @webpagelink"},{"comment_id":"10154010252346350","commenter_b":"The kid didn't make a mistake. If she was driving drunk then she committed a crime. Having someone plow into your home is not only traumatic at the time of the event, but then there are all of the repairs to deal with. It can take months to get it all put back together. And insurance doesn't cover all of the costs. Guess who gets to pick that up. Not the kid. She wasn't over reacting. If anything, she was quite conservative. I would have gladly beat the stuffing out of the one that hit us.","commenter_a":"I'm probably the only one who is think Kim... Is.. Well... Being a little actress like in all these tweets. We get it. The kid made a mistake. One that could of been fatal. One tweet is probably good enough (if at all) but like 4? Get a grip Kim. Ridiculous.","post_message":"\"This young girl could have killed herself, her friends, and me. Frightening.\""},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,\"you didn't earn that\" or \"some folks are going to have to give up their piece of the pie\" really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"10154973446391509","commenter_b":"Shuttt up!!","commenter_a":"This is not fair because Turkey had an explosion in the airport today with few deaths and few injured. But yesterday in my country Lebanon had 6 to 7 suicide bombings through out the day in less than 24 hours in one village called Kaa which is a Christian village with 5 deaths and 28 injured some are deadly injuries. And there was not one news coverage of that.","post_message":"BREAKING: Explosions and gunfire reported at Istanbul’s Ataturk Airport, the Turkish interior ministry said @webpagelink"}]
