[{"comment_id":"1149779331709743","commenter_b":"Bastards of the ocean!","commenter_a":"The arseholes of the sea. Cha Henry @username","post_message":"Wow, what an asshole."},{"comment_id":"10153666671338797","commenter_b":"But Jennifer Fillpone u did not lose he's a smart man Rham don't vote just for race.","commenter_a":"Ha~ha :) :)","post_message":"#BREAKING: Mayor Rahm Emanuel did not receive the 50 percent majority needed to avoid a runoff election.   Emanuel has been forced into a runoff with Jesus Chuy Garcia. Details here:"},{"comment_id":"1078709322150078","commenter_b":"we r so screwed if cancer is cured... prepare for the brand new disease! xD","commenter_a":"Gus Fielding","post_message":"A small trial for a cancer vaccine has been successful."},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""},{"comment_id":"10154447143119087","commenter_b":"Katherine, I hope someone, someday, grabs you by the pussy, you uneducated white trash bitch","commenter_a":"lol he's a hot headed LOSER.... This asshole called his own daughter a Pig And somehow we care what he thinks about Donald Trump","post_message":"Alec Baldwin posted a photo on Instagram in a Russian \"Make America Great Again\" Hat."},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10153958872340695","commenter_b":"@username gotta love these white SLOW voter. I bet you probably one of the slos that was going to vote that dunmy Sarah Palin in who thought Africa was a country....thank God for uninformed black voters","commenter_a":"Go Obama!","post_message":"In a rare Oval Office address President Barack Obama sought to reassure Americans shaken by recent terror attacks."}]
