[{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"\"This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.\""},{"comment_id":"1000336466699775","commenter_b":"Bitch Stfu quit preaching","commenter_a":"Kanye was her man at one point. I'm sure y'all have done stuff to please your significant other while in a relationship. GTFOH. Y'all clowning Amber for pleasing her man at the time?? Really???","post_message":"#ShotsFired Amber Rose Just Fired Back At Kanye West!"},{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"\"How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.\"  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"},{"comment_id":"1176638305726030","commenter_b":"My mother told me to never argue with the peasants. I am sure that is what most liberal mothers told their children while most conservative mothers were too busy cleaning their guns in hopes of putting another possum on the table for their snaggled toothed brood.","commenter_a":"I love that all of Killarys posts are getting roasted! Even the left can no longer argue for this traitor! #HILLARY4GITMO2016","post_message":""},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"}]
