[{"comment_id":"10154428205019087","commenter_b":"@username How is hiring illegal immigrants here in the USA \"putting 741915279236631s first\"? @webpagelink","commenter_a":"As an @username and a veteran I do not understand how anyone, but especially a fellow veteran, could support a disgraceful chickenhawk like Donnie. @webpagelink","post_message":"Several leading veterans groups who skipped President Obama's inaugural parades will march down Pennsylvania Avenue to celebrate the inauguration of President Donald J. Trump."},{"comment_id":"10152868852711336","commenter_b":"I approve. What else should we call them? They are illegals.","commenter_a":"Americans should be able to freely shoot border jumpers no questions asked in protection of our country!","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"1075829105767772","commenter_b":"They blame it on Obama....for \"existing\".","commenter_a":"I swear, in some ways things are worse now than they were 50 years ago. Some try to say that it's just among old white people. . . well those folk seem to have done a pretty good job of passing it down.\\b\\b\\b\\b","post_message":""},{"comment_id":"10153766656618984","commenter_b":"Get off your asses bitches you will have a better view !","commenter_a":"Absolutely, they need to be respectful. They believe they are special and above the law...they deserve to fold. Maybe they will be humble in their next job!!","post_message":"I did NOT see this coming, and I don't think the women of \"The View\" did either. They had just apologized for their controversial comments about the Miss America contestant who is a nurse when they got blindsided by some very bad news...  Do you think \"The View\" deserves what it's getting?"},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"1141996625817686","commenter_b":"Just jealious she can kick your butt","commenter_a":"The. \" Token Brunette \" on Fair and Balanced \" comedy show !","post_message":""}]
