[{"comment_id":"1308080519212956","commenter_b":"What's up with all this refugee hate going around? \"They're brown and muslim!! I hate em! They're animals! MURICA!!\"","commenter_a":"Until the refugees find it and start using it as there public restroom","post_message":""},{"comment_id":"992065330813220","commenter_b":"Nooo! Stay away from Tacoma. We don't need Seattlites messing up the city.","commenter_a":"Stay out of T-town jerks...you'll ruin it just like you ruined Seattle...","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""},{"comment_id":"1430637223901951","commenter_b":"Does anyone think she is intelligent or this helps the women's cause?","commenter_a":"I'm sure her mother is very proud.","post_message":"Classy!"},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""}]
