[{"comment_id":"1210507815635913","commenter_b":"No cop killers are by definition an individual who's killed a cop..An old lady with no criminal pass and bake cookies for the local fire department can be a cop killer if ever she kills a cop doesn't make her a thug though.You see by definition there not the same you can be one and not the other.","commenter_a":"RIP, condolences to his family. And, NBC would you please refer to him as a police officer and not a 'Cop'? That's disrespectful","post_message":"Officer Gregory Alia was shot and killed after responding to a call about a suspicious person inside a shopping mall."},{"comment_id":"1203191243053664","commenter_b":"Fry the bitch!!!!","commenter_a":"She's as much of a terrorist as he is because she knew and said nothing!!! Life in prison or deport and never allow her back in our country.","post_message":"WIFE PLAYED A ROLE:  @webpagelink"},{"comment_id":"10152878429492690","commenter_b":"Pothead thinking= had she been toking a doobie she would have been mellowed and not been on the pump jack. But then her parent or adult supervision may have been smoking one and thought it was funny.","commenter_a":"Hemp > crude","post_message":"Authorities say an 11-year-old Texas girl has died after falling from an oil field pump jack over the weekend. @webpagelink"},{"comment_id":"10154156199607235","commenter_b":"Seriously? WTF?","commenter_a":"William Kenneth Dockery","post_message":"WHAT."},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."}]
