[{"comment_id":"1488583267837295","commenter_b":"Are there ANY sane, normal, decent and honest people who want to do this job?","commenter_a":"He's angling for the Sec State slot if Trump gets elected.","post_message":"Most people don't really struggle with this question."},{"comment_id":"10153481312808352","commenter_b":"There are other things to focus on ladies. Move on now.","commenter_a":"She looks like like a 10 year old boy with boobs. Way to skinny. You need some curves. She just looks hungry.","post_message":"Woman who got super-toned in SIX WEEKS taking body selfies (and found it so motivational, she launched an app so others can do the same)"},{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"10153953968561491","commenter_b":"@username: get it right. SAD!","commenter_a":"when in the hell? @username @username","post_message":"\"Trump’s message to young people of color is simple: what do you have to lose? In my young optimistic eyes, after the last eight years of the Obama presidency, there is little left to lose.\""},{"comment_id":"10152541271415667","commenter_b":"Well Mickey they need a big building for all of his coloring books. Forget the white racist asshats on here... they will all die off eventually.","commenter_a":"Bush is responsible for thousands of american lives yet you bigots hail him as this savior because a blk man is president...he needs to be in jail yet you tea parties build him a library. .FOR WHAT!","post_message":"\"I have no more campaigns to run,\" Obama quipped during the State of the Union. \"I know 'cause I won both of them.\""},{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"}]
