[{"comment_id":"10153301839268854","commenter_b":"Why isn't sharpton in jail for not paying his taxes instead of running around free doing nothing but causing trouble. That is the question.","commenter_a":"Douche bag!","post_message":"Sharpton Calls for Federal Police Laws... 'There must be national policy'..."},{"comment_id":"867191473393219","commenter_b":"@username illegal. Get ready to be deported or just leave. Leech","commenter_a":"I am not even American, i live in New Zealand and i support @username. Long before Trump ran for president i believed he is the man for the job. Smart, strong, dedicated and beyond all else brave enough to stand up for his vision and commitment, if anyone has what it takes to make change for the better it is Donald Trump. From all the way here in New Zealand - i have confidence in Donald Trump to clean up and create change. THANK YOU!","post_message":"Thank you FLORIDA! #VoteTrump on March 15th! #MakeAmericaGreatAgain"},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""},{"comment_id":"10153258279033010","commenter_b":"Just give her a whiff!","commenter_a":"The trophy wife gets the gold mine and the kids will get the shaft.","post_message":"Robin Williams' three children are at odds with his third wife over what constitutes \"memorabilia.\""},{"comment_id":"10154719986051130","commenter_b":"I'm a middle income American born and raised in America I paid Social Security and income taxes all my life I'm tired of supporting illegal immigrants and people freeloading from the US government on my nickel pretty soon the freeloading is going to stop","commenter_a":"Now I see a lot of ignorant uneducated and sick people talking about things that don't make any sense against the president when Donald Trump gets going you people that are on welfare illegally you people that get free handouts from the government illegally for you people the freeloading stops you're going to have to get a job and actually work for a living.","post_message":"WATCH LIVE: President Trump to speak in Melbourne. @webpagelink"},{"comment_id":"10154135870346336","commenter_b":"@username OMG---More Trump Fabricated LIES!!!Trump Played Everyone Like A FIDDLE With Those TRUMP Planted PAID Protesters, Trump Now Has 20 Secret Service Guys Guarding Him At His Rally, EGO IS THE WORD...He Really Knows How To Play the Media & Followers *NEVER TRUMP* TRUMP Wants to TURN Our Military INTO ZOMBIE TeRRORIST Animals To Beat ISIS...BUT OUR MILITARY IS AN ELITE GROUP & Has Rules & Morals.... ISIS is A BAND Of MURDERS & CRIMINALS.... TRUMP Wants A WAR $$.....People Are Blinded by Trump's Rhetoric and can't SEE Trump Sending Our Young Adults To Fight An All OUT WAR AGAIN! Government Welfare KING DUMP Trump doesn't need anyone's HELP exposing His LIES Trumps own EGO Is His Own Nemesis.. ??Has Trump Gone From Selling Realestate Properties To Selling Our Whole Country!TRUMP wants to Do Away with Social Security & Medicaid For Our ELDERLY!!! HOW is Trump Helping American JOBS when ...","commenter_a":"Typical Trump...talking about anything other than specifically HOW he is going to make AMERICA great again!! Just saying it won't make it so!! Maybe that's why he gets no more than 35% of the vote. The other 65% are on to his BS...He only cares about Trump not one of his supporters! Wake up people!!!","post_message":"\"[Marco Rubio] made a statement that I had small hands. He made it up. He's a politician. Politicians lie.\"  Today on \"MediaBuzz,\" Donald J. Trump talked about the \"hands\" story."},{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"}]
