[{"comment_id":"1411157285603697","commenter_b":"Californians will get tired of being victims eventually and deal with these guys.. meantime lets send liberals refuges and illegals to them","commenter_a":"Brown is a two-time failure as governor.","post_message":"More are coming..."},{"comment_id":"1237520902934076","commenter_b":"She's a criminal, with really bad hair.","commenter_a":"She did what she was hired to do.","post_message":"The American people deserve better. The DNC and Hillary Rotten Clinton rigged the system and completely ignored what the people wanted! They are so, SO corrupt!"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"},{"comment_id":"1117614688258709","commenter_b":"@username I bet you believe the liar Lucy.","commenter_a":"Apparently the alleged (by police) victim in this case, is saying \"there was no assault\"..... Of course if the Gian Gomeshi/Lucy DeLiar case has taught us nothing if not \"We must believe in the guilt of every man accused, even if he is not guilty... even if the accuser admits to lying about it... and even if the alleged victim says \"he didn't do anything\".... if you have a penis, you are, by default, guilty, even if you're not guilty :( Sad world when having a dick is more of a crime than being a dick :(","post_message":"\"If I find out that somebody is abusive, I cut them out of my life. It's very easy,\" wrote Lucy DeCoutere after the actor who plays Bubbles in the Trailer Park Boys was charged in a domestic dispute."},{"comment_id":"489008974557030","commenter_b":"Our Government has NO IDEA of how many muslims (refugees, immigrants, migrants, legal or illegal) are Already in OUR country!!!!","commenter_a":"Trump","post_message":"Cheney:  think this whole notion that somehow we can just say no more Muslims, just ban a whole religion, goes against everything we stand for and believe in. Do you agree with Cheney or Trump on this issue?"},{"comment_id":"10152746311166519","commenter_b":"Thus hes still a bitch!!!","commenter_a":"This igit wouldnt last .5 nanoseconds in the south bronx","post_message":"Ladies and gentlemen, this is pure Fox News: “If I see a group of blacks coming at me with hoods on, I’m walking to the other side of the street.\""},{"comment_id":"504925023037210","commenter_b":"Geez. Is that OLD gal still around?","commenter_a":"She might find out how Hilter was if Hillary gets elected that your guns take away your health care tax away all your money distribute people money after the rich and powerful take most of it. OH MY GOODNESS THAY COMMUNISTISM","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."}]
