[{"comment_id":"10157199868050354","commenter_b":"THE WALL, THE WALL, THE WALL........TRUMP 2016 !!!","commenter_a":"To our Canadian friends and partners. We know you watch the going's on in the U. S. sometimes even better than we do. The time is drawing near for this country to rectify its self. Please stand by and give assistance when needed to those involved. Thanks and good luck up there with your country. Hey.","post_message":"Wow."},{"comment_id":"1241741129230844","commenter_b":"Donald Trump made racist white folks take they mask off, if you support Trump you are lowKey crazy and Racist, Trump's rich ass don't give a fck bout the poor, #BlackLivesMatter #Mexicans , he dont give a fck bout people from the bottom, the ones stuck in the hood, he only gives a fck bout the rich white and wealthy, ,...he started a Race war, he just motivated and inspired the KKK even more, kkk supports him to the fullest, he's gonna make this country more heated and more and more hatred between white people and the rest of the Race's , ...fck hillary too, but trust me Donald Trump is not a good option, he wanna make America white again","commenter_a":"Be a good time to start deporting.....thats how you catch illigals hold a Trump rally just bring in the busses and load them up....lmao","post_message":"Protesters remove their clothes at a Trump rally just before they flood the streets and destroy property."},{"comment_id":"10153287976081770","commenter_b":"@username you may be right. But on the other hand maybe thats what this country needs now. A good dose of reality. Quit voting these life long politicians in office.","commenter_a":"Trump as President??? So everyone is all right with him insulting women, rude comments about Jeb Bush, Ted Cruz, Carly Fiorina, Megyn Kelly,insulted the miltary, the disabled, John Mccain just to name a few. One of the meaniest and rude things he has done where he ripped it with me is a couple of days before Thanksgiving, at a rally in South Carolina he made fun of a New York Times reporter that had a physcial problem. Speaking as a person that has a physcial problem, that was very offensive! If I would have been at that rally, I would have knocked the living crap out of Trump! Trump thinks that he is going to be able to insult himself into The White House but oh boy, he is VERY wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Donald J. Trump spoke highly of his wife, Melania, at his last rally before voters head to the polls in New Hampshire."},{"comment_id":"1028264733936445","commenter_b":"It's it funny how liberals say they can get guns from other place but amazing thing is that these people can't make it down to get a ID to vote. Guns we can get cross states lines a ID nope can't do it.","commenter_a":"Cant be. They have banned guns in Chicago. Every one of those murders had guns? Doubt it, cuz guns are Illegal. Hey murderers, stop breaking gun laws and start stabbing people the legal way! #Sarcasm","post_message":"2,326 people were shot in Chicago in 2015."},{"comment_id":"764036443733722","commenter_b":"Absolutely! Throw the Muslims off the bus. When will we be able to do as we please even if the stupid Muslims are offended. WE HAVE RIGHTS AND THE MUSLIMS OFFEND US.","commenter_a":"Were wrong. This is America. Freedom of speech.","post_message":"Woman And Daughter Kicked Off Bus For Singing Nursery Rhyme That Offended Muslim Passengers. She was just trying to soothe her daughter. Do you think this is wrong?"},{"comment_id":"10156497004350294","commenter_b":"Looks like we need to start banning vehicles. All of these vehicles just hitting and killing people is unacceptable!","commenter_a":"So sad... prayers for the families","post_message":"The woman and a man were crossing the street when a vehicle hit them. Anyone with more information is asked to step forward:"},{"comment_id":"10154556355598690","commenter_b":"Some women just cant understand that others wish to cover up. Brainwashed since childhood to wear hardly anything.","commenter_a":"If the burkini is a symbol of Islamic extremism, then does that make the bikini a symbol of Western extremism or rather, Western subjugation of women? Surely freedom works both ways? Why should women be forced to show skin if they choose to cover up?","post_message":"Cannes Mayor David Lisnard called the full-body, head-covering swimsuit worn by some Muslim women \"the uniform of extremist Islamism\"."}]
