[{"comment_id":"10153411176356509","commenter_b":"I dont see any woman winning nothing by -coming forward- for the lack of proofs Cosby won`t face any compensation neither sentence, but it is a considerable quantity of womens telling the same, you figure it out ...","commenter_a":"Why are they all remembering it now?","post_message":"Heidi Thomas, who was an aspiring actress when she met Bill Cosby, is coming forward about a secret she says she has been holding for 30 years. This story contains graphic language:  @webpagelink"},{"comment_id":"966205513390919","commenter_b":"Ms Quintana what a selfish, entitled attitude you have. Who is going to pay to train the temp, who is going to have to take on the extra duty of getting them up to speed, and who is going to pick up the slack while they get adjusted? Someone has to make up for that lost productivity. So the woman makes a decision to have a baby, and everyone around her pays for that decision. How is that fair? And not only that, but she expects to waltz back in a year later like nothing happened! She will most likely have to be retrained, creating yet another burden on top of kicking out the person who has done her job for the past year. Why should that temp have to step aside because queen mommy came back? Shouldn't that be HER job now? Why should she have to step aside ...","commenter_a":"How very \"pro-life\" of them ;). It's no wonder some women need abortions, if you can lose your job or be forced to go on unpaid leave while pregnant, and there's no maternity leave after you have your child... having a child can seriously cause you financial distress to the point of ruin! States need to pick one or the other! You can't be pro-life if you're not going to support a woman who has a child at all.","post_message":"\"I loved my job. I was really hurt.”"},{"comment_id":"10154511519316337","commenter_b":"So you're mad cause you're a poor bitch?","commenter_a":"They didn't add he is sitting on a seat worth about $10,000 every on of his jet/ helicopter has gold leaf in on it and don't won't to get it dirty","post_message":"Donald J. Trump tried to be an everyman... on his private jet."},{"comment_id":"1023562641110247","commenter_b":"Conservatives can also be whiny. Like, OMG THE IMMIGRANTS ARE STEALING OUR JOBS OH NO I HAVE TO GO RE-TRAIN. I'M ENTITLED TO JOBS HERE.","commenter_a":"I don't know about my liberal comrades, but I went to work, paid bills, look after my kids, helped my neighbor fix his car, and drank. In fact I don't know a single liberal friend that did any of those","post_message":"It's a scary thought..."},{"comment_id":"1788613674701059","commenter_b":"Shut up hoe","commenter_a":"It amazes me how rude some of you people can be . They're having a fucking child! Like come on now , stop being so immature talking about \" he's carrying the baby , \" or \" his girlfriend looks like a man\". Smh people 😒😑. Congratulations Dj Khaled & Nicole Turk ❤️","post_message":"Baby Alert! "},{"comment_id":"1005179532861447","commenter_b":"Jail her for life","commenter_a":"What a screwball! Have a heart attack but don't beat your child! Moron!","post_message":"A Florida woman is accused of beating her child after the juvenile flushed more than $700 down the toilet: @webpagelink"},{"comment_id":"10154287048884205","commenter_b":"TYT hello from Juneau Alaska! We are on the watch out here! Trump might sell us off back to the Russians, for a few barrels of oil!","commenter_a":"Hi Joe!!","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"}]
