[{"comment_id":"10153113232077093","commenter_b":"Drum Corps have endured worse sweetie, you're giving us band nerds a bad image, we are not weak...","commenter_a":"She got a bruise you can get that walking into a counter at home. She still continued to perform after. It was accident. My generation because I'm 20 is so weak it's pitiful. I was always told to get back up if it's not broken or bleeding. I played football with a concussion and a separated shoulder. So a bruise is easy to deal with.","post_message":"The father of a high school band member who was hit after one school’s football team crashed the half-time show says his daughter is still in pain...  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"},{"comment_id":"10153087733461350","commenter_b":"She is truly fit and very pretty but sorry I still do NOT think seeing a huge belly and huge belly button sticking out is that appealing. Pregnancy is a beautiful thing, but come one get some class. I know all of you that think showing everything is great will have a fit over my comment. But if people would be honest, see through material showing huge bellies with huge belly buttons is not that appealing. I guess nothing is supposed to be left to the imagination or in the bedroom. I have seen some very sexy maternity outfits and this is not one.","commenter_a":"When is Jenna due ? Amazing fitness ! Love all y'all !","post_message":"Do you have questions for our #startTODAY experts? Ask below!  Jean Chatzky, Joy Bauer, Jill Martin and Jenna Wolfe are taking your questions on money, diet, fitness and getting organized. questions."},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"1697499920518952","commenter_b":"Um that's the point! Either way a wall effects their economy and they don't want it! As far as causing more immigrants to come here, that's the benefit of the wall! How stupid can people to to listen to and believe the lines off bullshit that people like oboma feed us?!","commenter_a":"fuck obama","post_message":"Here ya go...  WATCH:"},{"comment_id":"10153873855796037","commenter_b":"He was perhaps just as bad but we will all suffer the negative consequences of their actions.","commenter_a":"Obama's abuse the executive privilege and failure to uphold the constitution has set a dangerous precedent for all those who follow, whatever political party they may belong to...","post_message":"Here’s why President Barack Obama’s actions could empower Donald J. Trump’s Muslim ban in the future."}]
