[{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe \"psychosomatic illness,\" according to reports: @webpagelink"},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to \"fall in line\". I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"858343807629738","commenter_b":"Yes! Lock her up!!!","commenter_a":"She looks much better BEHIND BARS !!!!!!","post_message":"Trump Nominated - Christie Calls for Prosecution of Hillary: “Lock Her Up” @webpagelink"},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"1331566923530327","commenter_b":"Build a wall and make Mexico pay for it","commenter_a":"Just wait until the Beast's Administration takes over. The guy in this story will be considered \"small fry\" when the real unbridled corruption takes off.","post_message":"Top executives of  hedge fund manager Platinum Partners were arrested on Monday and charged with running a $1 billion fraud, potentially one of the largest investment scams since Bernard Madoff. We are #FacebookLive with the Reuters reporter who has been following Platinum's aggressive approach to investing and fund management. Send us your questions."},{"comment_id":"10154489632511051","commenter_b":"True, LOCK HER UP !","commenter_a":"agree'","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10154456636350695","commenter_b":"@username - you sir have won the internet today! That is hilarious!!","commenter_a":"What didn't this guy do during the rampage? I'm sure we're gonna hear he saved 15% on his car insurance next.","post_message":"NEW: Authorities say the shooter texted his wife while he was hiding in a bathroom, asking if she'd watched the news..."}]
