[{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10153647495544877","commenter_b":"@username is fine. Off subject. .but i had to get that out there. Hey boo...","commenter_a":"Let's try something new black America. Let's not break the law and put yourself in a position to get shot and I bet pretty good money u will live. Lol","post_message":"Thousands of Asian-American Protesters Rally in Support of Officer who Killed Unarmed Man in Housing Stairwell. Watch how it all unfolded below.   Grio fam, protesters said this is '1 Tragedy, 2 Victims.' What's your reaction?"},{"comment_id":"992259924200395","commenter_b":"I do not believe recreational marijuana should be legalized. Medicinal marijuana, yes. But there are enough zombies wandering our streets and driving our roads already, we do not need a bunch of stoners driving.","commenter_a":"It's about time, the stigma needs to go.","post_message":"Finally! It's time to stop throwing kids in prison over a little pot."},{"comment_id":"10153344624090326","commenter_b":"Sit down and shut up!","commenter_a":"He has hearing problems nothing is free","post_message":""},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"}]
