[{"comment_id":"10152964297833445","commenter_b":"what we dont want is a bullshit feminist agenda","commenter_a":"oh fuck off dont invade weed with your feminist bullshit","post_message":"Women Aim to Avoid Glass Ceiling in Marijuana Industry Before It Forms.   @webpagelink"},{"comment_id":"10153857256601051","commenter_b":"Learn how to spell, dumb bitch","commenter_a":"This will happen more and more, as Obama has made the back lives matter a protected class! Waite to the refugees start! As they will be a protected class also! All the while Obama is trying to disarm the law bidding citizens!","post_message":"Eight teens trapped a teen gold in a home, held her down and sexually assaulted her. But that wasn't enough for them."},{"comment_id":"10153490575133854","commenter_b":"Can some one just shut her up for a year or two ? Talk about a bullshiter.","commenter_a":"Take the guns from her handlers!","post_message":"Hillary Clinton Denounces White Privilege, Calls for Taking Guns From ‘Those Whose Hearts Are Filled With Hate’"},{"comment_id":"1028079707241669","commenter_b":"Yes oooo. They know what their children are up to. Let the people deport them.","commenter_a":"Damn right.","post_message":"French Mayor Says ‘No More Muslims’, Orders The Destruction Of The Infamous Calais Camps And Expulsion Of Over Seven Thousand Muslims  @webpagelink"},{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"},{"comment_id":"10153254582474877","commenter_b":"I think that was a reply to the poster.","commenter_a":"Atheists are the first ones to cry Jesus as soon as they get hurt!","post_message":"NFL star Arian Foster reveals he's an atheist: 'Faith isn't enough for me.' Read more on his perspective below.   Grio fam, what's your reaction to Foster's remarks? Sound off..."},{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"}]
