[{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":" girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."},{"comment_id":"10153857256601051","commenter_b":"Learn how to spell, dumb bitch","commenter_a":"This will happen more and more, as Obama has made the back lives matter a protected class! Waite to the refugees start! As they will be a protected class also! All the while Obama is trying to disarm the law bidding citizens!","post_message":"Eight teens trapped a teen gold in a home, held her down and sexually assaulted her. But that wasn't enough for them."},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":""},{"comment_id":"10153764228773525","commenter_b":"GodBless","commenter_a":"Si bendiciones x todos los Dr enfermeras y personal del hospital 🙏🏻🙏🏻🙏🏻🙏🏻😘😘😘","post_message":"APPLAUSE TO ALL OF YOU! \"After a hellacious night working with all the victims this is the welcome we get coming back to work the next night! Such an honor to work with such an incredible team!\" - Vincent White, Orlando Regional Medical Center. (Courtesy: Vincent White) #OrlandoStrong FULL STORY: @webpagelink"},{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"10152928005661615","commenter_b":"Btw, @username, go blue!","commenter_a":"Hahaha haha hahaha haha hahaha haha hahaha haha hahaha! !!","post_message":"“It hit my wife and knocked her over, and punched my daughter”   The 'it' was a DOLPHIN that jumped out of the ocean -- and into the family's boat, breaking the woman's ankles."}]
