[{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"1333345700010236","commenter_b":"get over it Bitch","commenter_a":"Of course his idiotic supporters fall for it. He's giving himself a massive tax cut which pales in comparison to his pittance of a presidential salary. He forgos the salary and looks like hero as he robs us blind. It's not even a good con but his supporters are great marks","post_message":"Trump says he already has enough money, so he's going to work free of charge as president. Do you admire his decision?"},{"comment_id":"708398475965965","commenter_b":"@username You a liberal Troll go away.","commenter_a":"Bullshit. Hillary Clinton is losing and losing badly. Hey liberal media....we're not listening to a damn word you say.","post_message":"Hillary Clinton regained her lead in the polls over Republican challenger Donald Trump after she accepted her presidential nomination Thursday evening."},{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"},{"comment_id":"10153815263206336","commenter_b":"Don't let illegal immigrants hijack the Democratic Party!","commenter_a":"Kinda trashy.","post_message":"Did this video go too far?"}]
