[{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"\"It's snowballing into something huge and is sending a message about the importance of immigrants to the economy\""},{"comment_id":"10152621933698067","commenter_b":"You nuts lady!","commenter_a":"Of course it is not free but at least your taxes are going to education instead of wars all the time. I can't believe how many Americans are so brainwashed against a little socialism. You guys at \"the top\" gotta get back to basics. The greed in your country is appalling. We are the lucky ones to still have subsidized healthcare. Taxes should go first to education and not onky spelling and writing, but to teaching life-skills, budgeting, health. 2nd to health including dental health. Tax the crap out of the fat and sugar laden processed foods. Start caring for community and stop supporting the conglomerates. Yay for Obama. The best president since JFK, only mote moral in his private life.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"868204976635103","commenter_b":"wow u got gender-feminists handing out federally funded dildos and rubbers to 6th graders...and you say \"porn' is the public health hazard?? lol","commenter_a":"Hey hey, this is a serious problem now, let's stop everything and focus on this!","post_message":"What do you think of this development?"},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. \"GO TRUMP \"","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"992656437438363","commenter_b":"Ban cars and booze. They made her do it !!","commenter_a":"The amount of unregulated stupidity shown by this younger generation is just absolutely astounding. It just blows my mind bravo idiots bravo","post_message":"Police couldn't believe what they were watching unfold live:  “After 30 years of law enforcement I hadn’t seen anything like this before.”"},{"comment_id":"911723728894896","commenter_b":"Witnesses lying on the police..glad there was camera...+1 for the good guys 😀","commenter_a":"All \"community leaders/organizers\" who make snap judgments about how an officer handled a situation should be made to go through a re-enactment of what the officer went through while making their decision. Maybe by walking a mile in their shoes they will have an inkling of an iota.","post_message":"Here we go! Witnesses say a white officer shot him in cold blood, this newly released video tells different story"}]
