[{"comment_id":"1080674971953513","commenter_b":"And then she has an ungrateful kid... Lol","commenter_a":"How do they even survive that? Oh the pain! I hope they are able to get epidurals.. 😉","post_message":"The egg is so large that in the last few days before laying it there is no space left inside the mother for food. She is forced to fast."},{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"1091280717559605","commenter_b":"@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."},{"comment_id":"2066498740242294","commenter_b":"Keep appeasing the beast that wants to devour you.","commenter_a":"i am a Roman Catholic and am continually amazed at what this pope utters. God forbid the Vatican is ever targeted.","post_message":"The pope claimed every religion has its \"little group of fundamentalists.\""},{"comment_id":"1353674218062160","commenter_b":"Dawn you're clearly a sexist. Lol.","commenter_a":"Yeah and the Republicans made such a big deal about Hillary's reset with Russia. The Donald just might sell out to Russia. Just how many millions did the Donald get from Putin?","post_message":"Donald J. Trump can scrap U.S. sanctions on Russia and other national security policies with just a signature."}]
