[{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"1108180832531570","commenter_b":"You need to get out more, specifically a museum.","commenter_a":"Ppl are quick to doubt things like this but believe whatever Fox News tells them. Meanwhile every civilization that recorded their history speak of giants. How can one make up or imagine Giants without being exposed to them or having seen them? Just like they wrote about hybrid races u think they made it up? Nope I think archaeologists (not all) but as a whole cover things up so they can keep getting funded. I don't by into dinosaurs, I think they are the hybrids ancient cultures speak about but hey if a man in a white lab coat says the grass is really blue a third of mankind would eventually start to see blue too. To each Is own tho","post_message":"A team of archaeologists have uncovered the skeletal remains of a giant in the Bulgarian city of Varna. Located on the eastern shores of the Black Sea, Varna is now a major tourist attraction. The area has a rich culture and its history goes all the way back to 5,000 BC. The oldest golden treasure in the world was found during excavations at the Varna Necropolis and carbon dating revealed it was buried more than 6,500 years ago. Thoughts?"},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"1012396785523240","commenter_b":"BUSH AND CHENEY WAR CRIMINALS!","commenter_a":"BENGHAZI, EMAILS, Feckless Foreign Policy , He is a Muslim , look at this snow ball Mr, President... Im not a Scientist , repeal Obama Care and shutting down the government again ?","post_message":"11 days and one massive to-do list."},{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"10152632992600927","commenter_b":"When has she even known what is going on? The woman is AWOL in the brain department.","commenter_a":"Iranians are our enemies you idiota","post_message":"She's backing Obama's Iran response.  What do you think?"}]
