[{"comment_id":"1082747785100183","commenter_b":"Stfu pussy.","commenter_a":"Oh look! Americans shooting animals for fun! why are people shocked by this? Also these are HUNTERS not POACHERS, poachers take things from the body for monetary gain, hunters just kill either to cull or for pleasure. All hunting should be banned! We have no right to kill for pleasure, kill to survive as that's the order of things but never for pleasure.","post_message":"Another iconic animal lost to hunters."},{"comment_id":"10153220883066491","commenter_b":"Unnecessary! Girls that are having their period don't play with barbies","commenter_a":"LOL - that is just rich.","post_message":"“It’s just what happens in real life.”"},{"comment_id":"10153148530580329","commenter_b":"It's not a fuckbuddy it's a weak ass pussy who ain't bout shit","commenter_a":"What is a f*ckboy? I must be getting old...","post_message":""},{"comment_id":"1902414739981573","commenter_b":"Do these woman have any idea how stupid they are?","commenter_a":"How stupid","post_message":"Whoopi Goldberg: Right to Celebrate Christmas is the Same as a “Woman’s Right” to Abortion"},{"comment_id":"987322251337818","commenter_b":"They should be incarcerated. It's just that women who have legal abortions aren't murderers. And NO member of congress should make my reproductive choices for me.","commenter_a":"If you believe in murder, I guess it would be ok for you","post_message":"Yes! It's time to #abortthestigma"},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"1131958793506245","commenter_b":"What did you expect from a trash bitch","commenter_a":"Sad, Sad, Sad. How dare you bring a child into this earth, if you do not plan to put them before yourselves. I imagine this is an ongoing problem and I truly hope that child is taken from them and placed in a loving home. If only I had the space, time, and money. I would rescue all children in a heart beat. :(","post_message":"Police want you to see these viral images of what heroin is doing to families."}]
