[{"comment_id":"1040915009338084","commenter_b":"@username your argument fails in a few ways. 1. A child is not a child until it is born. 2. Her body, her right. 3. What if she was suffering complications from said pregnancy? What if she was raped? What if it was incest? Would you still argue that she hasn't the right? Because if so, you're giving a living woman less bodily autonomy than a corpse.","commenter_a":"good","post_message":"There has been no time since Roe v. Wade when abortion hasn’t been under attack... But this moment is different."},{"comment_id":"1197295057044376","commenter_b":"I see they bussed them in","commenter_a":"I get guarantee most of these people don't even know what a fascist is.","post_message":"Marching on the deploraball"},{"comment_id":"10154117149131491","commenter_b":"@username let me see your nudes.","commenter_a":"18 months is not enough, in my eyes what he did was a form of sexual assault","post_message":"It all comes after private photographs from celebrities like Jennifer Lawrence and Kate Upton were leaked online."},{"comment_id":"10154481500504199","commenter_b":"Your mom is overrated. #yesidoknow","commenter_a":"Overrated.","post_message":"Sorry, but we have to ask...  Who's planning on seeing Star Wars: The Force Awakens?! [via.q13fox.com/Iat0q]  Photo manipulation by Mara Leite Photography"},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."}]
