[{"comment_id":"1604805479806565","commenter_b":"millions ,,,makes a star,,,,i like her,,she is a sweet little woman,,,,i am very thankful her husband had millions ,,,to get her where she is,,,she dont need of nothing ,,to even had started singing.............it was a joy seeing her perform","commenter_a":"@username you may need to read this","post_message":"YES!!!  We support you Shania Twain."},{"comment_id":"867849870028244","commenter_b":"I love this video! I can't stand the woman!","commenter_a":"Donald J. Trump should play, over and over, when she said, 'What difference does it make now?\" - regarding Benghazi. !!","post_message":""},{"comment_id":"10153337035811756","commenter_b":"I was watching a girls lacrosse match the other day and was puzzled as to why they weren't wearing more gear. Then I came to the realization by what was happening. Damn it, I just wanna see women knock the shit out of each other and get fucking pumped up.","commenter_a":"It's about time! Why do girls have to play softball instead of baseball in the first place? And while we're at it, why are girls expected to play that sissy version of lacrosse?","post_message":"“There would be nothing that would bring me back to softball because that’s not my love. Baseball’s my love.”"},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"},{"comment_id":"556548184511652","commenter_b":"You people seriously think our border with Mexico will keep terrorists out? You think that if we can't tell the difference between refugees and terrorists, that we would actually be able to sort them out at the airport? If we didn't want to take refugees we should not have involved ourselves in the war.","commenter_a":"To the people who support bringing in Syrian refugees: Have you ever thought that some of these \"refugees\" could be disguised and actually be ISIS terrorists taking advantage of this situation with a free pass to get here? I think we need to use common sense and take the obvious security precautions and NOT accept these people!","post_message":"My interview last night with Sean Hannity."},{"comment_id":"10154399256191162","commenter_b":"@username you're an illegal immigrant you can't vote","commenter_a":"I bet she's a Trump supporter .Maybe that thin skinned racist will pay her legal fees .","post_message":"Woman from Humboldt Park charged in Evanston Target bathroom explosion: @webpagelink"},{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."}]
