[{"comment_id":"671135826344343","commenter_b":"Kick her off the team","commenter_a":"👎move um out! Respect us or live in another country! If your parents don't make u respect our country move them out too!","post_message":"This high school volleyball player decided to honor Collin Kaepernick by protesting the National Anthem at one of her games. Guess how that worked out for her."},{"comment_id":"946547988774787","commenter_b":"Theresa, get a job, I'm retired! Baaaaaaaa, sheep!","commenter_a":"I don't care what Stewart thinks; I'm not one of his unemployed sheep!","post_message":"\"I honestly have nothing other than just sadness, once again, that we have to peer into the abyss of the depraved violence that we do to each other, and the nexus of a just gaping racial wound that will not heal, yet we pretend doesn’t exist.”  -Jon Stewart"},{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a \"90-day sex fast\" with his wife and it left him \"more in love\" and \"more turned on\" than ever."},{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"1022904834453429","commenter_b":"@username TAKE YOU IGNORANT AGNOSTIC SELF AWAY....AND LEAVE THESE NICE PEOPLE ALONE ....TROLL!!!","commenter_a":"No. I don't think this God has anything to do with politics whatsoever. It's important to keep religion and politics seperate. Besides, this isnt even an important thing to be concerned about. There's a lot pressing matters to attend to than putting a God back into the government.","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"895405060572025","commenter_b":"Just like that nut","commenter_a":"Looks to me Democrats are pretty scared of Trump and that way they send these people to his campaigning events and start up problems, fights in crowds. Democrats can't play fair cause they know they are not going to win people are tired of being lied to and their rights being striped away...people this is a wake up call!!!! If you value your freedom you better dig deep in who your voting for...because all Democrats are trying to take our rights away!!!","post_message":"This is hilarious.  Video by the Canadian comedy show 'This Hour Has 22 Minutes.' Shared by Occupy Democrats, LIKE our page for more!"}]
