[{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"1807238972845517","commenter_b":"NEVER GONA HAPPEN !!!!! BTW do any of these people know history???? Do they know that the first slaves were sold by Their own people???? Yes African people sold their own!!!! Now how the fuck.is that anyone's fault but their own peoples????","commenter_a":"We will not pay. No one in my family or ancestors had anything to do with slavery. Enough is enough move on.","post_message":"You May Have To Pay African Americans For Slave Reparations   Come try and get our money.  Will you pay for slave reparations?"},{"comment_id":"1158653037490292","commenter_b":"HOW can he be such a hypocrite??? His companies ship jobs overseas, and he ships in illegals to work for cheap saying Americans won't do the jobs","commenter_a":"When his ties are made in China really dude???","post_message":"Donald J. Trump lamented Nabisco's decision to move jobs to Mexico, then pointed to Chris Christie: \"You're not eating Oreos anymore, are you?\" @webpagelink"},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"10154526553127550","commenter_b":"@username SORE LOSER","commenter_a":"All of you supposed adults in here crying are ridiculous, Republicans lived through eight years of Obama, you can survive four to eight years of Trump. Grow up.","post_message":"North Carolina has officially cast its electoral college votes for Donald Trump."},{"comment_id":"1650724908525555","commenter_b":"Let's see, she and Obama, on one hand, want to take our guns, and on the other hand, want open borders of illegal aliens and possible terrorists to enter the Country. They are aiming to make all of America a soft target. Whose side are they on, anyway? Never mind, I think we know. Vote out all liberal, progressive, Democrats. Obviously, they are mentally ill.","commenter_a":"Gun control my a$$ - We ALL need to be armed!","post_message":"Wasting no time..."}]
