[{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."},{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."},{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"10153582261225950","commenter_b":"Making it easier to make the Darwin awards a picture book.","commenter_a":"Surprise surprise...another one bites the dust.","post_message":"There have been at least 49 selfie-linked deaths on record since 2014."},{"comment_id":"1788953421120280","commenter_b":"Progressive liberals are domestic terrorists! We the people must stop this corruption around our great country!","commenter_a":"Keep showing her lies as well as the corruption in Washington. Obama spending our taxes on her campaign, even though we are Not voting for her.","post_message":"Crooked Hillary Clinton lied to the FBI and to the people of our country. She is sooooo guilty. But watch, her time will come!"},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"},{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"}]
