[{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."},{"comment_id":"10154326754201636","commenter_b":"Well I don't think she has that strength","commenter_a":"Can she slap Nigel Farage and Boris Johnson, and get away with it?","post_message":"The incredible powers you didn't know the Queen wields"},{"comment_id":"1311800738876452","commenter_b":"IN YOUR DREAMS !!! #DontBoo #VoteHillary #NastyWomenVote","commenter_a":"Trump will become the next President. I'm saying this because I analysed their horoscope from an astrological point of view.","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10153533144730399","commenter_b":"@username, you might be a pussy as well...","commenter_a":"he is right and the American people share the responsibility for what happened in Oregon today....they continue to elect NRA bought and paid for officials","post_message":"\"Well this is something we should politicize. It is relevant to our common life together, to the body politic.\""},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"},{"comment_id":"10154431251561491","commenter_b":"Well women really do do more domestic work.","commenter_a":"\"This is especially true for women, who researchers suggest should limit their work hours to 34 hours a week; men should limit hours to 47 hours a week. That because, according to Dinh, men spend less time doing domestic work.\" I understand not overworking ourselves...but y'all could have worked a little overtime to make this article a little more fleshed out and a little less sexist.","post_message":"Listen up, workaholics."},{"comment_id":"868659363156855","commenter_b":"You have never been raped!","commenter_a":"The allegations are a joke.","post_message":"Too much?  #GoldenGlobes"}]
