[{"comment_id":"1604700786499928","commenter_b":"@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"10153974959029087","commenter_b":"@username I would be suprised if you cared.","commenter_a":"Funny to read some of the Trump supporters defenses that show they didn't read the article. First, the pictures weren't taken outside of the US, they were taken here. So the argument that they \"could have been taken outside of the country\" doesn't hold weight. Second, yes, models come here and do photoshoots \"all the time\", however, as the article states, there is a way to do it legally, and a way to do it illegally/fraudulently. From her own statements, it seems there might be a case where it was done wrong. And lastly, it does matter because Trump's platform is \"do it the right way, she did it the right way\", and if she didn't do it the right way, then it is yet another lie and makes them hypocrites. I realize she isn't running, but he is so he made this an issue. If this were the Michelle ...","post_message":"Melania Trump has said she first came to the United States in 1996 on a short-term visa, which wouldn't have allowed her to work as a model. But a recently published nude photo shoot shows that she was working in the country in 1995."},{"comment_id":"381033382254991","commenter_b":"Wapen ot me tsunami i achi","commenter_a":"Buri ke ini haha Gian Carlo Buan @username","post_message":"When you're out for a dating and took about 5 hours to get ready .. But when you arrive... 🙊🙊"},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"992416424184745","commenter_b":"Well I know it wasn't a baseball stadium or shopping mall","commenter_a":"Remember that first moron who said \"maybe, just maybe the earth is round\"? Unless there's a time machine, people can have their own thought who built the pyramids in what year, and for what purpose.... My theory was that aliens or time travelers built them as some sort of energy source....","post_message":"Wow.. and he's supposed to the SMART Republican? Reality check: the EGYPTIANS -- not the Jews -- decided to build the pyramids for the pharaoh's graves -- NOT to store grain!  “My own personal theory is that Joseph built the pyramids to store grain,” Carson said. “Now all the archeologists think that they were made for the pharaohs’ graves. But, you know, it would have to be something awfully big if you stop and think about it. And I don’t think it’d just disappear over the course of time to store that much grain. And when you look at the way that the pyramids are made, with many chambers that are hermetically sealed, they’d have to be that way for a reason.”  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"448351221956139","commenter_b":"I'm from Texas and Perry has done a good job for jobs and everything else, except shutting the border down. He gets an F for that...........","commenter_a":"Trump,Rick Perry is a very bright man.He lead Texas very good for many years.","post_message":"It seems that Donald Trump has now turned his attention to this rival GOP candidate."}]
