[{"comment_id":"821592037937050","commenter_b":"And unfortunately it is another woman saying it. SMH","commenter_a":"Doesn't someone always say: \"Forget these women\"?","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\"  - Phylicia Rashad"},{"comment_id":"10153845645645871","commenter_b":"I would say that since both ladies are jewish and liberal, they don't really care about the women who are raped, stoned, disfigured and killed because they are Muslim. I believe ini just telling it like it is.","commenter_a":"Have any of you followed Naomi Wolf's facebook page? I have for the past couple of years. She's an anti-Israel bigot, and she ignores women's issues whenever they involved Islam. I called her out on it many times. Here's an example.","post_message":""},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--\"I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...\""},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"10153647228236336","commenter_b":"Hello...Mr. Mahon? You there? Anything else you can steal from the white race and make you feel like a real man? Got our heritage, took over football, basketball, baseball. What's next? Hunting, nascar, women. Oh well...guess your are a superior race. Except in my neighborhood.","commenter_a":"Execution is exactly what the criminal who did this deserves.","post_message":"An estimated 11,000 people attended Texas Deputy Darren Goforth’s funeral today. The husband and father was killed \"execution-style\" at a suburban Houston gas station last week."},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."}]
