[{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: \"Who pays?\""},{"comment_id":"1410810932269586","commenter_b":"What a wanker.","commenter_a":"Demented old cray cray white man, losing touch with his cash cow. He's milking that cow because it's dying and he knows it. Will need to start a new job with no talent!","post_message":""},{"comment_id":"1034922753266951","commenter_b":"Dumb bitch","commenter_a":"Sarah Palin humiliates herself every time she opens her mouth. Do us all a favor - shut up.","post_message":"She just picked the WRONG fight."},{"comment_id":"434085210113797","commenter_b":"You've gotta love all the women on here tooting their own horns, huh? lol","commenter_a":"My kids aren't teens quite yet (11 and 6 year old).. But people always thing thy're my brothers... They're in shock when I tell them I've been married for 12 years and my actual age LOL","post_message":"Mom genes.  Which of these women gave birth to the other two?"},{"comment_id":"1510912668928758","commenter_b":"The choice is simple one's a white supremacist with thousands of racist supporters.....and the other is a woman that rubs you the wrong way","commenter_a":"What a surprise","post_message":"The endorsement will run in Sunday's edition of The Times — a day before Hillary Clinton and Donald J. Trump go head-to-head in the first presidential debate."},{"comment_id":"10153643721675399","commenter_b":"Couldna said it better! <3","commenter_a":"Well, Clinton IS the least batshit crazy Republican running...","post_message":"He also called Trump a \"narcissistic BULLYionaire\""},{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"}]
