[{"comment_id":"962475507142312","commenter_b":"I KNOW!!!!! They've already started. It's so funny!!","commenter_a":"That will drive them crazy","post_message":"Why does Hillary love Snapchat? Watch and learn:"},{"comment_id":"10152526323082377","commenter_b":"Go away","commenter_a":"a gubbament BIG ENOUGH to GIVE you everything you WANT, is also BIG enough to TAKE EVERYTHING you have!! see what happens when you DONT VOTE!","post_message":"Oh Really..."},{"comment_id":"10153363200377452","commenter_b":"Praying for the family, so heartbreaking.","commenter_a":"So sorry can't imagine the pain their families","post_message":"HEARTBREAKING: Just a few months after his sister died from leukemia, a distraught teen was struck and killed while riding his bike by a hit-and-run driver."},{"comment_id":"1006273402742336","commenter_b":"You kiss your mother with that mouth?","commenter_a":"How funny, lot of idiots on here don't realize that bin laden in the white house tremendously cut funding to nasa a while back.... This is probably giving back what he took...... Lib and Bernie voters aren't expected to","post_message":"That even more than Barack Obama asked for."},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"},{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"},{"comment_id":"1465398613511181","commenter_b":"Beyond stupid . Just be careful and keep your ear anus clean !!!","commenter_a":"Afiya Tavera Cunningham","post_message":"Doctors are once again letting us all know that you should not use Q-tips in your ears."}]
