[{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"10154237542506162","commenter_b":"Years wasted but enjoy that compensation my man","commenter_a":"I'm so sorry you lost all those years","post_message":"WRONGFULLY CONVICTED: A former U.S. sailor who has spent 33 years in prison will be released as early as today after new DNA evidence showed he was wrongfully convicted of murder and rape... @webpagelink"},{"comment_id":"10154930329184411","commenter_b":"eeehh how much cost an ukranian whore that can make this? 20 euros?","commenter_a":"OH someone throw these naked chicks money and maybe they'll start dancing to finally enterain us","post_message":"'Ukraine to EU', 'Break the Wall': The one-woman demonstration."},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"1623707571270874","commenter_b":"I hope she does and goes to prison and becomes somebody's bitch there ..","commenter_a":"They act like no one has do wrong when it came to Republican establishment, get real. I look at it very differently every dog has there day, sooner or later!!!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"}]
