[{"comment_id":"10154753364685225","commenter_b":"@username be quiet old hag","commenter_a":"This is what happens when you have real leadership in charge of the Country.","post_message":" is historic. The Dow Jones Industrial Average hits 20K for the first time. @webpagelink  #Dow20K"},{"comment_id":"1716977158581874","commenter_b":"You are a troll. Won't work here. Illegals will be deported en masse.","commenter_a":"@username I've been saying this for years. NOW, USE THIS INFO! If you state this info you will find more acceptance from the immigrants and especially the children who are now protesting you. For you will enlighten them and show them that they are being taken to the cleaners. The illegal immigrant is enticed to the USA. Have your people look this up.. The immigrant is being used and abused. The very children you see protesting you have no idea that the WELFARE they are receiving (and their parents are spending) is to be PAID BACK. Poof can be seen by how SSA is now taking retirement benefits from people (up to 15%) to pay back college loans. Loans that were taken out years upon years ago. Also if citizens received SNAP, TANF, Medicaid, or SSI they are paying back that money they received before retirement age by a lowering ...","post_message":"When illegal immigrant households receive far more in federal welfare benefits - than \"native American households - there is something CLEARLY WRONG with the system! Continuing this track will NOT MAKE AMERICA GREAT AGAIN! I will fix it, Crooked Hillary will not!"},{"comment_id":"10153070562531051","commenter_b":"She needs to be put in a hospital were criminals go. They need to put all the weirdos on a dam island somewhere.","commenter_a":"THere has to be a way to trace the video, find this woman and make her pay for this horrible murder of an innocent dog. Nothing could be gained by this act and the woman needs to be stopped before she kills again.","post_message":"First she tied the dog up. Then she took out her blowtorch."},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"10153036151346545","commenter_b":"That's nothing to brag about. we may be the majority but we also hold the majority of the most least paying jobs because most of our \"people\" are uneducated. Illegals are the worst part of our society. My family came here legally, so should everyone else's.","commenter_a":"we are the majority not the minority #vivalaraza #razaunite","post_message":"If only there was some sort of reality show catchphrase we could use at a moment like this to sum up NBC's break with the \"Apprentice\" star..."},{"comment_id":"10153398198117377","commenter_b":"Trump will never win. A vote for trump is a vote for Hillary..","commenter_a":"why wasn't Priebus fired after Obama won re-election? It was unreal that Obama wins re-election and the RNC looks the other way. Priebus will be gone after Trump becomes President.","post_message":"Reince Priebus is an amateur and lightweight who has been a \"disaster\" as chairman of the Republican National Committee, says Christopher Ruddy, CEO of Newsmax. “We never would've been in the situation we're in today,” if the RNC had a strong leader Ruddy told Newsmax TV. Read the full story: @webpagelink"}]
