[{"comment_id":"1849294941953444","commenter_b":"Illegals don't pay taxes, they may pay sales taxes, but one needs a social security card or a legal visa to get a legal job in America. Illegals are not immigrants, immigrants are people that came to the United States legally. American taxpayers should not have to pay for illegal activity, or anyone that came here illegally. I believe that all illegals need to go back to where they came from and return legally. If a child was born here from an illegal alien they need to go home with their parents, come back legally, they were born here illegally does not make them an American. All illegals should be thanking us for allowing them to stay for long, time for them to take what they have learned here in America and help the people in their homeland/country. Wait your turn like legal immigrants! No Mayor, NO state official, or ...","commenter_a":"Good for you NEW YORK!!","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"902494896546891","commenter_b":"I told you I was going to get her out","commenter_a":"@username she's a chunk! Pictures were a lie! 😁 She's out @username lol","post_message":"Our camera caught the middle school teacher who reportedly got pregnant during an affair with an 8th grader as she left the jail. We had questions, but she didn't have any answers. Full video: @webpagelink"},{"comment_id":"10154138263431323","commenter_b":"It's about what you want to do. Maybe a younger person follows what is 'the done thing' but with age and life experience, I think women just do what they want!","commenter_a":"It's just like the shaved pubes issue - all the same arguments. 'I do it for myself' etc etc. Look, virtually no young women shaved their pubes before porn videos made men expect it. And virtually no older women dyed their hair before looking our age became unacceptable. I've had enough of all this 'I do it for me' nonsense - look a bit deeper for god's sake and let's be a bit more honest about our motives and the forces that drive us.","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10153392413471748","commenter_b":"Abortion is safe cause ha aint getting in","commenter_a":"Historically, once extremism takes hold, it is very, VERY difficult to put the genie back into the bottle. As long as the extremists face no serious consequences, they will just get more and more radical in their pronouncements and actions. Only when there is a very strong backlash is there any chance of them backing down, as we saw when the anti-communist witch hunts were finally contained. But religious extremism like Huckabee's is much harder to deal with (as Goldwater presciently saw), because they regard all resistance as persecution and attacks by spiritual enemies. Sadly there is a chance, even if it is small at the moment, that America will ride the tiger of extremism to disaster. And unlike Germany after WW2, there would be unlikely to be any second chances, any opportunity for redemption, because a radical, apocalyptic, theocratic USA would almost certainly initiate WW3.","post_message":"Mike Huckabee thinks that as president, he could prevent literally all abortion."},{"comment_id":"1609193876054360","commenter_b":"Karma has a lot of work ahead of her!","commenter_a":"Shame on all that participated! My thoughts and prayers are with you and your family. Thank you for your sacrifice and for your sons. He is a true HERO! I'm heart goes out to all of you. God bless!","post_message":"“When he made that announcement, there was some hissing and some booing behind us,” Stewart Perry, father of Sgt. John Perry, told the Army Times."},{"comment_id":"10154210994334024","commenter_b":"@username and never apologized! Hillary blamed them and called them vile names. Such double standards.","commenter_a":"This book was praised by women readers and them running to the theaters to see the movie, but offended by what trump said 11 years ago. The vulgarity of those novels enormously outweigh what he said. Such hypocrisy!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
