[{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."},{"comment_id":"10152718156506051","commenter_b":"yea-their called street whores--oh-and get arrested sometimes","commenter_a":"Why don't people mind their own business?","post_message":"A man heard strange noises coming from a nearby car dealership. When he walked over to see what was going on, he couldn’t believe his eyes."},{"comment_id":"10153023436556051","commenter_b":"Yep, as long as she is consenting, I couldn't care less.","commenter_a":"lol,,, BDSM. They must be on www.fetlife.com","post_message":"Mall-goers here were genuinely disturbed when they saw who this guy had on his leash."},{"comment_id":"10154258426436509","commenter_b":"JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. CALL: +@username WE SUPPORT YOU BOTH SPIRITUALLY, FINANCIALLY, PHYSICALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BEING A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL WEBSITE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE. WE DON DISCRIMINATE IF YOU ARE WHITE OR BLACK. CALL: @username OR SEND AN EMAIL TO: ...","commenter_a":"Terrorist can care a crap about climate change their goal is to eliminate all others that do not believe in their religion.","post_message":"\"What greater rejection of those who would tear down our world than marshaling our best efforts to save it,\" President Obama opens up #ClimateChange conference COP21 #COP21Paris"},{"comment_id":"952491891550656","commenter_b":"It's CA...go figure...N CA that is which is even worse","commenter_a":"Too bad there is not a \"Dislike\" button","post_message":"JUSTICE."},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"10155020049345500","commenter_b":"I can see you are a cold-hearted Republican, but are you a veterinarian? Did you ex-ray and scan the dog for injuries? This dog will suffer for this when it ages. You are an evil woman who abuses animals.","commenter_a":"This is ridiculous. I am the biggest dog lover ever and this is blown way out of proportion! The dog is fine!! Geez","post_message":"\"DEAR PETA! CHILL!\" What else Sarah Palin said in response to criticism after posting a controversial dog photo @webpagelink What's your take?  (Image courtesy Sarah Palin's Facebook page)"}]
