[{"comment_id":"10153463508245950","commenter_b":"@username thats your opinion, but if she makes president, guess what....WERE FUCKED even more!!!!","commenter_a":"I'm not a Clinton supporter, but well said. Hillary's maturity and eloquence are refreshing after listening to Trump and the rest of the GOP schoolyard clamor.","post_message":"Donald J. Trump has \"incited this violence over months,\" Hillary Clinton says; watch the Democratic candidate's interview with Nancy Cordes: @webpagelink"},{"comment_id":"10154717381688128","commenter_b":"Liar, liar pants on fire! Immigration takes jobs from Americans and suppresses wages! Illegals have destroyed this country !","commenter_a":"Well Da, this country is made of immigrants","post_message":"A comprehensive study from the National Academies of Sciences, Engineering and Medicine shows that immigrants coming into the U.S. have helped the economy in the long haul and had little lasting impact on the employment levels of native-born Americans. The conclusion runs counter to a popular narrative suggesting that immigrants take the jobs of U.S. citizens."},{"comment_id":"10154789506552439","commenter_b":"Get the filth back to the sand","commenter_a":"If the president cant name the enemy as Islam then the media and police cant either...im assuming this is a direct order from the whitehouse as Lt Chris Cammock eluded in the press conference that there were \"other\" departments at play...","post_message":"The Muslim targeted women -uncovered women -- in Macy*s, in the cosmetic department and he was shouting. They don't tell us what he was shouting but we already know, don't we? He killed four women and one man."},{"comment_id":"633906553463617","commenter_b":"Bitch got booooooom roasted!","commenter_a":"Gladys Bernieeeee","post_message":"Bernie Sanders: \"Do you think that if your family had not made hundreds of millions of dollars of contributions to the Republican Party, that you would be sitting here today?\""},{"comment_id":"967270790032642","commenter_b":"You plutocratic blithering batch of flabbergasted infidels have the combined iq of less than one dead skin cell from the shmuck of @username's majestic penis post-circumcision and he in his infinite wisdom has confirmed that over 50% of all American penises have regressed so far due to their sheeple tendencies that they are considered vaginas by anatomists everywhere","commenter_a":"According to experts in the field of computer science the most logical, and therefore most correct, outcome would be for us to all vote Republican in the next election, the obvious pattern must be continued. Humans are not capable of conscious thought (especially not Americans) and must therefore follow trends like the herd animals they are.","post_message":"The jobs numbers say it ALL.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"759569737474968","commenter_b":"We also.have to put up.with people like you. I'd welcome anyone from anywhere else before I'd welcome you .","commenter_a":"If we gotta put up with Muslims...why the hell not at least he doesn't want to behead us","post_message":"If you thought he was in jail, you thought wrong."},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"}]
