[{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"1303809496299333","commenter_b":"Let us pray all that hard work won't be wasted. Hillary for prison 2016!","commenter_a":"It's going to take a lot of lawyers to keep her out of jail...finally some shovel ready jobs!","post_message":"This investigation shows no signs of slowing down."},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"10153505158314877","commenter_b":"Racist POS!","commenter_a":"Stupid POS.","post_message":"Sam's Club CEO Blasted as 'Racist'...Because She Believes in Diversity. Watch how the backlash started below.  Grio fam, here's our message for Rosalind: Keep up the good work. What's your reaction?"},{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"10153388655343812","commenter_b":"Ugly and disgusting! !!","commenter_a":"ridiculous looking","post_message":"Brazilian bodybuilder claims a synthetic material brought massive muscles -- but also medical danger: @webpagelink"}]
