[{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"\"Today is beautiful,\" said Anna Kendrick."},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"10152947957269342","commenter_b":"Kill her","commenter_a":"Deviks advocate. There are guidelines for murder. She didn't intend for the baby to die and took it to the hospital So the only real charge would be manslaughter, or murder 2/3 if the baby took unassisted breath which at that gestation isn't likely","post_message":"JUST IN -- Prosecutors say the woman accused of luring an expectant mother to a basement and cutting the baby from her belly will NOT be charged with murder.  FULL STORY ---> @webpagelink"},{"comment_id":"10152911974179071","commenter_b":"I dont think you really listened to his speech. He said they meaning mexicans!! illegals or not he is still refering to the RACE!! Are RAPIST!!! That alone is disgusting to label mexicans that are trying to find a new country.","commenter_a":"He didn't express hatred for Mexicans. He expressed hatred for the illegal immigrant problem Mexico presents the U.S. with. Those are two very, very different subjects.","post_message":"Behold, the Donald J. Trump piñata."},{"comment_id":"956895434364622","commenter_b":"Thats what she talks out of.","commenter_a":"Thats yet to be proved!","post_message":"Apparently race and gender are the only qualifications necessary to become President if you're a Democrat..."},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"},{"comment_id":"865398446828911","commenter_b":"She got what she got! Gee if you talk back to the KING media anymore you get taken down!!! Shut up Savannah!","commenter_a":"Certainly not unbiased. It's wrong, but not shocking at all that the so-called journalists have an agenda. I don't think Rand Paul was being sexist or rude at all. On the contrary, I think he was polite considering. He simply didn't let her tank-roll over him. I loved it!","post_message":"Liberal media is NO MATCH for Rand Paul!  Watch him completely DESTROY NBC host who tries to put words in his mouth!"}]
