[{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"10153889343021770","commenter_b":"i bet she tried to touch trump with her boobs..","commenter_a":"Lmao liberals","post_message":"BREAKING: Karena Virginia, a yoga instructor and life coach, appeared at a press conference Thursday morning accusing Donald Trump of touching the inside of her right breast in 1998."},{"comment_id":"10152728441711051","commenter_b":"Ship her to Iraq... just sayin!","commenter_a":"Shoot the witch..","post_message":"This woman killed her baby last year. Three weeks ago, she gave birth to another one. You can probably guess why she's in jail now."},{"comment_id":"1743922275826047","commenter_b":"150 million + illegal immigrants and 150+ million legal citizens out of work. Do the math its a wash get em out. Deport everyone last one of them and void any overstayed visas. Goodbye and goodluck","commenter_a":"These thugs are pay by George Soro's the Super Pac for Hillary, and the Bernie idiots that have nothing better to do.......the point is you will never see Republicans act like these IDIOTS!! This only pisses more people off to vote for Trump!! Trump for President 2016!!","post_message":"***SHOCK VIDEO***  Anti-Trump protestors in Albuquerque, New Mexico stomp on police cars, light Donald Trump signs on fire, wave Mexican flags...."},{"comment_id":"703956159761577","commenter_b":"this universe. She is vermin! Excuse me vermin.","commenter_a":"NOTHING is too horrible to say to her. She embodies every disgusting thing wrong in thi","post_message":"Ann Coulter wasn't the star of the roast, but she took a lot of the heat."},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"},{"comment_id":"10155027837294411","commenter_b":"I am trying to learn you that you can't blame a whole religion on the wrongdoing of one person.. It's like blaming denmark for a crime a danish man did in Spain... And you are still rude and can't spell.. Please go back to school and learn english and grammar... And maby move to an island with all your other nazi racist friends...","commenter_a":"What??? In most of europe these markets has nothing to do with christianity, but with shopping... Stop trying to divide people based on religion... We all know how you hate muslims now... And maby you should think that the western world, and Russia is bombing and killing the shit out of the middle east... Could be a reason for the hate you know...","post_message":"'A Christmas market which is a Christian symbol is a classic target for Islamic jihadists' (Op-Edge)"}]
