[{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."},{"comment_id":"10158141146535603","commenter_b":"Sorry his YUUUUUUUGE cock","commenter_a":"If it changed anything that would be one thing but since it don't matter anyway its just something to keep the butthurt crybabies in an uproar and crying. Who cares. They can find something else to cry about.. I got faith in our butthurt wussies of the nation","post_message":"President Trump will not be releasing his tax returns. Do you care?"},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"10153278641039087","commenter_b":"Absolutey prison is where this bitch belongs.","commenter_a":"MADAM PRESIDENT HILLARY CLINTON","post_message":"“I have no doubt on [Thursday's appearance before the House Benghazi Committee] she will be remarkable, and that Americans will really see why so strongly I believe she should be our next president,” Chelsea Clinton said about her mom Hillary Clinton."},{"comment_id":"10153492553852869","commenter_b":"Nope!","commenter_a":"Amen thanks to Obama. He rewarded themg for 9 11","post_message":""},{"comment_id":"507758516015518","commenter_b":"She is illegal","commenter_a":"@username 2016!!! LETS PUT THIS BEAUTIFUL LADY IN THE WHITE HOUSE!!!","post_message":"Very proud of our next First Lady Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."}]
