[{"comment_id":"10152587064680667","commenter_b":"Yes because white girls don't fight!","commenter_a":"maybe they should stop fighting #worldstar","post_message":"\"Like white girls, they face gender stereotypes. Like black boys, they face racial stereotypes.\""},{"comment_id":"1032417423454977","commenter_b":"Plenty of bullets in Texas","commenter_a":"I have some extra rat poison","post_message":"After the state's next two executions, Texas will be completely out of its lethal injection drug."},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "},{"comment_id":"10156602448280725","commenter_b":"Yes I just got a form in the mail to change so I could vote for Donald Trump Thank you","commenter_a":"To all Trump voters! If you not registered as a Republican, your vote WON count in your State primary election. Your vote will Not be counted if you are not registered as a Republican. You must register as a Republican ASAP. Find out your state rules and register now. Better yet, don wait, Register Now! Make your vote count for Donald Trump 2016!!! Please share this with Donald Trump voters.","post_message":"Many people voted for Cruz over Carson because of this Cruz fraud. Also, Cruz sent out a VOTER VIOLATION certificate to thousands of voters."},{"comment_id":"843772605660081","commenter_b":"We no longer have a president. I impeached him for tyranny & not protecting Americans & for not following our constitution. Since we have no leader, no harm fine, no foul. Hearing whst a great leader has to say like Mr N is hood hoe America","commenter_a":"Good he's not good enough to walk in Bibis shadow !","post_message":"Socialist Senator Bernie Sanders: \"The idea that the president wasn’t even consulted… that is wrong and not a good thing for our country.”"},{"comment_id":"640803119402199","commenter_b":"She would make a prison cell look good","commenter_a":"A better inmate. Classified is classified and a crime is a crime. I'd be in jail or hiding in Russia if I did what she did.","post_message":"Do you think Hillary Clinton would make a great president?"},{"comment_id":"10152731683061234","commenter_b":"Hey Mary... Go suck some cock","commenter_a":"yes, we the teachers, fire fighters, and police tried to tell you all! He is a liar and a crook and a bully","post_message":"Gov. Christie is probably hoping his 2016 presidential aspirations don't hinge on New Jersey voters. That's because a new Rutgers-Eagleton poll shows most Garden State voters believe he's a poor fit for the Oval Office."}]
