[{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"787208168094254","commenter_b":"That woman's a little unhinged!","commenter_a":"You are a has been. Good luck in finding work. You might need President Trumps help in finding a job.","post_message":"Classy!"},{"comment_id":"10153572834548132","commenter_b":"He fucked his sisters......BIG difference","commenter_a":"She's right. There was virtually no mention from the media of Lena Dunham's admission of touching her sister when her book came out. Complete double standard.","post_message":"Sarah Palin isn't too happy with what she calls \"obvious double standards\" between the Duggar family and actress Lena Dunham."},{"comment_id":"10153286809849726","commenter_b":"She is a racist","commenter_a":"What a loser ..Disgrace to the United States..","post_message":"WATCH: Ann Coulter Blasts Michelle Obama on Race: 'I Think She's Just Letting Out Her Reverend Wright Now'"},{"comment_id":"10155249184754218","commenter_b":"How do we know, @username? Watching the hearings and seeing her incapable of answering questions. We know by looking at her past experience and seeing it limited to special interest. She has almost no relevant experience. Cabinet members are to be experts in their field, not solely a wealthy donor to republicans. This is not a try out situation. There is not a revote. Your assessment of Trump's hiring practices ignore what we've seen even during his campaign. He had to find new campaign managers three times.","commenter_a":"Who in his right mind would approve of her, doesn't matter if you come from the left or right, everyone can see she is unfit for the job","post_message":"Senators are expected to vote Tuesday on the nomination of Betsy DeVos for education secretary. She is expected to be confirmed, with Vice President Mike Pence casting a tie-breaking vote. Do you support or oppose her nomination? >> @webpagelink"},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"928788953880826","commenter_b":"What a dumb bitch","commenter_a":"One less cracker...","post_message":"Because death is better than letting two people celebrate their love for each other."}]
