[{"comment_id":"10154945545241002","commenter_b":"Let them fight \" Darwin \" will take over !","commenter_a":"Terrible!","post_message":" loved everyone, said Robert Ybarra daughter. \"He was one of those neighborhood dads that people could count on.\""},{"comment_id":"10152824464986680","commenter_b":"Its always been a problem, but its never been so widespread and in our faces. Without Snowden we would still think this was a big conspiracy.","commenter_a":"He will force the end of the PATRIOT Act then blame Obama when we are attacked.","post_message":"“I don’t agree with Sen. Paul on this issue, but I think he’s been a constructive guy,” Senate Majority Whip John Cornyn of Texas said just before the week-long recess."},{"comment_id":"10153743944261337","commenter_b":"GO HAWKS! We love you hating little bitches!","commenter_a":"It's okay. Knowing that their jackass coach screwed them out of the Super Bowl last season, it makes it better. Overrated team from Seattle.","post_message":"THEY BLEW IT: The blown call in Monday's Seattle Seahawks -Detroit Lions game inspired some hilarious fan reactions..."},{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"1838786586350264","commenter_b":"This is a nothing story, women have been allowed to go topless in Canada since 1995. Grow up and get over the human body.","commenter_a":"Now this is a cause that I can put my hands up and support......Just kidding. I agree that if it's good for one gender, then it should be good for both genders.","post_message":"\"As long as men are allowed to be topless in public, women should have the same constitutional right.\""},{"comment_id":"453827754807805","commenter_b":"HELL YES!!! NOW THEY TRYING TO TAKE THE ONLY. GOOD FAMILY ORIENTED. ON T V TRYING TO GET GOD OUT OF EVERYTHING. THESE. PEOPLE ARE NUTS","commenter_a":"Yes","post_message":"Do You Support Keeping Duck Dynasty On TV?  Comment 'yes' or 'no'."},{"comment_id":"10158132279970153","commenter_b":"Go Israel .. squatters Go home!!!!","commenter_a":"gy","post_message":"LIVE: Amona settlement evacuation underway in West Bank  READ MORE: @webpagelink"}]
