[{"comment_id":"10153567910251130","commenter_b":"I think you're Ricky Gervais pretending to be a guy a named @username! (Please do not take that as an insult! You look like an incredibly fun dude)","commenter_a":"Kid admiring hard working men before society pollutes his brain with the sad gift of being judgemental. Future empath right there. Well done son.","post_message":"Starstruck!"},{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"10153236028424087","commenter_b":"Oh @username, beautiful, sexy, intelligent. You're a dream girl, woman.","commenter_a":"Exactly! Time to move on. Love wins errrr maybe","post_message":"“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Barack Obama said."},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"\"This is what happens when you f*** with mother Syria all of your blood will be spilled.\""},{"comment_id":"10154091101902042","commenter_b":"Sarcasm at its finest, they should've pulled their pants up!","commenter_a":"All white guys I see","post_message":"THIS CRAZY BURGLARY! These burglars rammed a car through the gated front door of an Indianapolis clothing shop, and then about a dozen spilled in and grabbed whatever they could. It was all caught on tape. More details: @webpagelink"},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"}]
