[{"comment_id":"1430637223901951","commenter_b":"Does anyone think she is intelligent or this helps the women's cause?","commenter_a":"I'm sure her mother is very proud.","post_message":"Classy!"},{"comment_id":"10155983890750354","commenter_b":"Yea I enslaved your lazy asses. That's the only way to get you to earn your keep.","commenter_a":"Agreed. Kill us all and then who will pay for your entitlements.","post_message":"“You mother-f**ckers...came and stole us from Africa and put us in chains and murdered us for over 400 years, so yeah, you do need to die.\""},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"988932794475475","commenter_b":"black so slap on the wrist and tell her NO NO","commenter_a":"Thanks Obama! This is how you are destroying America! I hope you and all of your kind are happy. No wonder this nation is falling apart.","post_message":"She will pay for this!"}]
