[{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"1301607906602125","commenter_b":"sharon when and if hillar y gets on i hope she puts the syrian refugees near u look what happened in europe well maybe u can get 1st taste of the syrian refugees in ur neighborhood","commenter_a":"Trump totally blew that first questions......He's the greatest at deflection.....LOL.......all he can say is we got to stop the jobs from leaving.","post_message":"WATCH LIVE: Hillary Clinton and Donald J. Trump square off in their first debate."},{"comment_id":"10154692738382235","commenter_b":"Continue to do what she's done for 20 years, try and destroy the Clintons. Keith Olbermann lays that out bare @webpagelink","commenter_a":"It will be interesting to see what Kellyanne Conway will be doing once Donald is finally embarrassed by getting wiped out in the election, and not only dumps her but blames her for his loss.","post_message":"Kellyanne Conway got A LOT more than she bargained for ..."},{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"793038077515812","commenter_b":"Omg yes","commenter_a":"@username we need this","post_message":"This is the perfect party game to play with your stupid friends: @webpagelink"},{"comment_id":"1100002276704629","commenter_b":"Whats more important to the RNC? Having Hilary as President or winnning the Presidency with. Trump, a Republican. They need to listen to the people .","commenter_a":"This would most certainly put Hillary Clinton in as first female pres.","post_message":"Should Romney run as an Independent against Trump and Clinton?"},{"comment_id":"1153444948105615","commenter_b":"To bad she didn't get her way !!! Sick ass bitch !! And fugly as shit too !!! F&skin cry baby !!!","commenter_a":"Are you all that stupid she treats everyone that way she belives you all our not to smart","post_message":"THIS sounds about right. @webpagelink"}]
