[{"comment_id":"10153209729066051","commenter_b":"I am a woman but if you not respect the man, specially on from of so many people, how do you spec, he is going to do. My friend you said what you WANT sorry you heard what you DESERVE.","commenter_a":"He has the right to his opinion and here we go again with Kelly, supposedly a conservative, telling someone that they don't have a right to say what they think. War on women, isn't that a liberal jab or stab...you bet it is. Keep talking Mr. Trump and you may win my vote, too!","post_message":"Donald Trump just got banned from a GOP Presidential debate because of this comment about Megyn Kelly."},{"comment_id":"1205822416127529","commenter_b":"And you're a Pussy!","commenter_a":"Not only that you're violent Mr. Trump but you're a racist, narcissist, bigot, mygonist, rapist, thug and the worst presidential candidate that the USA has ever had! You're everything bad that has ever happened on planet earth. You're the Ebola, Zinka, Meningitis, HIV/AIDS, Swine Flu, Hepatisis, Malaria, jiggers, Lice and Hemorrhoids and not to forget, you're the spread of cancer in the entire world! Go away already mtsweeeeew. #NeverTrump","post_message":"EXCLUSIVE PREVIEW: Tonight at 11/10c, Trump’s plan for his first 100 days: suing his female accusers."},{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"1573029682757155","commenter_b":"What's to be done. Vote for Hillary to screw over the vets, give away more jobs and flood us with refugees and illegal Hispanics?Seriously.","commenter_a":"@username shell say anything to get a vote this is how she really is a dirty white devil","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10153486399896037","commenter_b":"No slave. You put down the pipe and get sterilized.","commenter_a":"Attacking the rebel flag while lighting up the rainbow White House is causing division among Americans. Yahoo news and others are attempting to incite violence against Christians.","post_message":"Are toppling Confederate symbols a sign of change or the work of frightened politicians?"},{"comment_id":"1156907360996940","commenter_b":"That's a huge bitch!","commenter_a":"DAYUM!","post_message":"This is one of the largest black holes ever discovered. It is 7 BILLION times the mass of our sun."}]
