[{"comment_id":"10153255561596350","commenter_b":"She did do it her way.....special lady","commenter_a":"Tomi McCutchen Parrish should write her own obit, one day.","post_message":" pains me to admit it, but apparently, I have passed away. Everyone told me it would happen one day but that's simply not something I wanted to hear, much less experience. Once again I didn't get things my way!"},{"comment_id":"1131210870268774","commenter_b":"We don't care!!! So don't vote for her and fly off to your birdie page! HILLARY FOR PRESIDENT!","commenter_a":"I am a DEMOCRAT and Hillary does NOT have my vote in the Presidential Election. @webpagelink","post_message":"In 1990, American explorer and marine biologist Sylvia Earle became the first woman chief scientist at the National Oceanic and Atmospheric Administration (NOAA). For nearly six decades, she has led an international community of scientists in the study, protection, and restoration of our planet's marine life. Her unyielding curiosity and commitment to reversing the effects of climate change are a source of inspiration for environmentalists worldwide. Thank you, Sylvia."},{"comment_id":"10154770011654330","commenter_b":"Janine Beekman","commenter_a":"Thanks Malloy u duetch bag get out of office u suck !","post_message":"The drug company, Bristol-Myers Squibb, is shutting down several of its facilities, including one in Wallingford. ----> @webpagelink"},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."},{"comment_id":"10154151058422756","commenter_b":"To see how idiots can find an angle to go against clean energy. Wind turbines kill birds? A far less amount then any oil spill I have seen. Or pipeline that explodes. We could do this all day but this country is long past the need to go clean energy. I hope you idiots are paid to post all these ridiculous comments.","commenter_a":"Wind and solar don't make any sense, you have to cut down large areas of forest's to put up windmills on mountain tops to construct them, and they end up killing many birds. Same goes for solar, you would have to blanket the continental US with solar panels to replace fossil fuels. It's got nothing to do with \"evil big business\", wind and solar will just never be as efficient and reliable as coal, oil, and natural gas.","post_message":"A natural gas plant in Lycoming County is now complete, and it provides energy to nearly 1 million families in our area and other parts of the northeast."},{"comment_id":"10158074585980294","commenter_b":"The only thing that woman is in line for is a jump suit with stripes","commenter_a":"Here's hoping Hillary gets 271 at the least!!!","post_message":"By law, the Electoral College meets on December 19. But how does it actually work? Here's a quick lesson on tomorrow's events."},{"comment_id":"1673680616215825","commenter_b":"Stop letting this mother fucker control our future","commenter_a":"Nope","post_message":"Obama Gives 1.5 Billion Dollars To Muslim Brotherhood For THIS SICKENING Reason.  This shows you where his allegiance really lies.  Do you think Obama is a traitor?"}]
