[{"comment_id":"10153910090484160","commenter_b":"We need to ban this evil witch!!!","commenter_a":"Ban cars. Cars kill people. Drivers carry insurance. It is a business that determines risk and the policy cost reflects that. Require gun owners to have insurance rather than taking them away, unless, of course, you really are trying to disarm the American people.","post_message":"\"Terrorists and dangerous individuals are using guns to kill Americans. We should make it a lot harder for them to do that.\"  Hillary Clinton"},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"888413677941681","commenter_b":"We are aliens!!!!","commenter_a":"Blacks are the only ones seen. Thats good news. It could only mean that whites are aliens.","post_message":"Google Identifies Black People As Gorillas & Other Image Recognition Fails"},{"comment_id":"10153968954135695","commenter_b":"Read article it happened in Pittsburg","commenter_a":"Way to go ga.","post_message":"“They told me I was OK to park where I was, as long as I was not on the curb… then I come out and I'm being towed,\" one parent said."},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"}]
