[{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."},{"comment_id":"956845991041816","commenter_b":"Leave her alone she's a special breed of stupid.","commenter_a":"It looks like a bloody mosque take your baby piglets with you ,oh are animals allowed","post_message":"Mecca unveils world’s biggest hotel with 10,000 rooms."},{"comment_id":"10154468186761051","commenter_b":"She should never be allowed in another classroom!","commenter_a":"GOOD!","post_message":"This teacher was given the boot after video of what she did to Donald Trump went viral."},{"comment_id":"1247830038560637","commenter_b":"Don't care! Neither of these boobs is worth 2 shits under a bird! Garbage on two feet both!","commenter_a":"NEVER WILL BE THE BEST FIRST LADY. GO TRUMP.","post_message":"Will voters care about controversy over Melania's speech?"},{"comment_id":"1297424046964731","commenter_b":"Not a Christian. He's a low-life creep!","commenter_a":"That doesn't sound very much like what Jesus would say","post_message":"WOW!"},{"comment_id":"1235851089812062","commenter_b":"You're as ghetto as this chick","commenter_a":"I had my daughter at 16. I hid my pregnancy til the day i had her. My family just thought I was getting real heavy. Yes it was scary I was way too young and I knew my life would change. I had to grow up and do things most 16 yr olds don't have to. But i loved my daughter and can't imagine a life without her. I will never understand this! At 16 you know better!!! Give that child to a hospital, family someone!","post_message":"A infant girl died after being thrown from a second-floor window, allegedly by her 16-year-old mother after the teen gave birth. The child's grandmother was administering CPR when paramedics arrived."},{"comment_id":"920934694585179","commenter_b":"94 MILLION LEGAL AMERICANS JOBLESS LEGAL AMERICANS HOMELESS LEGAL AMERICANS HUNGRY LEGAL AMERICANS HURTING AND THIS DEMOCRAT SLAVE MASTER, WHO GETS A LIFE-TIME SALARY FROM LEGAL AMERICANS VOTED AGAINST THIS BILL WHICH WOULD GIVE JOBS TO LEGAL AMERICANS","commenter_a":"Wrong on many levels....","post_message":"Greater energy security and more #jobs are at stake. Approve #KeystoneXL!"}]
