[{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."},{"comment_id":"967043476669844","commenter_b":"I heard it was originated by harem members trying to catch the attention of sheiks so fat the women had to do all the work!?.","commenter_a":"There are spiritual aspects to female sexuality, this is where belly dancing comes from...before it was a way for women to show their sexual fertility to their husbands it was a practice done by female worshipers of the snake goddess. Not sure but to me this seems like a modern take on that...in most cases such dancing is done for the benefit of men. But when it is done to express one's sexuality in a personal way, it does have an empowering effect. It suggests that a woman's sexuality belongs to her and doesn't need a male audience to be valid.","post_message":"I never thought a pole-dancing video could be such a tearjerker. Man, was I ever wrong! - Andrea Garcia-Vargas"},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"},{"comment_id":"10153165521747217","commenter_b":"Yes.. haha true because their women are so beautiful ;) :)","commenter_a":"Next time Netanyahu - global warming also caused by Palestinians","post_message":"Germany steps in after Israel's prime minister claimed a Palestinian leader told the Nazis to kill Europe's Jews"},{"comment_id":"1766066213681675","commenter_b":"@username trophy wife No. 3 was a soft porn model who also lies like through her teeth. No wonder she squints so much, trying to find her sugar daddy's pee pee!","commenter_a":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s.\" --Melania Trump","post_message":"\"Mrs. Trump has placed several news organizations on notice of her legal claims against them, including Daily Mail among others, for making false and defamatory statements about her supposedly having been an 'escort' in the 1990s,\"  Charles Harder, a lawyer representing Trump, said in a statement."},{"comment_id":"897302730329476","commenter_b":"and youre famous for? ABSOLUTELY NOTHING","commenter_a":"It's funny how Your ugly dress made you famous more than your music did !","post_message":"#thedress girl speaks: 'It's madness. I feel like I'm living in a dream'"}]
