[{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10156401528845725","commenter_b":"@username pretty sure thats illegal and unenforcible","commenter_a":"I support you from India, they are welcoming muslims while one of muslim countries Brunei just banned Christmas..not to mention all most all muslim countries have banned isrealis and most of them hate america after jews..","post_message":"Thank you Franklin Graham! I have always appreciated your courage, but now more so than ever!"},{"comment_id":"10153050664571615","commenter_b":"@username stfu","commenter_a":"Omg abortions cops killing people rape wtf were talking about a dog killer people come on try and keep up lol people make me laugh","post_message":"NEW FALLOUT: Last night we told you how the Animal Rescue League was distancing itself from The Pittsburgh Steelers following the signing of quarterback Michael Vick.   The second organization that has decided to suspended all activity with the team plus reaction from fans – tonight on Channel 11 News at 11."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about \"Caitlyn\" Jenner on Facebook... now it's going viral.  Nearly half a million people just \"liked\" this post... because it's absolutely perfect.  Spread this absolutely everywhere."},{"comment_id":"10153823979101107","commenter_b":"And then Hillary would be the next POTUS.","commenter_a":"Rand can still be nominated by the libertarian party and would be a viable third party to trump and Hillary...he could take at least 20 percent from the GOP and DEM... The sore loser laws in many states shouldn't apply to him because he dropped out after Iowa","post_message":"\"Sen. Rand Paul (R-Ky.) has put a hold on the plan, with the intention to protect the Constitution, American taxpayers, businesses, and the nation’s economic health by blocking these dubious treaties.\""}]
