[{"comment_id":"1000833706595553","commenter_b":"Too bad we can't deport people who desecrate our flag, but hey, this is America and they have rights! Too bad they can't send these idiots to live in Iran, North Korea or Russia!! Let them try that there and they'll find themselves in front of a firing squad!","commenter_a":"They would","post_message":"Obama's America  Air Force Veteran arrested at Valdosta State University trying to stop Black Power group from desecrating American Flag."},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"1789900814667772","commenter_b":"She needs to leave this country ....POS !!!","commenter_a":"Idiot!","post_message":"Actress and activist Ashley Judd delivered harsh words aimed at President Trump from a poem written by a 19-year-old girl from Tennessee."},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not \"real\" muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not \"real\" muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"1717745955143572","commenter_b":"This espn reportor gets paid to ramble about bullshit. Who would even take the moron serious?","commenter_a":"Typical ESPN liberal reporter has absolutely no respect or love of country,","post_message":"Should the Team USA hockey coach be fired for threatening to bench players who sit during the national anthem?"},{"comment_id":"10154568274058690","commenter_b":"@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."}]
