[{"comment_id":"10153363808198010","commenter_b":"How do we know the restaurant would go out of business anyway? It happens all of the time. I live in Seattle and the rate increase is just slowly beginning to take effect. No conclusions of this sort can be made.","commenter_a":"In Seattle where they just raised minimun wage to $15 a hour some restaurants are now going out of businss as restaurants are having to pass on to their customers a lot higher prices for the food they serve.","post_message":"An L.A. City Council committee has endorsed a hotly contested plan to raise the citywide minimum wage to $15 by 2020, up from the current $9 an hour. The proposal now heads to the full city council."},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"1062536000443119","commenter_b":"White girls can't even right now.","commenter_a":"I went in to the Starbucks on Bay Area blvd across from baybrook mall,ready to buy coffee and a sandwich. They insisted on giving me everything \" on the house\" ! They were so kind and respectful to their customers. There was an outpouring of kindness from all who were in the store. The tip jar was full of large tips! They locked the doors right after I made my \"purchase\", but never once rushed me out of the door. This place is a class act!","post_message":"A computer outage is disrupting Starbucks sales in the U.S. and Canada, and its impacting a lot of people right here in Houston. KPRC2 Anoushah Rasta is following this story on #KPRC2 News at 10 p.m.  MORE ---> @webpagelink"},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are \"ultimately helping do ISIL's work.\"  @webpagelink"},{"comment_id":"10156235463225354","commenter_b":"Center right of what? The equator? He's a hair away from being a communist, if he's not already.","commenter_a":"If you aren't a conservative why are you s republican?what would be the difference between a democrat and republican.and ANYONE that votes for Obama is an extreme leftist period.","post_message":"What a guy!"},{"comment_id":"631924593629516","commenter_b":"STUPID C..T","commenter_a":"Cheers for Hillary from Seddique Mateen, father of Pulse Nightclub Terrorist – and ideologue supporter of the Taliban and Critic of the LGBTQ community! • Seddique Mateen, the father of Orlando Pulse nightclub terrorist Omar Mateen, was spotted sitting behind Hillary Clinton at her campaign rally on Monday, August 8, in Kissimmee, Florida. • Clinton was paying tribute to the victims of the Pulse nightclub massacre at the rally when an employee of NBC affiliate WPTV noticed that one of the rally goers seated directly behind the Democratic presidential nominee was Seddique Mateen, the mass shooter’s father. • When asked about how Mateen received this preferred seating at her rally, Hillary Clinton, walked away without answering any questions. • Who instructed that Seddique Mateen be placed in such prominent seating at the Florida rally and why would they do so? • If it was a judgment error by Clinton’s staff ...","post_message":"\"I don't think what Donald J. Trump says is worse than actually what Hillary Clinton in fact has done.\"  - Green Party presidential nominee Dr. Jill Stein"}]
