[{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"},{"comment_id":"10153164083911770","commenter_b":"Good, she needs to leave the country too","commenter_a":"Good","post_message":"An atheist councilwoman in a town amid New Jersey’s suburban sprawl stormed out of a council meeting on Thursday and quit her job after the council decided to name the town’s Christmas tree-lighting event a “Christmas Tree Lighting.”"},{"comment_id":"924000977633655","commenter_b":"WHY are their women like her???","commenter_a":"Why aren't ALL men like him? God bless him and that sweet, loving little angel","post_message":"His wife said she would leave if he kept their baby -> @webpagelink"},{"comment_id":"1044665095680389","commenter_b":"Women wouldn't exist without men we build your houses your roads your public offices we farm the food etc etc shut the duck up ungrateful twat your couldn't survive 2'days in the wild without a man to hunt or scavenge for you","commenter_a":"I love this. If a man posted a picture of a cup that said \"tears of women\" or some other bullshit these women would be up in arms. Ridiculous.","post_message":"so this I guess is a thing now???-mo  Shop.tacticalshit.com"},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"\"Her butt-length hair is now chin length. I was lucky to save that much.\""},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"479579702230323","commenter_b":"Yes","commenter_a":"Finally!!","post_message":"Do you think Hillary should be facing criminal charges right now? [Watch below]"}]
