[{"comment_id":"10153871783832232","commenter_b":"Stop being such a witch","commenter_a":"Why would a news encourage this stupid behavior there has to be more important news for them to be reporting on","post_message":"We don't recommend this, but the boys swim team from Hatboro Horsham found a new way to practice. Thanks to NBC10 viewer Kimberly McPoyle for sharing! Stay with NBC10 for full coverage of #Blizzard2016. --> @webpagelink"},{"comment_id":"10152617242161680","commenter_b":"@username When did DHS keep illegal aliens out ? They watch our borders watch them walk right in. DHS is a waste of taxpayers money. We have Military FBI & CIA.","commenter_a":"Republican Logic: \"We care so much about stopping illegal immigration that we're going to cut off funding to the Agency responsible for stopping illegal immigration.\" Just brilliant. Truly.","post_message":"Senate Democrats are considering a shift in strategy that could offer a resolution to a long Senate impasse over funding the Department of Homeland Security — and put more pressure on House Speaker John Boehner."},{"comment_id":"971619749553192","commenter_b":"Wtf","commenter_a":"Saudi Arabia is holy land and not a country prepared for war, and have no military status. Iran should know better and could not even beat Sadaam at the time","post_message":"\"Because a war between Saudi Arabia and Iran is the beginning of a major catastrophe in the region... For sure we will not allow any such thing.\" @webpagelink"},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."},{"comment_id":"10154885483751037","commenter_b":"Ugly nacty women","commenter_a":"Rachel Rauth","post_message":"Sen. Elizabeth Warren has a message for Mitt Romney."},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"1712814082319419","commenter_b":"Disbar her. So corrupt!!","commenter_a":"Prison for treason","post_message":"Continuing Live Coverage: Attorney General Loretta Lynch testifies before the House Judiciary Committee on the DOJ's decision not to charge Hillary Clinton over her personal email use while secretary of state."}]
