[{"comment_id":"2193117860914394","commenter_b":"As if I would let her lick my face when she cleans her asshole 😂😂😂 come on now","commenter_a":"@username Munro","post_message":"It's not just gross, it's dangerous."},{"comment_id":"1084090904983990","commenter_b":"TheresaStephens I don't know how you can say that. The police might have something on him and if they have he should be charged and locked up for life. And all the tax payers money your going on about let Cliff Richard pay for it if he's guilty, let the police seize all he's wealth and money and all go in police funds. If he is guilty he's nothing else but a dirty old C@@@ I don't care about he's Christian lifestyle if he is guilty he should go away. After all Theresa God hates sexual immortality","commenter_a":"Oh for goodness sake leave the man alone. I'm not a fan but, your innocent till proven guilty. So far they haven't proven a thing. I am sure there are plenty of unturned stones in the police force that need investigating?!","post_message":"Just in...."},{"comment_id":"1719965091608675","commenter_b":"Newt Gingrich said on Fox News last night that it is not we the people who picks who runs for president! Now that is one right out lie! It's like our government makes the rules up has they go! Hillary Clinton gets away with right out murder and Breaking the laws. But Donald Trump can't be our president because they know that all of there Dirty Work will come out for all of us to know and that is what they are scared of . Obama did not get enough delicates but they let him run for president and they new that there was a lot of people who where not for Obama. They just was scared of what the Black people would do if he was not picked to run for president. Well you better be scared of all of us people that is fead up with our government ...","commenter_a":"I do love Newt. stay the course Trump.","post_message":"\"Newt Gingrich on ‘Anti-Trump’ Republicans: Should Form Lost Republicans for Hillary.\""},{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"},{"comment_id":"10153268434242061","commenter_b":"we're proving it as we speak. record rainfall here in texas and it's still not over. weather is weather, period.","commenter_a":"Kevin Michael Wahler","post_message":"This is Buffalo in 2014 and 2015. First time the city has had no measurable snow in 116 years."},{"comment_id":"949896131712475","commenter_b":"Even the black panthers want to kill white folks, lets start picking them up first and do something about them standing at festivals with AK 47's and other numerous guns, quit harping about only white folks having guns","commenter_a":"IT'S TIME TO DO SOMETHING ABOUT THE IDIOT'S THAT USE THE GUNS TO KILL PEOPLE SENSELESS...JUST CAUSE THEY PISSED OR DON'T LIKE YOUR COLOR!!!!!! NOT THE GUNS FAULT...THAT IS SO STUPID TO THINK IT'S THE GUNS FAULT...THAT'S LIKE SAYING BAN FORKS AND SPOONS FOR ALL THE OBESITY!!! TOTALLY INSANE!!!!!! LET'S BAN CARS FOR ALL THE WRECKS THAT KILL PEOPLE!!!! HEIGHT OF IGNORANCE!!!!!","post_message":"HELL YES!"},{"comment_id":"10153134733596037","commenter_b":"A lot of women where I live buy as much jewelry. I don't think its extraordinary.","commenter_a":"As with Obama, the focus on a first lady is just a witch hunt. Jeb has enough of his own baggage to drag around.","post_message":"#JebBush's wife #ColumbaBush joins a long list of political spouses with a taste for extravagance. Yahoo News' Dylan Stableford reports."}]
