[{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"1510900072276579","commenter_b":"They hate immigrants but call themselves Europeans?! Ok then go back to Europe ya fuckin assholes.","commenter_a":"\"We as Europeans\" Sorry if you live in America and have done for generations your not Europeans, there are many non-white people who are more European than you Anyone who holds any level of feeling that they are culturally attached to every other white person on the planet in some way is just weird","post_message":"\"Hitler did nothing wrong! I feel like there are two sides.\" - Tila Tequila"},{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."},{"comment_id":"1338680576172411","commenter_b":"Omg pathetic!","commenter_a":"@username, a good laugh.","post_message":"This is hilarious and sad."},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"},{"comment_id":"10154312691707577","commenter_b":"Only cowards suck on another cowards goat dick the system been broken since mr queer got in office the fact that our government already let the enemies in our country soon there will be more of this false flag shootings","commenter_a":"According to Breitart...the Orlando shooter worked as a security guard for a company, G4S who has a contract with Homeland Security to pick up illegal aliens at the border & transport them inland & just release them. No legal repurcussions nothing. Obama's policies are very sinister & treasonous. And why has nobody done anything?!","post_message":"The brother-in-law of nightclub jihadist Omar Mateen hates Donald Trump, works with refugees, and liked a video on YouTube that argued Islam isn’t violent, according to his social media profiles."},{"comment_id":"844826018983911","commenter_b":"Not even close Alex... Talk about a swing and miss.","commenter_a":"Unconstitutional. Pass it all you want. Taxing something that's a Constitutional right represents an undue burden (exactly what the tax is intended to do).","post_message":"It all makes sense now....THIS is how they're going to stop people from getting guns. They don't need a ban at all..."}]
