[{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"},{"comment_id":"10153212648798690","commenter_b":"West & their illegal wars do. Racist Christine","commenter_a":"Dont go to Australia and the likes. There are a lot of other muslim friendly countries.","post_message":"\"The prime minister of Australia acted to firmly entrench in the national psyche not only that Australian Muslims are not to be trusted, but that Islam and Muslims are complicit in the 'death-cult' ISIL.\"  @webpagelink"},{"comment_id":"583735078458513","commenter_b":"Mike( @username) what makes these kinds of statements so hateful and racist in that it taxing the ancestors of one group for the actions of the ancestors of another group. The probabilities are just as likely that your ancestors dies freeing the slaves or were not even in America in the mid 1800's or that fella demanding the free $ had relatives that sold the Africans to the slavetraders. That's how it was done. Africans selling other Africans to the traders. Throughout history all groups and races enslaved each other. Many believe the pyramids were built by slaves under the direction of African Masters. Let's try it Dr King's way by judging people by their character not color. That chip on ones shoulder can get quite heavy!","commenter_a":"No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: \"I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.\" @webpagelink"},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."}]
