[{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"},{"comment_id":"10153906452296409","commenter_b":"Hahahah This is all she has. Anger lies and name calling. She would make a horrible leader. Sorry it wasn't a poll. This is the article. Trump lies more than Hillary. So what. He still will not be the next President I can't wait for you to make America Great/Safe again!! These attacks have to stop taking the lives of innocent Americans. We need a Leader that will call the enemy by name! Trump2016!!! Is there an actual plan as to where all this extra revenue will go towards? Will our personal taxes and property taxes go down? I am a deplorable TRUMPAZEE and love every moment of it. ANOTHER NO pic, NO history and NO friends TROLL - F/B is being flooded with these locally and from FOREIGN countries And why would he? He has made it this far and hasn't released them yet? It's an unnecessary risk to ...","commenter_a":"Are they crazy? Trump has had same platform and mantra since day 1. Hes not the one who bleached his servers and beat them with a hammer AFTER being subpoenaed. That was hillary","post_message":""},{"comment_id":"10155088338670615","commenter_b":"The fact he did beaky at Buckingham Palace means he has risen in my expectations.","commenter_a":"Jamie Taylor","post_message":"We ♡ Stephen Fry! Congratulations to the happy couple!  @webpagelink"},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a \"total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"  \"They have no respect for human life,\" Trump said, referring to \"people that believe only in Jihad.\"  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"1164167413602019","commenter_b":"Hillary is unelectable. Period.","commenter_a":"Look...as much as you may like Bernie, this is over. Hillary Clinton has the delegates and she will be the nominee. It's time to stop being delusional and start being realistic. Yes, Hillary may be a corporate puppet. However, that's still better than the Republican alternative. Do you really want to run this country into the ground with Trump?","post_message":"\"A ticket combining Bernie Sanders with Sen. Elizabeth Warren would leave any Republican ticket with Donald Trump or Sen. Ted Cruz ticket in the distant dust and win a landslide victory for Democrats in November.\""},{"comment_id":"10153894836055579","commenter_b":"Deport Muslims and illegals, provide help for the mentally ill. Uphold current laws. Problem solved.","commenter_a":"Can somebody explain to me the connection between the NRA and this 20 year mentally disturbed individual in Oregon? How come we don't hear Obama or Hillary talking about the thousands killed every year via violent criminals in major cities all over the US? Where's their plan to stop that violence? How many law abiding gun carrying citizens have been involved in a mass shooting in the US?","post_message":"Hillary Clinton on guns:  is wrong with us that we can stand up to the NRA? Watch full video here: @webpagelink"}]
