[{"comment_id":"1659939417632867","commenter_b":"This would be true if Hillary got in! Stupid racist black woman!","commenter_a":"Real Hope and Change is coming to Americans !!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"10152936707532377","commenter_b":"She is a moron","commenter_a":"Nothing","post_message":"What's the Difference Between Democrat, Socialist?"},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"473761302814995","commenter_b":"Get rid of all those freeloading motherfuckers.","commenter_a":"No- what part of ILLEGAL aliens does the government not understand?","post_message":"Bernie Sanders is calling for a path to citizenship for Mexican immigrants, saying \"We have 11 million people in the United States who are now undocumented and I believe they deserve a path towards citizenship... I believe that what immigration reform means is uniting families, not dividing families.\" Do you agree with this?"},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"981019435266811","commenter_b":"she is an Idiot hussy","commenter_a":"That doesn't surprise me!","post_message":"This is SHOCKING!"}]
