[{"comment_id":"10154200313034411","commenter_b":"@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"1203461079770668","commenter_b":"how did you idiots elect this stupid liberal bitch","commenter_a":"So ignorant..","post_message":"ClashDaily.com"},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"},{"comment_id":"922771304482591","commenter_b":"We all wish we could return your white asses back.","commenter_a":"Damn the ignorant white man - HisStory - his Eurocentric propaganda BS taught in public education and he can't even remember his own fucking history. Beyond head up the ass!","post_message":"Not only are they hypocritical, they are also ignorant of history."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"10153192857784087","commenter_b":"TRUMP 2016","commenter_a":"Our tax dollars hard at work!","post_message":"The sight of GOP presidential frontrunner Donald J. Trump’s plane surprised reporters traveling with the vice president, and they quickly snapped photos of the scene."}]
