[{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."},{"comment_id":"10153867165952144","commenter_b":"Obviously not Mike. If she belonged in jail, they'd have put her there.","commenter_a":"So instead of corrupt it's lazy, stupid, or incompetent...hardly QUALIFICATIONS.","post_message":"This is a really smart piece from David Corn."},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"10153287976081770","commenter_b":"@username you may be right. But on the other hand maybe thats what this country needs now. A good dose of reality. Quit voting these life long politicians in office.","commenter_a":"Trump as President??? So everyone is all right with him insulting women, rude comments about Jeb Bush, Ted Cruz, Carly Fiorina, Megyn Kelly,insulted the miltary, the disabled, John Mccain just to name a few. One of the meaniest and rude things he has done where he ripped it with me is a couple of days before Thanksgiving, at a rally in South Carolina he made fun of a New York Times reporter that had a physcial problem. Speaking as a person that has a physcial problem, that was very offensive! If I would have been at that rally, I would have knocked the living crap out of Trump! Trump thinks that he is going to be able to insult himself into The White House but oh boy, he is VERY wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"Donald J. Trump spoke highly of his wife, Melania, at his last rally before voters head to the polls in New Hampshire."},{"comment_id":"1204381342954945","commenter_b":"something wrong","commenter_a":"What the hell???????????????????","post_message":"The UK government buildings put in hock to Muslims"},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"688684917923527","commenter_b":"Bye Lil bitch","commenter_a":"Damm bye @username","post_message":""}]
