[{"comment_id":"607613792773547","commenter_b":"If this does not touch your heart nothing will amen","commenter_a":"Get that rotten PIG .","post_message":"FALLEN - NOT FORGOTTEN: The community is gathering for a vigil honoring two fallen heroes - Master Sgt. Debra Clayton of Orlando PD and Deputy Norm Lewis of the Orange County Sheriff's Office.  Meanwhile, the search for Markeith Lloyd continues: @webpagelink"},{"comment_id":"10153041187141037","commenter_b":"Which one Rebecca?","commenter_a":"Life begins when that egg is fertilized life begins when that baby Not a fetus has a heart beat life begins when that baby can survive outside the body. This isn't religion this is real talk","post_message":"In an embarrassing setback, House #Republicans abruptly decided to drop planned debate of a bill criminalizing virtually all late-term #abortions after objections from GOP women and other lawmakers left them short of votes."},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"689148981239347","commenter_b":"That's one way to get rid of the Muslims and have them leave on their own Trump wins","commenter_a":"These guys can go to? Just go! Scum.","post_message":"Donald Trump will win, and then they will have to face reality.  If they don't like it, good riddance.  Do you support Donald Trump?"},{"comment_id":"10153649045287994","commenter_b":"People are so dumb... That's all...","commenter_a":"Is a phone really worth your life","post_message":"A man was killed at Cedar Point when he entered a restricted area to look for his cell phone."},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."}]
