[{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"10154266644379087","commenter_b":"@username news flash f*ck face, when he is in office in january, he will cut off 12 billion in aid to Mexico and hence they pay for the wall, stfu and deal with you LOST, LOST,LOST","commenter_a":"Not very Presidential attacking the Press that is protected by the 1st amendment. Can you imagine the Right Wing outcry if Obama had tweeted about the negative coverage he was receiving from Foxnews?","post_message":"Trump's tweet comes just days after telling \"60 Minutes\" he would be restrained on Twitter as president."},{"comment_id":"10152747594996051","commenter_b":"@username smart lady","commenter_a":"All this complaining about someone suggesting that one be responsible when getting our tax money. This is crap something needs to be done but then again the bleeding heart unimformed idiots will start crying. Look around and show me the starving people just look at the size u don't get that size while starving.","post_message":"People getting food stamps in this state need to get ready for some big changes."},{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"\"There’s something called CEQA in California...\""},{"comment_id":"924477534340446","commenter_b":"@username your mother should have swallowed","commenter_a":"If she really wants to make America whole again, she should do the right thing, and GTFO of politics altogether. It's a start at least.","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10155889196645354","commenter_b":"Trump that bitch!","commenter_a":"She has more wrinkles than my nuts. Americans are dumb enough to vote this tramp in.","post_message":"Short memory!"},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."}]
