[{"comment_id":"10155133952496162","commenter_b":"@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.\" Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"10153003040749091","commenter_b":"Thugs","commenter_a":"Soon will catch this people what a shame.","post_message":"HOME INVASION: Men break into South Bronx home, steal necklaces, PlayStation. Watch the surveillance video of the suspects.   FULL STORY: @webpagelink"},{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."}]
