[{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"10153733539132169","commenter_b":"\"thank you for your service\"","commenter_a":"Jasmine Taylor","post_message":"Join The National Memorial Day Concert (PBS) this Sunday at 8/7c for an evening of remembrance, featuring General Colin L. Powell, Renée Fleming, The Beach Boys, Katharine McPhee, Trace Adkins, S. Epatha Merkerson, Esai Morales, Alfie Boe, Trent Harmon Music, Maestro Jack Everly and co-hosted for the eleventh year by Joe Mantegna and Gary Sinise. Join the conversation at #MemDayPBS"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"888955024560582","commenter_b":"Yeah!!!","commenter_a":"@username @username lunch 2mrw?!","post_message":"When you realize tomorrow is Friday... (click to play)"},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""}]
