[{"comment_id":"450316191825628","commenter_b":"Fuck that dumb bitch!!!!!!!!","commenter_a":"bye bye Michelle, go peddle crazy some place else. Go ask the thugs in Chicago for their guns first. Try going there without a cop. LOL","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10153223558734726","commenter_b":"She has already stole enough","commenter_a":"She can just get over her self classless wonder","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"10153200452766051","commenter_b":"I do not agree with celebrating Columbus day or the fact that he slaughtered the American Indians, however, I was born in this country where we speak English. I've spent 12 years in the Army proudly serving my country against all enemies foreign and domestic. I am against anyone that threatens my country not diversity - I'm against the law that enables illegal immigrants having children in this country and said children being natural citizens.","commenter_a":"It's not racist, we speak English in AMERICA, if you want to speak Spanish then go to or go back to fucking Mexico","post_message":"When this IHOP customer heard what language a fellow customer was speaking in, she snapped."},{"comment_id":"10152821814048717","commenter_b":"Lmao truth hurts!","commenter_a":"good job Rivas. leave the cheaters behind","post_message":"After helping the New England Patriots win the Super Bowl, Darrelle Revis has decided to go back to New York. The cornerback agreed to terms with the Jets Tuesday, his agent said. @webpagelink"},{"comment_id":"10152966596170399","commenter_b":"And all these illegal f$^%ers are going to Disneyland!","commenter_a":"Hire a illegal alien get a $5000 fine! A New Border Surge Opens Us To Surge Of Epidemics Border Surge: Secretary of State John Kerry warns of a new surge of illegals, just as Central America is being hit by a new wave of epidemics. No doubt about it: President Obama's open-borders policy is exposing us to disease, too. It's plain what's bringing up this great wave of diseases: immigration politics. President Obama is so obsessed with winning Latino votes for Democrats by neglecting border laws that he's unwittingly opened the U.S. up to a variety of third-world diseases. He's released tens of thousands of medically unscreened illegal immigrants into the U.S., supposedly to prepare for their immigration hearings, which 70% never show up for. The epidemics are small now, but the risk is rising. And with a new wave of illegals in the pipeline, where's the will to stop ...","post_message":"\"Anti-vaccination is tailormade for deeply selfish people, because it gives them a chance to show off how superior they think they are while shifting the cost of their choice on other people.\""},{"comment_id":"10152694335031094","commenter_b":"^Calls other women whores^","commenter_a":"Anti-science lunatics...UGH!!!!!!","post_message":"The federal government has confirmed more than 100 people across 14 states have now developed measles. Will state governments respond by rescinding personal belief exemptions for parents who choose not to vaccinate their children?"},{"comment_id":"986949048053489","commenter_b":"Yes take her to Court","commenter_a":"Do it! Do it!","post_message":""}]
