[{"comment_id":"10155521409275354","commenter_b":"Europe is more evil but we r getting there","commenter_a":"The US is so backwards when it comes to nudity. It's commonplace in Europe.","post_message":"Free the Nipple!"},{"comment_id":"1202853869734641","commenter_b":"Muslim go home","commenter_a":"I don't believe we should elect a president so delusional he believes the Earth is only 6000 years old and that going to prison can make a person be gay...","post_message":"\"I would not advocate that we put a Muslim in charge of this nation,\" Dr. Ben Carson told Meet the Press."},{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"},{"comment_id":"10153724288582577","commenter_b":"Your wife is ugly.","commenter_a":"Fuck you Zuckerberg. I'm gonna blast Facebook non stop u faggot piece of shit","post_message":"Facebook CEO Mark Zuckerberg was caught discussing the censorship of anti-migrant posts at the United Nations development summit Saturday while speaking with German Chancellor Angela Merkel."},{"comment_id":"831331320235298","commenter_b":"Go back to Italy ya wop","commenter_a":"Reveal his name.","post_message":"A soon-to-be police officer just posted this comment publicly to our page. Is this a thinly disguised threat of violence against citizens? Doesn't sound like this guy should be allowed to roam the streets with a loaded gun in the near future."},{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."},{"comment_id":"1709198036011185","commenter_b":"@username!!!! Stop!!!!","commenter_a":"Jenna Pitt @username","post_message":"The baby is the first in the continental U.S. to be born with the Zika virus-related brain condition."}]
