[{"comment_id":"495256197331627","commenter_b":"She can't ban nothing she is just a picture hanging on the wall so tell her to stay out of Americans business","commenter_a":"So sad","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10154584084924166","commenter_b":"no more cover girl for me","commenter_a":"How stupid!","post_message":"The makeup manufacturer calls him a \"boundary breaker\" who will appear in an upcoming commercial. What are your thoughts on guys and makeup?"},{"comment_id":"451531238383723","commenter_b":"she also thinks we can't deport 20 million illegal parasites. boy is she in for a big surprise. a needy, insecure, unaccomplished , doormat to a serial women abuser.","commenter_a":"Have fun I will not hand mine over","post_message":"Hillary Clinton is Coming for your Guns!"},{"comment_id":"916358841790504","commenter_b":"Gee Sara. you really ARE a blonde.","commenter_a":"Even religious organizations support planned parenthood. Your turn, republicans. Now you can't even use your Christian arguments...","post_message":"Fifty-six religious organizations are standing up in support of women's health and rights."},{"comment_id":"1031910293529802","commenter_b":"Stick to what u know lady. Some people don't much care for foreigners telling us what US values are","commenter_a":"She's a citizen by a marriage not by birth,besides she is just repeating what she hears loony clooney says","post_message":"DAUGHTER OF SUNNI MUSLIM, George Clooney Wife, Open Borders Activist And British Citizen Says Trump Doesn't Represent \"U.S. Values\""},{"comment_id":"450286948495219","commenter_b":"Jo Jo What ever bitch, I have never called the cops and never will when I wish to commit suicide I'll call the pigs. You are a statist bitch.","commenter_a":"Whats the difference? Police are thugs.","post_message":"Do You Support Our Police Over Thugs?  Comment 'yes' or 'no'."},{"comment_id":"903633816370041","commenter_b":"I saw this when I heard about it on the radio this morning. Lol","commenter_a":"Rudis Fernando Amir Casey Jeremy Jose Antonio damn","post_message":"No Brotherly Love: Eagles Play Drake's Back 2 Back Diss During Practice!"}]
