[{"comment_id":"1309667302402021","commenter_b":"obuma=PUKE! TRAITOR!! LIAR!! DIVIDER!!","commenter_a":"OH GOOD GRIEF THEY JUST CAN NOT GET OVER IT!!! THAT THE AMERICAN PEOPLE ARE SICK AND TIRED OF ALL THE DEMOCRATIC CRAPP AND LIES!!!!","post_message":"Trump SILENCES OBAMA!"},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"1003361709753187","commenter_b":"Coming from someone who puts stupid cartoons of her self on Facebook! Lol. Maybe Leslie could get a brain in the next one and give up on Hillary!","commenter_a":"When trump gets elected maybe this bug eyed freak will leave and take his high girlish voice with him","post_message":"*Shivers*"},{"comment_id":"1210507815635913","commenter_b":"No cop killers are by definition an individual who's killed a cop..An old lady with no criminal pass and bake cookies for the local fire department can be a cop killer if ever she kills a cop doesn't make her a thug though.You see by definition there not the same you can be one and not the other.","commenter_a":"RIP, condolences to his family. And, NBC would you please refer to him as a police officer and not a 'Cop'? That's disrespectful","post_message":"Officer Gregory Alia was shot and killed after responding to a call about a suspicious person inside a shopping mall."},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that \"Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.\""},{"comment_id":"1334018773303346","commenter_b":"Lol you need to work a lot harder to be crowded like India or China😂😂😂 but real talk tho, the US is currently taking up way too much resources for it's population. And if this population spikes, there are gonna be some shortages and wars...","commenter_a":"I am against both an my reason is. That our country isn't growing by size but we keep letting in millions every year one day this country will be over crowded like India or China","post_message":""}]
