[{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"10154380383764091","commenter_b":"Hoe shut up!","commenter_a":"Thank gawd he is out! Worst president ever. They want to praise the south side of Chicago,but have done nothing to help the killings in the city where they got their start. Turned their backs on them","post_message":"\"You've made me proud. You've made the country proud.\" President Barack Obama gets emotional as he takes a moment to acknowledge his wife, First Lady Michelle Obama. @webpagelink"},{"comment_id":"1307978642581533","commenter_b":"@username,you're lying, white folks were looting,breaking in stores,starting fires at the riots especially in Ferguson. As a matter of fact,the cops had pulled over a pick-up truck with 4 white guys in it with molotov cocktails. And this was Ferguson. In Atlanta, 10 white people were arrested for trying to block traffic,they were the first to do it. During the L.A. riots, white girl made the front page. She was running out of the store arms full of clothes. And you have never heard a black person say they burn and loot because of their culture. So you're lying again. Speak on the whites that loot and burn when their favorite team loses. Stop acting like whites are not out here doing the same. Oh boy, I should have known you was going to bring the President into the post,typical of your kind. Always finding a reason to blame him. ...","commenter_a":"Black on Black crime strikes again. No outrage as usual by BLM or anyone in the racist black groups of Cop haters. Where's the concern for this boy ? No concern since it was a \"Culture\" killing ? Heard that whites don't understand their \"Culture\" I understand you folks don't give two shitts when it's black on black crime.","post_message":"A 3-year-old boy on a shopping trip with his grandmother was shot and killed during an apparent road rage incident, police said. @webpagelink"},{"comment_id":"10154173925206498","commenter_b":"She'll give birth at 2-3am like most animals do lol","commenter_a":"The guy in an earlier video said it can take hours to days for the birth to happen it is when nature is ready for it.","post_message":"GIRAFFE CAM: April the giraffe is about to give birth. @webpagelink"},{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"}]
