[{"comment_id":"10153190819521602","commenter_b":"Telling you..bitches love it!!","commenter_a":"Personally i think they should have beat her like Rodney King. Broads really like that!","post_message":"The officer was placed on desk duty after video images showed him taking a 15-year-old girl to the ground during an arrest at a St. Patrick's Day parade."},{"comment_id":"890315697769072","commenter_b":"@username boycott the Shamrock inn, this pos. people are more dangerous than animals.","commenter_a":"If the bear was causing harm that's one thing. But he wasn't, he was minding his own business only to be stalked by this idiot. Honestly, why don't we hunt down this creep and see how he likes it?","post_message":"A sad day for the hundreds and thousands of animals lovers who were following the story of Pedals the bear.  The bear that became famous for roaming around New Jersey on his hind legs like a human has been killed during New Jersey hunt.  A hunter shot the bear with a bow and arrow.  The hunter has reportedly been stalking Pedals for three years."},{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"}]
