[{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"980597458645157","commenter_b":"Let's start following it, shall we?","commenter_a":"God bless the Constitution of the USA","post_message":"Happy Constitution Day!"},{"comment_id":"10153462081617452","commenter_b":"Get a life lady!!","commenter_a":"She should be FIRED ...","post_message":"\"You're saying I can't have a hairstyle because of your culture? Why?\"  San Francisco State University is investigating a confrontation between a black student and a white student over dreadlocks."},{"comment_id":"10153708079877377","commenter_b":"How is Hillary going to debate? She can't even keep all her lies sorted out! Trump will wipe the floor with her!","commenter_a":"Hahahahaha...........2 points? In your dreams! The election is over. Trump has not a chance to win against Hillary. If Trump will show in the debate, Hillary will chop him into pieces. Trump's ignorance about political issues will be seen & witnessed by the entire world during the debate.","post_message":"Hillary Clinton leads Donald Trump in the presidential race by only two points — but factoring in the margin of error makes it a dead heat, a new poll from Rasmussen Reports reveals."},{"comment_id":"10153363483281770","commenter_b":"Vincent N Laiza. He wants to stop illegals crossing the border for 1. Tax payers are taking care of them. We can't afford them 2. Many people coming across the border are criminals. 3. Many people carrying disease and have never had vacinations 4. Terrorists are sneaking into our country. All the above items do not just include just mexicans they are going through mexico to get in","commenter_a":"Florida, Ohio, Illinois, Missouri & North Carolina lets keep winning, vote Trump 2016. Full speed ahead Mr. Trump. We will do this, vote Trump 2016!","post_message":"BREAKING: Donald J. Trump wins the Florida Republican primary.  Read more: @webpagelink"},{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"}]
