[{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"1386022938105786","commenter_b":"Build a wall all around California lol","commenter_a":"Seriously they had to conduct a study?! I think most of us true natives already knew that without conducting the study and it's been like that for years. We have way too many people coming here from other states and something must be done to control the population here; it's really just a joke now.","post_message":"It's official: California is the worst state for drivers. 🚗"},{"comment_id":"514464205408539","commenter_b":"I think I'm going to be sick. These cockroaches need to get the hell out of the US and take your brother Obama with you.","commenter_a":"God is watching.....","post_message":""},{"comment_id":"593410574181627","commenter_b":"Ex hoe for first lady wtf","commenter_a":"I wish my middle class friends a I could afford to buy that, oh, I forgot, there is no middle class","post_message":"Melania Trump, the first-lady-to-be, wore a $4,000 Ralph Lauren silk crepe jumpsuit  made in Italy on election night. #Election2016"},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'\" one parent said."},{"comment_id":"1125267834218418","commenter_b":"His old ladies big ass!!","commenter_a":"Oh puleeze.....","post_message":"Obama posted this \"Happy Easter\" pic on Sunday, but it didn't take long before people started noticing 1 enormous problem.  Did he just get caught in a sickening lie? Probably... but decide for yourself."},{"comment_id":"704906709652228","commenter_b":"What a joke this lady is. I bet she is protected by Guns every single day... But she doesn't want Americans to be able to protect themselves. Just ridiculous","commenter_a":"Yah, just fill out form ID-10T and they'll ship a gun right to your doorstep Mrs. Douchebag. This is exactly why the establishment left cannot have nice things.","post_message":"“You shouldn’t be able to exploit loopholes and evade criminal background checks by buying online or at a gun show…We have to make it harder for people who should not have those weapons of war.”  – Hillary Clinton reacts to the #OrlandoShooting @webpagelink"}]
