[{"comment_id":"1002765619855375","commenter_b":"She's not that classy oh wait well anyways lmfao whatever get off the trip people smh","commenter_a":"I think it's funny how she's trying to show \"modesty\" When we've all seen her naked already. Lmao","post_message":"Social media thinks Melania is channeling Jackie O this morning. Your thoughts? @webpagelink"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"971724402865796","commenter_b":"Why does having a child who is American entitle one to come to USA to live? Child should leave when parents leave due to illegal status or visa expiration. They can come back on their own when of age.","commenter_a":"this is not all that is in the 14th amendment. It is only a part. there are other antiquated clauses that really formed America after the Civil War. Section 2 guaranteed that southern people would not have a say in politics for at least 2 decades. We have a president now that should be impeached for treason per this amendment, bill Clinton should never had been allowed in politics per this amendment, America's judiciary ignores whatever they want. the entire amendment needs reviewed not just one sentence.","post_message":"This may surprise a lot of liberals and Republicans alike. Spread this everywhere!"},{"comment_id":"10153675997090779","commenter_b":"Dumb ass","commenter_a":"Good for him.","post_message":"Joe Walsh has revealed that, come November, he won't be casting his vote for Hillary Clinton or Donald J. Trump. Watch him explain why below."},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable  It is amazing to see to what extent the Democratic party will try to derail Trump's campaign.  Do you stand behind Donald Trump?"}]
