[{"comment_id":"1351703334882522","commenter_b":"He should be raped to death by chainsaw","commenter_a":"Place him in the general population of prison. He won't last. That is the one crime they don't tolerate.","post_message":"Petition Created To Publicly Hang Benjamin Taylor, Who Raped 9-Month-Old To Death!  This guy is sick, its our duty to make sure he never harms another child."},{"comment_id":"10150581639814999","commenter_b":"its called cheating and it is still cheating if the score 47-7 hope you dont have kids...","commenter_a":"Seems like a very very cheap price for a championship","post_message":"A report commissioned by the NFL concluded that it was “more probable than not” that Tom Brady was aware of New England Patriots personnel deflating footballs to gain an advantage against the Indianapolis Colts."},{"comment_id":"10156523926480354","commenter_b":"what idiot would vote for the bitch-","commenter_a":"I knew she was cleaning up crap. It continues to spew from her mouth.","post_message":"The QUEEN Shall NOT Use the Restroom With The PEASANTS!!!"},{"comment_id":"1150014791717682","commenter_b":"Can we class-action sue her for discrimination, like the gays do when you won't bake them a cake? And why not? What's the difference?","commenter_a":"Another idiot committing corporate suicide!","post_message":"Maine Restaurant Owner Bans Owners and Supporters of AR-15 From Restaurant"},{"comment_id":"992656437438363","commenter_b":"Ban cars and booze. They made her do it !!","commenter_a":"The amount of unregulated stupidity shown by this younger generation is just absolutely astounding. It just blows my mind bravo idiots bravo","post_message":"Police couldn't believe what they were watching unfold live:  “After 30 years of law enforcement I hadn’t seen anything like this before.”"},{"comment_id":"1247830038560637","commenter_b":"Don't care! Neither of these boobs is worth 2 shits under a bird! Garbage on two feet both!","commenter_a":"NEVER WILL BE THE BEST FIRST LADY. GO TRUMP.","post_message":"Will voters care about controversy over Melania's speech?"},{"comment_id":"1418440301796751","commenter_b":"Looks like even white deer are emboldened by a Trump presidency. They must be racist!","commenter_a":"They are beautiful. I would love to see one up close.","post_message":"This is a rare sight: Not one but THREE albino deer spotted in a yard in Wisconsin. One out of every 20,000 deer is albino, making them so rare they're illegal to hunt. MORE: @webpagelink"}]
