[{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"},{"comment_id":"10153061445106167","commenter_b":"Kirsten Miller - ironic that you have a rainbow avatar while desperately trying to appease muslim terrorists. now go put on your burka and be quiet.","commenter_a":"Oh so now it's America's fault a Muslim shot and killed our members of our military. And liberals are once again showing there true colors. Anyone who buys this garbage is the problem.","post_message":"Why does the media ignore how violence is now a part of American culture?"},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"10153860204493598","commenter_b":"She probably has no problem selling those little body parts.I wonder how those people will answer God when they stand before Him!","commenter_a":"More like satan","post_message":"Wendy Davis is Dedicated to Promoting Abortions With God’s Help: “By God, We Get Back Up”"},{"comment_id":"10153734321486350","commenter_b":"You guys have kickass daughters :)","commenter_a":"Last year my daughter heard a football coach at my sons practice tell the boys they were playing like a bunch of girls. This year she is showing them how girls really play. Team captain and can take down every boy, she is playing on the line for both offense and defense. #girlscanplayfootballtoo","post_message":"\"The boys on the team were apprehensive at first, but then she laid a hit on someone and they realized she's just another player with a ponytail."},{"comment_id":"1695494594049179","commenter_b":"And who's fault is it that the cartels exist ?? -- Your people! The youth in your country and their parents . The main fact that ignorant Americans either fail to realize or completely ignore is that America is the #1 drug consumer country in the world ! In order to be a business there needs to be a demand. Your society is demanding drugs you people are raised on terrible values and customs which is why you are heavily consuming drugs ! If your government could find a way to avoid that demand and necessity the business would cease to exist. Your people are indirectly the cause of the blood that sheds south of the border . Of course you didn't do your research properly! BITCH.","commenter_a":"#BringBackJonStewart ... Sorry, but you're misinformed and simply not funny Trevor. You obviously never visited a border town where cartels are actively kidnapping Americans. This is happening right now, while you attempt to make unfunny jokes about the problem","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"}]
