[{"comment_id":"886743024681887","commenter_b":"She dumb as hell she a pretry house but no one is home","commenter_a":"COMING UP NEXT..... - \"STACEY DASH\", \"APOLOGIZES!!!!\" (You SEE IT HAPPEN, All the time :\\\\ )","post_message":"Stacey Dash Believes Rape Victims Are Bad Girls Who Like To Be Naughty... @webpagelink"},{"comment_id":"1772229929682875","commenter_b":"@username In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion ...","commenter_a":"Trump represents everything that is wrong with America. A narcissistic opportunist, a pathological liar, a clueless idiot, an unashamed con man and an unapologetic bigot!","post_message":"Imagine this man in charge of our men and women in uniform."},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought \"Oh well, if a 60 year old can do that, I can, too\". That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.\""},{"comment_id":"10153864924433984","commenter_b":"she should be sent to self defense classes .","commenter_a":"Sadie, the bully, should be charged with felony assault. Punishment: lengthy juvenile detention and expulsion from school AFTER standing in front of her school during AM student drop-off and PM student pick-up wearing a sign stating, \"I am a BULLY!\" Her parents should also be made to stand beside her donning signs stating, \"We raised a BULLY!\" and have to pay restitution to the victim's family.","post_message":"A 5th grade bully decided she was going to throw her weight around to torture another student at her school. However, she was about to find out that's not how things work...  She got justice, and she got it fast."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!\"","post_message":"President Donald J. Trump: \"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!\""},{"comment_id":"1050627531700165","commenter_b":"Go Hillary!","commenter_a":"I don't think Republicans even talk a good game. Nothing but LIES and the people who vote for them are too stupid to see it.","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"}]
