[{"comment_id":"10154239882011509","commenter_b":"So is everyone just supposed to sit back and watch how ISIS does whatever the hell they want? I think not. War is a terrible thing, innocent peolle die just like they did in France and just like they did in other wars. It can't be justified, but if nothing is done about the situation we will all be required to memorize the Qu'ran soon, not to mention have our way of living destroyed by these pigs.","commenter_a":"French warplanes take off from an aircraft carrier,killing #InnocentChildren in #Syria and #Iraq","post_message":"French warplanes take off from an aircraft carrier, attacking #ISIS in #Syria and #Iraq.   The latest: @webpagelink"},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"482294165294497","commenter_b":"Our home, our laws. Get out of our country!","commenter_a":"Kick islam out of America.","post_message":"First our schools, then our public areas, what's next?  'SHARE' this post, we have to let the nation know what the MSM won't.  Do you agree Shariah must be stopped?"},{"comment_id":"10153876150456680","commenter_b":"Libs can't ubderstand acting in legal ways. No wonder they so adore ILLEGAL aliens.","commenter_a":"About the taxes. Trump did nothing outside the law. So he really is a genius. He employed tens of thousands of people and according the the law, he paid the required taxes. Now the democrats are mad that Trump complied with business laws set by Democratic governments and utilized these laws properly? A bunch of hypocrites. #TrumpPence2016","post_message":"“Almost everybody else is getting poorer.  And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax,” Bernie Sanders said."},{"comment_id":"1038035722930072","commenter_b":"For all you little girls out there here is your biology 101","commenter_a":"Al u people that stand with planned parenthood are just as disgusting as they are., hope your babies don't get ripped apart limb from limb you sick bastards","post_message":"#BREAKING: \"Planned Parenthood & our CA affiliates today filed a lawsuit against the people behind [the] widely discredited video smear campaign,\" tweeted Planned Parenthood president Cecile Richards."},{"comment_id":"10158795471470206","commenter_b":"My smartphone is a machine-gun!","commenter_a":"Journalism....there's the headline, then there's the complete opposite being stated in the article. Maybe the journalist just didn't understand that big word 'refuted'.","post_message":"The Superior Court of Justice decided to punish the players for failing to play their match."},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."}]
