[{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10157152900750206","commenter_b":"I was with the writer until he called Manziel \"talented.\"","commenter_a":"Who cares!! He's a spoiled little brat that had everything handed to him. he has no class and a horrible role model for our youth. He shouldn't even be in the NFL..","post_message":"The football player's own father said, \"I truly believe if they can't get him help, he won't live to see his 24th birthday.\""},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"1150426991676729","commenter_b":"We could put all Muslims on Atlantis and let them fight it out! Yes, I know it is a fantasy that Atlantis existed but believing Islam can coexist with the rest of the world is a fantasy, too. Best hope the idiots get there and drown vforevthey realize they have been had. Obama can lead them with Hilary behind. My fantasy! Sorry, but I have problems.","commenter_a":"Way to go Angola","post_message":"Muslims have been asked to tear down their own mosques under threat of paying for the demolition fees...."},{"comment_id":"503579846468637","commenter_b":"Why argue with this man child?","commenter_a":"Remember the outrage over the clock kid? Let us see if libtards and media worry so much about Christians being singled out to die.","post_message":"\" He seemed skittish, always looking over his shoulder to see if anyone was watching.\""}]
