[{"comment_id":"10154717381688128","commenter_b":"Liar, liar pants on fire! Immigration takes jobs from Americans and suppresses wages! Illegals have destroyed this country !","commenter_a":"Well Da, this country is made of immigrants","post_message":"A comprehensive study from the National Academies of Sciences, Engineering and Medicine shows that immigrants coming into the U.S. have helped the economy in the long haul and had little lasting impact on the employment levels of native-born Americans. The conclusion runs counter to a popular narrative suggesting that immigrants take the jobs of U.S. citizens."},{"comment_id":"10153809413306101","commenter_b":"Oh give me a break. This silly leftist woman is acting like a jerk.","commenter_a":"I cannot believe what you have said. I myself really don't care what she has to say and I would disagree 100% with her!!!!","post_message":"Donald J. Trump may want to listen to Eva Schloss about what racism looks like."},{"comment_id":"10153617541751770","commenter_b":"As Hillary would reply, \"What difference does it make now? I've WON! Sadly, has she?","commenter_a":"You have no anything to go on except you love to hear your lips flap self righteousness find some proof not just the dolts you hang with","post_message":"Dana Perino destroyed Hillary Clinton in an epic rant over her use of a private email server..."},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"552329344892078","commenter_b":"Impeach her! She's suppose to be UNBIASED. What a joke","commenter_a":"Term limits asap","post_message":"Supreme Court Justice Ruth Bader Ginsburg bashes Donald J. Trump, calling him \"a faker\" and criticizing him for not releasing his tax returns."},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"10155472847782178","commenter_b":"This about sums up his platform. To bad his plans don't include everyone. Especially when it comes to healthcare. Did you know that if Obama care is rebuild and replaced if you have a pre-existing condition then you cannot get medical coverage just like before during the Bush administration","commenter_a":"Truth! Dirty Donnie is playing us like a fiddle! All about him so he can make $$$$! He is not FOR anything but himself! Do you really think he is for you blue collar workers or the struggling middle class? Once he gets what he wants, he'll throw you to the gutter like a piece of trash. He is all about the $$ going into his pocket. His \"plan\" would put the workers back into the industrial age. Company town and company store, no unions, no rights, keep your mouth shut and just maybe you won't get fired, thrown out of your home, and dumped on the street! Tax cuts for the rich and everyone else can pay for it. Build a personal defense for to consolidate his power, throw opponents in jail, purge the government of the opposition,and align himself with his buddy Putin! Run away from NATO allies ...","post_message":"Donald Trump's priority today is clear: His personal brand and business."}]
