[{"comment_id":"10153655061641336","commenter_b":"There not illegal immigrants, they are Illegal Aliens. Death penalty for them!!","commenter_a":"Deportation or jail time is not good enough, eye for an eye. Capital punishment","post_message":"“This was not a random incident,” Sheriff Mike Chapman said at a news conference Saturday. “The suspects and the victim were known to each other.”"},{"comment_id":"10154140456978256","commenter_b":"Sara Califf.....Illinois doesn't have a taxing problem... They have a spending problem.... Bloated government is Illinois problem.... Too bad the pensioners are the ones who will suffer","commenter_a":"Democrats need to raise taxes to keep Illinois, and Chicago government revenue stream to maintain the bloated government.... Probably need to build a wall around Illinois first, to keep resident's from leaving for other states","post_message":"Election-seeking Illinois Comptroller Leslie Geissler Munger plans to delay monthly paychecks for lawmakers and statewide officials, saying there isn't enough money to pay the state's bills and other services should go to the front of the line."},{"comment_id":"556378537889545","commenter_b":"Freaking self-professed child molester. Figures she would be a surrogate for killary","commenter_a":"ok, Im wondering etf is lean dumbham ??","post_message":"Just when you thought she couldn't sink any lower..."},{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"1371941172817349","commenter_b":"TRUMP AMERICAS WELFARE QUEEN!","commenter_a":"Bahaha, looks like your corrupt Hildabeast hasn't paid em either. Oh and why don't you ask the Haitians how much of that Clinton Foundation windfall made it to the Haitians. You liberals are absolute blind sheep. Don't you think if Trump broke any tax laws that Obozo's IRS henchman Koskinen would have taken him down already? Can't you leftist idiots run a campaign on pressing issues of the day rather than ad hominem attack and character assassination? Oh, I forgot you can't cause you fools have nothing other than soap opera drama. Hey, did ya hear Kardashian got jacked in France today? Bwahaha, such useless idiots, the lot of you!","post_message":"Contrary to Trump's claims, undocumented immigrants contribute roughly $11.64 billion in taxes every year."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired \" think and grow rich \" schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly \" built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10155567292775294","commenter_b":"She was making over $20 an hour..... This has nothing to do with wages","commenter_a":"If Walmart would pay decent wages this would not have happened","post_message":"The woman is accused of stealing from the Decatur, Texas store for more than a year, sometimes stealing thousands of dollars a day:"}]
