[{"comment_id":"10156505662180354","commenter_b":"Give the stupid bitch the boot for good. Free her up so she can go over the Syria and suck up to those murdering rag heads.","commenter_a":"GOOD! This \"professor\" NEEDED to be fired!","post_message":"Read the Christian college's powerful statement..."},{"comment_id":"10153865270269749","commenter_b":"Gillian..you too are vermin! We must make sure that you do not breed indiscriminately!","commenter_a":"Foxes are vermin and very distructive for farmers, not the cuddly toys as always portrayed by the media. However what is the most humane way to cull them.. A bullet is best but only if you are a very good shot as a wounded fox can take days to die. Poisoning is also a slow death. Trapping is just as bad as they can take days to die or try and chew off their own paws. So it looks like there is no easy answer, and no we cannot just let them breed indiscriminately without some control as you would understand if you saw the havoc they can cause especially in the lambing season.","post_message":"\"Fox hunting is a pursuit from the past and like the overwhelming majority of the population I believe that is where it should stay, consigned to history.\""},{"comment_id":"1004919146212988","commenter_b":"I absolutely agree, bit discouraged by the corruption of our politicians which when it comes down to it is our own fault. But Liberty, freedom, and the right to self determination are Gods greatest gifts.","commenter_a":"agree","post_message":"Do you agree with Calvin Coolidge?"},{"comment_id":"1256135284407480","commenter_b":"Er, spider silk has almost nothing to do with a spider's reproductive system, other than if some species use it for mating rituals. So I don't think you can rape a spider. If they were to take off the harmless pins, it would find a corner and immediately start building a web, because it's a spider and it has no conscience. The closest I can relate to this spider is giving blood.","commenter_a":"Wow. That's horrific and pretty fucked up","post_message":"Poor spider!"},{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"10154165530049087","commenter_b":"Ironic. Very. Seeing as his white queen did the exact thing he's bitching about","commenter_a":"Who gives a SHIT? I certainly don't care about Podesta's emails...not from before, during or after....fuck Wikileaks. Here's a thought, Mr. Assange, perhaps if you surrendered to the British Authorities for violating the terms of your bail, returned to Sweden to face the rape charge against you and STOPPED being a puppet for Russian Intelligence, maybe I'd take you seriously? The fact remains you broke the law and you lose all moral high ground when you want others punished but not yourself.","post_message":"BREAKING NEWS"},{"comment_id":"10153689692760530","commenter_b":"Are you on crack?","commenter_a":"15","post_message":"Fill in the blank: The Michigan State Spartans will finish with ___ wins this season."}]
