[{"comment_id":"885477798171651","commenter_b":"Get out of here","commenter_a":"The Senate intends to rid this man from his job.","post_message":"(Video) The U.S. Muslim population has vastly increased under the Obama administration and set to continue to do so on an ever increasing scale.  What generally happens to societies as the Muslim population increases?   A work by Dr. Peter Hammond provides some insight...  Read More:  @webpagelink"},{"comment_id":"10154482424522144","commenter_b":"White, \"christian\" males should be put in concentration camps as they have killed more Americans than muslims","commenter_a":"They don't fit his fantasy of a dystopian world???","post_message":"Actually, it's Trumpnot the mediawho's ignoring certain terror attacks. Guess why."},{"comment_id":"1165479466892468","commenter_b":"Bitch please","commenter_a":"@username HAHAHAHAHAHA","post_message":" #WSHH"},{"comment_id":"10153486843809091","commenter_b":"I hope his whole family is murdered in front of him","commenter_a":"Good!!!!","post_message":"JUST IN: A teen  from Paterson who was involved in a 'knockout game' attack posted to social media has turned himself into police. --> @webpagelink"},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're \"yucky\"? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"}]
