[{"comment_id":"10152723762841545","commenter_b":"WE OCCUPY THEIR COUNTRIES FOR MONEY!!!!!!!! how would you feel if that happened here. we had foreign soliders occupy us for 10 years for the elite to make more money based on lies!","commenter_a":"The more you know liberals","post_message":"Three students from campuses including University of North Texas, University of Texas at Arlington, and at University of Texas at Dallas each reported being the targets of anti-Muslim threats this week."},{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On \"Justice,\" Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"10153307488209087","commenter_b":"Read it again, silly bitch.","commenter_a":"Clinton was the one who started the whole \"birther\" movement against Obama. I wonder what she has planned for Sanders.","post_message":"“She is very much trying to put Bernie Sanders on the defensive, and it may be that she feels she has a chance to put this race away,” one Democratic strategist said about Hillary Clinton. “I think a lot of this is trying to end this campaign as early as possible and basically blow Bernie Sanders out of the race.”"},{"comment_id":"10153142130722235","commenter_b":"Girl/women also have far more uti's then intact men do.. In case you weren't aware.","commenter_a":"It's way cleaner. As a mom of an ADHD child that took several years to potty train and several more to learn to wipe correctly, I don't regret following my Drs & husband's advice.","post_message":"The main reason we have circumcision in the US today is not for the health benefits.   It’s because we’re used to it."},{"comment_id":"10152609113745950","commenter_b":"Those \"children\" walk around with ak-47's and would not hesitate to kill an American or any other national that isn't one of their own upon first sight. They are bred with hatred from birth. Sad to say they are already tainted. BOMB THEM ALL! What do you do when roaches run rampant in your house? You call an exterminator correct? Do you take the baby roaches into consideration simply because they're innocent? It's still a roach. BOMB THEM ALL!","commenter_a":"When we get a President with a backbone to go into these countries and bomb the hell out of them, we will continue with these problems....Clean house no matter if there are innocent people or not....Get the Job Done Now...","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10153895371347452","commenter_b":"@username. Well you are not a very educated woman. I hope you don't reproduce! This world doesn't need more deplorables.","commenter_a":"Really ?! Just because he says vulgar things about women who cares ! And I am a woman! Least he isn't hiding emails or having innocent people killed!!!!","post_message":"Donald J. Trump was caught in a 2005 video making vulgar comments about women. He issued an apology and added, \"Bill Clinton has said far worse.\""}]
