[{"comment_id":"10154728095336336","commenter_b":"If it was a girl ,she may have gone home with a hook up","commenter_a":"This is awesome! I would eat at Original Joes if they had one in my town! Kudos to the woman who chose to get a ride home instead of driving!","post_message":"After deciding to take an Uber home, she returned to her car the next morning and found quite the surprise."},{"comment_id":"1349008868469783","commenter_b":"Yes that will be great. Why don't you go hang out with some of those Jew loving Muslims and see how that works for you. She is just like Soros another self hating Jew.","commenter_a":"MOOOOOORRRRROOOOOON","post_message":"Total solidarity ... or something."},{"comment_id":"927123483991626","commenter_b":"Oprah is a racist","commenter_a":"Yes !!","post_message":"Oprah threatens anyone who opposes Obama.  Get that liberal trash off of TV.  Do you think Oprah is the racist?"},{"comment_id":"10153777739548690","commenter_b":"But the don't need people like you black monkey","commenter_a":"Long live Israel long live the Jews... I just wish i was an Israelite so i can walk into the occupied west bank and tell those occupying Muslim extremist that God gave that land to the Jews... Jews fight for their right...i love the Jews with my life. God bless Isreal.","post_message":"Inside Story: Israeli government leaders have repeatedly said they don't want changes at the Al-Aqsa Mosque in Jerusalem.  Israel is also accused of funding groups advocating major changes to who can pray at the sacred and sensitive site in Jerusalem.  What are the implications of Israel action? And with growing discontent in the occupied Palestinian territories, is it a recipe for more unrest? @webpagelink"},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"\"Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,\" Cruz said. \"I don't know why that is, but it seems to really bother him.\""},{"comment_id":"10153703978899087","commenter_b":"How about the thousands that are killed by blacks themselves ! Never hear about that !","commenter_a":"Bernie listens, Hillary laughs and walks away!!'","post_message":"Emotional video posted by the Black Lives Matter movement shows Bernie Sanders comforting a woman whose brother was killed by police. READ MORE: @webpagelink"},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."}]
