[{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word \"journalists\" here..."},{"comment_id":"10155034427609197","commenter_b":"@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"},{"comment_id":"10154886644703487","commenter_b":"Yeahhh...I'm not buying it, Atlantic.","commenter_a":"So, arrest him and tell America that Trump isn't going to be President. I dare you. LMAO......","post_message":"\"Putin has embraced an opportunistic but sophisticated campaign to sabotage democracy.\""},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10153039611668984","commenter_b":"Shoot this prick and his offspring","commenter_a":"I support the 25 congressmen that voted against you! And ALL YOU DID WAS PROVE THEM RIGHT MR! JOHN HUSSEIN BOEHNER! YOUR A VINDICTIVE DISGRACEFUL representative!","post_message":"John Boehner may have just sunk to a new low with this move. This is the type of thing I would expect from a 3rd grader, not a supposed leader like Boehner.  Do you support the Republicans who stood against John Boehner?"},{"comment_id":"10153680967462577","commenter_b":"These migrants have been through much and they should be afforded more rights than everyone else. Don't wanna get attacked by a Muslim migrant? Stay inside. A Muslim migrant broke into your house and attacked you? Should have gone outside.","commenter_a":"The world is a sick place where everyone's rights are being removed under the guise of equality. Everyone has the equal right to shut up and lick big government's boots while footing the bill. Fuck this bullshit.","post_message":""}]
