[{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"},{"comment_id":"10153189105981336","commenter_b":"The pansies out there today would be a total embarrassment to this country. They would all turn tail and run. No backbone, no moral compass, no strength and no sense of reality. I blame the coddling society and the progressive liberal media.","commenter_a":"start the draft back up ...let these boys do a few years in the service","post_message":"Frat boys from the University of Florida and Emory University have been accused of urinating on an American flag, spitting on a vet and a service dog, and making derogatory comments toward veterans’ wives.  And that was just the beginning…"},{"comment_id":"812160358905862","commenter_b":"Please make sure you are registered REPUBLICAN to vote for TRUMP. He's our only hope. Corrupt Washington DC will continue as usual with the rest who are beholden to big donors/super pacs. This corruption has been going on for 35 plus years. Vote TRUMP to take back our country. If Trump don't win our children and grandchildren will have a miserable life with Muslims and illegals taking over our country and to top it off we have no jobs.","commenter_a":"Question: If #BillClinton is campaigning for #HillaryClinton, does this mean he can charge any fee he sees fit? In other words, no matter the outcome, the #Clintons are making bank! Also, is this true? HIGH Treason Traitor Hillary Rodham Clinton UNITED States of America - As Wanta-Reagan-Mitterrand Protocols implementation remains imminent with an April 1st U.S. Supreme Court ordered deadline, it can now be reported that former U.S. Secretary of State Hillary Rodham Clinton has been placed under house arrest by the U.S. military on charges of financial treason. On week ago Friday, the same day Jack Lew was sworn in as U.S. Treasury Secretary, sociopath Hillary attempted to illegally divert $1.7 TRILLION of U.S. Treasury funds to a secret CIA proprietary account in the People Republic of China. Both Chelsea Clinton (Hillary daughter) and former Citibank CEO and Clinton era Treasury Secretary Robert Rubin have power of attorney over ...","post_message":"Good morning America! Thank you for your support in the latest national Reuters poll. TOGETHER, we will #MakeAmericaGreatAgain!"},{"comment_id":"10153724000373132","commenter_b":"Then she will have another kid.","commenter_a":"If she's stupid they will. So yes they'll end up back together","post_message":"In this week's PEOPLE, we learn why Scott Disick blew a second chance with Kourtney Kardashian.  Do you think they'll ever get back together?"},{"comment_id":"10156367673320725","commenter_b":"@username pull your pants up","commenter_a":"This Latina and my family are voting for Donald Trump all the way to the white house!! Yay for me!","post_message":"I will NOT let America down! Thank you for your continued support of my presidential campaign. Together, we can all #MakeAmericaGreatAgain! #Trump2016"},{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised \"great restraint\" while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""}]
