[{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"10152979209831770","commenter_b":"Let's make her the next target. I doubt if anyone would miss her.","commenter_a":"She knows that is not true.","post_message":"Congresswoman Gwen S. Moore thinks Scott Walker's policies are \"literally\" lynching black people."},{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"10154176687291337","commenter_b":"Good now the bitch dont have a job...now go get that unemployment check","commenter_a":"Freedom of speech, freedom of press, wwlcro American land of lies","post_message":"YIKES! Terrible move by this anchor..."},{"comment_id":"1721863561367662","commenter_b":"Hopefully to die of a stroke while receiving anal from pence, while he dies of a heart attack from actually getting his tiny penis erect.","commenter_a":"Lol... Wow at all the hate. Smh... Do you all think that the Muslims that come over here are going to accept your Christianity.... Lol.... Maybe some researching on how they are behaving in other Country's with the mix of the two is in order. But you all continue with your hate and see where that takes you.","post_message":"Reminder: If Trump attempts to discriminate against Muslims, we will sue."},{"comment_id":"10153301628035496","commenter_b":"Really, Brenda, perhaps you should have looked at the message she was sending. Why should we have to be subjected to her cop bashing, Black Panther, Malcolm X etc. opinions. That's not talent. Perhaps we should go back to marching bands and perhaps you should think about reporting the news or even better retiring.","commenter_a":"Wow these comments are funny to me. Beyonce did not give a hateful message. You all are upset because of what you saw visually and what the media has told you what she is singing about. Have any of you even listened to the song or listened to her response to the media turning her song into hate? And she and her husband have done a lot for the black community. They just don't have the media around to show it because that is not what it's all about.","post_message":"Brenda's Last Word on Beyonce's so-called 'way too political' Super Bowl performance.  PHOTOS from the performance: @webpagelink"},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"}]
