[{"comment_id":"827359944060385","commenter_b":"Hillary is truly a liar.","commenter_a":"Hillary, always evolving while taking corporate money for corporate favors. Show me the speeches from Goldman Sachs so I can see exactly how much of my back you really have... #FeelTheBern","post_message":"Too many trans Americans still face violence and discrimination, just for being who they are. Together we'll fight for safety, respect, and full equality for the trans community."},{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"},{"comment_id":"10153240957300950","commenter_b":"We need a new president - but not Hillary!","commenter_a":"Putin keep up the good work","post_message":"\"He needs to go after the people who killed Russian citizens,\" Obama said of Putin."},{"comment_id":"10153420202186323","commenter_b":"Why do people feel the need to insult disabled people anyway what ever word is used?","commenter_a":"You know what? Decent people will not say 'Retarded' around the mentally challenged, because those are the actual victims who have a right to be offended. I won't say retarded around retarded people. Around non-retarded people, different story. If your feelings are hurt by me stringing a couple letters together to form a word that has had not impact on your life, tii bad.","post_message":"\"It’s not about policing language, but having “a call to action” that will make people think twice about using a term that can hurt and exclude so many people.\""},{"comment_id":"10154455305884087","commenter_b":"Mike I'm with you exept the pre_existing what are people to do just die after the doctors and hospitals have done taking everything that is just morally wrong","commenter_a":"These people are so ignorant and out of touch it is ridiculous, that is one of the issues that got Trump elected. Repeal and replace, I am for a free market insurance health care. We do need to make sure that pre-existing conditions are covered, and letting parents insure their children until 26 is a good idea. If they need medical attention they are insured, and the taxpayer will not have to foot the bill.","post_message":"47 percent of Americans oppose repealing ObamaCare, while only 20 percent want it repealed immediately."},{"comment_id":"10153130429581162","commenter_b":"If prostitution ever becomes legal, you can sign your kids up freak.","commenter_a":"Making prostitution illegal is as stupid as pot being illegal. Regulate, tax and monitor.","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"1834629973441103","commenter_b":"Such an embarrassment to REAL Women!!!","commenter_a":"Such bullshit","post_message":"More white women voted for Donald Trump than Hillary Clinton..."}]
