[{"comment_id":"10150581639814999","commenter_b":"its called cheating and it is still cheating if the score 47-7 hope you dont have kids...","commenter_a":"Seems like a very very cheap price for a championship","post_message":"A report commissioned by the NFL concluded that it was “more probable than not” that Tom Brady was aware of New England Patriots personnel deflating footballs to gain an advantage against the Indianapolis Colts."},{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"10153190819521602","commenter_b":"Telling you..bitches love it!!","commenter_a":"Personally i think they should have beat her like Rodney King. Broads really like that!","post_message":"The officer was placed on desk duty after video images showed him taking a 15-year-old girl to the ground during an arrest at a St. Patrick's Day parade."},{"comment_id":"10155939290119012","commenter_b":"No he's creating a disaster!! You cannot fix something that has been left go for decades! You can find a way to manage it and try and prevent the same things to keep happening! That is why Obama was smarter about it! He deported the ones that were a threat not a mother with kids! But I don't expect the right to understand this! You think acting like a dictator is going to help this country your dumber than I thought!","commenter_a":"Yes.","post_message":"YES or NO: Is President Trump making America safer?"},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"},{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"10155066492903352","commenter_b":"this dirty ass white trash have nerve to say something rude tlking about in my mother country do Thy use punctuation marks Bitch u just went thru ur pic on Facebook first of all you hve two boys how wuld I feel if some one were to follow the boys in rape them but then again you look like a crak head so u wuld not give two fucks right stop hittin that pip b4 you wanna tlk about other people in there country trailer trash Bitch don't u hve some beans to go warm up in the fire in eat","commenter_a":"Fa real if you can have the nerve to to that to a child who barley can right his name an innocent baby in the Lord's house you shuld get more than yur face ate in my mother country we wuld have tie his ass up in take turns slicing his body parts mKe him then make hungry stray dogs eat his freaking dick in his balls then when thats over set his ass on fire wile the mother stabs him his ass to see","post_message":"A mother let her 4-year-old go to the bathroom alone during Sunday Service…Rolls Wheeler, 39, followed the boy when he got up, and raped him in the restroom. ----> @webpagelink"}]
