[{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"10154003941470950","commenter_b":"Elizabeth Lilly what a ignorant women you are","commenter_a":"His first 100 days will be tremendous. So tremendous and full of catering to Russia. Bigly. He will keep us in suspense as he plans to steal back the money he spent for the campaign. So many plans. Big plans. And we're gonna pay for it. Bigly.","post_message":"Trump is about to speak to a crowd about what his first 100 days in office will look like: @webpagelink"},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat?   Hillary: Sure! 👻"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10154157874771130","commenter_b":"@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"10154575005093645","commenter_b":"Beyonc sucks..adele is 10 times the singer","commenter_a":"It's crazy because BEYONC deserved that award. Everyone knows it.","post_message":"She beat Beyonce in the top three categories with her comeback album , and repeated her accomplishments from 2012, when the British star also won album, song and record of the year at the Grammys.  She used her speech to honor Beyonce and her groundbreaking  album, which was also nominated."},{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly \"represent!\"","post_message":"They're so brazen..."}]
