[{"comment_id":"10153543401066336","commenter_b":"You illegal aliens need to self deport along with your anchor babies!!! Get Out!","commenter_a":"\"Mr. Trump's statements are offensive to all Latinos, but especially to the undocumented community,\" said Bertha Sanles, who has lived illegally in Miami for 14 years. \"Trump is focused on promoting hatred and ignores the positive economic contributions we bring to this country.\" You know what, become a citizen so you can vote.","post_message":"A resolution to condemn Donald J. Trump's remarks about Mexican immigrants failed last night to win approval of the city council in Doral, Fla."},{"comment_id":"1103976636304606","commenter_b":"Man says something about women in sexual overtone, people are \"Shocked and Disgusted\". Welcome to planet earth.","commenter_a":"Who cares?","post_message":"Sen. John McCain has withdrawn his support for Donald Trump following the disclosure of a video recording in which the candidate made lewd comments about women."},{"comment_id":"473465766111797","commenter_b":"@username you mother should have swallowed your nasty ass.","commenter_a":"They are both true. And that cannot be argued. They are both true","post_message":"Full story: @webpagelink/ Graphic by: The Free Thought Project.com <-- 'Like' (y)"},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"1094669133962671","commenter_b":"Well folks that's more reason that woman will never be president","commenter_a":"Alright, That's it!","post_message":"JUST IN"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"}]
