[{"comment_id":"10152701982362869","commenter_b":"Will miss you on Fox. Now, go get 'em.","commenter_a":"Choice satellite TV doesn't show FOX NEWS anymore so I don't get to see it. All we get is liberal news and I think this is just propaganda and time to cancel choice for violation of our contract.","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10155558251545354","commenter_b":"If I was her I would bow out of this hot potato that may leave egg on her face!","commenter_a":"Who really cares Baltimore's become the septic system of America","post_message":"Uh oh...."},{"comment_id":"1180033235377842","commenter_b":"Obamo is nothing but a Fuc##^#gJerk that is trying to desroy AMERICA !!!!!!","commenter_a":"Shocked, Hassan rejected Syrian refugees! Of course Obama told the Govenors to pound sand! He's sending them in under the darkness of night on buses!","post_message":"Did your state make the list?"},{"comment_id":"872258432910129","commenter_b":"Really Kathy? I can't believe any woman would ever even think of voting for the dumpster","commenter_a":"If you vote Hillary, you're voting for babies to be murdered, etc. She needs to stay home and clean house. She can't even do anything with her husband. How can she run a country.","post_message":"WATCH LIVE: Former NYPD commissioner talks about election day security  — who will win, Donald J. Trump or Hillary Clinton?"},{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"10153356804576336","commenter_b":"The words that come to mind wouldnt be appropriate for FB or for a lady to say....smh.","commenter_a":"Obuttma is a hug a thug..what is wrong with his brain⁉⁉","post_message":"The number of detainees at the Guantanamo Bay detention center is now 116, compared to 242 when President Barack Obama took office."},{"comment_id":"887553468004375","commenter_b":"What a pig","commenter_a":"The entire \"occupy\" movement is a collection of unemployed, pot smoking, attention strumpets who receive gov. assistance and don't want to lose their free ride.. Morons!","post_message":"Pass it on.  Image by Occupy Democrats."}]
