[{"comment_id":"614194488771130","commenter_b":"Good for them and if was some other county's,or orig,before 1860 or maybe south it before civil main thing is who cares when was adopted by south or when ain't THERE flag now belong's to the SOUTH and USA.now.AND GO SOUTH go TELL THE IDIOT'S TO Get LOST UR FLYING IT FOR EVER OR ANYONE ELSE WANT'S TO FLY IT in THIS CNTRY'S 50 not 57 or 58 states u idiot abomination it's 50","commenter_a":"fantastic!!","post_message":"NASCAR fans at Daytona refused to hide their support of the Confederate flag.  This is true patriotism. They are proud to be Americans.  Do you support their refusal to back down?"},{"comment_id":"1072562746193671","commenter_b":"You don't like China?","commenter_a":"Yes yes Mexico is paying for the Wall, I just did nit get the chance to tell them yet. I met the Mexican president, he is a great man, I have a lot of respect for him and I love him and the Mexican hombres a lot. I offered the Mexican president free premium trump wine from china","post_message":"\"[It] fully-funds the construction of a wall on our southern border... with the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall.\"  Earlier today at his \"first 100 days\" speech in Gettysburg, Donald J. Trump outlined his proposed \"End Illegal Immigration Act.\" @webpagelink"},{"comment_id":"10155155433964778","commenter_b":"She wasn't a black swimmer to me until the media and people who keep stressing the fact of the first \"African American\" ... First off the has been in the past but what I see of anyone in the Olympics is an athlete who trained very hard and worked through their own adversities to reach their goals. To me African Americans want the dividing line to diminish, I know I treat people as people so I think the media should stop putting a dividing line there. I don't care who you are if you want to do a sport and make it to the Olympics with hard work and perseverance you can make it, it's not your color that helps you make it.","commenter_a":"She was just another amazing swimmer to me. I didn't think about her race...SHE made that the issue. It's hard to be colorblind when it keeps getting made an issue BY THE ONES COMPLAINING!! WTF!","post_message":"\"I want to be an inspiration, but I would like there to be a day when it is not ‘Simone the black swimmer.’"},{"comment_id":"1840578192829386","commenter_b":"WORDS DON'T CHANGE THE FACT! TRUMP IS YOUR PRESIDENT! LEAVE THE USA!","commenter_a":"Keep trying thumb suckers","post_message":"ALERT...."},{"comment_id":"878409832218766","commenter_b":"Too lazy to be princess! Punish her to work at Royal Household!","commenter_a":"Like mother like daughter","post_message":"‘Scrounger’ Beatrice’s three holidays in a MONTH"},{"comment_id":"10154586781928598","commenter_b":"Good for them, proud of you both, goes to show you how much they really respect themselves","commenter_a":"Blessings for your marriage!!","post_message":"#6 most-read LifeNews story of 2016: After Abstaining Until Marriage, NFL Star Russell Wilson and Ciara Get Married: “We Did It Jesus’ Way”"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"}]
