[{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"},{"comment_id":"10156455116700354","commenter_b":"Plenty of real women out there that they could have photographed","commenter_a":"A fucking lie from the liberal media why pretend.","post_message":"All 8 PHOTOS here..."},{"comment_id":"10153641389062994","commenter_b":"I still don't understand all the female supporters on here. He hates you.","commenter_a":"He did a great job!!!","post_message":"Donald J. Trump is in Birch Run and will take the stage in just moments. Watch what the GOP contender has to say about Michigan, this country, his campaign, and who knows what else."},{"comment_id":"10152536717736680","commenter_b":"Stop marriages of terrorists n force","commenter_a":"Speaking out against, or killing? Those are two very different things.","post_message":"From POLITICO Magazine: Police risk their lives in service. Does that mean we shouldn’t speak out against them?"},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."},{"comment_id":"1346176708775407","commenter_b":"Tell that to the two","commenter_a":"God had promised us He will not wipe out humans on the face of the earth any longer therefore the doomsday theory can NEVER happen. It is just a figment of imagination in the mind of the writer of this article. I will rather suggest he asks 'what would happen if Rapture takes place now?","post_message":"What the world would look like if doomsday struck and humans were wiped out"},{"comment_id":"10153884962054228","commenter_b":"They need to die","commenter_a":"They should be beat to death","post_message":"The child was locked in a room, bound with duct tape over his eyes, beaten with belts and a hammer.  That is not the worst part."}]
