[{"comment_id":"1104396149581395","commenter_b":"Because women aren't people?!","commenter_a":"*women with depression","post_message":""},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."},{"comment_id":"10154559728153812","commenter_b":"@username He has lead our country in more debt than any other presidents He doesn't give social security costs of living raise in 3 years He's letting illegals into our country without being vetted He's trying to take guns away","commenter_a":"You Americans, I can't believe how you can produce great leaders like Obama and then still show up with Trump for the next elections.","post_message":"Donald J. Trump on #Dallas: \"This isn't the American Dream we all want for our children.\" abcn.ws/29mnwVr"},{"comment_id":"1686607741593351","commenter_b":"Morris @username For President Independent....Thompson say's \"I don't care about the F _ _ _ _ _ _ Wall\"! Under my plan I am going to enforce existing law that requires all employers document its employees right to work. There is an $11,000 penalty per illegal that will be used to pay for the deportation. Former Mexico President Vincente Fox I intend on overwhelming Mexico with illegals","commenter_a":"As they say in Espanol....p..... tu madre.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":""},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."}]
