[{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"},{"comment_id":"10154082976562464","commenter_b":"Build that wall!","commenter_a":"(yawn) No, thanks. I'm voting for Trump, like everybody else.","post_message":"ICYMI: This Amazing Ted Cruz Ad That Came Out A Few Days Ago Is MUST-SEE -->"},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"\"I don't have a clue,\" said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"10155127516070294","commenter_b":"A**hole","commenter_a":"Blacks,, that's all they know.","post_message":"You may have seen the video circulating online...  Now, because of social media, police say two people have been arrested in the large brawl at Beachwood Place Mall the day after Christmas. More here: @webpagelink"},{"comment_id":"1334341989975359","commenter_b":"@username We should give them hard labor in the form of building the wall.","commenter_a":"This arrogant convicted criminal is an excellent example to bring up next time any leftist Democrats claim there isn't any voter fraud. Safe to say we know where she will be for about the next 3-4 years with good behavior.","post_message":"ARROGANT ILLEGAL ALIEN Who Voted 5 Times In 2016 Election Gets 8 Years…Lawyers Call Sentence “Harsh”…Blame Trump…LOL! [VIDEO]"}]
