[{"comment_id":"506647236198456","commenter_b":"That will get her dinner at the White House.","commenter_a":"I want proof. Then it's not just a vague fb post...","post_message":"Beyonce Posted Letter Hours Before Dallas Shooting, Calling Blacks to  Against Police, That Murder Should Not Go   CHARGE HER WITH INCITING VIOLENCE!   Let's get 5000 SHARES if you think she should be held accountable!"},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"867191473393219","commenter_b":"@username illegal. Get ready to be deported or just leave. Leech","commenter_a":"I am not even American, i live in New Zealand and i support @username. Long before Trump ran for president i believed he is the man for the job. Smart, strong, dedicated and beyond all else brave enough to stand up for his vision and commitment, if anyone has what it takes to make change for the better it is Donald Trump. From all the way here in New Zealand - i have confidence in Donald Trump to clean up and create change. THANK YOU!","post_message":"Thank you FLORIDA! #VoteTrump on March 15th! #MakeAmericaGreatAgain"},{"comment_id":"10152939381996770","commenter_b":"That's her right to do so. Now can we just move along here!","commenter_a":"@username's mother is just as big a piece of crap as he was.","post_message":"As the one-year anniversary of the death of Michael Brown nears, his mother says that she will never forgive Darren Wilson, the Ferguson, Mo. cop who killed him."},{"comment_id":"1093998960667966","commenter_b":"party endorsed toadies dont age well","commenter_a":"PUT these clowns out too pasture","post_message":"BEYOND TIME  America's Freedom Fighters"},{"comment_id":"959009797494471","commenter_b":"Any politician that don't one our soldiers to be armed there traitor to our country","commenter_a":"I can see maybe arming an NCO or someone at a recruiting station as a deterrent against the crazies out there.","post_message":"NO CHANGE IN POLICY: Army chief urges caution on calls to arm more US soldiers in wake of fatal shooting (VIDEO)  @webpagelink"},{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."}]
