[{"comment_id":"1280019028698326","commenter_b":"The football players that choose to disrespect all of the heroes that have died for this country, this anthem, this flag and unfortunately for them are lowest ungrateful humans that are part of the big problems of this country. I will not support the NFL in any form until they get rid of the garbage.","commenter_a":"BOYCOTT! Stop giving these spoiled brats their millions of dollars to play around. Then they will respect US!","post_message":"\"To protest against the flag, which stands for the United States of America, it's a disgrace. And if they don't like it they should go play football in Canada.\"  Jim Riches, whose son Jimmy was a firefighter killed on September 11, responded to NFL players like Colin Kaepernick and Brandon Marshall who are choosing to protest the national anthem."},{"comment_id":"889958597769015","commenter_b":"Don't like her!","commenter_a":"What is there left to say. Sarah Palin \"will send them to kick Isis out\"sounds like he will put troops on the ground. Just what Isis wants. She sounds as bad as Trump. She doesn't even know what is coming out of her mouth. Mental problem. Think before you vote!!!!","post_message":"“No more pussyfooting around!”  That’s what she said... Here are the best one-liners from Sarah Palin's endorsement of Donald J. Trump: @webpagelink"},{"comment_id":"478833062241288","commenter_b":"We all know O-ass is reallllly stupid","commenter_a":"Obama'smass army of Murders.","post_message":"Here's what the NYPD Commissioner thinks of President Obama's plan to reduce overcrowding in federal prisons."},{"comment_id":"10153948326234497","commenter_b":"I could totally help this bitch out","commenter_a":"@username, you could help this chick out for sure.","post_message":"\"I think I ready to put myself out there again.\""},{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"},{"comment_id":"10154183673293132","commenter_b":"It's usually the accuser that's doing the cheating. Good for her for getting rid of that douche.","commenter_a":"The same thing happened to my best friend when she started to make a healthier lifestyle for herself. Her now ex wouldn't support her at all! She was supposed to come to the gym with me one day and completely bailed out because she was fighting with her a**hole boyfriend. Turns out he told her that she's fat, will always be fat and that there was no point in going to the gym with me when she'll quit anyway. Now I wasn't aware about what he told her until recently because she was so ashamed of what he told her and knew I'd bash the crap out of him. He'd also accuse her of cheating every single time she went out or \"joke\" to her about texting other guys whenever she pulled her phone out. He was the one who ended up cheating (or so we think but I'm sure ...","post_message":"Alexander's husband started calling her \"fat\" after she dropped weight to save her health."}]
