[{"comment_id":"1301566109863416","commenter_b":"~ Peoples personas don't change without great effort, just ask any addict. ~ Why is it always the retarded republican that thinks they can tell people what to do? Can't quite quantify and validate your reasons for voting for the Trump tard?? ~ Let me help you. Trumps tax plan is a joke that gives radical tax breaks to the rich, while promising 0% tax for people making under 25K. People who make under 25K already don't pay any taxes, and the rich already have enough tax breaks and loop holes. @webpagelink ~ Trump says he wants to stop outsourcing, yet his clothing line and make America great hats are made in China. @webpagelink ~ You might think he's good with money, but Trumps companies filed for bankruptcy 4 times in recent history. @webpagelink ~ Trump wants to build a wall to keep criminals and drugs out, Yet criminals are ...","commenter_a":"Very good & funny","post_message":""},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"\"We're starting to see a rash of cases of a syndrome referred to as excited delirium.\""},{"comment_id":"10154655715146037","commenter_b":"@username many!!! What parents dress their little girls like a sex queen? Um, JonBenet's and other child beauty pageant moms- $$$, attention, fame....","commenter_a":"I am inclined to believe the story to be true. There are just too many claims against Michael not to take them seriously. Not to undermine the victims, but the thing that I really can't grasp my head around is why the parents of all of these children that Michael victimized allowed their kids not only to sleep over at a grown man's home, but also to sleep in bed with that grown man?! This makes no sense to me and the parents of these kids should be held accountable for their actions.","post_message":"When he \"began showing signs of puberty,\" Jackson was allegedly \"no longer as interested in him sexually.\""},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."},{"comment_id":"1062158903821449","commenter_b":"And your a scrub. And Beyonce don't want no scrubs.","commenter_a":"Don't be scared of a bunch of freaking thugs, Beyonce is a thug herself .","post_message":"Tomi Lahren doubles down."},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"10154237542506162","commenter_b":"Years wasted but enjoy that compensation my man","commenter_a":"I'm so sorry you lost all those years","post_message":"WRONGFULLY CONVICTED: A former U.S. sailor who has spent 33 years in prison will be released as early as today after new DNA evidence showed he was wrongfully convicted of murder and rape... @webpagelink"}]
