[{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10154220387809312","commenter_b":"The girl should have been dealt with a lot sooner than 2 years!!","commenter_a":"They should have all bought headphones and blasted The Bible on tape.","post_message":"When the noise first became an issue about two years ago, Saylor said she would knock on the door and ask her neighbor to quiet down. It didn't help."},{"comment_id":"10153201571853812","commenter_b":"Hes a witch!","commenter_a":"Ahmed Shannon Nathan Jake Conrad Robert Ya Ron Ronaldo","post_message":"WATCH: In Portland, Maine, it is cold. Very cold. THIS cold. -- [ VIDEO: Portland Police Department] - ABC News Weather"},{"comment_id":"10152762458196973","commenter_b":"Exactly how would we \"ban transgenders?\" Deport them? Round them up into camps? Or are you for killing them? Smart people don't advocate for bigotry and racism.","commenter_a":"Or we could just ban transgenders altogether.","post_message":"Should Oregon ban \"conversion therapy\" for LGBT youth?"},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"546896738832150","commenter_b":"Don't worry just go vote under a dead guys name or pick up a few illegals and get them to vote too. What democrats do all the time .","commenter_a":"I accidentally vote for Cain, so the four percent is a little high.","post_message":"POLL: Who won the VP debate?"}]
