[{"comment_id":"1731162717167272","commenter_b":"Rob Reiner is a slut! Liberal twit, rich and ignorant as a bowl of dung!","commenter_a":"The rich and stupid strike again...","post_message":"You mean racist like the race-baiters who back Hillary Clinton?   Kinda like that, Rob?"},{"comment_id":"10154234462691770","commenter_b":"Typical liberals pay to play she learned from Hillary","commenter_a":"She's got to be a Democrat","post_message":"Liberal Governor Took Last-Minute Donation From A Company With $1 Billion In Contracts"},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"10152777603232093","commenter_b":"Idiots","commenter_a":"I say bring a fire truck and water there down. Keep then at a distance.","post_message":"15 officers have been injured in Baltimore riot, 2 still in hospital; 2 dozen arrested..... @webpagelink"},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"10153638768074062","commenter_b":"And take your bimbo wife with you!","commenter_a":"Kanye, please listen to the voices in your head and leave the country!","post_message":"Kanye West opens up about rushing the stage during Beck's acceptance speech at the Grammys.   He says the voices in his head told him to do it.  He's also now calling Beck one of the nicest and most respected people in the industry.  Check out what else Kanye had to say and let us know... Is this really just too little, too late? @webpagelink"},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"}]
