[{"comment_id":"1566749223612191","commenter_b":"Make no mistake Maggie I no where near put A women that murders children on the same level as animals. ANIMALS ARE BETTER THAN THAT.","commenter_a":"If a woman has an abortion she should IMMEDIATELY BE FIXED SO SHE CAN NOT EVER KILL ANOTHER CHILD.","post_message":"Abortion is MURDER!"},{"comment_id":"1247078658692220","commenter_b":"Bitch no it ain't, ole flat volleyball shaped head ass","commenter_a":"John H. Gonzales III this is @username hair style rn","post_message":"He needs a fitted cap asap!  #WSHH #Haircut"},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the \"chickification\" of the news — which gives it a female-friendly slant."},{"comment_id":"10153349534435667","commenter_b":"Nice rack, Mary","commenter_a":"Bengazi butcher leading the uneducated I assume because a smart common sense person would never vote for her.","post_message":"\"We're not taking anyone, and we're not taking anything, for granted.\""},{"comment_id":"1065131623520589","commenter_b":"R.I.P.","commenter_a":"Awwww, RIP, Al","post_message":"RIP Al from Happy Days. He passed away on Friday at age 96."},{"comment_id":"10153509190373132","commenter_b":"Let her die with respect!!!","commenter_a":"I'm all for it I had to watch my husband die stage four brain Cancer that spread to all organs and bones to see him in so much pain and high doses of morphine to watch what he went through and reading about Brittany I say go for it the right to die with dignity God bless my heart goes out to you and all of you that are going through hell","post_message":"\"I can't wait. My daughter can't wait. I owe this to myself, and I owe this to my daughter. She's either going to come home and she's going to have to discover my body, or she's going to have to watch me die painfully.\""},{"comment_id":"10153255474016509","commenter_b":"Avi Cohen she has money my $45,000 a year is her daily parking fee money","commenter_a":"I need to find her and get her pregnant ... I wonder if she likes chocolate","post_message":"After all that back-and-forth about their billion-dollar divorce, oil tycoon Harold Hamm's ex-wife has finally cashed the check for $975 million. @webpagelink via CNNMoney"}]
