[{"comment_id":"10154077308573128","commenter_b":"would they let someone come in and do this to the liars Scruz and Ruby!","commenter_a":"When's the next GOP Debate?","post_message":"Republican leaders who had hoped Trump would stumble on Super Tuesday now face tough choices, writes Gerald F. Seib."},{"comment_id":"10153740264340667","commenter_b":"This woman is unethical and unprofessional and immoral @webpagelink","commenter_a":"It's not just him who sees it. Many people see how biased and one-sided the media is. Very unprofessional. No shame left. I'm not against anyone here. I simply criticize the corrupt system.","post_message":"Not the first time it's happened this election cycle."},{"comment_id":"10152974175586130","commenter_b":"So much prettier than the trashy thong suits of today.","commenter_a":"Courtney Kelley Michler","post_message":"Gorgeous!"},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"603295489861030","commenter_b":"Willie is anti-gun. Doesn't really matter what else he says, Willie can go to hell.","commenter_a":"Go getem Willie.....","post_message":"Willie Nelson just made this huge stand against Obama.  We stand behind him 100%. Let's show him our support.  Can we get 10,000 'LIKES' for Willie Nelson?"},{"comment_id":"10153651600041323","commenter_b":"Because she's British William!!!!","commenter_a":" for rent for the big fat cunt to have axcess to a private pool what other perks did the rest have its just away of mugging the goverment and dickheads for money charity begins at home.","post_message":"“I’m a mother. My heart bleeds. Just because we live in a poor area. Is this what they want to do with us? The government don’t care. Nobody will listen. They don’t care about us. Only God cares.”  It is six weeks since Kids Company abruptly closed its doors; since then several inquiries have been launched but little has been heard from the people who once relied on its services."},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"\"Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,\" Cruz said. \"I don't know why that is, but it seems to really bother him.\""}]
