[{"comment_id":"10153258279033010","commenter_b":"Just give her a whiff!","commenter_a":"The trophy wife gets the gold mine and the kids will get the shaft.","post_message":"Robin Williams' three children are at odds with his third wife over what constitutes \"memorabilia.\""},{"comment_id":"1093795067333572","commenter_b":"Suck it.","commenter_a":"He means defying the will of the people is what the campaign is about. Hillary has the popular vote and delegate lead. #dropoutberniesanders","post_message":"TONIGHT: Bernie Sanders on continuing his fight for the Democratic nomination: \"Defying history is what this campaign has been about.\"  @webpagelink"},{"comment_id":"10152605770366680","commenter_b":"She certainly has enough raging male testosterone !!!!","commenter_a":"She is totally useless and has done absolutely nothing of benefit to the Democratic Party.","post_message":"Running for Senate might be an elegant solution for a woman with no other way to advance her career."},{"comment_id":"10154829556541425","commenter_b":"Go home","commenter_a":"Thank you all for standing up against bigotry and stupid trump!!!","post_message":"We are live at JFK Terminal 4 arrivals #MuslimBan #MuslimBanprotest #nobannowall"},{"comment_id":"10154068476123717","commenter_b":"The tea party and Republican Party are two separate entities","commenter_a":"That's because Hillary best represents the ideals of Reagan-era Republican Party. Trump represents the modern-day teabagger nutjob Republican Party. All the corruption and lies of the former with half the brain cells.","post_message":"It may surprise you, but George Bush Sr. knows who he is voting for come November, according to a Kennedy: @webpagelink"},{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."}]
