[{"comment_id":"10154223180398984","commenter_b":"Go get a life lady","commenter_a":"Sounds like Trump paying someone else to do his DIRTY work. Why not talk about all the mistresses of Trump. It must be the big bucks from Trump.","post_message":"Wow, I didn't expect Anonymous to be the next one to come after Ted Cruz, and the hackers are claiming something BIG..."},{"comment_id":"10153498985924032","commenter_b":"Did these girls post this photo, or did it get posted by the prankster that took the photo?","commenter_a":"Expelled? Yeah, because interrupting what is obviously NEEDED education is the answer here... Maybe they should sue Snapchat as well, because this wouldn't have gotten the attention it did if they hadn't posted it on the app. *insert eye roll here*","post_message":"The petition was started by change.org and already has more than 39,000 signatures."},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."},{"comment_id":"10155334759910329","commenter_b":"You won't be here to tear it down....This is America not Mexico...Tell your parents to get out and take you with them. And see where you end up.Won't be here in USA because you be able to climb the wall.","commenter_a":"No, you won't","post_message":"The photo was taken at a anti-Trump march on Saturday."},{"comment_id":"10153724551069641","commenter_b":"I remember years ago being in Saudi and Riyadh was lit up like Vegas and I thought this place could be nice after all.the reality came a few days later when walking down a shopping mall with some other guys and some women who were covered were heading in our direction .They made a miniscule mistake of revealing the smalles amount of leg.Out of nowhere came the \"Religious police\",who started flogging them with sticks for this horrendous \" crime\",.The reality of the country set in for how women are treat and this was one of the many mistreatments of people in general i saw.The dark ages is what describes the country .if that is what helps to eventually lead you to heaven i am glad i am going to Hell!Though back then i had an early insight into it.","commenter_a":"Let them vote, drive and have some say so, that is more powerful than anything you could give them.","post_message":"How significant is this change for Saudi women?"},{"comment_id":"10153503592741336","commenter_b":"LOVE HIM!","commenter_a":"I CAN NOT TRUST THIS GUY NO A biT I RATHER VOTE FOR NOBODY TO GIVE HIM MY VOTE, HE COULB BE WORST THAN OBAMA. WISHY WASHY GUY.","post_message":""},{"comment_id":"461391564049150","commenter_b":"Well Paid Bitch","commenter_a":"Not surprising, have you listened to her for more than a few minutes? Not impressive to say the least. Where do they find these people?","post_message":"Donald Trump’s national campaign spokeswoman turns out to be a sleazy welfare cheat and conspiracy theorist."}]
