[{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"},{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":""},{"comment_id":"1195188837159645","commenter_b":"Hahaha that bitch pussy on all types of fire😂😂😂","commenter_a":"Shanira","post_message":"Oh my "},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"\"I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"10154658880931178","commenter_b":"just some dumb f****** n*****","commenter_a":"I still have no idea who this guy is.","post_message":"Under fire music star Chris Brown ranted against the cops and praised #BlackLivesMatter."},{"comment_id":"10154079186342541","commenter_b":"@username what are you talking about ?","commenter_a":"Officers do well checks. Would have taken a few seconds for a FB friend to call the cops and have that phone traced.... SMH.","post_message":"\"It's amazing for someone to sit there and see somebody or hear them take their last breath, and nobody did anything.\""},{"comment_id":"10153935429529726","commenter_b":"That motherfucker is insane. Period.","commenter_a":"It couldn't be her dishonesty and lack of personality.","post_message":"WATCH: Howard Dean: Sexism to Blame for Hillary's Communication Problems"}]
