[{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"\"Will you go out and pick the strawberries?\"  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"484282168429030","commenter_b":"deport her and all the rest of the muslims in america","commenter_a":"Yes","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake.  Shariah Law is dangerous, we support the patriots that stand against it.  Should Shariah be banned in all 50 states?"},{"comment_id":"10153826887651179","commenter_b":"It was at the place in France where the ladies wear no pants.","commenter_a":"going back to their roots? lol","post_message":"$55 million dollars of cocaine was found at a Coca-Cola plant in Signes, France."},{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."}]
