[{"comment_id":"613032028845756","commenter_b":"Well I can only say if you had to live with Barack Obama as president for 8 years she might see herself that way.","commenter_a":"Else get bitch out of.thire","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."},{"comment_id":"1058315940902294","commenter_b":"Stupid white girl","commenter_a":"Dr. Cornel West is as arrogant and blind as Bernie. Blaming good Democrats for not getting things done and ignoring Republican majorities blocking them. They don't help. They just \"manage\" from the side lines. Bernie at least has worked some in legislation, but not as hard or as successfully as Hillary. Dr. West has done nothing put complain that people who are doing the heavy lifting are not working hard enough.","post_message":"What do you think about his choices?"},{"comment_id":"10152995709171130","commenter_b":"I suggest we send her subservient hormonal ass straight to the Canadian border now!","commenter_a":"Ridiculous! Comment for someone that should know better Ms. CEO.","post_message":"What the..."},{"comment_id":"10153238696686813","commenter_b":"@username Oh yea you and and stupid California is a payer State... you dumb asses pay twice as much to live in pollution surrounded by painted hills of immigrants. You people have made mad bank off the backs of Immigrants, thus the reason you want more. Dumb Blonde wow, I thought that was a cliche!","commenter_a":"The people of this Country are tired of being worked into Slavery to merely exist... The continuous need to help outsiders with no regards to the effects of the US Citizens that do not need anymore competition for jobs and affordable housing is Un-Patriotic and a spit in the face to every working class American and their children and grandchildren. We are asking the Federal Government to listen to the People's request but they are blatantly ignoring and denying our request to stop this invasion. Anyone that stands for the Big Federal bully tactics should go down with them when the Civil unrest begins.... It's coming, just wait for it! There are far more Citizens on this land than the Police, Military and Government goons combined! KEEP POKING THE BEAR! NO REFUGEES OR IMMIGRANTS are Welcome here don't you get it.... Take your ass to California and mooch off the ...","post_message":"GOOD NEWS: Court denies Texas motion to block Syrian refugees, and finds Texas unlikely to win lawsuit.   “There is nothing in the law that gives the state veto power over any decision of the federal government or permits any state to discriminate against certain refugees based on their nationality, in fact the law says just the opposite,\" said ACLU of Texas’ Rebecca Robertson. #refugeeswelcome #allfaithswelcome"},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."},{"comment_id":"920667494692972","commenter_b":"What a piece of shit","commenter_a":"PIG!!!!!!! If his wife had any sense of self worth and wasn't so bullied she would leave his sorry ass!","post_message":"And the saga continues..."}]
