[{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."},{"comment_id":"10153994246388967","commenter_b":"2nd only to 2016 Kobe 'highlights'.","commenter_a":"The surfing scene from Escape from LA better be in there.","post_message":"Remember when these were cool?"},{"comment_id":"1022617317773941","commenter_b":"Is the virus an illegal alien?","commenter_a":"Where's you sense of urgency to find and deport illegal alien fellons!","post_message":"Unlike Congress, Zika infected mosquitoes aren’t going to be on recess next week – they’ll be working. The emerging Zika virus poses a serious threat to our public health, and members of Congress should not leave for recess without passing President Obama's emergency funding to fight this virus."},{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."},{"comment_id":"841624465874895","commenter_b":"Feminazi to the ugly bone!","commenter_a":"Good for him, shame on his wife.","post_message":"\"When the doctor came out, he said 'there’s a real problem with your son.'\""},{"comment_id":"10155160536813132","commenter_b":"I can't stand her...","commenter_a":"I don't know about her being an A-lister...","post_message":"Donald J. Trump spoke out about the decision on Twitter."}]
