[{"comment_id":"1119178091433245","commenter_b":"She's going crazy from lack of schlong!!!!!!","commenter_a":"She is both a liar and totally stupid....and murderer.","post_message":""},{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"1555989074419098","commenter_b":"We'd have have a democracy in the first place to lose. Seem that ideal is long gone","commenter_a":"This is a response to the hard tack to the left by progressives. This is the fruit of your insane policies and social engineering. You have created the potential for an authoritarian American government. It won't happen instantly, but in increments. I have to admit, I prefer this future to a nation that celebrates stomping upon our flag, allowing veterans to die waiting for medical treatment in favor of allotting medical benefits to illegal aliens, and referring to children as purple penguins.","post_message":"The frightening rise of authoritarian populism in the West is a very real, clear and present danger, writes Mike Lofgren, a former congressional staff member."},{"comment_id":"10152997147654411","commenter_b":"All the western puppets are traitors,DIVIDING AND CONQUERING USING IMMIGRATION AS A TOOL TO PUT THERE SOCIALIST POLICIES THROUGH.","commenter_a":"wheres ya burka merkel,traitor bitch","post_message":"Angela Merkel has accused leaders of Pegida anti-Islamic movement, which is gaining popularity in Germany, of hijacking the slogan of 1989 Berlin Wall demonstrations,  sind das Volk ( are the people) for their xenophobic purposes."},{"comment_id":"1647670705273781","commenter_b":"This dude is in trouble. He better start working for the people who elected him, or his ass is grass","commenter_a":"Government that works? Republicans are out to prove to us that government is bad by giving us spectacularly bad government.","post_message":"Jason Chaffetz's contentious town hall in deep-red Utah proves Americans care more about a government that works than partisan politics."},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"10153986223919087","commenter_b":"Trump is NOT a BS. Let's make America GREAT and SAFE again. Hillary is a liars just want the votes from the black and illegal immigrants. She just say whatever you all want to hear to get your votes. WAKE UP AMERICA!! US Citizen. Love USA!! Go Trump 2016 !!!","commenter_a":"Let's make America great again!.Hillary is a liars. We are people choice, love this name. His name is Donald Trump 2016.","post_message":"#BREAKING: “I will not be voting for Donald Trump for president,” Republican Sen. Susan Collins announced Monday."}]
