[{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"},{"comment_id":"10153051963761350","commenter_b":"Honorary Dame in England is a big honor -","commenter_a":"I'm a fan Angelina you too pope francis","post_message":"First comes being named an honorary dame by the Queen of England, and now Angelina Jolie is shaking hands with the pope!"},{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"10153354052466770","commenter_b":"Who cares what a woman beater thinks fk off chrissy","commenter_a":"Racist lives matter","post_message":"He had nothing good to say."},{"comment_id":"10153595542620575","commenter_b":"If its pure crap please backup that statement with facts. America is importing more Muslims than ever before in history.","commenter_a":"He IS scary with his beliefs and agenda for Muslim takeover of the world.","post_message":"The Gateway Pundit - Obama Blasts FOX News, Conservative Media for Making Him Look ‘Scary’"},{"comment_id":"1615282505444662","commenter_b":"@username, I get that. I don't think that that's any more serious than foreign interests pouring money into a specific candidates election fund or even the main stream running a biased smear campaign to try and get \"their candidate\" elected. It all needs to be stopped.","commenter_a":"So the Russians hacked the Dems servers and released their emails. So what. What does that have to do with Trump? The main stream media was trying its hardest to influence the election for Hillary. Had she won, would people be calling for an investigation of that?","post_message":"So: Shep Smith just called out Donald Trump's lies about Russian election interference on Fox News. \"It was brought up before the election. Over and over and over again.\""}]
