[{"comment_id":"10153373472869411","commenter_b":"Bugger off Rosa!","commenter_a":"Will sodomite marriage replace traditional marriage in Ireland?","post_message":"Check out our interactive map of the #hometovote trending worldwide  inside this article"},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"\"Yes We Can\" :)","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"1332051730168629","commenter_b":"She hasn't killed anyone idiot","commenter_a":"Now if only the Hilary haters would stop throwing around the word \"murderer\" as if it were a complement. The blatantly hateful behavior of so many Americans makes my heart ache and makes me ashamed to be counted among them.","post_message":"They finally collapsed."},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that \"his name is Clyde, you're confusing him.\" I'm also proud to wear a tshirt that says \"all I want to do is drink wine and rescue dogs\" and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."}]
