[{"comment_id":"10154526253322464","commenter_b":"Want to bring some refugees? Bring the Yazidi!!!","commenter_a":"We want to live in peace I Yazidi from Iraq There's no one feels Us #StopYazidiGenocide #StandforYazidiWomen #StopYazidiGenocide #StandforYazidiWomen Nadia Murad","post_message":"Washington Examiner: Oklahoma Obamacare plans face 76 percent hike.  #FullRepeal: @webpagelink"},{"comment_id":"10153895371347452","commenter_b":"@username. Well you are not a very educated woman. I hope you don't reproduce! This world doesn't need more deplorables.","commenter_a":"Really ?! Just because he says vulgar things about women who cares ! And I am a woman! Least he isn't hiding emails or having innocent people killed!!!!","post_message":"Donald J. Trump was caught in a 2005 video making vulgar comments about women. He issued an apology and added, \"Bill Clinton has said far worse.\""},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"},{"comment_id":"10153936248091336","commenter_b":"American homosexuals bring HIV into the world.Nobody condemns them but Africa has Ebola everybody condemns Africa","commenter_a":"Nothing good comes out of Africa!","post_message":"More than 2,700 babies have been born in Brazil with microcephaly this year, up from fewer than 150 in 2014."},{"comment_id":"10153817478256320","commenter_b":"@username he will never be a woman","commenter_a":"Um. No. Besides i hear she doesnt even want to be a woman anymore.","post_message":"Happy Birthday!  Caitlyn Jenner celebrates what she considers to be her 'first birthday.'"},{"comment_id":"682384888576953","commenter_b":"Dumb woman.","commenter_a":"Well she said she meant it in jest and didn't much care if people are offended. So she did admit she was the person that posted it. Now that the voters know who she is the question is will the party still support her. My guess is yes.","post_message":"And you know it wasn't her fault, right?"}]
