[{"comment_id":"1528246223862069","commenter_b":"@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us \"deplorables\" wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"10150870773554999","commenter_b":"@username. And you vote for a killer and a rapist!","commenter_a":"It's become pure entertainment. At this point he's a side show. His numbers are falling. His lies are outright ridiculous. Enjoy that long, long vacation.","post_message":"Donald J. Trump is sticking to his style, even if it meant taking \"a very, very nice long vacation\" after Nov. 8."},{"comment_id":"10154186263231336","commenter_b":"@username how did she give in to he bully? By becoming strong and accomplishing something at 9 that her bullies will likely never even attempt? By showing them that she has more aptitude and resolve in her pinky than her bullies do in their entire body? That she doesn't need to bully someone else to make herself feel better, but instead made herself better? If you ask me, that's not giving, that's stepping up and issuing a whole new challenge. There are 29 year olds in this world that could stand to learn a few things from this young lady.","commenter_a":"We need more parents who inspire their kids to do somethng like this. Instead of creating a safe space for their feelings for those who are bullied or feel bullied by micro agression.","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"},{"comment_id":"1161811247205145","commenter_b":"Lock her up","commenter_a":"\"LOCK HER UP\"FOR SURE!!!","post_message":""},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"}]
