[{"comment_id":"10153035798681336","commenter_b":"Do you support PETA? They are know as animal killers! And it's part of their manifesto!","commenter_a":"I don't support circuses just for the reason that they are notorious for abusing animals.","post_message":"Ringling Bros. and Barnum & Bailey Circus will phase out the show's iconic elephants by 2018 because of growing public concern over how the animals are treated."},{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"10153242310616336","commenter_b":"Well what does Baltimore have to say now? I just can't believe those two cops were harassing those two nice men.","commenter_a":"They thoght they could get away with it!","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt.   The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"490189094517729","commenter_b":"USE PEPPER SPRAY TO PROTECT HER......SHE IS A MASTER PHD CROOK LIAR....THIEF....","commenter_a":"Cheating Trump is lying when he open his mouth and lied when he closed it. @webpagelink","post_message":"Crooked Hillary wants to get rid of all guns and yet she is surrounded by bodyguards who are fully armed. No more guns to protect Hillary!"}]
