[{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"\"...may be the worst thing ever to have happened in the history of cinema.\""},{"comment_id":"10153293762581037","commenter_b":"Jack, most straight couples procreate. Those who don't are a minority. Marriage rights are supposed to encourage people to procreate so we have The Next Generation. It's just a matter of practicality. If you want to be gay, go be gay. No one is stopping you from being gay.","commenter_a":"Wow....she is EVIL.","post_message":"Ruth Bader Ginsburg, a former civil rights lawyer, has been uncharacteristically outspoken in advance of one of the most significant civil rights decisions in decades - by Liz Goodwin in Yahoo Politics."},{"comment_id":"734125933387254","commenter_b":"Simple: muslims support SHARIAH law. This is a system which cannot coexist with our laws, which are based on the Constitution.","commenter_a":"I feel like no republican has ever read the constitution. The first amendment clearly separates church and state. As long as the president doesn't bring their religion into their work, then it shouldn't matter what religion they are.","post_message":"Ben Carson says the unsayable. [Read below]"},{"comment_id":"10153521099233010","commenter_b":"save your water for your illegal aliens...smfh","commenter_a":"Typical republican: \"entitled\".","post_message":"More than a dozen times, a white truck filled up at a Thousand Oaks hydrant and hauled the water to Selleck’s 60-acre ranch in Westlake Village -- court documents allege."},{"comment_id":"10153766656618984","commenter_b":"Get off your asses bitches you will have a better view !","commenter_a":"Absolutely, they need to be respectful. They believe they are special and above the law...they deserve to fold. Maybe they will be humble in their next job!!","post_message":"I did NOT see this coming, and I don't think the women of \"The View\" did either. They had just apologized for their controversial comments about the Miss America contestant who is a nurse when they got blindsided by some very bad news...  Do you think \"The View\" deserves what it's getting?"},{"comment_id":"10153698259961320","commenter_b":"She's the devil in disguise.","commenter_a":"She doesn't have to worry about any boyfriend and hopefully for a long time!","post_message":"What a horrible human being.  Authorities have released text messages that allegedly detail how 18-year-old Michelle Carter texted her boyfriend, Conrad Roy III encouraging him to commit suicide. Read what she said: @webpagelink"},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""}]
