[{"comment_id":"1044302852275608","commenter_b":"Trump wouldn't smoke a joint like billy tho","commenter_a":"@username. @username we will work on your wall mr trump","post_message":"Outstanding! A top priority- so we can MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10156089078040354","commenter_b":"Put The Woman In Jail!","commenter_a":"THROW - HER - IN - JAIL - NOW! What the hell are they waiting for? Drag her ass to jail in handcuffs wearing a sign around her neck that says, \"ALL YOU OTHER CRIMINAL POLITICIANS AND BUREAUCRATS ARE NEXT! NO ONE IS ABOVE THE LAW.\"","post_message":"***BREAKING***"},{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"},{"comment_id":"1030656443730298","commenter_b":"\"Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\" John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"10154260423564212","commenter_b":"Amen","commenter_a":"I am begining to think that the Democrats are the most dangerous threat to America.","post_message":"Two-thirds of Democratic voters won't say Islam encourages violence more than other religions"},{"comment_id":"967111676633636","commenter_b":"What a couple of dicks....","commenter_a":"Bigots.","post_message":"It's that important, huh?"}]
