[{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"870560229647985","commenter_b":"Not bad for Teddy... only two outright lies in 4 sentences lol","commenter_a":"Love Ted Cruz","post_message":"Listen to how this Obamacare question from CBS News correspondent is phrased -- and then Ted Cruz's answer:"},{"comment_id":"1176638305726030","commenter_b":"My mother told me to never argue with the peasants. I am sure that is what most liberal mothers told their children while most conservative mothers were too busy cleaning their guns in hopes of putting another possum on the table for their snaggled toothed brood.","commenter_a":"I love that all of Killarys posts are getting roasted! Even the left can no longer argue for this traitor! #HILLARY4GITMO2016","post_message":""},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"10153129775024877","commenter_b":"yeah big black women are ugly","commenter_a":"why they didn't get a plus size white girl in there too ??","post_message":"Target is using 'real' models in its new summer swimwear collection.  Grio fam - do you think it's time more major retailers used body positive advertising? Or is this just a passing fad of acceptance? Sound off below!"},{"comment_id":"10153063599505950","commenter_b":"Hope they change the entire show. Take both women off tv and replace with meaningful entertainment.","commenter_a":"So nice","post_message":"Kathie Lee Gifford returned to TV for the first time since Frank Gifford's death: \"He passed away instantly that morning, all dressed in what he knew was my favorite outfit -- white shirt, very tight black jeans -- having his coffee, watching his TV, getting ready to go, ready for church, and excited about what we were gonna have for lunch.\""},{"comment_id":"10153894992921336","commenter_b":"@webpagelink Wake up my friends. Biological Jihad being preached all over Islam is the most dangerous problem to ever face the world because the world is still ravaged by fake political correctness, and many countries are not united as they once were. Immigration without assimilation is invasion. Be a Guardian for good. #CognitiveAwareness #KnowledgeIsPower #Guardians #ProtectYourCountries #AlwaysBeReady #UniteAgainstIslam","commenter_a":"I heard that Obama does come from a family that is muslim. maybe his father but either way he does believe in their ways and as for Hilary Clinton she is a liar a thief and has no business running for president. we do not need anymore murders caused because she has better things to do like warning her family and not America about anything.","post_message":"“President Obama and Secretary Clinton just won’t say it—radical Islam. And they’re making a big mistake…They somehow think that is a declaration of war on religion. And I don’t know where they get that idea. It’s not. It is specifically identifying the enemy.” – Greta Van Susteren  MORE: @webpagelink"}]
