[{"comment_id":"10153891408869062","commenter_b":"Yeah","commenter_a":"Waiting on PA","post_message":"JUST IN: The Texas House Committee approved a bill to make marijuana legal for adults. It still has a long way to go before becoming law, but what do you think?"},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."},{"comment_id":"10152666100851680","commenter_b":"I used to be sympathetic to Israel. Not today, and I'm part jewish.","commenter_a":"Yes it has lost its soul and also the respect the world had for Israel.","post_message":"OPINION: Fear defeated hope in Tuesday’s election, disfiguring our future. Via POLITICO Magazine"},{"comment_id":"937512336383801","commenter_b":"What goes around comes around ppl remember that !! They will get theres !","commenter_a":"If I find out you were ask and turned them down I wiil. O longer listen to your music. Bon Joni is off my list. Even Adele since she supported Hillary.","post_message":"Seriously?!"},{"comment_id":"1092750970772962","commenter_b":"Omg when I hear you little sheep that follow that lying bitch it makes me gringe","commenter_a":"Unfortunately Tronald Dump has his followers their just as dumb as he is at this point Dump can say whatever he wants and he will still have his followers sad what this country has become but we can stop this Dictator in November do the right thing VOTE BLUE","post_message":"LOL"},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"10156977022535354","commenter_b":"Lookit that uglyass bitch!","commenter_a":"And here I thought money laundering was illegal. Huh.","post_message":"“Hillary Clinton running for President in 2008, if you’re a foreign oligarch, you can’t give to her campaign, but you can have Bill Clinton give a 20-minute speech for half a million dollars, or you can make a $5 million donation to the Clinton Foundation, and you’ve got access every bit as much as if you had raised money for their political campaign. That’s really what the Clintons have done.”"}]
