[{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"1095553313863196","commenter_b":"How many men has she had in how long?","commenter_a":"Find a new girl who really love you.Don\"t be sad.","post_message":"It's over!"},{"comment_id":"894010200634440","commenter_b":"I'll call him a she once he's a female according to the dictionary.","commenter_a":"Caitlyn Jenner's award acceptance speech. Uplifting, heartfelt, inspiring... Courage, intelligence, compassion, awareness, education... Caitlyn pointed out many of the crucial life and death issues facing trans folks nationally and globally. She made an impassioned plea for acceptance and respect for all of humanity and the trans community in particular. For such a new figure in the global trans community, she did an excellent job at getting the truth across. Her speech had me in tears early on and particularly when she addressed her family and her mom. Something additional: twenty percent of transgender people have served in the military, which is double the percentage of the U.S. general population that has served. Close to 16,000 trans folks are currently serving in the U.S. military. Close to 135,000 trans Veterans have served.","post_message":"\"Oh you know, just in the kitchen by myself crying because of Caitlyn Jenner's ESPYs speech.\""},{"comment_id":"846989298730657","commenter_b":"I thin Aaran Afalava needs to do some homework about the way marriage has been done in the past.","commenter_a":"Why is this so special? My parents were together for 57 years...... If lesbians and gays want to be treated like everyone else why do they (and you) feel that everything they do is a milestone, or 'historic' or ...something! If they want to be treated like everyone else then they need to quit acting like they are something special.","post_message":"\"People seem to understand our relationship with no difficulty at all. They seem to know what we want them to know, which is that we are a loving couple, living a normal, happy life, just as we hope they are.\"  - Lennie Gerber and Pearl Berlin"},{"comment_id":"610480015827201","commenter_b":"I'm a New Yorker and I don't like this weather lol","commenter_a":"If you're a New Yorker you should be used to this weather","post_message":"A winter weather advisory is in effect tonight from 6pm to 6am. Meteorologist Jeff Smith talks forecasting and answers your questions."},{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"1644623019109095","commenter_b":"Dear: Mr. trump; you have a nice fire burning for yourself, why open the damper and burn it out?","commenter_a":"Mr. Trump :If you truly believe in America, stop the hate talk: read, or have read to you, both the Constitution of these United States and the Declaration of Independence. My Uncles served in World War 2 to protect us from the Fascists (Dad had medical issues and couldn't serve in the military: worked for the government instead!) : by posting this, I'm hoping someone will connect the dots and know that's what you are!","post_message":"Statement on Preventing Muslim Immigration:"}]
