[{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."},{"comment_id":"1767802863447868","commenter_b":"Dirty old lady","commenter_a":"So, Madonna sexually assaults a minor, but it's all good because she's a female. Yay equality. #BecauseFeminism","post_message":"“Seriously, why would I sue Madonna for the best moment of my life?”"},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"10153859068156955","commenter_b":"Leave the mug and leave her alone.","commenter_a":"She didn't like the interview either, (\"Not one bit\"). Did they ask Ms Flossie if & when SHE wanted to be interviewed? It was all very awkward. They gave her a station coffee mug (shameful)... Put flowers on her lap that she can't hold... The kicker to me was the opening where the interviewer held up the newspaper RIGHT IN FRONT OF HER FACE!!!! The whole thing was disrespectful.","post_message":"BEST INTERVIEW EVER"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10153232684759030","commenter_b":"\"Run, bitch! RUN FOR YA LIFE! GET SOME HELP!\"","commenter_a":"Kristian Pollard Elisha Lloyd","post_message":"#ThrowbackThursday to Wayne Brady using the ATM on Chappelle's Show. #TBT"}]
