[{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\"  - Vice President Joe Biden"},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"},{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."},{"comment_id":"1043755919078659","commenter_b":"White people...now hear this...You have no right to tell us black people, when, where, why, and most definitely how to protest anything at all. Besides, your ancestors brought us here, enslaved us here, discriminate us here, hang, and shoot us here...We're still trying to figure out why? 95% of the last 15 shootings since Kaepernick starting protesting, like many before, have been unarmed black males. He just started protesting 3-4 weeks ago. Do the math on that. There is an eradication of my people in progress. We're fed up. It won't be long before WE start shooting back. Bank on it","commenter_a":"322 white people killed by police this year vs 172 backs. How come the media doesn't report on those lives. Stop reporting 1/2 truths and creating race riots.","post_message":"Police confront protesters in Charlotte, N.C., who were demonstrating after police confirmed they'd shot and killed a man while seeking a different person.  FULL STORY: @webpagelink"},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""}]
