[{"comment_id":"1231532310220572","commenter_b":"And male or not, you're a cunt","commenter_a":"The dirtbag can pick anyone he wants, Congress has no obligation to endorse the fascist's choice. Speaking of the Constitution. GOP won't be re-elected if they pass any nominee appointed by Ovomit.","post_message":"BOOM!"},{"comment_id":"995007177263648","commenter_b":"@username if you are still pro refugees after this video, I don't know what to do with you.... And this are things that are not only happening in France, but in Austria, Germany, and several other countries","commenter_a":"All you Obama haters suck!! Just another bunch of racists who want to vent there vile shit.. Any excuse.. Like yeah if your Muslim your a terrorist if your black your a mugger or rapist.. Retards!!","post_message":"Obama Doesn't Want You To See This: The Muslim Refugee Crisis in Europe"},{"comment_id":"1339079949456485","commenter_b":"She should eat it","commenter_a":"She should eat it","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"1184765608230962","commenter_b":"That works too","commenter_a":"Jenni Mahtinez","post_message":"Have you ever wondered how voting in the caucus even works? Because the answer is pretty weird. - Jon Comulada"},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."},{"comment_id":"1283819971638030","commenter_b":"She's a disgusting wombat","commenter_a":"Looks like big bird. We paid over 2 grand for that dress?","post_message":"The Narciso Rodriguez dress sold out online before the president had even finished speaking."},{"comment_id":"1696699610390161","commenter_b":"She deserves prison put her there please then we won't have to see that disgusting face of hers","commenter_a":"Total investigation","post_message":"Does she deserve to go to PRISON for breaking the law?"}]
