[{"comment_id":"10153542250533812","commenter_b":"Chriss if you lease a car. Can anybody come in that vehicle and disrespect you. Chriss you happened to get a job that you get assigned a vehicle can anybody come tell you what and how. You're a smart man. You might get a job that requires you to move out of the state or even the country. That job comes with all expenses paid for four years including the house and the car. You tell me who can come in there and disrespect you. Not even the ceo or cfo of that company can do that without proper protocol. You had to move your family. And your doing your best job. Think about that chriss. YOUR A SMART INTELLIGENT MAN","commenter_a":"Pres. Obama. It is America's house we only let you borrow it for a little bit! Respect all people as you desire to be respected. You are in my house and every legal Americans house. Not that they were right but you are wrong!","post_message":"WATCH: Pres. Obama normally lets hecklers speak, but this time, he put his foot down: \"OK, you know what? No, no, no...\""},{"comment_id":"10153324817246523","commenter_b":"And this is only the beginning of another year in Wisconsin.","commenter_a":"Oh people quit ur whining an complaining! It's sickening! It SNOWS every year, this is nothing new!!! Blah, blah, blah!!!","post_message":"NEW: We're been upgraded to a winter storm WARNING in southeast Wisconsin."},{"comment_id":"10154944476018984","commenter_b":"@username but the First Lady Elect wants the Indians to go back to India so how will they be able to go to the White House?","commenter_a":"I do think before the Trumps move in the whole place should having laying of hands and prayers from our faithful people to cleanse the evil that has lived there for so long.","post_message":"As soon as the White House opened its doors to display the Christmas decorations, many Americans were surprised by one item in the background. This is getting a lot of attention, and you'll instantly see why..."},{"comment_id":"610314089143994","commenter_b":"How embarrassing for all women! Their class level is as low as Trump's. Is there an emoji of a puking face?!","commenter_a":"LOL. I wouldn't count on them voting for Trump. I doubt they've ever been in a voting booth.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""},{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"},{"comment_id":"1724919811095083","commenter_b":"^^ for a woman that's a very clever reply","commenter_a":"I think a more interesting question would be, will women cycle differently on other planets? I'm no scientitian, but it seems to me it's a helluva coincidence (that we take for granted) that the female menstrual cycle is in line with the lunar cycle. Our bodies are 2/3rds water and the moon controls the tides. Am I talking out my ass if I suggest maybe the moon can can influence the fluids in our bodies? So on a dfferent planet, with different moons (and presumably after having been there for several generations), would women cycle differently?","post_message":""}]
