[{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....\""},{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to \"shut down\" Trump's inauguration. Here's how."},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"10154219562119197","commenter_b":"Germaine Riley Another imbecile spewing really nice politically correct names, hey you .... smarten up !","commenter_a":"So very sad ! Obama should be impeached because he is not keeping us safe !","post_message":"We are continuing to follow updates on the deadly mass shooting at an Orlando nightclub. Here's Kevin P. Hogan WFSB with an update on what we know now."},{"comment_id":"10154394638207042","commenter_b":"Christianity in mind? But what Christianity type of Christianity was happening through the genocides..? Lol never been to prison or even arrested but thanks for the weak statements 😁","commenter_a":"Crosses don't belong in public spaces much less public institutions. If you truly believe in your faith, symbols and manmade objects shouldn't matter. Actions and kindness to your neighbors should be more than enough of a display.","post_message":"CROSS COVER-UP: After one family's complaint about a cross displayed on a public school in Staten Island, it was covered up. Now, a community is outraged.   Do you think it should have been covered?"},{"comment_id":"807700012661940","commenter_b":"But she did. Shouldn't no one not have to go anywhere because fools can't handle their jobs.","commenter_a":"She should have never went to TX in the first place TX is not place for decent law abiding people as we see what happened to her over a signal change, TX is a rebel state always has been that way, and their federal support for programs should be stopped right away. Any kind of support needs to be stopped and let them people that love that place pay for their own social ills then see how they like that","post_message":"\"How did switching lanes turn into all of this?\""}]
