[{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10153265757247061","commenter_b":"No, he was too busy lighting our disgraced white house Christmas tree.","commenter_a":"If you have no interest in hearing President Obama, why comment? I'm sure he's not reading your negative comments. He's much too busy and has other more important things to focus on, unlike you, who clearly have too much time on your hands!","post_message":"BREAKING: President Barack Obama to address the nation from the Oval Office on Sunday night at 8pm ET, White House says. @webpagelink"},{"comment_id":"10153361519746813","commenter_b":"That's the point. You said it yourself. Men have been using the men's room and women have been using the ladies room without an issue since forever without any problems. My point is that the law allows for men to use the ladies room and women to use the men's room, that is the basis of this law.","commenter_a":"I want to know why this is such a \"hateful\" law. The \"party of science\" is arguing against a law that basically says \"You know this restroom that's for boys/men? Only boys/men can use it. You know this bathroom that's for girls/women? It's only for girls/women\". So you think if women feel uncomfortable that a man that says \"Hey, I feel like a woman\" goes into a woman's locker room must hate LGBT people? Really? It's not the trans people I'm concerned about. It's the people POSING as trans people. Why should women be made to feel uncomfortable just so a man that thinks he's a woman can use the women's restroom/bathroom? Wanting people to use the bathroom of the sex they were BORN with (and actually STILL are, as science dictates) does NOT = hate.","post_message":"After nationwide outcry about North Carolina's harmful anti-LGBT law, Gov. McCrory said let's \"work on solutions that will make this bill better\" because NC is \"a state of inclusiveness, openness and diversity.\" Let’s make it clear - that means REPEAL HB2. Keep the pressure on. Add your name: @webpagelink"},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."},{"comment_id":"10153145019224205","commenter_b":"Honestly, she's a fucken hypocrite.","commenter_a":"Juliette Aguilar @username Melissa Amezola Hilda Llamas Navarro","post_message":"Caitlyn Jenner’s Opinion Of Gay Marriage"},{"comment_id":"1440691939283888","commenter_b":"Your point Is right. This woman shouldn't have so many children if she's can't even provide them basic needs for them... oh wait... we the tax payers do that for her!","commenter_a":"I think what Eddie did was fantastic and shows what a caring heart he has. On that note, hell, if it worked for her might as well try. I'm a single mom of a 12 year old. His dad passed several years ago. I'm a veteran of the US Navy and served during Operation Iraqi Freedom. I'm a teacher that works hard for all I have, and I have thousands in student loan debt (like many other college graduates). Would anyone like to give me free money so I can spoil my son with all the latest technological gadgets? *please, before you comment about how I'm greedy, be happy for this woman. I am happy for her and I don't actually expect to receive, nor do I want any money from anyone. It just seems that this story is a \"feel sorry for me\" bit. We all have our hardships, ...","post_message":"Down on her luck, facing eviction with six children hopeful for gifts during the holidays, Tyshika Britten turned to Craigslist for help, and found it with a $10,000 donation from Pearl Jam's Eddie Vedder.  >>@webpagelink"}]
