[{"comment_id":"10153973841258598","commenter_b":"She is a liar , a cheat, a murderer, and a disgrace to womanhood!!!","commenter_a":"FIRST WOMAN MURDERER!!! If she would kill innocent little American babies, what would she do to the rest of us?? Don't vote gender, vote for a great leader, vote TRUMP!!!","post_message":"Pro-Life Women Leaders: “We Can’t Celebrate Pro-Abortion Hillary Clinton as First Woman President”"},{"comment_id":"729424187224050","commenter_b":"@username , The Refugees and Illegals are Already receiving benefits. THEY ALL have more benefits and Rights than the average American Citizen does!!!","commenter_a":"You want your kids seat taken at school? You want grants and scholarships used and sucked up dry by illegals and refugees? There are terminally ill, Vets, single mother and fathers and maybe you someday may need those welfare and social security benefits..but its not going to be there because of illegals, refugees, mouches and leeches will suck it all up dry...VOTE #TRUMPPENCE","post_message":"The apple doesn't fall too far from the tree..."},{"comment_id":"10153463579731130","commenter_b":"but who knows maybe if she doesn't get her orgasm, she'll cry rape, and because society is bent towards believing women only on their word alone, you will be sent to jail to get butt raped.","commenter_a":"Men don't \"owe\" you orgasms End sexual entitlement","post_message":"🙌"},{"comment_id":"966202806772801","commenter_b":"#dumbasses","commenter_a":"Robbie Raul Markosyan","post_message":"Kate Upton among scores taking part in #HoldACokeWithYourBoobsChallenge for breast cancer... unaware the trend ISN'T raising money"},{"comment_id":"1004445152942983","commenter_b":"Obama's fault!!!!!!!!!","commenter_a":"The only thing we need. United Sovereign.","post_message":"FOUR PREVIOUSLY DEPORTED ILLEGAL ALIENS Charged In Rape, Beating Of Couple  A WALL AT THE BORDER WOULD BE GREAT!"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"}]
