[{"comment_id":"474611692726438","commenter_b":"Dear god. If I were Trump, and that batshit crazy woman decided to endorse me, I would bow out gracefully. Tail between my legs. Holy cow. She is a kook.","commenter_a":"How was she ever elected Governor!!!!!!!","post_message":"Sarah Palin endorsed Donald Trump on Tuesday. The result can only be described as Palinesque."},{"comment_id":"1868656350045137","commenter_b":"Jealous lady...","commenter_a":"Whiney baby","post_message":"So great!"},{"comment_id":"1004458709688902","commenter_b":"Yo entiendo","commenter_a":"@username should fucking be ashamed of themselves. I see that you are just like most Corporate News Organizations which takes a real issue then contort it for your clicks and likes. I am a Black American. I have been living in the Dominican Republic for 3 years. I hold 3 degrees to include a JD and an LLM. I am going to tell the truth and I hope to never see such nonsense like this published again. As I said I been here for 3 years. I came here not knowing a word of Spanish because I as a Black Man wanted to get away from America. I spent 11 years in the Marines also and I have traveled the World and NO WHERE have I been or felt more free than living in the Dominican Republic and that is a very real yet sad statement, a testimony if you ...","post_message":"This Video Sheds Light on the Deep Racism That Black People Face in the Dominican Republic #ABSArchives"},{"comment_id":"848274368622676","commenter_b":"I tryed to watch it but everything else came up.... I agree with her 100% they are to demanding going into a new country.... You Muslims have good strong boy's ( can;t call them men chicken shits) send them back to fight you own war and not us !!!!!","commenter_a":"Makes me wonder what the hell is the matter with Islamic women? Can anyone answer why any women, with the way they are treated under Sharia, would want to be part of that? Disturbing","post_message":"OMG. If you only watch one video tonight, watch this Brit go off... on a Religion Of Peacer who told her to 'Shut Up!' This is an EPIC, unscripted, blast that you will probably love. @webpagelink"},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"@username hahaha","post_message":"\"Is there free food?\""},{"comment_id":"10153136670568010","commenter_b":"Amen.","commenter_a":"Mr Stewart, your request to resign has been denied. The American people need you to shed light on the ridiculousness and political shenanigans in Washington DC. Love, virtually every American.","post_message":"\"[Jon] Stewart has been a voice of astonishment and outrage, sometimes for comic effect, sometimes heartfelt and often both — a safety valve, a tonic at the end of the latest hard day, comforting confirmation that you are not the only person to find the world out of joint,\" critic Robert Lloyd says of Stewart's impending departure from \"The Daily Show.\""}]
