[{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"10152996747985950","commenter_b":"look at the KKK what a bunch of ugly losers... lmao...","commenter_a":"Good","post_message":"More rallies have been planned..."},{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"883464781688982","commenter_b":"Research empathy Roger.. Apply it sometime.","commenter_a":"Just want to say that in your standup you talk a lot of trash about white people and shootings if I do recall correctly. So is racism just a white problem but black stand up comics are not. Check yourself before you tell me to check mine.","post_message":"It's not that easy to forget.  Do you think racism still exists? Let us know: @webpagelink"},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.\""},{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"}]
