[{"comment_id":"1586521584985469","commenter_b":"@username - you are a disgusting racist pig!","commenter_a":"There is so many blind people to what the Obama has did to all of us. They are so disrespectful of our Military and country. Can't wait for them to leave.","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."},{"comment_id":"1547140315578990","commenter_b":"She a piece of crap","commenter_a":"Sheboon","post_message":"Michelle Obama proudly stands by the work she's done to get healthier lunches in public schools. Do you support or oppose the First Lady's efforts?"},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"10153232403476323","commenter_b":"Because, you can fuck over your country. As long as your fucking bitches, smokin cigars, and drinking whiskey, like a man God damnnit","commenter_a":"Why is everything about being gay","post_message":"Gay-rights activist and award-winning author Larry Kramer is 79 and in failing health, but that won’t defuse the impact of his latest bombshell project: the first 800-page instalment of a two-part history of America that tells of the hidden sexualities of figures from Alexander Hamilton, George Washington and Abraham Lincoln to Mark Twain, Herman Melville and Richard Nixon."},{"comment_id":"10153331066431162","commenter_b":"Who cares!? It's not like he did it himself and besides back in the day that's what people did. It wasn't right but that's what happened alot has changed since.","commenter_a":"It does not matter he did not do it if we look hard enough I'm sure we all have someone in our family history who's done something we are not proud of","post_message":"Ben Affleck is coming clean about why he wanted to keep a slave-owning ancestor a secret @webpagelink"},{"comment_id":"10153852047087061","commenter_b":"Woman need to have concealed carry. Just too nasty out there now.","commenter_a":"Wtf!!!","post_message":"BRUTAL ATTACK: Police are looking for a man who walked up to a woman near a San Francisco park and began punching her in the face. Read more: @webpagelink"},{"comment_id":"10154274649819087","commenter_b":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","commenter_a":"People will never vote Democrat again, once they appoint an Islamic extremist at the helm:)","post_message":"\"People didn't vote for Trump so he could bring a white supremacist into the White House,\" Elizabeth Warren said."}]
