[{"comment_id":"10155148589429614","commenter_b":"Yes send them to jail!","commenter_a":"@username if I was that teacher I would have been calling the cops EVERY DAY about the abuse of that baby!! ESPECIALLY after he asked her to call the social worker!! That poor little boy knew there were people out there that could help him, and then realized how bad he was being failed by everyone","post_message":"In testimony during the preliminary hearing, teacher Jennifer Garcia said in the months before Gabriel Fernandez's death, she repeatedly reported to county child service workers new signs of abuse that prosecutors say came at the hands of his mother and her boyfriend.   In one instance, Gabriel came to school with swollen eyes and a pockmarked face, she said. At first, he said he had fallen, but he then told her,  mom shot me in the face with a BB gun, she testified.  On two occasions, she testified, a fearful Gabriel asked,  you call that lady?, referring to the county social worker. But as months passed, and the boy remained with his mother, Garcia said she began to lose confidence in child protective services."},{"comment_id":"10154056014236336","commenter_b":"I've heard liberals say that the Constitution is a living,breathing thing so many times! This is because they want to change America's FIRM laws to fit their Anti American agenda! Obama and the Anti American socialist judges do not have the right to make law! Thats how Obama's illegal Obama care was approved! I fear that our once free country is in grave jeopardy of being overrun by these evil Marxist! I think it will get so bad that people will be forced into defending their family s, themselves,their neighbors, their freedom,the Constitution and their Country in what ever means necessary! My God protect us!","commenter_a":"Guns and ammo.... Buy them now while you still can. God Bless America (what's left of her)","post_message":"U.S. Supreme Court Justice Antonin Scalia defended interpreting the Constitution as it was originally written and intended.  Scalia passed today after serving on the nation's highest court for 30 years. fxn.ws/1obcGnN"},{"comment_id":"10152897660675950","commenter_b":"I wondered the same thing. Those bitches be crazy!","commenter_a":"where's part 3??","post_message":"In a video of the incident, two women are heard yelling at one another before the argument escalates and gets physical. Then a 6-year-old gets involved; at one point, the boy is seen hitting a woman with a shampoo bottle as the women wrestle on the ground."},{"comment_id":"10152996747985950","commenter_b":"look at the KKK what a bunch of ugly losers... lmao...","commenter_a":"Good","post_message":"More rallies have been planned..."},{"comment_id":"10154165459449087","commenter_b":"Don't stir up the bear, pussy!","commenter_a":"Yet more pathetic infantile nonsense from the shit house otherwise known as the white house","post_message":"The White House is vowing to retaliate without warning to Russia's alleged hacking."},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."},{"comment_id":"10154289426723797","commenter_b":"@username I am an alcohol manufacturer.","commenter_a":"They should never have been in prison to begin with.","post_message":"OBAMA COMMUTES DRUG SENTENCES: Nine people from Illinois are among the 95 whose prison sentences have been commuted by President Barack Obama."}]
