[{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"1227335790638732","commenter_b":"You are a Pussy, bitch !!!","commenter_a":"Lmaooooo Go Ana....I LOVE IT 😂","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN.  Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10154732031694411","commenter_b":"Well you said yourself 'you feel sorry fkr iranians lving in primitive conditions ' and i drew a comparison with Saudi Arabia just to show you its worse there but you won't see that on your tv because saudi arabia is an ally of the west so western media will cover them up... the same iranians you said are living in primitive conditions, make cars, fighter jets, warships, commercial ships, helicopters and are very independent meanwhile saudi arabia doesnt even make a pen so whats primitive to you?","commenter_a":"Good to hear.. Iran and Italy are ties in a relationship against the Israeli brutalities. (Y) it seems that Iran is going to change her policy. Undoubtedly Iran is at right path..","post_message":"'Unprecedented': Maneuvers come despite several controversial incidents involving US warships in the same area"},{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"}]
