[{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"},{"comment_id":"10153216182159087","commenter_b":"Your FAILED IRAK WAR, for one, you stupid evil BITCH...","commenter_a":"Hey, Obama, WHY don't you have any decent responses on your EVIL warmongering failures around the world?... just cowardly U.S. policies... your shamed administration should at least stop being so hipocritical...","post_message":"“We can’t have no response,\" says Michael McCaul. \"And this administration has absolutely failed to put any sort of consequence on their actions.”"},{"comment_id":"10154935119131753","commenter_b":"Ditch her now!!!!! She is the worst choice! All she has done is donate millions to the orange one!","commenter_a":"Senators McCain and Graham are probably already on his enemies list. Please do the right thing here!","post_message":"If a third Republican senator joins the opposition to DeVos, it may not only be unusual; it could be historic."},{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"\"The commanders are the ones who should set the rules of engagement, not politicians\""},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"1109422589147098","commenter_b":"Dumb whores for Trump","commenter_a":"He has no respect for anyone. Scum","post_message":"In a battle between Trump and Intelligence, Intelligence wins."},{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"}]
