[{"comment_id":"1165479466892468","commenter_b":"Bitch please","commenter_a":"@username HAHAHAHAHAHA","post_message":" #WSHH"},{"comment_id":"10154723895793734","commenter_b":"Of course that's the type of trash that wants Clinton elected","commenter_a":"The guy who did this is a Republican","post_message":"Donald Trump's campaign manager is saying without evidence that a Trump protester involved in a disturbance at a rally in Reno, Nevada, was \"a Democratic plant or operative.\""},{"comment_id":"10154838480761729","commenter_b":"Nothing will stop this because they want to become martyrs and are ready to die for Allah. Killing them before they kill you is the only solution.","commenter_a":"Here we go again, it's the guns! Oh wait, I thought ALL guns were illegal in Germany? They need to tell these criminals that they are not supposed to have guns! How dare them break the law and get illegal guns! They need to make more gun laws because that will make it harder to get guns.","post_message":"UDPATE: Authorities warning MASS TERROR ATTACK UNDERWAY  Manhunt underway, public transit shut down..."},{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"\"I'm asking you to believe... YES WE CAN!\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153906125115736","commenter_b":"So should grabbing pussy.","commenter_a":"It's already beginning to sound like a dictatorship!","post_message":"Trump says burning the flag should be punishable by \"perhaps loss of citizenship or a year in jail.\""},{"comment_id":"10152737954746051","commenter_b":"She should never have bred!","commenter_a":"It's too bad the parents cannot( will not) just pay the fee and get over it.","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10153712175233352","commenter_b":"So it would be ok to throw down in front of a toddler is that what you are saying? She should have put her down for what huh, for what? Get some sense in your head !! The only guilty party is the lil bitch who hit the girl holding a child she is a straight up coward and thats probably the only reason she hit her cause her hands were full!","commenter_a":"I think all parties are guilty the ones egging it on the mother of the child and her friend. Her friend seen what was going on so she should have taken the baby and the mother... Should have put the baby down as she see the girl kept saying put the baby down and appeared not to give a dam. Believe me all parties played their part in the hatred or what ever that got them to this point. In reality the mother used her child as a pawn thinking it would have saved her from a ass whooping putting her child in danger. Thank God the female was caught and the baby is ok. They all need to get it together... Because believe they all full of shit and played a roll in this fight...","post_message":"Texas girl, 13, who was caught on camera as she launched brutal assault on rival teen holding a toddler is now in police custody"}]
