[{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"10157473875275354","commenter_b":"The fact that he is pledging his support after this email scandal, proves that he is now being bought by Killary!","commenter_a":"A leaked memo shows the Bernie Sanders campaign considered asking the Democratic National Convention for a private plane as part of his endorsement of Hillary Clinton to help his movement energized. Feel the burn of corruption!","post_message":"WATCH the mass march and see just how \"united\" Democrats are...against Hillary Clinton!  \"Hell No, DNC, We Won't Vote for Hillary!\" #DNC"},{"comment_id":"10154216584759203","commenter_b":"Ivory towers allow a lot of false logic. She'll just fly away to her mansion. No skin off her nose.","commenter_a":"I thought, \"Well she is on with Bill Maher. Lets see how she explains this away. And all she did was lie. She said she simply said yada and the people who were complaining didn't see the interview. Well I saw the interview and she lied. Not to be undone though, after a few minutes with Bill Maher, she actually showed her true colors and did admit what she believes. Then to top it off, as soon as Bill Maher brought up their support for Ralph Nader, which cost the country GW Bush and millions of lives, she simply interrupted, pivoted and changed the subject. She is a horrible human being and I wouldn't watch another movie with her in it on a bet...even if she does have the best rack of any 70 year old(Oct) I've seen.","post_message":"Susan Sarandon found herself in the hot seat Friday night."},{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"1354400067935066","commenter_b":"Just try it you fucking bitch! Just try it!","commenter_a":"PRESIDENT TRUMP, PRESIDENT TRUMP, PRESIDENT TRUMP!!!! WE THE PEOPLE SAID SO!","post_message":"Discuss.   SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate for progressive news and opinion that you can trust."},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."}]
