[{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10154515362469087","commenter_b":"Way too big of words for this crowd guys. Need to simplify it. Mexicans are the cause. Build a wall and it will rain in California.","commenter_a":"Science is no longer about science. It has become driven to support a liberal socialistic goal. They are as political as anything else and just as suspect of being true.","post_message":"Bernie Sanders: \"A modern society cannot survive unless decisions are made on evidence-based research. Congratulations to those scientists and researchers who are fighting back.”"},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."},{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"664601907063721","commenter_b":"What a FFFFFFFFFFing Bitch.","commenter_a":"Yes","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"540837429437883","commenter_b":"They reap what they sow ! Don't allow them in your country. Deport the ones there .","commenter_a":"Lets not allow these problems with muslim REFUGEES in europe keep us from doing our duty for the safety of america. Our president asked that we turn in our guns so we really need to get moving and take care of that!","post_message":"COMING SOON in your city and town..."}]
