[{"comment_id":"10153033979746378","commenter_b":"She was a dummy","commenter_a":"Just wondering... Why does everyone care now all the sudden","post_message":"A woman has been arrested after removing Confederate flag from outside South Carolina Statehouse."},{"comment_id":"1329355063770614","commenter_b":"And yet, billions of US tax dollars are given to foreign governments each year without the consent of tax payers. It's disgusting and so sad that we have Americans living like this and Obama and the entire Democratic party wants to bring hundreds of thousands more refugees into this country to live on the taxpayer dole! How stupid are we to keep putting these people into positions of power this way?!!","commenter_a":"There are many homeless in the Seattle area that live in tents because they don't want to have the restrictions that comes with living in a homeless shelter. Restrictions with when they come and go and what goes on there.","post_message":"OBAMA PUSHES AMERICANS INTO TENT CITIES.  Hillary will keep them there.  VIDEO  @webpagelink"},{"comment_id":"10153642525234411","commenter_b":"Para estar en un paisaje tan encantador vale la pena.","commenter_a":"PROOF THAT RUSSIAN TROOPS ARE FIGHTING IN UKRAINE @webpagelink","post_message":""},{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"10153163723737377","commenter_b":"She belongs in jail!","commenter_a":"And Huma's email said something about after her nap. Seriously this evil woman is too old to hold the highest office in the United States of America!!!!","post_message":"\"These new Benghazi emails are disturbing and show why Hillary Clinton and the Obama administration had to be forced to disclose them,\" said Judicial Watch President Tom Fitton in a release to Newsmax. Watch more on this tonight on Newsmax TV- Directv 349, Dish 223, Verizon FiOS 115, or Newsmax App."}]
