[{"comment_id":"1137364809637709","commenter_b":"Love you Scotland just stay safe","commenter_a":"Go Scotland ❤️","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"10153191850561051","commenter_b":"Bitch","commenter_a":"Here's a perfect example of \"children aren't born racist, they are taught racism\" That woman should be ashamed of herself.","post_message":"When a mom heard what this lady was saying to her kids, she took out her phone and began recording."},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in.   Should parents have taken kids out of school for the parade?"},{"comment_id":"1219889091393445","commenter_b":"Is it racist to say pot calling kettle black ?","commenter_a":"Cummings is a walking violation of ethics. Pot call.","post_message":"Whoops."},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"815781625279081","commenter_b":"this is America bitch dont like it take ur camel and ur fanatical hateful selves back to hubbabubba where the f*** u came from. i fought u over in ur backyard dont think i wont put 1 in u in mine mf","commenter_a":"Yes","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED There is no reason why they should have to change their business for them. Do you support these food chains?"}]
