[{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"1055104137833836","commenter_b":"Let 'em try! They'll fail miserably!","commenter_a":"Because they welcomed the terrorists with open arms. And because the French people allowed their government to disarm them. They were sitting ducks. Thank God for the Second Amendment. If they could, the gun grabbers would disarm us.","post_message":"Why Paris? Why now?"},{"comment_id":"847297252033195","commenter_b":"Girls run the world!","commenter_a":"No on F'in cares except the racist thugs like OFAILURE & OSHARPTON & BSNBC !","post_message":"Who run the world?"},{"comment_id":"665938460232774","commenter_b":"heard it thinking it wouldn't be thattttt bad, me after: ok he's officially a pig","commenter_a":"Jasmine","post_message":"\"When you're a star they let you do it.\" -Donald J. Trump"},{"comment_id":"1308930149151726","commenter_b":"Smug asshole !","commenter_a":"and why is anyone voting for this self centered fool ....","post_message":"His response is simply \"deplorable.\""},{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"10153626363751336","commenter_b":"If a man wants to kill,he can kill without a gun..might as well push for knife control while you at it..","commenter_a":"That's cause he's an idiot.","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"}]
