[{"comment_id":"244406076005864","commenter_b":"@username drug cartels make millions on drug sales they will find a way around it but okay build a billions worth of wall that will stop evrything","commenter_a":"Thanks for the post, I knew he was good, but I didn't realize he was THAT GOOD!! Awesome! It's sad he has to mop up this big mess from Obummer before he can get around to some other great changes.","post_message":"Give Donald J. Trump a chance? Here's what he's done in the past 36 hours..."},{"comment_id":"10154562004884749","commenter_b":"How do you know it's a woman. Would she/he submit to a dope test?","commenter_a":"So she wears a body suit and that makes her special. I think not.","post_message":"She didn't win her race, but she did make history."},{"comment_id":"1108095542598003","commenter_b":"@username please lady shut the hell up!","commenter_a":"O'Reilly won't stop spewing rubbish. He expected Obama to make same mistake like Bush and Blair by drafting thousands of troops to Syria like Iraq. If Obama has made that misstep, more than a thousand of finest American soldiers would have been killed there by now. Bill needs to be grateful to Obama by not being a blood thirst. There are more than 12,000 gun violence related death in America annually, he won't even address that. Funny old man!","post_message":"\"There's no question the Obama administration's greatest failure is allowing the Islamic terrorist group ISIS to run wild.\"  Bill O'Reilly criticized President Obama's response to the terror threat, adding he doesn't \"define the ISIS threat accurately.\""},{"comment_id":"564500333698743","commenter_b":"Liz is either stoned or drunk on the kool aide.","commenter_a":"yeah right","post_message":"Hmm...gratitude was not exactly the word I had in mind."},{"comment_id":"10152947351429091","commenter_b":"They should send these idiots to go fight Isis since there so big and bad let's see how big n bad they are then..","commenter_a":"I hate ghetto children! Yes hate! That is our future? I'm scared.","post_message":"UPDATE: 2 arrests were made in a vicious beating at a McDonald's in Brooklyn. Teens were trading blows when a Good Samaritan jumped in...then he became a target, too. MORE: @webpagelink"},{"comment_id":"1059635564057454","commenter_b":"Yes, maybe if they progress a bit more they'll finally go back to saying the bible explains everything and we should pray poverty, hunger, and crime away.","commenter_a":"Progress","post_message":"I'm sorry, what?"},{"comment_id":"10152873663099877","commenter_b":"She tried it, smh.","commenter_a":"I Hate when racist retract what they say! \"You're a racist\", you said it therefore you meant it!","post_message":"Giuliana Rancic Disses Zandaya's Locks: 'She Smells Like Patchouli Oil Or Weed.' Watch and read more on this including Zendaya's and Twitter's response.  Grio fam, what do you think of Zendaya's response?"}]
