[{"comment_id":"10153447709650667","commenter_b":"If this would ever happen to my mom. I would make room so she can live with me.","commenter_a":"Good just because your old , you still have to follow the rules . If they make exemptions based on age that would be discrimination .","post_message":"“I have four grandsons, but I don’t want to be dependent on them. I can’t be a burden to my family. They don’t have room for me. That happens in life.”"},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite \"Star Trek\" moment involving the Enterprise's chief science officer?"},{"comment_id":"10154209285520969","commenter_b":"Madeline why then, where we're your masses in Nov. Your just sad","commenter_a":"Patricia slice that is such a lame fucking saying","post_message":"WATCH LIVE: The Senate votes on the nomination of Jeff Sessions for Attorney General after Republicans voted to silence Elizabeth Warren."},{"comment_id":"10153440207470950","commenter_b":"The stats show that you're more likely to shoot a family member than anyone else. Guns don't kill people, but people with guns can and do kill more people than those without. Who would have been at fault if the kids shot out the car window and killed someone? The kid, or her for failing to secure a murderous weapon? What if after after being almost killed by her son, she veered into on-coming traffic and kills another driver? Who is at fault then? Not only do I not understand the pro-gun and pro-kill people, I don't believe their justification for wanting to kill.","commenter_a":"Dumb ass","post_message":"The mom, a pro-gun activist who runs the page Jamie Gilt for Gun Sense, told deputies her 4-year-old son shot her in the back with a .45-caliber handgun that was on the floor of her pickup truck."},{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."}]
