[{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"480250615511785","commenter_b":"she is a lier","commenter_a":"She's teflon!","post_message":"It really doesn't make any sense... www.eaglerising.com"},{"comment_id":"10153506659437964","commenter_b":"There are those who useabortion as a contraceptive. I know a young lady who had so many that when she got married & wanted a baby, she couldn't have one. Turned into an alcoholic.","commenter_a":"I thought Obamacare was going to take care of the poor...the ones who couldn't afford health insurance...so why do they need planned parenthood?","post_message":"On Monday, we'll be voting to eliminate federal tax dollars going to Planned Parenthood. I can assure you I'll be voting 'yea.' #preauxlife"},{"comment_id":"10152810357076130","commenter_b":"Dike supporter? Leave the USA then","commenter_a":"Too bad they can't be fired for being worthless POS's and I'm talking about the people the staffers work for","post_message":"Under current House rules, congressional staffers can legally be fired for their sexual orientation, gender identity or gender expression."},{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"969542393176866","commenter_b":"these woman being paid by Hillary..it took them all 30 years to come out...they want their 15 minutes of fame...wonder if they'd like it if someone did that to their Dad or brother...?","commenter_a":"I think his own recording is pretty factual","post_message":"\"He has been nothing but completely respectful.\"  Chelsea Cooley Altman, who was Miss USA 2005, gave her assessment of Donald J. Trump in the wake of multiple women accusing him of sexual misconduct."}]
