[{"comment_id":"1086650491355306","commenter_b":"Furthermore: @webpagelink","commenter_a":"the outcome is so sad, I feel sorry for the woman relatives... I believe her suicide was due to the bad treatment she received from police, and that she was extremely emotional about it... nothing will avoid this happening again, but re-training the whole police dptm about the way they treat any ordinary citizens nowadays","post_message":"A Texas trooper who arrested Sandra Bland has been fired after being charged with misdemeanor perjury on suspicion of lying in the arrest report he filed, officials said. Read more: @webpagelink"},{"comment_id":"1004322553035851","commenter_b":"Great point. Now- ALL women use shame to enforce social order among women, and men when they can get away with it. Men are the same with violence. ALL men. (And towards women when they can get away with it) Here a white women leveraged racism to solidify her place in her social order at that time. (The black male victim suffered death for that.) When enough white males clue in that women leverage \"male\" state and personal violence to enforce their own wishes, black lives will be saved.","commenter_a":"Female privilege. Didn't you know?","post_message":"Why Did Tyson Wait So Long to Reveal Carolyn Bryant Donham Lied About Emmett Till's Murder?"},{"comment_id":"10153098035411336","commenter_b":"No black race can prosper in caucasian society africa today has more midlle class than india our people in united states are in hell we africans has more future than them i hope one day they would come back to their motherland and leave the caucasians with their stolen land","commenter_a":"Time to clean up your act. Why do Asians, Europeans and other immigrants acclimate themselves into society but after 150 years blacks still expect others to take care of them. They are a society of takers and beggers. I'm sick of it. Why has Oprah, Conde Rice, Colin Powell and many others succeeded? ... they conformed to society, got an education and accepted responsibility for their own life and THEY WON.","post_message":"\"Nobody from ISIS ever terrorized us as a people as the police do us daily,\" Nebraska State Sen. Ernie Chambers said during a recent legislative hearing."},{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"10153199114815950","commenter_b":"I'd pick up the deal with her in it and put her outside. Call her parents and tell them she's outside. She looked small enough. The cop lost his cool. Out smarter by a brat. Now he is fired and they will sue. Sad all around.","commenter_a":"I was raised very conservatively about manners and respect, and I agree that she was wrong for her actions. However, that deputy does not need to be a SRO if he is going to deal with students this way. It's unprofessional and disturbing.","post_message":"\"I was praying out loud for the girl and I just, I couldn't believe it was happening. I was just crying, and he was like, well since you've got so much to say you're coming too.\""},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"},{"comment_id":"644007369123175","commenter_b":"She doesn't deserve the publicity!","commenter_a":"If this is true, I'm done with McD's....","post_message":"Michelle's face is being plastered all over this fast food chain.  Disgusting. We'll never eat here again.  'LIKE' if you think this is WRONG!!!"}]
