[{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"10154726386446729","commenter_b":"Evil witch!","commenter_a":"Sonny Blaze, happy Sunday","post_message":"But yeah, she's supposed to be a role model."},{"comment_id":"10153422739691167","commenter_b":"Oh goodie, now pass the popcorn.","commenter_a":"Who gives a damn? Why was he looking at her? I bet he kept watching nasty irrelevant ass","post_message":"Rudy Giuliani and Fox News are livid at Beyoncé this morning."},{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"1091280717559605","commenter_b":"@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"}]
