[{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"1202982936435126","commenter_b":"I agree fuck him he got that light skin nigga syndrome straight bitch","commenter_a":"That's what he gets","post_message":"Thoughts? Is this fair punishment for the crime? #KevinGates #Jail #WSHH"},{"comment_id":"10152899941331336","commenter_b":"Sick woman","commenter_a":"This young lady will burn in her afterlife.","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"}]
