[{"comment_id":"582449118570531","commenter_b":"Maybe to you but the ladies love me.","commenter_a":"GOP has nothing but Scare Tactics, look at all the fools they have running not a good one in the lot. What Scarey is if one gets elected then it time to be scared, they'll take the whole country down the Hole.","post_message":"The boogeyman will get you. via Grobanites for President Obama."},{"comment_id":"937143676339798","commenter_b":"And deport a politician who supports closed borders for every American murderer.","commenter_a":"Excellent .","post_message":"LIKE and SHARE if you agree...  100percentfedup.com"},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"},{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"10153847208137894","commenter_b":"Bitch get your pasty ass on with that lie. What personal struggles has to do with you utilizing the word??? White people are full of shit bc whatever was said she meant it. They love to come back with a weak ass apology as though that changes anything. I love it when they make an ass of themselves or get fired bc it shows them that that so called white privilege isn't paying off like they want. Well opps dumb bitch your bad.","commenter_a":"Miss 'm y ass ..bullcrab","post_message":"Miss Teen USA Apologizes for All of Her N-Word Tweets, Blames Them on ‘Personal Struggles’"},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"10153624257330695","commenter_b":"She should have gone after her husband instead of the mistress. It takes 2 to tango","commenter_a":"i think she was pissed!!!!! people need to quit cheating on their spouses, i can relate to this!","post_message":"Carroll County deputies say she led them on a chase down I-20 before killing the woman and then herself."}]
