[{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"887259011404129","commenter_b":"She smacked him down with that","commenter_a":"That was my favorite point in last night's debate. It really showed who has done more for our country in the last 30 years.","post_message":"\"I'm happy to compare my 30 years of experience with your 30 years.\" —Hillary to Trump #Debate"},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"367411220096110","commenter_b":"Dalia Montosa","commenter_a":"Katherine Cardenas","post_message":"No bridesmaids assistance necessary!"},{"comment_id":"836657323038276","commenter_b":"She didnt get in trouble for the see through top. She got in trouble for her shoulders. Even if she did wear a shawl over it, it would still show the see through part","commenter_a":"I agree with the school","post_message":"Take a close look."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"1170579889643596","commenter_b":"Haha I thought the same thing. She should cover up!!! Lol","commenter_a":"She shouldn't be breastfeeding in public.....she should cover up.......oh wait animals breastfeed their babies out in the open too and no one bats an eye. Sorry just had to","post_message":"Prague Zoo's 24-year-old gorilla, Shinda, gave birth unexpectedly to a baby girl. Zookeepers didn't know Shinda was pregnant; they thought she was just overweight. @webpagelink  Correction: Prague Zoo has not yet released the official name of the baby gorilla. Shinda, its mother, has been living at the zoo since 2001, not 2003."}]
