[{"comment_id":"911723728894896","commenter_b":"Witnesses lying on the police..glad there was camera...+1 for the good guys 😀","commenter_a":"All \"community leaders/organizers\" who make snap judgments about how an officer handled a situation should be made to go through a re-enactment of what the officer went through while making their decision. Maybe by walking a mile in their shoes they will have an inkling of an iota.","post_message":"Here we go! Witnesses say a white officer shot him in cold blood, this newly released video tells different story"},{"comment_id":"760057160777731","commenter_b":"Kick her off the force","commenter_a":"She should be sacked for that .How are Americans letting there country , that there relatives fought for .Letting this happen . You are been invaded ,don't you see this . They are Attacking you on your land ,they burn your flag and disrespect your ways ,I never thought Americans would stand for this .Has Obama destroyed America .","post_message":"Here's Islam in action, again. @webpagelink"},{"comment_id":"1626733787627072","commenter_b":"D'nariusLovable Lewis you ever hear this girl talk? Lol she is delusional and ignant as fuck haha","commenter_a":"Tomi Lahren. The next Ann Coulter?","post_message":"You've seen Tomi Lahren's criticism of anti-Trump protesters making the rounds. Here is our Occupy Democrats response. Share it on her wall to make sure she sees it!"},{"comment_id":"1806403532965541","commenter_b":"She's a hawk. And trump's an isolationist. So who's weak?","commenter_a":"Hillary Clinton must be stopped at all costs. Or watch more and more Americans Die under her weak administration","post_message":"Live: Donald J. Trump gives a speech on veterans' issues in Virginia Beach, VA."},{"comment_id":"613032028845756","commenter_b":"Well I can only say if you had to live with Barack Obama as president for 8 years she might see herself that way.","commenter_a":"Else get bitch out of.thire","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10153074240773067","commenter_b":"Lol no, A stockholder though, and everything that i put on here were statements from Ford in response to Donald Trump.. Just summarized","commenter_a":"Trump had nothing to do with this. This was because Ford, and the UAW were able to work an agreement, Ford is committed to keeping and creating jobs in the U.S. They have created 25,000 new jobs in the U.S. In the past four years. Over 80% of their manufacturing is done in the U.S. And 97% of their engineering is in the U.S. As they stated. No i dont like seeing jobs being outsourced, but Trumps statement had no effect on the outcome of this. Im happy for all the people who kept their jobs. Ford is a great company! And will do what they can to keep bringing new jobs to the U.S.","post_message":"This comes after Ford Motor Company came under fire for creating thousands of jobs in Mexico. @webpagelink"},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"}]
