[{"comment_id":"1754592891449959","commenter_b":"@username totally 💞","commenter_a":"@username 💖👻💖","post_message":"It's literally the most magical thing of all time, Harry Potter fans."},{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"1163431957079567","commenter_b":"Lord knows what kind of sinister crap Letterman is in to. Look at him.","commenter_a":"Letterman stopped being funny/relevant in 1994.","post_message":"When did David Letterman morph into Father Time?  Yeesh."},{"comment_id":"10153394655753908","commenter_b":"is anyone here surprised by this information?","commenter_a":"Get a grip","post_message":"For those who haven't seen this yet. \"Ever single terrorist attack in the US was a false flag attack.\"  There is a tremendous amount of research to back up this statement."},{"comment_id":"10153830335904087","commenter_b":"Course they won't. They just coronated their queen.","commenter_a":"The most transparent \"administration\" in history.... LOL","post_message":"#BREAKING: The State Department is refusing to hand the House Oversight Committee any email messages as part of the panel’s investigation into eight deleted minutes from a 2013 press briefing video."},{"comment_id":"919874341467572","commenter_b":"WOW...THAT IS A AWESOME BEAUTIFUL PICTURE...GOD BLESS YOU ISRAEL...","commenter_a":"Beautiful!!!","post_message":"#TelAviv by Chief Eran Yerushalmi  #PicoftheDay #Israel #Beach"},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"}]
