[{"comment_id":"10153457478146770","commenter_b":"She can't stand herself either!","commenter_a":"Fright night with the Obamas","post_message":"We did NOT see this coming..."},{"comment_id":"1052426431445034","commenter_b":"You do realise the Weasel is trying to kill the Woodpecker, right ?","commenter_a":"Nature is amazing! Humans could learn from it.","post_message":"This amazing photograph shows a weasel RIDING a woodpecker!"},{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"10153583217394712","commenter_b":"I'm getting hit with smokers tax and I don't smoke. Time to divorce my wife and let her and kids go on state insurance and I'll pay penalty !! It's the American way.","commenter_a":"Up up and away....the never ending story of insurance rate hikes. We pay. $1200 a month as it is....SMMFH","post_message":"The state's largest insurer says they are dealing with more than $100 million in losses and other issues that have driven up costs."},{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"},{"comment_id":"10154640595946337","commenter_b":"It's all bullshit anyways..","commenter_a":"Must be nice to be rich and privileged! If I were to protest while on the job I would .get fired. Not all white people are rich and privileged.","post_message":"The Kansas City Chiefs stood with their arms intertwined as the anthem played."}]
