[{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"10153289541199614","commenter_b":"Thank God he blessed me! Don't gotta do that","commenter_a":"stupid is has stupid does! Forstes Gump","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family.  The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show.  The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153614768367550","commenter_b":"Women shut da hell up I'm short hand writing","commenter_a":"People be ready to dissect the situation, wen in reality it's the system fault. What do you expect it's no jobs in Fayetteville. People looking at what I'm saying and they're lik Wat is he talking bout. Like I said it is no jobs in Fayetteville, and this is suppose to be a military town it should be jobs all over the place but it's not. It's three types of ppl in Fayetteville. The military, the civilians that's what they call us. And the third is ppl who do what ever it takes to get paid or feed they family. Now don't get me wrong yea it's messed up ppl breaking in ppl houses. But give these ppl job's and I bet all the money in the world they become a better civilian then the first person who commented on this topic. @username. No job's and this is Wat u ...","post_message":"\"And you're charged with a similar crime that you just went to prison for?\"  \"Yes, Sir\""},{"comment_id":"10153164083911770","commenter_b":"Good, she needs to leave the country too","commenter_a":"Good","post_message":"An atheist councilwoman in a town amid New Jersey’s suburban sprawl stormed out of a council meeting on Thursday and quit her job after the council decided to name the town’s Christmas tree-lighting event a “Christmas Tree Lighting.”"},{"comment_id":"10154141987653145","commenter_b":"@username Yes! Thugs with guns and badges paid by our tax dollars.","commenter_a":"This is where we are today: Killer cops kill civilians and get away with it. Civilians kill cops and either get killed by other killer cops, or if very lucky, they get arrested, charged, and sentenced. Killer cops have no empathy for civilians they kill, or their families. The copsuckers show no empathy for the victims of killer cops who again, get away with it. If the killer cops, along with their apologists don't show empathy for the victims of police killings, why should civilians show empathy for the killed cops? If the killer cops won't shed tears when civilians get killed by cops, why should civilians shed tears when cops get killed? If the killer cops along with their apologists think it's OK for the civilians to be killed by cops (the unjustified killings), why shouldn't the civilians think it's OK for the cops to be killed? Only if ...","post_message":"The slain officer was a special agent with the Georgia Bureau of Investigation. Police say the gunman remains at large this morning."},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"1750200585039682","commenter_b":"Wear a condom then you stupid, despicable woman","commenter_a":"Couldn't just let her be adopted.........","post_message":"What a horrible woman"}]
