[{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."},{"comment_id":"10153503592741336","commenter_b":"LOVE HIM!","commenter_a":"I CAN NOT TRUST THIS GUY NO A biT I RATHER VOTE FOR NOBODY TO GIVE HIM MY VOTE, HE COULB BE WORST THAN OBAMA. WISHY WASHY GUY.","post_message":""},{"comment_id":"10152954231420399","commenter_b":"Paybacks are a bitch!","commenter_a":"Karma isn't it great","post_message":"An extraordinary act of trolling:"},{"comment_id":"1589692694655762","commenter_b":"Nothing racist about, I have the same problem. Some do not understand us and takes forever","commenter_a":"How can you criticize this? Who actually likes calling those?","post_message":"\"So I called up, under the guise I’m checking on my card. I say, 'Where are you from?' They say, 'We are from India.' Oh, great. That's wonderful. Thank you very much,\" Donald J. Trump said, signaling as if hanging up a phone."},{"comment_id":"10154084384520695","commenter_b":"Good for you. My half white, have Creek. Mother - full blooded Cherokee. . . And l saw a lot of beautiful children of all colors posted here.","commenter_a":"Why does the baby have to be white","post_message":"7-month-old Isla is darn cute."},{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"}]
