[{"comment_id":"10153567404684087","commenter_b":"His wife doesn't look happy in photo","commenter_a":"Is it, \"Gotcha! Now buy my new book. I'm dropping out of the race. It's been fun\"? Because his run is obviously a bad joke that some people are apparently taking seriously.","post_message":"Donald J. Trump is holding a special news conference on #SuperTuesday night to deliver a major announcement. WATCH LIVE:"},{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."},{"comment_id":"559381210853585","commenter_b":"You only opt in because the choice is an illusion. Who reads the terms and conditions on anything online these days? Very few. I haven't thought of a solution re advertising, and the way things are going its only going to become more intrusive. The advent of neuromarketing is already upon us. The introduction of the 'reactions' facility on FB not excluded.","commenter_a":"I would try and read the enclosed article but the bombardment of ads, some obscuring the text, in the first 10 seconds put me off.","post_message":"Hint: it has nothing to do with preventing terrorism."},{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"},{"comment_id":"1720336911319665","commenter_b":"@username ....but she can't stay out of the politics, can she?","commenter_a":"Fake awards made fake news today with the known results by the presenter Warren Beatty, admitting \"I KNEW WHO WON (in this super secret ballot), SO I WAS PUZZELED WHY IT WASN'T LA LA LAND\". Just like Hillarys victory, she won until reality stepped up and slapped her in the face.","post_message":"La La Land producer Jordan Horowitz has been praised for his handling of the epic #Oscars fail."},{"comment_id":"10154516919809575","commenter_b":"Actually yes it was.","commenter_a":"Full moon?","post_message":"Police are on scene investigating after they say 2 people were shot on the west side.   Six people have been shot since 8:30 p.m. Thursday."},{"comment_id":"10153589906358984","commenter_b":"Stop giving this ignorant b*tch attention.","commenter_a":"Yes I do send them over to join isil","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"}]
