[{"comment_id":"10153212913058145","commenter_b":"The problem is that She's an evil mean peace of crap, that should had never been born","commenter_a":"Everyone loves kittens so what is the problem?","post_message":"A north Florida woman is facing charges after deputies said she was seen throwing kittens out of her car window. @webpagelink #wftv"},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"671681693020122","commenter_b":"Donna should be in jail!","commenter_a":"She is a cheater","post_message":"Does she DESERVE TO BE ARRESTED?"},{"comment_id":"10155207761586509","commenter_b":"We don't do that to white people Bill....","commenter_a":"Just imagine if it was the other way around. They would have been met by heavily armed border guards pointing automatic weapons at them. They would have been put in handcuffs and leg irons and paraded before a judge and then be jailed for a ridiculous amount of time.","post_message":"Oops. 1,500 Americans accidentally floated over to Canada. @webpagelink"},{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."},{"comment_id":"10153478899444342","commenter_b":"Liberals are actually MURDERING people with their stance. The liberals are the real murderers. Did I say that ENOUGH? @webpagelink","commenter_a":"I am not a veteran. These are Christopher's words Christopher Allard 23 hrs · Edited · I don't typically go on rants or express my political beliefs here, but I just have to get this off my mind. As some of you know, I'm active duty Army. Aside from that, I am a medic. I've spent 3 years of my life overseas in both Afghanistan and Iraq. I've seen some pretty atrocious sites caused by war, from both sides. I've picked up blown up body parts of friends and I've saved the lives of guys who were trying to kill me and my guys right before I was keeping them from their 72 virgins or whatever they believe awaits them on the other side. Here is an unbiased truthful view to the Syrian refugee situation. My first deployment to Iraq, in 2006, my unit voluntarily ran a childrens burn clinic ...","post_message":"President Obama is vowing to veto a bill from House Republicans that would increase screening for Syrian and Iraqi refugees before they enter the United States. #abc13"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"}]
