[{"comment_id":"961735010603412","commenter_b":"Good job Iowa","commenter_a":"Go trooks","post_message":"Join me in Iowa - attending a great event in honor of wonderful Senator Joni Ernst. Let's MAKE AMERICA GREAT AGAIN! #RoastAndRide"},{"comment_id":"10153036151346545","commenter_b":"That's nothing to brag about. we may be the majority but we also hold the majority of the most least paying jobs because most of our \"people\" are uneducated. Illegals are the worst part of our society. My family came here legally, so should everyone else's.","commenter_a":"we are the majority not the minority #vivalaraza #razaunite","post_message":"If only there was some sort of reality show catchphrase we could use at a moment like this to sum up NBC's break with the \"Apprentice\" star..."},{"comment_id":"520761104778849","commenter_b":"Muslims are taking over united states they run all motels and 7 elevens in the country I don't know if its cause our government gives them a break on payinv taxes!","commenter_a":"political correctness......","post_message":""},{"comment_id":"10152942942461130","commenter_b":"You'd call them \"girls with their vaginas hanging out, ass showing and everything else.\" Cool ?","commenter_a":"Good. This needed to happen.","post_message":"Um..."},{"comment_id":"10152865753567014","commenter_b":"another embarrassing moment for Arizona media :/","commenter_a":"Yunuhen Tinoco Alfred Hernandez Monique Martinez Holst @username I'm ready to catch a big boy like this!","post_message":"We're going to need a bigger boat."},{"comment_id":"10153450761424024","commenter_b":"blacks kill more blacks than any other race in this nation...but their little jungle minds don't see that !","commenter_a":"we don't want you because your dragging your diapers all over town. Get rid of the load, then we'll talk Leroy","post_message":""},{"comment_id":"1554113821370873","commenter_b":"What an ASS!","commenter_a":"Now we see how close he is to that N word, he will before to long.","post_message":"Speechless."}]
