[{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."},{"comment_id":"958150317529772","commenter_b":"The NCAA brass is a bunch of hypocrites.","commenter_a":"Oh Please this is 2015 people move on, get out of the dark ages.","post_message":"Recreational marijuana use is legal in Oregon"},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"547509162098460","commenter_b":"I can t push like I push agree!","commenter_a":"sounds like you support clinton ted","post_message":"Our nation is at war. From 9/11 to the Boston Marathon, from Fort Hood to Chattanooga, from San Bernardino to last night’s horrific attack in Orlando, radical Islamic terrorism has declared jihad on America. Early reports indicate the Orlando terrorist had pledged his allegiance to ISIS, and he had previously been investigated by the FBI. And yet, as with the prior attacks, we were not able to act to stop this act of vicious terrorism that has now murdered 50 and injured more than 50 others.   Our hearts go out to those killed and wounded last night. Our prayers are with their families, and with all their grieving loved ones.      It is a time for action. We need a Commander in Chief who will speak the truth, and who will unleash the full force and fury of the American military to utterly destroy ISIS and its affiliates. We need to pass the Expatriate Terrorist Act, so that known ISIS terrorists cannot use U.S. passports to return to America and wage jihad. We need a President who is serious – who will identify the enemy by name and do everything necessary to defeat it.   The next few days will be sadly predictable. Democrats will try to use this attack to change the subject. As a matter of rigid ideology, far too many Democrats – from Barack Obama to Hillary Clinton – will refuse to utter the words \"radical Islamic terrorism.\" They will claim this attack, like they claimed every previous attack, was isolated and had nothing to do with the vicious Islamist theology that is daily waging war on us across the globe. And they will try to exploit this terror attack to undermine the Second Amendment right to keep and bear arms of law-abiding Americans.   Enough is enough. What we need is for every American – Democrat and Republican – to come together, abandon political correctness, and unite in defeating radical Islamic terrorism.   ISIS doesn’t just target soldiers. They don’t just target Republicans. Or Jews. They also target Christians and fellow Muslims. They target each and every one of us. As we saw this morning, they target the gay and lesbian community. Their objective, which they broadcast worldwide, is to murder or forcibly convert every single American.   For all the Democrats who are loud champions of the gay and lesbian community whenever there is a culture battle waging, now is the opportunity to speak out against an ideology that calls for the murder of gays and lesbians. ISIS and the theocracy in Iran (supported with American taxpayer dollars) regularly murder homosexuals, throwing them from buildings and burying them under rocks. This is wrong, it is evil, and we must all stand against it. Every human being has a right to live according to his or her faith and conscience, and nobody has a right to murder someone who doesn’t share their faith or sexual orientation.  If you’re a Democratic politician and you really want to stand for LGBT, show real courage and stand up against the vicious ideology that has targeted our fellow Americans for murder.   Today, all of America stands in solidarity with the people of Orlando. All of us should lift them up in prayer, demand action, and if you have any information about the Orlando shooter or potential radical Islamic terror plots, please act to keep us safe by using the FBI tips website: @webpagelink"},{"comment_id":"10153014740596545","commenter_b":"@username stop right there. No Bush should be allowed in politics anymore. They've controlled things long enough!","commenter_a":"Go away Rick Perry......far away!","post_message":"Rick Perry referred to the Charleston incident as an \"accident\" on Friday; staffers said he had meant to use the word \"incident.\""},{"comment_id":"10153356889206162","commenter_b":"But according to @username, only BLACKS are doing this foolishness...So I guess the Latin Kings, & the Sinoloa drug cartel, are peace-loving church groups...","commenter_a":"Im sorry but blacks enjoy killing their own over drug money gangs personal problems and ignorance. I do feel as sorry for those innocent people that have lost their lives due to the violence of this crappie city and ignorant people.","post_message":"DEVELOPING: 2 men are dead and a woman is injured after a shooting in North Lawndale: @webpagelink"},{"comment_id":"10154138194905329","commenter_b":"Look it says right here you're a little bitch.","commenter_a":"@username we got a badass over here","post_message":"When even art is tryna make gainz."}]
