[{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"},{"comment_id":"1771730343061531","commenter_b":"@username, no too bad YOUR MOTHER DIDN'T HAVE ONE!","commenter_a":"If anyone is out of touch with mainstream America it's conservatives. What this really should is how liberals are against bigoted, hateful, judgmental, narrow minded christian WHITE CONSERVATIVE IDIOTS.","post_message":"Democrats' threats of violence are intensifying, showing voters  how radical and out of touch Hillary Clinton and Leftist radicals truly are with mainstream America..."},{"comment_id":"916949761698106","commenter_b":"Stupid woman","commenter_a":"she cant find anyone who has a visa already ! ? :O","post_message":"Some women never learn"},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"10153544235856880","commenter_b":"My money is on Donald getting it done.","commenter_a":"Trump 20 16. Yes they will I am business man and I know I would make them pay it. Cost 30 billion","post_message":"Sorry, Donald."},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""}]
