[{"comment_id":"10155880167920354","commenter_b":"Uh you don't feel safe here? GO BACK!","commenter_a":"And salon will say that the US military threatened this poor muslim and made him feel unsafe.","post_message":"The Huffington Post Says It's a \"Mystery\" Why Kuwaiti-Born Practicing Muslim Mohammad Youssef Abdulazeez Murdered 4 U.S. Marines During Ramadan."},{"comment_id":"10152882725317807","commenter_b":"More trolling stupidity. Shuster, you are pitiful.","commenter_a":"Does this give you pause @username??????@webpagelink","post_message":"It’s tax day, but the American people certainly don’t need another reminder that the federal government is taking too much of their money.    In what ways do you believe government is over taxing you?"},{"comment_id":"10155599498156002","commenter_b":"@username illegal aliens can't collect welfare...good God, woman....read....","commenter_a":"If they are illegal they need to go ! Immigrants are welcome legally!! NOT Illegally ! Why is this so hard for people to understand this!","post_message":"BREAKING: Trump administration considers mobilizing as many as 100,000 National Guard troops to round up unauthorized immigrants.  UPDATE: White House and Dept. of Homeland Security deny AP report on draft memo for Nat'l Guard deployment for immigration round-ups."},{"comment_id":"636847006505878","commenter_b":"who said she was a lady","commenter_a":"She is by far the worst First Lady of all time.","post_message":"What Michelle just said is one of the dumbest things we've ever heard.  This is just absurd. Michelle is moronic and un-American.  Is Michelle the worst First Lady of all time?"},{"comment_id":"10155057898721729","commenter_b":"You can't make this crazy stuff up","commenter_a":"So they want equality. They get it but its not the equality they wanted because gasp! The police officers do their jobs. So the black police officers are not REALLY black because they are doing the jobs that the black population wanted them to do (and represent the black community) but didnt expect them to do the job as it is supposed to be done. Eeek! My head is spinning.","post_message":"How's this for a racist stereotype?"},{"comment_id":"834253316765245","commenter_b":"Send her back where she came from","commenter_a":"Put her in jail","post_message":"This is as low as it gets.  She is a traitor.   What do you think her punishment should be?"},{"comment_id":"502464629957050","commenter_b":"NOOOOOOOOOOOO GO HOME WHERE YOU RUINED YOUR OWN COUNTRY","commenter_a":"If they are offended by the anthem of the country they chose to live in....the country that is giving them the right to spew their BS....the country that provides their safety and many welfare services....then I guess they can just GTFO.......","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B?"}]
