[{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"1782160282048254","commenter_b":"She needs to her big ass and I'll out of the country.oh I'm probably on the hit list now.","commenter_a":"guess time will tell....when he wins it will be interesting to see how some of these people deal with all they've said and done. i wonder if hillary is getting packed to leave the country on the 9th. i heard she's transferred big bucks out of the foundation to another country just in case!!!!! her plans for the white house will be plans for the big house when she looses!","post_message":"Karl Rove says there is no way Trump can win the election because of 'the campaign he's running'. Do you think he is right?"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"10153397291788984","commenter_b":"Couldn't agree more.","commenter_a":"Great message...lousy article.","post_message":"Famous actor Matthew McConaughey just spoke at a graduation, and he had a very blunt message for whiny college kids...  What he said is going viral... and it couldn't be any more perfect."},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10153910090484160","commenter_b":"We need to ban this evil witch!!!","commenter_a":"Ban cars. Cars kill people. Drivers carry insurance. It is a business that determines risk and the policy cost reflects that. Require gun owners to have insurance rather than taking them away, unless, of course, you really are trying to disarm the American people.","post_message":"\"Terrorists and dangerous individuals are using guns to kill Americans. We should make it a lot harder for them to do that.\"  Hillary Clinton"}]
