[{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"1163050380483299","commenter_b":"@username, I'm quite happy with my wife of 33 years, but thanks for the suggestion.","commenter_a":"Honestly, I don't know anyone who wears Ivanka trump's clothing. This is the risk you run when you become part of the political process.","post_message":"A recent survey found that 57% of women refuse to buy Ivanka Trump branded merchandise following her father's controversial campaign."},{"comment_id":"952645251457544","commenter_b":"I would kick they asses!!!","commenter_a":"Somebody goin down tuh-dey d'ere boy! This is a sign that everybody is not equipped to run a daycare. Idiots!!!","post_message":"Cornelius Jones went to pick up his one-year-old daughter, Journee, from daycare... only to find the facility closed. After hearing his daughter’s cries, he flagged down police who found the young one crying & crawling in the dark.   Employees said they thought Journee was a doll. DETAILS ----> @webpagelink"},{"comment_id":"10154704030031323","commenter_b":"@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"\"Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.\""},{"comment_id":"1223870594319795","commenter_b":"What if he might win this time","commenter_a":"I honestly feel if Bernie and Jill teamed up they could win and the world would definitely be a better place. This needs to happen badly!","post_message":"Here's the Guardian article everyone is asking about.  Please read my clarifying statement about our offer to Bernie Sanders: @webpagelink"}]
