[{"comment_id":"696088307225578","commenter_b":"So because this woman stooped so low as to call Obama a name in public all of you are doing the same thing. You're not any different than she is.","commenter_a":"Unbelievable.............speechless","post_message":"Apparently, saying something really racist will only get you fired for a little while."},{"comment_id":"10153362253533132","commenter_b":"Please dont let her walk free like Casey Anthony is walking free. If she wants to kill herself let her. She is not a mother. A mother doesnt kill her children AND take pictures of it!!","commenter_a":"Leah Stevens","post_message":"In the arrest report, detectives reported finding an open journal with an entry addressed \"To My Family.\" According to authorities, Jessica McCarty apologized for what she was about to do."},{"comment_id":"10154003948143812","commenter_b":"I know it's late but does anyone have her address?","commenter_a":"Thanks to all that helped i know she was happy","post_message":"8-year-old girl who survived a fire that killed her family receives more than 700,000 Christmas cards from around the globe. \"It really moved a whole community.\""},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."},{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."},{"comment_id":"10153742314476336","commenter_b":"The woman sounds like a idiot.","commenter_a":"How can they say women's clothes?? I though we didn't have gender clothing anymore??","post_message":"Do you think this mom went too far?"},{"comment_id":"10154439047219342","commenter_b":"I will reject him too He doesn't fit the norm","commenter_a":"@username isnt he the cutest thing ever??? 😍 Hes a model now! I love it!","post_message":"Remember little Asher Nash?   He's the 15-month-old with Down Syndrome who was rejected by a talent agency.  After thousands of people rallied behind him, here is his new ad campaign and it will melt your heart!"}]
