[{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."},{"comment_id":"10154732031694411","commenter_b":"Well you said yourself 'you feel sorry fkr iranians lving in primitive conditions ' and i drew a comparison with Saudi Arabia just to show you its worse there but you won't see that on your tv because saudi arabia is an ally of the west so western media will cover them up... the same iranians you said are living in primitive conditions, make cars, fighter jets, warships, commercial ships, helicopters and are very independent meanwhile saudi arabia doesnt even make a pen so whats primitive to you?","commenter_a":"Good to hear.. Iran and Italy are ties in a relationship against the Israeli brutalities. (Y) it seems that Iran is going to change her policy. Undoubtedly Iran is at right path..","post_message":"'Unprecedented': Maneuvers come despite several controversial incidents involving US warships in the same area"},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"458263531022194","commenter_b":"I sure don't consider Ann Coulter a Patriot! She is a vile and hate spewing!","commenter_a":"What an ass!","post_message":"Even for Coulter this is outrageous."},{"comment_id":"10153000542416336","commenter_b":"tHE aTHEIS GROUP NEEDS TO STOP MAKING TROUBLE. IF THEY DON'T LIKE ANGELS ON THE MEMORIAL MOVE ON WE SURE DON;T WANT YOU.","commenter_a":"What about a Christians First Amendment rights?????? I am so sick of all this...","post_message":"An atheist group wants angels removed from a teacher's memorial, claiming its presence on public grounds violates the First Amendment."},{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."}]
