[{"comment_id":"10153903712141051","commenter_b":"Your a bitch !!'","commenter_a":"Black lives matter??????? Nop!","post_message":"You read that right: this man raped not only his 82-year-old grandmother but also his uncle. She had just one question for him."},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....\""},{"comment_id":"509824199177535","commenter_b":"^ Then stop posting your shit on our news, we honestly couldn't give a fuck about you dumb cunt Americans. Continue shooting each other, I need more wanking material.","commenter_a":"\"More guns!\" -Americans","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."},{"comment_id":"10152811499753525","commenter_b":"Evil little monster! How would you ever trust her again!!","commenter_a":"as she should be charged.","post_message":"A Colorado mother says she smelled something different in her drinks on two occasions. She confronted her daughter about it. Now, a young girl is charged with attempted murder.   READ: @webpagelink"},{"comment_id":"10154563993751336","commenter_b":"No illegals. Period. No other country puts up with this crap. Not even Mexico. No more paying Welfare, etc., for these people. They break our laws and then steal from us. Those of us that actually pay federal taxes are sick and tired of working so they can have Free Medical, welfare, EBT cards, educate THEIR children, Welfare..Etc., Out they go. Deport them and build the wall.","commenter_a":"I'm all for Trump winning this upcoming election, but building the wall is a joke, and thinking he can make Mexico pay for it is a bigger one. Wall or not you're going to have illegals come in.","post_message":"\"[Donald J. Trump] has stuck to his guns on the idea that we're going to have a border, we're going to enforce the border.\"  Gov. Mike Huckabee joined Howard Kurtz on \"MediaBuzz\" today to react to the GOP presidential nominee \"softening\" his tone on immigration. @webpagelink"},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."}]
