[{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."},{"comment_id":"10152908663462434","commenter_b":"And he testified she was having a good time. Three sides to every story- his, hers and the truth","commenter_a":"Everyone acts like this is an isolated case. Boys pressure girls into having sex every day.","post_message":"In interviews with police, Labrie denied raping the 15-year-old, saying he’d put on a condom for what was supposed to be a consensual encounter before experiencing a “divine inspiration,” as he put it, and leaving the room. In testimony, he said the hook-up was consensual, and that having penetrative sex with the girl “wouldn’t have been a good move for me.”"},{"comment_id":"10156133513175389","commenter_b":"No!!!!! They want to change our culture to theirs, we shouldn't allow that!","commenter_a":"We should allow Christians in.","post_message":"Question of the Day: Do you think America should be taking in refugees from the Middle East?"},{"comment_id":"10153440852086051","commenter_b":"@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"1255092294541839","commenter_b":"He could be doing Mexico a favour by building this wall. Just think of how many tourists will flock to see this Great Wall of Mexico. Just like in China with their wall it could be worth millions of dollars every year to the Mexican economy. Also if he thinks that building this wall will stop people crossing the border into America every year from Mexico he's deluded what's he gonna do build it sky high to stop them coming in by air or build it around the coast to stop them coming in by sea and check every single shipping container coming into the country to make sure they aren't hiding inside or close off the border with Canada to make sure they haven't flown north first and are then coming in from the North. Get real people. This guy is deluded and the people who believe him are ...","commenter_a":"WTF !!!","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"}]
