[{"comment_id":"1082049255206943","commenter_b":"\"Claim to be Muslim\"??? Muslims marry 6 year old girls! Muslims think that women are 2nd class citizens! Muslims believe that women shouldn't be allowed to drive or leave the house alone! Muslims believe that the punishment for being gay is DEATH! Their culture and our culture can't coexist peacefully! Is there some part of that that you can't understand?!?!?!?","commenter_a":"It reminds me of Sodom and Gomorrah. The whole group would not allow the police to get to the BOY...What the fuck is wrong with these sick Bastards, that claim to be Muslim? Raping of young boys and girls is okay? I ned to re-read the Koran...","post_message":"Some of Obama's Muslim \"refugees\" were raping a 10-year-old boy when the cops were called.  The police arrived, but what they did once they got there has left the country furious.  It's time America learned the WHOLE truth..."},{"comment_id":"895578827165435","commenter_b":"nothing ever happens to her for her lies!!!!","commenter_a":"Keep digging, @username.","post_message":"As the Speaker notes— Having finally heard from Secretary Clinton yesterday, we are left with more questions than answers. These public records at issue are broader than Libya and broader than Benghazi. The Secretary of State has enormous responsibility and jurisdiction and the public, the media and Congress have a legal right to access these public records without impediment."},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"10153001751980950","commenter_b":"Sarah, please elaborate. Because you've lost me completely.","commenter_a":"Hahahhaha so crazy.... Muslims are peaceful people ..its TERRORIST who are the killers.... And if ya haven't noticed there are white people in ISIS","post_message":"The gun shop owner says he's making changes immediately to \"make America a safer place to live.\""},{"comment_id":"10154985023891192","commenter_b":"Because life on Earth is the only life we can observe and study, so it makes sense to look for other life within the scope of life as we know it. How could we even begin to look for other forms of life if we don't have a clue what to look for?","commenter_a":"I really don't understand the definition of \"alien life\" and why scientists think the environment needs to be remotely similar to ours to support \"life\". HUMANS need the right temperature and water.... \"aliens\" may not....??!","post_message":"BREAKING"},{"comment_id":"1204773886285528","commenter_b":"Stridency is an anti-female word. Women are supposed to be quiet; it they are not, they are \"strident\". What you mean is they are being impolite by interrupting. I agree with that. Nicolle Wallace should think twice before she goes up against Rachel; however, that's what she is being paid to do.","commenter_a":"The stridency of the women on the panel, Rachel Maddow and Nicolle Wallace, that they use to interrupt each other and Eugene Robinson (they rarely allow him to finish a sentence) continues to be an annoying distraction to what could be a very useful and informative conversation.","post_message":"Follow our live blog for the latest updates! #Decision2016"},{"comment_id":"10156625299625354","commenter_b":"Give that girl a cigar!","commenter_a":"Oh, look everyone! It's another one of Obama's useful white idiots. She's never held a job in the real world. She's one of those who teaches, because she cannot do, and that's a trend that needs to come to a screeching halt worldwide. Meanwhile, the Muslim in Chief can use the foul mouthed, petulant child to help further his agenda of U.S. Islamization, because using dummies as incidious devices is what radical Islamists do best","post_message":"Liberal Values on grand display..."}]
