[{"comment_id":"654971807960745","commenter_b":"Fake fugly whore.","commenter_a":"can she get her face redone?","post_message":"This woman wears a corset for 23 hours a day. She has also had 4 breast enhancements, a gastric bypass, and two nose jobs. She says she finally has the most perfect body in the world.   Do you think she has a perfect body?"},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"10152943913476051","commenter_b":"Laura Mae Floering go break a hip old saggy tits","commenter_a":"We can't have white history month United white college fund White entertainment television White colleges That would be racist right?","post_message":"When a deli owner posted this sign on the front of his business, he didn’t think it would be that big of a deal. Well, it was. Now he's dealing with the consequences."},{"comment_id":"10154051432298445","commenter_b":"Listen you little bitch ur just mad because","commenter_a":"Come on they just want to get paid like everyone else....shut the fuck up and give them their chop...before you end up paying an arm and a leg for mr.college degree but cant find a job in the field i studied for...to show up and try to charge u 30% of ur crop this is America only place they have buffets js","post_message":"#TBT to 2015. \"trimmigrants.\" had trouble finding work, created tension after arriving in Humboldt expecting trim jobs.   Humboldt friends - has the atmosphere changed?"},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."}]
