[{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."},{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"706978382784196","commenter_b":"MAKE AMERICA AMERICA AGAIN!!!!!!","commenter_a":"Come on Bill, let us hear the speakers, please.....","post_message":"Duck Dynasty on A&E's Willie Robertson, former Texas Governor Rick Perry, retired U.S. Navy SEAL Marcus Luttrell, actor Scott Baio and Patricia Smith, mother of Benghazi victim Sean Smith, speak at the Republican National Convention."},{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."}]
