[{"comment_id":"663841097139802","commenter_b":"F the immigrants, it is Thanksgiving, you Effing Retard. Welcome to America, we are Americans.","commenter_a":"fuck him","post_message":"The Obama administration is trying to ruin your thanksgiving.  This is absurd. We can't let him get away with this.  Will you still call it Thanksgiving no matter what?"},{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"\"Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?\" – Sean Hannity"},{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"844826018983911","commenter_b":"Not even close Alex... Talk about a swing and miss.","commenter_a":"Unconstitutional. Pass it all you want. Taxing something that's a Constitutional right represents an undue burden (exactly what the tax is intended to do).","post_message":"It all makes sense now....THIS is how they're going to stop people from getting guns. They don't need a ban at all..."},{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"10153257305683445","commenter_b":"The irony in your statement, it's because of the illegal immigrants that America discovered weed","commenter_a":"So what if be had 'pounds' across state lines..!? Life for sh*t like that when, let's see, all the illegal immigrants get to roam free and even if they do get busted they will never see life behind bars..! Our drug laws for marijuana need to change.","post_message":"HUGE News! Marijuana Lifer Jeff Mizanskey Gets Parole."},{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."}]
