[{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"10152936707532377","commenter_b":"She is a moron","commenter_a":"Nothing","post_message":"What's the Difference Between Democrat, Socialist?"},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."},{"comment_id":"374997102688584","commenter_b":"she broke the law driving illegal you an i would be locked up so give her 30 days an feed her the same as they feed everybody else might make her see the light or get the hell out","commenter_a":"Tuff shit!! Take it off!","post_message":"Should head scarfs be banned in America?"},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."}]
