[{"comment_id":"885087015015208","commenter_b":"She needs to move on and except defeat u fucking scumbag criminal","commenter_a":"Yes","post_message":"What a sore loser. She needs to come grips with reality. Are you glad Hillary is not going to be our president?"},{"comment_id":"10154167208567235","commenter_b":"@username pull the covers over your head !","commenter_a":"An apology? Are you kidding? How about publicly embarrassing the asshole who singled this man out? \"Land of the free\" my ass. More like \"police state of fear\". This is disgusting. What stereotyping trash people have become.","post_message":"“She kept staring at me and I didn’t know what was wrong,” he explained. “Then I realized what was happening and I just was thinking ‘I hope she’s not reporting me.’”"},{"comment_id":"10152771532479342","commenter_b":"His other girlfriend","commenter_a":"Who do you think he's talking to on the phone.... his wife....","post_message":"The game is tied in the fourth quarter and you're not even paying enough attention to realize you and your girlfriend are on the kiss cam?   There are many things wrong with this sports \"fan,\" and he gets what's coming to him.    SEE VIDEO --> @webpagelink/  What do you think -- real or staged?"},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"},{"comment_id":"10152763206590950","commenter_b":"I guess she thinks shes all that.....but no!!!!!","commenter_a":"I do not care that the towing company is predatory, this cashier just works there and does not own the company. Try yelling at the cashier at Walmart or some other heinous company because you hate the company or corporation, same thing. Misplaced and misdirected hate is never productive and just shows your true character :(","post_message":"A pretty television personality opened up her mouth and showed a lot of ugliness in a video that went viral this week. Washington D.C. reporter Britt McHenry was caught on camera giving the business to an impound clerk while retrieving her towed car. Now the people on the other end of her tirade are responding."},{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."}]
