[{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"},{"comment_id":"1134766366641566","commenter_b":"nasty ass niggas","commenter_a":"Only if they cut it up for me @username @username","post_message":"Would you? #WSHH"},{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"10154294683907061","commenter_b":"Wow what a brilliant idea. Lets a build a wall to keep ILLEGAL people out! Sounds logical to me.","commenter_a":"We already have about 700 miles of border walls and fences. Maybe we should try actually enforcing our immigration laws before we go out and spend money we don't have on walls and fences that don't work.","post_message":"WATCH: President Donald Trump promises to \"build the wall;\" will take action on immigration this afternoon: @webpagelink"},{"comment_id":"10155050454914469","commenter_b":"White girl wasted","commenter_a":"I'm chocolate wasted","post_message":"BABY GIRAFFE WATCH: We are waiting for April to have her calf! Will it happen today? bit.ly/2l14Zin (Video via Animal Adventure Park)"},{"comment_id":"1637686876527430","commenter_b":"I don't rbecall we doing this Obama some needs to stop this it is un-American to do this not happy leave the country that has let you make millions of dollar from the same people you bash we are sick of all this go cry to Hillary or better sit on her husband lap","commenter_a":"How stupid can they get? Pathetic!!","post_message":"Some celebrities will show up to Trump's inauguration....to protest."}]
