[{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"1684672748486504","commenter_b":"Just what is with these piece of shit that will videotape it and allow this to happen without breaking it up. They see a child standing there and they continue to videotape and not stop this fight. They are just as sick as the women that are fighting.","commenter_a":"Lowest of the lowest ignorant white trash. Why can't these fools go back and at least get a third grade education?","post_message":"WHAT!?   I can't believe what I just witnessed..."},{"comment_id":"10154157874771130","commenter_b":"@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"10154995182613812","commenter_b":"All the liberal whiners calling racist. Typical","commenter_a":"its a trump or Hilary is American citizens decision no other nation have right to comment any thing about it...stop spreading hate","post_message":"On Wednesday morning the world will wake up to a new American president. Here's what news outlets across the globe are saying."},{"comment_id":"10154872951699445","commenter_b":"She's a nut","commenter_a":"no, I would like to see Elizabeth Warren","post_message":"Would you like to see Vice President Joe Biden make a run for president in 2020? @webpagelink"},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"1012561098824705","commenter_b":"The fact that this slut could possibly be our First Lady is a very important issue to me,","commenter_a":"Really people, this is what you talk about when there are real issues affecting people in the US. Shame on you. Is this what we have become as a nation?","post_message":"Conservative hypocrisy knows no bounds."}]
