[{"comment_id":"913998228643418","commenter_b":"As if inflation isn't a tax increase unto itself. Total money grubbers...","commenter_a":"The present gas tax money, originally intended to maintain or build our roads is not being used exclusively for that purpose. If it was we'd know exactly how much money we need to do this job","post_message":"The nation’s gas tax will be raised to 30 cents per gallon and increase at pace with inflation if a bipartisan group of House lawmakers get their way in seeking funding for a new transportation bill. @webpagelink"},{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"},{"comment_id":"122183888495014","commenter_b":"@username....lmao white ppl","commenter_a":"Holy shit lmfao","post_message":"How To Find A Masculine Halloween Costume For Your Effeminate Son"},{"comment_id":"10152964297833445","commenter_b":"what we dont want is a bullshit feminist agenda","commenter_a":"oh fuck off dont invade weed with your feminist bullshit","post_message":"Women Aim to Avoid Glass Ceiling in Marijuana Industry Before It Forms.   @webpagelink"},{"comment_id":"10153731050907464","commenter_b":"@username THEY'RE A LOT OF SICK TEABILLIES!!","commenter_a":"You referred to the Colorado Springs shooter who killed 3 people as a \"transgendered leftist activist\". Since when does a \"leftist\" spread anti-Obama propaganda and refer to fetal tissue as \"baby body parts\" as you and your ilk do? You are a disgrace for spreading even MORE rhetoric and you are unfit to be president.","post_message":"An impression from my favorite movie? As you wish..."},{"comment_id":"966104673465761","commenter_b":"Islam. Definitely will Dominate. ....... Hell of Course","commenter_a":"So America here is the hope and change policy everyone voted for. And the new world order. Question. When are we as voting and tax paying Americans going to say enough is enough. These punks can speak bad about God and Jesus. But God forbid if you speak bad about a child molesting prophet like mohmed. Or that false god like allah. Islam is a belief base and history and likes. We all know that Mohamed made promise to entice the people to fight lIke animals by promising them virgins. Where in the middle east are you going to find a virgin. All the goats are taken. Our courts need to grow a spine.","post_message":"Is Obama Trying to Establish Islam as our State Religion?"},{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."}]
