[{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"920220598016177","commenter_b":"This is bull crap. The people who were slaves and all of their children are dead and gone. The country should have done more back in the 1860's and 1870's. That is when reparations should have been.","commenter_a":"Someone send this pandering jack wagon home please. He has done nothing but side with hate and strife, and stir the pot of social discord continually. Not a leader by any standard. Socialist poster child at best.","post_message":"What do you think of this?"},{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."},{"comment_id":"1233979523321475","commenter_b":"@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"},{"comment_id":"10152967718236545","commenter_b":"White male driving.","commenter_a":"He's going 5 miles an hour. 1 car go in front and the rest block him in. This isn't rocket science. I don't think this is that news worthy. Just let us know what happens when it's over. #annoyed","post_message":"UPDATE: From Fort Worth police: Citizens, for your safety, please do not stop to take pictures, stay in your vehicle.  You may want to avoid east bound I-30 in Fort Worth for a while. Traffic is backed up for miles as police are still in a low speed pursuit of a vehicle.   WATCH LIVE: @webpagelink"},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"\"Will you go out and pick the strawberries?\"  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"}]
