[{"comment_id":"10154028098571336","commenter_b":"Yeah whatever, clueless lady.","commenter_a":"Oh come on....Carson, a very good man, has hardly run much of a campaign. If your campaign can't get traction, it's not someone else's fault!","post_message":"\"A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the Obama administration?\"  Dr. Ben Carson slammed Ted Cruz's campaign over allegations they told Iowa caucus-goers Carson was planning to leave the race."},{"comment_id":"367420580112903","commenter_b":"Rot in Hell B#$%H !","commenter_a":"Good for him !!!!","post_message":"INSTANT Justice: Judge: \"I Hope You Die in Prison!\"  Watch the video!"},{"comment_id":"10156257244825725","commenter_b":"\"Multiple woman.\"","commenter_a":"Is that dan blizerian","post_message":"A man is accused of secretly recording himself having sex with multiple woman. One who was informed that she had been recorded didn't even know a sexual encounter had occurred ----> @webpagelink"},{"comment_id":"10154664447603145","commenter_b":"Then LEAVE MY COUNRTY !!!","commenter_a":"Mr. Trump isn my president. I don mean it emotionally; I mean it literally. It not sloganeering; it observable truth. Mr. Trump has no intention of representing me, my family, the people I care about, or the majority of Americans, from the imperiled to the comfortable. It is a stretch to call him anyone president but his own. -Lindy West","post_message":"Every president since 1976 has released his tax returns."},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"10153061445106167","commenter_b":"Kirsten Miller - ironic that you have a rainbow avatar while desperately trying to appease muslim terrorists. now go put on your burka and be quiet.","commenter_a":"Oh so now it's America's fault a Muslim shot and killed our members of our military. And liberals are once again showing there true colors. Anyone who buys this garbage is the problem.","post_message":"Why does the media ignore how violence is now a part of American culture?"},{"comment_id":"10154203374126077","commenter_b":"Anita Mondragon I called 7 news, they immediately started investigating. Then once they had the tip everyone else ran with it.","commenter_a":"Oh so now 9 news wants to cover this. Tried to get ahold you guys and nothing. Guess now you'll pay attention when people try to get a hold of this station on news.","post_message":"Westminster Police believe 31-year-old Jarred Strenge killed a woman in her 30s last night. Anyone with information about his whereabouts is asked to call Crime Stoppers at 720-913-STOP."}]
