[{"comment_id":"1581842645443556","commenter_b":"@username We saw that guy with the brains.Did you?","commenter_a":"\"i need all the white people to move to the back\" that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10153666209640399","commenter_b":"Fire her!","commenter_a":"I've always liked Debbie, and had a lot of respect for her, but if this thing has legs, it could spell big trouble. There is enough dishonesty in Republican Ranks, we don't need any in Progressive Ranks. We all need to watch this carefully.","post_message":"Debbie Wasserman Schultz said the DNC needed to suspend access until they can be sure that the information hasn't been \"manipulated.\""},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."},{"comment_id":"10154260914771130","commenter_b":"@username and she's gonna tell her fake mom too!","commenter_a":"@username and @username this reminds me of some of our students.","post_message":"Boy, bye. 👋"},{"comment_id":"10153879434881337","commenter_b":"and fuck u bitch","commenter_a":"FUCK OBAMA!!!!!!!","post_message":"PRESIDENTIAL APPROVAL: Kendrick Lamar keeps it short and sweet with his reaction to Barack Obama's \"song of the year\" praise..."},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."}]
