[{"comment_id":"10156058811190594","commenter_b":"Well maybe he tried to grab on one of their chicks or tried to take some out of pocket cheap swing prior to the film rolling. What does your sister's job have to do with the surrounding facts?","commenter_a":"I'd like to know the surrounding circumstances before passing judgment. Who knows maybe the Vikings fan said or did something to provoke the attack.","post_message":"Brutal fan brawl horrifies onlookers after 49ers game"},{"comment_id":"10153917581018010","commenter_b":"Humans. When will humans realize that we are the most dangerous species.","commenter_a":"Pit bulls. When will humanity accept that this breed of dogs is classified amongst the most dangerous in the world? Hence why they are mostly bred for illegal dog fights","post_message":"A woman's 3 pitbulls mauled to death her 9-year-old brother."},{"comment_id":"1781336095483197","commenter_b":"She is so darn crooked!","commenter_a":"OMG!!! How terrible......the next thing you know he'll be selling uranium to the Russians, or discussing Top Secret programs on his personal e-mail...or selling influence to the moslems.....","post_message":"Trump has also praised Vladimir Putin, Kim Jong Un, and Benito Mussolini."},{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"\"It’s not Mexicans necessarily. They’re coming from all over.\"  2016 GOP presidential candidate Donald J. Trump talked about \"killers\" and \"rapists\" again..."}]
