[{"comment_id":"494909614001888","commenter_b":"That's it Chris we're all fucked - fucking wall climbing alligators!!!!!!!","commenter_a":"Abraham Guimaraes","post_message":"Nope. Not photoshopped."},{"comment_id":"10154043523939203","commenter_b":"Mr Pope! Tear down that wall!","commenter_a":"If somone keeps coming on my porch and coming in through my door and rapes and kills, at some point I am going to lock the door!","post_message":" person who thinks only about building walls, wherever they may be, and not of building bridges, is not Christian.\""},{"comment_id":"731399806958628","commenter_b":"SUSIE ROTTEN CROTCH...and NASTY ASS LITTLE BILLY...Mommy needs a ass beating by daddy. Because you know it is the nutty woman who thought up the bullshit.","commenter_a":"IF LITTLE SUSIE ROTTEN CROTCH AND NASTY ASS LITTLE BILLY DOES NOT HAVE THEIR SHOTS...DO NOT TREAT THEM OR LET THEM IN PUBLIC SCHOOLS....PERIOD.","post_message":"More docs are refusing to see families that don't vaccinate."},{"comment_id":"10153085331829205","commenter_b":"she would","commenter_a":"He needs to be charged with AT LEAST manslaughter... she w","post_message":"New Sandy Bland Dash Cam Footage Released"},{"comment_id":"10153517502611770","commenter_b":"She should give all her money away","commenter_a":"What an idiot","post_message":"You can't make this stuff up, folks."},{"comment_id":"10153472228230090","commenter_b":"And yes, all illegals should be deported...","commenter_a":"And yet the solutions you promise don't see the light of day. Mitch McConnell and John Boehner aren't living up to their promises, either, and they refuse to fight the Democrats, so what is the difference? There are only a few Republicans currently worthy of the name, everyone else is just Democrat Lite.","post_message":"They'd rather kick the can down the road.  Democrats in two words...No. Solutions.   SHARE if you agree."},{"comment_id":"10153812435979218","commenter_b":"Watch out these Fkn MUSLIMS WILL BURN THEY'RE WAY INTO TOWN!!!?? MAKW EVERYONE LEAVE!?? GOOD JOB SHO EVER LET THE BLOCK GET BUSTED !!!?? I'D LOVE TO KNOW HOW MUCH INSURANCE WAS ON IT!! POOR DAMM FIRE FIGHTERS FIGHTING FOR NOTHING!!! GOD BLESS THE AMERICANS. UNITED WE STAND!!??","commenter_a":"Yeah arson. Hmmm.","post_message":"UPDATE: More photos from SkyTeam 11 of a large fire that has engulfed the old Milford Mill Swim Club >> @webpagelink"}]
