[{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."},{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":""},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"10155900570730354","commenter_b":"IRAN PUT OUT A MESSAGE TODAY SAYING \"DEATH TO AMERICANS\". THAT WAS TODAY FOLKS TODAY....OBAMA IS THE WORST MAN IN THE HISTORY OF THE WORLD. HE WILL HAVE PAY FOR WHAT HE IS DOING TO THIS COUNTRY. IT WONT BE TOMORROW BUT IT WILL HAPPEN. KARMA IS A BITCH.","commenter_a":"AND IS ANYBODY REALLY SURPRISED OR SHOCKED THAT OBAMA LIED? THAT'S WHAT HE DOES BEST.","post_message":"See the updated language comparison... this just keeps getting more PATHETIC:"},{"comment_id":"1015432805157138","commenter_b":"Oh give me a break!! Rape is on a whole other level!!","commenter_a":"This is ridiculous!! He is a legend in the wrestling world. They are letting him go over something that was said 3yrs ago?!!! Shame on WWE!!","post_message":"Reportedly for racist remarks made in 2012"},{"comment_id":"10152889547313299","commenter_b":"I thought I could not dislike this so called woman any more than I do, but, taking a disabled parking spot is outrageous!!! Did she get a fine? Everyone else would have. Do you really want to see this self-centered, rule breaking murderer as president???","commenter_a":"Hilliary is entitled to be queen and all the common people are her court. she can be charming but she's Danger with a capital Dl . she is deceptive with a capital D and isn't that strange Democrats. Is a capital D too","post_message":"Hillary Parks in Handicap Spot ... @webpagelink"}]
