[{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason.  These two are monsters. Let's lock them up and throw away the key.  Do you agree these thugs should do life?"},{"comment_id":"953797061420139","commenter_b":"@username hahaha","commenter_a":"And this witness is just as big a piece of shit, like the article ends with. Haha you cats are seriously not right. Good luck in the big scary liberal future. It's called progress get on board or get left behind.","post_message":"HERE WE GO.............."},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"10153662758062894","commenter_b":"Naw mama had let that warning out that she addresses her child my bad young lady again she gon catch that fade","commenter_a":"But skai read her so no need for mama to even say anything","post_message":"Not My Child! Skai Jackson’s Mother Has Words for Azealia Banks: ‘I Don’t Play Those Games’ [Photo]"},{"comment_id":"10153057363191028","commenter_b":"Bhahaha!!! A ccw in San Fran ? Does a unicorn issue those?","commenter_a":"I am sure that the thugs guns were a registered and they all had concealed carry permits with proper background checks done.","post_message":"The brazen attack occurred just before 6 a.m. at Pier 14 in San Francisco, where the reporter and photographer – along with several other news stations – were covering a story.   \"I thought I was going to hear a click,\" the photographer said afterward, meaning that he thought he was going to die. @webpagelink"},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"}]
