[{"comment_id":"598846743608854","commenter_b":"Death by hanging move to the front of the line two weeks should do","commenter_a":"It's like they are forcing you to become a racist.","post_message":"BREAKING: White Female Cop Shot By Thug Hours Before She Was To Go On Maternity Leave [VIDEO].  This is tragic, let's send our prayers.  Can we get 10,000 'LIKES' for this poor officer?"},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"},{"comment_id":"435823689939258","commenter_b":"American demand Muslim relocate back in their country!","commenter_a":"Owner's a coward. I would've enlarged the sign.","post_message":"Unacceptable..."},{"comment_id":"10153202984559726","commenter_b":"California can have all the nation's illegal aliens! Start shipping them over right now. California sucks donkey balls.","commenter_a":"Give them all the water they can drink!","post_message":"California proposes $1.2 billion MORE in benefits to illegal immigrants--including healthcare & Office of \"New Americans.\""},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."},{"comment_id":"10152617242161680","commenter_b":"@username When did DHS keep illegal aliens out ? They watch our borders watch them walk right in. DHS is a waste of taxpayers money. We have Military FBI & CIA.","commenter_a":"Republican Logic: \"We care so much about stopping illegal immigration that we're going to cut off funding to the Agency responsible for stopping illegal immigration.\" Just brilliant. Truly.","post_message":"Senate Democrats are considering a shift in strategy that could offer a resolution to a long Senate impasse over funding the Department of Homeland Security — and put more pressure on House Speaker John Boehner."},{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"}]
