[{"comment_id":"379639485727556","commenter_b":"#buildthatwall","commenter_a":"BUILD THAT FUCKING WALL & FUCK FOX & PENA NIETO!!!!","post_message":"Looks like Mexico isn't feeling that border wall!  #WSHH #Mexico #DonaldTrump #VicenteFox"},{"comment_id":"1039445359429269","commenter_b":"Ewe, she looks drugged. GHB, JEB.","commenter_a":"I hate that... its like telling you , your my pet.I be your master.","post_message":"At least the younger Bush is a little more smooth with his moves."},{"comment_id":"10154009646005695","commenter_b":"Add this to the list of reasons why #ChikFilA is so awesome","commenter_a":"That's bc CFL is a Christian company....no PB sandwiches....love it, gives u hope nation has not completely brought into 'crap on everybody while I make my millions' type of company.","post_message":"AWESOME! Volunteers delivered free sandwiches to first responders and victims of the storms."},{"comment_id":"10153132227035326","commenter_b":"great white mess","commenter_a":"White Affirmative Action.. Donald Trump- another great White Hope! Trump joins a long list of rich entitled white boys who, were it not for their daddies, handing them everything on a silver platter, would have probably ended up on public assistance. Trump represents everything that is wrong with America. He is a gaudy bully and fake gold plated braggart who has showcased his business and moral acumen through a unending series of bankruptcies and divorces. He is a racist grifter and a criminal environmental rapist. In terms of patriotism and service to country, Bush, Romney, Cheney, Trump did not serve this country that they profess to love. But none of these fake ass patriots apparently have any qualms about sending other American children into harms way. For this crowd of \"real Americans\" it's all about the Benjamins and what's in it for me. If America needs a cautionary tale as ...","post_message":""},{"comment_id":"10153191850561051","commenter_b":"Bitch","commenter_a":"Here's a perfect example of \"children aren't born racist, they are taught racism\" That woman should be ashamed of herself.","post_message":"When a mom heard what this lady was saying to her kids, she took out her phone and began recording."},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"},{"comment_id":"1269958509763867","commenter_b":"And they're all dumb white girls 😂","commenter_a":"Great President!","post_message":"This is why we are going to miss him."}]
