[{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"},{"comment_id":"1803612926545625","commenter_b":"I agree ...where they trained to beat the crap out of people because they ran....smh","commenter_a":"What they fail to mention is that even if this man was the actual perpetrator it's still inexcusable for the cops to beat him unless he was resisting. The police's job in this case is to apprehend suspects. Suspects are innocent until proven guilty and should be treated as such.","post_message":"\"I've never been cursed, physically abused, beaten and treated like a slave as I was two days ago.\" A retired corrections officer says he was assaulted by Garden City Police in a case of mistaken identity. CBS2's Carolyn Gusoff shares his story: @webpagelink"},{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"686618911486884","commenter_b":"Does this arbitrary terrorism not offend a large number of your customers, therby, justifying, really justifying firing such a dumb asshole?","commenter_a":"How much do he makes,","post_message":"This might be the worst CEO in the country and no, it’s not Papa John this time."},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued \"for the prevention of fevers and treatment of dysentery.\"  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."}]
