[{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":""},{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"10153165455697869","commenter_b":"End stupid people from breeding","commenter_a":"Amen....","post_message":""},{"comment_id":"902293323230618","commenter_b":"Please put the lying pig in prison where she belongs","commenter_a":"Isn't it ironic the Bill Clinton appointed Loretta Lynch in New York City to her appointment as federal judge there! Obama appoints Loretta Lynch to be attorney general after ever called or left! Barack Obama supports Hillary Clinton for president of the United States saying he doesn't think she did anything wrong! Loretta Lynch Meats with Bill Clinton by coincidence in Arizona Airport where they both went with private planes and just happens to be on this farm at together! After Loretta Lynch meet with Bill Clinton by chance and the Arizona taubat she requests the judge postponed releasing Hillary Clinton's emails for 200 and some days after the November election! How are you folks believe Barack Hussein Obama's administration is not totally corrupt I guess you're waiting for the Easter Bunny, Santa Claus and any other mythical person to come by your side along with the Unicorn! I guess ...","post_message":"An iconic photograph of Hillary Clinton using her BlackBerry while wearing sunglasses on a military plane prompted an official in her office to inquire about whether Clinton had been assigned a government email address...  The information came out in sworn testimony in a Judicial Watch deposition of Karin Lang, a former State Department official. Please SHARE!"},{"comment_id":"1241832409215206","commenter_b":"She is a bitch and a ugly one.","commenter_a":"back off","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"}]
