[{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."},{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."}]
