[{"comment_id":"985465168182267","commenter_b":"You don't support our troops, you don't support tradional marriage, I would think support you.","commenter_a":"Good I don't go there now.","post_message":"Starbucks CEO: If You Support Traditional Marriage, We Don Want Your Business  ttp://woundedamericanwarrior.com/starbucks-ceo-if-you-support-traditional-marriage-we-dont-want-your-business/"},{"comment_id":"1090268744329629","commenter_b":"at least all those illegals your allowing in here are getting to work.","commenter_a":"14.4 million part time jobs.","post_message":"Another positive jobs report out this morning. 215,000 private-sector jobs were added in March.  That's 73 straight months of private-sector job growth."},{"comment_id":"10154535471263812","commenter_b":"I'm a white female, and I sure as hell don't trust her","commenter_a":"\"Voters of Donald Trump are sexist idiots that rather vote for a fellow idiot than a woman\"","post_message":"Poll shows 18% of people who say they will vote for Donald J. Trump think the real estate mogul is not qualified to be president."},{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"1759728807637196","commenter_b":"Vicente Fox..You're not welcome in OUR Country!!","commenter_a":"Good then you'll get what you deserve 😉","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."}]
