[{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."},{"comment_id":"10154086020097024","commenter_b":"Build that wall","commenter_a":"Prosecute every elected official in every sanctuary city as being complicit in evey crime committed by illegal aliens.","post_message":"Happening Now: Judge Jeanine Pirro delivers remarks at #CPAC2017."},{"comment_id":"10153232858118812","commenter_b":"Lmao. Good one. People need to chill out.","commenter_a":"If you don't like gay marriage, then don't get married to a gay person.... Problem solved! Cora Newton","post_message":"Filing joint taxes isn't just for traditional married couples anymore: @webpagelink"},{"comment_id":"10156314605160354","commenter_b":"Dems care more about illegals than Americans! Vote all democrats out!","commenter_a":"Here is a list of the DEMS that blocked the vote for Kates Law and to stop Sanctuary Cities.Tweet or Facebook your Congressman or woman.","post_message":"\"With a vote of 54-45, the measure failed to obtain the 60 votes necessary to end debate.\""},{"comment_id":"868576086513962","commenter_b":"My mako 10 rounder has never feed a full magazine flawlessly","commenter_a":"I think we shouldn't have to do this, there shouldn't be a magazine restriction","post_message":"What do you think about this?"},{"comment_id":"10153378871661130","commenter_b":"@username get a life and get out of the reproductive business of women.","commenter_a":"Planned Parenthood is more than abortions and those who only focus on that are very closed minded. I support planned parenthood.","post_message":"The REAL truth."}]
