[{"comment_id":"10154055005061167","commenter_b":"Oh God! !!! really this happened! What a nasty Woman!","commenter_a":"Artistry, get a clue humans.","post_message":"Beyoncé and JAY Z appeared with Hillary Clinton -- and Fox News completely lost it."},{"comment_id":"1847137338904678","commenter_b":"Everywhere these devils go, they rape and murder the rest of the people. Just ask the Native Americans, the Aboriginies of Australia, and the countless number of African countries that still suffer from the effects of all the death and destruction caused by what the devils call imperialism and colonization. The devil who comes disguised as white people is absolutely disagreeable to live with in peace. It's been proven time and time again.","commenter_a":"Didn't take long for the racial comments on a post that has nothing to do with race. You are the people that make today's issues more of an issue than it needs to be. This man is disgusting","post_message":"SHOCKING! A sheriff's deputy is charged after he allegedly posted video of himself performing a sex act with a dog."},{"comment_id":"10158132279970153","commenter_b":"Go Israel .. squatters Go home!!!!","commenter_a":"gy","post_message":"LIVE: Amona settlement evacuation underway in West Bank  READ MORE: @webpagelink"},{"comment_id":"10152728441711051","commenter_b":"Ship her to Iraq... just sayin!","commenter_a":"Shoot the witch..","post_message":"This woman killed her baby last year. Three weeks ago, she gave birth to another one. You can probably guess why she's in jail now."},{"comment_id":"468867053307454","commenter_b":"Transgender are idiots knockem in the head throw em in a ditch.","commenter_a":"This world is filled with way too many idiots. Please EDUCATE yourself. All of a sudden this is a problem? Where do you think trans people have been going to the bathroom? But ACTUAL pedophiles who like boys is okay? Stop being hypocrites and spreading hate","post_message":"A pledge calling to boycott Target has now reached over 1 million signatures. @webpagelink"},{"comment_id":"10153526551574497","commenter_b":"Now those fuckers will manage to rename their country as \"Aaaamerica\" to undisputably top the list...","commenter_a":"Not if you use America","post_message":"Via ClickHole"},{"comment_id":"517780028410290","commenter_b":"Send them to a boot camp along with their parents, they soon will learn respect! And cut off their welfare,so tired of supporting these aminals!!!","commenter_a":"THE BOY IS A PUNK","post_message":"INSANE..."}]
