[{"comment_id":"937143676339798","commenter_b":"And deport a politician who supports closed borders for every American murderer.","commenter_a":"Excellent .","post_message":"LIKE and SHARE if you agree...  100percentfedup.com"},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"655930237930888","commenter_b":"Shut up fat ass racist bitch","commenter_a":"Yes","post_message":"Oprah goes on a ridiculous rant about why Americans 'disrespect' Obama.  Get this liberal trash of the air already.  Do you think Oprah is the racist?"},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."},{"comment_id":"1008179699229421","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"10154290589526323","commenter_b":"On bbc this morning she actually said that she wants europe, keep the pound and still have no borders with the uk!!!! This woman is nuts.....","commenter_a":"If Scotland votes to leave the UK and joins the EU then welcome to the Euro, Schengen and for Brussels to take over your resources like Banking, Oil, Fisheries and Hydro Power! You will become swallowed up and ruled with an iron fist from Brussels with orders and wrapped around a straight jacket..and have a border with England! Fancy it?","post_message":"\"If the Scottish parliament is judging this on the basis of what’s right for Scotland then the option of saying we’re not going to vote for something that’s against Scotland’s interests, that’s got to be on the table. You’re not going to vote for something that is not in Scotland’s interests.\""}]
