[{"comment_id":"10153302418660329","commenter_b":"lol","commenter_a":"I swear the only good thing from this post are all the pictures i'm stealing from the comments for future use.","post_message":"So you ~maybe~ shouldn’t do this while your wife is pregnant."},{"comment_id":"10153487298809877","commenter_b":"This is a very fine line that people are walking, it's offensive because if you think about it you are saying a woman is a ho and you don't even know why she is dressed how she is dressed. Women are the worst....if you want to wear a form fitting dress...go for it.....if not....that is good for you. Please stop.","commenter_a":"I don't understand where the problem is. That is her choice and I commend her.","post_message":"Ayesha Curry Says She's Not Into 'Barely Wearing Clothes,' Prefers to Keep it Covered Up for Husband Steph. Twitter had plenty to say about that! Read more below.  Grio fam, we say 'do you' when it comes to fashion. What's your reaction?"},{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"655169484673630","commenter_b":"Hope she is thrown in prision","commenter_a":"Yay! I really, really, really don't want her to be my Commander in Chief. EVERYTHING becomes disfunctional with someone like here at the helm.","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"10153410521706336","commenter_b":"She is so dirty.","commenter_a":"Wonder why .. lol","post_message":"New documents released by a federal court show President Barack Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack – but the contents are being withheld by the U.S. Department of State."},{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":""},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."}]
