[{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"10153180553634071","commenter_b":"ohh this one","commenter_a":"@username Teresa Oanh Hoang","post_message":"She had something much better in mind."},{"comment_id":"10153722774708984","commenter_b":"God's Son, Jesus, was sent to Earth as a baby. Grew to be a man, ministered to people healing the sick, performing miracles, teaching about God's Kingdom. Was rejected by His own Jewish people, suffered and died on a cross. Arose from the grave the 3rd day, talked and ate with His disciples, talked to 500 people before ascending into Heaven to sit at the right hand of God, and to prepare a place for us. If we accept Jesus as the Son of God, repent of our sins, God is gracious to forgive us and save us from eternal death. We will live in peace and love and joy in our eternal life. Jesus said \" I am the Way, the Truth, and the Life, and no one comes to the Father God but by Me.\" As for me, David, I KNOW He lives in my soul. Also, I ...","commenter_a":"There is a little truth in all religion so who is to say what is right or wrong but no one's have any biasness at work or in or government god is only a word that represents all religion. Leave it in your heart's and at home or where ever it is that you warship. We are all equal no matter what I don't want any of them I have my own. No one or nothing can take that from me. Try believing in that.","post_message":"Boom! Mike Huckabee just dropped one EPIC line about Hillary Clinton and Kim Davis that will have liberals absolutely livid. He is putting himself on the line big time for this county clerk, and many are joining him in it.  Do you support what Mike Huckabee is doing?"},{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"10153689557537434","commenter_b":"Always. I have a dirty job so it is necessary.","commenter_a":"Nope.","post_message":"Please take this poll so we can figure out how gross we all are."},{"comment_id":"557366464412130","commenter_b":"She's anti-woman.","commenter_a":"and, an eyesore.","post_message":"Carly Fiorina is gaining in the polls because Trump gave her his attention in a tweet. Now Republicans are claiming she supports women's rights."},{"comment_id":"10153541380362093","commenter_b":"@username obviously you think you are what you arent thats why its called a disorder im not going argue... is the sky green? is grass blue.. no... and im not going to argue that it is.... and the problem isnt so much trannies like i said its men who know what they are that are now not looked at twice for going to the womens restroom, nobody will bat an eye even if his intentions are evil...","commenter_a":"As a transgender person, I'm sorry that me having to do a natural bodily function in the bathroom that matches my gender identity affects your life so much. Get over it, we're here to stay. I was born and raised in Texas, regardless of what y'all say about us, I'll still be using the men's room.","post_message":"The founder of the movie theater believes the bathroom debate has gotten out of control and hopes his new design will make the issue a non-issue for customers... @webpagelink"}]
