[{"comment_id":"1254290281276196","commenter_b":"He prefers giving the jobs to refugees and Muslims what a POS","commenter_a":"What is he on Obama didn't do anything to create jobs","post_message":"Yesterday, news swept the nation about the amazing feat President-elect Donald Trump was able to accomplish before even taking office. Trump, along with Vice President-elect Mike Pence, forged a deal with Carrier, keeping 1,000 jobs in the US. However, not everyone is taking the news quite so well, and none other than the current president and his administration had a sickening response.  @webpagelink"},{"comment_id":"10158219481290331","commenter_b":"the regardless part won't happen. if they are illegals with serious crimes on record, they will be deported. if they're citizens of rightful and legal to stay, they won't. no matter how people try to twist the issue into a hate retoric, it is for ILLEGAL IMMIGRATION.","commenter_a":"I wish I was there to ask some students why they walked out of class and I bet half of them don't know or just want to miss class. Bet!","post_message":"Large group of students at Molina HS in Dallas ISD have walked out of class in support of today's \"Day Without Immigrants\" protests. @webpagelink"},{"comment_id":"10154568633769411","commenter_b":"@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"10153019932341323","commenter_b":"No, but look what women can do with them, much healthier than smoking.","commenter_a":"How much for the tampons?","post_message":"Only in New Orleans..."},{"comment_id":"944666172296302","commenter_b":"She's has a mental illness","commenter_a":"At this point she's coming across as delusional and totally disingenuous.","post_message":"“It means that I have really gone there with the experience in terms of being a mother with two black sons.\"  -Rachel Dolezal on being black"},{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10152705258007144","commenter_b":"How can we believe anything he says after lying so many times??..and they said Obama lies!!!! And I am one of the 47%!","commenter_a":"Dipshit: Same path doesn't equal new outcome","post_message":"Mitt Romney is quickly rebuilding his campaign network for an \"almost certain\" run."}]
