[{"comment_id":"1805298753047564","commenter_b":"I know Jim, I'm a diehard liberal, but when people like this commit these acts they prove that they are complete wastes of oxygen and need to be taken out of society. They are sociopaths and can never change. They must go for the safety of society!! Lethal injection is easy compared to what some people do to others. They actually are dying a much easier death than their victims.","commenter_a":"again everytime i think there should be no capital punishment, assholes like these come along and changes my mind","post_message":"The man had to crawl to save his wife."},{"comment_id":"10153044187631717","commenter_b":"No one wants to physically hurt her, we just want her to do her job. Such exaggeration!","commenter_a":"well they need too cuz this B*tch is Crazy!","post_message":""},{"comment_id":"888687604591297","commenter_b":"@username freedom of speach bitchhhh","commenter_a":"Yo man if you really care about the U.S.A and everyone in it there is something you should do... \\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b\\b$18,152,809,942,589 is our current debt... Donate all your money except a mil to our debt... A mil is a lot more than most of us will ever see... Your money wouldn`t even really touch our debt but still would help... If you really care help us out... It wasn`t the average Joe`s fault... It was the all politician`s fault\\b\\b\\b\\b\\b\\b\\b\\b... Help us out bro and you`ll earn my vote...","post_message":"I've created tens of thousands of jobs and I'm really good at it. As President, I WILL get America back to work! #MakeAmericaWorkAgain"},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"449954205192873","commenter_b":"\"IF YOU CAN'T FEED'EM DON'T BREED'EM! Stop breeding all these kids you expect the taxpayers to feed.","commenter_a":"A border, by definition, is a division. Do they expect us to forfeit our sovereignty ?","post_message":"They think our borders create division..."},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"838486396292823","commenter_b":"I know how is she sleeping with the light on it should be a heat lamp!!!","commenter_a":"drink :D","post_message":"Late night eaglet stream!  Thankfully baby E9, Harriet and M15 will be warmer tomorrow!  Where are you joining us from this evening? @webpagelink  Pix courtesy Southwest Florida Eagle Cam"}]
