[{"comment_id":"1732731136976178","commenter_b":"@username STFU","commenter_a":"No one will care! Liberals will vote for this criminal no matter what she does!","post_message":"New details about the investigation into Hillary's pay-to-play scheme while she was Secretary of State."},{"comment_id":"10153030782377434","commenter_b":"Thank you. However, white women wear wigs and added hair too. 95% of them in hollyweird do.","commenter_a":"I think this is significant when many African American female celebrities wear wigs that look like Caucasian hair, because of our so-called standards of beauty. I think the natural look is much more attractive and empowering for girls who look to them as role models.","post_message":"“If you say you’re beautiful without hair and makeup, then they will believe you,\" Maria Borges said of the hairstyle she walked during the Victoria's Secret Fashion Show."},{"comment_id":"962496207173455","commenter_b":"#trumpnation #teamtrump #trump #votetrump #riseup #crushpoliticalcorrectness #getourjobsback #deporttheillegals #stirupwashington #shakeupDC #BANMUSLIMS #rebelflag #no2NikkiHaleytheTraitor #merrychristmas #makeourmilitarygr8again #keepguitmoOpen","commenter_a":"Go F your self Cruz! Voting for TRUMP!","post_message":"\"The truth of the matter is if Donald Trump became president, nobody knows what the heck he would do. He doesn't know what the heck he would do,\" Ted Cruz said."},{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"1009004349187234","commenter_b":"first she needs to be a lady","commenter_a":"Watch out she will pick your pocket ...","post_message":"Michelle Obama Invites Muslim Refugee To Sit With Her At State Of The Union  She should invite a soldier who fought for our country. This is ridiculous.  Do you think Michelle Obama is the worst first lady ever?"},{"comment_id":"10152956795647093","commenter_b":"Definitely a woman","commenter_a":"She looks like she could be a man in a wig","post_message":"Arlington police would like your help finding a car burglary suspect caught on camera..."}]
