[{"comment_id":"10153654951896519","commenter_b":"@username tell that to Europe where is a hell hole for sex workers in the \"legal\" market and human trafficking of child prostitutes is at an all time high. Prostitution functions on the idea that women and their sex organs are a commodity to be bought and sold for the pleasure and consumption of men, it's dehumanization 101, how on earth could it be empowering when the average age that people start sex work is at 14?","commenter_a":"It is aginst the law yet you break it, You understand that liberals do not want you exploiting these women and yet you are hypocrite for doing so.","post_message":"\"Instead of seeking love, I sought success...\""},{"comment_id":"1805645433016457","commenter_b":"Congress stop her","commenter_a":"Hell Yes she's a racist traitor and one ugly Ass HE SHE or whatever it is.","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10154443469472293","commenter_b":"Lady you are what makes liberals look stupid.","commenter_a":"Her rapist will be the next GOP candidate for president.","post_message":"Police were called to his $5 million mansion after a 21-year-old was allegedly assaulted at his annual Halloween gathering."},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""},{"comment_id":"10153305455645329","commenter_b":"Omg","commenter_a":"Emily Bickle","post_message":"French phrase + hashtag + \"cool\" city = T-shirt."},{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"\"I don't wear a toupee. It's my hair, I swear,\" Donald J. Trump said."}]
