[{"comment_id":"941198702643049","commenter_b":"The submissive woman vote republican","commenter_a":"Amazing to me that any woman would vote Republican.","post_message":"Wendy Davis says we're going to see a \"women problem\" with the GOP's presidential candidates. Here's why:"},{"comment_id":"10153785163219411","commenter_b":"wastemans all just talks.now putin has to deal with it 😂","commenter_a":"Taliban, Isis, Hamas, Al-Qaeda, Boko Haram, Hezbollah, Al Shabab. All products of the religion of peace.","post_message":""},{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"1834629973441103","commenter_b":"Such an embarrassment to REAL Women!!!","commenter_a":"Such bullshit","post_message":"More white women voted for Donald Trump than Hillary Clinton..."},{"comment_id":"865398446828911","commenter_b":"She got what she got! Gee if you talk back to the KING media anymore you get taken down!!! Shut up Savannah!","commenter_a":"Certainly not unbiased. It's wrong, but not shocking at all that the so-called journalists have an agenda. I don't think Rand Paul was being sexist or rude at all. On the contrary, I think he was polite considering. He simply didn't let her tank-roll over him. I loved it!","post_message":"Liberal media is NO MATCH for Rand Paul!  Watch him completely DESTROY NBC host who tries to put words in his mouth!"},{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"936295619744244","commenter_b":"having a man in charge hitting his daughter then inviting others to watch will prepare her for the abuse she will subject herself to in her broken down future, all men win","commenter_a":"You can't even spank your child's butt without the school, neighbors, and everyone else screaming abuse. This subject is absurd.","post_message":"The debate between discipline and child abuse continues with this odd case."}]
