[{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"\"Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.\""},{"comment_id":"10153464811106028","commenter_b":"@username, yes, jail is vacation. You should go there when you get tired of working. Many of our jails are full of illegal immigrants waiting to be deported or just released back into society. You should really think before you open you mouth Mario. Some people are just plane dumb. To think jail or prison is a vacation. If we sent home the illegal immigrants that are currently in our jail system, we could close 20% of our jails and put that money to better use.","commenter_a":"More people would have been there but it was morning and they were sleeping. It's also not the 1st or 15th so they don't have their free government checks, so no gas to get there. I say deport them, if they are here illegally they need to go. I'm tired of paying tax for them to get a free ride. We don't even take care of our own vets as well as we take care of illegal immigrants. That's a bunch of bull.","post_message":"Immigration policy protests continued throughout the morning in downtown LA, forcing closures at Los Angeles and Main streets. Protesters in a circle at the intersection called for a stop to recent federal deportation raids: @webpagelink"},{"comment_id":"10153429350692623","commenter_b":"She would have gotten her old azz beat. Period!","commenter_a":"My question is what did these people do to provoke the volunteer? Why did they not comply with her request to leave and then they could have gone to someone else for help. I have seen people treat the volunteers like dirt- maybe this woman couldn't take it any longer. Don't judge unless you were there and saw the entire event unfold.","post_message":"Wake Forest Baptist Medical Center is responding to a disturbing incident caught on camera involving one of their volunteers."},{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"10153729892456509","commenter_b":"I'm certainly not by any mean defending China's actions but it's quite hypocritical to criticize them while America commits terrible animal crimes too. That chicken, beef, bacon, etc. are almost from animals living in poor conditions and slaughtered. It's just favoritism to defend one animal and not another. To condemn one country and not another. Like Ramapriyan says, stop trying to be the world police.","commenter_a":"Just returned from Singapore and Hong Kong. Both very awesome cities.","post_message":"Plan on visiting any of these cities this year? @webpagelink"},{"comment_id":"10153596460999486","commenter_b":"She needs to be in prison for it!!!!","commenter_a":"Funny how that works for a lying, cheating,sneaky,and generally lousy human being!!! She needs to apologize to the 4 families for their murder in Benghazi!!!","post_message":"Talk about a flip-flopper..."}]
