[{"comment_id":"10153200452766051","commenter_b":"I do not agree with celebrating Columbus day or the fact that he slaughtered the American Indians, however, I was born in this country where we speak English. I've spent 12 years in the Army proudly serving my country against all enemies foreign and domestic. I am against anyone that threatens my country not diversity - I'm against the law that enables illegal immigrants having children in this country and said children being natural citizens.","commenter_a":"It's not racist, we speak English in AMERICA, if you want to speak Spanish then go to or go back to fucking Mexico","post_message":"When this IHOP customer heard what language a fellow customer was speaking in, she snapped."},{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153328761996051","commenter_b":"Put her DUMB ASS in jail","commenter_a":"Meanwhile murders of innocent people take a backseat to this stupid ads story","post_message":"This woman vandalized the office of the dentist who killed Cecil The Lion. Here's how that worked out for her."},{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"},{"comment_id":"1638130873118424","commenter_b":"@username we have to save American lives and that means keeping Hillary Clinton out of our WH!!!","commenter_a":"Desperate - can't stop the \"Trump Train\"! It's way too late - you GOP establishment idiots are the ones who are making it possible for the democrats to get 4 more years to continue to destroy this country! Just because Mr Trump doesn't lean to the \"far\" right, doesn't mean he's not a Republican! I don't lean to the \"far\" right, but I am a Republican! It's time for some real middle of the road compromising - more real and true policies will get passed and the stagnant economy, security, and the best welfare of Americans will come to fruition! Won't buy national review ever again - especially since they have nuts like beck involved!","post_message":"As it's starting to look more like Donald Trump will be the Republican nominee, some in the conservative movement are viciously attacking the NYC businessman. Trump supporters are going to be furious when they see the cover of this magazine...  Will this attack influence who you support for president?"},{"comment_id":"1046312712073631","commenter_b":"Back in the,day, I was called a baby killer. My response to the pussy was that I was ALSO A MOTHER FKR, SO KEEP YOUR MOMMA OFF THE STREET.","commenter_a":"All those who believe in abortion so passionately, please line up on the left for your very own personal post partum abortion. Lead by example........ :-)","post_message":"Does this about sum it up?"},{"comment_id":"10154067221877464","commenter_b":"@username BUT OF COURSE YOU WOULD BRING UP CHILDREN..because you are filth. All Cruz people dumber than dirt.","commenter_a":"Keep on going Ted! The more you make Trump mad, the more likely it is you beat him.","post_message":"Read more: @webpagelink"}]
