[{"comment_id":"1604700786499928","commenter_b":"@username ..more lies more propaganda blame islam,muslims..stop your fake and baseless propaganda..by 1890 jews were 5%in palestine...after belford declaration in 1917,they stormed to palestine,by 1935 jews were 25%..1946,47 32%to38%.these zombies invaded from europe.. caucasian zombies,khazars.go back to your daddys land with your fake hasbara propaganda..","commenter_a":"Hamas regime- is the selfish terror group from gaza that committing ruthless tactics against humanity and uses his people as Human shield..Hamas keep launching terror attacks and firing thousands of rockets into Israeli towns to kill civilians. Hamas terror regime is still smuggling heavy weapons into Gaza. They are also killing and torturing Palestinian opponents and using the USA and international aid to buy weapons and build more terror tunnels, Which worth millions of dollars..","post_message":"A spokesperson for the Palestinian health ministry says 17-yo Palestinian youth injured during Sunday night's raid @webpagelink"},{"comment_id":"1025607307502400","commenter_b":"@username do you not understand what rape is? Many women are unintentionally impregnated by a RAPIST. Involuntarily having sex is what rape is, if you didn't catch that. A women's should be able to choose if she wants to have an abortion, with advanced technology we can safely perform these procedures. Abortion is NOT A contraceptive, it is a last resort and if you wanna take the baby and provide for it along with the thousands of other rape victim babies then go ahead.","commenter_a":"Look I'm not all for abortion, nor all against it, let me just say my peace like everyone else has, and that we are all entitled to.. A females choice about her body, is exactly that, her choice. I'm not saying abortion ahould be used for a form of BC or a contraception, there are other ways, educate your children, its not just the girls in this that need it. All children need to be educated. But lets get surreal, how or what do u know about that female walking in to planned parenthood, little to nothing about her story. How do u know she didn't get raped, or isn't going thru some kind of abuse (whether it be physical or emotional) u don't know. We cannot judge people, who gives another that right, and all I have to say is those doing the judging I hope to hell u ...","post_message":"Hillary's Hypocrisy is Astounding www.eaglerising.com"},{"comment_id":"1444134625606563","commenter_b":"Lay off the booze lady","commenter_a":"Michelle Obama plagiarized Saul Alinsky for her 2008 DNC speech never once attributing her words to his writings. Would seem Michelle gets a pass when it comes to plagiarism, everyone else gets bashed.","post_message":"\"I'm a speechwriter. This is what speech writers do. You're looking for something improper, I don't see it.\""},{"comment_id":"10153084847781350","commenter_b":"Cheaters","commenter_a":"Latest reports state balls were checked at halftime and found deflated. They were changed out for fully inflated ones. And...PATS won the game in second half! What else is there to say? Enough already!","post_message":"\"It's cheating, regardless of how you may want to spin it.\""},{"comment_id":"1165649100139095","commenter_b":"All he's ever done is ramble on. His supporters are just too stupid to realize it.","commenter_a":"I'm still waiting for Obama to answer the 2nd part of his question, which was, \"Why won't you light up the White House in blue\"? He just rambled on for about 5 minutes and completely dismissed the question.","post_message":"\"I'm not happy.\""},{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."}]
