[{"comment_id":"494289207428326","commenter_b":"I'm surprised the husband let her swim at all.","commenter_a":"Our Country our way of life. DON'T TREAD ON ME!!","post_message":"Two Muslim women wore their 'burkinis' to the pool and then something amazing happened.  Awesome. Muslim immigrants need to assimilate or leave.  Do you agree Muslims need to abide by our laws?"},{"comment_id":"743009682482479","commenter_b":"Our military needs to follow the example of General Pershing in 1911. Soak the bullets in swing blood, kill them, pack their cavities with sausage and bury them with a pig. This would stop the rest of them from whining. This guys is a loser from the start.","commenter_a":"Don't worry ducky, soon you will join your comrades in line waiting for your non-existing virgins. Will a couple old goats do?","post_message":"Boo-Frickin'-Hoo. You think life sucks now... @webpagelink"},{"comment_id":"764904010309446","commenter_b":"RBG.. ALL DAY NOW","commenter_a":"When it's American soil , it'll be be armed patriots push back Muslim insurgents ,,, the main steam news will not say so ,, but we the people will !","post_message":"Coming to America soon compliments of Barack Obama."},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"902571806432266","commenter_b":"THEY will be one of the 72 virgins.","commenter_a":"Its not 72 virgins they will get , its 1 -72 year old virgin, they are crazy","post_message":"You can't even imagine what is happening to thousands of children as young as 5 years old..."},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation.  It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation.  Read the whole story at Reverb Press HERE: @webpagelink"}]
