[{"comment_id":"10154284439844749","commenter_b":"Women should lift each other up? Good luck lifting her up!","commenter_a":"Beauty comes in all shapes and sizes. Women should lift each other up, not let little girls tear each other down.","post_message":"\"When I tell people I'm a model, they look at me like I've said I've murdered someone.\""},{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"854121244730702","commenter_b":"No need to fear - strong, intelligent, powerful women can purchase their own contraceptives or better yet save something special for marriage and then raise the next generation of Americans.","commenter_a":"Dumbass use your butt.Save a child from being liberal.","post_message":"Lena Dunham is absolutely terrified of Trump and his views on abortion."},{"comment_id":"646317502237529","commenter_b":"Better ban these assault tree's!","commenter_a":"I have done these cases before. There is no excuse for this type of thing to be happening if the trees are being properly inspected and cared for. There are certain types of trees that should not be in public parks because they are known to do this. God be with the family.","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"10153115763853690","commenter_b":"The fundamental pillars of many so called western democracy is to build terrorist groups to fight a government that doesn't serve their needs. But guess what, immediately these terrorist got training and weapons they starts killing their masters Americans and allies. Then the next day their X masters will come out with a BLANK SPEECH called War on Terror. Well am never gona be part of any War on terror coz I never creat any terrorist. Look at Libya; they trained and armed them and later the terrorist killed their diplomat. They trained and armed Bin Laden; we all knows what follows next. They created ISIL; that one is more than I can write. Now U are creating another dead squad in Syria so what follows next no complain please. How can u call others \"Rebels\" and others \"Good Rebels?","commenter_a":"Isn't dat supporting rebellions on another country samething they accuse Russia? ?!","post_message":"Pentagon says 400 troops & support personnel will be sent to train moderate Syrian rebels | @webpagelink"},{"comment_id":"10156702895000354","commenter_b":"Yeah, poor Oprah. She probably is forced to shop at second hand stores.","commenter_a":"Black women have black privilege","post_message":"Guess how many millions of dollars actress 25-year-old Jennifer Lawrence made in 2015...  *Hint: it's more than you will make in a lifetime--by FAR"},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."}]
