[{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."},{"comment_id":"10152653934397169","commenter_b":"A woman should never lose her chic!","commenter_a":"Go girl!","post_message":"Part of a growing trend of older fashion icons:"},{"comment_id":"10153410521706336","commenter_b":"She is so dirty.","commenter_a":"Wonder why .. lol","post_message":"New documents released by a federal court show President Barack Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack – but the contents are being withheld by the U.S. Department of State."},{"comment_id":"10153936248091336","commenter_b":"American homosexuals bring HIV into the world.Nobody condemns them but Africa has Ebola everybody condemns Africa","commenter_a":"Nothing good comes out of Africa!","post_message":"More than 2,700 babies have been born in Brazil with microcephaly this year, up from fewer than 150 in 2014."},{"comment_id":"10155107253330557","commenter_b":"White people riot","commenter_a":"Must of been a black on black murder .... No riots","post_message":"#BREAKING: 2 people in custody, another still at large in the murder of a man in Reading. Developing details in the story below and in a live report on 69 News at 5:30."},{"comment_id":"10155086794306729","commenter_b":"What did she care....that bitch was in it for the money.","commenter_a":"Pantsuit Nazi...","post_message":"Wow... Help spread the word folks!"},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."}]
