[{"comment_id":"10153117500629342","commenter_b":"#seriously what woman wants to see a man in tight shorts? #smh","commenter_a":"Jenn Nunez I will be going to Dallas soon","post_message":"The restaurant says it offers something for both girls and boys."},{"comment_id":"815781625279081","commenter_b":"this is America bitch dont like it take ur camel and ur fanatical hateful selves back to hubbabubba where the f*** u came from. i fought u over in ur backyard dont think i wont put 1 in u in mine mf","commenter_a":"Yes","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"614399705409669","commenter_b":"@username NO ONE IS AS CORRUPT AS SLICK WILLY & SLICK HILLY!","commenter_a":"If Trump has done anything he has brought attention to the corruption in government!! Old man Bush cannot stand that Baby Jeb was soiling his diaper on the debate stage....it's all about $$$$ & the fact that the Clintons charged $250,000 for their fundraiser the other night should make hard working taxpayers sick!","post_message":"Kathleen Kennedy Townsend says former Republican President George H.W. Bush told her he's voting for Hillary Clinton."},{"comment_id":"1379793182036339","commenter_b":"because her goal is selfish...not to make HIM successful...not to help America....but to HELP HERSELF....","commenter_a":"They all say they have the answer when they're campaigning. I've always wondered the same thing...why the hell don't they tell someone, then??","post_message":"Here's another question that I have: If Hillary Clinton has the answers for the economy, why doesn't she tell Obama what to do now?  Why do we have to wait until she maybe gets elected and then gets inaugurated and then starts putting her ideas into practice?  If she's got the answers, why wait?  Why doesn't she make it a point to meet with Obama, who's in the Oval Office and say, \"Barack, this is what we need to do to fix the economy\"?"},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."},{"comment_id":"10153618033509575","commenter_b":"Seriously? Have some compassion lady","commenter_a":"Dude! Buy an eye patch! Nobody wants to look at an empty socket.","post_message":"An Indianapolis veteran diagnosed with ocular melanoma has filed a tort claim against the VA.  By not ordering an MRI, he says they failed to diagnose a cancerous tumor that not only cost him his eyesight but will take his life."},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"}]
