[{"comment_id":"10154221052787869","commenter_b":"Immigrants aren't spending money with local businesses, if they aren't getting paid welfare checks. You're idea would only hurt the citizens of those cities. I agree that the federal funding needs to get cut for processing illegals, but lack of tourism would be cutting jobs, and hours for legal, working citizens that have nothing to do with it. Trust me, the working people in \"sanctuary cities\" want them gone, too.","commenter_a":"Not only should these cities lose their federal dollars, but people should not visit these cities and they will also lose their tourism dollars. Maybe they will cooperate then!","post_message":"One of Donald Trump’s most popular campaign promises was to end “sanctuary cities,” where local officials refuse to cooperate with federal immigration agencies on deportations.  This refusal to enforce the law makes these cities magnets for criminal illegal immigrants seeking to evade arrest and deportation and puts their citizens at grave risk (like Kate Steinle, the young woman allegedly shot to death in front of her family in San Francisco by an illegal immigrant who would have been in custody if local authorities hadn’t released him from jail instead of turning him over to the feds as the law required.)    Trump isn’t even in office, and already, some city leaders are having the same kind of tantrum we’re seeing from protesters in their streets.  The Democratic mayors of Chicago, New York and Los Angeles all defiantly declared that they’ll never give up their “sanctuary” policies and cooperate with federal immigration authorities.  L.A. police chief Charlie Beck also announced that his force will never work with Homeland Security to deport criminal illegal immigrants.  He said, “That is not our job, nor will I make it our job.”   Memo to these mayors and to the L.A. police chief:  As law enforcement officers, your job is enforcing laws, not protecting criminals.  If it takes cutting off your federal funds to force you to do your jobs and put your citizens’ safety first, then maybe that should be the very first cost-cutting measure President Trump takes to reduce the deficit."},{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"10153684998979228","commenter_b":"Crime has gotten out of hand?? Thank you Captain Obvious.","commenter_a":"Should have been in Chicago to make St. Louis feel safe.","post_message":"St. Louis Mayor Francis Slay says crime in the City of St. Louis has gotten out of hand."},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."},{"comment_id":"10153112407151336","commenter_b":"Doesn't surprise me!!! Lots of liberals there;!!","commenter_a":"What a dullard...","post_message":"“Seattleites know that discrimination has no place in our city,” Mayor Ed Murray said. “That’s just equality 101.”"}]
