[{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"10153034720411130","commenter_b":"Biggest problem, IMO,is the black daddies who make kids then disappears.The moms are just as bad with 5 kids and 5 different Fathers.","commenter_a":"All lives matter, saying only one race matters is why there is much violence going on. Race should not factor in to it. LIFE matters period, unborn baby, elderly, black, white, or purple with pink polka dots.","post_message":"\"How many more minorities have to die at the hands of the police who are supposed to protect us before we finally wake up? How many?\""},{"comment_id":"1029734007098210","commenter_b":"Poor old bitch. Still eat up with dumbass","commenter_a":"Cannot wait! This should be fun. Trump has his problems but hillary is such a liar that I hope she turns pknk.","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"1665697853729274","commenter_b":"@username How do you know Obama didn't do half the stuff he's accused of? I say he did and another half we haven't heard of yet! There isn't going to be a recount of every state, but if there was Trump probably would win by a landslide. Hillary has done nothing but lose ground!","commenter_a":"I think you guys are forgetting this is a FREE country and people don't have to perform for someone they don't respect. He hasn't earned any respect and indeed, he has done quite the opposite. Insulting people left and right and you guys just cheered. Trump believes people should bow to him and perform for him. He is NOT a king. It is his own people that were crying that no one wanted to come and all of a sudden he wants \"just the people\" Please...don't make me laugh! He is already claiming he helped keep jobs here and claiming success for Obama's successes. He has already been caught in outright lies about it. Oh I saved Sprint, they are coming back...no, that deal had nothing to do with Trump. It's laughable! Why do you ignore it? Is it too uncomfortable for you people to acknowledge he has lied to ...","post_message":"They turned up their nose at our future president."},{"comment_id":"456730087850905","commenter_b":"This is a no-Brainerd! Of course it should be banned!","commenter_a":"Yes","post_message":"Should Shariah Law Be Banned In The US?  Comment 'yes' or 'no'."},{"comment_id":"10152999953419205","commenter_b":"....They are racist too is hardly an argument. Plus copy and paste from KKK websites ain't the best source. Still laughing","commenter_a":"You mean whitewashed like how the democrat party did about their racist history? The party you blindly support like Pavlov dogs?","post_message":"Texas textbook publishers caught whitewashing American history"},{"comment_id":"537696536420926","commenter_b":"I don't like her anyway no matter what. Don't trust her","commenter_a":"Its a joke this woman no never come out as president she's wasting her time in her money we all know nobody wants to Clinton back in the White House","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS.  What a disgrace. She will never be president.  Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"}]
