[{"comment_id":"10153322540253271","commenter_b":"It is probably easier to do that surgery when the 'boy is younger He looks better afterwards","commenter_a":"Stupid! I grew up being bullied and NO ONE did anything to protect me. There are better ways to help him with the problem","post_message":"PARENTS: How young is too young for plastic surgery? A 6-year-old boy got his ears pinned back to stop bullies from calling him 'elf ears.'  What do you think? Is this a good way to handle bullying? We're sharing your opinions on 7NEWS at 11:00. @webpagelink"},{"comment_id":"1235851089812062","commenter_b":"You're as ghetto as this chick","commenter_a":"I had my daughter at 16. I hid my pregnancy til the day i had her. My family just thought I was getting real heavy. Yes it was scary I was way too young and I knew my life would change. I had to grow up and do things most 16 yr olds don't have to. But i loved my daughter and can't imagine a life without her. I will never understand this! At 16 you know better!!! Give that child to a hospital, family someone!","post_message":"A infant girl died after being thrown from a second-floor window, allegedly by her 16-year-old mother after the teen gave birth. The child's grandmother was administering CPR when paramedics arrived."},{"comment_id":"839189072876028","commenter_b":"Women 4 Trump","commenter_a":"@username is the smartest, strongest, most beautiful woman in America, and she will be our next president. #ImWithHer #SheGotOurBack #WeGotHerBack #HillaryAllTheWay","post_message":"Trump’s attacks on women’s health are inexcusable—and the rest of the Republican candidates are just as bad. hrc.io/1St92h4"},{"comment_id":"10153645733937217","commenter_b":"@username dude your wife looks like a yeast infection","commenter_a":"Oh god. Hillary can potentially become the next president, yet Nixon was almost impeached for missing tapes and she has thousands of missing emails. Wow people are incredibly stupid these days!","post_message":"\"Next January, I want to be sure that it is Hillary Clinton who takes the oath of office, not Donald J. Trump\" writes California Governor Jerry Brown."},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."}]
