[{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."},{"comment_id":"10153487443061336","commenter_b":"Lawrence and Ruthanne Dolezal parents, both white as snow. Only time she is black is when the lights go out.","commenter_a":"OMG how proud her folks must be. Shes as black as Obama is white.","post_message":"“I wouldn’t say I’m African American, but I would say I’m black.”   Former NAACP leader Rachel Dolezal said in a new interview that she didn’t deceive anyone about her race."},{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"},{"comment_id":"479371038920143","commenter_b":"Put that stupid bitch in a uniform and make her serve!","commenter_a":"no wonder look who shes married to","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"1105899882819941","commenter_b":"@username typo, bitch!","commenter_a":"Donald Trump 2016! Because as an American hispanic, I'm tired of how all of these coward racist liberals that hate America like Obama, Clinton, Sanders, and their supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":"They do NOT want people to see this one!"},{"comment_id":"10153850884477235","commenter_b":"Only a woman who knows full well that things have changed since the days of screen time for weather \"girls\" only could say something so offensive. She is not worried about being masculinized out of a job.","commenter_a":"Mentally challenged","post_message":"The stupid, it burns."},{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."}]
