[{"comment_id":"363657737155854","commenter_b":"She needs to die","commenter_a":"Don't watch her either to me she is just stiring up trouble","post_message":"Is Oprah a race-baiter?"},{"comment_id":"1538102683151787","commenter_b":"What a bitch","commenter_a":"That was totally uncalled for she was just trying to start trouble!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO]  Racebaiters will never say anything about this.  What would you do in this situation?"},{"comment_id":"10157204409490206","commenter_b":"This chick is so full of crap.","commenter_a":"He makes John Lennon seem like a man and Ryan Leaf viable.\\b","post_message":"The disgraced quarterback allegedly hit his ex-girlfriend on the side of her face, rupturing her eardrum, and she's reportedly still unable to hear out of that ear."},{"comment_id":"1007311229351882","commenter_b":"@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"\"They are as dead as emperor-worship in Japan.\""},{"comment_id":"10153348953162217","commenter_b":"I saw a mother the other day getting into her car with her pjs, slippers and a cup of tea/coffee. I would be so embarrassed to take my kids to school like that.","commenter_a":"It's really difficult to put a top and jeans on. Come on it's 2016 😉","post_message":"\"There has been an increasing tendency for parents to escort children while still wearing their pyjamas and, on occasion, even slippers.\""},{"comment_id":"10153378758554575","commenter_b":"Would this woman have been willing to pay the stewardess' salary when the stewardess got fired for allowing her to make the phone call? Bet not....","commenter_a":"Why is she leaving if her husband was suicidal","post_message":"A woman says Southwest Airlines refused to let her call her husband after she received a troubling text message shortly before her flight was scheduled to take off.  The woman said the text read, “Karen, please forgive me for what I am about to do, I am going to kill myself…” She said she replied \"no\" and immediately tried to call her husband, before a steward \"slapped the phone down\" and told her to put her phone on airplane mode."},{"comment_id":"1332532336775650","commenter_b":"Trump \"Hillary is a Bigot\" there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"}]
