[{"comment_id":"10153354234326336","commenter_b":"Women should only be allowed to make the sandwiches.","commenter_a":"Females should not be prison guards for male prisons. And I don't want to hear from all the feminist. That is my personal opinion.","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"1074912275882577","commenter_b":"Look at their faces....they're smiling. ...and we're not allowed to be angry about this. All of you bigots need to shut up! Wear your flag ....fly your flag......shove your flag.....who cares ....but you will not see it flying over that government building ever again!!!! Deal with that!","commenter_a":"Are these the same, \"It's Heritage, not Hate\" clowns?","post_message":"South Carolina voted to remove the Confederate flag, and bigots are in a frenzy: 'F*ck black people'"},{"comment_id":"10156189535540354","commenter_b":"@username you do know that Sharia Law requires gays to be destroyed?","commenter_a":"I can't imagine any conservative/Republican not standing with Dr. Carson on this.","post_message":"\"Sharia law is so inconsistent with the US Constitution Ben Carson could not be more right.\""},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"1142049429235281","commenter_b":"I'll unzip my dick for you, gurl","commenter_a":"#VoteJillStein!!!","post_message":""},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"1041407739283520","commenter_b":"Where's BEYONCE crying out against these BLMers?? Or is she FOR IT ALL???","commenter_a":"When will America wake up these people must go","post_message":"\"We must continue working to build trust between communities and law enforcement.\"   Watch Attorney General Loretta Lynch address the #Dallas sniper shooting that killed five police officers."}]
