[{"comment_id":"835498176546436","commenter_b":"Deb... Your name Is tasty.","commenter_a":"Was he speaking to an empty chair? I can't think of anybody else who would or should listen.","post_message":"The director has spoken."},{"comment_id":"1044864242277400","commenter_b":"@username Of course you haven't ever heard a group of 59 year old women bragging about \"popping a Tic-Tac\" so they could forcibly kiss a handsome man. And never have I heard this same age group say, \"grab'em by the d*ck\", nope, it doesn't happen...","commenter_a":"I am still trying to figure out how this man became a surgeon. Are you sure that his license and everything or legit cuz he is a total nut","post_message":"Ridiculous!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153030735456378","commenter_b":"Weather this is true or not I don't know,but one thing I do know is none of us would be in the water if we saw what was swimming around or beneath us!!!","commenter_a":"Hoax","post_message":"REAL OR HOAX? A video showing a great white shark circling a surfer has gone viral... but now, people are questioning its authenticity. What do YOU think? Is it real or is it a hoax?"},{"comment_id":"608123169320865","commenter_b":"F**K Oprah .......she's a Racist Bitch.","commenter_a":"Hey. Heads up. Being gay is no more of sin than lying. Stop being so judgmental. Leave that to God. He says to love one another; guess what, a lot of you are clearly struggling with that.","post_message":".............................yikes"},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's \"gotcha\" questions to their advantage. Fiorina is turning it into an art form."},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."},{"comment_id":"10154447143119087","commenter_b":"Katherine, I hope someone, someday, grabs you by the pussy, you uneducated white trash bitch","commenter_a":"lol he's a hot headed LOSER.... This asshole called his own daughter a Pig And somehow we care what he thinks about Donald Trump","post_message":"Alec Baldwin posted a photo on Instagram in a Russian \"Make America Great Again\" Hat."}]
