[{"comment_id":"177307306103129","commenter_b":"Wrong! Never said in his first 30 days","commenter_a":"Didn't he defeat ISIS already? He said he would in his first 30 days.","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"10154189232436603","commenter_b":"Haaaaaaaaa am avut 12!!!!","commenter_a":"@username 11/18 sa vedem daca ma bati","post_message":"Quiz to be taken whilst listening to \"Smelly Cat.\""},{"comment_id":"1227897690610317","commenter_b":"She racis af","commenter_a":"Line your Ass up and get on the Trump 🚌 bus get your no 🚿 showering Ass out the U.S. take your stank mama with you.💩💩💩💩💩💩😄","post_message":"He went in with no shame!  #WSHH"},{"comment_id":"945737062128382","commenter_b":"Most Muslims are opportunists & try to take advantage of our awesome OPEN accepting country and are trying to push their false religious bogus rules and regs on us. Too late. Two wars have been fought on our soil and much blood shed to protect our American way of life and that includes the right to run a busniess free of foreign rules... do not continue trying to bring foreign laws into the equation..it doesnt fit!!!. America's laws are the way we live life..NOT islam..thats for syria etc..those rules are SOOO not ever going to work here so just try to relax and accept it. Get some counseling. Maybe then you will be happier and free from manmade male imposed non Christian laws. They always seem so negative..no joy in life! You're in America..rejoice..embrace your new life here. Jesus will set you free from the bondage of FALSE RELIGION...ask the ...","commenter_a":"She must follow the rules of the country where they live and enjoy the luxury of that country. If they don't, they must return back where they came from.","post_message":"Muslim woman wouldn't remove hijab, but hypocrisy bit her in a BIG WAY!"},{"comment_id":"10154883181056509","commenter_b":"Please be honest... Why are 37% of Federal prison sentences illegal immigrants? Tell American's the $100 Billion illegal immigration cost in tax dollars each year, this would pay the college for American citizens. The $12 Billion per year Illegal immigrants cost California taxpayers. The $Trillions Immigration Reform will cost taxpayer's in benefits due to the average 10th grade or less education level of illegal immigrants who will be on additional welfare for the next 50 years, will be receiving more free or low cost healthcare, which is breaking the bank of middle income families now. Tell them that 5,000 come in on a daily basis. Tell them about the identity theft of illegal immigrants who use stolen Social Security numbers to take American jobs and the IRS admitted to Congress that they did not notify the person or business that the illegal alien was again breaking laws and ruining American ...","commenter_a":"Speaking of an etiquette guide to Muslims, what does this particular group of 1.6 billion people believe about homosexuality?","post_message":"There are 7 billion people in the world. And a full 22% of them -- 1.6 billion -- are fasting from sunup to sundown. Every day. For an entire month."},{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a \"90-day sex fast\" with his wife and it left him \"more in love\" and \"more turned on\" than ever."},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."}]
