[{"comment_id":"1238686566209877","commenter_b":"Well said! Agree 100%","commenter_a":"The norm in our country any more. White on black, is racism. Black on white, poor black kids had no daddy & raised in a poor neighborhood! That half an half in the White House. He has no compassion for his \"white\" heritage, only the black side. Pathetic man!","post_message":"A white pizza delivery kid was out working hard, trying to make ends meet. Then he got a call to deliver a pizza to these two thugs.  What happened once he got there will turn your stomach.  This should outrage the entire nation, but the media, Al Sharpton, and Barack Obama don't want to say a word."},{"comment_id":"10154235206604203","commenter_b":"Black girl magic. Fucking lol.","commenter_a":"Kathryn, guuuurl. You can find me runway-walking down the street to your house with a bottle and a mission to witness this black girl magic. Let me stop by Red Lobster real quick, tho.","post_message":"Wow."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"378908105805941","commenter_b":"These people are demon possessed. They need to be stopped.","commenter_a":"Trumps fault","post_message":"MUSLIM MEN WHO RAPED 11-YEAR OLD Shout \"Allahu Akbar\" At Sentencing...The Girl Had A Baby At 12   No remorse whatsoever..."},{"comment_id":"10153594349921162","commenter_b":"Yolo","commenter_a":"Cesar Orozco @username @username","post_message":"Tomorrow could be the hottest day in nearly 2 years - if we reach 93!"},{"comment_id":"10150909460504999","commenter_b":"Why won't they announce the legal charge? What a messed up legal system","commenter_a":"What r they charging her with?!","post_message":"Richard Ratcliffe's wife and daughter are being held by the government of Iran. He's in New York during the United Nations General Assembly in an attempt to confront the president of Iran. He shares his story here and answers your questions."},{"comment_id":"10152759669890779","commenter_b":"let me tell you what happin to RED ASS.","commenter_a":"Today is your birthday? What's today?","post_message":"Twenty years have puff-puff passed since the stoner comedy Friday lit up movie theaters and became not just a cult sensation but a bona-fide classic. Ice Cube spoke with us about the success of the movie, the \"Bye Felicia\" meme and why the film is so beloved. \"It's cool – get high and all that – but the movie is memorable because it's the day that the bully got his ass whooped, and everybody loves that day.\" Click through for the full interview."}]
