[{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"1535691416490982","commenter_b":"Go lick some boots","commenter_a":"I don't see how the video is BS you can clearly see him drop his hands down into his waistband and wasn't following police commands again showing the total disregard to authority so The only BS I see is ignorant people trying to act like they're above the law","post_message":"The media ALMOST had everybody fooled about Crutcher, but we found the truth.  And it's going to destroy the media's narrative on the Crutcher shooting..."},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"1108523962492406","commenter_b":"Illegal aliens 62%!","commenter_a":"Most people on welfare are in a red state and are white. @webpagelink @webpagelink Undocumented immigrants pay taxes all the time. \"The 11.4 million undocumented immigrants currently living in the United States collectively paid $11.84 billion in state and local taxes in 2012. ITEP’s analysis finds their combined nationwide state and local tax contributions would increase by $845 million under full implementation of the administration’s 2012 and 2014 executive actions and by $2.2 billion under comprehensive immigration reform.\" @webpagelink","post_message":"Fighting off anti-immigrant myths with FACTS."},{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."}]
