[{"comment_id":"10153516568789087","commenter_b":"Muslim is not a religion it describes someone who worships Islam. Guess what ISIS stands for? Its the radical group of Muslims you understanding? Its a Muslim group of people that engages in terrorism. Trump wants to ban Muslims from coming here and he wants American Muslims to help us sort out who is good or bad.","commenter_a":"How is Trump a white supremacist? He has never said anything racist okay \"illegal\" is not even a race. Trump has said millions of times he supports immigration. What he does not support are people that are dangerous getting free cards to come here. Also to those who say illegals don't use Government assistance they do. They fucking come here have an anchor baby and then use the babies citizenship to get Government assistance. We have a serious problem I have a Mexican friend who is American with perfect credit and great job. She tried to buy a house and got told no. Guess what same house and a family both illegal except their 2 girls bought the house. How is that fair to anyone? Illegal immigration impacts Mexicans who are already here legally and it's not fair to them if others cheat the system. If you are so damn ...","post_message":"“I would certainly return it if you think it is appropriate,” Donald J. Trump told a voter who asked if he would return the donation he received from noted white separatist William Daniel Johnson. “I would return it. Don’t be so angry, I don’t even know who he is.”"},{"comment_id":"10153228353231336","commenter_b":"Hawraa is unaware of the meaning of the word AND. Grow up little girl.","commenter_a":"This is dead on right...but the morons and libs will be outraged!!! If you can't handle the truth","post_message":"“It is the behavior of individual human beings, not big daddy government that leads to success.” — Bill O'Reilly  WATCH Monday's Talking Points Memo and weigh in: @webpagelink"},{"comment_id":"10153523399935329","commenter_b":"And a lets get a pug","commenter_a":"@username I want a bear","post_message":"THIS GUY!"},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."},{"comment_id":"10153959517171337","commenter_b":"\"Drink the kool-aid.. Sheep.. Libtard... Scandals...\" Meanwhile, there's Trump. All of those things wrapped into on ball of hair. HA HA HA!!","commenter_a":"Haha that bitch will do anything for votes. She's trying to win the young/urban vote lol tomorrow she'll be in overalls with a straw in here teeth talking to some farmers. Line up kids, get your blow job from Hillary !!!","post_message":"R.I.P Dabbing  @webpagelink   (2015-2016)"},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."}]
