[{"comment_id":"10154052672876051","commenter_b":"You deserve crooked Hillary!","commenter_a":"LMFAO, Clinton has SECURED enough electoral votes that she doesn't even NEED TO campaign anymore. Nice try there. It's pretty goddam pathetic that the absolute BEST the \"party of values\" could scrape up is a con artist who cheated on wife #1 with wife #2, has FIVE children from three different wives, wife #3 lied about having a degree and may possibly be an illegal immigrant; Trump appeared on the cover of Playboy and owned strip clubs AND gambling casinos; admits he wants to bang his own daughter; mocked the handicapped; supports torture; numerous business failures; bribed Florida AG Pam Bondi; is facing ethics lawsuit regarding Trump University, and that's just off the top of my head - yeah, right. Some \"Presidential\" material. So shove your fake-ass BULLSHIT stories about emails and Benghazi, you cheap phony \"patriots\" supporting Trump.","post_message":"Election swing: Donald Trump is now leading Hillary Clinton by two points in a major nationwide poll. Would you like to see Trump shock the world and win this November?"},{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"10153729892456509","commenter_b":"I'm certainly not by any mean defending China's actions but it's quite hypocritical to criticize them while America commits terrible animal crimes too. That chicken, beef, bacon, etc. are almost from animals living in poor conditions and slaughtered. It's just favoritism to defend one animal and not another. To condemn one country and not another. Like Ramapriyan says, stop trying to be the world police.","commenter_a":"Just returned from Singapore and Hong Kong. Both very awesome cities.","post_message":"Plan on visiting any of these cities this year? @webpagelink"},{"comment_id":"1182482298496971","commenter_b":"Praying🙏","commenter_a":"Get well soon.","post_message":"Prayers are with the Fox News family today..."},{"comment_id":"1102809566397179","commenter_b":"RACIST .","commenter_a":"Ben is a nice man but he reminds me of my old Catholic priest in high school, out of touch with how other people live and he came up with the most ridiculous things. Voting to me for Carson is like voting for the old priest.","post_message":"Number. Three."},{"comment_id":"608915299267779","commenter_b":"Nigga i would murder u nigga in HIp HOp","commenter_a":"Hahaha... @username ma boy who you got? Lol... Norman Harrell @username who you got? I call Em via 1st Round KO","post_message":"Drake reportedly claims he's ready to take on Eminem. Who do you got in a Drake vs Eminem beef? #Drake #Eminem #Beef #JoeBudden #WSHH #Hot97"},{"comment_id":"10153723751980667","commenter_b":"I wonder how many people actually read Hillary's dumped emails on wiki leak. I'd strongly encourage people to do their homework before voting for her. Be prepared for some stomach turning, treasonous info. #scary #makeamericagreat","commenter_a":"ROFLMAO. I'm thinking that kindergarten name-calling is *not* an effective general election strategy.","post_message":"\"She should get an award from them as the founder of ISIS,\" Trump said Wednesday."}]
