[{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10153045514858908","commenter_b":"Wrong. Anti-vaxxers allow a disease to evolve and make said vaccinations useless. If we ALL got vaccinated, the disease is wiped out and it can't evolve or spread. Science.","commenter_a":"So I go to read the article, and directly above it is a fear mongering advertisement with a link...don't catch shingles. Get your vacination now. SMH If you don't want vacinations dont get them. If you want vacinations get them. If you believe vacinations work then you are in no danger of catching the diseases from the people you are bitching at and preaching to. Mind your own business like people did in the old days before Facebook.","post_message":"Many important points made here are not to be ignored...."},{"comment_id":"10153908258427235","commenter_b":"Clowns with Guns!","commenter_a":"Listen up numbnuts, the oath to protect the constitution against all enemies foreign and domestic means that YOU are the enemy and should be eliminated. YOU are the one threatening the government, YOU are the one who hates America. YOU are a moron and a #faketriot.","post_message":"These guys are treasonous."},{"comment_id":"10156487496090615","commenter_b":"Give it up, David. If they'd vote for someone who votes for war, flip flops on the Keystone pipeline, takes money from Wall Street, and until very recently did not support marriage equality, I don't think they're interested in the truth. They'd rather just take their half truths and stir up crap, just like the candidate they support.","commenter_a":"So many Bernie fans complained that not enough debates were scheduled before the primaries. Now Bernie refuses to debate when the other two candidates are willing. Yet another reason I'll be voting for Hillary.","post_message":""},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"}]
