[{"comment_id":"10153201571853812","commenter_b":"Hes a witch!","commenter_a":"Ahmed Shannon Nathan Jake Conrad Robert Ya Ron Ronaldo","post_message":"WATCH: In Portland, Maine, it is cold. Very cold. THIS cold. -- [ VIDEO: Portland Police Department] - ABC News Weather"},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."},{"comment_id":"10155464827050354","commenter_b":"Crazy ass bitch.","commenter_a":"Ms. Warren needs to look into the eyes of the youngest victim and then advocate against the death penalty. And then go to the other families that lost loved ones or lost limbs and time. That dear little boy didn't have the chance to live and she wants that piece of sh*t to live a long life.","post_message":"Liberal values..."},{"comment_id":"10153540355058984","commenter_b":"It's not just abortion Drs. all Drs. Make obscene salary's. Abortion should only be for rape victims, incest victims !","commenter_a":"it wont do them any good in HELL!!!","post_message":"Here's something shocking that Obama and His Planned Parenthood cronies will not like.   Do you consider these outrageous abortion salaries \"blood money?\""},{"comment_id":"618975741614411","commenter_b":"She's just mad no one wants to grab her pussy","commenter_a":"🙄","post_message":"Can you believe this, folks?"},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."},{"comment_id":"10157319779090093","commenter_b":"That's because she likes women better!","commenter_a":"Loving wife, he'd boink anyone in a skirt except Hillary!!!","post_message":"\"The biggest problem is that the more he talked the weirder it was that he didn address the elephant(s) in the room.\""}]
