[{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"465878743536720","commenter_b":"Wake up lady.","commenter_a":"if you think Trump loves America, why does he insult everyone and everything??? And Obama has done more for the middle class than many previous presidents.","post_message":"U.S. Democratic presidential candidate Hillary Clinton says she's \"appalled\" after Donald Trump declined to correct a man who called President Obama a Muslim and non-American during a town hall event. Was she right?"},{"comment_id":"10155940729650354","commenter_b":"Sick disgusting bitch","commenter_a":"hahahaha yes she was tim...","post_message":"Unbelievable...."},{"comment_id":"10154165798037212","commenter_b":"It was an accident. Please use your words kindly. The driver needs our prayers . This was a total accident.","commenter_a":"I'd kill someone hands down. Hit my kid or my dog with your car and you better pray the police get there quick enough. I'm at a loss of words for this little family. Praying for them with everything in me.","post_message":"UPDATE: A 2-year-old boy has died after being hit by a car Tuesday night in Yukon. #News9"},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"},{"comment_id":"10153663698070950","commenter_b":"I am not goin any where...I am a women of God and you need to read your bible,and as far as my gun,i carry it every where i have a permit and the right to carry it","commenter_a":"All of these peoplev are goin to hell if they dont frepnt,And im not giving my gun up for noone,im a responsable gun owner and its my right to carry a gun.....All these gay people need to repent cause he is coming back!!!","post_message":"Motorcyclists, parade-goers march on in L.A. march on during their annual gay pride parade:"},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."}]
