[{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":""},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"708523179338260","commenter_b":"Bust his ass .","commenter_a":"kick its ass out of the school","post_message":"Cross dressing boy entered girl's locker room and did this.  This is wrong. The boundaries need to be drawn.  Would you want this boy in your little girl's locker room?"},{"comment_id":"718993818288909","commenter_b":"They're here illegally they don't get rights moron!","commenter_a":"No one is saying we cant police our borders...but we must do so with Constitutionally appropriate actions. After all isnt it our CONSTITUTION that we are protecting, that we are asking out service member to protect with their lives. It makes no sense to me that we are willing to throw out the very basis of our great country because we are so fearful. We must be strong and remember our core values.","post_message":"Trump is keeping his promise! I don’t care how much liberals scream and protest… A NATION HAS A RIGHT TO POLICE ITS BORDERS, ESPECIALLY FROM VIOLENT CRIMINALS!   LET'S get 10,000 SHARES for our President! No Judge Can STOP His plans To Make America GREAT AGAIN!"},{"comment_id":"10153204698059712","commenter_b":"It looks like the New Anti Gun Laws are working for the Criminals. It's taking Guns out of the hands of the Law Abiding Citizen and putting them in the hands if the Criminals because Criminals Don't Follow the Law. Good Job Liberals for putting Maryland back at #1 for Murders.","commenter_a":"Violence in Baltimore, gee would neva had thunk that!!","post_message":"Baltimore has had 54 homicides in 2015 — 8 more than at this time last year. Nonfatal shootings are also up 40%."},{"comment_id":"989968744373799","commenter_b":"I will be keeping the guns thank you.","commenter_a":"We need anti knife and anti-texting while driving legislation.","post_message":"Commentary from Blaze contributor and pastor Jarrid Wilson."}]
