[{"comment_id":"1160164500670245","commenter_b":"@username did you forget to take your happy pills? LOL","commenter_a":"I am so over this. We need to worry about the homeless and disabled right in front of us, not hunting regulations in another country over one dead lion. Take the money you spent getting to this guys house and buying paint and feed someone today.","post_message":"Raw meat, animal crackers and spray paint were used to vandalize the Florida vacation home of lion-hunting dentist Walter Palmer."},{"comment_id":"598432576983363","commenter_b":"No it's only ok for racist rednecks to say shit like that. Those lost European immigrants who assume they're original Americans.","commenter_a":"Too bad Trump wasn't on it.","post_message":"\"Looks like yet another terrorist attack,\" Trump tweeted. French and Egyptian authorities have repeatedly warned against such speculation."},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"10153143538491051","commenter_b":"How? A majority of liberal democrats are old rich white men todd","commenter_a":"Wrong... And you can bet the white scum liberal will go after the American Flag next... Americas biggest threat, the white scum liberal...","post_message":"The Confederate Flag's 54-year run at the South Carolina statehouse is officially over. Do you think that was the right decision?"},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"10153854573245779","commenter_b":"Bullshit","commenter_a":"If were a boy... all feminazis here asking death penalty.... hypocrisy","post_message":"A 14-year-old girl sent suggestive pictures to a classmate and now she might have to register as a sex offender. Here's why this is absurd."},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."}]
