[{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"\"Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.\""},{"comment_id":"10154292908136545","commenter_b":"That claim was bogus. She was an angry girl out to get him. There was supposedly proof of that.","commenter_a":"Seriously??!!! Pray he's ok. He needs to be in protective custody until game time","post_message":"JUST IN: Frisco police confirm Ezekiel Elliott was involved in a minor car crash near #Cowboys practice facility. No injuries were reported.   MORE: @webpagelink"},{"comment_id":"1091281260931621","commenter_b":"False? He plead guilty and was a registered sex offender.","commenter_a":"Best known for being a paedophile.","post_message":"RIP Jackass star Vincent 'Don Vito' Margera"},{"comment_id":"902473139819442","commenter_b":"Even woodpeckers for fucks sake. If they're damaging your house, or your property, guess what, you can shoot it","commenter_a":"Bring back fox hunting - look at the state of this fox -","post_message":"Fox Busted In The Hen House Literally!"},{"comment_id":"657334997759787","commenter_b":"The key is this. Why was he walking away from the officer with his hands up? Then going for the door of his vehicle. Also they dispatched a helicopter to the scene well prior to the shooting. There is way more than the media is showing.","commenter_a":"Cop should get the chair for this shit","post_message":"In a video, an unarmed man is seen walking with his hands up. Moments later, a police officer shoots him."},{"comment_id":"1256658817687479","commenter_b":"Lady I think you need a snickers bar.","commenter_a":"Yeah be on the lookout! They have white skin, blondish hair, blue/gray eyes and they shoot up movie theaters, churches, schools and clinics! Oh my bad, wrong terrorists!! Please continue! Smh....a bunch of fucktards.","post_message":"After masquerading for months as a newly Americanized housewife, Tashfeen Malik dropped the facade in a burst of gunfire."},{"comment_id":"817400965070133","commenter_b":"Full fledged ASSHOLE and you too @username...go back to Mexico you illegal alien!","commenter_a":"And you Bill de Blasio are a Asshole !!!!! At least Mr. Trump has the balls to stand up for what he believes in !!!","post_message":"\"I didn’t realize this was in question. Behaves like a racist, speaks like a racist…of course @RealDonaldTrump is a racist,\" New York City Mayor Bill de Blasio tweeted."}]
