[{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"10153285157239205","commenter_b":"Ignorant bitches 😂😂","commenter_a":"@username time to move for me 😂😂😂","post_message":"Trump Should Probably Start Fact-Checking His Retweets"},{"comment_id":"501775896685267","commenter_b":"She is a POS!!!!!!!!LIAR too!!!!","commenter_a":"NO","post_message":"Hillary Clinton has been defying stereotypes about what women can accomplish her whole life. Would you like to see her do it again this November?"},{"comment_id":"10153860997211756","commenter_b":"He is a hero","commenter_a":"Traitor!","post_message":"Snowden tweeted \"Can you hear me now?\" then had an exchange with astrophysicist Neil deGrasse Tyson covering Mars, cat pics and labels."},{"comment_id":"10155501902685389","commenter_b":"Tell her to go home & en joy her granddaughter","commenter_a":"Hopefully it will be the beginning of the Clinton END.","post_message":"Hillary Clinton is expected to officially announce that she is running for president this Sunday. How will Republicans respond?   Tune in tonight at 10p ET for more details!"},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"10154308673266178","commenter_b":"They have NO rights if they are in this country illegally.","commenter_a":"If you want to protest, you have every right. When protesting and you decide to escalate your actions by using violence, you are not only breaking the law but also trying to infringe on other people's freedom of speech.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."}]
