[{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a \"total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"  \"They have no respect for human life,\" Trump said, referring to \"people that believe only in Jihad.\"  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"1194580720554183","commenter_b":"This is all propaganda to rig the voting pattern and is trashy media reporting.","commenter_a":"THE PEOPLE LOVE TRUMP, WE LOVE AMERICA, WE WILL TAKE HER BACK FROM THE FILTH IN DC WHO RAPE OUR COUNTRY AND TERRORIZE OUR PEOPLE!!!!","post_message":"You've heard all the claims that Donald Trump has no chance of beating Hillary Clinton in the general election. Now, here's how that argument is instantly deflated"},{"comment_id":"10153419544317061","commenter_b":"Robach on safari in Africa, probably a better production performance from her than the days she does studio production...She clearly has the ability and clothes to dress for an African safari and lacks all ability to select the correct wardrobe for studio performance...Robach and Spencer are the two worst dressed women on GMA since the show began...Diane Sawyer was one of the best dressed women on this show...","commenter_a":"Cool!","post_message":"WATCH: Our drones capture beautiful live images of elephants as we are on safari in Africa. Interact here: abcn.ws/20PSiVQ #GMAinAfrica"},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"498132093702004","commenter_b":"Simone de Beauvoir said women were their own worst enemies.","commenter_a":"Callous treatment of human life?? Funny coming from a woman who tried with all her power to block her own residents from receiving healthcare under ObamaCare!!","post_message":"Not cool Gov. Haley!"},{"comment_id":"10154179126579411","commenter_b":"Gotta love the \"former\" officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":""}]
