[{"comment_id":"10153068348838717","commenter_b":"That is true but we all know she will never be a President","commenter_a":"She's just a Lying P.O.S!!! She will NEVER be a President!!!","post_message":"Presidential candidate Hillary Clinton sits down with Josh McElveen on CloseUP."},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her \"music\" doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it \"racism\"."},{"comment_id":"10154242038366323","commenter_b":"If someone voluntarily choses this classless \"job\", they deserve anything and everything that might come their way. I have no sympathy with whores and sluts, be they male or female. Why should I?","commenter_a":"Are you kidding me? Political correctness has come to THIS? The authors ersatz rationalization is nothing more than a peurile legitimization of prostitution. Call it whatever you like and for whatever reason, prostitution is prostitution, period. The whole point of the world's oldest profession is to exchange sexual favors for money. That prostitutes, no matter the reason, willingly engage in the services they offer is no reason to create bogus excuses for the consequences. If the sex worker - and make no mistake, that's what they are, regardless of their sex - comes away psychologically damaged, well, that rather goes with the territory of the profession. That is their problem, not anyone elses. In case they hadn't heard, prostitution is illegal. Why should taxpayers be burdened with caring for their psychological ills? As it is, sex workers already reap the benefits of medical attention at emergency rooms or through state ...","post_message":"\"If, while having sex with someone, you feel repulsed by them touching you, afraid of what they might do, degraded and humiliated by the sexual acts – the fact that you’ll get a bit of cash at the end does not change anything. There is no invisible hand in the prostitution market that magically disappears the lived experience of sexual abuse.\""},{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"819567068195360","commenter_b":"Build the wall. Get rid of illegals now.","commenter_a":"Those of you who are trolls (you know who you are) , really need to attempt to get some education, I.e., government or civics classes. 🇺🇸🇺🇸🇺🇸 TRUMP","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"777290672402535","commenter_b":"She is a whiny bitch","commenter_a":"Yes","post_message":"Megyn Kelly Stabs Fellow Fox News Stars In The Back, This Is Horrible   She should be ashamed of herself.  Do you think Megyn Kelly should be fired?"}]
