[{"comment_id":"787320821458495","commenter_b":"F $(; Muslims!!!!","commenter_a":"Fuck Muslims","post_message":"A&E Tells Duck Dynasty To Cut ‘Jesus’ From Prayers To Avoid Offending... We live in a nation with it's foundation built on Christianity. Can we get 30,000 'LIKES' for Duck Dynasty's faith?"},{"comment_id":"10153703121996051","commenter_b":"If you are joking haha good one...if not well...Abusive bitch? Kids tested? Gwah lordy be. What a generation of pansies..","commenter_a":"There are ways to pin this abuse on this bitch. The father has to use some tactics to have the courts on his side. I would get the kids psychologically evaluated, have them testify in court in regards to the mother's abuse and a list of other stuff. I would make this bitch pay!","post_message":"A dad was looking through his son's iPad when he stumbled across this footage of the boy's mother."},{"comment_id":"1271814732856760","commenter_b":"she will be felon. unable to run for office.","commenter_a":"No! Just NO!","post_message":"Just when you thought it was over, look at this..."},{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"},{"comment_id":"10154563996420575","commenter_b":"Obama had better shut and realize all America wants his ass fried!","commenter_a":"Oh, like he did?","post_message":"WOW! Obama says he hope TRUMP will be able to stand up to PUTIN. ---After getting steamrolled by Vlad for eight years!"},{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"\"Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.\""},{"comment_id":"10153336997560927","commenter_b":"What about the perverts that are wide open now to expose themselves? Are bathrooms their safe place now to sexually harass the opposite sex? What are libtards going to do when they become victims of their own lunacy?","commenter_a":"We truly need to abolish the ACLU they are bad news for America","post_message":"ACLU: \"By requiring people to use restrooms that do not correspond to their GENDER IDENTITY, this policy not only endangers and discriminates against transgender people  it also violates federal law ...\""}]
