[{"comment_id":"989615211072231","commenter_b":"Awesome","commenter_a":"WTG BOLTS! :-) :-)","post_message":"GO BOLTS! Tampa Bay Lightning wins Game 2 of the #StanleyCupFinal, ties series 1-1!   WOOOOOOO HOOOOO! Missed a moment? Check out the game details: @webpagelink"},{"comment_id":"1158332250952774","commenter_b":"I am an American who moved abroad and I get better healthcare for very cheap and birth control and maternity leave and the whole shebang... Anyone working gets rights to this in other countries. I can't believe America is fighting such a simple idea. A healthy population is a productive population. You want more able workers? Make sure they can remain healthy enough to work!","commenter_a":"Todd...more than 3 million more said No to Trump than yes!","post_message":"WATCH LIVE: The Women's March on Washington following Donald J. Trump's inauguration –— over 500,000 are in attendance."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"1034922753266951","commenter_b":"Dumb bitch","commenter_a":"Sarah Palin humiliates herself every time she opens her mouth. Do us all a favor - shut up.","post_message":"She just picked the WRONG fight."},{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"10153664039221350","commenter_b":"Liz.....STFU!","commenter_a":"I am seriously sick of the name Caitlyn Jenner and anything with a Kardashian in it. How about reporting on something worthy or being considered interesting.. or a news story.","post_message":"\"I think about my life  and where I'm at in my life right now,\" Caitlyn Jenner told Matt Lauer. \"What a tremendous experience this is.\""},{"comment_id":"1219402711410410","commenter_b":"i did not know we had 18000 + illegals in our country keep signing and we can take the list and round them all up and send them all home illegals NO legals YES if any one wants to come live in the U.S.A do it right by the law and we will embrace you any thing illegal in America will be prosecuted to the full existent of the law Americans don't care where you are from just do it wright","commenter_a":"Likely, they/#SNL have to give \"equal time\", since the top candidate from the other party was prominently featured.","post_message":""}]
