[{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"1220607601313429","commenter_b":"Lena Al","commenter_a":"Sinéad check this out","post_message":"Sounds about right."},{"comment_id":"1172778402818410","commenter_b":"the media just didnt air BERNIE enough! didnt get his ideas and platform out there,for all to hear. too busy showing stupid trump./","commenter_a":"Hillary 2016","post_message":"384 pledged delegates are at stake today, nearly twice as many as in New York last Tuesday."},{"comment_id":"10156889052280206","commenter_b":"if we really want to protect our country all we have to do is put up pictures of carly at the borders. that would scare anything.","commenter_a":"First is to end all illegal wars in the Middle East and stop supporting rebel groups with weapons which eventually end up in the hands of people who wish to harm the USA. We no longer need to rely on Middle East oil so there is no need for the US to be there.","post_message":"Q: What do we need to do to protect our homeland?   Get more answers at @webpagelink"},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."}]
