[{"comment_id":"10152885514044342","commenter_b":"Ain't that the truth. These hoes need to held ACCOUNTABLE!!","commenter_a":"It's always a mental thing.. Always an excuse...","post_message":"MOTHER CHARGED: A 23-year-old mother has now been charged in a brutal attack on her 4-year-old son that left deputies responding to the scene shaken and disturbed --> @webpagelink"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"10155507784285405","commenter_b":"DO NOT LET the criminal illegal invaders take over our military .","commenter_a":"Karl Keyzer-Andre","post_message":"As we celebrate Armed Forces Day, I want to take a minute to honor and thank all our servicemebers and veterans for your sacrifice. America owes each and every one of you a great debt of gratitude."},{"comment_id":"1292853950724756","commenter_b":"Or marry him, or bear his children, or even be in the same room with him. Not worth any amount of money could buy a smart woman.","commenter_a":"Always a lady with class, dignity and honesty.","post_message":"She's absolutely right."},{"comment_id":"10154527348963352","commenter_b":"Kiss his ass","commenter_a":"I agree with him!","post_message":"RUSSELL SIMMONS GOES OFF ON OBAMA WITH NO KIND OF RESPECT! BASICALLY SAYS OBAMA AIN'T SH*T! (PHOTOS) @webpagelink"},{"comment_id":"511284652397563","commenter_b":"@username Riddle me this Kat Can you please enlighten any or all of us exactly what it is that Trump can and will do for us? BESIDES build that wall and MAKE AMERICA GREAT AGAIN????","commenter_a":"Serious question: Hasn't there been enough debates? Cruz has had plenty of opportunities and has yet to take advantage.","post_message":"\"Let’s make it a two-hour debate. CNN has already scheduled it. You’ve got a venue. You’ve got a location. You’ve got TV cameras. The only thing missing is Donald Trump because he’s too scared to debate.” —Ted Cruz"}]
