[{"comment_id":"1025040644216607","commenter_b":"@username , I think there is, but would have to look it up. Basically the way it would work though is if impeachment is not possible, a no confidence vote by congress could in effect say we no longer recognize this Presidents authority. Members of congress can be sanctioned, why not the POTUS?","commenter_a":"What we need is Nation wide non-compliance with, or recognition of authority, or any further orders coming out of the White House. Personally I think a no confidence vote is in order. Write your Congress and demand the sanctioning of the President until the end of his term, for gross executive over reach and abuse of power.","post_message":"The president continues to show his disregard for millions of Americans with his 'Bathroom Order,' never bothering to consult with parents. Instead, he decided to issue an order threatening the loss of funding and lawsuits from the government to schools that don't comply."},{"comment_id":"10154171433698701","commenter_b":"Crazy! :-)","commenter_a":"86 in Woodland, WA","post_message":"As of 2 p.m. today, Portland is hotter than Palm Springs, CA; Albuquerque, NM and Atlanta, GA! Stay up-to-the-minute with the FOX 12 Weather App: @webpagelink"},{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."}]
