[{"comment_id":"1239000506196199","commenter_b":"WE NEED A BILLIONAIRE VIGILANTE TO STOP THE RIGGED SYSTEM THAT LET HILLARY CLINTON GET OFF!!!","commenter_a":"So he really thinks minorities are buying this load of BULL💩💩💩💩💩💩💩💩💩💩💩💩","post_message":"\"We will honor the people with the truth and nothing else,\" Donald J. Trump said during his acceptance speech at the #GOPConvention."},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"},{"comment_id":"10152785175031051","commenter_b":"Headbutt got her an ass whipping-lol","commenter_a":"I can't believe I watched this. I liked the headbutt though. lol","post_message":"It started out as an ordinary day at Walmart. Then, without warning – all hell broke loose."},{"comment_id":"10153126312326028","commenter_b":"I don't understand Americans... This is the land of the free, right? No one's free! One is not free to speak Spanish and the other one is not free to be stupid. All my respect for the Latina lady, because at least she tries to speak English, thing that doesn't happen often.","commenter_a":"White 'Murican hates a woman that speaks TWO languages and she can't even form proper sentences, or thoughts, in one language..","post_message":"\"I FELT AWFUL\": All Norma Vazquez wanted was to treat her son to some birthday IHOP on her time off from her job cleaning office buildings. Instead she was berated by another patron who told her to \"stop speaking Spanish\" and invoked the Nazis, Castro and Russia.  Watch the entire exchange, which Vazquez's son recorded on his cell phone: @webpagelink"},{"comment_id":"10152864725267623","commenter_b":"Bajajajajaja!!!! Girl white isn't in it either! Lol","commenter_a":"Lmfao!!!! I am loving how pressed these folks are over this!! Get over it people...and move on!! I'm so happy with my President!","post_message":"Check out what the Obama administration did to the White House:"},{"comment_id":"539180629598484","commenter_b":"Good one. That made me chuckle.","commenter_a":"Because nothing screams, \"I'm protecting the environment\" like flying your private jet to accept an environmental award.... lol","post_message":"Some eyebrows were raised when DiCaprio took a private jet from Cannes to New York City to pick up an award from Robert De Niro's clean water advocacy group."},{"comment_id":"1859284991009604","commenter_b":"Niggaz and whites","commenter_a":"I tell you man niggas now a days are dumb ass fuck they don't think","post_message":"Mannequin Challenge got them busted! #WSHH #Alabama #MannequinChallenge"}]
