[{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"1170750279653754","commenter_b":"Leave, Obama, just leave already. Go live in the ghetto desert with your Saudi prince best friend, before whom you knelt and kissed his hand. And take lying, leftist, socialist Hillary with you, and Bill, too. Don't forget to tell Bill to keep his pecker in his pants. We'll even provide a private jet on Egypt Air for you. In your picture at the Orlando vigil for our citizens you coundln't kneel like you did b4 the jihadist price, you just sqatted like they all do since they all don't have toilets. You are a disgrace and you are one of them!!!","commenter_a":"he is absolutely right","post_message":"When Obama ignored radical Islam, this YouTube star went online and slammed him for the coward that he is. He proved that Donald Trump was 100% RIGHT in calling this ISLAMIC TERRORISM, and we should not be afraid of those words!  Let's get 1,000 SHARES for a man who's not afraid of telling it like it is!"},{"comment_id":"1292836000742177","commenter_b":"Let her out permanently.She will be a bad influence to our children.","commenter_a":"Good!","post_message":""},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"752107674943648","commenter_b":"Loretta Lynch is a corrupt dirty rotten scoundrel is about to be charged herself for crime. Why? Stay tuned for more Wikileaks coming to a theater near you.! Loretta and Obama on the hit list for being nasty dirty people who have smirked and abused their positions in the greatest country. They will meet their maker on earth.","commenter_a":"HilLIARy has already admitted guilt and felonious actions??? She has admitted that her staff reviewed all her emails so they could delete her \"Personal emails\", right? Since this occurred AFTER she left the government, it is an admission of guilt!!! Why? It is a violation of law to reveal or share classified information with anyone that does not have a current active security clearance equal to or exceeding the classification of the material. Further it is required that the person have a \"need to know\" even if they have security clearance. Since her staff has neither a current and active security clearance or even if some did they did not have a need to know. Since it is now known that some of those emails were Top Secret SAP it is virtually certain none of those staff were listed as having access. The argument that none of the released emails ...","post_message":"President Bill Clinton – whose wife is currently in the crosshairs of the Justice Department over her use of a private email server – met privately with Attorney General Loretta Lynch."},{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: \"We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.\""}]
