[{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10155084473033984","commenter_b":"@username yes you are.... it's never enough for you people never enough","commenter_a":"Okay, this is absolutely disgusting and I am appalled by the behavior of these CRIMINALS, but I did not see this much coverage or outrage when those WHITE teen males abused then raped the black handicapped teen with a metal hanger, causing permanent damage to him internally... they were let off the hook by the way. Charges dropped... media barely covered it and there were even people who made jokes about it or defended the white teens... so next time one of you white people wants to cry how white privilege is not real or how the media ignores black on white crimes, think again. These black teens are getting the punishment they deserve while the white teens (that did worse as they caused physically permanent damage) are out and about, as if nothing happened. DISGUSTING","post_message":"This is just sickening and heartbreaking at the same time. We just found out 1 key fact about the relationship between the disabled teen and one of his torturers... and it's absolutely shocking.  Who could be this EVIL?"},{"comment_id":"1014969508525839","commenter_b":"It only matter what the FBI thinks about the emails. It's obvious when obama's FBI investigates it's something serious.","commenter_a":"Socialist nut job or a lying criminal oh the options we have.","post_message":"This is the surprise moment from the #DemDebates everyone will be talking about tomorrow."},{"comment_id":"10153313662524342","commenter_b":"No...not white people get away with murder No white lady who spoke nasty to an officer then killed herself ever got a street named for her... Thats just a black thing Just check statistics n wow Stereotypes proven true;)","commenter_a":"White people issues:/","post_message":"Police say an investigation into a mail theft led them to a drug lab   in a Pearland apartment.  DETAILS/MUG SHOTS --> @webpagelink"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"819559654746124","commenter_b":"PS I certainly hope he doesn't think he's in the same league as Martin Luther King he's not fit to carry his shoes","commenter_a":"MLK Jr. Yes, Al Hell No !!!","post_message":"Martin Luther King, Jr. was a principled Christian who stood for his morals and convictions when fighting the Jim Crow in the Democrat-controlled South. For his courageous efforts, he paid the ultimate price.   Do you support MLK, Jr. and oppose Al Sharpton?"},{"comment_id":"1370428343050216","commenter_b":"Keep this animal in jail","commenter_a":"These two idiots actually represent the sick mentality of the republican party. They are both sick and depraved. What I really find interesting is how much american men admire that behavior and vote for them. They seem to have a lot in common with these two.","post_message":"SPREAD HIS SHAME."}]
