[{"comment_id":"10153117989439342","commenter_b":"Stfu","commenter_a":"Why is this breaking news??? So what!! You glorify more sin than good!! Tell the world about Jesus!! Stop caressing this foolishness like its normal! I see why God clearly warned us not to be of this world!!","post_message":"The first image of Caitlyn Jenner, formerly known as Bruce, has been released by Vanity Fair magazine --> @webpagelink"},{"comment_id":"971724402865796","commenter_b":"Why does having a child who is American entitle one to come to USA to live? Child should leave when parents leave due to illegal status or visa expiration. They can come back on their own when of age.","commenter_a":"this is not all that is in the 14th amendment. It is only a part. there are other antiquated clauses that really formed America after the Civil War. Section 2 guaranteed that southern people would not have a say in politics for at least 2 decades. We have a president now that should be impeached for treason per this amendment, bill Clinton should never had been allowed in politics per this amendment, America's judiciary ignores whatever they want. the entire amendment needs reviewed not just one sentence.","post_message":"This may surprise a lot of liberals and Republicans alike. Spread this everywhere!"},{"comment_id":"10153573437688984","commenter_b":"That makes sense since she's a woman","commenter_a":"Bruce Jenner is a disgraceful, sick, fake excuse of a man. ..","post_message":"Wow. Franklin Graham just made a massive statement about \"Caitlyn\" Jenner on Facebook... now it's going viral.  Nearly half a million people just \"liked\" this post... because it's absolutely perfect.  Spread this absolutely everywhere."},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"10154350184251336","commenter_b":"She won the nomination because of Super delegates like Nancy Pelosi. Should have done in on pledged delegates only. The AP announcing her win the day before the final primaries didn't help, but that was her plan all along. How many Sanders supporters stayed home and didn't vote because of that well planned news flash. This woman will do ANYTHING to get her way. God help us all if this Country elects her as President.","commenter_a":"Killary is done and she knows it!!!","post_message":"“The stakes in this election are high, and the choice is clear. Donald J. Trump is temperamentally unfit to be president and commander-in-chief.”  Hillary Clinton took shots at Trump during her victory speech after clinching the Democratic nomination."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"}]
