[{"comment_id":"1046419898744877","commenter_b":"What a total moron !!! This woman really was an Amb. at one time ,what an asshol. she is !!!","commenter_a":"They already did you cow!!!!!!!","post_message":"Former Secretary of State Madeleine Albright says that \"nobody is going to die as a result of\" Hillary Clinton's emails."},{"comment_id":"654122978061007","commenter_b":"I know you do","commenter_a":"Omg I want to hold one!!! @username","post_message":"PANDAMONIUM: 4-month-old giant panda cubs at The Toronto Zoo are learning to walk."},{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"},{"comment_id":"10153995516108854","commenter_b":"What a dumb whore weasel","commenter_a":"She's an STD waiting to happen.","post_message":"Lena Dunham Compares Rape Allegations Against Bill Cosby To The Holocaust…"},{"comment_id":"10153288020701545","commenter_b":"I hope you never lose your corporate job. And I also hope the minimum wage workers you go to every day for house cleaning, coffee, lawn care and a burger don't abandon you.","commenter_a":"If people work 40 hours a week, minimum wage should cover minimum living expenses. This isn't even a question.","post_message":"The National Restaurant Association says a $15 base wage would force employers to replace workers with technology, such as ordering tablets. \"Fifteen dollars is too far, too fast,\" said spokeswoman Christin Fernandez.  What do you think is a fair minimum wage?"},{"comment_id":"10153978119022690","commenter_b":"I'm a hard working taxpaying citizen and I say every day this is the greatest country on the plant. America is Great proud to be an American.","commenter_a":"It's great for immigrants and illegals. Not for the hard working tax payers that pay for everything they get. And they keep raiding SS to pay for them too what's so great about that?? TRUMP MAKE OUR COUNTRY GREAT AGAIN!!","post_message":"First lady Michelle Obama at the DNC: \"Don let anyone ever tell you that this country isn great. That somehow we need to make it great again. Because right now, this is the greatest country on earth.\" @webpagelink"},{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"}]
