[{"comment_id":"10153304434981770","commenter_b":"She is gross...","commenter_a":"You don't impress me AT ALL.","post_message":"Can you believe she does this to herself?"},{"comment_id":"10153035284712434","commenter_b":"Go move to syria ...bitch","commenter_a":"It is inhuman to turn these people away. The terror experienced in Paris for one night is what they go through on a day to day basis and you want to send them away? Have some empathy, what if it was you and your child fleeing this barbarism? Turning them away is no better than away Jewish refugees during WW2 (see SS St. Louis). How anyone can see their suffering and simply ignore it or tell them to leave defies any and all tenants of a Christian faith, humanity, and what America stands for.","post_message":"How very Christian of them."},{"comment_id":"698436883649598","commenter_b":"What's the deal with these frogs.","commenter_a":"One of his few good decisions. General Mattis is a fucking fantastic choice","post_message":"Trump wants a military vet to be secretary of defense for the first time in over 60 years."},{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"\"I'm asking you to believe... YES WE CAN!\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly \"devestating\" to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez \"should have never been here.\""},{"comment_id":"10153772701693271","commenter_b":"If you look back, I didn't say \"productive\". I said \"meaningful\" and, I'm hardly \"bent out of shape\". Does this effect me personally? Not really. But, it does effect my community/state/culture...whatever you want to call it. A day to celebrate pot? It's laughable to most. You can think I'm ignorant all you want, I still think it's ridiculous. Again, my opinion. Not sure why you feel the need to argue with me.","commenter_a":"Go to work. Volunteer. Do something meaningful. Beyond ridiculous.","post_message":"Denver's 4/20 rally has been rescheduled."}]
