[{"comment_id":"10153272091283271","commenter_b":"lol. And the elephants will inherit the earth and as the most intelligent animal.","commenter_a":"This is why the aliens won't talk to us","post_message":"Kentucky clerk Kim Davis is free as of Tuesday. Former Arkansas Gov. Mike Huckabee stood alongside Davis outside the jail, calling her \"incredibly brave.\" Hear her words in the video. What's next for her career? ---> @webpagelink"},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"1136245463077540","commenter_b":"Amen","commenter_a":"I didn't vote for you the 1st. , or the 2nd. , time! Most all of us True Americans want you out. You, and your Obamanites have done nothing but take America to a all time low!!!","post_message":"YES!"},{"comment_id":"1089067221104747","commenter_b":"it's only good enough for those of us that don't pray to the gun god!","commenter_a":"Republicans; \"Carry a gun everywhere, except near us.\"","post_message":"If conservatives are so convinced that gun-free zones attract killers, then why do so many conservative places and events ban guns?"},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"10153299722707434","commenter_b":"I thought women hated dick pics. ;-)","commenter_a":"Huh. Where are the usual people who attack women for not being cautious enough? If you don't want to have problems, just don't take naked pictures. How dare this guy not take proper precautions around a woman? How dare he get unconscious? Girls will be girls, you know.","post_message":"Compounding an already criminally terrible idea, she sent the photo and video to her coworkers."},{"comment_id":"10152735279906135","commenter_b":"If there were more moms like here this would not be happening","commenter_a":"Good for Mama!","post_message":"\"What the [BLEEP] is wrong with you?\" Baltimore mom gets fired up after seeing her son cause trouble on TV."}]
