[{"comment_id":"517382478450045","commenter_b":"Anyone know whats happening in Europe? Muslim takeover. By sheer numbers they are over running countries and residents are falling back on rioting to fight the takeover. Muslims come into a country and this usually ends up in war and destruction of lifestyles and sovereignities. The US would be better off without them sad to say.","commenter_a":"They have NO BUSINESS in our Government!!!! Stop Muslim Take Over!!!!!!","post_message":"This is not unexpected. Click to Read ALL the SICK Details..."},{"comment_id":"579741315536254","commenter_b":"How is she a bigot? Because you disagree with her. She is speaking the truth. I don't like her method. She be out in front of the building doing this, not in the store.","commenter_a":"Biggest bigot I've seen so far. Who died and made her thee Almighty?","post_message":"The woman, a mother of 12, screams throughout the video and says that she wouldn't spend a penny at Target because of what she calls their \"wicked practice.\""},{"comment_id":"10154268169886409","commenter_b":"You are just like all the other trump bashes before u run your mouth have your facts straight instead what other haters say","commenter_a":"Hitler Trump should be impeached we need to start a petition like the U.K. did to ban him from the U.S. because his a embarrassment. He is the real criminal, he committed fraud, his involved with Putin and hacking the election in his favor, he refuses to show his taxes because he probably commited fraud if he doesn't have anything to hide then he should show his taxes. He did not put his businesses in a blind trust he continues to profit from his businesses while his in office. He hasn't paid taxes in over 20 years you Trumpeters created this monster by continuesly supporting him now his out of control.","post_message":""},{"comment_id":"1166718606737699","commenter_b":"Why?","commenter_a":"Anyone realize some veterans actually support Kaepernick. Also if you think this is the best country in the world you must be ignoring the debt, constant war, and division of society by ethnicity, race, sex, religion etc. that is plaguing this country. So if you think this country is not oppressive then you are wrong. If you think this country represents equality you are wrong. If you think this country represents democracy you are wrong. If you think this country represents the bourgeoisie elite and capitalist greed then you are right and that is why I won't support the flag not to disrespect the troops who died but to respect them because they died only for greed and American imperialism.","post_message":"Allen West Republic"},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"10153371305674575","commenter_b":"Strip the Super Bowl, the ring, one year suspension (if not more) and mega fines","commenter_a":"He makes millions of dollars you think four games is really going to teach him a lesson? Dude strip the superbowl from them. Didn't you learn that a slap on the hand solves nothing!","post_message":"#BREAKING: Tom Brady has been suspended for the first four games of the season for his role in #Deflategate. Among other punishments, the Patriots were fined $1 million.  Brady will return from his suspension the week the Indianapolis Colts take on the Patriots at Lucas Oil Stadium."},{"comment_id":"709751369215441","commenter_b":"Yea I support Texas and believe no Muslims belong in America","commenter_a":"Rigth on Texas","post_message":"Texas is standing up to the invasion of Muslim refugees. Don't mess with Texas. Do you support the great state of Texas?"}]
