[{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."},{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? \"As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.\" - President Trump @webpagelink"},{"comment_id":"1013898135398451","commenter_b":"He'll yes. Put them back in there own country then nukem. All","commenter_a":"Time to fight back.","post_message":"The religion of Peace Strikes again! This time muslim migrants welcome their hosts...   Do you agree we should deport them all!?"},{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"10153513260681770","commenter_b":"I have something to say to this wet back. Guess.","commenter_a":"Yeah I don't like him at all !","post_message":"George Lopez has something to say about Donald Trump."},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"}]
