[{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"1186000464791726","commenter_b":"Rest in peace sir. #endofwatch","commenter_a":"R.I.P.","post_message":"RIP OFFICER PATRICK ZAMARRIPA: Hundreds have lined the highways along the route where DPD Police Officer Patrick Zamarripa's body is being driven to its final resting place."},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"}]
