[{"comment_id":"427202340738140","commenter_b":"Pharmaceutical companies cannot profit so much that's why they do not do what they are supposed to do is protect the public","commenter_a":"Lauren Martin","post_message":"This video is from a new documentary The Culture High which looks at both sides of the marijuana prohibition argument."},{"comment_id":"10154834976184885","commenter_b":"Laws change and some should including this one. At one time I could own a person and woman couldnt even vote 100 years ago. This flag represents the ultimate sacrifice made by millions of Americans including my family. I can guarantee that if I see it I will gladly go to prison to make sure they will never be able to burn another flag.","commenter_a":"It's OK to not pay your taxes, just don't burn the flag.","post_message":"The Supreme Court ruled in 1969 that burning the flag was protected by the First Amendment"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."},{"comment_id":"10153222211323487","commenter_b":"It means there is one more polarizing point between the two major political parties in the US.","commenter_a":"Means America will continue to be bullied and bossed around by Israel. The country that does absolutely nothing for us in the middle east but instigate more war for our men and women to die in. Not theirs.","post_message":"Readers respond to the impacts of Netanyahu's victory."},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."}]
