[{"comment_id":"1442368625820278","commenter_b":"@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."},{"comment_id":"979662915464481","commenter_b":"Shut up bitch","commenter_a":"there is no cure for stupid!","post_message":"Jesse Jackass rides again. Check out THIS crap. UNREAL. @webpagelink"},{"comment_id":"10155648404180354","commenter_b":"Fire the bitch.","commenter_a":"He wasn't rude, she just didn't want to answer his question! She made a very bad decision and now she doesn't want to face the consequences of her stupidity.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10158052080890594","commenter_b":"@username Stop being dramatic. Trump's own wife is an immigrant. The only issue is with those here illegally. They should be deported under existing law.","commenter_a":"As long as you are here legally, there's nothing to fear.","post_message":""}]
