[{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154115958779740","commenter_b":"How is chatting about baseball anything like questioning someone about their personal relationship with religion...?","commenter_a":"If they can't talk about repentance and God then they can't talk about anything else either outside of the law and professionally defined parameters consistent with law enforcement . We can't be picking and choosing what a man can talk about. What? Are we going to ban cops from discussing baseball? What about \"hello Mrs Jones, how's the husband and kids, has Mr Jones been staying sober?\"","post_message":"Should officers be allowed to preach to civilians while on duty?"},{"comment_id":"470911213097172","commenter_b":"Muslims offend me, so I want Muslims banned from America.","commenter_a":"Your face being covered offends me.","post_message":""},{"comment_id":"962901507102931","commenter_b":"Evil mother!!!","commenter_a":"That's just cruel!!","post_message":"This is what happens when a mum feeds her toddler a spicy Jalapeño chilli pepper ... 🌋🔥"},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""},{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."}]
