[{"comment_id":"980529482041405","commenter_b":"She crazy bruh","commenter_a":"She is so confused 😂😳","post_message":"Watch: She has to be seen to be believed. Somebody take away her car keys!"},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition  Via Detroit Zoo"},{"comment_id":"10153198327501051","commenter_b":"Love the whole idea!!","commenter_a":"They have French one's in Canada","post_message":"Are you okay with requiring all businesses to conduct their dealings in English only?"},{"comment_id":"10154774473425575","commenter_b":"@username - islamic women are smart enuf to use these clueless American women to further their islamic agenda. but the women marching think its a march to protest defunding planned parenthood. very sad to be very dumb.","commenter_a":"can the 200K marching women be shipped to syria or where ever hamas HQ is? - lmao","post_message":""},{"comment_id":"607938739358501","commenter_b":"Then dont go watch guadian of the galaxy 2 ..groot hates you!","commenter_a":"Look! Its raw meat! Its eel on the grill.. so it is food! We human are mammal and also carnivore. So eat things raw is a way of eating. Only when you kill for fun and waste the meats of throw away too much leftover then that would consider a sin for others may not have enough to eat! If you think eating thing raw is immoral or gross then throw away your fruits, veggies because they are still living things and have souls and you may not know it! Damn you people with no understanding and misjudgement","post_message":"What. The. Hell."},{"comment_id":"10154603264491756","commenter_b":"That's a huge stretch of the truth but I'm guessing you prefer a plagiarizing lying college drop out \"model\" as First Lady. And who of all people did she plagiarize? Michelle Obama.","commenter_a":"So phony! Had to be distracted since she probably couldn't give much details of the White House since she spends more time at her house in Hawaii!","post_message":"First lady Michelle Obama says she's only been able to \"rock out\" from the passenger's seat of a car one time in 7 1/2 years — when her daughter Malia learned how to drive."},{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"}]
