[{"comment_id":"1028894700543062","commenter_b":"Is that a slit in her dress up to her you know what? Inappropriate for the First Lady. Not running for first slut!","commenter_a":"Moochie, it's gonna take more than $12000.00 to make you the Lady of Camelot.","post_message":"Woman of the People"},{"comment_id":"880895332040553","commenter_b":"@username Didn't you get the memo? Pussy Liberals are NOT allowed to live in Texas... GET OUT","commenter_a":"Thank you @username for picking Mike Pence as you're running mate. Thank you thank you thank you God bless you both","post_message":"Mike Pence won big. We should all be proud of Mike!"},{"comment_id":"1485309454835270","commenter_b":"Yes","commenter_a":"@username are these the leggings you were telling me about?","post_message":"Buyers beware: LuLaRoe is being sued for overcharging customers on sales tax. yhoo.it/2lEtUdq"},{"comment_id":"10153612601766336","commenter_b":"You know they wont. Shes gonna get a slap on the wrist.","commenter_a":"Lock er up!!!","post_message":"The DIA, the NSA, and the NGA, which oversees U.S. government spy satellites, confirmed to Catherine Herridge that the information was classified at the time and remains classified now."},{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"10154436669806509","commenter_b":"Hillary is a lying hag. #feelthebern","commenter_a":"Hillary Clinton is a chameleon. She changes her beliefs faster than I change socks. She's a liar and we all know it. The only supporters she has are middle-aged feminists.","post_message":"Can Hillary Clinton assure voters that, as president, she would not expand U.S. military involvement abroad?   Live updates from #DemTownHall: @webpagelink"},{"comment_id":"866599370042152","commenter_b":"..Immigrants took our jobs? Really? I'll be damned! Well who gave them the jobs in the first place? Employers? They always hired the best I thought. OH! I know, those damned immigrants are the ones that sent our jobs to the Communists too, right? Lol. Watching Professional Bull Riding today. They are all Hispanics..","commenter_a":"If you can't speak our language then go back where you came from and stop taking jobs from Americans","post_message":"Plain and simple.   www.thepoliticalinsider.com"}]
