[{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"},{"comment_id":"10153046284854705","commenter_b":"I wish someone would put that pig back in the barn and close the door. I'm sick to death of her nasty face.","commenter_a":"Who would buy that! ?!","post_message":"Kim Kardashian just out-Kardashian-ed herself."},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."},{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"10153405463063132","commenter_b":"5 year cancer survivor right here. I flew everywhere, because I didn't want to stay at home alone, my guy is a commercial pilot and I can fly for free..so why not?Because my cbc count was low, I had to fly with a mask on, because I had to. I even flew on Alaska airlines from Denver to anchorage. I believe this to be an isolated incident...I was always treated with dignity and respect and allowed to go down first because I said I felt weak..Because I did! So tell me what's the difference between if an elderly person says they feel weak and a cancer patient says it?","commenter_a":"Dear America, your bottom line is not more important than common courtesy or basic human rights.","post_message":"\"We need to make sure that ... corporations aren't so concerned with liability and bottom line that they overlook common sense and common decency.\""},{"comment_id":"836575966473062","commenter_b":"Crooked Hillary is the scum of the Earth","commenter_a":"His campaign is a trainwreck.","post_message":"Meet Trump's new campaign chief: a man whose \"news\" organization, Breitbart, is known for its racist, homophobic, conspiracy-peddling stories."},{"comment_id":"10153265076161602","commenter_b":"They're asking for regulations--there is no compromise from the gun lobby.","commenter_a":"I think we can all agree that there are some people that should not have firearms. However, if you support the second amendment like I do, you need to be part of the solution. Because if we let those that are against the second amendment make the policies, what do you think will happen to 2A? Let's be proactive in this, not reactive.","post_message":"The families made it clear they are not associated with the non-profit Sandy Hook Promise."}]
