[{"comment_id":"1334018773303346","commenter_b":"Lol you need to work a lot harder to be crowded like India or China😂😂😂 but real talk tho, the US is currently taking up way too much resources for it's population. And if this population spikes, there are gonna be some shortages and wars...","commenter_a":"I am against both an my reason is. That our country isn't growing by size but we keep letting in millions every year one day this country will be over crowded like India or China","post_message":""},{"comment_id":"1047364981986697","commenter_b":"I'm sure you told her she could take as much time off as she needed. With pay. Heck, you probably promised her time and a half pay while she was on leave. Extra Holiday pay. The Government will start a college fund for the little toddler, paid for by the 1%. Free daycare too while mom runs errands. Don't even bother going back to work until the kid is in college, we'll still pay you. Anything else?","commenter_a":"I agree with Hillary, it IS time for a women President, just NOT her!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10153206578922483","commenter_b":"Lol Caitlyn, you poor misguided... Whatever you are. I can't tell if you're a child or just an uneducated woman.","commenter_a":"But, muh freedoms...","post_message":"Angered after an argument over his smoking, the customer went to his vehicle and retrieved a 9-mm pistol, which he used to shoot the employee once in the head, according to reports."},{"comment_id":"10153679733478967","commenter_b":"People really do get butt hurt in SF","commenter_a":"Carlos Salazar","post_message":"Well this didn't go very well."},{"comment_id":"963407697102775","commenter_b":"she wont get elected,,,she will be placed! Voter Fraud accomplishes much! Thats why she is not worried about winning","commenter_a":"If she does get elected, invest in body-bag manufacturers....guaranteed 1000% return on investment assuming you don't get killed by her goons.","post_message":""},{"comment_id":"10154115326121341","commenter_b":"Simply put - Hillary Clinton is a criminal, and she'll never have my vote","commenter_a":"All lives matter... Sorry but those who still support this man do not see that he is destroying the Democratic Party... For what? He will not be POTUS. For his moment of fame. He is giving Trump an edge in the elections! It is time haaretz realized this!","post_message":"The most successful Jewish presidential candidate in American history is saying that Palestinian lives matter. And he daring Hillary Clinton to disagree."},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."}]
