[{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"1868656350045137","commenter_b":"Jealous lady...","commenter_a":"Whiney baby","post_message":"So great!"},{"comment_id":"1444134625606563","commenter_b":"Lay off the booze lady","commenter_a":"Michelle Obama plagiarized Saul Alinsky for her 2008 DNC speech never once attributing her words to his writings. Would seem Michelle gets a pass when it comes to plagiarism, everyone else gets bashed.","post_message":"\"I'm a speechwriter. This is what speech writers do. You're looking for something improper, I don't see it.\""},{"comment_id":"10153395223571336","commenter_b":"Pull up your skirt and grow a pair .","commenter_a":"I'm not Mexican but his comments were offensive. There are many honorable Mexican Americans and his words disrespected all Latin Americans. I happen to be a conservative republican, and in favor of tightening up the border issue. Donald Trump is an emotional and impulsive idiot and we don't need that in the White House. We need someone that will unite us, not separate us.","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States.    Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin.  So, how has racism changed over time?"},{"comment_id":"1027028344015468","commenter_b":"Then slapped it in the face with my dick","commenter_a":"But if it was an Airman that got jumped the Marines would be applauded.","post_message":"We're on the look out for two scum bags who jumped a Phantom Fury vet in a case of mistaken stolen valor. If you have any information, please message the page, and we'll take care of the rest. Any factual information provided, leading to an arrest, will earn you a free Funker530 \"Winning Hand\" T-Shirt. ~Josh"},{"comment_id":"10153907055674199","commenter_b":"She's a straight up hood rat.","commenter_a":"I normally don't comment on things like this, but she has to be very cold hearted to cheer the death of anyone. The actions of some do not represent all. #alllivesmatter","post_message":"\"This behavior is unacceptable & does not represent our brand's values & ethics. The franchisee has terminated the employee.\""}]
