[{"comment_id":"10158517971145725","commenter_b":"Another triggered cornflake with vagina envy","commenter_a":"You could fill 2 grand canyons with the amount of leg and vagina hair at this march","post_message":"Despite organizers saying the Women's March on Chicago was too big to march, demonstrators are on the move.   Live updates: nbcchi.com/lsLGCKs"},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""},{"comment_id":"1295020463887979","commenter_b":"hes already done good and not even president yet","commenter_a":"Where is your white racist president that said he was going to send them all back out of the United States our country????","post_message":"Yikes..."},{"comment_id":"694737757326072","commenter_b":"Unemployment is down because you can't get it silly woman.","commenter_a":"That's all of ya dumbass president who ya voted for should've just kept the house republican","post_message":"WHAT?!??!!?"},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"},{"comment_id":"10153137257982869","commenter_b":"Mr. McCain should not have called Trump backers, \"crazies\" but I dont hear any of you calling him on that. I like you Mr. Huckabee and would vote for you but understand that Trump is saying what we want ALL of you to say, the truth! McCain can no longer ride on his service alone, he is an awful senator and has done much to hurt veterans today!!!!","commenter_a":"I agree! I respect him for my freedom! He has been outspoken about issues I agree with - don't know what will steer our country In the right direction. I know we need prayer first! Who loves America the most should be elected! I love my country and love it's history! To all who love our red, white and blue!","post_message":"John McCain is an American hero. When our troops return from combat, they should be treated with the utmost respect and admiration. Every breath I breathe and every step I take is free because of brave Americans like John McCain."},{"comment_id":"10152733923177217","commenter_b":"Probably think females don't know anything about cars.","commenter_a":"Another keyboard warrior.","post_message":"TV presenter in Twitter break after Top Gear \"threats\""}]
