[{"comment_id":"1202133839801897","commenter_b":"Charley, you are a part of Racist America too !","commenter_a":"Republican piggish bigoted racist' hate !","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.”  Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"510825025771036","commenter_b":"Exactly!","commenter_a":"The Greatest Good Common Sense is being questioned. Hope these will be at the FUNERALS of those killed by their bad rhetoric.","post_message":"Dr. Ben Carson weighed in on President Barack Obama's open door policy to refugees. What do you think about his comments?"},{"comment_id":"655073504617242","commenter_b":"She will try anything, needs to get a life","commenter_a":"LOONY TUNES HILLARY...........GO HOME BEFORE TREY GETS TO YOU............","post_message":"The Clinton campaign thinks members of the electoral college should receive a national security briefing about Russia's involvement in the election before casting their votes for president.   Is this a good idea, yes or no?"},{"comment_id":"583797651802114","commenter_b":"Women Willing To Bern In Hell For Bernie Women Willing To Bern In Hell For Bernie sounds like a cult, kinda like Scientology.....","commenter_a":"The corporate owned media won't change their narrative about Clinton because for the most part, they are still run by straight, white males who must keep the myth alive that an ambitious woman is dangerous and there must be a negative reason behind her ambition.","post_message":"Let this sink in."},{"comment_id":"10152941725546051","commenter_b":"I feel for him. The cops and courts don't help. He stopped him once and for all.","commenter_a":"I would have done the same ~ if our laws were CORRECT pedophiles wouldn't be as big a problem! He should NOT be the one in jail !","post_message":"“I just want you to know, I ridded one less (expletive) child molester from the (expletive) earth that (expletive) with my little brother,” he said. “Alright? That's all I got to say. I don’t give a (expletive) how much time they give me. Doing time is the easy (expletive) part.\""},{"comment_id":"10153835564541002","commenter_b":"@username, LEAVE then!","commenter_a":"What happen to \"Land of the free\" ?","post_message":"President Barack Obama suggested maybe it's time to make voting a requirement.  Share your thoughts on this idea -- good idea or bad idea?"},{"comment_id":"616279121877054","commenter_b":"@username not all people who are unemployed are \"deadbeats\".","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."}]
