[{"comment_id":"670200283170550","commenter_b":"Yeah,Yeah,Yeah...I keep hearing this on FB but NOT anywhere on any news network....I just HOPE this true and NOT a fantasy!","commenter_a":"The sooner the better!!! Hopefully he will take Biden, Kerry, Pelosi, Killary, Harry Reid, Al and Jesse with him when he goes. Preferably out of the country. Let them go live with the Muslim terrorist that they love so much.","post_message":"Obama's time in the white house could be coming to a screeching halt.  This is the best news of the year. Get rid of him.  Would you be happy if Obama was forced out of office?"},{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."},{"comment_id":"599509270200252","commenter_b":"THE ALPHA MALE !","commenter_a":"South Carolina here comes TRUMP. Let's work together and get this man elected as President of USA. United we Stand!!","post_message":"Departing New Hampshire with my amazing family! THANK YOU- NEW HAMPSHIRE! Tonight the VOTERS decided. Next stop is South Carolina! I LOVE you ALL & THANK YOU! Together we are GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153383091468984","commenter_b":"If her mouth is moving she is lieing.","commenter_a":"She will say and do anything to get back in the White House but she really belongs in jail","post_message":"I can't believe she tried to pass this off as fact. Even Bill has to be shaking his head about this one...  Do you think Hillary has a problem being honest?"},{"comment_id":"10153651600041323","commenter_b":"Because she's British William!!!!","commenter_a":" for rent for the big fat cunt to have axcess to a private pool what other perks did the rest have its just away of mugging the goverment and dickheads for money charity begins at home.","post_message":"“I’m a mother. My heart bleeds. Just because we live in a poor area. Is this what they want to do with us? The government don’t care. Nobody will listen. They don’t care about us. Only God cares.”  It is six weeks since Kids Company abruptly closed its doors; since then several inquiries have been launched but little has been heard from the people who once relied on its services."},{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"10156372477690725","commenter_b":"Just another day of gun violence in America while populace is politically (incorrectly) correct. It is a crippled world, American leading the way as it is not in most other categories! Muslims are top o' the list for violence...they can't convert us, so their gut wish is to kill! Facts speak for themselves!","commenter_a":"Trump 2016","post_message":"CRIPPLED AMERICA is perfect gift for friends & family. Order signed copy & join me tonite live streaming 7:30."}]
