[{"comment_id":"684886304977884","commenter_b":"I wonder the same thing when I see those clowns busting out the tricorn hats and teabags.","commenter_a":"Don't these people protesting have jobs?","post_message":"I wish there was a LOVE button on Facebook."},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"10153933617414411","commenter_b":"Go fuck a pig!","commenter_a":"This is what happens when Islam gets a hold of a country. Back to the dark ages we go","post_message":"BREAKING: 8 coalition troops killed across Afghanistan"},{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"10154732148698961","commenter_b":"You recently proclaimed that you would rather see a move toward screening and the passage of more gun control. Are you serious? American citizens are being raped and murdered by illegal aliens streaming into our borders and you want them all to come on in, collect benefits paid for by American taxpayers, yet take away guns that can protect us from these illegals. You are a very disturbed person and even worse are those endorsing you and voting for you. It's a state turned upside down by liberal sycophants.","commenter_a":"Senator Murphy, how about a little get together down here in the New Haven area?","post_message":"A huge THANK YOU to everyone who came to the town hall tonight. For those who couldn't join, check out the full video here."},{"comment_id":"367783356938627","commenter_b":"McDonald's drive thru but taco bell taco...hmmm🤔","commenter_a":"China Navarro Faviola Quiralte @username Natalie King","post_message":"Gotta be more specific  #WSHH"}]
