[{"comment_id":"1022105807844423","commenter_b":"@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"},{"comment_id":"10154410865644091","commenter_b":"He better be ready for BIG POPPA'S in jail bc there gonna rip his A$$ for raping those little angels...Let's see how he likes it now! #ThrowAwayTheKey","commenter_a":"I hope you get yours in jail you pos","post_message":"JUST AWFUL: This Long Island man is accused of raping 2 young girls -- ages 6 and 7."},{"comment_id":"963078257120853","commenter_b":"She's an ass","commenter_a":"Idiotic.","post_message":"Hillary Clinton says allowing 10,000 Syrian refugees is a \"good start\", but she wants to bring in 6 TIMES that number."},{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"583491245168645","commenter_b":"Yup @username, same old Hillary, will say Anything. Flippity Flopping as usual.","commenter_a":"Well Hillary Wallstreet Clinton, your group phot does Not contain any Important popular opinions!! Now on to a question for you. If Nothing to hide regarding your emails, why would you destroy evidence after a Subpoena? Why did You lie to Congress and the FBI? Why did your aides plead the 5th? Why did some of your aides receive Immunity? Why did you recently Under Oath answer 21 questions with,(I Don't Recall ), and other questions with,( I Object) ? These Issues are VERY CONCERNING, and you're Ignoring these!!","post_message":"Nobody knows better than these five people what it means to be president—and not a single one of them believes Donald Trump has what it takes to do the job."},{"comment_id":"1171823469552530","commenter_b":"Says the self loathing woman...","commenter_a":"Go find your safe place and cry. Omg please. Give up already Donald j trump is the president","post_message":"What do you make of this? These celebrities are among the stars taking part in a telethon airing on Facebook Live during Donald Trump presidential inauguration, which will raise money for Planned Parenthood and the environmental group Earthjustice."}]
