[{"comment_id":"1248799051839522","commenter_b":"Sue her!!!!!","commenter_a":"I didn't even read it","post_message":"You've got to be kidding!"},{"comment_id":"10153883413908797","commenter_b":"Wayne if weren't a firefighter then don't offer an opinion you don't know anything about, the twit woman had it coming!","commenter_a":"They didn't have to do it. .could've went over her car and just give her a ticket","post_message":"DRASTIC MOVE: Look close. That’s Yasmine’s car. The windows are smashed and a fire hose has been pulled through it. Firefighters say they had to do it to get to a house engulfed flames. And they point to what Yasmine did just minutes earlier as the reason. Do you think she has any right to complain?"},{"comment_id":"10153933179656509","commenter_b":"Lol see what I mean? \"White people do this all the time.\"","commenter_a":"Who could do such a thing? I don't want to hear that mental illness mess either. Lethal injection time.","post_message":"The suspect broke into the house and handcuffed the victims in their bedrooms -- and then shot them, authorities said. @webpagelink"},{"comment_id":"10152612105311636","commenter_b":"Stupid women","commenter_a":"Because it causes serious mental health pronlems","post_message":"Remind us why this isn't legal in the UK again?  via Independent US"},{"comment_id":"1146806995375828","commenter_b":"Only lesbians are voting Hillary","commenter_a":"#Hilary said she going to let her husband run the economy.... Way to go #feminists set back 50 years in one sentence...epic fail #TRUMP2016 pls share","post_message":"We just won Kentucky! Thank you to everyone who turned out. We’re always stronger when we’re united. hrc.io/1WDpty0"},{"comment_id":"10153333178554087","commenter_b":"Guess what Kerry illegals have no constitutional right to stay here either.","commenter_a":"Except for a little thing called the Constitution. And laws. I didn't notice the call to shut down churches after the white Christian kid walked into a black church and executed parishioners","post_message":"“Nobody wants to say this and nobody wants to shut down religious institutions or anything, but you know, you understand it, a lot of people understand it,\" Donald J. Trump told Sean Hannity. \"We’re going to have no choice. There's absolutely no choice.\""},{"comment_id":"10153764021131509","commenter_b":"And as far as white women go.... I've quite seen a few black women with arm pits and legs full of hair. Jus sayin..","commenter_a":"WHITE-WOMEN! Tryinna start a trend....","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"}]
