[{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."},{"comment_id":"1841509832747191","commenter_b":"Cause you are a psycho bitch..","commenter_a":"because your a lying sack of shit!!","post_message":""},{"comment_id":"10153811917026162","commenter_b":"Uhhh no!","commenter_a":"@username @username told me you like spiders!!","post_message":"NIGHTMARE FUEL: A puppy-sized spider with fangs strong enough to punch through bone is discovered in the South American rainforest.  For stories you care about -- \"Like\" ABC 7 Chicago!  PHOTOS: @webpagelink"},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued \"for the prevention of fevers and treatment of dysentery.\"  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."},{"comment_id":"10156349678780354","commenter_b":"They can cut off their cocks all they want. DNA will still say male no matter what. Liberals always want to Goto science to try and disprove the Bible but don't with this sick shit. God bless Texas for taking a stand!","commenter_a":"I'll show you mine if you show me yours. President Obama said it's perfectly alright.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"10153641200792235","commenter_b":"Fame whores","commenter_a":"Take your pick...lol","post_message":"Petty, childish and HILARIOUS all at the same time!"}]
