[{"comment_id":"10153879601166545","commenter_b":"Thugs.","commenter_a":"Sometimes it's the company you keep, parents need to know who their kids are hanging out with...and for the people with the insults etc it could be very well your child, then you would think differently, and you will still be help accountable for your ill words against another.","post_message":"Arrest warrants have been issued for three more teens believed to be connected to the Aug. 2 robbery."},{"comment_id":"10157180953385389","commenter_b":"she's a waste of skin!","commenter_a":"Oh, that was an Economic Speech. I did not hear anything of her plans for the economy but she was well studied on what she thought Donald J. Trump might do. Why will she not tell us her own plans?","post_message":""},{"comment_id":"1385848588104594","commenter_b":"@username orange anus.","commenter_a":"Karma is a bitch. What goes around, comes around. Your day will come, cheeto face, orange anus.","post_message":"UPDATE: Following the publishing of this article, Fox 2 posted a follow-up story saying Mike Hager, who said his mother passed away of a medical condition after being denied entry to the U.S. despite holding a green card, lied to their reporters.  Hager's mother died five days before the ban went into effect, with Trump's de facto Muslim ban playing no role, Imam Husham Al-Hussainy told Fox 2."},{"comment_id":"712544572223659","commenter_b":"The devils soldiers are out of control.beating and killing everybody.And they're not going to stop until we start fighting back","commenter_a":"That pig had wonderful training---can't ya see that?","post_message":"The police officer accused the man of a DUI - driving while drunk. He didn't realize that the man was having a stroke. When he didn't answer (because he was HAVING A STROKE), the officer beat the living hell out of him!"},{"comment_id":"10153584221598352","commenter_b":"Throw her dumb ass in jail.... She'll get a lot of attention","commenter_a":"Aye u had sum true to heart good ass friends. U messed up big time","post_message":"Fraudster who made her friends shave their heads in her honor after claiming she was dying of cancer admits she made it up for attention"},{"comment_id":"10153410521706336","commenter_b":"She is so dirty.","commenter_a":"Wonder why .. lol","post_message":"New documents released by a federal court show President Barack Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack – but the contents are being withheld by the U.S. Department of State."},{"comment_id":"10154061329228352","commenter_b":"Fucking neither of them. Both pieces of dog shit.","commenter_a":"These two look alike younger you vs newer you ewwwww","post_message":""}]
