[{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"10153153254808822","commenter_b":"You mothersfuckers are assholes","commenter_a":"5 kids and pregnant at 26? Jesus.","post_message":"Targeted or a random act?  Police are trying to figure out why someone shot and killed a local mother of 5, who was also pregnant."},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"10153279901571955","commenter_b":"Good! You made that bed now sleep in it scumbags!","commenter_a":"Excellent! Expose the darkness, Lord of Light.","post_message":"Hacked Adult FriendFinder database reveals extramarital affairs of millions"},{"comment_id":"10154521229303318","commenter_b":"Start building the wall","commenter_a":"The idiot has border fences all along southern Mexico whats that for. They think they can just come to America an send the money back.","post_message":"Mexico's president just cancelled his meeting with President Trump.  He told Trump Mexico \"does not believe in walls\" and \"demands respect.\"  Do you support or oppose Trump's dedication to the wall?"}]
