[{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"10154212521629087","commenter_b":"The best present she could give America would either be a full confession of her crimes or better yet, get a pistol, load it, put it in her mouth and pull the fucking trigger.","commenter_a":"I believe it was the other way around. Liberal loons twisting facts to make it look good for them. Lol. Happy birthday Hillary! The best present you can offer to the American people would be to quit! :) #NeverHillary!","post_message":"\"Can we call Megyn Kelly’s total obliteration of Newt Gingrich on live television the kick off to Hillary Clinton’s 69th birthday celebration?\""},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's \"Saturday Night Live\" after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"10153299711818037","commenter_b":"We'll have the latest on @username @ 5. New reports say 60 dead.","commenter_a":"Silvia, so glad yall are already back, scary 😁","post_message":"UPDATE: Paris police prefect Michel Cadot said all the attackers are believed dead, although authorities are hunting for any possible accomplices."}]
