[{"comment_id":"10153645551275575","commenter_b":"Who cares about Mexican officials ? Why don't they keep their people there in Mexico ?","commenter_a":"I STAND WITH TRUMP!!!","post_message":"Sounds like a good idea!"},{"comment_id":"1713481288905957","commenter_b":"@username...does that include the Canadian illegals that are here?","commenter_a":"But trump supporters are racist!! The only racist people I see are the one rioting at trump rallies!! You don't see that type of behavior at Hillary or Bernie rallies","post_message":"Protesters attacked Donald J. Trump supporters on the sidelines of a San Jose rally Thursday, in a raucous scene where a dozen or more people were punched and at least one woman was pelted with an egg."},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"\"You're going to have a deportation force, and you're going to do it humanely,\" Trump says."},{"comment_id":"10154162450013812","commenter_b":"This alone would make me patronize your establishment on a regular basis.","commenter_a":"I salute you! way to be a decent human.","post_message":"Pizzeria owner makes it a point to hire workers with disabilities: \"We did it because it needed to be done. There are no jobs out there for these kids, so they are being prepared for nothing.\""},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"\"I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.\" —Hillary"},{"comment_id":"697292770461301","commenter_b":"I hope you're right Jim!! God help us all if she gets in!!","commenter_a":"She is a major disgrace to the Democratic party. If she is all they got, Forget next year's election. They don't a chance in hell.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"}]
