[{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after \"hundreds of Taliban fighters\" attacked the police compound, officials said. @webpagelink"},{"comment_id":"10153373281922434","commenter_b":"@username debates anything that's pro-woman.","commenter_a":"Why should I believe a man who says, \"Fighting for us\"? Women are an afterthought in those situation, a \"rising tides lifts all ships\". I have never bought that line in total. If you say a man can fight for women, then a women can fight for men. Men need to deal.","post_message":"\"Consider her slogan, 'Fighting for us.' For many men, this slogan would have to be experienced as emasculating. A woman fighting for them?\""},{"comment_id":"988941504498931","commenter_b":"@username c'est beau...","commenter_a":"@username Let them","post_message":"'I love you, wait for me, I'll be there soon'"},{"comment_id":"1657355931148625","commenter_b":"We are armed. Don't kid yourself Mitchell. The difference is that we would take up arms to protect the land by preventing poaching, over-grazing and unsustainable resource extraction, whereas these fucks want unregulated access to sensitive ecosystems.","commenter_a":"Oregon is an open carry state. These Militia men aren't doing anything wrong. The BLM outpost is on public property and was unlocked. There was no violent takeover. They are protesting just like the black lives matter movement that all you libs support The only difference is these men are willing to fight for their land","post_message":"\"We're planning on staying here for years.\""},{"comment_id":"10153840727706341","commenter_b":"Not allowed in Israel!","commenter_a":"Hmmmm,its agreed if the Arab (Muslims)will condone their daughters marrying a Jew husband.But how about the Jews too?will they agreed their daughters to marry an Arab?","post_message":"More than half of the French-Muslim adults surveyed would react positively if their daughter married a Jew."},{"comment_id":"10158125601040615","commenter_b":"America could only be so lucky.","commenter_a":"I think Trump is now afraid somebody just may be planning to 'take him out'. He should have thought of that before.Oh, yes, I forgot, he doesn't have a working brain!","post_message":"But..."},{"comment_id":"10154282422068128","commenter_b":"\"So Veli, I saw an article about you in the WSJ today...\" Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,\" it turned out she was computer."}]
