[{"comment_id":"10155084473033984","commenter_b":"@username yes you are.... it's never enough for you people never enough","commenter_a":"Okay, this is absolutely disgusting and I am appalled by the behavior of these CRIMINALS, but I did not see this much coverage or outrage when those WHITE teen males abused then raped the black handicapped teen with a metal hanger, causing permanent damage to him internally... they were let off the hook by the way. Charges dropped... media barely covered it and there were even people who made jokes about it or defended the white teens... so next time one of you white people wants to cry how white privilege is not real or how the media ignores black on white crimes, think again. These black teens are getting the punishment they deserve while the white teens (that did worse as they caused physically permanent damage) are out and about, as if nothing happened. DISGUSTING","post_message":"This is just sickening and heartbreaking at the same time. We just found out 1 key fact about the relationship between the disabled teen and one of his torturers... and it's absolutely shocking.  Who could be this EVIL?"},{"comment_id":"1044972152190462","commenter_b":"My penis book says the penis breaks off and swims after her! !Get away from me you dick!!","commenter_a":"lol","post_message":"Via Sciencegasm."},{"comment_id":"10154228784001378","commenter_b":"Yes ty @username I did","commenter_a":"@username did you get one yet?","post_message":"The Hatchimals are coming! The Hatchimals are coming! Target has announced that a new shipment of the hottest toy of the holidays will be popping up in stores nationwide starting today. Are Hatchimals on the list this year?"},{"comment_id":"525608654307175","commenter_b":"Have dreams that often come true about other people.","commenter_a":"How do you know if you have a gift? My husband thinks I am a empath... I feel energies but don't know how to interpret them.","post_message":"We LIVE with Theresa Caputo! Send us your questions for the Long Island Medium."},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"}]
