[{"comment_id":"10153507396631323","commenter_b":"She wears real fur....therefore she's a selfish bitch with no regard for the lives of others. I've never liked her. Seems I'm not alone in that here.","commenter_a":"I really couldn't care less about her, she's contributed nothing positive to this world.","post_message":"Why do newspapers hate Kate Moss so much?"},{"comment_id":"10153664920821636","commenter_b":"The appointment of this known Moldovan pimp and thug proves beyond any doubt that the so called \"Jewish state\" is actually a fascist state built on violence ,murder and colonialism.","commenter_a":"Hitler would be so proud of these two!!","post_message":"In 2016"},{"comment_id":"10153060758061162","commenter_b":"What?","commenter_a":"i tink he looks cool and should have done the other side too","post_message":"SENTENCED: A man nicknamed \"Eyeball,\" because of a face tattoo that included the whites of his right eye, is sentenced to 22 years in prison for shooting an Alaska police officer.  PHOTOS: @webpagelink"},{"comment_id":"500239873497639","commenter_b":"Quit calling them mulims call them moslems, it is derogetory","commenter_a":"Amen.shut our borders down..asap","post_message":""},{"comment_id":"1191489804269278","commenter_b":"angelina illegal aliens? they want nothing more than death? you are so ignorant!! i dont recall illegals shooting up schools bombing up marathons or commiting any acts of terrorism. People like you make me sick. People dont come to this country to just commit crimes they come the same reason you or your ancestors came. your opinions are ignorant af","commenter_a":"America is now the land of sore losers and cry babies!!!","post_message":"Workers remove the Trump signage from 3 Trump Place apartment buildings in New York City after successful petition calling for removal. @webpagelink"},{"comment_id":"470081979849049","commenter_b":"Sure try take away all our guns but let the criminals still have them way to go","commenter_a":"Terrible First Lady","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153624598653132","commenter_b":"Shoot, I'd feel sorry for the plants. She should have to work with people who are just like her. They can take jabs at each other all day. What a bunch of douche bags. And the doc himself needs to get a backbone..you can tell he's only going along with her ridiculous antics.","commenter_a":"How did he still have his cellphone during surgery","post_message":"The patient used his phone to record the instructions the doctor gave him for post-surgery care, but ended up taping the entire procedure - and what he heard shocked him."}]
