[{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"1596643573967911","commenter_b":"She is a liar and should be behind bars!","commenter_a":"#Sethrich","post_message":"WATCH LIVE: Hillary Clinton reveals economic plan in Michigan — how will it differ from Donald J. Trump's?"},{"comment_id":"10153698610918132","commenter_b":"She is a jerk","commenter_a":"Yeah, God forbid anyone may ever be inconvenienced. Typical Americans -- it's all about ME ME ME. \"Oh my gawd! My dinner was ruined because a toddler was crying! I want my money back! Boo hoo!!!!\"","post_message":"Nope, not sorry."},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10153656357399726","commenter_b":"Gray is a puss !","commenter_a":"Not just NO but Hell No! Graham cracker thinks alot like Obummer!","post_message":"Should Ben Carson apologize?"},{"comment_id":"1324643474244952","commenter_b":"Do you need money?","commenter_a":"We're going to get back at a companies CEO for endorsing a different candidate by buying their product! Genius! I'm a registered Democrat. Why don't you throw some money at me while you're at it. Morons.","post_message":"Supporters of Donald J. Trump are getting back at Starbucks but putting the President-elect's name on the company's cups and filming any barista who refuses."}]
