[{"comment_id":"1941882042704784","commenter_b":"And some will just because it's a female!!","commenter_a":"I'm speechless!!! It's incredible what that vile woman has gotten away with! I've lost all hope in this government and country! It's bad enough she's gotten away with MURDER but to think of the multitude of fellow Americans who'll vote for her is an atrocity!!","post_message":"\"Yes, [Donald J. Trump] is far better to be commander-in-chief than Hillary Clinton in my mind. I don't think Hillary Clinton is going to do any of the things we need to do to get this country back on the right track. More importantly, I think she has been holding herself to a different set of standards, and I don't think that is representative of what we want to see in the White House.\" — Speaker Paul Ryan"},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"1720797558169853","commenter_b":"LOL.... The immigrants steal our jobs.... even our speeches!","commenter_a":"She did a great job last night!","post_message":"Join me behind the scenes at the 2016 GOP Convention -- as I introduce our next First Lady of the United States of America, Melania Trump! #MakeAmericaSafeAgain"},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"10153979570636378","commenter_b":"@username shut your trashy face","commenter_a":"Hey NFL PLAYERS, you guys got something you can do before the game to protest the mistreatment of POLICE OFFICERS??? HMMM??? Yeh, nothing, I thought so....","post_message":"DEVELOPING: Seven people were shot, including two police officers, after an ambush-style attack that led to a fatal shootout in West Philadelphia. A civilian and the gunman are dead. --> @webpagelink"},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"1172756092797846","commenter_b":"Shame shame shame","commenter_a":"Why?","post_message":"What do you think of the decision?"}]
