[{"comment_id":"457420381115209","commenter_b":"NO Never they Are NOT The Only Ones With Slavery in their History/Background Stop the Hate All People in JESUS NAME Ps139 Amen","commenter_a":"Hell no","post_message":"Should Blacks Be Compensated For Slavery?  Comment 'yes' or 'no'."},{"comment_id":"1239107352812458","commenter_b":"And you sir are an idiot","commenter_a":"There is a way to stop and fire Donald Trump is vote against him Donald Trump you are fired ========= Vote blue up and down the ticket==================== ==========hillaryclinton.com for more information, let's unite our voices and vote blue up and down the ticket. I'm an official member volunteer online for @username.","post_message":"Our planet's future depends on the decisions we make now."},{"comment_id":"10158146730430354","commenter_b":"@username pay up bitch @webpagelink","commenter_a":"No way. Not a sanctuary city.","post_message":"***BREAKING***"},{"comment_id":"10153576489935667","commenter_b":"Their aliens","commenter_a":"I wonder what it looks like now","post_message":"Experts have yet to identify their breed but guess they could have a bit of wild cat in their DNA."},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"10153875546363352","commenter_b":"Smh girl please...","commenter_a":"Let's see how much he's kicking out for a settlement","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"1391527697542910","commenter_b":"She's a self-serving, self-promoting blowhard who couldn't care less about anyone but herself.","commenter_a":"Hillary Clinton may have been investigated by the FBI, but Jill Stein has a fucking arrest warrant out on her, yet she still thinks she's a plausible option.","post_message":"Memo to Dr. Jill Stein: There's nothing \"progressive\" about saying that Hillary Clinton is more dangerous than Donald J. Trump, or that Bernie Sanders is a political insider, just because they don’t pass your purity test."}]
