[{"comment_id":"10150668295129999","commenter_b":"She ugly","commenter_a":"Colleen Crann Generation Z is going to college.","post_message":"“In short, there’s a strong ‘you do you’ ethos among teens today.”"},{"comment_id":"10153031134771051","commenter_b":"She should have kicked on his teeth. What an asshole.","commenter_a":"And a bunch of guys rush over to help HIM? Whee were they when she was defending herself?","post_message":"This waitress walked over to give a customer the bill. That's when he decided to grope her. Bad move."},{"comment_id":"10153478899444342","commenter_b":"Liberals are actually MURDERING people with their stance. The liberals are the real murderers. Did I say that ENOUGH? @webpagelink","commenter_a":"I am not a veteran. These are Christopher's words Christopher Allard 23 hrs · Edited · I don't typically go on rants or express my political beliefs here, but I just have to get this off my mind. As some of you know, I'm active duty Army. Aside from that, I am a medic. I've spent 3 years of my life overseas in both Afghanistan and Iraq. I've seen some pretty atrocious sites caused by war, from both sides. I've picked up blown up body parts of friends and I've saved the lives of guys who were trying to kill me and my guys right before I was keeping them from their 72 virgins or whatever they believe awaits them on the other side. Here is an unbiased truthful view to the Syrian refugee situation. My first deployment to Iraq, in 2006, my unit voluntarily ran a childrens burn clinic ...","post_message":"President Obama is vowing to veto a bill from House Republicans that would increase screening for Syrian and Iraqi refugees before they enter the United States. #abc13"},{"comment_id":"1167989119901455","commenter_b":"How do we know that it is a woman makig the comment?","commenter_a":"Looking his wife in the eye and saying thank you when she hand him a coffee might be a good step towards rebuilding intimacy.","post_message":"\"Honestly, I want to feel that we’re not just roommates—that we’re not just waiting for the kids to grow up so that we can move on.\""},{"comment_id":"10155472723180603","commenter_b":"Girls what happen to being ladies?","commenter_a":"Inexcusable! They should all be expelled and forced to repeat the school year...","post_message":"\"'All these other girls started jumping off the table into the fight,\" said 10th grader Raejah Bratcher. \"Everybody started screaming and people were on each other's backs. Everybody was just fighting, people running in, getting hit, and running out. It was crazy.\""},{"comment_id":"1730793227218701","commenter_b":"My dad years worked in the fields of Arizona I whent with him knights we would spent checking the water pipes it's hard work but he was a proud man I learned a lot from him the truth is they won't last a night it day in the fields they beg that's all they do lazy","commenter_a":"Yeah right !","post_message":"They wouldn't last a day!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10150900817029999","commenter_b":"Well Said and Thank You!","commenter_a":"Have the rest of you bothered to read his comments? He says he does not hate the flag. Does not hate America. He doesn't sound \"spoiled\" to me (and I am an affluent, old, white guy). He has used his position to stimulate conversation about a very important issue. (Why IS it that a lot of black people out for a walk end up getting shot without many repercussions?) I like the guy (except when he plays the Broncos!)","post_message":"Colin Kaepernick explains his protest against racial injustice.  Read more: @webpagelink"}]
