[{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"10153059830708984","commenter_b":"F--k her, no I wouldn't","commenter_a":"Are you kidding?","post_message":"I can tell you right off the bat that I WON'T be participating in this. But I am not surprised to see this from Dems. Every chance they get..."},{"comment_id":"1030700923658691","commenter_b":"Muslim invaders go back to your own country your not wanted here !!!!","commenter_a":"And just what the hell have you Muslims done to get rid of Isis who hijacked your religion?","post_message":"UNREAL: Dearborn Muslims Protest In Support Of Syrian  And Against  In America  @webpagelink"},{"comment_id":"10153411176356509","commenter_b":"I dont see any woman winning nothing by -coming forward- for the lack of proofs Cosby won`t face any compensation neither sentence, but it is a considerable quantity of womens telling the same, you figure it out ...","commenter_a":"Why are they all remembering it now?","post_message":"Heidi Thomas, who was an aspiring actress when she met Bill Cosby, is coming forward about a secret she says she has been holding for 30 years. This story contains graphic language:  @webpagelink"},{"comment_id":"1684672748486504","commenter_b":"Just what is with these piece of shit that will videotape it and allow this to happen without breaking it up. They see a child standing there and they continue to videotape and not stop this fight. They are just as sick as the women that are fighting.","commenter_a":"Lowest of the lowest ignorant white trash. Why can't these fools go back and at least get a third grade education?","post_message":"WHAT!?   I can't believe what I just witnessed..."},{"comment_id":"10157872915845354","commenter_b":"Sadly, anyone can be an American these days, just run across the border or call yourself a refugee. Too many problems...","commenter_a":"I'd prefer \"firearmS\"","post_message":"Amen!"},{"comment_id":"10153293762581037","commenter_b":"Jack, most straight couples procreate. Those who don't are a minority. Marriage rights are supposed to encourage people to procreate so we have The Next Generation. It's just a matter of practicality. If you want to be gay, go be gay. No one is stopping you from being gay.","commenter_a":"Wow....she is EVIL.","post_message":"Ruth Bader Ginsburg, a former civil rights lawyer, has been uncharacteristically outspoken in advance of one of the most significant civil rights decisions in decades - by Liz Goodwin in Yahoo Politics."}]
