[{"comment_id":"10154540555266509","commenter_b":"Parental responsibility not blame the gun.","commenter_a":"more guns would have prevented this","post_message":"\"He shot straight through. \" The Florida pro-gun activist was accidentally shot by her 4-year-old son, authorities say."},{"comment_id":"782798865146503","commenter_b":"Bitches be bought and paid for once by us and once by Kocks.","commenter_a":"Greedy bastards.","post_message":"This is a prime example of why we need to get big money out of politics."},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: \"I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.\" @webpagelink"},{"comment_id":"10152993021545667","commenter_b":"The Donald brings women to be his wives to the USA so they'll marry him and make them legal citizens, did it twice","commenter_a":"Support Donald Trump.","post_message":"\"I cherish women,\" Trump told Hannity on Tuesday night."},{"comment_id":"1089868204425048","commenter_b":"Ugly racist bitch","commenter_a":"Leave the Sgt alone he is right she shouldn't have done that it took me two times watching it to figure out what she was doing and it not right","post_message":"This officer thought he could speak his mind about Beyonce's halftime performance... but as soon as he spoke out, he got some VERY bad news.  He never though this could happen....  Welcome to Obama's America."}]
