[{"comment_id":"1485464441513680","commenter_b":"ASICK woman needs to be jailed","commenter_a":"Hang them both!","post_message":"What kind of woman could do this to her own child?"},{"comment_id":"629306997259879","commenter_b":"Well listen up you stupid, IGNORANT BITCH! If your planning to remove the word BOSSY, well then you might want these words removed also. BOSSY,BITCHY, MOODY, HORMONAL, ON YOUR PERIOD, shall I say more. All these words have the same meaning. Of all people Michelle Obama, I believe that you've been quite the fucking BOSSY ONE lately so don't fucking start PREACHING your BULLSHIT TO THE AMERICAN PEOPLE. By the way BITCH you must not have anything to do and to much time on your hands to open your BIG FUCKING MOUTH ABOUT A WORD THAT HAS MICHELLE OBAMA WRITTEN ALL OVER IT. TELL YOUR BIGOT husband your pathetic issues.","commenter_a":"I vote to ban Michelle","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."}]
