[{"comment_id":"1560863080640101","commenter_b":"Moron! She got what she deserved.","commenter_a":"VERY SAD","post_message":"This craze is out of control.  (From Elite Daily)"},{"comment_id":"1059635564057454","commenter_b":"Yes, maybe if they progress a bit more they'll finally go back to saying the bible explains everything and we should pray poverty, hunger, and crime away.","commenter_a":"Progress","post_message":"I'm sorry, what?"},{"comment_id":"10153695152617507","commenter_b":"No difference, Bullshit, it is the same as endorsing him, even worse, it is a cowardly way of endorsement.","commenter_a":"He didn't endorse Trump, he just doesn't care if they play his music, big difference","post_message":"Wait. What?"},{"comment_id":"932314590139215","commenter_b":"She's definitely covering her butt! It's all about the $$$$$$$$$$!","commenter_a":"Her check book should get a lot smaller after her nasty comments to all Americans. She just sunk her ship. Remember the Dixie Chicks comment?","post_message":"After 24 hours, Ariana Grande has issued an apology for saying she hates America.  And it's very bizarre."},{"comment_id":"10153268434242061","commenter_b":"we're proving it as we speak. record rainfall here in texas and it's still not over. weather is weather, period.","commenter_a":"Kevin Michael Wahler","post_message":"This is Buffalo in 2014 and 2015. First time the city has had no measurable snow in 116 years."},{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1552075435096764","commenter_b":"She is the queen of lies! Talk about incoherence!","commenter_a":"POT CALLING THE KETTLE..........(hiding fear and jealousy)","post_message":"Hillary Clinton went after Donald Trump's ideas, calling them \"dangerously incoherent\" and a \"series of bizarre rants, personal feuds, and outright lies.\" What do you think?"}]
