[{"comment_id":"958348850875022","commenter_b":"She is a frickin IDIOT","commenter_a":"Don't screw with my free speech !!! It won't go well for you !!!","post_message":"The Constitution’s 1st Amendment protections for free speech apply only to “institutions of faith” and not individual Americans, according to Sen. Tammy Baldwin (D-Wis.). Baldwin, the nation’s first openly lesbian member of the U.S. Senate, offered that bit of liberal logic during a recent discussion on MSNBC. Asked by the MSNBC host whether a bakery whose owners have religious objections to the ruling should be compelled by the government to bake gay wedding cakes, Baldwin insisted that religious free speech has no place outside churches, synagogues or mosques.  @webpagelink"},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10153307744490329","commenter_b":"Milliner - ladies hat maker. I'm cool with it","commenter_a":"Switchboard operator....pretty fitting, considering I'm a medical secrerary","post_message":"Vaudeville Star? Bootlegger?"},{"comment_id":"650058555184723","commenter_b":"If they prove he's here under false terms. He an illegal. Hell yes deport him. Send him 2 where he could B put in jail. What a smear on the face of America.","commenter_a":"Would be great if this were true & a Blessing to the USA.","post_message":"Obama to be removed this country after justice department lawyer does this.  Get rid of him. He doesn't deserve to stay in this country.  Do you agree Obama should be deported?"},{"comment_id":"10153523440189071","commenter_b":"You should always bet with Olly when he's had a few, he always loses.","commenter_a":"Olly Cairns @username","post_message":"It has a ton of benefits."},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."},{"comment_id":"10153165834319411","commenter_b":"Errrmm... only one that i can think of.","commenter_a":"Russian threat !! NATO's a war monger since its creation,based on Anglo Saxson ,Viking ,etc...of blood thirsty tribes !","post_message":""}]
