[{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"},{"comment_id":"10154566603193645","commenter_b":"Most murders in US is commited by non Immigrant. Sandy Hook was by a mentally unstable person. Charleston commited by a Rasist unrepentant kkk inspite of the grace afforded him by the people he killed and their families. Florida commited by mentally unstable guy. The guns remain a major problem . Why is there no Presidential order banning guns. No NRA sponsored their election. Why ban muslims but allow christians. A a Christian myself I see this as very wrong. Saudi Arabia had 15 of the 19 killers of 911. Why is Saudi Arabia not included. Something is not right . I am Proud of the brilliant Judges. No one is above the Law.","commenter_a":"They should be thrown out and replaced. They can run for a political office if they want to push a political agenda","post_message":"BREAKING: A 3-judge panel just unanimously ruled against reinstating Trump's Muslim travel order. Do you support or oppose the court's ruling?"},{"comment_id":"10153798584711350","commenter_b":"You need attention like that idiot cutting herself.","commenter_a":"She's trying to commit suicide by cutting her upper arm. She's an idiot. A bridge or high building is what she needs to do. Cutting her arm is just a cry for attention.","post_message":" a teenager is hard, school sucks, parents are lame but life has so much to give you.\""},{"comment_id":"10152727264626051","commenter_b":"This woman is sick, she needs to lose her own child and put into intense therapy with jail time.","commenter_a":"Gross!!!!!!","post_message":"This kid never really thought about why his mom was so excited when his 11-year-old friend came over. Now he knows."},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"}]
