[{"comment_id":"10152824464986680","commenter_b":"Its always been a problem, but its never been so widespread and in our faces. Without Snowden we would still think this was a big conspiracy.","commenter_a":"He will force the end of the PATRIOT Act then blame Obama when we are attacked.","post_message":"“I don’t agree with Sen. Paul on this issue, but I think he’s been a constructive guy,” Senate Majority Whip John Cornyn of Texas said just before the week-long recess."},{"comment_id":"10154455180439203","commenter_b":"LOL!","commenter_a":"Lou is a patriot and great American. He is right while Hillary is a liar, cheater, stealer, fake, fraud, and a phoney.","post_message":"Don't worry, Lou. They don't want to become you, either."},{"comment_id":"10155947178415354","commenter_b":"Nail her to the wall!","commenter_a":"Fry her","post_message":"Maybe they can add this as a post-credits scene in Michael Bay's Benghazi movie..."},{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"10156580556107228","commenter_b":"No sweetheart they don't have no idea what fighting for their rights is about. I don't recall any civil wars that were fought to free the transgender. How many transgender have had crosses burned in their yards, how many transgender have been hung in trees? How many transgender were murdered for being transgender? Special kinda of stupid are the folks that think that the struggles the black community have faced and continues to face compares to Johnny who wants to wear a dress!!!!","commenter_a":"Sorry but to try to compare the two is insulting. I don't recall transgenders ever being enslaved, I don't recall transgender ever having to fight for their civil rights. Being transgender is a choice you make, wether you feel you were born this way or not is debatable. Black is black, no debate there.","post_message":"I sat on the plane this week with a beautiful family.  The mother introduced her three children to me and opened up to me that her youngest daughter is a trans child. She is actually a documentary producer and is working on a film about trans children, a film that will try to confront and dispel the wide spread fear, ignorance and bigotry that surround trans Americans. She allowed me to watch the trailer and the beauty, struggle and courage of the families she highlighted resonated with me deeply. I pray that we all grow more courageous in our empathy, that we all seek to understand each other more and that we all become better agents of love and justice. As for me, I condemn the actions of the Trump administration in their reversal of transgender student protections. I will not yield in the fight for equal rights and equal protection under the law. We all owe an obligation to those freedom fighters who fought for civil rights, women's rights, workers rights and human rights over the past generations. We can not pay those heroes of love back, we can only pay it forward. Now is the time that history calls on us to make for a better future for all. #protecttranskids"},{"comment_id":"10153377171751320","commenter_b":"scumbag","commenter_a":"When he is in need, they should all turn their backs on him again,but for good. He stinks as a Mayor . 👎🏻","post_message":"ACTIONS SPEAK LOUDER THAN WORDS... NYPD Officer Brian Moore was shot in the head, killed in the line of duty and Mayor de Blasio was a no show at his death announcement. Click here to read why he said he wasn't there: @webpagelink"}]
