[{"comment_id":"10153353457471037","commenter_b":"@username he fondled them vaginally. He violated them. Fine line when denying it is rape...","commenter_a":"How can they know he touched his sisters and allow him to continue to live in their home?","post_message":"Josh Duggar of 19 Kids and Counting is embroiled in scandal"},{"comment_id":"1079846958771328","commenter_b":"redneck racist are that way","commenter_a":"wtf happened in just 4 years","post_message":"LULZ."},{"comment_id":"10153823007621636","commenter_b":"The US is no longer safe for the blacks, pls find other homes.","commenter_a":"\"He's put on a paid administrative leave\"!!!!!!! What on earth is happening in America???? These are not police officers in fact they're BLACKAMERICANKILLERS.. cos surely where I live police officers protect people from harm and do not to blindly shoot them.","post_message":"In North Miami"},{"comment_id":"10154763479136037","commenter_b":"No surprise to Hillary. She pays for this stuff. @webpagelink","commenter_a":"No matter who ultimately did this, and I hope they are caught and prosecuted, the way both the candidates reacted tells you everything you need to know about how they will govern.","post_message":"Donald J. Trump immediately blamed \"animals representing Hillary Clinton\" for the attack."},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"10154111897691813","commenter_b":"Do illegal aliens have constitutional rights?","commenter_a":"Good to know. But I was told one time, Border Patrol agents can effect a search of your vehicle WITHOUT a warrant, and up to 12 miles from an international border.","post_message":"ICE is targeting families who have fled some of the world’s deadliest countries – escaping persecution and uncontrolled domestic and gang violence. Know your rights.  More information at: @webpagelink"}]
