[{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"824468191027094","commenter_b":"she's so ignorant. Bet she doesn't even know where her clit is","commenter_a":"I Am probably going to make a lot of women mad over this. And yes. I happily voted Trump! My personal beliefs is that our home, church, and country should be the concerns of a MAN. Yes. There are not as many MEN around as there used to be. But my beliefs are that a woman is to further see that the teachings of the man, the guidance of the man, the protections of the man are done. And done correctly. I was very impressed with her work! She done exactly as she should! A very strong willed educated intelligent woman! He obviously has a lot of faith in her! Smart doing so also! Yet as we are saying, those on the left won't say a bit of praise to her. Smh","post_message":""},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"1164964563593106","commenter_b":"I saw them at Riverside too! I remember crying lol","commenter_a":"@username remember Riverside lol","post_message":"This is Paula first time on tour in 25 years!"},{"comment_id":"10153460035986545","commenter_b":"Dana Cobb was this you/ hahaha","commenter_a":"Terry Jetton @username","post_message":"A 911 call came in from a neighbor who heard “screaming from a house about someone having a gun,” according to Great Falls Police Department notes from the call, but it turns out the family inside was just seeing the latest horrors to befall Rick, Carl, and the gang."},{"comment_id":"10153085333861336","commenter_b":"Go back in the basement and smoke another duby.. This is an adult conversation sight.","commenter_a":"If Israel has nukes Iran should be able to as well. However, in a perfect world neither country would have them, as Israel has threatened to use them and Iran is a loose cannon.","post_message":"CIA Director John Brennan discusses ISIS, Iran’s nuclear program and Putin’s global ambitions, this week in a 'Fox News Sunday' EXCLUSIVE!  Check your local listings and tune in to Fox News Channel at 2p and 6p ET."}]
