[{"comment_id":"1035891609764351","commenter_b":"^ Africa has the most terrorism on the daily and Nigeria in particular last three months schools had radical Muslims go in and blast kids! Hundreds dead No Americans there...","commenter_a":"Terrorism in Canada is only in the mind and children shouldn't suffer because of a bunch of paranoid adults...","post_message":"The Edmonton Public School Board has put all trips on hold as well."},{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"1220607601313429","commenter_b":"Lena Al","commenter_a":"Sinéad check this out","post_message":"Sounds about right."},{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"901805833201774","commenter_b":"Clown in a wig . She makes me sick","commenter_a":"Better to resign before the s--- hits the fan.","post_message":"Why did Democrat Congresswoman Corrine Brown pay the Chinese embassy?"}]
