[{"comment_id":"460760697382304","commenter_b":"Ummm... Not sure what that has to do with the U.N. but ok.","commenter_a":"The UN has been one of the greatest propaganda tools in history! They serve no actual purpose other than releasing statements from time to time with the appearance of having morality supporting it.","post_message":"The UN commission claims that Israel exercised \"great restraint\" while bombing elementary schools in Gaza which resulted in the deaths of 519 Palestinian children last summer."},{"comment_id":"10153387140986323","commenter_b":"How did the chicken cross the road? Roads, where we're going we don't need roads.","commenter_a":"Go Peter Rabbit!! (Y)","post_message":"Is this rabbit really scurrying across an avalanche?"},{"comment_id":"1687154254839815","commenter_b":"To spy over the Congress and international leaders is a serious matter and the Congress should really act immediately to resolve it !","commenter_a":"Try him for his CRIMES!!","post_message":"Obama used the NSA to SPY on members of Congress to ram through his unpopular and disastrous Iran nuclear deal.   What do you want your Congress to do in response?"},{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."},{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."},{"comment_id":"10153472228230090","commenter_b":"And yes, all illegals should be deported...","commenter_a":"And yet the solutions you promise don't see the light of day. Mitch McConnell and John Boehner aren't living up to their promises, either, and they refuse to fight the Democrats, so what is the difference? There are only a few Republicans currently worthy of the name, everyone else is just Democrat Lite.","post_message":"They'd rather kick the can down the road.  Democrats in two words...No. Solutions.   SHARE if you agree."},{"comment_id":"1410115659014394","commenter_b":"Andres Rivera illegals don't belong here","commenter_a":"IMPORTANT *** California, Montana, New Jersey, New Mexico, and South Dakota, please vote for Donald Trump on June 7. We have 126 UNBOUND delegates who can choose to not vote for him on the first ballot. We need 126+ more BOUND delegates to secure a first ballot win and avoid a second ballot! Vote for Mr. Trump on June 7!","post_message":"The good news is that my campaign has perhaps more cash than any campaign in the history of politics. That's because I am standing 100% behind everything we do."}]
