[{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"10154227376546336","commenter_b":"She'll milk it til the end.","commenter_a":"There was never evidence to warrant charges. Hopefully, that reporter had her five minutes in the spotlight, and she's done in the field of journalism. What an insult to journalism!","post_message":"Breaking News: Charges will not be filed against Donald J. Trump's campaign manager Corey Lewandowski, Florida state attorney says."},{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly \"superbug\" at the Ronald Reagan UCLA Medical Center."},{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"},{"comment_id":"10153389766269203","commenter_b":"NAFTA hurt the American worker,manufacturing jobs are going where thry do not have to pay a living wage to American worker's. The middle class is paying for this by job lost and food stamps the working poor need.If this new trade agreement is good for America why is it fast tracking. America elite can build factories over seas and hire people there pay them enough to be able to buy the products they make.I believe we should start penalizing companies that move out of America for cheap labor abd export products back home. The USA will dominate no one if we do not start paying a living wage here and make jobs not loose jobs.THIS AGREEMENT BENEFITS COUNTRIES WHERE LABOR IS CHEAP THEY WILL HAVE JOB GROWTH EXPORTING TO THE USA,WE WILL BECOME A NATION OF TWO CLASSES THE ELITE AND THE POOR.","commenter_a":"There is nothing worse than a bunch of Puritans who are so sanctimonious that they would give comfort to the enemy -- people like Warren, Sanders, and Nader. But the Democratic Party has great discipline and it will not let a bunch of extremists wreck the party like the Tea Party has for the GOP. Team players make victory. @webpagelink","post_message":"Elizabeth Warren is leading a liberal revolt against a trade deal she insists will hurt workers and unravel Wall Street reforms. But can President Obama muscle it through anyway?"},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"}]
