[{"comment_id":"10154776330225831","commenter_b":"@john, Lets talk abt the difference please.....Lets talk abt the American Citizens who took a gay man, James Byrd Jr.....beat him...tied behind a truck, and then dragged him for miles until some of his body parts started ripping off of him....when they finally stopped to toss his body over a cliff....all that was left was his torso....all done by Americans.....Legal US Citizens, in 1998..... Or better yet......the Oklahoma bombings, in 1995, who was carried out by Timmothy McVeigh.....let me reminded you how this Legal American Citizen; bombed the Alfred P. Murrah Federal Building in downtown, Oklahoma City, killed 168 people, and injured more than 680 others ...here's another legal Citizen attack for you, since we Americans forget how we're our own enemies {but I guess thats okay}.....: Eric Rudolph carried out the Olympic Park bombing in Atlanta during the 1996 Summer Olympics.....that blast killed spectator Alice Hawthorne and wounded 111.....lets ...","commenter_a":"Instead of deporting \"illegal immigrants\" kick out all the Nazis skin heads KKK alt right Moran's and we shouldn't have any problems with the rest of the world","post_message":"The 9th U.S. Circuit Court of Appeals has refused to reinstate President Donald J. Trump's travel ban. In response, President Trump tweeted, \"See you in court\" and \"the security of our nation is at stake.\" Do you agree with the court's decision?"},{"comment_id":"1268420859891333","commenter_b":"Stfu lol","commenter_a":"Amanda merry christmas lmao","post_message":"Bruh!  #Gifts #WSHH"},{"comment_id":"10153352296609497","commenter_b":"Whether or not you find the humor funny is entirely subjective, of course.","commenter_a":"This isn't satire and it never will be. This is a pathetic example it castigating old people.","post_message":"From our sister publication, ClickHole:"},{"comment_id":"10153335950782293","commenter_b":"When you have a citizenry that has NO respect for authority, this is what you get. Should the police just let them run wild? Why not create some \"no go zones\" and let the animals have at it.","commenter_a":"If the only way police can \"control\" crime is through the kind of brutality we see in videos, they better relearn their policing skills.","post_message":"He suggested violent crime is surging in the U.S. because police officers fear getting caught on the next video of alleged police brutality."},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."},{"comment_id":"10153609535136680","commenter_b":"Rick seems to forget about that \"Well-regulated Militia\" clause that are the first words of the 2A. It doesn't mean a armed rabble.","commenter_a":"Evil and assault weapons which need to be only in the hands of trained military, not sold to any Tom, Dick or Harry.","post_message":"Rick Scott: \"Let’s remember, the Second Amendment has been around for over 200 years. It didn’t, you know, that’s not what killed innocent people. Evil killed innocent people.\""},{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"}]
