[{"comment_id":"1384744278251983","commenter_b":"I blame Obama, Jackson, Sharpton, Pelosi ...................","commenter_a":"Maryliz T. Curtis","post_message":"'It's a kind of anti-black mood'"},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"1676793319209552","commenter_b":"Yes Obummer did start all of this. And he has not came out publicly and stood up for the Cops Or American Christians. But he sure as hell has Stood up for the Dammed Muslim's. When are the People going to stop his ass","commenter_a":"I stand with local, county, and state law enforcement I have zero faith in federal law enforcement.","post_message":"At least there are a few people out there with the guts to say what needs to be said.  @webpagelink"},{"comment_id":"10152634683050779","commenter_b":"Could be great, i hope so.","commenter_a":"Woohoo!!","post_message":"In a stunning announcement today, Blur have revealed plans to release their first new album in over a dozen years, titled 'The Magic Whip.' UPDATE: Click through to listen to the new song \"Go Out\" and see the track list for the album."},{"comment_id":"1704157759871336","commenter_b":"Hate the show.Bitchy women!!","commenter_a":"Let's hope so","post_message":"The View makes me SICK.   Take Joy Behar off the air NOW!"},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"10154338923531955","commenter_b":"We need to send in our military to arrest these traitors in positions of authority who are completely ignoring the rule of law and committing treason in the process! This cannot be allowed To continue. Time for the people to raise our voices!","commenter_a":"Jury Nullification","post_message":"DOJ PROBE SHERIFF JOE..."}]
