[{"comment_id":"10153684606323487","commenter_b":"There is no part of any of the Planned Parenthood video footage of a fully-formed aborted fetus on the table, with its heart beating, its legs kicking, IT IS A LIE!!!!!! The damned bitch lied!!!!!","commenter_a":"In the sense that she lied louder and slower than the others, Carly owned the night.","post_message":"Carly Fiorina owned the night."},{"comment_id":"10154491854776002","commenter_b":"Yeah, she's a great mother!?!? Ha. Get those poor kids away from her immediately; lock her away with the scum husband.","commenter_a":"Seriously-not only her but her husband has committed the same crime-hurting thousands of others-stealing money from the government and she wants a break?!!!!!!","post_message":"Washington is asking the judge for a massive break. The judge ordered her to serve four years in prison, but she is asking not to go to turn herself in for five years so she can stay home with the kids while their father serves his time for the same crime."},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"},{"comment_id":"10153419544317061","commenter_b":"Robach on safari in Africa, probably a better production performance from her than the days she does studio production...She clearly has the ability and clothes to dress for an African safari and lacks all ability to select the correct wardrobe for studio performance...Robach and Spencer are the two worst dressed women on GMA since the show began...Diane Sawyer was one of the best dressed women on this show...","commenter_a":"Cool!","post_message":"WATCH: Our drones capture beautiful live images of elephants as we are on safari in Africa. Interact here: abcn.ws/20PSiVQ #GMAinAfrica"},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"},{"comment_id":"535989533241343","commenter_b":"Stop hating Racist women !","commenter_a":"3 Muslims just went into a Canadian city and opened fire in a bar on innocent people. Canada's Muslim appeaser ignoring it. This is on his shoulders. Trudeau's headline today? Liberal mp going to detox. Watched Obama. Muslim crimes are shush shush. White criminals get detroyed by Obama, cries 'racism' and moves his gun agenda forward. The double-standards by these leaders is taking democracy down a precarious path. Sad.","post_message":"President Barack Obama at State of the Union: \"When politicians insult Muslims, whether abroad or our fellow citizens, when a mosque is vandalized, or a kid is called names, that doesn’t make us safer... It diminishes us in the eyes of the world.\"   #SOTU updates: @webpagelink"},{"comment_id":"10153524776247016","commenter_b":"If you want a female president, Elizabeth Warren would be a thousand times better than WHORE Hillary.","commenter_a":"You can dress HRC any way you choose and she still is a corrupt POS. NEVER $hillary, EVER BERNIE~!","post_message":"Wall Street thinks Sen. Elizabeth Warren would be a \"nightmare\" as Vice President of the United States.  You can't ask for a better endorsement than that."}]
