[{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"10153978615223812","commenter_b":"Go Hillary! 2016!!!","commenter_a":"GO BERNIE","post_message":"Here's what the ABC team is doing in the minutes leading up to the #DemDebate..."},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10152606261785950","commenter_b":"Yea I agree,why would any woman want to marry Ol Charlie.Just Crazy.She must have some serious issues.","commenter_a":"Quit promoting this human excrement CBS \"News\"... (\"fuck the victims\") ...UNSUBSCRIBE","post_message":"It looks like the 80-year-old serial killer will stay single."},{"comment_id":"994271287356316","commenter_b":"Hell no our government is so jacked in the head they need a 50 caliber hole there to straighten them out","commenter_a":"🖕🏿off your selfs in silence. how ignorant","post_message":"Would it be unchristian if I said in a Texas accent ... 'Eff them?' Help me. Your friend, Doug in Texas. @webpagelink"},{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just \"apply\" to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: \"I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?\" @webpagelink #DemsInPhilly"}]
