[{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"10154462849065695","commenter_b":"True and at the end of the day she going to be black im going to be white and nothing can be done about it. Oh and what the crap about drunk like most white girls? Yes that is a stupid remark","commenter_a":"Wow Sabrina why even make it a race thing.","post_message":"Police are asking anyone with information about what happened to Brenda Arreguin to come forward."},{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."},{"comment_id":"10153355238128984","commenter_b":"They love talking about themselves. Bunch of dumb thugs. God make them go back under the rocks they crawled out of.","commenter_a":"A is A. (Aristotle)","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"1012675578755490","commenter_b":"Stupid women","commenter_a":"shut up skanks, cancel the p.o.s....","post_message":"Umm ACTUALLY it is in the Bible!"},{"comment_id":"10152821064059342","commenter_b":"^ they just don't have enough self control to keep from raping a woman unless shes covered apparently.","commenter_a":"Why do we have a muslim Capitol day?","post_message":"FBI RESPONDING TO MUSLIM CAPITOL DAY THREATS: Organizers say demonstrators are expected to protest against Thursday's rally. A spokesperson said the event began in 2003 and has never drawn opposition before, but this year online threats have prompted the council giving event to contact the FBI."},{"comment_id":"1201785943175748","commenter_b":"The unvaccinated will always be a problem...you know why? Because you're all fucking dumb as shit! That's why.","commenter_a":"From another article. It's not the unvaccinated that started this. It's the vaccinated. \"The WHO said the two cases were in the southwestern part of the country -- bordering Romania, Hungary, Slovakia and Poland -- and that the strain responsible, vaccine-derived poliovirus type 1 or cVDPV1, may still be a threat to the region.\"","post_message":"Vaccinate your kids folks."}]
