[{"comment_id":"1090200961078541","commenter_b":"No sympathy.. The German people should have turned on their Government years ago for not putting the German people first.. The German people have sat back and just watched as their Government have let these migrant, immigrant and refugee vermin infect their country like a cancer.. And now innocent people have died.. How many more are going to die before someone does something and boots these parasites not just out of Germany, but out of Europe.. Can you imagine it.. a Muslim free Europe..","commenter_a":"Islam to be wiped off planet all together","post_message":"LIVE: 9 dead, multiple injured as truck plows into Christmas market in Berlin in likely terrorist attack Watch Ruptly LIVE here @webpagelink"},{"comment_id":"10155198682596002","commenter_b":"Sad now she is looking like a joke.","commenter_a":"I still remember Hillary as 1st lady saying stand by your man.","post_message":"What do you think of her statements?"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves!  STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10153635350921636","commenter_b":"He's definitely got issues!","commenter_a":"So kill urslf wtf","post_message":"'I could just kill myself and I wouldn’t have to face today'"},{"comment_id":"1044939055565842","commenter_b":"Watch out for the showers.","commenter_a":"Disrespectful, Ungrateful Cretins!","post_message":"Refugees in Germany are being housed in a former Nazi concentration camp"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"484066138450614","commenter_b":"@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"}]
