[{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"547425292114717","commenter_b":"She needs to be exposed for every crime she has committed and she needs to leave her campaign so she can face charges for every one of those crimes!","commenter_a":"Oh! Bet me!","post_message":"Hillary is officially paying the price for all the crimes she has committed.  Awesome. She is a criminal.  Can we get 10,000 'LIKES' for Hillary getting arrested?"},{"comment_id":"1199514790068549","commenter_b":"\"Tear Down This Wall!!\"","commenter_a":"Reagan might but Eisenhower would not as he was too far left for todays GOP.","post_message":"When you compare self-identified Republicans today to those of 1990, you have to wonder how well Reagan would do in the 2016 race."},{"comment_id":"10154159520288037","commenter_b":"They weren't misbehaving.im sure this girl was engaging in the drama as well","commenter_a":"Should've gone home and put on a Trump for prison shirt. I bet you the administration wouldn't have a problem with a short bashing a conservative","post_message":"She says she was told to change her shirt or go to in school suspension for the rest of the day because her shirt caused a classroom disruption."},{"comment_id":"487985148058732","commenter_b":"Why hell no, is that why he wants all the illegals in the USA.","commenter_a":"I've wondered if he might arrange some kind of false flag in order to declare martial law and thereby remain in office. I think he knows he couldn't get elected again in a fair election. But then again his lips were moving so he's probably lying anyway.","post_message":"What Obama just said about running for a third term is shocking.  Spread this, Obama doesn't want the public to know what he's planning.  Should Obama be allowed to run for a third term?"},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: \"After the failure of 'After Earth,' a thing got broken in my mind...\""}]
