[{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"},{"comment_id":"10153708782186350","commenter_b":"Michelle ovomit is the washed out hag!","commenter_a":"Michelle Obama is a wonderful woman who deserves respect. She didn't do anything to you. Stop acting like 12 year old bullies and grow the hell up","post_message":"Find out what Michelle Obama can't wait to do once she leaves The White House."},{"comment_id":"10153318281418984","commenter_b":"Racist and Illegal!","commenter_a":"Not very inclusive.","post_message":"Imagine a \"whites only\" field trip. Al Sharpton would be licking his chops and hopping on the first plane to Indiana.  Do you think what this school did is wrong?"},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"1112252572119545","commenter_b":"We have BOTH problems: 1. too many guns, too easily had, by too many people. 2. We don't take care of people who are mentally ill. Rather (thanks to Reagan who closed the public hospitals) we either put them on the street, or we bake them first in prison, and *then* put them on the street. Europe takes care of both of these problems much better than we do. That said, the statistics are clear, countries that have more guns, have more gun-related deaths and injuries. Guns within easy reach are far more likely to do harm than good.","commenter_a":"Today another mass shooting of children by a mad man which took place at almost the same time Republican mad men held unethical hearings about the falsehoods that Planned Parenthood are killing children for profit. If the Republicans wanted to investigate a terrorist organization that is solely responsible for the verifiable mass death and carnage of America's children, and other innocent lives, they'd be investigating the National Rifle Association and its members. It's time we realize the NRA and Republican cohorts are terrorist organizations and the Democrats are as guilty and cowardly to do anything to reign in this insanity, as they too are as beholden to NRA dollars as the Republicans. If these were Muslims murdering our children at this rate instead of deranged Caucasian white men, who make up the majority of the Republican voters, all of the Mosques would've been leveled and Muslims would have been rounded ...","post_message":"Another day in America."},{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"10153002585681770","commenter_b":"All conservative women are stupid!!!","commenter_a":"All liberal women are stupid!","post_message":"During a keynote address at the New York State Fair Wednesday, Democrat New York Senator Kirsten Gillibrand erroneously referenced the Constitution’s Fourteenth Amendment as the law that gives women the right to vote."}]
