[{"comment_id":"10154808382292235","commenter_b":"What about Ted (Shit my pants draft dodger) Nugent? He can play his one and only hit about pussy grabbing.","commenter_a":"Ted will need to wear a diaper","post_message":"Looks like it's just Ted Nugent and Kanye."},{"comment_id":"1101493276543118","commenter_b":"More than possible! I always thought this would be the case when he first got put in jail. Been praying for his release and for all those associated with him. Been praying for his family.","commenter_a":"Is it possible that GOD used Saeed to bring the gospel to the prisoners...,GOD works in mysterious way?","post_message":""},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"},{"comment_id":"1742501459315047","commenter_b":"SORRY HILLARY IS PRISON BOUND.MAYBE YOU CAN WRITE HER.","commenter_a":"Just like she took care of the Benghazi situation?","post_message":"\"I’m afraid because these motherf—kers are coming for us, y’all.”"},{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"1210812922267700","commenter_b":"Fools! All of them!","commenter_a":"Liberalism hit squads at their finnest huh Rush.","post_message":""},{"comment_id":"985965458116748","commenter_b":"Crazy witch","commenter_a":"This is murder , God forgive us if we don't stop this","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"}]
