[{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"398088506982411","commenter_b":"Send them back to where they came from. They have no rights....they aren't AMERICAN citizens!!","commenter_a":"deport every one them but their country dont want them either they dont know the meaning of being human it seems","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"986494124719342","commenter_b":"Who cares! Go home where u b long","commenter_a":"They have their country they can go back home anytime. We do not need to have them visit anymore","post_message":"Donald Trump's promise could change EVERYTHING!"},{"comment_id":"10152777670593525","commenter_b":"Hahaha she can do it, especially since she has that walker she'll smoke that nigga","commenter_a":"@username Xana Smith @username Alice needs to get on her grind! Lol","post_message":"95 years old and still setting records on the track…"},{"comment_id":"10153554692703984","commenter_b":"There's whores in all races, and drug dealers don't going stereotyping with that bullshit!!!","commenter_a":"A American should have right before any one from another country, should speak English and love the American way it's not just Mexican it's all.trying to bring their laws. Sorry America needs to stand up and fight for what's right.","post_message":"Hispanic employees were furious after this employer implemented this new rule, so they decided to sue.  But the employer won't be stopped. He says he has a good reason for doing this and they need to get over it...  Do you support the employer's decision?"},{"comment_id":"10154475125548812","commenter_b":"STOP GLORIFYING THIS RAPIST POS.","commenter_a":"I don't think it's real remorse probably embarrassment. Which is great. So it means that the power of social media is effecting thing Even the Vice President commented eloquently. So keep it up share this post pictures and sign the petitions","post_message":"Women who provided character witness statements for the Stanford University swimmer convicted of sexually assaulting an unconscious woman on campus are expressing regret for supporting him."},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"}]
