[{"comment_id":"10153381593334411","commenter_b":"If you've been in brothel, you are worse than a prostitute, as prostitutes might were forced to do it, you go there at you own will, which makes you a sleaze-ball","commenter_a":"idk, a Russian backed news organization saying America is a police state? Maybe, but few people are being jailed for being gay here as opposed to your \"glorious\": homeland","post_message":""},{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"10153895109342994","commenter_b":"Let Canada take in all the refugees - America doesn't want or need them.","commenter_a":"That's Canada! Friendly and welcoming people :) Wish the rest of the world was like that..","post_message":"A church in Canada is making a statement in the holiday season that's brewing controversy - and they're going beyond the church sign."},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"1119178091433245","commenter_b":"She's going crazy from lack of schlong!!!!!!","commenter_a":"She is both a liar and totally stupid....and murderer.","post_message":""},{"comment_id":"928788953880826","commenter_b":"What a dumb bitch","commenter_a":"One less cracker...","post_message":"Because death is better than letting two people celebrate their love for each other."},{"comment_id":"1012584022097710","commenter_b":"Yes, it is so obvious, but people in general are very ignorant, they think it will never affect them. Well, it is already affected them in America, in Europe and elsewhere. The Muslim radicalism is taking over the World and nobody cares! Israel is the country that knows what is all about and suffers from constant terror and constant criticising from the stupid World leaders who sold their countries, the culture and civilisation of thousand years to savages.","commenter_a":"Key Positions in our government ! @webpagelink/ CANNOT TAKE THE CREDIT FOR THE BELOW. REPOSTING To President Obama: It was you who told an Islamic dinner - \"I am one of you.\" It was you who on ABC News referenced - \"My Muslim faith.\" It was you who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. It was you who wrote that in the event of a conflict -\"I will stand with the Muslims.\" It was you who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" It was you who bowed in submission before the Saudi King. It was you who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. It was you who exempted Muslims from penalties under Obamacare that the rest of us have to pay. It was you who purposefully omitted - \"endowed by our Creator\" ...","post_message":"Ignorance isn't bliss if it's harming people..."}]
