[{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"10154803767550579","commenter_b":"Gary Johnson is scary and just as much a risk as any of them.","commenter_a":"Protect your Rights and Freedom, vote Libertarian Party, Gary Johnson and Bill Weld. 🔔 Give Freedom, Liberty and Justice a chance for a change! 🔔 Visit the FEELING THE JOHNSON Facebook page and give them a LIKE. Break the corrupt two-party system we're trapped in.","post_message":"CLIP: Donald J. Trump and Hillary Clinton debate the economy during the first presidential debate. Watch full video here: @webpagelink"},{"comment_id":"10154316871838203","commenter_b":"@username Jesus only chose men to be Apostles - but He had many female followers. The reason that women cannot be priests is that the priest acts in the person of Christ in the Mass. If it's a woman offering the Mass the sacrifice becomes one of bride to bride - and the significance is lost. Humans are sensual creatures. God knew that; that's why He created sensual experiments (the Sacraments) as visible signs of His grace. You cannot baptize someone with motor oil because it's not a sign of cleansing. Similarly, you cannot ordain a woman. It is not possible.","commenter_a":"st paul says there is no difference between men and women now that we are in Christ Jesus. there is nothing to suggest that women cannot be ordained priests or deacons from the mouth of Jesus himself. the fact that only men were chosen by him could be due to the fact that the social fabric of his day could not tolerate or make it possible otherwise. the holy spirit will continue to guide the church according to christ's own promise. let's not bar the way forward when we see he is driving along that path. we need to go to the spirit of our faith and not be kept back by men made rules and practices. WE HAVE TO LET THE LORD SPEAK.....AND LET US BE SILENT.","post_message":"The Catholic Church can never ordain women priests, so why all the confusing signals?"},{"comment_id":"826344630889447","commenter_b":"We are sick and ;tierd of feeding these lazy women who just keep laying on their backs , letting free loaders get them Pregnant. We need to sterilize these women. We should pay to get them sterilized.","commenter_a":"Get a JOB, leeches.","post_message":"They are losing it. That's what happens when you mooch for your entire life.  Do you think this was a long time coming?"},{"comment_id":"10154860670292435","commenter_b":"Take flamethrower out there and really clean the swamp!","commenter_a":"You get a fire truck and water board them with a hydrant.","post_message":"Happening Now: Protesters outside the White House opposing President Donald J. Trump's travel ban."},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"}]
