[{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"1641329602799278","commenter_b":"Black lives matters ass bitch","commenter_a":"This person needs to be arrested!","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"1380609545301335","commenter_b":"GOOO NORTH DAKOTA, WISCONSIN, CA. , NEW YORK BRING IT ON IN!!!!! ALL ABOARD NEXT STOP THE WHITE HOUSE!!! ADDING COAL TO THE TRAIN!!! MEDIA,MEDIA, MEDIA!!! NO MATTER HOW YOU TRY YOU CAN'T TRUMP THE DONALD!!!! CRUZ KASICH =ESTABLISHMENT'S COCKROACHES!!! A VOTE FOR THEM IS A VOTE FOR HILLARY OR BERNIE!!!!!! ALL ABOARD !!!! NEXT STOP THE WHITE HOUSE!! T TRAIN R ROLLING U UNITED M MOVED BY THE PEOPLE P PRESIDENT TRUMP","commenter_a":"Any word on royal booze taster Glenn Beeks and his daily abuse of Christianity. I mean what a embarrassment that guy is using God and Christianity to prop up that disgusting philanderer Cruz","post_message":"It's a super religious day or something, he maybe thinks."},{"comment_id":"903633816370041","commenter_b":"I saw this when I heard about it on the radio this morning. Lol","commenter_a":"Rudis Fernando Amir Casey Jeremy Jose Antonio damn","post_message":"No Brotherly Love: Eagles Play Drake's Back 2 Back Diss During Practice!"},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"}]
