[{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"},{"comment_id":"10154258426436509","commenter_b":"JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. CALL: +@username WE SUPPORT YOU BOTH SPIRITUALLY, FINANCIALLY, PHYSICALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BEING A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL WEBSITE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE. WE DON DISCRIMINATE IF YOU ARE WHITE OR BLACK. CALL: @username OR SEND AN EMAIL TO: ...","commenter_a":"Terrorist can care a crap about climate change their goal is to eliminate all others that do not believe in their religion.","post_message":"\"What greater rejection of those who would tear down our world than marshaling our best efforts to save it,\" President Obama opens up #ClimateChange conference COP21 #COP21Paris"},{"comment_id":"903045683051621","commenter_b":"She embarrassed us once on national TV!!! We good!!","commenter_a":"Ya own kind hate'n why can't we stick together","post_message":"Guess Who Wants To Replace Kelly Osbourne On “Fashion Police”"},{"comment_id":"10153304672057377","commenter_b":"@username, you are just giving me TONS OF REASON ! As i said............, if there are no \"illegals\" to pick it up...............IT ROTTS on the ground.........! They are the ones who pick the fruit and vegetables !","commenter_a":"Trump will be in New York next year ! If anyone thinks that he can win the Presidency calling names to every minority in this Country, better have something else to sleep well because Donald Trump will never be President of the United States of America !","post_message":"The Rev. Franklin Graham Thursday suggested that Pope Francis \"build a bridge\" to Republican front-runner Donald Trump because \"who knows where he may be this time next year.\""},{"comment_id":"10153584406778352","commenter_b":"stupid girls!!!","commenter_a":"They need to be committed for a long long time","post_message":"Two Teenage Girls Kidnapped a 14 Year Old, Made Her Masturbate, and Tortured Her For 17 Hours By Scalping Her Hair and Pouring Salt Down Her Throat"}]
