[{"comment_id":"10153514022490047","commenter_b":"Why couldn't they give birth control wouldn't that been cheaper going have to do better than that","commenter_a":"Except what little they give women for birth control. When I couldn't afford birth control, much less a birth, they were there to help.","post_message":"A senior Planned Parenthood abortionist was caught on camera detailing how they \"crush\" the baby and sell the organs.       Planned Parenthood must be stopped.  SIGN our petition to take action: @webpagelink"},{"comment_id":"10153978069921178","commenter_b":"Rosa, that is not your place to say","commenter_a":"andyou need to get out of the United States","post_message":"Michael Moore goes off the rails (more than usual) in bizarre interview."},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"},{"comment_id":"1724725117769666","commenter_b":"Hey Matt good thing she doesn't have a dick or you would be down sucking it","commenter_a":"No. She is above the law, and we all know it.. Anyone else would have been charged by now!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"10152928923462293","commenter_b":"His twin appears normal. She also got a lead paint settlement?","commenter_a":"\"Didn't Die In Vain\" . . . but he lived in vain . . .","post_message":"Reports of Gray’s history with lead come at a time when the city and nation are still trying to understand the full ramifications of lead poisoning."},{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"}]
