[{"comment_id":"1226980343992420","commenter_b":"Ugh man females I hate em in high school and yes we can have a button up and cleavage will show lol","commenter_a":"Jessica Elizabeth😂😂😂","post_message":"Boob deodorant? Oh yes, I've got that."},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"10152977675812690","commenter_b":"Cool...but can't we all agree that there are quite a few ILLEGAL immigrants that do NOT speak English?? I'm not talking about immigrants I'm talking about the ones who are here ILLEGALY!!","commenter_a":"But it is also illegal! Just do it right! Learn the language, support yourself and do it LEGALLY!!! Legally!! That is all!","post_message":"WATCH LIVE: Dual rallies have taken over downtown Dallas Friday evening, forcing several businesses to close early: @webpagelink Photos of the protests: @webpagelink"},{"comment_id":"1046343315386679","commenter_b":"Can two women already have a baby? I mean in a biological way of course...","commenter_a":"Wow","post_message":"No women required."},{"comment_id":"890357731026345","commenter_b":"Sorry, but this is America. You want to live here you can follow American law. If you want to live by YOUR ethnic rules, head back to where you came from. Way to go Texas!","commenter_a":"As if Texas was ever going to let them take over and see they did it so covertly their government never even realised what was going on...Wake up Australia it is no different here","post_message":"TEXAS: Bad News For The Islamic Tribunal In Texas, Muslims Furious   There only room for one governing law in the United states, we will have no side show from the Islamist who want Shari. If you want Shari then...  @webpagelink"},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly \"tried to talk him out of it,\" but that's it."}]
