[{"comment_id":"10153903712141051","commenter_b":"Your a bitch !!'","commenter_a":"Black lives matter??????? Nop!","post_message":"You read that right: this man raped not only his 82-year-old grandmother but also his uncle. She had just one question for him."},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"824106447706135","commenter_b":"Just revoke her security clearance. How could she be president without clearance?","commenter_a":"Ohhh I wish!!!","post_message":"Former Attorney General Michael Mukasey has been making the rounds .."},{"comment_id":"10154108531615950","commenter_b":"Wrong. Abortion is a huge problem and IS murder. IF A PREGNANT WOMAN GETS MURDERED ITS DOUBLE. HOMICIDE..DOUBLE STANDARDS","commenter_a":"Why are people so fixated on someone's death? That is, ONLY if the tool used happened to be a firearm? Why not by other tools and means? #1. There is no gun death epidemic in America. In fact, many more people are killed each year by abortion, alcohol, tobacco, obesity, vehicles, prescription drugs, drownings, STDS... #2. Murder is not on the rise in America. In fact, violent crimes across the board are down some 50%, and have been falling for the last 20 plus years. This despite the fact that firearm ownership is quickly rising more each year. Studies even show where private firearm ownership is the highest, crime is the lowest. #3. Many of the same people who are supposedly against the deaths of a small percentage of people by firearms, are perfectly happy to murder their own sons and daughters by the millions each year. Talk about hypocrisy! ...","post_message":"Police locked down a South Florida mall after one person was killed and another was injured in a shooting."},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"870850106350450","commenter_b":"She's desparate and we already know that she'll say anything to get a vote. I wouldn't be mad if she stroked out.","commenter_a":"Yeah ok","post_message":""},{"comment_id":"1703915029828450","commenter_b":"Mitt you looking for your10 mintues of fame????.... you lost get over it.....How can you allohw a Party to say mine and millions of people vo te don't count.....????..we don't like Rubio.and by the way llook hard in Flordia about his pass!!! we don't like Ted Cruz.. which i think thie Chistian voter shows that... Donald Trump for President 2016 has grown your Party... I am 60yrs old i have been a Dem all my adult life.. this year,, i changed to Rep Party....to vote for Donald Trump for President 2016... and now it doesn't matter?? because the GOP says so.... pure Goverment !!! trying to hold on to there ways the hell wi th the people e.... ok i you keep your crap up.. just won't vote.....and we can have another 4 years of Obama... and i am sure i am not a lone on this....th an you have ...","commenter_a":"And I put a hundred hours and a lot of cash working for Romney. A RINO at heart and a man that can't close the deal.","post_message":"Donald J. Trump responded to Mitt Romney, calling him \"one of the dumbest and worst candidates in the history of Republican politics.\""}]
