[{"comment_id":"1424339400924900","commenter_b":"Why would she want to debate that arrogant old man?","commenter_a":"I heard that it is against DNC rules for this type of debate. Sanders has become irrelevant and desperate - so sad - he could have created a legacy instead of angry tantrums","post_message":"He just called Donald Trump's bluff."},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"},{"comment_id":"10153554876193010","commenter_b":"Yes send them all back,","commenter_a":"Welcome to socialism.","post_message":"The children at this San Bernardino motel pay no attention to the meth dealers on the sidewalks. To the men in nice cars driving slowly through their makeshift play area scanning the doorways for prostitutes."},{"comment_id":"685505648280301","commenter_b":"@username don't worry, she'll deny, lie and get out of it. Doesn't she always!","commenter_a":"They say truth is stranger than fiction but this is ridiculous. We now have a presidential candidate running for office under investigation by the FBI and she is allowed to continue her campaign?","post_message":"BREAKING NEWS: New emails that prompted the reopening of the Hillary Clinton investigation came from devices owned by Anthony Weiner and Huma Abedin, according to an FBI source. @webpagelink"},{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"1077871268936068","commenter_b":"I guess being a lawyer, U.S. Senator and Secretary of State aren't real jobs?","commenter_a":"So fun to meet someone whose actually worked a real job..eh Hillary?","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153185044695950","commenter_b":"And without reading anything, you're a jealous dumb girl who don't know kids are kids.","commenter_a":"Yeah except when you read his school behavior record you realize he's a little shit.","post_message":"Ahmed Mohamed attended Astronomy Night at the White House last night, where he met scientific stars, astronauts and President Obama. During his visit, he had a chance to chat with the president, passing along a valuable lesson: \"...You shouldn't judge a person by what they look like. You should always judge a person by their heart.\""}]
