[{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""},{"comment_id":"10154038574341337","commenter_b":"Fuck, fuck, fuck a duck Screw a kangaroo Sixty-nine a porcupine And hope he blows you too....","commenter_a":"South Park did it best. See: Mystery of the Urinal Deuce","post_message":"MURDERED BY OBAMA? These Antonin Scalia conspiracy theories are insane..."},{"comment_id":"532937326855044","commenter_b":"She takes no responsibility. She whores and takes no responsibility because it is his fault. Logic?","commenter_a":"A Hole..step up to the plate and accept your responsibility!!","post_message":"What a piece of sh*t   | Liz"},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"},{"comment_id":"10153589265781782","commenter_b":"Honestly I don't care if she kills herself or what she does rot in hell ask forgiveness I don't care but the hurt she caused the family and the pain she caused that sweet innocent baby is my concern that lady is no concern of mine whatever happens to her happens I just pray peace to the parents of a baby that they don't have any more and she is accessory to that !!!","commenter_a":"I don't understand how any one can have sympathy for this lady she killed some ones child are you kidding ...there ain't enough stress in the world to cause you kill someone else's child kill yourself for God sake !!!!!!","post_message":"DAY CARE DEATH: Jonathan Cooper goes through the court documents that say a Noble day care operator, who now faces a murder charge, admits to throwing and dropping a baby last week. @webpagelink"},{"comment_id":"10154225504351336","commenter_b":"Can't stand her","commenter_a":"Oh come on now, we all know she is in with Trump...She's a plant by Fox news and the Trump group to bring attention to him....It's the oldest trick in the book...but ya, I can't stand her either.","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"876831439029591","commenter_b":"She needs to be fired because she should have done her job and not entertained the situation. She should have ignored the customer and sat her butt down.","commenter_a":"She needs to be fired.","post_message":"A woman caught on camera head-butting another woman at a Walmart says she has no regrets. The fight took place after the woman says she received poor customer service from a tax preparer: @webpagelink"}]
