[{"comment_id":"845673835565796","commenter_b":"@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"1125703734163047","commenter_b":"@@username, The same amount as your kind that got arrested for having sex with goats and dogs. Bitch ass.","commenter_a":"George Zimmerman and Dylan Roof both caught beat downs in the same day. Today was a good day.....","post_message":"George Zimmerman was punched in the face for bragging about Trayvon Martin's death! After the well deserved sock to the face he called 911 in a panic #WSHH #GeorgeZimmerman #TrayvonMartin #RIP"},{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."},{"comment_id":"870555189755929","commenter_b":"Fuck that! Teach those fucks the appropriate way to interact with us.","commenter_a":"POLICE=Political.Oppressors.Lynching.Innocent,Citizens.Everywhere.","post_message":"Thoughts?"},{"comment_id":"10152931648796491","commenter_b":"They are business women now and could buy everyone on the show. Maybe they will make a cameo appearance, if the show stays on the air? They should just leave the show alone and move on with their lives.","commenter_a":"I believe they've both stated they are through with acting. Its their choice how they live their lives. They don't owe anyone anything. They're both very well suited for their current endeavors in fashion, out of the limelight.","post_message":"“I understand they’re in a different place and I wish them the best,” John Stamos said."},{"comment_id":"10153069431726045","commenter_b":"Don't run pretty girls. You're just gonna trip over that invisible tree branch and fall at his feet.","commenter_a":"90model gold marque mercury. Missing a hub cap. Asking anyone know the CAR...not the man.","post_message":"Huntsville Police hope you can recognize the car this man drove when he robbed the PNC Bank at 1470 Perimeter Parkway Wednesday afternoon."},{"comment_id":"10154638798186336","commenter_b":"Neil Cavuto ...per this morning's discussion: people killed on the highway not same as being murdered by immigrants...who over stay, are not vetted or are illegal!! How many of the 15 9/11 killers fit these descriptions...and we sacrificed the lives of many in order to accommodate immigration. Immigration is not in the Constitution...we need strong laws, enforcement and a wall!!","commenter_a":"dead people make it a war.","post_message":"On \"FOX & Friends Weekend,\" Dr. Sebastian Gorka commented on Donald J. Trump's approach to radical Islamic terrorism."}]
