[{"comment_id":"10158563017270354","commenter_b":"She is too good for you a hole","commenter_a":"All of you hypocrites who are protesting and rioting over Trumps's decision that was very similar to Obama's that you didn't even bat an eye for, is the reason Trump will be here for 8 years.","post_message":"Grammy Award-winning rapper Eminem called President Donald Trump a \"bitch\" and fantasied about sexually assaulting conservative author Ann Coulter in a new song."},{"comment_id":"1244076232270511","commenter_b":"@username And, that remark after you just said everything about her that Bernie did too. Crime Bill vote, wasn't for gay marriage because he thought it was a 'states rights' issue. Voted to send Vermonts nuclear waste to a small latino poor town in Texas. Voted to FUND the war in Iraq and plenty of other wars. Couldn't even to get the members of the Progressive Caucus in congress, that he started, to support him. You lost. Get over it.","commenter_a":"Of course he can't give Hillary credit for winning on her own merits. It must be because of closed primaries, or \"the poor not voting,\" or whatever other excuse he can come up with. How about the fact that Bernie benefited from the caucus system in certain states that actually make it difficult for voters to participate & thereby lower turnout? I don't hear Hillary whining about that. #feelthewhine","post_message":"He's looking ahead."},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."},{"comment_id":"10154894095826509","commenter_b":"Good doctor. Dumb woman","commenter_a":"@username :)","post_message":"\"My prayer is when you see that next baby with Down syndrome lovingly tucked in her mother's womb, you will look at that mommy and see me, then tell her the truth...Your child is absolutely perfect.\""},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"10153517502611770","commenter_b":"She should give all her money away","commenter_a":"What an idiot","post_message":"You can't make this stuff up, folks."}]
