[{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"\"There’s something called CEQA in California...\""},{"comment_id":"10153069426151770","commenter_b":"GIVE ME A BREAK. !!!!!!!! WHITE LIVES MATTER. LATINO LIVES MATTER. ASIAN LIVES MATTER. NATIVE AMERICAN LIVES MATTER. BLACKS ARE NOT THE ONLY ONES THAT MATTER","commenter_a":"Blue lives come in all colors, both sexes all nationalities. What a moron.","post_message":"TheGrio, the segregated NBC News website, and MSNBC claim racism and \"controversy\" in caring about the lives of police officers."},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."},{"comment_id":"1930654800491749","commenter_b":"Those idiots need to be kicked out of our country, not immigrants","commenter_a":"What a creepy group of corruption.","post_message":"That was quick –> Most national security advisors spend more than two and a half years in the job. Mike Flynn topped out at 24 days before resigning last night. President Donald Trump and Vice President Mike Pence claim they did not understand that Flynn was regularly in contact with Russian officials, including on the day Barack Obama imposed sanctions on Russia for interfering with the US election. That relationship could become the subject of investigation in Congress — at least one Republican, Marco Rubio, wants more information and has suggested combining it with a broader investigation into Russian meddling. To echo a Watergate-era inquiry from the late Sen. Howard Baker, “What did the president know and when did he know it?”"},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."},{"comment_id":"398088506982411","commenter_b":"Send them back to where they came from. They have no rights....they aren't AMERICAN citizens!!","commenter_a":"deport every one them but their country dont want them either they dont know the meaning of being human it seems","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."}]
