[{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send \"must pass\" legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"10153797001880329","commenter_b":"This bitch you can order your kid what you want ...she's ignorant as hell I would have whooped her ass","commenter_a":"It was called marcy's diner in maine and this is what the owner posted. Threatening to get physical. She is a dumb cunt. And this is someone from maine.","post_message":"Neugebauer's diner has recently become the center of a massive controversy after she yelled at a screaming child."},{"comment_id":"10157246765295294","commenter_b":"Deport this piece of crap!","commenter_a":"He can be charge with a misdemeanor for starting a fire with out a permit","post_message":"An expression of free speech? Or a crime? That's the debate sparked by this man's arrest."},{"comment_id":"10154376028466509","commenter_b":"He's dead lady.","commenter_a":"Biden would be a better president than Hillary.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address.   #SOTU updates: @webpagelink"},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"10156589848265354","commenter_b":"Lady, please don't be ignorant....","commenter_a":"Ted Cruz , and Marco Rubio are not eligible to be president , neither is Obama ! BOTH parents must be citizens of the United States !","post_message":"Ohhhh boy...."}]
