[{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"10153127700606491","commenter_b":"That females are equal to males. Google the definition of feminism. That's all it is. Males and females equal. No enforced culturally engrained gender roles. It goes very deep.","commenter_a":"Amazing that no one commenting but me is for gender equality! I thought it was 2015 :( oh well you can't teach ignorant adults I suppose.","post_message":"\"Every child is an individual.\""},{"comment_id":"912438275556018","commenter_b":"I'll bet you make your Momma proud, dumb ass","commenter_a":"Thank you Obama.","post_message":"You got to check out this interview... Could he possibly be any DUMBER??"},{"comment_id":"10152910744010779","commenter_b":"I believe that you're a dumb whore.","commenter_a":"Can you guys just NOT send me this one in the mail? Thanks.","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"10153327078532411","commenter_b":"So this really can happen? My phone is usually under my pillow","commenter_a":"@username can I have electronics in the bed","post_message":"This is why you don't sleep with your cell phone."},{"comment_id":"485625238294723","commenter_b":"Deport her ass","commenter_a":"This woman is a trouble maker and more behind her... Send her back if she cannot obey our system. This goes for anyone, anyone's religion. By the way does she have automobile insurance>> Is she a Citizen of the USA??????","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"}]
