[{"comment_id":"1465398613511181","commenter_b":"Beyond stupid . Just be careful and keep your ear anus clean !!!","commenter_a":"Afiya Tavera Cunningham","post_message":"Doctors are once again letting us all know that you should not use Q-tips in your ears."},{"comment_id":"10154291489851130","commenter_b":"*woman","commenter_a":"I am a women and I agree with pence!","post_message":""},{"comment_id":"10153160211535950","commenter_b":"No shame on you for not thinking outside the box, you are a ver naive women","commenter_a":"Why do people think that only adults can die of natural causes?? accusing them of covering something up is truly sick. Shame on you.","post_message":"YouTube star Caleb Logan of the Bratayley family died suddenly at age 13, his mother confirmed: \"This has come as a shock to all of us.\""},{"comment_id":"10153347951697144","commenter_b":"that's most likely it - when people camp out, they live somewhere, and the fault line between public and private gets blurred.","commenter_a":"why didn't they want the press there?","post_message":"Finally."},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"1112252572119545","commenter_b":"We have BOTH problems: 1. too many guns, too easily had, by too many people. 2. We don't take care of people who are mentally ill. Rather (thanks to Reagan who closed the public hospitals) we either put them on the street, or we bake them first in prison, and *then* put them on the street. Europe takes care of both of these problems much better than we do. That said, the statistics are clear, countries that have more guns, have more gun-related deaths and injuries. Guns within easy reach are far more likely to do harm than good.","commenter_a":"Today another mass shooting of children by a mad man which took place at almost the same time Republican mad men held unethical hearings about the falsehoods that Planned Parenthood are killing children for profit. If the Republicans wanted to investigate a terrorist organization that is solely responsible for the verifiable mass death and carnage of America's children, and other innocent lives, they'd be investigating the National Rifle Association and its members. It's time we realize the NRA and Republican cohorts are terrorist organizations and the Democrats are as guilty and cowardly to do anything to reign in this insanity, as they too are as beholden to NRA dollars as the Republicans. If these were Muslims murdering our children at this rate instead of deranged Caucasian white men, who make up the majority of the Republican voters, all of the Mosques would've been leveled and Muslims would have been rounded ...","post_message":"Another day in America."},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."}]
