[{"comment_id":"10150640777899999","commenter_b":"Did she send that message on her illegal server?","commenter_a":"Donald Trump- the gift that keeps on giving. Signed Hillary Clinton","post_message":"Donald J. Trump promoted tweets that called Megyn Kelly a “bimbo” and that said she “bombed” as a debate moderator."},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on \"feminazzi\" :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."},{"comment_id":"10155189580834411","commenter_b":"@username ... Crawl back down your sh!thole!","commenter_a":"Everyone should boycott Israel. They are an apartheid state with no regard for international law. The bulldozed over 100 homes in the first week of 2017.","post_message":""},{"comment_id":"10153214035528433","commenter_b":"Russ, that is exactly what legalizing same sex marriage will do. No church will be forced to perform a same sex marraige, but some already do. Heterosexuals are considered married if they have a civil ceremony, so why do we need some 'different' classification just for same sex couples??? That is called 'seperate but equal' and was ruled on by the Supreme Court in the 60s. Seperate is NOT equal.","commenter_a":"Why is civil union treated exactly like marriage between a man and woman not good enough for the homosexual activists??? IMO these radical activists just want to stick it to those with strong religious beliefs.","post_message":"Today, the Supreme Court hears oral arguments about same-sex marriage. Here's some fact-checks on the issue. bit.ly/1GyIiZb"},{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"10153644045081037","commenter_b":"Democrats do not want her. She can go away now.","commenter_a":"It's mean she's a Democrat, Yahoo.","post_message":"Should the candidates be concerned that a large portion of the “people” reading their tweets are fakes?"},{"comment_id":"1079865505382241","commenter_b":"This video is retarded. Women aren't funny.","commenter_a":"Adam Isaacs","post_message":"There's an absurd stereotype that women aren't funny."}]
