[{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing...  Is Sharia law in America a major concern of yours?"},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":""},{"comment_id":"10153365058753984","commenter_b":"Absolutely! They are bully cowards! It's going to be like exterminating roaches! We've let them go way too long!!!","commenter_a":"Yes","post_message":"This is scary. I pray America doesn't see further acts of terror from this group, but it sounds like these jihadists have something else in mind...  Would you support wiping out ISIS?"},{"comment_id":"494202484098498","commenter_b":"Do they want her cause America doesn't want or her trashy ole man and her entire trashy family oh and take Bruce with them too","commenter_a":"If you vote for Hilary , I'd be scared as much as she travels.","post_message":"Is Kim Kardashian West a secret agent? @webpagelink"},{"comment_id":"1089539017791300","commenter_b":"Hillary belongs in jail! Do your job Congress.","commenter_a":"I would think about why she dosen't answer the question","post_message":"This state rep took a huge stand against Hillary and even called her out at one of her rallies.  But the rep had no idea what she had gotten herself into.  Now she says she carries a gun because of what Hillary's goons have done to her."},{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":""},{"comment_id":"10154380383764091","commenter_b":"Hoe shut up!","commenter_a":"Thank gawd he is out! Worst president ever. They want to praise the south side of Chicago,but have done nothing to help the killings in the city where they got their start. Turned their backs on them","post_message":"\"You've made me proud. You've made the country proud.\" President Barack Obama gets emotional as he takes a moment to acknowledge his wife, First Lady Michelle Obama. @webpagelink"}]
