[{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"10152859683207434","commenter_b":"@username is a pathetic cesspool. Pandering feminist Cosmo garbage","commenter_a":"Lenny Kravitz’s dick fell out on stage. Look at it dangling. Kravitz was performing at a show in Stockholm on Monday when his (perhaps cock-ringed) penis came tumbling out. Just as the rocker was getting low to the flo’, the D broke out from its restrictive leather pant cage and gave the world a show.Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction. Is it a beautiful thing? Who knew.","post_message":"Note how the tongue and the penis simultaneously present themselves during this tragic wardrobe malfunction."},{"comment_id":"10153080670828721","commenter_b":"ITT: Idiots. Everywhere.","commenter_a":"No matter what does someone have something -ve to say","post_message":"ConnectHome is a pilot program through which Google and other Internet service providers will give free or low-cost Internet access to 275,000 homes in 27 cities across the country."},{"comment_id":"10153387072137869","commenter_b":"Agree, illegal must not be here in American Soil to live and receive any government aide at the first place.Gosh, our Social Security money and taxes we are paying will be given to these illegal people who enter here in our country. BTW, before you No Brain people forget, we have more American Citizens who are diasable, and have low income but working who needs help from our government and now, who gets more benefits, these illegal. Enough is enough.","commenter_a":"STOP THE REFUGEE PLAN! Obama you are shameful sir, putting Americans in harms way! At least France understands what we are up against! You are not a King! We need to cleanup DC and his cartel and vote them all out 2016. Implement term limits and background checks to stop the corrupt career politicians. We want leaders who will enforce our CONSTITUTION the SUPREME law of the land. Enough is enough! Vote Donald trump 2016","post_message":""},{"comment_id":"10153783824626523","commenter_b":"she's hideous","commenter_a":"Who cares","post_message":"Chelsea Clinton has given birth to her second child, a boy."},{"comment_id":"10154770011654330","commenter_b":"Janine Beekman","commenter_a":"Thanks Malloy u duetch bag get out of office u suck !","post_message":"The drug company, Bristol-Myers Squibb, is shutting down several of its facilities, including one in Wallingford. ----> @webpagelink"}]
