[{"comment_id":"10153664912304726","commenter_b":"There are Syrian refugees already there!!","commenter_a":"Yeah, let the refugees all live at the vatican. they got lots of money and plenty of room.","post_message":"The Vatican keeps out the throngs while the Pontiff urges the U.S. to open borders."},{"comment_id":"10154739260431509","commenter_b":"2","commenter_a":"Let's make a small poll: 1- Donald Trump 2- Hilary Clinton","post_message":"What was meant to be a fun day of riding roller coasters at the amusement park turned into a very scary ordeal for this family."},{"comment_id":"10155534707951509","commenter_b":"Hillary is going to prison, The wicked witch is dead.","commenter_a":"Black people don't vote for Hillary Clinton. In 1994, she signed the mass incarceration bill with her husband, which put many black people in prison for small related crimes. Trump wants to fix the black communities, get a better educational system, and invest more in the schools. Vote for Hillary and black people will be suffering for another 4-8 years, just like the last 8 years when we had all these promises that never came.","post_message":"Michael Dale Vance Jr., the Oklahoma fugitive who authorities said shot two officers and killed two of his relatives last week, was killed in a shootout Sunday night, according to the FBI's Terry Weber."},{"comment_id":"10153724000373132","commenter_b":"Then she will have another kid.","commenter_a":"If she's stupid they will. So yes they'll end up back together","post_message":"In this week's PEOPLE, we learn why Scott Disick blew a second chance with Kourtney Kardashian.  Do you think they'll ever get back together?"},{"comment_id":"10153059352079342","commenter_b":"Sick sick person, wonder how she would like that done to her. She looks mean! Glad she is not my grandmother.","commenter_a":"guela knows","post_message":"A grandmother from southwest Houston is accused of burning her 12-year-old granddaughter with a hot tortilla pan after the girl got in trouble at school for writing on the chalkboard.  FULL STORY---> @webpagelink"},{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"1692899604103495","commenter_b":"She is a skank","commenter_a":"Chelsea Clinton is the poster child for white privilege.","post_message":"She CANNOT be serious."}]
