[{"comment_id":"10153288026778690","commenter_b":"Spruce your using a fake name little woman . Punk","commenter_a":"I am iranian kurd . This is embarrassing . At the end morons stop fighting in the whole region . U are arabs killing arabs . Who cares about sunni shia garbage . It's like being in gang . Who cares what u believe . It's your choice . Stop cutting heads . Stop killing other minorities in other countries . We are all human being . Relax people . This is what non muslims want","post_message":"Yemen's president asks UN Security Council for military intervention to halt Houthi advance. @webpagelink"},{"comment_id":"10153134477163984","commenter_b":"Already too late!! Enforce the law that is already on the books, secure the border and there would be no need for immigration reform and less deportations!!! No jobs for the American Citizens now, so let's grant amnesty to 5 million illegals!! That will get the economy and the job market rollin!!!","commenter_a":"No person has every done more to harm the best nation in the world than this man ! I am surprised a patriot has not shot him by now ?","post_message":"This is one of the scariest things I have read in a long time. If Americans don't wake up, it could soon be too late.  Spread the word about this danger."},{"comment_id":"10155026953658812","commenter_b":"lol except this lady started it in 2000 so moms the stealer lol","commenter_a":"@username it's like moms!!","post_message":"“Back in 2000, I got out this plain white tablecloth and put it on the table and my teenage kids looked at me like I was crazy when I said, ‘I want you to sign this tablecloth.’ Then a few years later the [grandkids] came along and now we have 16 years of memories on the tablecloth.”"},{"comment_id":"10153760568196162","commenter_b":"I wish except i don't think my mom would know how to play the lotto lol!!!","commenter_a":"@username your mom won","post_message":"POWERBALL WINNER: Someone in Michigan just won the second largest Powerball jackpot this year. @webpagelink   The winning ticket is worth $310.5 million.  Here are the winning numbers:"},{"comment_id":"880395268723393","commenter_b":"She was armed with a deadly weapon. I hope she suffered.","commenter_a":"She was probley scared when all those security came at her with guns drawn thats why she tryed to move the car. Hands on steering wheel not reaching for wepon. They didnt have to shoot her.have you noticed all the killings for petty crimes like selling cigerettes, stealing a pk of cigerettes. Being homeless, even jaywalking or talking back to police. This is not a good situation. Real criminals who rape and torture getting away with it because the police would rather arrest or kill someome who is not a threat. I am ashamed of the police who do these things and the other cops who watch and do nothing and of the law that always finds brutal cops innocent. I am afraid of the police many people are. Since when should we pay for a legalized brutal mob. May god help us","post_message":"New details emerge about the 2013 shooting of an unarmed woman on Capitol Hill."},{"comment_id":"1563584047268472","commenter_b":"Our society does not need assault weapons!!!The politicians have blood on their hands, because of their inaction when it comes to the NRA!!!!","commenter_a":"President Obama tried to enforce stricter gun regulations but Congress voted against it. They voted for individuals on the terror watch list to keep rights to own assault weapons and now they're blaming Isis. How convenient.","post_message":"This is infuriating.  Image by Occupy Democrats, like our page for more."},{"comment_id":"1561091183908226","commenter_b":"I'll contact everyone of these cunts. I'll fly our and found your bitch ass into the ground since they are so profoundly sure I am not the face of death they never danced with. Boom...","commenter_a":"Boo hoo, my pussy hurts because I didn't get my war queen!","post_message":""}]
