[{"comment_id":"1247830038560637","commenter_b":"Don't care! Neither of these boobs is worth 2 shits under a bird! Garbage on two feet both!","commenter_a":"NEVER WILL BE THE BEST FIRST LADY. GO TRUMP.","post_message":"Will voters care about controversy over Melania's speech?"},{"comment_id":"10154568442846336","commenter_b":"Stupid","commenter_a":" him","post_message":"During a press conference, Secretary of State John Kerry suggested the media should stop covering terrorism \"quite as much.\" @webpagelink"},{"comment_id":"10152853716122894","commenter_b":"I get tired of hearing about this lil hoe everyday","commenter_a":"Biancaa Ft Blue","post_message":"Watch: Kylie Jenner Gets 'High as F*ck', Tries Popeye's Chicken for the First Time [Video]"},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"}]
