[{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"1748877948703805","commenter_b":"Always been there for women? She doesn't even pay equal to men in her own foundation and campaign. Bernie's \"socialist destination\" is s fulfillment of FDR's vision. Hillary will fulfill the Koch brothers and Walton family's vision. I don't revere poverty, nor do I support buying an election and using electoral fraud to gain office. No, Bernie won't \"part the Red Sea,\" but the electorate he is inspiring will effect a revolution.","commenter_a":"It seems to me that the Super Bernie people are caught up in useless passion over issues that are neither new or original. I distinctly recall when Mrs. Clinton went to capital hill and pitched for universal healthcare on live television. She was eaten alive, but she stood her ground as she has on the grassroots level many many times. She's always been there for women especially where wages were concerned. And there is so much more. Mr. Sanders is not a bad person but it is a bit disinginuous to ride the democratic train to get to a socialistic destination. It's also unfair to insist that anyone who has made the system work for them is a bad person. Bernie is no more deserving of reverence for the money he doesn't have than Hillary for the money she does have. She worked for hers' and he worked for his. ...","post_message":"Time to unify the party."},{"comment_id":"914685108573277","commenter_b":"Speaking of the specter of 72 virgins...I wonder if the aforementioned knuckleheads ever consider whether those promised virgins are male or female?","commenter_a":"Take off and landing from a carrier is inherently very dangerous. Glad the rescue folks did their job successfully as trained. Go Navy!","post_message":"The US Navy says one of its fighter jets has crashed shortly after launching from an aircraft carrier in the Persian Gulf."},{"comment_id":"1603818663247762","commenter_b":"The Lying Queen","commenter_a":"The Clinton Crime family song Dirty deeds done dirt cheap AC/ DC Clinton Crime family song","post_message":"WATCH: Hillary Clinton news conference on FBI investigation."},{"comment_id":"842653202518126","commenter_b":"Let them go to hell","commenter_a":"Bunch of Stinky Asses","post_message":"In Obamaland... Islam rules. @webpagelink"},{"comment_id":"10153563054238984","commenter_b":"Stop!","commenter_a":"Subject Prophecy Fulfillment At the time of Messiah's coming, Israel would have unfit leaders. Zechariah 11:4-6 Matthew 23:1-4 The Messiah's brothers would disbelieve him. Psalm 69:8 John 7:3-5 The Messiah would be the \"stone\" rejected by the Jews. Psalm 118:22 Matthew 21:42-43 The Jews would have a hardened heart against the Messiah. Isaiah 6:9-10a John 12:37-40 The Messiah would be a \"stumbling stone\" for the Jews. Isaiah 8:14 Matthew 21:43-44 The unbelief of Israel's leaders would force the Messiah to reject them. Zechariah 11:8 Matthew 23:33 The Messiah would stop ministering to the those who rejected Him. Zechariah 11:9 Matthew 13:10-11 The Messiah would be distressed over the Jews unbelief. Isaiah 49:4 Luke 19:41-42 The Messiah's own people would not believe he was the Christ. Isaiah 53:1 John 12:37-38 The Messiah would be rejected. Zechariah 11:12-13b Matthew 26:14-15 The Messiah would be rejected. Isaiah 53:3 Matthew 27:21-23 The Messiah would ...","post_message":"This former governor can speak from firsthand experience, and that experience has her taking a BIG stand for 'The Donald.'  Do you agree with Jan Brewer?"},{"comment_id":"1032417423454977","commenter_b":"Plenty of bullets in Texas","commenter_a":"I have some extra rat poison","post_message":"After the state's next two executions, Texas will be completely out of its lethal injection drug."}]
