[{"comment_id":"1717651245149172","commenter_b":"You're 100 % missing the point","commenter_a":"I love Bernie but these supporters are idiots. Throwing real money? How about using that money to feed the homeless and poor? Im sure Bernie would be just fine with that. I hate radicals. They do what they do for the spotlight and not for what's right.","post_message":"Well, this is certainly one way to get your point across…"},{"comment_id":"10152993022307217","commenter_b":"We really don't like immigrants here. Go back to your country, HitchBOT! Stop stealing American jobs that nobody wants.","commenter_a":"I'm very sorry it happened. I wish we could have done a well as everyone else. It would have been awesome if we could have sent to Australia.","post_message":"HitchBOT crosses Europe and Canada but is smashed to pieces in the US"},{"comment_id":"10154940269859614","commenter_b":"Sorry @username but there is no place for white gangs here in California . Many Latino gangs are backed by dangerous cartels. White racist trailer trash should lay low or move to another state and spread their hate. If they try to Lynch a Mexican or African American, they will get decapitated.","commenter_a":"I know I may sound vulgar for saying this but they better not pick fights with the wrong people here they will get shot at lol","post_message":"A white supremacist gang known as the SFV Peckerwoods, which authorities say has operated at three homes close to schools and a library, is the target of L.A. city prosecutors and LAPD.  \"We're now fighting to prevent white supremacist gangs from infesting neighborhoods. They bring with them  this toxic mix of violence and crime and hate,\" the L.A. city attorney said."},{"comment_id":"10153813591902293","commenter_b":"Jealous women!","commenter_a":"Hmmm.....now what kind of people would call in and complain about a woman's bare shoulders......any guesses?","post_message":"The station received several e-mails during the broadcast complaining about her bare shoulders."},{"comment_id":"10155773912215093","commenter_b":"So republicans in the 1950's can change the national motto of our country and put it on our money but in 2015 we can't have a woman on a bill? Ok then.","commenter_a":"The government takes all our money through taxes and health care se we won't ever see it anyway. Bummer","post_message":"An absolute outrage -- and here's why."},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."},{"comment_id":"10154219562119197","commenter_b":"Germaine Riley Another imbecile spewing really nice politically correct names, hey you .... smarten up !","commenter_a":"So very sad ! Obama should be impeached because he is not keeping us safe !","post_message":"We are continuing to follow updates on the deadly mass shooting at an Orlando nightclub. Here's Kevin P. Hogan WFSB with an update on what we know now."}]
