[{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"\"I don't wear a toupee. It's my hair, I swear,\" Donald J. Trump said."},{"comment_id":"1776934572577306","commenter_b":"I will be voting for Hillary, because trump is grabbing pussy","commenter_a":"If you still plan to vote for HilLIARy after this, you must hate Trump more than you love your country. Think about it. Long and hard. Is your pride worth placing an untrustworthy, corrupt criminal, who flippantly handles our national security, in the highest office in the land?","post_message":"Hillary Clinton's campaign is waging a full-out war on FBI Director James Comey in the final 10 days of the election."},{"comment_id":"10154121579688132","commenter_b":"Kendra Hill Graham..she was crazy like a fox and a filthy pig to boot!","commenter_a":"Wow! Mental illness is real. She is disgusting! May God bless the children involved.","post_message":"Police officials are calling it \"one of the worst neglect cases\" they seen in Concord, California."},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":" Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"4646614632067289","commenter_b":"Need to enforce the laws illegal out of this country!","commenter_a":"Anybody coming into the United States should abide by all laws of the United States for the customs or any other law if not coming through customs legally stay out if you did not come through customs legally get out you have no right to be here illegally that's the law like it or not that's the law abide by it or stay out","post_message":"Do you agree?"}]
