[{"comment_id":"1134766366641566","commenter_b":"nasty ass niggas","commenter_a":"Only if they cut it up for me @username @username","post_message":"Would you? #WSHH"},{"comment_id":"10153100561240329","commenter_b":"She's a pornstar","commenter_a":"I'm like how'd she land that job..like what conversation took place..how's was the interview conducted..do u interview her or her vagina","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10154228017338797","commenter_b":"Girl I'm glad u werent","commenter_a":"@username @username this actually happened at my job","post_message":"FLAP OVER FLAPJACKS: A Chicago woman has been arrested after police say an argument over all-you-can-eat pancakes got out of hand at Denny's."},{"comment_id":"1202477846449826","commenter_b":"Everyone must have nice hair & a nice outfit. Women have to put in more work Rich Nguyen","commenter_a":"You can pretty much say the same thing about men. If you come to an interview without a snazzy haircut or a fine tailored suit, I can bet that it becomes a disadvantage.","post_message":"Women shouldn't have to wear makeup to succeed at work."},{"comment_id":"915008615188661","commenter_b":"The other race of women say the same things, they just not on here.","commenter_a":"Good for him, this happens to men all the time. The women on here that are outraged are the type of women that men should stay away from. Nothing worse than a hypocrite. I can't help but notice that the women that are upset are mostly black. Very telling","post_message":"Tasha Smith forced to pay ex-husband $7K a month, in addition to the $50K she gave him last year @webpagelink"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."},{"comment_id":"10154563720189087","commenter_b":"Religion and government is intertwined...Muslim ban that include pushing Christian refugees to the top of the list. Unconstitutional violates church state seperation however her trump wanta to also allow tax exempt churches to be allowed to donate to politicians. And if you don't understand why that's wrong please re-read your constitution.","commenter_a":"I am so proud of Muslims, Hispanics & Women. To be abused and treated so badly by Mango Mussolini, and to still hold their head so high, is truly wonderful!\"","post_message":"President Donald J. Trump: \"I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!\""}]
