[{"comment_id":"10153373281922434","commenter_b":"@username debates anything that's pro-woman.","commenter_a":"Why should I believe a man who says, \"Fighting for us\"? Women are an afterthought in those situation, a \"rising tides lifts all ships\". I have never bought that line in total. If you say a man can fight for women, then a women can fight for men. Men need to deal.","post_message":"\"Consider her slogan, 'Fighting for us.' For many men, this slogan would have to be experienced as emasculating. A woman fighting for them?\""},{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"650948841696821","commenter_b":"Yup","commenter_a":"@username smh crazy sheeeet","post_message":"Damn."},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it \"crazy\" to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living \"off the grid.\" THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."},{"comment_id":"10153283544784170","commenter_b":"Stick the crust between her buns. She'll never know.","commenter_a":"Straining so hard to see what isn't and not see what is. Sad.","post_message":"A word of advice to the legacy media:  If this is the best the Clintons can do with their \"re-branding exercise,\" you should jump ship immediately.   ...Because this is absolutely pathetic. VIDEO."},{"comment_id":"1125703734163047","commenter_b":"@@username, The same amount as your kind that got arrested for having sex with goats and dogs. Bitch ass.","commenter_a":"George Zimmerman and Dylan Roof both caught beat downs in the same day. Today was a good day.....","post_message":"George Zimmerman was punched in the face for bragging about Trayvon Martin's death! After the well deserved sock to the face he called 911 in a panic #WSHH #GeorgeZimmerman #TrayvonMartin #RIP"},{"comment_id":"10152739568860779","commenter_b":"Get off Kobain's dick, retard committed suicide.","commenter_a":"Jody Bombay VanderZouwen buy me this !!","post_message":"Kurt Cobain appears on the cover of our latest issue, on newsstands today. In a 1994 feature, David Fricke looks back at the Nirvana frontman's music and legacy. \"As a man of riffs and letters, Cobain was a sly dog who rarely stooped to the obvious…nothing in Cobain's music was ever quite what it initially seemed; his best-known song was named after a deodorant,\" Fricke wrote."}]
