[{"comment_id":"10153716144117577","commenter_b":"Your talking bullshit.","commenter_a":"I am an athiest so it's all bullshit to me anyway ... but you god nuts hate the pope because he is too close to what (if he did exist) christ would have been like .. do you not remember the part in the bible where jesus said \"there is more chance of a camel passing through the eye of a needle than a rich man getting into heavn\"? .. what about his whole ghandi/ john lennon peaceful hippiness .. \"let he who is without sin cast the first stone? .. and what about how jesus spent a lot of time hanging out with the poor, sick and prostitutes .. and he fed them and helped them .., some of you extreme conservative \"christian\" extremist terrorist CUNTS should actually read your bibles once in a while ... O and by the way ... if you are a good \"christian\" why ...","post_message":"Pope Francis has strong ties to socialism and even communism and is helping to destroy the faith of the Catholic Church from within, as Infowars journalist Kit Daniels explains."},{"comment_id":"1209790529075949","commenter_b":"Jill Stein has no chance but at least you are not voting for Hillary. Thanks for that","commenter_a":"Bernie, this is but another example of you and Jill Stein agreeing on things. You two are the only ones who care about the people. You should reconsider your endorsement of Hillary. I know you endorsed her because you promised to support the democratic nominee, not because Hillary is a good candidate and not because you expect her to keep her promises of the few progressive things she's claimed she'll push for. I undersrand the implication of going back on your promise is a political no-no and would be used against you if Hillary loses. You'd be blamed for Hillary losing. But still you should consider Jill Stein. You know the USA needs a new Populist Party. You know that the only reason that made the Democratic Party progressive and gave us progressive presidents like FDR is due to there being strong progressive third parties back then to compete with ...","post_message":"If we are going to take on the fossil fuel industry and protect our planet, I need Zephyr Teachout by my side in Congress."},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"},{"comment_id":"1084778228228546","commenter_b":"they go around and touch people like mother theresa What is your POLICY?!","commenter_a":"The only barriers I have is the hidden files on JFK. Please be more of a transparent President and release all of the hidden files regarding my (past life) assassination. Thank You, very much.","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"922540534474731","commenter_b":"DO IT! I am afraid that he will fire them all and replace them with illegals and give them citizenship.","commenter_a":"I'll support police officers","post_message":"Cops Threatening To Turn Their Backs On Obama At Annual Police Memorial Friday  @webpagelink"},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"993754734001845","commenter_b":"Yep she is the one who will carry on his legacy and bring in as many illegals and muslims for us to support until we no longer have a country to call out own while she and Billy relax in their luxury cabin located in some foreign land,, NO THIS bitch can not be allowed into any public office after this!","commenter_a":"I hope when they arrest her they freeze all her assets.","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."}]
