[{"comment_id":"1586196515000795","commenter_b":"Then duck tape her ugly ass mouth","commenter_a":"she's just another stupid liberal bitch, who doesn't deserve to live in this country. she shold go live in some isolated place, where her rants and raves can go un-heard.","post_message":"Way to go Tom Selleck. Rosie is just so rude."},{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."},{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."},{"comment_id":"10152660171235950","commenter_b":"My favorite science fiction tv show and movies i like them all i grew up watching Star Trek Spock was my favorite","commenter_a":"I have been and always I shall be your friends. Star Trek II.","post_message":"What's your favorite \"Star Trek\" moment involving the Enterprise's chief science officer?"},{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."}]
