[{"comment_id":"10154822738529369","commenter_b":"You know she had to be shitting her pants up there","commenter_a":"Shell be alright it another Trump curve ball","post_message":"A Clinton campaign representative told NBC News that the campaign had \"no idea\" what Comey was referencing in the letter he sent Congress on Friday."},{"comment_id":"1700724426879591","commenter_b":"Fuk Oprah. She had her run and time. Its over now. Another billionare who knows whats best for others. Sit down and shut up Oprah.","commenter_a":"Is Oprah muzlim Is whoopie they sure fighting for them hard and they killing all American people plus Christian people","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10152564458982623","commenter_b":"Pure trash . Should have ran over her .","commenter_a":"Idiot.","post_message":"It's the video everyone is talking about.  The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"10156282327890294","commenter_b":"screw u u hateful witch\\\\","commenter_a":"Society isn't the problem. Men dressing like women and visa versa is the problem. Also, walking in to traffic is a problem. Don't walk in to traffic. Don't blame other people for your actions.","post_message":"“From a very young age I was told that people like me are freaks and abominations, that we are sick in the head and society hates us. This made me hate who I was, \" she said in the post.    She asked others to share her story and said, \"Please help fix society;\" then she did something heartbreaking:"},{"comment_id":"1078684138859436","commenter_b":"How far out to sea is that wall going to stretch? Must be like that wall in Game of Thrones that can keep all the nasty people from taking to boats. Once Trump develops this wall technology he will make billions selling the idea to Europe and I bet they let him put his name on it in big gold letters!","commenter_a":"There will be no wall","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"684886304977884","commenter_b":"I wonder the same thing when I see those clowns busting out the tricorn hats and teabags.","commenter_a":"Don't these people protesting have jobs?","post_message":"I wish there was a LOVE button on Facebook."},{"comment_id":"10153981290586519","commenter_b":"@username The war was based on a racist desire to see Arabs burn. That's why the American people wanted it. The goal was simply to slaughter a few hundred thousand of \"them\" after 9/11, and that racism is something Clinton and half her fellow elected Democrats knowingly pandered to.","commenter_a":"The ideological purity of the Left gave us 8 years of Bush while sitting out the midterms. Sanders and his dead-enders repeat every bullshit right wing talking point. Tired of him and then.","post_message":"Establishment liberals have an unhealthy relationship with the left."}]
