[{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"1212505538766794","commenter_b":"Karma's a bitch.","commenter_a":"Well there goes this investigation out the window. An admitted ammosexual is heading This investigation. .","post_message":""},{"comment_id":"968194983273556","commenter_b":"The bitch sucks and is a liar and a cheat","commenter_a":"Is she your next President? I don't think so.","post_message":"She still managed to pay herself back the $1.3 million she lent her disastrous campaign."},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what \"shackle & hoist\" looks like."},{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"537038436486736","commenter_b":"PUKEBAG, Tax-evading, racist POS!","commenter_a":"What A Joke HE IS DEFINATELY TALKING OUT HIS ASS NOW","post_message":"Dr. Alveda slams Al Sharpton for comparing himself to MLK on live TV.  Al Sharpton and MLK should never be used in the same sentence.  Do your agree Al Sharpton is a criminal?"}]
