[{"comment_id":"880834145309668","commenter_b":"Yeah the cunts wife found out through facebook hahah","commenter_a":"@username Will Woods","post_message":"It just keeps getting worse."},{"comment_id":"10153722774708984","commenter_b":"God's Son, Jesus, was sent to Earth as a baby. Grew to be a man, ministered to people healing the sick, performing miracles, teaching about God's Kingdom. Was rejected by His own Jewish people, suffered and died on a cross. Arose from the grave the 3rd day, talked and ate with His disciples, talked to 500 people before ascending into Heaven to sit at the right hand of God, and to prepare a place for us. If we accept Jesus as the Son of God, repent of our sins, God is gracious to forgive us and save us from eternal death. We will live in peace and love and joy in our eternal life. Jesus said \" I am the Way, the Truth, and the Life, and no one comes to the Father God but by Me.\" As for me, David, I KNOW He lives in my soul. Also, I ...","commenter_a":"There is a little truth in all religion so who is to say what is right or wrong but no one's have any biasness at work or in or government god is only a word that represents all religion. Leave it in your heart's and at home or where ever it is that you warship. We are all equal no matter what I don't want any of them I have my own. No one or nothing can take that from me. Try believing in that.","post_message":"Boom! Mike Huckabee just dropped one EPIC line about Hillary Clinton and Kim Davis that will have liberals absolutely livid. He is putting himself on the line big time for this county clerk, and many are joining him in it.  Do you support what Mike Huckabee is doing?"},{"comment_id":"10153866172049411","commenter_b":"Jews can suck a dick","commenter_a":"Satanism and Islam are the same thing","post_message":" dudes have offered to escort Muslims and Sikhs afraid of hate-attacks for groceries and elsewhere."},{"comment_id":"1328806503882265","commenter_b":"I bet most of these women pretending trump troubles them are the same willing to kill an unborn child at 13 weeks","commenter_a":"The whole family should crawl back in that BLACK WHOLE THEY CAME FROM..","post_message":"Donald J. Trump's son defended his father's comments caught on tape, saying other men make similar remarks."},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"1696699610390161","commenter_b":"She deserves prison put her there please then we won't have to see that disgusting face of hers","commenter_a":"Total investigation","post_message":"Does she deserve to go to PRISON for breaking the law?"},{"comment_id":"403639093305500","commenter_b":"LEGAL IS THE WORD... What's a phony!","commenter_a":"Riding on the coattails of his dead son, he will burn in hell...","post_message":"Watch as the ACLU and Gold Star father Khizr Khan hold a news conference on President Trump's immigration ban.  Read more about Khan: @webpagelink"}]
