[{"comment_id":"443593739098554","commenter_b":"Trump is just what the republican party needs, not a bunch of politians who won't stand up and not do anything but run up the debit and let all these illegals in. Everything he said was right. He did not say all Mexicans are bad. Ya'll need to get your facts straight. I think you jealous because Trump is get more respect and he is leading over ya'll. Trump is a smart man and he wants to make the country better, what are ya'll doing to improve things so far!!!","commenter_a":"Well, so far, Trump is the only one to actually stand up on his hind legs and tell the absolute truth about the ongoing invasion of our homeland. All the others mealy-mouth around and mince words, afraid to offend the \"Latino\" voters, the cheap-liberal-votes lobby, or the cheap-labor lobby. Word mincing won't get it done.","post_message":"Rick Perry had these harsh words for fellow presidential candidate Donald Trump. Do you agree with him?"},{"comment_id":"1245414865499369","commenter_b":"Bad argument ladies...gentleman... Whatever you started out as","commenter_a":"If it's not a mental illness then they don't need therapy, you can't have it both ways... But oh wait, that's what you people do anyway lmmfao","post_message":"The bill goes directly against most counseling associations' codes of ethics. (via The Huffington Post)"},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10154150197679714","commenter_b":"It'll crack her make-up!","commenter_a":"Maybe they want to see you smile because they want to see you happy. Happy is a beautiful thing. It's not show me your boobs and make ME smile.","post_message":"So how should Hillary Clinton — or anyone — respond the next time it happens?"},{"comment_id":"10153690862048812","commenter_b":"@username number 2 would be thugees not thugs","commenter_a":"Over rated NFL attention seeking drama thug using his kids for media attention.","post_message":"NFL star James Harrison strips his kids of their participation trophies. “These trophies will be given back until they EARN a real trophy.” @webpagelink"},{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"}]
