[{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"10153384887696491","commenter_b":"Forget you guys, she doesn't go out with peasants from the first lion order..","commenter_a":"@username yo daisy might be there when it opens","post_message":"Prepare for a smaller world at Disneyland"},{"comment_id":"10153279094626051","commenter_b":"Get her out of there before she does any more damage.","commenter_a":"Kim Davis is where she belongs for disobeying the LAW.","post_message":"Hillary Clinton says Kim Davis belongs in jail. Do you agree or disagree with her?"},{"comment_id":"10153561186861323","commenter_b":"Unfortunately that's just not true. Gangs control the production in the UK just like they do everywhere else. @webpagelink","commenter_a":"80% of cannabis consumed in the UK has been grown here. Your argument on that level is invalid.","post_message":"Jay Rayner: \"We are, it seems, living in the age of the wonky moral compass: of middle-class couples who swear by their weekly organic veg box, and yet relax after dinner with a line of something produced by impoverished, subjugated Bolivian peasants.\""},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"},{"comment_id":"408553512676250","commenter_b":"Eat dicks @username, you dumb fat bitch.","commenter_a":"I, a citizen of The UNITED STATES of AMERICA, am calling for the immediate arrest and trial of Barack Hussein Obama for treason, under Article 3 section 3 of the United States Constitution, for aiding and giving comfort to our enemies. If you agree, please copy and re-post.","post_message":"Montana is fighting the Syrian Refugee policy to the end. This is amazing. Can we get 95,000 ‘LIKES’ for Montana?"}]
