[{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"1052165474817204","commenter_b":"Problem with getting help for these people is that they have to realize they have a problem and want to get help. Otherwise, it's a moot point.","commenter_a":"Why take his photo down? This is the poster boy for the NRA. His photo along with the rest should be displayed everywhere guns and ammo are sold.","post_message":"Chris Harper, 26, had posted on a blog about the TV reporter and cameraman who were shot dead: \"Seems like the more people you kill, the more you're in the limelight.\""},{"comment_id":"1137364809637709","commenter_b":"Love you Scotland just stay safe","commenter_a":"Go Scotland ❤️","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"1728567140790384","commenter_b":"Probably gonna be built by the illegals","commenter_a":"Let's do it!! Give jobs to citizens.","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign.  MORE: @webpagelink"},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"10154140633222093","commenter_b":"cash him ousside howbow dah?","commenter_a":"Loss prevention people were sleeping on the job.....ha","post_message":"ARE YOU HAPPY TO SEE ME? Man steals guitar by stuffing it in pants, walking out of Fort Worth store... @webpagelink"},{"comment_id":"826031280920782","commenter_b":"She's just disgusting to look at..","commenter_a":"About time now she can pack so she can leave !!#!!","post_message":"Liberal trash has no place on tv.  This is the best news all year.  Do you think Whoopi deserves to be kicked off the air?"}]
