[{"comment_id":"10153583217394712","commenter_b":"I'm getting hit with smokers tax and I don't smoke. Time to divorce my wife and let her and kids go on state insurance and I'll pay penalty !! It's the American way.","commenter_a":"Up up and away....the never ending story of insurance rate hikes. We pay. $1200 a month as it is....SMMFH","post_message":"The state's largest insurer says they are dealing with more than $100 million in losses and other issues that have driven up costs."},{"comment_id":"1251273681614205","commenter_b":"They need to build a wall around Chicago... after all the illegals show up the murder rate will soar even higher","commenter_a":"Because chiraq has so much extra money laying around.","post_message":"Dem Chicago Mayor Rahm Emanuel just created a legal fund for the roughly 150,000 illegal immigrants in Chicago"},{"comment_id":"10154321857710575","commenter_b":"Another loud mouth fat bitch and if you want to live se some weight cut off your head","commenter_a":"If you think this woman is a hero, go get your gun and shoot yourself with it, it is a better choice than what is coming","post_message":"Unbelievable . . ."},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."},{"comment_id":"10155588637195389","commenter_b":"Amen!!! Good post...","commenter_a":"Every police officers in this country should take their badges to the white house and give it to the biggest racist in the country.","post_message":""},{"comment_id":"10153335826619714","commenter_b":"Finally!!!","commenter_a":"@username Durrah Afyouni Masah Azar @username Maya Maaytah","post_message":"Vogue shoots & profiles Andreja Pejić"},{"comment_id":"1301581083201877","commenter_b":"This guy is pushing an agenda !!!! Creepy","commenter_a":"Mercy","post_message":"Really? Maybe if Christians had more walls, the Muslims wouldn't have conquered the Middle East and large parts of Europe from the 7th to the 10th centuries."}]
