[{"comment_id":"1197826636921341","commenter_b":"Yeah. Pointing out the extremely horrifying problems of a crime filled cesspool part of a city and a counter culture no one is allowed to talk about unless theyre approved by liberals first is totes narcissistic. Gtfo.","commenter_a":"He wasn't making it about him, he was saying this will stop! They twist everything!","post_message":"\"Glad you’re not making this about you. Whew!”"},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."},{"comment_id":"711540485694496","commenter_b":"The noose tightens.","commenter_a":"Deport him to Russia","post_message":"Dems bringing pressure."},{"comment_id":"10153384160134087","commenter_b":"RINO","commenter_a":"And we should listen to Kasich because his numbers are so high? Isn't that why he was on the end?","post_message":"“I don’t have anything against Mr. Trump personally, but we’re not going to scoop up 11-and-a-half million people and ship them out,\" said GOP presidential candidate Gov. John Kasich.  \"He’s disparaged Hispanics and Muslims, and he’s insulted women. These are not the things that unify the country and make us stronger.\""},{"comment_id":"10153898072441680","commenter_b":"Hillary has no respect for women! Ask the many rape victims of her husband - they'll tell you so!","commenter_a":"Right on-NBC survey monkey poll!! Ha,ha that's a good one-where was the survey taken,\" at the Bronx and Philly zoos! Did they survey the snakes?? How bout the cheetahs, the rats, the felons??! God help us!!!","post_message":"The NBC/SurveyMonkey poll out Monday finds that 63 percent of likely voters say Trump doesn’t respect women much or at all."}]
