[{"comment_id":"10152769636891636","commenter_b":"One day women will be in charge of everything ! Roll on","commenter_a":"Girl power!","post_message":"Last night, women took back politics from the boys' club..."},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…\" -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"10154742195526178","commenter_b":"The X miss universe is Hillary's friend plus the miss X universe is in a world of hurt on her own now she's in trouble with the law","commenter_a":"RUSH: The thing that's ironic about this, they're claiming that Donald Trump bullied this ex-Miss Universe. Has anybody asked about Hillary Clinton bullying all of the bimbos that have erupted during the course of her and her husband's political career? This is so screwed up. If there is anybody in this campaign who doesn't pay women what she pays men in her office, it's Hillary Clinton. If there's a woman in this campaign that bullies other women and has been acclaimed for it, it is Hillary Clinton","post_message":"Now First Lady Michelle Obama is getting into it with Donald Trump."},{"comment_id":"1758550144422291","commenter_b":"73% approve and still got 4 more months. Dam fine job sir! Hillarys new add kids are watching is stupid thats all she has. Ok hillary kids are watching as you say who cares soldiers are dieing! What a piece of garbage she is time to take out the trash Trump we love you. Voters get out and vote Trump 2016","commenter_a":"Finally a strong leader to be. Mr Trump a country with no borders is not a country. Make America great again.","post_message":"I will not let this country down. I am grateful for everything I have ever been able to accomplish. I want to give back. I want to MAKE AMERICA SAFE & GREAT AGAIN!  -DJT"},{"comment_id":"10154129546231545","commenter_b":"Romo a true gentleman and it took alot for him to do that, better to be up and walking than being in sever pain the rest of your life. Thank you for being a model for the younger players! A true Cowboy. ..","commenter_a":"Luckily, he has someone very close by to talk to about the benefits of being a backup QB on a Super Bowl quality team.","post_message":"Today wasn't easy for Tony Romo.  He's not the starting quarterback for the Dallas Cowboys anymore.  But he handled the situation with dignity:"},{"comment_id":"10153143538491051","commenter_b":"How? A majority of liberal democrats are old rich white men todd","commenter_a":"Wrong... And you can bet the white scum liberal will go after the American Flag next... Americas biggest threat, the white scum liberal...","post_message":"The Confederate Flag's 54-year run at the South Carolina statehouse is officially over. Do you think that was the right decision?"},{"comment_id":"10154294125329614","commenter_b":"Just in case she was looking for fame .....","commenter_a":"If this is the only problem, what we face as a nation , we are doing great ;)","post_message":"KTLA meteorologist Liberte Chan and the morning news team address the dress moment from the show over the weekend that has gained national and international attention."}]
