[{"comment_id":"10153430639944255","commenter_b":"This woman wants us to return to the 1950s? I guess that means she's going to shut up and make me a sandwich.","commenter_a":"Around 70% of White America does not live in a diverse city as is, and this is the reason for so much suspicion about people of other races, and culture. I am not for this kind of self segregation, but at the same time I do not believe we should be about forcing people to live where they do not now live. Until we learn that people are people this will never change.","post_message":"Yes, this is a real post from a real elementary school teacher in Texas."},{"comment_id":"1383799158379801","commenter_b":"I hate that little bitch","commenter_a":"Omg I can't stand her, I saw her the first time (and the only time) on one American news network, I guess she's not on there anymore. Good, she's awful, she's uneducated, and that voice omg....id rather jam an ice pick in my temple than listen to her.....who decided she had a brain or talent was sorely mistaken......oy.......","post_message":"Your move, Tomi Lahren!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153350644952212","commenter_b":"Bet it was you","commenter_a":"JhonnySSodas what you finess","post_message":"An Oklahoma City Whataburger was robbed at gunpoint early Monday morning #News9"},{"comment_id":"10154102502686509","commenter_b":"haha at all you hatin mf'rs Trumps winning we gonna get that wall built and these isis mf'rs taken care of whether y'all like it or not","commenter_a":"Obama should contest this and say its forged..","post_message":"Donald J. Trump says it's complete with his mother's handwriting inside the cover and the address of his boyhood home. @webpagelink"},{"comment_id":"1192807494093054","commenter_b":"@username Refugees are not illegal. Go troll someplace elst.","commenter_a":"Children are innocent, they can't be held guilty for anything their parents say or do. And my question is how can you hate war refugees, and many of them children, and still claim you're Christian. The tenet of the religion is to care for the stranger, the wretched, and the sick. Not sure what part of that is hard to understand. Jesus was a refugee, and so were his parents, we seem to forget that. Bravo to the troops, they're doing the right thing.","post_message":"Kudos to these vets for speaking out against Trump."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"507799699345070","commenter_b":"yeah right.there only big when they got a gun...fucking pussy hole pigs","commenter_a":"Anyone who hates the cops is an idiot. It's time the police took some control back","post_message":"I keep hearing about this \"war on cops\". Here is more proof that it is actually a war on citizens, not the other way around."}]
