[{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."},{"comment_id":"10156214701425725","commenter_b":"Look at the mad illegal alien","commenter_a":"Look at all the brainwashed Donald Trump fans... Lol","post_message":"Who is winning the debate so far (just last name)? #DemDebate"},{"comment_id":"10155088338670615","commenter_b":"The fact he did beaky at Buckingham Palace means he has risen in my expectations.","commenter_a":"Jamie Taylor","post_message":"We ♡ Stephen Fry! Congratulations to the happy couple!  @webpagelink"},{"comment_id":"10156496631915354","commenter_b":"Send her back, bitch!!!","commenter_a":"She is simply unqualified...","post_message":"This radical Leftist principal is out of control.  The principal's name is Eujin Jaela Kim. And what she's up to will infuriate most Americans."},{"comment_id":"579271598927799","commenter_b":"As a sentence. Send her dumb ass over there and pull her passport, then pull her citizenship and tell don't come back. PS. Take the view with you","commenter_a":"Do Barry proud, he'll probably pardon her.","post_message":"Mississippi woman who attempted to join ISIS pleads GET INSTANT JUSTICE from No-PC Judge"},{"comment_id":"525788244278422","commenter_b":"Look at her eyes, do you really want this ugly, selfish and stupid woman as your president,,,?","commenter_a":"She won`t be done until she takes her last breath. Shes to damn dumb to quit.","post_message":"Hillary tried to hide the truth, but Gowdy refused to give up until justice was served.  This is amazing. Hillary is finally going to pay for her crimes.  Do you agree Hillary Clinton should be arrested for treason?"},{"comment_id":"1009830989039949","commenter_b":"Don't even watch the view anymore.. THose women have so much anger in them.. They never say anything nice about anyone.. Joy was off the show for awhile,, needs to stay off the show.. Just my opinion..","commenter_a":"Who in the Hell is Joy Behar, and why is anybody listening to her or her or anyone on the View?","post_message":"Joy Behar calls out Carly Fiorina.  Is she right?"}]
