[{"comment_id":"10153342820917098","commenter_b":"I am on her side, women now a days are almost naked just to prove that they are sexy.","commenter_a":"Im on her side. Hoes are in their feelings because she feels beautiful and sexy with clothes ON. She clearly didnt have to be half naked to get her man and that should tell you hoes something. Lol Dont be mad, learn something. Know your worth. Get it together.","post_message":"TWITTER DEBATE: Ayesha Curry, wife of Warriors basketball star Steph Curry, found herself in a social media firestorm after tweeting about today's fashion  Many people criticized her for body shaming while others praised her for her modest views. Which side are YOU on??   FIND OUT what she said: kron4.com/2015/12/07/twitter-explodes-after-ayesha-curry-tweets-about-modesty/"},{"comment_id":"549469748549029","commenter_b":"That's y he got molested in jail for being a fucking bitch... Some1 should at least throw some boiling water on him so he can see how that feels","commenter_a":"Ryan Smith","post_message":"Heartless: Scumbag Throws Boiling Hot Water On A Cat!"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"10152777121252217","commenter_b":"Lots of girls called Charlotte if u want to call her it then do nobody will care","commenter_a":"Well we are due a girl in 6 weeks and charlotte was on our list of names 🙈 Well thats not going to happen now because there will be thousands choosing it because of the princess lol","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"},{"comment_id":"10153553565406955","commenter_b":"I can't wait until a loonie lib woman gets attacked by a filthy Muslim","commenter_a":"Muslims versus liberals...this is going to be fun.","post_message":"Topless protesters disrupt Muslim conference in Paris..."},{"comment_id":"10153871025190579","commenter_b":"How many more innocent people must die before we outlaw gun free zones?","commenter_a":"😩😫😨😱Smh... ..... How many more innocent people have to die before we regulate gun control? If we can save (((1)))) innocent person then that's 1 less family that have to suffer in pain because they loss their love one to violence. 😒😞😢 Numbers don't lie. It's time for gun regulations NOW!!!! 😒😞 I understand that there's no way you can get criminals to obey the laws, that's why they are \"criminals \" because they break the laws but we need to make it a little more difficult for them to get their hands on a gun like they did in Australia in 1996 after a mass shooting there .... Law abiding citizens still should have their rights to own a gun for protection hunting and recreation. @webpagelink","post_message":" politics has to change. President Obama answers two questions on guns at a press conference.  Watch the full video here: @webpagelink"},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."}]
