[{"comment_id":"10158601678305354","commenter_b":"And don't forget while wearing a vagina costume ......","commenter_a":"it'd be cheaper just to say \"get the fu_k out!\" stupid leftists just cant bring themselves to be rude or nasty ... unless they are being rude & nasty to conservatives.","post_message":"Desperate."},{"comment_id":"367783356938627","commenter_b":"McDonald's drive thru but taco bell taco...hmmm🤔","commenter_a":"China Navarro Faviola Quiralte @username Natalie King","post_message":"Gotta be more specific  #WSHH"},{"comment_id":"500328103497004","commenter_b":"@username your mom is another uninformed voter. Now I'm voting for Trump just so you and your mom get hassled by immigration.","commenter_a":"Let me get this straight. Trump can beat Hillary, but he can't beat Bernie? So by voting for Hillary...you're basically voting for Trump?","post_message":"Is Bernie Sanders harming Hillary Clinton's chances against Donald J. Trump? Here's what he has to say about it. via Today Show"},{"comment_id":"10153867352421756","commenter_b":"No, it actually wasn't. Students were allowed to carry. The fact that students were allowed to carry may explain how the shooter got to the classroom carrying a long gun without being stopped. He wasn't doing anything illegal until the second he opened fire. Surprise, everybody!","commenter_a":"survived the army to be shot in college, go america","post_message":"It's emerged that the 30-year-old father ran at the attacker, trying to block the door to a classroom to protect his classmates — and suffering several bullet wounds and two broken legs in the attempt, according to his family."},{"comment_id":"10154431251561491","commenter_b":"Well women really do do more domestic work.","commenter_a":"\"This is especially true for women, who researchers suggest should limit their work hours to 34 hours a week; men should limit hours to 47 hours a week. That because, according to Dinh, men spend less time doing domestic work.\" I understand not overworking ourselves...but y'all could have worked a little overtime to make this article a little more fleshed out and a little less sexist.","post_message":"Listen up, workaholics."},{"comment_id":"1210841148970887","commenter_b":"Be honest, if it was anyone other than Trump, would you STILL vote for her? Fact is she would have already packed up her tent and left town to sell more books if this was 't Donald frigging Trump she was running against? That's something to be proud of? The second worst? You see that's where a candidate needs to be a good candidate to get my vote. In my book she's not, if your Presidential standards are that much lower, ok, vote for her. Mine aren't.","commenter_a":"Sorry Bernie, but I can't sit here and watch you degrade yourself into just another shill for her. You used to hate what she stands for. Now you endorse it. I hope you find your way again Bernie. But for now. I gotta unlike ya.","post_message":""},{"comment_id":"1212963008739156","commenter_b":"Will you force women to wear less since less is \"liberating\"? What gives you the right to choose for anyone? What's next? Fat people can't wear bathing suits? Pretty girls have to wear short skirts? No one... NO ONE has the right to decide what someone wears. Change laws to promote freedom. Let them choose. Don't choose for them. Clothing doesn't oppress any more than guns shoot people. People oppress. Change that.","commenter_a":"It oppresses women. Before everyone says it's s their religion, it was taught to them by a man. And yes all religions use other ways to oppress women that should stop as well. I always find it odd that people champion the right form them to \"choose \" what oppression the want to follow.","post_message":"A new country is debating banning burqas."}]
