[{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"10154563050778010","commenter_b":"Tell that to the people that hire them....I've seen good ole Americans urinate on the street...it's not an illegal thing","commenter_a":"The only ones complaining they can't find a job are Americans...meanwhile illegals are busting their butts to support their families ..","post_message":"Most Americans believe immigrants in the country illegally are just as hard working as U.S. citizens."},{"comment_id":"10154547365036756","commenter_b":"@username . Some were royal flushed and forced to eat their perpetrators feces .","commenter_a":"you guys just don't understand the pressure of defending your homeland against New Zealand AND Tasmania.","post_message":"The physical abuse, one victim said, was \"systemic, traditional and commonplace.\""},{"comment_id":"378200662557944","commenter_b":"Three of them are real ladies - the other two cannot even spell the word!","commenter_a":"Nancy Regan","post_message":"Who is your favorite First Lady ?"},{"comment_id":"10152763354566051","commenter_b":"kill the bitch","commenter_a":"They need to wrap her head completely in duct tape !!","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"1027338487301572","commenter_b":"I agree with you , Carol. But, Illinois law forbids us from asking for ID at this point in time.","commenter_a":"Going back many years to JFK's election to the presidency. He won by a very slim margin. Cook county Illinois (Chicago's county) had many votes cast by people who were dead. It is still happening but in many more states. Everybody should have to show a legal picture ID before voting.","post_message":"Voter Fraud is REAL!"}]
