[{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"10153374746118812","commenter_b":"Reality check she removed all courage and self respect leadership. What is he but a man in training....... Whites love when we humiliate each other to protect the massa. She need to know she planted a seed that will resp bitter fruit","commenter_a":"Asllan Kacanolli Flamur Kacanolli","post_message":"He's the boy seen around the world being forcefully pushed from the Baltimore riots by his mother. And this is what he has to say about it..."},{"comment_id":"10155570976260603","commenter_b":"A woman of her word. Bet that room is clean.","commenter_a":"Crazy old bat.","post_message":"She told her grandchildren that if they didn't clean their rooms, they would lose their pets. The family cat was later found in the freezer.   Robin Smith KMOV is in Madison County finding out more on this animal cruelty case and the possible punishment she could be facing on News 4 at 5:00."},{"comment_id":"1131610686905195","commenter_b":"@username back your claims up with citations and credible sources! @webpagelink","commenter_a":"Bernie says it best, \"You've got some middle class people working longer hours for lower wages -- they pay their taxes, they support their schools, they support their infrastructure, they support the military. But the billionaires? No, they don't have to do that, because they have their friends on Capitol Hill. They pay zero in taxes. So Trump goes around and says, 'Hey, I'm worth billions, I'm a successful businessman. But I don't pay any taxes. But you, you make $15 an hour? You pay the taxes, not me,'\" he said. \"That is why people are angry and want real change in this country.\"","post_message":"Millions of Americans work hard and pay their taxes. So why doesn't Donald Trump pay his?"},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10154384594879705","commenter_b":"@username which of these girls is overweight? What weight should girls be according to you Bill?","commenter_a":"Ten bucks says that all the people saying they're disgusted are the same people who get pissed when someone calls a thin girl 'too thin' because apparently body positivity is only for bodies YOU feel positive about. Right.","post_message":"No photoshop, no frills."}]
