[{"comment_id":"10153582550231336","commenter_b":"Hi Donald Trump, what about putting those illegal people in the row to go fight against IS IS if they want to stay so bad. The America way!!!!just a thought.","commenter_a":"Hillary will send food stamps.","post_message":"In an interview, Donald J. Trump said that he would deploy U.S. troops to Iraq to seize ISIS-held oil fields, in order to choke the financial spigot that fuels the terror group."},{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."},{"comment_id":"1212344615481226","commenter_b":"WHAT THE HELL IS WRONG WITH THIS WOMAN?????","commenter_a":"Another sold out politician who went off the deep end...","post_message":"Goodness gracious..."},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."},{"comment_id":"10154094458574087","commenter_b":"What a bitch. She's utter trash. Go kiss your daddy. Seems like a thing you're into to.","commenter_a":"Ivanka needs to quit playing around and marry me already.","post_message":"Ivanka Trump returns fire after an interview in Cosmopolitan magazine turned unexpected heated."},{"comment_id":"10152647217041680","commenter_b":"Oh no!!! Millions of jobs added with deficits cut by more than half!!! Stop the tyranny!!!! #TeaPartyFail","commenter_a":"Only 679 days left of Scum Monkey Rule.","post_message":"German Foreign Minister Frank-Walter Steinmeier was reacting to a letter signed by 47 Senate Republicans warning Iran that any nuclear deal it strikes with Barack Obama will be non-binding and easily undone. @webpagelink"},{"comment_id":"10150900817029999","commenter_b":"Well Said and Thank You!","commenter_a":"Have the rest of you bothered to read his comments? He says he does not hate the flag. Does not hate America. He doesn't sound \"spoiled\" to me (and I am an affluent, old, white guy). He has used his position to stimulate conversation about a very important issue. (Why IS it that a lot of black people out for a walk end up getting shot without many repercussions?) I like the guy (except when he plays the Broncos!)","post_message":"Colin Kaepernick explains his protest against racial injustice.  Read more: @webpagelink"}]
