[{"comment_id":"983450188381396","commenter_b":"Sal khan would you stop blaming anyone appart from your pals?!?!? Europe did this, US did that. Wake up.","commenter_a":"Islam for you. Peadophile third world cult. Enough said","post_message":"Sickening."},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"10153047179116051","commenter_b":"What does being a feminist have to do with anything?","commenter_a":"WHAT an awful person. Take the baby and give it to someone who will love it.","post_message":"Police took one look at this mom's Facebook photos and arrested her immediately."},{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"1257498034286119","commenter_b":"I this this guy is secretly obsessed with pussy lol","commenter_a":"QUESTION: How can you call yourself a patriot and support 33 Benghazi hearings but NOT ONE on whether Russia infiltrated the White House...?","post_message":"Drip. Drip. Drip. Republicans in Congress need to drop the political charade and help us get to the bottom of this."},{"comment_id":"1123460471025521","commenter_b":"The mother is as full of crap as the child.","commenter_a":"Instead of asking the whole world to conform to ones abnormality or difference how about assisting that person to deal with their abnormality/difference in such a way as to not draw negative attention. If one is a diabetic the whole world does not need to eat a diabetic diet. If one has a limb removed does the whole world remove a limb? Honestly I see no difference. We all have differences and we learn to deal with them, not expect others to suffer or deal with it.","post_message":"Watch this amazing video as the mother of a \"trans\" teen makes the most outrageous claim possible about North Carolina's new HB2 law.   What do you think about this mother's claim?"},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"}]
