[{"comment_id":"10154978304691037","commenter_b":"How many more horny female teachers will yahoo report?","commenter_a":"Another ungrateful millennial.","post_message":"The 29-year-old will serve two years behind bars."},{"comment_id":"876486519053475","commenter_b":"Lmao Andrea the slut","commenter_a":"Lmao. These hoodrats can have armpit hair all they want. They'll be single and starved for cock. Noone wants chewbaccagina.","post_message":"There's a viral discussion being had over sexism..."},{"comment_id":"1055522267818446","commenter_b":"We're sick of Reruns. Turn the channel. Clintons are history. Make them go away.","commenter_a":"Close, but no cigar","post_message":"“Donald Trump has called your dad an abuser of women, and your mom his enabler. What do you think of his attacks on your parents?”"},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"}]
