[{"comment_id":"10153258279033010","commenter_b":"Just give her a whiff!","commenter_a":"The trophy wife gets the gold mine and the kids will get the shaft.","post_message":"Robin Williams' three children are at odds with his third wife over what constitutes \"memorabilia.\""},{"comment_id":"10153036151346545","commenter_b":"That's nothing to brag about. we may be the majority but we also hold the majority of the most least paying jobs because most of our \"people\" are uneducated. Illegals are the worst part of our society. My family came here legally, so should everyone else's.","commenter_a":"we are the majority not the minority #vivalaraza #razaunite","post_message":"If only there was some sort of reality show catchphrase we could use at a moment like this to sum up NBC's break with the \"Apprentice\" star..."},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"},{"comment_id":"10153670096417869","commenter_b":"Can we share this with credit of course?","commenter_a":"It been a busy week. In the past ten days, the Trump Campaign joined the KKK, sucker-punched a Bernie supporter, attacked peaceful protestors, abandoned NATO, exported nuclear weapons to Japan and South Korea, spilled-the-beans on Heidi Cruz, outted Ted Cruz in a sex scandal, beat-up a female reporter, dropped nukes on Europe and the Middle East, and punished women for having abortions. These acts would be incomprehensible were it not for the fact that Donald Trump hates Mexicans, hates our trading partners, hates our stupid leaders, hates Muslims, hates women, hates blacks, hates reporters and Bernie supporters, and hates women having abortions. How can he claim to want to Make America Great Again, when he so clearly - hates Americans? There is no answer. Unless we look to the words of the candidate himself. According to The Donald: 1) He disavowed KKK David Duke endorsement; 2) He didn mind a ...","post_message":"There are a couple of twists in the story of Trump campaign manager Corey Lewandowski, accused of misdemeanor battery for allegedly grabbing the wrist of former Breitbart reporter Michelle Fields.  He was not arrested as some outlets initially reported, but voluntarily signed a “notice to appear,” a misdemeanor summons.  And an anonymous Secret Service agent on Trump’s detail claims that what Fields did could have easily resulted in a much harsher response.  This story has the latest:"},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"951788561528283","commenter_b":"Sociopath with narcissistic delusions of grandeur, infantile anal expulsive ideology and penis envy. The bitch is a mess.","commenter_a":"Is he gonna cwy...poor widdle ting","post_message":"McTurtle can dish it out...but he sure can't take it. SHOCKING!"},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"}]
