[{"comment_id":"749014911913950","commenter_b":"Is it possible..he can sink much lower? any bets.....again I'm speechless..he gets to just say things like this with absolutely no consequences at all!!...well..here's one consequence: VOTE BLUE UP AND DOWN THE BALLOT AND GET ALL THESE BIGOTS OUT OF OFFICE; OUT OF HOUSE AND SENATE ...","commenter_a":"Scum . Bottom feeder","post_message":"Now Trump's after dying people. See if you can stomach this. -- Annkia"},{"comment_id":"10152763206590950","commenter_b":"I guess she thinks shes all that.....but no!!!!!","commenter_a":"I do not care that the towing company is predatory, this cashier just works there and does not own the company. Try yelling at the cashier at Walmart or some other heinous company because you hate the company or corporation, same thing. Misplaced and misdirected hate is never productive and just shows your true character :(","post_message":"A pretty television personality opened up her mouth and showed a lot of ugliness in a video that went viral this week. Washington D.C. reporter Britt McHenry was caught on camera giving the business to an impound clerk while retrieving her towed car. Now the people on the other end of her tirade are responding."},{"comment_id":"1766923240187480","commenter_b":"What is the purpose of the wall on the border of Guatemala, I for one am sick of the illegals working here not paying taxes but taking their wages back to mexico and supporting their families over there.. Is this perhaps why a wall is not in the best interest of mexico?","commenter_a":"@username that's probably the truest state I have heard yet! Hilary is a monster and yes gets away with anything Would be impossible to impeach!","post_message":"Mexico's foreign minister Claudia Ruiz Massieu dismissed Donald J. Trump's campaign promise her government would pay for a U.S.-Mexico border wall."},{"comment_id":"1285291914863987","commenter_b":"Another Muslim bites the dust !!!","commenter_a":"Thank you sir","post_message":"The police officer who shot and killed The Ohio State University attacker has been identified as Alan Horujko. @webpagelink"},{"comment_id":"10153217644964411","commenter_b":"Lmfao ro. What about the natives in Mexico? Forget about them you spaniard?","commenter_a":"Fuck off back to America - youu are needed there to fight the police!","post_message":"'The whole purpose  is to assure those allies that live closest to the Bear that we are here,' Lt. Gen. Ben Hodges, commanding general of US Army Europe said."},{"comment_id":"10154223180398984","commenter_b":"Go get a life lady","commenter_a":"Sounds like Trump paying someone else to do his DIRTY work. Why not talk about all the mistresses of Trump. It must be the big bucks from Trump.","post_message":"Wow, I didn't expect Anonymous to be the next one to come after Ted Cruz, and the hackers are claiming something BIG..."},{"comment_id":"1016517215129884","commenter_b":"@username why is she disgusting? It was a slap in the face. Hillary is supporting criminals.","commenter_a":"Yeah kind of a huge slap in the face! I like what sheriff David Clark said...it's a convention for the compassion of criminals...DISGUSTING!","post_message":"\"To have [Michael Brown's mother] come speak... is a travesty. It is a slap in the face of law enforcement.\"  Moments ago on \"The Kelly File,\" Kevin Jackson slammed the Democratic Party for featuring Michael Brown's mother at the convention. @webpagelink"}]
