[{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights \"Freedom of Religion\".","post_message":" girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.\""},{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"1557919144505066","commenter_b":"Absolutely! The party comes first to Republicans.....the people and the country are not important until they can be used to the advantage of THE PARTY. Sad","commenter_a":"Honestly, I'm worried about 'merica if trump is such an overwhelming decision for them to make. Consider the members of the Republican party, they're going to vote trump because he's not a Democrat. That means, party alliance is more important to them then things like racism and ignorance. Give me a break.","post_message":"President Obama slow jammed the news and also talked about Donald J. Trump, Hillary Clinton and Bernie Sanders."},{"comment_id":"10152728783180950","commenter_b":"No China, it comes from China !","commenter_a":"Florida.. of course..","post_message":"\"We're starting to see a rash of cases of a syndrome referred to as excited delirium.\""},{"comment_id":"922507297858399","commenter_b":"Ms. Miller, I'm a proud supporter of Mr. Trump. I'm so concerned that with Ms. Clinton's ability to \"Fix\" things she may have the ability to fix the election. I'm a true believer that this also happened in the current Pressident's second election. I am afraid that the Dem party will be in place for many years to come with the young and uninformed youth being targeted supporters through free things offered to them as well as dead people and illegals voting. . I'm hoping I am very wrong though. God help us.","commenter_a":"Wow!! While speaking on fox news live right now Mr trump actually seems presidential. This is the tone and demeanor we, the people have been asking you for. Let hillary bury herself. She will!!!! Be a better man. Be the man America needs. We want to believe that you can lead us but not unless you can start to act and sound like a good president.","post_message":"Radical Islamic terrorism threatens our world. Anyone who cannot name the enemy - cannot fix the problem!"},{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A \"Racist\" [VIDEO]"},{"comment_id":"1250137068360096","commenter_b":"@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"}]
