[{"comment_id":"489966784527235","commenter_b":"Fuck em and feed em pork","commenter_a":"Yes.","post_message":"Radical Muslim group CAIR orders that Obama exempts them of this.  They are dangerous, and so is our president.  Do you agree that Obama is a threat to the United States?"},{"comment_id":"10154186390606336","commenter_b":"Just stop. Women are not physically equal to men.","commenter_a":"They should open up the navy seals to women","post_message":"✓ 36-mile race ✓ 8-kilometer swim ✓ 25 obstacles   Her reason for completing the race? She was bullied in school. (CC: U.S. Navy)"},{"comment_id":"10153351172732439","commenter_b":"When will Americans recognize that these bitches in our country are breeding our enemies.","commenter_a":"Deport her ass NOW","post_message":"@webpagelink"},{"comment_id":"10152694344065736","commenter_b":"Stupid woman","commenter_a":"But, it's fine to hire a\" doctor\" to kill your baby. That's logical.","post_message":"An Indiana woman's self-abortion has thrust her into the debate over reproductive rights."},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10153083416063984","commenter_b":"Stoopidbitch","commenter_a":"Doesn't it just make you proud?","post_message":"Obama will not meet with Israeli Prime Minister Benjamin Netanyahu, but he'll meet with these 3 YouTube sensations? Priorities..."}]
