[{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"\"There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.\"  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"10154093101217452","commenter_b":"OMG. You must be a plant. No one could be that ridiculous.","commenter_a":"We are no longer fighting soviets obama. Russia is a friend in the war against ISIS.","post_message":"\"Ronald Reagan would roll over in his grave.\""},{"comment_id":"1364681343563732","commenter_b":"@username DA MAO POW!!!","commenter_a":"Kaaren Eric","post_message":"When a  meets a .   Check out more of our panda videos here: bbc.in/2hI4DPR"},{"comment_id":"10154862382515329","commenter_b":"OHHHH yes yes darkest timeline better forgotten","commenter_a":"April Corey","post_message":"You're gonna want to grab some tissues for this one. // Dawson's Creek"},{"comment_id":"10154771811749411","commenter_b":"Basket of this, Bucket of that...Ms. Clinton seems to have a container to stick all of us in. Apparently, we're not much to be concerned about. To my mind she's a big pile of ***t,...bring your own shovel. No need to place her in an urn or other bucket-like container, just toss it in with the other compost and let her continue to decompose.","commenter_a":"I've seen a number of articles on \"alternative\" news sites claiming wikileaks is falsifying all this stuff. Kind of sad that people would go so far to bury their heads in the sand rather than even consider the thought that a candidate which rigged a primary is capable of so much more. #HillaryforPrison","post_message":"The sheer number of insults in the email trove has left the Clinton campaign unable or unwilling to respond."},{"comment_id":"1031268323551304","commenter_b":"Why is it OK for transsexuals to lure gays into gay bars and not women to attract straight men into a restaurant?.........libtards double standard!","commenter_a":"Uhhh.. What's the problem?? We know this... They know this.. They know that we know this.. Who's getting hurt by this? Do much for women being empowered. They're not helpless..You can't have it both ways.","post_message":"This leaked memo says it all"}]
