[{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"1152891968103883","commenter_b":"She is very cute and beautiful little baby but don't present her like,\" world's most beautiful girl\". You are ruining her childhood, i guess it's already been ruined but better late than never. Let her live her normal life please. I could see her turn into justin bieber like child in the future. He was no doubt blessed child but what media attention has done to him?? Spoliled him forever. One thing more how can you claim WORLD'S most beautiful child? World means 200 countries and over 7 billion human beings! Have you seen all of them?","commenter_a":"Not being funny but kids are cute not beautiful..that really sounds wrong unless it's you perents saying it.","post_message":"The controversial ten-year-old has been dubbed 'the most beautiful girl in the world'"},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."},{"comment_id":"10153224902339411","commenter_b":"Jonathan Toothman","commenter_a":"75% of that data is outdated wrong and non existent. i always give fake info when they ask","post_message":"Quick before NSA snaps it up"},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"10154048889111955","commenter_b":"How does Mexico treat even LEGAL immigrants? Far worse than the USA treats illegals: @webpagelink","commenter_a":"Just like in the movie \"World War Z\".","post_message":"Illegal immigrant numbers skyrocket at Mexican border..."},{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."}]
