[{"comment_id":"650239665120653","commenter_b":"Congress does the budget not the President. Stop passing the buck","commenter_a":"Close off shore corporate tax loop holes. Oh, would that be a conflict in interest? Legalize marijuana. Tax the church!","post_message":"A new Congressional Budget Office report shows that President Obama’s latest budget would leave us with a $486 billion budget deficit for 2015 alone and a deficit of over $7.2 trillion from 2016-2025. That’s just another reason why my first bill in the Senate requires Congress to do its job, get federal spending under control, and pass a balanced budget."},{"comment_id":"967628599952830","commenter_b":"Treason is what most our crooked federal employees should be charged with","commenter_a":"When both the Republican establishment and the Democrat establishment attack the SAME candidate, then you know YOU'VE FOUND YOUR GUY!! DONALD TRUMP for PRESIDENT!! 🇺🇸🇺🇸🇺🇸","post_message":"Uh-oh..."},{"comment_id":"10153661042541523","commenter_b":"You dumb white bitch!! THE SAME WAY YOU CELEBRATED CHRIS FAIRLY, AMY WINEHOUSE, AND THE REST OF THE HEROIN ADDICTS IN YOUR Neighborhoods......I will be so glad when your evil race is nearly extinct! Take your evil back to the caves of Europe!!!!","commenter_a":"RIDICULOUS!! The freak had mental issues and died of an overdose- why would a church celebrate this idiot??","post_message":"A Tulsa church’s tribute to Prince is going viral."},{"comment_id":"10154698288912178","commenter_b":"If anyone would like to help the family they do have a gofundme account .","commenter_a":"They did do a GREAT job...we were actually driving by when all this was happening.","post_message":"Emergency workers were able to rescue a dog trapped inside an Aberdeen home that caught fire this afternoon. Story>> wral.com/@username/"},{"comment_id":"935883909841195","commenter_b":"Hey Bill,,, @webpagelink","commenter_a":"Batchit crazy Bachmann the 2nd....","post_message":"This is how much the Fiorinas are worth."},{"comment_id":"10153068039414586","commenter_b":"Bitch if they could ride a Real tiger they would","commenter_a":"Uhh hello, theres elephants that are raised domestically in zoos and sanctuaries and in places where they're trained. And how would you know they're beaten? And btw horses started out as wild animals so your argument is mute. Pick a side, not just a specific animal","post_message":"PROOF that you don't need to use real animals to amaze a crowd.   CC: Ringling Bros. and Barnum & Bailey Circus #NotOurs2Use   SHARE if you're glad Katy Perry chose NOT to use live animals! #SuperBowl"},{"comment_id":"10154915468813984","commenter_b":"The demasses aren't scared of the end. They're scared none of their demon plans to let illegals run our country will be stopped and their kickbacks will end. Yep it's gonna end. We are not your puppets and you can't control us!!!!!","commenter_a":"right on","post_message":"Ann Coulterjust NAILED it... she is going to infuriate a TON of liberals with this."}]
