[{"comment_id":"868204976635103","commenter_b":"wow u got gender-feminists handing out federally funded dildos and rubbers to 6th graders...and you say \"porn' is the public health hazard?? lol","commenter_a":"Hey hey, this is a serious problem now, let's stop everything and focus on this!","post_message":"What do you think of this development?"},{"comment_id":"1644783155547189","commenter_b":"Not busted, she's been padding HER wallet for a L-O-N-G time! You guys are way late to the game..try doing some reading, I knew this, long ago!","commenter_a":"Meanwhile @ Standing Rock! Energy Transfer Partners, WHISPERS TO THE PROTECTORS YOU CANNOT WITHSTAND THE STORM.TULSI GABBARD, US VETERANS AND THE PROTECTORS WHISPER BACK \"WE ARE THE STORM!!!","post_message":"Busted!"},{"comment_id":"10152843996092293","commenter_b":"White mid-western girls fall for it...talk to your daughters about that life...","commenter_a":"are they really women or","post_message":"The caption: \"chillin in the khilafah, lovin life\""},{"comment_id":"10153936171871813","commenter_b":"Your wifes hot though LOL","commenter_a":"If your not in Law Enforcement nor never have been dont even bother to comment on this post","post_message":"Here’s a way to increase much-needed police accountability — especially when force is used."},{"comment_id":"10154994816928256","commenter_b":"US tax payers are going to pay for that wall that Trump wants built, no skin off his back, he don't pay taxes. Suckers","commenter_a":"Deficits only matter when Democrats run the show. How long until you learn this very simple truth?","post_message":"Republican leaders would not say how they would prevent the massive project from adding to federal deficits."},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"},{"comment_id":"10152594464675927","commenter_b":"Go F♤♤K yourself Hussein, and that thing you call a wife !","commenter_a":"speaking OF \" ignorant\"...","post_message":"You should NEVER apologize for being a proud American.  NEVER."}]
