[{"comment_id":"10154584633716955","commenter_b":"I think she should move to Mexico!!!","commenter_a":"I'm thinking she would have done that whether she won or lost.","post_message":"TIRED HILLARY"},{"comment_id":"10154628102671800","commenter_b":"@username You're saying bullying didn't work in 3rd grade so it won't work now, but most of Trump's campaign IS based on bullying and it's gotten him pretty far. And Trump has had multiple scandals of his own, including email scandals. It's also a known fact that every politician in history has had some sort of scandal in the course of their career.","commenter_a":"And according to James comey if you do what Hillary Clinton did you would be reprimanded, probably fired and have your clearance pulled if not have criminal charges like in the military, but you can still run for president. Oh the hypocrisy. Say bad things, shouldn't be able to be president, compromise national security and the lives of Americans, no problem.","post_message":"Billy Bush was suspended indefinitely from NBC following the leaked Trump tapes.  ►Full video: @webpagelink"},{"comment_id":"10152956106239877","commenter_b":"It always existed except my dark skinned Sista women had it worse.","commenter_a":"True statement Colorism exist","post_message":"'Empire' Actress Grace Gealey: 'I Was Discriminated Against For Being Light-Skinned.' Read more on her revealing statements here.  Grio fam, sound off with your thoughts on all she had to say."},{"comment_id":"10153075013704342","commenter_b":"And then she'll leave...","commenter_a":"idiots, so the what are they going to pay for their new animal sanctuary now that the livestock are not bringing in enough money to feed or maintain the ranch? oh yeah, they'll just do another gofundme scam and a bunch of idiots will pay their bills for them. crap like this is getting ridiculous","post_message":"CATTLE RANCHER GOES VEGAN: For four generations, cattle have been raised on the Sonnen Ranch in Angleton. A few months ago, that tradition ended when the current rancher got back together with his ex-wife, and she pressured him to go vegan."},{"comment_id":"569916976504180","commenter_b":"@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the \"Gay panic defense?\" @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"\"Some things are more important than a rock show.\""},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"695993670581357","commenter_b":"spic is a born liar and sex pervert feel up women in their dreesing room beth midler years ago paid her off .","commenter_a":"Geraldo Rivera .... DISLIKE! Good job, Bill!","post_message":"Clueless liberal Geraldo Rivera and Bill O'Reilly almost had a fist fight live on air when Geraldo said that illegal immigrants haven't broken the law. O'Reilly shoved Rivera's lies down his throat. Man, this is good."}]
