[{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"10153855309638010","commenter_b":"too late on the troops - we're up to 5000 in country","commenter_a":"Just may be very well a Trump supporter making America GROSS again!","post_message":"The woman, who works for the Department of Corrections, was filmed ridiculing a Muslim man for praying and then hitting him with an umbrella and throwing coffee at him."},{"comment_id":"1578043845546293","commenter_b":"Uhhh...Hillary won the election by 2.7 MILLION (and counting) votes.","commenter_a":"Another fake poll.... Just like the poll that claimed Hillary was going to win the election ..... Lie... lie.... Lie!","post_message":""},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."},{"comment_id":"10153598853368984","commenter_b":"How many bullets are flying in your direction in the United States of America from Muslim extremists? How many IEDs are you avoiding on your way to the grocery store? I know we all know on any given day we could face gunfire from our neighbors from all different Christian faiths. If anything you're much more likely to be attacked in the U.S. by an angry Christian than by any other group of faith. The by the number argument that you're safer over seas from terrorist attacks than at home in the U.S. is based on comparing thousands of attacks on militarized institutions over seas and a small number of attacks directed at low security military institutions & personnel in the U.S. I feel for our solders at home being attacked. Just as I mourn for those children being attack in schools around our country. The people in the malls ...","commenter_a":"\"Radical Muslims are now the rule, not the exception\".... Let's talk about this. The Muslim faith has the largest number of believers in a world full of different faiths. To consider turning against all Muslims quite literally means to turn against over a billion people. She said this was the 21st attack. So roughly 21 people of the millions of Muslims living in the U.S. are radicals. I'm no math wiz but that sounds like an extremely small percentage. Secondly, Christians around the world have killed millions of people in the name of a God that most Americans demand our president to believe in. Who are the real radicals? Continuing, a soldier serving/living in the Middle East is absolutely not more safe there from terrorist attacks than one living in the U.S. That comment should be heard clearly as one of the dumbest things ever said. This Ignorance being spread ...","post_message":"This 22-year-old news anchor's brutal beatdown on Obama's \"half-way, half-baked, tip-toe, be-friendly-to-Jihadis mentality'' has been viewed more than 1.4 million times on YouTube, and overnight --  a viral sensation.  Now, she's just revealed what made her speak out.  Do you support Tomi Lahren and her message to Obama?"},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"10155240272548132","commenter_b":"@username go away","commenter_a":"4 beautiful and classy young women! All 4 parents should be proud!","post_message":"The Bush Sisters wrote a heartfelt letter to the Obama Girlsand it's really sweet. @webpagelink"}]
