[{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"10152805684357377","commenter_b":"Bout time someone got a pair! Keep your ducks in a row bro. I'd like to see her in a 4x8 with obstructed view!","commenter_a":"They trying to stop Hillary at all cost.","post_message":"Klayman reveals the details on The Steve Malzberg Show. Watch Newsmax TV on DirecTV Ch. 349, DISH Ch. 223 and Verizon FiOS Ch. 115. Get Newsmax TV on your cable system."},{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"952565694839683","commenter_b":"There's. room for one more clown in the car.","commenter_a":"The clown car is getting full!","post_message":"Another hat in the ring?"},{"comment_id":"10154798309806002","commenter_b":"Women do it too!","commenter_a":"Why would u allow a man to babysit your kids hell no only man I'd allow is my father and my husband","post_message":"A 30-year-old man allegedly molested toddler-age children he was babysitting while living in Michigan."},{"comment_id":"10153974974065329","commenter_b":"Bye bitch","commenter_a":"My belief she is every bit as responsible of what that animal inflicted on the child. As a mother, you are to protect your child by any means necessary. Battered or not she bought that animal in her baby's life and chose him over her child. Save your hate post siding for the battered women of the world the only person I care about that needed defending is the child.","post_message":"Tondalo Hall will not be released early from her 30-year sentence in Mary Fallin's Oklahoma for failing to protect her children from her abusive partner. The man who actually harmed her child got just two years. (via BuzzFeed News)"},{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."}]
