[{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"401829593338668","commenter_b":"How very sad to read this. Our vets are not being taken care of properly and it is a shame. The President cared more for illegals then he does our veterans. Shame, shame.","commenter_a":"Semper Fi marine R I P","post_message":"RIP Marine..."},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"683462628486873","commenter_b":"Thank you for sharing!!","commenter_a":"Every time I attend a sporting event in our great country it infuriates and saddens me at how many \"Americans\" won't remove their hat or stop what they are doing while the National Anthem is played. Well done Mr. Bolt! Thank You for your great respect!","post_message":"A great American..."},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""},{"comment_id":"1105360966151580","commenter_b":"this is some amazballs shit man!!!","commenter_a":"Heh. I know the guy getting his arm controlled. Had some classes with him in high school. Punniest guy I've ever met.","post_message":"Control someone else's arm with your brain, with relatively little equipment."},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""}]
