[{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera.  Do you think Hillary will be the Democratic nominee?"},{"comment_id":"10152924190906336","commenter_b":"Obama, take lessons from them. Hire illegals to build the wall and when it's done, toss them on the other side","commenter_a":"And america welcomes all through mexico.","post_message":"Saudi Arabia is constructing a 600-mile \"great wall\" along its border with Iraq to keep ISIS and other extremists at bay."},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"},{"comment_id":"1700724426879591","commenter_b":"Fuk Oprah. She had her run and time. Its over now. Another billionare who knows whats best for others. Sit down and shut up Oprah.","commenter_a":"Is Oprah muzlim Is whoopie they sure fighting for them hard and they killing all American people plus Christian people","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."},{"comment_id":"1082383445115167","commenter_b":"Looks like a Transvestite Alien. Brucelyn Jenner looks better","commenter_a":"A new level of trashy. Way to be a good role model (insert slow clap)","post_message":"DAMN, TAYTAY!"}]
