[{"comment_id":"521921487998431","commenter_b":"she's a no good racial bitch","commenter_a":"Typical for ghetto trash","post_message":"Michelle Obama just dropped spent an absurd amount of money on something outlandish.  She is the worst first lady ever. We miss Laura Bush.  Does Michelle Obama's reckless spending upset you?"},{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."},{"comment_id":"1061797757169218","commenter_b":"Save Western Civilization? You mean save white people.","commenter_a":"And where was our so called president ??????","post_message":"The prime minister of Israel, Benjamin Netanyahu, gave an historically important speech. A speech that any previous American president could have and maybe would have made, a speech to rally and save Western civilization."},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"1205762199443808","commenter_b":"#trump2016","commenter_a":"Oh boo hoo. Poor baby.","post_message":"\"Fox News has been treating me very unfairly and I have therefore decided that I won't be doing any more Fox shows for the foreseeable future.\""},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"}]
