[{"comment_id":"10157736489990603","commenter_b":"Omg I think it's funny that 12 year olds got onto their parent's Facebook and are saying things like lick my butthole. Classy.","commenter_a":"Wow I knew the average Missourian was dumb but I didn't realize they had a fetish for shooting themselves in both feet.","post_message":"JUST IN: CBS News projects Donald J. Trump will win #Missouri."},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10153958872340695","commenter_b":"@username gotta love these white SLOW voter. I bet you probably one of the slos that was going to vote that dunmy Sarah Palin in who thought Africa was a country....thank God for uninformed black voters","commenter_a":"Go Obama!","post_message":"In a rare Oval Office address President Barack Obama sought to reassure Americans shaken by recent terror attacks."},{"comment_id":"443037622487945","commenter_b":"Lol leftist get out","commenter_a":"Wrong, it isn't the IRS it is all the rich corporate fascists. The pentagon spends how much on the military? I hardly think taxation on the regular guy is so bad, but when the rich fail to pay and the greedy steal it all well, you gotta blame somebody, right?","post_message":"The Anti-Media radio show from tonight can be heard here: @webpagelink"},{"comment_id":"10155086794306729","commenter_b":"What did she care....that bitch was in it for the money.","commenter_a":"Pantsuit Nazi...","post_message":"Wow... Help spread the word folks!"},{"comment_id":"931439316891490","commenter_b":"And the POPE lives in the woods!]","commenter_a":"It may as well be true. He always lies and is immoral and evil.","post_message":"Is this true?"},{"comment_id":"10150728672209999","commenter_b":"Well rebecca I'd recommend finding a director with more credibility before trying to gain traction on this movement. I'm not saying they're unjustified in their claim but Spike Lee is a pos","commenter_a":"Spike Lee hasn't made a good movie in over a decade so who really cares.","post_message":"The outcry over the nomination of 20 white actors, and no black ones, for the coming Academy Awards gained momentum on Monday — MLK Day — as Spike Lee and the Jada Pinkett Smith announced that they wouldn’t be attending the ceremony."}]
