[{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"\"Things are moving quickly now.\""},{"comment_id":"10153356544334087","commenter_b":"Yep.","commenter_a":"Hillary should worry about that indictment coming down the pipelines in January.","post_message":"“This is truly unbelievable, that after what we’ve seen in Paris and other places, Republicans will not bring up a bill that will prohibit anyone on the no-fly list from buying a gun in America,\" Hillary Clinton said. \"If you are too dangerous to fly in America, you are too dangerous to buy a gun in America. How many more Americans need to die before we take action?”"},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"10153153254808822","commenter_b":"You mothersfuckers are assholes","commenter_a":"5 kids and pregnant at 26? Jesus.","post_message":"Targeted or a random act?  Police are trying to figure out why someone shot and killed a local mother of 5, who was also pregnant."},{"comment_id":"1225587407484516","commenter_b":"@username @username ca vaut aussi pour les chats bande de cingle !","commenter_a":"Krushank Shah","post_message":"This is why you should stop letting your dog lick your face."},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."},{"comment_id":"10153220731196234","commenter_b":"She should be fired and thrown in jail","commenter_a":"Should have had her license taken away!","post_message":"The nurse who re-used syringes for the flu vaccine at a West Windsor company has agreed to a temporary suspension of her license."}]
