[{"comment_id":"10156358978545354","commenter_b":"For the record, can't stand the women of the View.","commenter_a":"Too bad she wasn't this sharp in her failed tenures at Lucent and Hewlitt-Packard. She has the nerve to keep getting mileage out of Trump's remarks about her looks. Google \"Fiorina Gaffe\". If the media hadn't kept that video \"under wraps\" while at the same time raking Trump over the coals for his remark, the whole flap about her face would have been a \"non\" issue. She also left her campaign for Senator 5 million in debt and her staffers high and dry. Do your research before throwing support behind her.","post_message":"WATCH Carly run circles around the ladies of \"The View.\" Epic!"},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"1058553324165678","commenter_b":"That's it women take everything, soon they'll be complaining about not competing against men in the olympics, #equalityformen","commenter_a":"Yea thats cute... but look at developers these days... 99% are men. you wouldnt be on facebook talking crap right now without men.","post_message":"Margaret Hamilton was the lead flight software designer for Project Apollo. Just 31 when it landed on the moon, and her code has been credited for preventing an abort of the mission.  #womenyoushouldhaveheardof"},{"comment_id":"10154265505298188","commenter_b":"Ugly woman???","commenter_a":"Ugly jacket!","post_message":"The hypocrisy of these progressives is beyond shocking."},{"comment_id":"859693680734640","commenter_b":"That's definitely not how that works. She would have to legally be a woman with identification as a woman.","commenter_a":"totally disgusting, so any guy can say they are pretty sure they are a woman stuck in a man's body and will be welcome in locker rooms and bathrooms, oh come on!","post_message":"\"I was stunned and shocked.\""},{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"1242790859084298","commenter_b":"She's a wife and mother. Needs to grow up, cover up, and act like a lady!","commenter_a":"Fortunately the majority of police officers are good, hard working people serving/protecting their communities. Are there a few bad ones? Of course! The media really hypes the bad police officers, the knuckle heads looting and destroying communities \"in protest\". Not highlight the wonderful police officers laying their life on the line to protect our butts. Not highlighting the people that truly feel stepped on and are peacefully coming together with all to promote positive changes. \"Be the change that you wish to see in this this world.\" This is what I live by and teach my children. We should be brought together by love, not torn apart by hate.","post_message":"#EntertainmentNews  And the #BoycottBeyonce battle continues...the singer is being accused of using her recent Super Bowl performance \"to divide Americans by promoting the Black Panthers and her antipolice message.\"  Do you agree?"}]
