[{"comment_id":"10153902259248855","commenter_b":"She will","commenter_a":"Can only hope it won't look like don't ask don't tell","post_message":"Will she follow through?"},{"comment_id":"944282629025715","commenter_b":"Yes","commenter_a":"Yes absolutely","post_message":"Yes!"},{"comment_id":"1891107191121894","commenter_b":"America America God shed His grace on thee!!!!","commenter_a":"seems like a funeral more than a parade","post_message":"We're live from President Donald J. Trump's Inaugural Parade:"},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"10153778518101051","commenter_b":"Whore. Really? Are you 14?","commenter_a":"Not defending her but why was the affair discovered two months AFTER she filed for divorce? Thats a little creepy on the ex husband's part.","post_message":"This man suspected his bride was up to something, so he hired a private investigator to check it out. His suspicions were ultimately confirmed and his wife was arrested shortly after."},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""}]
