[{"comment_id":"10153666896386749","commenter_b":"Um. It's 4-4 and been controlled by conservatives for like 30 years","commenter_a":"Essentially, the republicans refuse to allow the supreme court to be anymore liberalized than it already is!","post_message":"Stop obstructing our Supreme Court."},{"comment_id":"1835391226744152","commenter_b":"Def not girl lol. I liked her back in the day but when she got that diva attitude and had the nerve to kill some of my brain cells with Glitter, I was done lol.","commenter_a":"Whether it was her fault or not, I'm glad she fell on her face. Maybe it will bring her diva attitude down a couple notches because she is annoying.","post_message":"WATCH: Mariah Carey's New Year's Eve mishap; what really happened during performance? abcn.ws/2hHJaGj"},{"comment_id":"10156523926480354","commenter_b":"what idiot would vote for the bitch-","commenter_a":"I knew she was cleaning up crap. It continues to spew from her mouth.","post_message":"The QUEEN Shall NOT Use the Restroom With The PEASANTS!!!"},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."},{"comment_id":"10154406866831037","commenter_b":"give me back the days of stong America when it was \"sticks and stones that brake your bones and (words) can never hurt me\" !!","commenter_a":"Weren't people just mad because people get \"artistically enhanced\" to be skinnier than normal? Perhaps they should pick a side an stick to it.","post_message":"Disney's new movie has already sent the internet into a rage."},{"comment_id":"10153615401338010","commenter_b":"I live in a beautiful city in LA County. Our city sales tax is 10.25 per cent. I voted for this sales increase to pay for the improvements that put my city on the list of one of the best cities to live. Low crime, lush, great shopping, great roads, many services, about 15 parks, good schools and I live in a well kept condo complex where my HOA dues are over 300.00. The only blight I ever see are the smelly, stained mattresses and unwanted cheap furniture that slobs leave next to the more than amble sized trash areas. They dump in the middle of the night bec they're too cheap to pay to have them hauled away properly. My neighbors and I have concluded it is the renters here. They have no stake in keeping up the complex. The HOA pays for the removal weekly. The trash man ...","commenter_a":"Disgraceful.","post_message":"Do you have a discarded mattress on your block? How long has it been there? How many times have you reported it?"},{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."}]
