[{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"10153311857346323","commenter_b":"It's an attempt at humour, not political analysis. Lighten up.","commenter_a":"Guardian is now as bad as the Daily Mail , completely biased with dumb pointless analysis , just left versus right , I used to appreciate the Guardian but sadly it has lost its way","post_message":"Bill Brewster: \"The Milibands have arrived just in time for Ibiza's season opening parties, but there are plenty of issues on which they could campaign in Ibiza. There are the young workers on zero-hour contracts who flyer the beaches, often working on a basic of €50 per week. Then there’s the scandalous prices of the leading clubs, or the police, often accused of corruption and being heavy-handed. Mind you, after the campaign he’s just had, if I were him, I’d kick back the slingbacks and hit the horse drugs.\""},{"comment_id":"1224908530916491","commenter_b":"Kaboom, Kaboom no more Illegal Protesters' .","commenter_a":"Abba Father, we thank You Lord for Your anointed and pray for Your strength for the road ahead to exact Your purpose for such a time as this to UNITE AMERICA, ISRAEL'S DEFENDER, UNDER THE ONE TRUE GOD FOR THE GLORY OF YOUR NAME! In Jesus Name, Amen!","post_message":"The group of seven men and three women stood across the inbound lanes holding banners reading #SomosVisible, or #WeAreVisible, and another reading \"Resist, Organize, Rise Up.\""},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"},{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"},{"comment_id":"10152979533166438","commenter_b":"I love Katy, But I did noticed that and it made me laugh. She has no swag! But I think that's part of who she is she knew she couldn't dance for shit but she went and did her thing with a fresh face.","commenter_a":"What makes me laugh is how people are talking about the shark... Did we not notice Katy herself completely unable to move as a quasi-good dance partner with Elliott's dancers?!?!","post_message":"\"We should leave Left Shark alone.\""}]
