[{"comment_id":"1442368625820278","commenter_b":"@username maybe they would consider it if people would stop coming here illegally !! If America is not such a coveted place to be then stay in your country and deal with the shit you are handed !! It's quite simple ! But come here and mooch, steal, kill, sodomize , rape and terrorize then there will be action !! I'm not condoning it who likes war it's ugly but it is what it is !!","commenter_a":"The chinese & north koreans have killed millions, the russians and so on why just nail the USA? Ask China & Russia what their ammo is made from! Chocolates & jelly bean? Really, wake-up!","post_message":"People don't understand how bad this really is."},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"1008713619198681","commenter_b":"She's a BAD example of a women !!!!","commenter_a":"Excellent ... +++","post_message":"Whoever you support in this election, it's important to mark historic firsts - and this is the first time that a woman from either party has won the Iowa caucus."},{"comment_id":"10153478899444342","commenter_b":"Liberals are actually MURDERING people with their stance. The liberals are the real murderers. Did I say that ENOUGH? @webpagelink","commenter_a":"I am not a veteran. These are Christopher's words Christopher Allard 23 hrs · Edited · I don't typically go on rants or express my political beliefs here, but I just have to get this off my mind. As some of you know, I'm active duty Army. Aside from that, I am a medic. I've spent 3 years of my life overseas in both Afghanistan and Iraq. I've seen some pretty atrocious sites caused by war, from both sides. I've picked up blown up body parts of friends and I've saved the lives of guys who were trying to kill me and my guys right before I was keeping them from their 72 virgins or whatever they believe awaits them on the other side. Here is an unbiased truthful view to the Syrian refugee situation. My first deployment to Iraq, in 2006, my unit voluntarily ran a childrens burn clinic ...","post_message":"President Obama is vowing to veto a bill from House Republicans that would increase screening for Syrian and Iraqi refugees before they enter the United States. #abc13"},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""}]
