[{"comment_id":"10154083173838132","commenter_b":"They're usually thrown in an institution from a young age. They don't get job or skill training being they are looked at as \"useless.\"","commenter_a":"This is an awesome story and I am so thankful for the children that have found forever homes. I have one question if these children were left in China would they receive an education?? Or are they just forgotten about?","post_message":"What an incredible moment for these children. "},{"comment_id":"1198210753566421","commenter_b":"She's a hack","commenter_a":"This isn't right. What is wrong with her?","post_message":"CNN HOST To Jill Stein: \"Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?\"...\"Um...no\" [VIDEO]   And then there's that whole issue with one of the states that only uses paper ballots...."},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"},{"comment_id":"10153332076309411","commenter_b":"Remove NATO from their borders","commenter_a":"Russia must stop being aggressive by removing all warships, and submarines, from international waters - these waters belong to the US and its allies, even though they are international :)","post_message":"The 'hunt' is on"},{"comment_id":"1284514134973476","commenter_b":"CJ 😂","commenter_a":"Eric Sylvain 😂😂","post_message":"It really be like that  #WSHH"},{"comment_id":"10152908271969753","commenter_b":"You are absolutely right! She's disgusting","commenter_a":"if a man did this he would get prison time she needs this also..she is a guilty..","post_message":"The married mother-of-two admitted to having sex with the student on seven separate occasions both in her vehicle and at her home."}]
