[{"comment_id":"10153902791784087","commenter_b":"@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"1032286876827841","commenter_b":"Yes most LEGAL immigrants do but not the illegal invaders.","commenter_a":"Immigrants pay more taxes and work harder than SOME AMERICANS.... i know some","post_message":"Most Americans agree: We must provide a path to citizenship for our immigrant families."},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"},{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153727792982217","commenter_b":"Written by a 14 year old, no doubt!","commenter_a":"300 times more massive??? Someone needs sacking and a lesson in English 😂😂","post_message":"After a five-year journey, NASA's Juno Mission to Jupiter is ready to apply the brakes.  #BBCGoFigure"}]
