[{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"10153680098799772","commenter_b":"Support SAFE ACT 1214 hr 1942","commenter_a":"That's just a dummy computer. There is no glow on her face from the screen. There is no reflection of the screen in her eyes. Maybe even she is just a mannequin?","post_message":"Getting ready to start this Facebook Q&A!"},{"comment_id":"10156358709930725","commenter_b":"She's deserves to rot in hell.","commenter_a":"Allie Stoltenberg @username","post_message":"Police are investigating a pet owner after a Facebook post of her dog muzzled with duct tape went viral ----> @webpagelink"},{"comment_id":"10153101086445736","commenter_b":"a burnt pussy lips","commenter_a":"Shannon Linda Harman","post_message":"Thanks to some \"Sound Prosthetics\" Honey and Badger are on a roll."},{"comment_id":"10154593290916037","commenter_b":"Kick all them illegals out!","commenter_a":"it is what he has always said, just all the words are different now","post_message":"Christie highlighted that Trump has said undocumented immigrants will not be eligible for citizenship unless they leave and re-enter through legal channels."},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."},{"comment_id":"727863887335286","commenter_b":", WRONG, No way, get real, he had every right as well as a duty to make the case of Israel to America's ears. I learned more from his talk then from our ever non-transparent utopian president who believes the world will all sing kumbaya together because of his ever lovin idealistic, progressive, warped world view.","commenter_a":"Tha.no Mr john Boehner for inviting The PM. Thank you","post_message":"Do you agree? Jerusalem Post \\\\ Opinion & Blogs"}]
