[{"comment_id":"1267683656603525","commenter_b":"She has totally lost it, poor woman.","commenter_a":"Why can't the average Democrat see the pattern of off the wall psychotic behavior that has plagued the left for decades? Conservatives don't riot in the streets, have \"safe spaces\" where only we are allowed to speak, give participation trophies, or any of the other garbage. Conservatives use facts to make their points and progressives use emotions to emphasize their fake news and rally the infants rally the indoctrinated. The mass hysteria on the left is causing the country to lose focus on the threat of the real danger of the three prong attack on America and the one person at the center of all three. Barack HUSSEIN Obama is race baiting with his attacks on white cops which spurred into BLM attacks on all whites. He openly aids and encourages illegal immigrants. He built and carried in the Trojan Horse Muslim refugee program. Each of these are for the ...","post_message":"Jill Stein's crazy recount effort is over, and the realization of her epic failure launched her into a nutty rant. Stein seems drunk as she starts to shake and yell about Donald Trump, and it's really bizarre. During this strange outburst, she demands Trump  \"put down\" one thing that proves she is also delusional.  @webpagelink"},{"comment_id":"1725568321015816","commenter_b":"I see lots of people who are saying \"see a wall won't help..\" Well the truth is the government doesn't give a crap about drugs coming into this country. They will make their money off addicts and death and jail time. What the government won't make money off of is illegal immigrants not paying taxes. That's the only reason for the wall. The government just wants their cut.","commenter_a":"Nick Cal","post_message":"800-yard-long tunnel found between Mexico and San Diego containing 1 ton of cocaine and 7 tons of marijuana. It's believed to be the longest cross-border tunnel ever discovered. @webpagelink"},{"comment_id":"10156372477690725","commenter_b":"Just another day of gun violence in America while populace is politically (incorrectly) correct. It is a crippled world, American leading the way as it is not in most other categories! Muslims are top o' the list for violence...they can't convert us, so their gut wish is to kill! Facts speak for themselves!","commenter_a":"Trump 2016","post_message":"CRIPPLED AMERICA is perfect gift for friends & family. Order signed copy & join me tonite live streaming 7:30."},{"comment_id":"10154479010956636","commenter_b":"And I've heard real life accounts from people I know who live in Germany. But let me ask you, have you heard what white male Christians are doing in the US? They are the biggest threat at campuses nation wide. Should we not allow them into schools and colleges?","commenter_a":"Big WIN for the people!!! Let the brave Americans welcome doctors, scholars, extended families, and refugees into our Country. I promise we aren't all cowards hiding from the scary muslim doctors. The scary muslim students and those awful muslim grandparents coming for a visit!","post_message":"#BREAKING: A federal appeals court has ruled against President Trump's ban on travelers from 7 countries."},{"comment_id":"10152706820701051","commenter_b":"A lot of the comments posted here are no better then the girls who did this. Nothing but a lot of hate.the girls had no right to hurt anyone.But are you any better.look at your comments.and yes I think this girls should pay for what they did.Bottom line no has a right to go beating up people .Got a problem do it right call the law.that's is if your not just personally the one wrong","commenter_a":"Its racially insensitive to assume black girls can tell the difference between right and wrong. As well as controlling their impulses. Seriously white folk....one step at a time.","post_message":"One of the women who beat up this teen girl says she’s the real victim. Here’s why."},{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""},{"comment_id":"10153542094851509","commenter_b":"@username wow your German? That sucks Germans can't reproduce, their birthrate is below 0% by 2060 there will be more muslims in Germany than Germans. LMBAO enjoy your day.","commenter_a":"Oh yet another white on black crime receiving national.media coverage. Way to keep the racial divide strong. But i am glad to see some justice is being served.","post_message":"Demonstrators have flocked to North Charleston City Hall to protest the shooting death of Walter Scott. The following report contains graphic content. Viewer discretion is advised: @webpagelink"}]
