[{"comment_id":"1619982001628404","commenter_b":"HILLARY WILL BRING MORE OF THESE TERRORISTS INTO THE UNITED STATES !!!!! SHE MUST BE STOPPED !!","commenter_a":"Who would predict that...lol...: @webpagelink","post_message":"Hillary Clinton's weakness while she was Secretary of State, has emboldened terrorists all over the world to attack the U.S., even on our own soil. They are hoping and praying that Hillary Clinton becomes President - so that they can continue their savagery and murder."},{"comment_id":"683462628486873","commenter_b":"Thank you for sharing!!","commenter_a":"Every time I attend a sporting event in our great country it infuriates and saddens me at how many \"Americans\" won't remove their hat or stop what they are doing while the National Anthem is played. Well done Mr. Bolt! Thank You for your great respect!","post_message":"A great American..."},{"comment_id":"10154271222713984","commenter_b":"She is a liar and manipulator ..","commenter_a":"A vibrator up her cooze? Call out the nuke-sniffing pig from South Park.","post_message":"Hillary Clinton was about to give a speech when suddenly the reporters heard a very strange noise... they knew immediately that Hillary was hiding something.  We know Hillary can't be trusted and this proves it... everyone needs to know what Hillary just did."},{"comment_id":"10153145419396323","commenter_b":"Fucktards","commenter_a":"Romantic assholes","post_message":"Colossally stupid."},{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and \"minds\" of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"10153110515583984","commenter_b":"I've seen out of work lesbian truck drivers. Moore looks MUCH worse.","commenter_a":"Is that Michael Moore in a Debbie Wasserman Schultz wig???","post_message":"I can't believe this radical feminist liberal would so gleefully mock and lie about a distinguished female veteran like this.  Do you support the Republican senator this woman belittled?"}]
