[{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"},{"comment_id":"1168807776489304","commenter_b":"Mexico has a closed southern border. I'm sick of all those Mexican bigots! I love their food though.","commenter_a":"They learned it from their Parents. They're in middle school, they learned this hatred and bigotry long before Trump. The floodgates are just opening more now. 😑","post_message":"Middle school students in suburban Detroit chanted \"build the wall\" during lunch on Wednesday, hours after Donald J. Trump became president-elect, according to school officials."},{"comment_id":"10153933617414411","commenter_b":"Go fuck a pig!","commenter_a":"This is what happens when Islam gets a hold of a country. Back to the dark ages we go","post_message":"BREAKING: 8 coalition troops killed across Afghanistan"},{"comment_id":"968194983273556","commenter_b":"The bitch sucks and is a liar and a cheat","commenter_a":"Is she your next President? I don't think so.","post_message":"She still managed to pay herself back the $1.3 million she lent her disastrous campaign."},{"comment_id":"10153921224283132","commenter_b":"They tend to get bigger when you are pregnant","commenter_a":"Are her tits hanging out far enough?","post_message":"Kim Kardashian West and her family are rallying around Lamar Odom."},{"comment_id":"10153385027713984","commenter_b":"Just GO away!!!!!!","commenter_a":"Freedom of speech","post_message":"Obama is trying to shut Fox News down for good... sadly, this is Obama's America.  He knows he is failing and is desperate to silence his critics... share this with everyone."},{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""}]
