[{"comment_id":"630794597099043","commenter_b":"Jill is Anti TPP! TPP protects corps who want to outsource american jobs!!!!!!","commenter_a":"Yay","post_message":"We’re here with Green Party candidate Jill Stein and her running mate, Ajamu Baraka to take your questions ahead of tonight’s #GreenTownHall. Please submit your questions in the comments section below. Tonight's Green Party town hall starts at 9 pm ET. @webpagelink"},{"comment_id":"1279380305469095","commenter_b":"Obama said there are 53 states. Everyone makes mistakes. Calm down","commenter_a":"Deployables go vote on the 28","post_message":"LOL! Donald J. Trump just told supporters to go vote 20 days after the election is over.  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152641860006135","commenter_b":"What a joke","commenter_a":"How do you find out if you have fines?","post_message":"Just a HEADS-UP If you've skipped out on jury duty in Michigan in the last 12 months...  READ: @webpagelink  You have until the end of the business day today to request a new jury service date to avoid fines."},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"683847751805803","commenter_b":"WTF!!! Enough of the PC climate in today's world! We celebrate American holidays in AMERICA! If the illegal immigrants want to be celebrated they should NOT break our LAWS and just STAY the hell in their own country!","commenter_a":"will not!!!!!!!","post_message":"Obama has created his own 'Holiday' and is forcing it upon American citizens.  We will stick to our own holidays thank you very much.  Will you refuse to celebrate Obama's made up holiday?"},{"comment_id":"10157491368855389","commenter_b":"Now she needs to seperate from our government. A few years in the slammer or off to Syria where she'll be treated like every other woman.","commenter_a":"Don't care for your relationship with the Hil, but good for you on your separation from the Weiner. Anyone deserves better than that scumbag.","post_message":""},{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""}]
