[{"comment_id":"10155084835104203","commenter_b":"Has she tried cbd oil?","commenter_a":"My mom who has stage 4 cancer... Tried juicing for almost a year, cutting out eating \"real\" food almost all together... Ended up doing more damage to her gut than good. Bodies are made to eat food and not meant to get over loaded with vitamins and nuetrints from juicing 40 carrots. I think in small doses it can be beneficial but not as a replacement","post_message":"Even in Trump's America, juicing is still awful."},{"comment_id":"10154038430603812","commenter_b":"Arrogance is all she has left to run on.","commenter_a":"Differences are fine but you should not say that you are all so much better than the Republicans. I will not be voting for a person who thinks they are better than others!!! Shame on you","post_message":"“I think it’s time for us to have the kind of spirited debate that you deserve us to have. We’re so much better than the Republicans, but we do have differences and you deserve to know what those differences are.\""},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."},{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"},{"comment_id":"1676407832621088","commenter_b":"#TrumpTrain #StopHillary #BernieSucksCock","commenter_a":"Based Ben AMIRIGHT @username","post_message":"Thank you Dr. Ben Carson! An honor to receive your endorsement this morning."},{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."},{"comment_id":"1426892224004095","commenter_b":"It is an eye opener!! The horror will be if Hillary is actually elecyrd. Then the real horrors will begin.","commenter_a":"Excellent movie! A must see!","post_message":"Hillary's America might just be the scariest movie you see all year...  hillarysamericathemovie.com/#tickets"}]
