[{"comment_id":"631005147090064","commenter_b":"run him off. his wife also.","commenter_a":"he must be on drugs again.","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"1214601541965192","commenter_b":"Y don't y'all go look up great migration n u do kno all white ppl ain't rh+ either meaning not descended from monkeys smh ignorance at its finest pick n choose shit to push ur retarded ass agenda","commenter_a":"Awesome. Teach them early. I'd rather my kid learn to hunt and survive than play on a phone or tablet all day.","post_message":"How do you feel about this?"},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"},{"comment_id":"889958597769015","commenter_b":"Don't like her!","commenter_a":"What is there left to say. Sarah Palin \"will send them to kick Isis out\"sounds like he will put troops on the ground. Just what Isis wants. She sounds as bad as Trump. She doesn't even know what is coming out of her mouth. Mental problem. Think before you vote!!!!","post_message":"“No more pussyfooting around!”  That’s what she said... Here are the best one-liners from Sarah Palin's endorsement of Donald J. Trump: @webpagelink"},{"comment_id":"1841606822750087","commenter_b":"KORDSTAN","commenter_a":"So glad he is gone!","post_message":"President Obama delivered his final address to the American public in Chicago. How will you remember Obama's legacy? #ObamaFarewell"},{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."},{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"}]
