[{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153270009391770","commenter_b":"This woman is nuts!","commenter_a":"The is one key word in all this ....... ILLEGAL. not legal It's very simple if your here illegally you get sent home. There are proper ways to become a citizen. Many many people have done it. If two illegals have a baby that baby is not now a citizen. If 2 people break in you house and have a baby. Is that baby now part of your family well. No","post_message":"MSNBC host Melissa Harris-Perry on Saturday likened the Obama administration’s deportation of illegal immigrants to “a fugitive slave law” during a discussion about Flint, Michigan’s illegal immigrant community being reluctant to accept clean water aid out of fear of being deported.  Read more: @webpagelink"},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"10153737959512623","commenter_b":"Girl one lady is so about to make me go in lmbo","commenter_a":"It's not about air... They weren't even allowed to open the windows, there was no airflow, the kids came off drenched in sweat and crying.","post_message":"Some parents are upset with a local school system after they say their kids got off the bus \"drenched in sweat\" and crying.   A school system spokesperson said some of the parents' claims were \"less than accurate.\""},{"comment_id":"1028820693878107","commenter_b":"Same maturity level as kindergarteners.","commenter_a":"Republicans should allow weapons at their convention. ..loaded weapons. ..that would make a great pay for view","post_message":"Worst idea ever."},{"comment_id":"1594945114129629","commenter_b":"This woman is a freaken joke. Go Trump","commenter_a":"Demonrats-deliver Detroit, Flint, Toledo, Baltimore, Newark and ghetto's !!! aLL THE TIME 100% OF THE TIME, every time suckers !!!!","post_message":"Democratic presidential candidate Hillary Clinton took aim at Republican rivals saying she is looking forward to debating with them about the economy if she becomes the Democratic nominee."}]
