[{"comment_id":"1163941390354988","commenter_b":"I'm also mad that she is not wearing the gloves. I couldn't care less about a corset. Wear the gloves!","commenter_a":"Ummmm...okay?","post_message":"Emma Watson isn't wearing a corset under that yellow dress. // Beauty and the Beast"},{"comment_id":"967270790032642","commenter_b":"You plutocratic blithering batch of flabbergasted infidels have the combined iq of less than one dead skin cell from the shmuck of @username's majestic penis post-circumcision and he in his infinite wisdom has confirmed that over 50% of all American penises have regressed so far due to their sheeple tendencies that they are considered vaginas by anatomists everywhere","commenter_a":"According to experts in the field of computer science the most logical, and therefore most correct, outcome would be for us to all vote Republican in the next election, the obvious pattern must be continued. Humans are not capable of conscious thought (especially not Americans) and must therefore follow trends like the herd animals they are.","post_message":"The jobs numbers say it ALL.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1832391937045878","commenter_b":"Don't tell Muslim terrors because all Christian terror everyday kill 1000 children in Syria and no body have tell about that..again I said that don't tell Muslim terror","commenter_a":"I would like to hug this peoples","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market  Full story: @webpagelink"},{"comment_id":"802416633249035","commenter_b":"Trump supporters do not listen to reason or facts.. Exhibit A above","commenter_a":"Shameful. Was it a DNC rally??All of those actors from other countries that she showcased... They are not illegal immigrants!!! There's is a huge difference.","post_message":"What did you think of Meryl Streep speech?"},{"comment_id":"10153744773906880","commenter_b":"Huge write-up on a banker. He took billions of dollars from loser investors. Enron? Says it all. The greatest corporate collapse in US history. Great spin on a shark.","commenter_a":"Jason Espeseth Scott Arnebold","post_message":"He's taking on the issues that no one else wants to confront."},{"comment_id":"794348560669685","commenter_b":"I learned all this in Men in Black 1 to be honest, and all we need is a Tri-Barrel Plasma Gun. Roaches are obviously Aliens, so in order to truly rid this planet of them, one simply needs 'the jackhammer'.","commenter_a":"Jacqueline and Chris eww! but so cool!!","post_message":"Cockroaches are the worst, but scientists have figured out how to replicate what makes them indestructible."},{"comment_id":"1100128256666646","commenter_b":"The refugees are not the terrorists. As more information becomes available, the assumption that they are looks more and more ridiculous. Also, the vetting for the small percentage of refugees the US has been willing to accept is much stronger than anything happening in Europe at this time. Shame on our Governor. She is smart enough to know better.","commenter_a":"Governor Baker of MA has stated they're not accepting Syrian refugees. When will we hear this from you, Governor?","post_message":"President Obama has issued a proclamation ordering the lowering of flags on all public buildings and grounds to half-staff immediately and until sunset, Thursday, November 19, in honor of the victims of the terror attacks in Paris.  Governor Maggie Hassan has issued the following statement:  “I continue to join all Granite Staters and all Americans in mourning with and sending our thoughts and prayers to the people of France following these horrific terror attacks. State emergency management officials and the State Police will continue working with national Homeland Security, the FBI and local police departments to exercise extra vigilance and ensure that all necessary security precautions are taken in New Hampshire. As people across the country and the world stand together in support of the French people and one another, these heinous acts of terror will only strengthen our collective resolve to rid the world of violent extremism.”"}]
