[{"comment_id":"10156349547100354","commenter_b":"Conservatives learned the lessons of MLK. I think the left needs to review what he preached. It is not the color of the skin but the content of character.","commenter_a":"These people just say what they think and then if it bites them in the rearend they come back with some ridiculous other story which nobody believes but they seem to think that we will.","post_message":"FIRESTORM: MSNBC Liberal Claims She Wasn’t Calling Dr. Ben Carson Racial Epithet...\"Safe Negro\"...Backpedals Quickly...Dr. Carson Campaign Blasts...MORE..."},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."},{"comment_id":"1150363668364697","commenter_b":"In other words you won't be out of pocket otherwise you could still go ahead and spend a tiny bit of the fortune you have made from the British people, you'r an utter disgrace to this country. put some back in instead of out you fuckwit arsehole virgin c**t.","commenter_a":"Tell us what the deal was, then we can make a judgement. Could be bs. for all we know.","post_message":"And Richard Branson has cancelled a deal costing some 3,000 jobs..."},{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"1191348794238924","commenter_b":"She should keep her mouth shut and her daughter her legs shut","commenter_a":"Here is how I see it: The rediculous right always has an angle of deceit. Their only honor is to ones self and personal greed. No matter what they put out in propaganda the real truth about them shines in their actions and public statements. The problem with the left is they won't get up and go vote even by absentee ballot and let the post man do all the waiting in line when the religious right blocks off all the bathrooms.","post_message":"Sarah Palin wants you to fight against haters who want to take Christ out of Christmas by buying her ridiculous book."},{"comment_id":"10150599168414999","commenter_b":"You only have the right to vote under certain criterion. If you want to use language like \"never was\" then I assume you forgot that only property owners were allowed to vote under the original constitution and blacks were also excluded. Changing times demand we evolve to the need. At this time we have tens of millions of Illegal aliens who have the ability to fraudulently vote. That is a potential problem.","commenter_a":"For me this is not about party politics as I am unaffiliated. 70% of Americans want voter ID. This is not about blocking the vote, this is about blocking the illegal vote. 52% of Dems, 82% of Repubs and 72% of independents agree want this, why should we ignore what is an obviously good idea?","post_message":"Democrats are most likely going to attack a host of measures, including voter identification requirements that Democrats consider onerous, time restrictions imposed on early voting, and rules that could nullify ballots cast in the wrong precinct."},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say \"this was a good shoot.\" But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":" is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."}]
