[{"comment_id":"1192837800775695","commenter_b":"@username talk about my mother bitch see what happens.","commenter_a":"No Obama, kiss our ass traitor!","post_message":"Not sure what he thought was going to happen when he started with the name calling, but Obama just gave him a political middle finger."},{"comment_id":"1082747785100183","commenter_b":"Stfu pussy.","commenter_a":"Oh look! Americans shooting animals for fun! why are people shocked by this? Also these are HUNTERS not POACHERS, poachers take things from the body for monetary gain, hunters just kill either to cull or for pleasure. All hunting should be banned! We have no right to kill for pleasure, kill to survive as that's the order of things but never for pleasure.","post_message":"Another iconic animal lost to hunters."},{"comment_id":"970899619630870","commenter_b":"Deport ALL MUSLIMS everywhere!!!!!!!","commenter_a":"FULL CASTRATION!!!!!!!!","post_message":"Top Muslim Imam: \"We shall breed with Europeans to conquer their countries!\" (Video)"},{"comment_id":"10155618780610093","commenter_b":"Go stick your head back in the ground Anne...clearly you have failed to realize that unless ISIS is wiped out..they will not stop...period. And yes they want to strike us here. You want that? You rather they come here on our turf? Lady you better do a gut check and wake the hell up.","commenter_a":"Sorry but we should NOT have boots on the ground in Syria.","post_message":"\"It involved hand-to-hand combat, the jihadists tried to use women and children as human shields, and about a dozen jihadists were killed.\""},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."}]
