[{"comment_id":"10153043842829411","commenter_b":"This Germans are only the progeny of the stupid Jews that survived the holocaust.","commenter_a":"Look the Nazi are back.","post_message":""},{"comment_id":"10153423460374087","commenter_b":"@username You will be pleased to know that I will be running for president in 2036, with @username as my running mate. We will be running on the Republican ticket which should also please you. Donald Trump is a man of one line punches with no specificity as to how he will execute his policies. I don't believe that building a wall will solve our immigration problems and banning the immigration of Muslims into the United States is unconstitutional. The First Amendment states, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" Banning Muslims from entering this nation goes against the beliefs of what our founding fathers envisioned for this nation. Now, I am not in favor of President Obama's policies and actions, but I do believe that there are much more suitable candidates for the office than Mr. Trump, at least until ...","commenter_a":"@username what politics have come to, smh","post_message":"Donald J. Trump's daughter Ivanka Trump says she may make her own political run one day."},{"comment_id":"496087783849595","commenter_b":"Walking into someone's property uninvited and killing a dog who was protecting the house from such intruders. Fuck that guy.","commenter_a":"Look at these comments.","post_message":"This cop fear for his life after trespassing in a homeowner's back yard and being confronted by a 25 pound dog. What he said to the homeowner afterwards will make you sick.  Via - The Free Thought Project.com"},{"comment_id":"529778360546077","commenter_b":"Live in America follow American rules! Don't like it leave","commenter_a":"This should be an example and a warning to others that they and their laws will NOT be tolerated in the United States ! ! ! !!","post_message":"The Muslim Brotherhood tried to take over this school, locals refused to back down.  This is patriotism at it's finest. These Muslims should serve life.  Can we get 10,000 'LIKES' for these patriot's stand against the Muslim Brotherhood?"},{"comment_id":"873586192785317","commenter_b":"U feel sorry!!! Speak up your no better than them if u witness it and say nothing. Damn","commenter_a":"When I worked at the hospital in the lab..I can't tell you how many times I saw cops get unnecessarily rough with women ..women of any color. Not all but a lot..it actually made me start to feel sorry for their wives . If they do that on the job I hate to see what happens when they know they aren't being watched","post_message":"BRUTAL CONFRONTATION: Pennsylvania police officer charged after being caught on video appearing to punch a woman during a traffic stop: @webpagelink"},{"comment_id":"10153447411644087","commenter_b":"Sexist.","commenter_a":"Jennifer Pinto","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153779431271178","commenter_b":"Go away far away Whoopie aka Karen !","commenter_a":"Just keep diggin your hole, eventually you will all fall in!","post_message":"Actually, there is...and it's a big one."}]
