[{"comment_id":"520938298031470","commenter_b":"This woman isn't on benefits","commenter_a":"It does make you think!!! As I pay out per week for my sons bass guitar lesson, each Saturday for my daughter to spend the day at the stables....school trips etc. ....and still moan about having no money, whilst running two cars and paying for three seats at Bath rugby...plus drinks!! This has put my \"poverty\" into a proper perspective...and changed my opinion of ALL people on benefits being the same. Good luck to her and her family.","post_message":"Kathleen Kerridge’s family food budget is £40 per week – to feed five people. She says there is a big gap between the public perception of poverty and what it means for people like her. We should stop talking about poverty, she argues, until we know what being poor in this country really means."},{"comment_id":"1809017339318525","commenter_b":"happened in bosnia too.","commenter_a":"...not the only nor first time.","post_message":"These cowards sat back and did nothing for 4 HOURS while this was going on!"},{"comment_id":"10152512178746316","commenter_b":"Most doctors are not looking out for you, just the bottom dollar. Research apricot kernels","commenter_a":"Cannabis oil all the way! Id never ever do chemo","post_message":"Radiation and surgery provide more burden than benefit, destroying prostate cancer patients' quality of life in their final years. What would you do if you were diagnosed with cancer? @webpagelink"},{"comment_id":"1076375005794438","commenter_b":"I bet you are one of those that says it was just \"locker room talk\" when Trump spoke of grabbing a woman's pussy, aren't you? \"Hey, boys will be boys\"","commenter_a":"The flight attendant was not harassed, intimidated or any other federally worded names that aren't allowed. She made a mountain out of a molehill. Very irritating.","post_message":"Alaska Airlines confirmed that a different passenger's Facebook post detailing the incident on Flight 520 was accurate."},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"10154886159283010","commenter_b":"Hippie bitch is a nobody","commenter_a":"The left is still jockeying for attention...and this is the best they've got..Less than impressive..","post_message":"A political twist on a holiday classic."},{"comment_id":"1372477109489879","commenter_b":"She can take a shower and be clean afterward! Lol","commenter_a":"If the girl wanna be clean.. Let her be in peace...","post_message":"'Alaikum salam'"}]
