[{"comment_id":"1724969627717594","commenter_b":"@username they don't do anything considering the billions of dollars we give them in aid that we couldn't attain ourselves. I'm not saying give Palestine money either just why give Isreal money to kill Palestinian children and so Israelis can have abortions?!","commenter_a":"If you realized what Isreal has done to the Palestinians you might donate to Hamas as well.","post_message":"WATCH: Filmmaker Ami Horowitz discovers that some American college students are willing to donate money to the militant group Hamas, after being told it will help “destroy Israel.” @webpagelink"},{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"},{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."},{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."},{"comment_id":"772068809592966","commenter_b":"the woman is not nearly as smart as a bucket of horse manure but is as pretty as one.","commenter_a":"Cher is still alive? ??","post_message":"As always.....leave it to Cruz to craft the most perfect response. ;)"},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68.   Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10153987502144087","commenter_b":"Hillary is by no means a \"girl\". She's an old mentally disturbed hag.","commenter_a":"Wait, Hillary's a girl?","post_message":"Elizabeth Warren: \"[Donald Trump] makes death threats because he's a pathetic coward who can’t handle the fact that he’s losing to a girl.\""}]
