[{"comment_id":"10155035713191002","commenter_b":"Girl says: How stupid can you get?","commenter_a":"y do we do stupid stuff, lol will we ever grow up","post_message":"Guy meets girl. Guy wants to impress girl. Guy leaps from rooftop."},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."},{"comment_id":"10153150009791037","commenter_b":"They will bitchhh","commenter_a":"USA ... root cause of evry problem in world!!!","post_message":"#NorthKorea fired two short-range ballistic missiles into the sea and vowed \"merciless\" retaliation as the U.S. and South Korea kicked off joint military drills denounced by Pyongyang as recklessly confrontational."},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"10153467245366770","commenter_b":"@username are you doing your homework?","commenter_a":"According to Roger Stone, 182919686769s Mens Fashion Editor and the only named \"source\" in the National Enquirer smear story about Ted Cruz cheating on his wife with five women. Ted Cruz doesn't have time for that crap, he's too busy pushing back the establishment.","post_message":"\"Despite the old guard and amateur pundits blaming Donald J. Trump and the majority of GOP voters who support him, much of the rift in the Republican Party has been caused by Texas Senator Ted Cruz conning nationalists into believing he is one of them.\""}]
