[{"comment_id":"10154334992691130","commenter_b":"Hillary claims to be for equal rights and pay for women and care for womens rights but she still pays men more than women. She does not care about women it`s only money she cares about .. abortions save money ,that is why she is for abortion..","commenter_a":"Note to these kids: Don't bother asking Trump. He has no answers for you that are going to give you hope. He'd probably tell the children that they need to be vetted first to see if they love American values, even though they're only children.","post_message":"Ahead of tonight's debate, the children of Aleppo ask Hillary Clinton and Donald J. Trump the questions THEY would like to see answered."},{"comment_id":"455025114688069","commenter_b":"yes","commenter_a":"CNN sucks","post_message":"Should Networks Like CNN Be Shut Down?  Comment 'yes' or 'no'"},{"comment_id":"10153115200467217","commenter_b":"He would embrace you but insist you stop sinning if his embrace is to continue . John 5:1-14..\"SIN NO MORE\"....","commenter_a":"Gemma Dunnell homophobes Homophobes everywhere","post_message":"\"I found a relationship with God... right around the same time I realised I was gay.\""},{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"631726717035650","commenter_b":"You go girls don't let them do something that you dont want to do","commenter_a":"We should be WAY past forcing women to perform (in any capacity) against their will. Especially for a degenerate like Trump!!! Resist ladies. A stand must be taken against this. Millions of people are are your side. Let Trump hire his knucke-dragging Klan supporters for entertainment if he wants to get his jollies.","post_message":"These Rockettes are NOT taking this lying down. You go, ladies!"},{"comment_id":"10152940506506051","commenter_b":"Put her in jail","commenter_a":"If You all had ids in that school and there was some evidence of wrong doing you would all change your tune you have no right to judge the system until you know the true circumstances","post_message":"A dad went to school to pick up his daughter’s confiscated phone. The school principal refused to return the phone, but offered a different sort of exchange."},{"comment_id":"10155379093015354","commenter_b":"This is why we need to deport these criminals. The illegal aliens are all criminals. They broke the law and came into our country uninvited. Deport them.","commenter_a":"obozo lied and innocent people died. Any questions? Criminal aliens are WMDs. How many must die before obozo and his minions are held accountable?","post_message":"This story has it all."}]
