[{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to \"shut down\" Trump's inauguration. Here's how."},{"comment_id":"10156674955065354","commenter_b":"Win by selling out our principles ? No way .","commenter_a":"Trumps campaign has been a wrecking ball for the conservative movement . Fox News was once our most dependable news outlet , it wasn't perfect . National Review use to be a respected magazine for conservative ideas , now there being attacked . Good conservative candidates such as Rand Paul , Rick Perry , Ted Cruz all now being attacked not by the liberals but by the GOP front runner . Good job trump you did more damage to the conservative movement than the liberals ever could","post_message":"***What happened to Fox News?***  “What would a conservative network be doing giving time to Michael Moore? Why would New York Times and Washington Post reporters be on the air to give opinions on a conservative network?” Limbaugh asked. “This is what peope are saying out there.\""},{"comment_id":"1079564272093616","commenter_b":"Keep the Government off our backs and away from our wallets President Trump, and put up that Wall, enforce The US Constitution, and Bill Of Rights and that should help Us all to have a Better 2016 !","commenter_a":"Happy New Year Mr. Trump! My son loves the Christmas card you sent him.. God bless you.. We love you! Trump 2016!!!!!!","post_message":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"comment_id":"943053922418420","commenter_b":"It's like 5 minutes and it's good. Watch it goddamn!","commenter_a":"@username watch the video xo","post_message":"Alan Watts delivered this profound message decades ago, and unfortunately not much has changed.  Vis Reset.Me"},{"comment_id":"10154976880629614","commenter_b":"Ok","commenter_a":"The car man was driving was a stolen car ?","post_message":"El Monte police are heard firing multiple shots at a suspect tonight in a video provided by a witness.   One man was shot and injured after a slow speed pursuit. His current condition is unknown.   Read KTLA's story here: @webpagelink"},{"comment_id":"10153189347462550","commenter_b":"Filthy pig","commenter_a":"You almost wanna teach you child at home what's going on these days","post_message":"#BreakingNews - Former Cumberland County school principal David Edwards pleads guilty to sex offenses with students.  More here shortly ---> @webpagelink"},{"comment_id":"10153778466329497","commenter_b":"Yea Scott, because we were all alive to see that. Lol","commenter_a":"As a guy who bleeds black and is proud to come from Chicago where I've personally seen every single professional team in town win their respective championships except the Cubs. Thank you Mets!","post_message":"Via Onion Sports  Cubs Fan Criticized For Selling Playoff Seat To Mr. Met"}]
