[{"comment_id":"10153516025754705","commenter_b":"No wonder you don't have any friends woman","commenter_a":"I hope this creature is captured and eaten by the Japanese","post_message":"What a spectacular creature."},{"comment_id":"10153694731231955","commenter_b":"Awwww so sad, GO BACK TO YOUR FUCKING COUNTRY ,","commenter_a":"Oh nowvthey care","post_message":"Muslims feel intense backlash..."},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,\" Melania Trump says of her husband Donald J. Trump. \"I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"},{"comment_id":"10154314323247174","commenter_b":"Lets don't and say we did.","commenter_a":"I wonder how their wives think about all this press about women in armor , arty, and infantry?","post_message":"Meet the Marine Corps' first-ever female field artillery officers."},{"comment_id":"1030946370280768","commenter_b":"She's full of pride, disloyalty and all together wicked.","commenter_a":"I don't think she knows how to be honest","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"},{"comment_id":"1165741570143303","commenter_b":"Why so serious... The whole world just needs to lighten up.. even if it's for 5 minutes.. colour is talked about so much it's actually part of the problem now.. just let it be...","commenter_a":"How the hell is this pic racist!!","post_message":"Opinion is divided ... (via BBC Trending)"}]
