[{"comment_id":"10154883119407969","commenter_b":"1. Asylum isn't the same status as refugee. 2. Kyrgyzstan isn't Syria Yikes.","commenter_a":"George. I hate to break it to you but your reporting is a little faulty! You said no Syrian Refugee ever did any harm to us? You clearly aren't familiar with The Boston Bombers. Both Syrian Refugees! BTW George, OBAMA BANNED MUSLIMS FOR 6 MONTHS IN 2011. ANY THOUGHTS?????","post_message":"WATCH: George Stephanopoulos interviews Kellyanne Conway about President Trump's immigration ban, countries not included and comments from Republicans on the order: @webpagelink"},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"1235443589809328","commenter_b":"With any luck they'll find a a way to kill that Russian lapdog Erdgoan. Kurds have a right to exist without fear of those Muslim camel f**kers the Turks. Turkey was helping ISIS, buying their oil, and should pay for it.","commenter_a":"Long live Erdogan (y)","post_message":"Turkish President Tayyip Erdogan accused the United States of supplying more weapons to Kurdish fighters in northern Syria this week, delivering two plane loads of arms to what Ankara says is a terrorist group."},{"comment_id":"1272011979492601","commenter_b":"Not a fan of the Dixie chicks!!! Stay out of politics!","commenter_a":"This lady is disgusting. Don","post_message":"Natalie Maines of the Dixie Chicks said she was \"ashamed Ted Cruz is from America\" on Saturday, a comment that echoed her famous comments about President George W. Bush in 2003."},{"comment_id":"1197295057044376","commenter_b":"I see they bussed them in","commenter_a":"I get guarantee most of these people don't even know what a fascist is.","post_message":"Marching on the deploraball"},{"comment_id":"1007967755882148","commenter_b":"All parents need to step up and take charge like this mom. There would a lot less bs going on with teenagers these days.","commenter_a":"that it's mother style similar to CUBAN MOTHER BRAVO;MOTHER UNITED ja,ja,ja toma pelona qien lleve los pantalones a la hora de mandar.I ALWAY SAID TO MY SON THE DAY THAT YOU TRYING TO GOES OVER ME UNTIL THAT YOU GOES TO KNOW WHO IT'S YOUR MOTHER NEVER TRY","post_message":"Be sure to LIKE WND.com to stay connected!  @webpagelink"},{"comment_id":"562038433961848","commenter_b":"Melissa Jayawardane","commenter_a":"Point is that this 'triad' is nothing special: we are given a pseudo-statement.","post_message":"Machiavellianism, narcissism, and psychopathy. Where do you rank?"}]
