[{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"},{"comment_id":"10153678409374641","commenter_b":"I say make email really sick for weeks with water damage so much so that they want to die lol....but can't get off the looploo","commenter_a":"You have to kill there soldier first then go after the leaders.","post_message":"\"I think it's futile to respond to terrorist violence with more violence in a way that creates more terrorists,\" says Sally Kohn."},{"comment_id":"1600782096895914","commenter_b":"Well yeah that's because she'd probably have a bomb, so...","commenter_a":"if she was wearing hejab, the story will definitely be different. meanwhile continue laughing.","post_message":"\"I've flown all over the world and I've been on lots of really long flights and I've never experienced anything like this,\" a passenger said"},{"comment_id":"674830109374234","commenter_b":"This America and every body should be able to fly our flag and if any muslim feels threaned then they can just leave your country and go back to where they belong and stay there","commenter_a":"I say- \"TOUGH\"","post_message":"You'll never believe why this man was forced to remove his flag.  This is absolutely wrong. If you're offended by the flag, LEAVE.  Can we get 20,000 'LIKES' in support of the American Flag?"},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these \"refugees\" ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"1515340161809773","commenter_b":"Well... he lost the popular vote, so that's clearly not true. But you're right, Bernie supporters should feel cheated.","commenter_a":"Obviously people approve of Trump more then Hillary 🤗🙃 Let's be honest he won because of crocked Hillary's disapproval. Bernie supports should feel cheated... he'd be the next president if she hadn't been the democratic candidate.","post_message":"Do you approve of Donald J. Trump?"},{"comment_id":"10153321708401955","commenter_b":"She does have Huma.","commenter_a":"Even Hilary needs a man once in a while !","post_message":"Hillary allows men at 'women-only' event amid weak turnout..."}]
