[{"comment_id":"10154228017338797","commenter_b":"Girl I'm glad u werent","commenter_a":"@username @username this actually happened at my job","post_message":"FLAP OVER FLAPJACKS: A Chicago woman has been arrested after police say an argument over all-you-can-eat pancakes got out of hand at Denny's."},{"comment_id":"10153065488357217","commenter_b":"Because you are another dependent brain-washed puppet and the worst part of you think you're on the right side! Praying for you!","commenter_a":"Well done Kentucky clerk! And you masonBBC don't try to make real Christians look like some bunch of homophobes! Shame on you @username! You should apologies!","post_message":"UPDATE: AP reports Kim Davis, the Kentucky clerk who won't issue marriage licences, and all her deputy clerks have been called to appear at a federal court hearing on Thursday morning.   County Clerk Kim Davis eventually came out of her office, but she said she would not issue any marriage licences.  \"Under whose authority?\" she was asked. \"Under God's authority,\" she said."},{"comment_id":"10153815392947293","commenter_b":"She have bipolar disorder.","commenter_a":"Please be kind when commenting. Even if you don't like her, she is a real human being, who has had significant struggles with mental illness. She has family and friends who are worried and scared.","post_message":"Sinead O'Connor has been found."},{"comment_id":"465878743536720","commenter_b":"Wake up lady.","commenter_a":"if you think Trump loves America, why does he insult everyone and everything??? And Obama has done more for the middle class than many previous presidents.","post_message":"U.S. Democratic presidential candidate Hillary Clinton says she's \"appalled\" after Donald Trump declined to correct a man who called President Obama a Muslim and non-American during a town hall event. Was she right?"},{"comment_id":"10153530483933872","commenter_b":"We are tired enough of the lies and deceit and are going to vote you out- both of you wicked queens of the damned!","commenter_a":"Oh no, Patty! Why do you have to endorse Hillary? Disappointed that you don't #feelthebern","post_message":"It's great to see Hillary Clinton focus on this critical issue for our families, our economy, and our future."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"10153146701373984","commenter_b":"Scumbag","commenter_a":"He will never get impeached. He has to many people in his pocket. He started crap the second day in office and it just snowballed, and here we are today. Happy you liberals and the people who voted twice for this Muslim","post_message":"This new plan could spell disaster for America...  Should Obama be impeached before he does more damage?"}]
