[{"comment_id":"1201176699902507","commenter_b":"Beverly, there's already plenty of porn out there. I highly doubt anybody's going to get their jollies from our veiny mom-boobs. In all seriousness, though, in 99℅ of cases, you can't see any more breast than you would if wearing a bikini. And yet, we don't shun the beach for fear of perverts with cell phones, right?","commenter_a":"There is a big difference between how breastfeeding is depicted here and what the majority actually look while breastfeeding in society. , Here its done Discreetly and beautifully, If all women breast fed like this NO one would have issues with it,","post_message":"\"Let's support mothers to breastfeed anytime, anywhere.\""},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"10153463579731130","commenter_b":"but who knows maybe if she doesn't get her orgasm, she'll cry rape, and because society is bent towards believing women only on their word alone, you will be sent to jail to get butt raped.","commenter_a":"Men don't \"owe\" you orgasms End sexual entitlement","post_message":"🙌"},{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."}]
