[{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."},{"comment_id":"1324741860927476","commenter_b":"You need to stop getting your news from the crazy woman on the View!","commenter_a":"No terrorists came out of the 7 countries he banned why doesn't he ban Saudi Arabia where most 911 terrorists were from. Also Egypt and two other countries. Neither was the ban about illegals people with valid visas and green cards were also detained, even the ex prime minister of Norway traveling on a diplomatic passport was detained for questioning..I support Washington states action. The president is not above the LAW .","post_message":"\"We're not going to allow anyone in Washington, D.C. to trample on our rights as Washingtonians, President or otherwise.\" Gov. Jay Inlsee reacts to the judge's ruling to temporarily block President Trump's travel ban. READ MORE >> @webpagelink"},{"comment_id":"1393712353985142","commenter_b":"Someone send this to Senator Warren...but use small words so she MAY understand it!","commenter_a":"No one cares !!!!!","post_message":"Wow! Coretta Scott King gives a thank you to Sen. Jeff Sessions at the opening of the Rosa Parks library."},{"comment_id":"10153379305754205","commenter_b":"I was more surprised that Kenny Rogers was still alive, but at what cost? What has happened to his face?","commenter_a":"Typical intolerant liberals. Always pointing fingers and putting words in people's mouth. I think your ignorance is actually funny and the final laugh will happen next January. You will have a reason for 8 years of your hate and intolerance.","post_message":"Kenny Rogers Loves Donald Trump"},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."},{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."}]
