[{"comment_id":"1595582267404994","commenter_b":"Where in the work would you ever get an idea like that???? You stupid woman!!!!","commenter_a":"This person is so ate up","post_message":"not too bright..."},{"comment_id":"10153842833302756","commenter_b":"Racist? Ok then. Keep letting the Muslims in this country to terrorize. Let the BLM people go unchecked and keep killing our Police. Let illegal Mexicans in to drain our already overtaxed healthcare system and bring more drug violence. No, no more. It ends now.","commenter_a":"I can't wrap my head around how anyone comprehends what he's saying. He literally says the same thing OVER AND OVER, but I guess that's the only way his racist, small-minded supporters can understand him.","post_message":"Republican presidential nominee Donald Trump spoke with Newswatch 16 after his rally in Scranton on Wednesday. See more here: @webpagelink"},{"comment_id":"10155963781495354","commenter_b":"Kick that racist bitch out.","commenter_a":"Socialist pig","post_message":"Stephanie Rawlings-Blake insisted that, in the last few weeks, she has “seen a lot of progress”--and by that, she meant tax dollars going to “recreation centers” and spending on schools."},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."},{"comment_id":"601311203355417","commenter_b":"What a dumb bitch","commenter_a":"I know lets get someone to shoot at her then we can see if she is right","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s.  This is the most ridiculous thing I've ever heard.  Are you offended by this?"},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"903279336444237","commenter_b":"Sigh","commenter_a":"Joshua William Grant told you 😂","post_message":"Misogyny is misogyny."}]
