[{"comment_id":"1118673694809606","commenter_b":"yeah...chickens have lips and pigs can fly!!!!!","commenter_a":"not with him in office.","post_message":"Can Obama convince voters US moving in the right direction?"},{"comment_id":"10153952706726323","commenter_b":"Show the UK the door Lol! We want out and you to go home.","commenter_a":"7 years in England and I have never met an English person that defined themselves as European, British when they want to show how broad their borders can be. We don't even share the same values, we interpret our history in a completely different way. They made of us a 'Brand', neglecting our own background, dignity, honesty, skills, and so on... unless you speak as they do, or you are a CEO,CFO, any kind of abbreviation really will do...only then you will be treated nearly as an equal. Dear Europe, do not succumb to this hypocrisy and show them the door.","post_message":"'I have negotiated a deal to give the UK special status in the EU. I will be recommending it to cabinet tomorrow'"},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"1695743490702170","commenter_b":"@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"10154179753088645","commenter_b":"Girl bye!!!","commenter_a":"She should be offended, he was trying to hook up with another woman while she was pregnant with his kid and during his apology he never said sorry to his wife.","post_message":" does not represent the man that I know, she added."}]
