[{"comment_id":"1680131802273932","commenter_b":"Just because you have a blinker doesn't mean you can automatically change lanes. What an idiot! She's lucky to be alive. Remember never change lanes in front of a big rig, They purposely leave that space open, they need a lot of room to stop.","commenter_a":"the world is full of stupid once while going to work a farm truck loaded with green beans tried to pass him as of the right as he was making a right turn little car was broken","post_message":"LESSON: don't mess with truckers."},{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."},{"comment_id":"458263531022194","commenter_b":"I sure don't consider Ann Coulter a Patriot! She is a vile and hate spewing!","commenter_a":"What an ass!","post_message":"Even for Coulter this is outrageous."},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10154803767550579","commenter_b":"Gary Johnson is scary and just as much a risk as any of them.","commenter_a":"Protect your Rights and Freedom, vote Libertarian Party, Gary Johnson and Bill Weld. 🔔 Give Freedom, Liberty and Justice a chance for a change! 🔔 Visit the FEELING THE JOHNSON Facebook page and give them a LIKE. Break the corrupt two-party system we're trapped in.","post_message":"CLIP: Donald J. Trump and Hillary Clinton debate the economy during the first presidential debate. Watch full video here: @webpagelink"},{"comment_id":"524518094380814","commenter_b":"Planned parenthood another way of saying murderous selfish bitch, or greed doctor. I think both. Revoke the doctors licences, and any woman getting an abortion gets a hysterectomy too. If you're willing to murder your own child once you don't deserve the privilege to have any at all.","commenter_a":"Hillary’s claiming credit for Planned Parenthood’s selling of fetal body parts. She says it’s a real money maker, and the only way she’s able to afford Starbucks....","post_message":"The top Planned Parenthood doctor whose face is all over the Internet because of an undercover video otherwise has left little mark on social media or elsewhere on the Web."}]
