[{"comment_id":"553000848198682","commenter_b":"More illegals are prosecuted in the state of Florida than any other state for voter fraud. It goes on everywhere though. I agree, there should be further evidence required to prove you are a citizen. Maybe a place on your driver's license should be reserved for this information. Not only are these illegals breaking the law to come here, they are electing people like Marco \"The Chihuahua\" Rubio to be their senator. Oh, and Google: \"Rubio Gay Arrest\" to see what Rubio likes to do in his spare time.","commenter_a":"Voter fraud has been proven in tx. People voting for trump are seeing their computer vote switched to Rubio, and cruz. And let's not forget, that the kkk is backed by the democratic party.","post_message":"We are #WINNING - #TrumpTrain! Thank you for your support. Lets keep this going! WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"10153932824095575","commenter_b":"If you have bones in your closet be sure they will come out.","commenter_a":"BS alert!","post_message":"National Enquirer parent company refutes Ted Cruz--- DONALD TRUMP had nothing to do with our story...."},{"comment_id":"10154180124161770","commenter_b":"She is an evil witch who got away with murder.","commenter_a":"Poor baby dog","post_message":"The entire nation thought Casey Anthony murdered her daughter..."},{"comment_id":"1023792714394917","commenter_b":"We already lost it! We've gone backwards for the last 7 years and all that's happened is the Tory Party and it's mates busy enriching themselves from National and Taxpayer assets.","commenter_a":"I worked since I was 14 - paid my share and I say out ! All us pensioners have paid in - but David Cameron wants to open the borders to any one and give them all free hand outs and homes !!! It's not on !!!! We need to stand up for our selfs","post_message":"Britain faces a \"lost decade\" if we vote Leave, says David Cameron. He warned pensioners in particular \"don't risk it\". Is he right? Would leaving the EU really be bad for our pensions? Judge for yourself: @webpagelink"},{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""}]
