[{"comment_id":"652024288284285","commenter_b":"I'm so glad.","commenter_a":"Yes","post_message":"Muslim Miss USA Chooses Jesus Over Mohammed... Islamic Community FURIOUS  She has the right to believe whatever she wants to believe.   Do you support her choice?"},{"comment_id":"679207482232542","commenter_b":"Criminal woman Brave !!","commenter_a":"Hillary is so brave for being a woman!","post_message":""},{"comment_id":"10153146887251955","commenter_b":"She is ugly like hell!!","commenter_a":"Hair fell out because nothing in her head to attach to","post_message":"Bald first lady?   'Jeopardy!' appearance raises questions"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"1014917681925727","commenter_b":"Alex, it was a hot springs then we saw in the photograph.","commenter_a":"Christopher Sorrentino","post_message":"Hot springs have injured or killed more people in Yellowstone National Park than any other natural feature."}]
