[{"comment_id":"1680131802273932","commenter_b":"Just because you have a blinker doesn't mean you can automatically change lanes. What an idiot! She's lucky to be alive. Remember never change lanes in front of a big rig, They purposely leave that space open, they need a lot of room to stop.","commenter_a":"the world is full of stupid once while going to work a farm truck loaded with green beans tried to pass him as of the right as he was making a right turn little car was broken","post_message":"LESSON: don't mess with truckers."},{"comment_id":"10153220185391336","commenter_b":"I bet you that pussy Obama couldn't ride a bike","commenter_a":"How racist of him to ride a bike it's all his fault","post_message":"Former President George W. Bush hosted his fifth annual Warrior 100K bike ride in Crawford, Texas. This year's theme was healing the invisible wounds of war. @webpagelink"},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"10153043162846130","commenter_b":"@username do us all a favor get a vasectomy","commenter_a":"You could skip the asking your boss to buy it for you and just buy it? Saved you a step. :)","post_message":"“Ask your doctor if birth control is right for you… then ask your boss if birth control is right for you.\""},{"comment_id":"10156390039050725","commenter_b":"That would be the best way to guarantee Hillary into the White House!","commenter_a":"I will!","post_message":"A new poll indicates that 68% of my supporters would vote for me if I departed the GOP & ran as an independent.   @webpagelink"},{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"10153258279033010","commenter_b":"Just give her a whiff!","commenter_a":"The trophy wife gets the gold mine and the kids will get the shaft.","post_message":"Robin Williams' three children are at odds with his third wife over what constitutes \"memorabilia.\""}]
