[{"comment_id":"1033684776642992","commenter_b":"Really???? No more than white folks killing each other!!! Racist azzes!!!","commenter_a":"where is black lives matter now?","post_message":"A deadly weekend"},{"comment_id":"10153266920996051","commenter_b":"I think he's a muslim sleeper, programmed to distroy this country and let in all the muslims he can recruit.","commenter_a":"Even if he was it's his freedom to choose...why does he have to practice Christianity or Catholicism?","post_message":"Do you think these voters are right about President Obama?"},{"comment_id":"1136375496397870","commenter_b":"SHE IS A DEMON POSSESSED WOMAN.","commenter_a":"Yes put Her in Prisone for life. For all the life's she took. Hillary Clinton we know what your up to and trust me God has not forgotten about you either.","post_message":""},{"comment_id":"10150599168414999","commenter_b":"You only have the right to vote under certain criterion. If you want to use language like \"never was\" then I assume you forgot that only property owners were allowed to vote under the original constitution and blacks were also excluded. Changing times demand we evolve to the need. At this time we have tens of millions of Illegal aliens who have the ability to fraudulently vote. That is a potential problem.","commenter_a":"For me this is not about party politics as I am unaffiliated. 70% of Americans want voter ID. This is not about blocking the vote, this is about blocking the illegal vote. 52% of Dems, 82% of Repubs and 72% of independents agree want this, why should we ignore what is an obviously good idea?","post_message":"Democrats are most likely going to attack a host of measures, including voter identification requirements that Democrats consider onerous, time restrictions imposed on early voting, and rules that could nullify ballots cast in the wrong precinct."},{"comment_id":"10153285964496749","commenter_b":"White Americans are sexy","commenter_a":":P","post_message":"Add your name if you support the Clean Power Plan—the biggest step America has ever taken in the fight against climate change. @webpagelink"},{"comment_id":"10154637857483188","commenter_b":"He's been doing that since way before anybody else","commenter_a":"When are you going to report on Hillarys emails? Speeches? Ties with foreign governments?","post_message":"Tough situation."},{"comment_id":"1295020463887979","commenter_b":"hes already done good and not even president yet","commenter_a":"Where is your white racist president that said he was going to send them all back out of the United States our country????","post_message":"Yikes..."}]
