[{"comment_id":"10155023483731037","commenter_b":"Fetuses are not considered sentient until around 6 months. Nothing wrong with an abortion within that time period","commenter_a":"Well, it would help if people quit having sex like rabbits and then run out and get an abortion because having the baby would be an \"inconvenience\". It's disgusting that 55 million innocent babies have been brutally murdered in a mere 43 years.","post_message":"An uptick in deaths, a slowdown in births and a slight drop in immigration all damped American population growth."},{"comment_id":"10153409431986336","commenter_b":"Give it a rest ! Donald Trump has every right to his opinion. I agree that this country has had an influx of illegals for years. Be informed and know that Mexico and Guatemala have cut a deal to send thousands more to cross our borders illegally. The monies they send back to Mexico and Guatemala is $120 Billion dollars. This president wants to give them a free pass plus $35 thousand tax refunds? So they cross illegally, burden our health centers, schools, and oh only so you get my disgust! All I used to hear at the hospital is people telling other relatives of theirs to \"Come to the U.S., because this country is so stupid. They give you money for living, food stamps and oh if you have your babies in the U.S. , then they are citizens and you can stay\"... So these so called nice people ...","commenter_a":"Its a PR move. All they really care about are the $$$$$$ NBC and MSNBC are financially hurting. Low ratings low viewership.","post_message":"Breaking News: NBC is ending its business relationship with Donald J. Trump due to his \"recent derogatory statements\" regarding immigrants.   DETAILS: @webpagelink"},{"comment_id":"10153145592901336","commenter_b":"I bet if not for her panties her guts would fall out","commenter_a":"Hope they send all the men back.","post_message":"Liana Barrientos, 39, who took six trips down the aisle in 2002 alone, will now be walking into court to face felony charges."},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"803156879823481","commenter_b":"And people shouldn't look, it's wrong, people have self control, they should use it rather than having breasts being sexualised","commenter_a":"Hey ladies, breast feed away....just remember...there are creepy, shady guys out there who get off on that...why draw attention to yourself...she could have easily done that somewhere else...she wanted the attention...just fkn stupid","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way."},{"comment_id":"886400474789539","commenter_b":"so many thugs trying to kill cops what do you expect?","commenter_a":"Crooked cops what would you expect?","post_message":"\"I just tried to cover my face from all the beating that the officer was giving me.\"  -Floyd Dent"},{"comment_id":"10153239073114087","commenter_b":"Becky, you ignorant slut.","commenter_a":"Why is the fact shes a woman the issue? This kind of rhetoric just signals their hypocrisy, in one breath decrying sexism and then in the next taking advantage of it.","post_message":"\"I first would like to register my opposition and my objection to the chairman beating up on a woman, on our witness today, for making a good salary,\" Rep. Carolyn Maloney at today's Planned Parenthood hearing. \"The entire time I've been in Congress, I've never seen a witness beaten up and questioned about their salary. Ms. [Cecile Richards] heads a distinguished organization providing health care services to millions of Americans. I find it totally inappropriate and discriminatory.\""}]
