[{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"10156393794945725","commenter_b":"Bitch","commenter_a":"The law is broken as in Chicago for the murder of Laquan McDonald who was shot 16 times in god dam animals because was In Africa American","post_message":"This is a look at the scene on the streets of downtown Chicago right now. LIVE COVERAGE -----> @webpagelink"},{"comment_id":"10153352835244384","commenter_b":"I love Nancy Pelosi. Her farts smell like broccoli.","commenter_a":"I love Nancy Pelosi, she is a superb role model, and tireless worker for all Americans!","post_message":"Today, under the leadership of Congresswoman Rosa DeLauro, House Democrats are again taking the lead in addressing one of the most pressing economic challenges confronting our country by re-introducing the Paycheck Fairness Act. Securing a fair shot for women in the workplace is critical to ensuring prosperity for our nation. Rather than continue their cycle of obstruction and dysfunction, House Republicans should join with us to close the gender wage gap so we can provide bigger paychecks and better infrastructure for all Americans. @webpagelink"},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"1701440090108890","commenter_b":"They jeer at Cruz. Call him \"politician.\" What they surely remember is the way Cruz sucked up to Trump in the early part of the campaign. \"Lyin' Ted\" sticks because Cruz seems two-faced.","commenter_a":"All Cruz did was bash Trump. What a looser.","post_message":"\"He's gonna put a liberal on the Supreme Court. He's going to take away your Second Amendment rights. This man is lying to you and he's taking advantage of you.\" -- Ted Cruz to Donald J. Trump supporters in Indiana today"},{"comment_id":"1900645696822355","commenter_b":"Fucking pigs!","commenter_a":"2seconds in & I can't even watch.","post_message":"His screams for helping are truly disturbing.."},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"}]
