[{"comment_id":"10154546397896162","commenter_b":"Wow. What an inbred type comment. Do us all a favor and move into a cave with a black bear so he can eat your face off.","commenter_a":"dig this monster up and mail him back to the middle east with his family in tow.","post_message":"Visitors gather in Arlington National Cemetery around the grave of Humayun Khan, the U.S. Army Captain whose family has been in public dispute with Donald J. Trump... @webpagelink"},{"comment_id":"1208055202644589","commenter_b":"F*** GLOBALISM","commenter_a":"This country is in bad shape","post_message":"And the brainwashing starts. Included in the curriculum will be globalism too. Yaaaayyy... @webpagelink"},{"comment_id":"599536596905185","commenter_b":"I want them to be deported and go back where they came from.","commenter_a":"I am absolutely shocked that a welfare state would attract welfare-minded reprobates who expect to receive cradle-to-grave welfare benefits, and then throw violent temper tantrums when they don't get what they think they're entitled to! Where in the world did these guys get such an idea? Oh yeah, after hearing the Marxist's constant demands for cradle-to-grave welfare benefits all of their lives.","post_message":"New post (Sweden: Muslim migrants enraged over not being given \"own house\") has been published on Jihad Watch"},{"comment_id":"10153553750251051","commenter_b":"You are a sneaky bitch that can not fool me you brought up color stop with the bullshit. @username","commenter_a":"What do you expect from a repeat offender? Hey justice system you spineless useless system! It's because if your stupidity and loop holes that got that child a life sentence. Those children were given a death sentence by this useless pos. This vile inhumane waste if life still breathes because of your inept logic. If that were my child, I'd hunt that diseased vile pos down and set his black ass on fire...","post_message":"It was already bad enough that this man raped a 14-year-old and a baby. Then it got even worse."},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"387651254692803","commenter_b":"Really Kathy tell that to the vets that the repubs cut spending on you dumb woman!","commenter_a":"GOP don't give a G/D about anyone America please wake up !!!","post_message":"What did you think of this response to the President's State of the Union address?"},{"comment_id":"10153562591278487","commenter_b":"It's disturbing that someone who presents as a cop on Facebook would be one of the few people to say \"this was a good shoot.\" But #notallcops or #bluelivesmatter or some other inaccurate bullshit to keep people hero worshipping, right? Please.","commenter_a":"I hope you all understand that because the prosecutor went for a murder charge, this officer will be found not guilty. One, due to the fact that the prosecution will have to prove that an on duty officer was out there to kill someone, which won't happen. Two, for the fact that a vehicle is a deadly weapon and shooting a suspect using a vehicle in a manner that puts an officers life in danger is standard procedure and is taught in every academy in the U.S. This was a good shoot and the officer will be exonerated. But get ready to torch your local cvs for justice.","post_message":" is without question a murder, the prosecutor said about Sam Dubose's death.  didn do anything violent toward the officer. He wasn dragging him. And [the officer] pulled out his gun and shot him in the head."}]
