[{"comment_id":"10154389291904614","commenter_b":"@username....Aka: RACIST!!","commenter_a":"I don't wanna sound racist but did you know 68% percent of rape is commited by African americans in los angeles spew on me all you want I got the statistic straight from the FBI website","post_message":"LAPD is looking for a man who tried to sexually assault an 80-year-old woman in her Hollywood apartment, leaving her in critical condition and still sedated due to her injuries.   The victim opened the door to the attacker after he knocked, apparently targeting her at random, police said. He pushed into the apartment and beat her, but she was \"feisty\" and able to fight him off, an LAPD captain said.  The man, who was caught on surveillance video, is described as a black man 25 to 30 years old, 6 feet tall, 220 pounds. He wore a black Penn State hoodie at the time of the attack."},{"comment_id":"10153003347966051","commenter_b":"Hopes the woman yelling see's this video and see's what a ignorant, trashy fool she looks and sounds like!","commenter_a":"Fire her as ASAP","post_message":"This girl was trying to pay for her coffee when all of a sudden the Starbucks employee just snapped."},{"comment_id":"10153355392014087","commenter_b":"Frank, public services are for the good of the whole. Socialism is when you have a garden with beautiful tomatoes and I, being too lazy to grow a garden, get my share of your tomatoes. Not because I deserve them, because the government said you have to give them. How ling do you think you will continue to grow that garden to feed my lazy butt? Socialism fails because the workers quit working also because there is no reward to their labor. The workers will become the lazy also and there will be no tomatoes. Figured I had better break it down to kindergarten level for you.","commenter_a":"If you support sanders, go live in Cuba. Democratic socialism there already.","post_message":"Bernie Sanders is increasing the size of his campaign staff and boosting state budgets, according to a new report."},{"comment_id":"10154298251075098","commenter_b":"There's a reason why they're called filthy rich.","commenter_a":"This is so typical of corporate America. The C Level staff walk away with millions and everyone else has to suck it up.","post_message":"What a shock. Despite Trump's assertions that he was going to stand up for working people it turns out that Wall Street and Goldman Sachs are still running the show - and the Trump administration. Among many other billionaires in the Trump administration is Gary D. Cohn, the departing president of Goldman Sachs and Trump's new director of the National Economic Council. Upon leaving Goldman Sachs, Cohn just received an exit package of $285 million. Yes, $285 million.  And that's how the rigged economy and oligarchy works. The middle class of this country bailed out Goldman Sachs to the tune of over $800 billion. Goldman Sachs paid a $5 billion fine to the U.S. Treasury for illegal activity, as did virtually every other major bank. Meanwhile, no top Wall Street executive is prosecuted for criminal activity. Instead, the president of Goldman Sachs becomes the leading financial adviser to the President. And, to add insult to injury, Cohn and the Trump administration will soon end up supporting huge tax breaks for the rich while cutting Social Security, Medicare and Medicaid. Can we stop them? Yes. But only through a powerful and focused grassroots movement which tells Congress to represent us all, not just the 1 percent."},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will \"immediately terminate\" it."},{"comment_id":"10154295602821037","commenter_b":"Claude, women who use the term \"Feminist libtard\" are sexy.","commenter_a":"Good lord! If men couldn't get a job because they hit on a woman at one time or another throughout the years, there wouldn't be any in the workplace! Women like this give us all a bad name. She must me a feminist Libtard! I'm sorry....some people will do anything to get attention and they are coming out of the woodwork! She acts like he raped her! I'm guessing she's trying to make a name for herself through Trump since she couldn't with her writing skills.","post_message":"Our reporter attended a Donald J. Trump event in 1987: \"Trump said there would be an even better afterparty and I was welcome to join him, but only if I came alone.\""},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"}]
