[{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"\"watching roaches climb the wall, if you called your dad he could stop it all \"","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"911760225550393","commenter_b":"and she's just ugly","commenter_a":"Gabbie Dib","post_message":"One Direction's Zayn Malik  spotted holding hands with girl who’s NOT Perrie   (Via Daily Mail Celebrity)"},{"comment_id":"1638898229733425","commenter_b":"Everything good in your speech, but I believe illegals should not be getting welfare or food stamps, or free health care or education it's just a magnet and most of them are not paying into payroll taxes. You are still avoiding what you are going to do with the illegals that aren't criminals. Actually they did break the law if they came here illegally and if they stay here even if they don't get citizenship it's still ammnesty. You need to be up front with what you are going to do.","commenter_a":"Great speech!!!!","post_message":"Thank you for your wonderful support last night- with regard to my Immigration Speech that I delivered at the Phoenix Convention Center. I love this country - and you, the people. Lets MAKE AMERICA SAFE AND GREAT AGAIN! I love you! Donald J. Trump"},{"comment_id":"10153101911354877","commenter_b":"Give an inch and they take a mile.... true, but knowing that why even give an inch? She's just trying to get attention. If she were a normal woman she would be on every comment feed talking about \"like me on instagram\"","commenter_a":"I don't understand why some celebs consider sharing EVERY aspect of their lives but when they are judged or talked about they immediately ask for 'privacy'.","post_message":"'I demand that I climax': Nicki Minaj gets candid about her sex life in Cosmo - and where she sees herself in ten years.   Grio fam, do you find it refreshing when celebs open up like this? Or is it T.M.I?"},{"comment_id":"824943850887973","commenter_b":"What dumb a holes. They can't destroy anyone. The U.S. Would squash them like a bug.","commenter_a":"Someone shoot this idiot......he is the problem.","post_message":"Warns that \"Tehran will set fire to every military base from which a hostile U.S. plane takes off for bombing Iran.\""},{"comment_id":"938211592934866","commenter_b":"Kick His Ass Anyway, besides it was one of Jesus's Crew","commenter_a":"Jesus says an Eye For an Eye. Someone down there kick his ass Please and Thank You","post_message":"Remember, nothing says \"Soldier for Christ\" like giving a child a black eye!"},{"comment_id":"930444230329383","commenter_b":"And big SUCK IT to rupert & roger, FUCK the both of ya weasels!","commenter_a":"Awesome","post_message":"The folks over at Fox News had hoped to bully Dish Network into giving their toxic channel the cheap air time it demands, but going into a second week of being banished from the television lineup is only proving that Dish has more clout."}]
