[{"comment_id":"1777618975785722","commenter_b":"so take a DNA test and you will see ALL HUMANS have African ancestry! LOL, deport yourself.","commenter_a":"DNA testing would probably show that he has minority blood in him, aboriginal or black....what a moron..","post_message":"Where does he even find these people?"},{"comment_id":"502459539951113","commenter_b":"RINO","commenter_a":"Who cares about Romney! Let's move on and win this one!","post_message":"You cannot be serious."},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"10153050664571615","commenter_b":"@username stfu","commenter_a":"Omg abortions cops killing people rape wtf were talking about a dog killer people come on try and keep up lol people make me laugh","post_message":"NEW FALLOUT: Last night we told you how the Animal Rescue League was distancing itself from The Pittsburgh Steelers following the signing of quarterback Michael Vick.   The second organization that has decided to suspended all activity with the team plus reaction from fans – tonight on Channel 11 News at 11."},{"comment_id":"10154526601676756","commenter_b":"Deport illegals!","commenter_a":"The President who deported more people than any other administration in US history is now the 'shield'. Christ.","post_message":"The Supreme Court finished deadlocked when it considered whether President Obama had the authority to shield millions of immigrants from deportation."},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"520985371427355","commenter_b":"Come get it I live in bend oregon I will be waiting","commenter_a":"come and take it buckwheat","post_message":"They are demanding that we give them money for their ancestors slavery. 'LIKE' if you will REFUSE to pay slave reparations!!"}]
