[{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"689620071188876","commenter_b":"Then they should Cancel the game until they show some respect for the USA","commenter_a":"I'm done with the NFL!","post_message":"This whole NFL squad will join Kaepernick in protesting the National Anthem on Sunday."},{"comment_id":"872932106099872","commenter_b":"Immigrants built this country","commenter_a":"Why can't the homeless get benefits? Or a hostel? but when immigrants come over they get everything at there feet!! How about giving the homeless everything they get and let the immigrants sleep in a fking box!!","post_message":"It has a solar panel to power radio, light and phone"},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support \"feminism\" have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."},{"comment_id":"1066271903469061","commenter_b":"Illegal drugs are banned.","commenter_a":"None; simply ban them! ..... instead of thinking on wasting American lives and huge amounts of money in pointless wars, we should tackle our home problems first....and gun control is the main one!","post_message":"\"What could possibly be the argument for allowing a terrorist suspect to buy a semi-automatic weapon?\"  - President Obama  More from his address here: @webpagelink"},{"comment_id":"10157328778620354","commenter_b":"Kimberly Dawn Horvath Mullins , most Muslim immigrants are actually highly educated doctors, lawyers, computer engineers. Kimberly, you're just a mailman right? Soon you'll be replaced by a drone LMAO, and go back to your trailer living off welfare again LMAO.","commenter_a":"Still waiting for some idiot liberal to explain to me how importing hordes of stinking uneducated radical muslim savages is good for America. Other than dumbass mouthpiecees spouting the usual \"that's not who we are\" bullshit.","post_message":"\"How did we get in the position where we’re screwed if we’re not in the good graces of the Muslim community? Maybe we should stop doing that.\""},{"comment_id":"10153076081181051","commenter_b":"Bitch go kill yourself","commenter_a":"It's like being at the zoo when a monkey wants a banana","post_message":"When this woman found out the store was out of Skittles, she snapped."}]
