[{"comment_id":"10153254400059228","commenter_b":"What a Negative Nancy!","commenter_a":"This is prolly the biggest lie I have heard yet.","post_message":"An Ohio woman searching for her biological mom got the surprise of her life Monday when she learned her mother was a coworker."},{"comment_id":"859553757415299","commenter_b":"Coming out of the mouth of the most oppressive Fascist in American History!!","commenter_a":"Beat that dead horse. ..beat it some more","post_message":"Attorney General Eric Holder told reporters Friday that the federal government is “prepared” to dismantle the Ferguson Police Department if “necessary.”"},{"comment_id":"10157765816045354","commenter_b":"Amanda, I have a question for you.At this moment in time, as we can not get a \"do over\" and the Republicans have a nominee what do YOU do? Do you \"vote your conscience\"? To what end? Don't mean to insult, but truly what do you do? Write in Cruz for President? IMO wasted vote..vote 3rd party? As neither Johnson or Stein don't have a snowball's chance in hell, they can't even get on the debate stage, wasted vote. Vote Hillary? Can't imagine that would be an option either. Any option that I have mentioned do one thing only..help Hillary Clinton. The results: 100k's refugees enter the country; amnesty for illegals who in turn get jobs, healthcare, not to mention open borders for additional immigrants to walk in through; the loading up of Federal courts and the Supreme Court with liberal judges who will destroy the very Constitution you and ...","commenter_a":"I have a better idea...Why don't YOU and the GOP along with Congress get on board with the true Liberty Loving Conservative Patriots? Yea, sure I have a lot of nerve, but then again so do you, jackass.","post_message":"\"Those people need to get on board.\""},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take \" street drugs\" have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are \"self-medicating\" themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their \"customers\" died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"10153414254384203","commenter_b":"50 cent throws like a girl... Lol. Might as well back one.","commenter_a":"That's the only way he can get his name out without dissing someone...","post_message":"\"Hillary was the president already once. You know what I sayin?\""},{"comment_id":"10153269973986167","commenter_b":"Enjoying your tax Magnus rates? And how many refugees and immigrants are you valuing?","commenter_a":"As a Scandinavian, I don't know if I should laugh or cry on your behalf....","post_message":"An actual question from last night's #GOPDebate"}]
