[{"comment_id":"10153256753408445","commenter_b":"All I know is I'm gonna smoke so yea u can lick my ass crack","commenter_a":"yea lets kill all those smokin weed dumb fkin pigs lay em all down permanently","post_message":"#NEW - Hundreds of Local Cops Are Requesting Armored Trucks To Fight War on Weed"},{"comment_id":"10153550456286337","commenter_b":"Fat lisa loeb looking bitch","commenter_a":"Yeaaaaaah... That guy can fuck directly off.","post_message":"\"Somebody who’s overweight? I find that utterly repulsive and disgusting.\"  WORST. TRAINER. EVER."},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."},{"comment_id":"1146539692060530","commenter_b":"I have 3 son's and from the time they were little my husband and I taught them to never hit a girl told them to walk away from them,they never ran into a situation where happened, but I got to say if a girl( and I'm using this term lightly) ever hit one of my son's like she is going after this guy ,I probably would tell them if they act like man treat them like man this girl talks and act's like a guy!!","commenter_a":"Never hit a woman. Period. Walk or run to get away, but don't hit her. File a suit, get her charged, don't strike a female. Unless she's trying to kill you. Then do what you have to.","post_message":"WATCH THIS BEFORE DINNER AND ... discuss with your son. 16M video views. Wild stuff."},{"comment_id":"10153051145414094","commenter_b":"And if gun laws don't work, why have any safety laws? Should hardware stores sell nuclear material because the bad guys will get anyways? Should we not have traffic laws because the bad drivers will run a stop light anyways and crash into a school bus?","commenter_a":"While Republicans were defending the lack of sensible gun laws and calling this an \"accident\", the families and communities of this Church showed such dignity and Christian values by first saying that they forgive the shooter. They are such an amazing example and inspiration to this country. God bless them.","post_message":"Relatives of people killed in a shooting at a black church in Charleston, S.C., addressed the suspect in court Friday In an extraordinary display of grief and forgiveness."},{"comment_id":"10154568274058690","commenter_b":"@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."},{"comment_id":"10152804039052293","commenter_b":"Wonderful news she was untouched, hope her family has a quick recovery.","commenter_a":"Amazing. I also wonder what brand car seat, because I wish to buy that for every expectant parent I know","post_message":"“Then they said her eyes opened and she started smiling,\" a relative said."}]
