[{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"\"This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.\"  - LeBron James"},{"comment_id":"10153305375703984","commenter_b":"She's a liar and possibly more","commenter_a":"She's gonna be flash in the pan, here and gone.","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign...  Do you hope Hillary loses?"},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10153557014143984","commenter_b":"To the Ignorant person that said I must be an illegal immigrant you just showed you how ignorant you are. I'm an American. A REALISTIC AMERICAN!!!!! I agree with the person that mentioned the abuse of the welfare system, but those are Americans doing that. Illegal immigrants can't get benefits!!! To the person who said that the companies are putting money in their pockets I agree, but as soon as they have to pay minimum wage and provide benefits and go legit the cost will be passed onto the consumer it always does. To the person that mentioned Hispanic, Mexican etc. I never mentioned any group of people I made a general comment about all immigrants. You just showed how stupid you are that just because I mentioned working in Orange fields you automatically stereotype I was talking about Spanish people. Here's a little info for you not only Spanish ...","commenter_a":"This country was built by immigrants both legal and illegal. Im tired of hearing people complain about illegal immigrants!!! Who the hell do you think are working the lowest paying jobs that without them this country would not function. Will any of you go clean toilets for 6 dollars an hour (that's if they can get that much). NO!!! Would any of you go to the orange fields and go pick oranges for hours in over 98 plus degree weather for pennies a bag. HELL NO!!! But you like when you don't have to pay an arm and a leg for orange juice. If there were to be no illegal immigrants the costs of a lot of things people enjoy would sky rocket because the company would have to pay out more for employees passing the increase on to the consumer!!!!!! Everyone needs to back off immigrants because unless your ...","post_message":"There have been many to come out against Trump after his comments on illegal immigration, but one beloved politician just did exactly the opposite.   Do you support this Republican for taking a stand for Donald Trump?"},{"comment_id":"10153369802901037","commenter_b":"Tara! Mag-uber lang tayo! ;)","commenter_a":"@username gala na tayo! :)","post_message":"Thousands of Mexico City taxi drivers protest Uber, then Uber fires back."},{"comment_id":"1197816346947147","commenter_b":"She is a nasty offensive woman, and deserves being humiliated.","commenter_a":"I despise what she did to our good men and women in Benghazi and I despise her lying but this is offensive. I am embarrassed for you that you post something as low as this.","post_message":"OMG! The AP Took This Photo Of Hillary And It Proves She's Literally Full Of Crap! She Wants It Destroyed!  OOPSIE! Talk about a sh*ty situation! Let's make this viral!   Spread this everywhere if it made you LOL-"},{"comment_id":"10153898072441680","commenter_b":"Hillary has no respect for women! Ask the many rape victims of her husband - they'll tell you so!","commenter_a":"Right on-NBC survey monkey poll!! Ha,ha that's a good one-where was the survey taken,\" at the Bronx and Philly zoos! Did they survey the snakes?? How bout the cheetahs, the rats, the felons??! God help us!!!","post_message":"The NBC/SurveyMonkey poll out Monday finds that 63 percent of likely voters say Trump doesn’t respect women much or at all."}]
