[{"comment_id":"10154473898974411","commenter_b":"@username stick to your supermarket shopping you dumb f","commenter_a":"So many ignorant people commenting on this. This is a traditional harvest of one of the only renewable resources the inhabitants of this barren rock can survive from. Educate yourselves.","post_message":"'The ordeal began this morning when locals spotted a pod of between 100-150 pilot whales'"},{"comment_id":"876414139081949","commenter_b":"You guys should follow the example of other country's. In Panama there is a big movement right now. No more inmigrants! Everybody is taking the social media and demanding that all the undocumented get out of the country! So let your voice be heard!","commenter_a":"Grinning fool. Poster picture for Term Limits.","post_message":"Click to see the back-room deals Republican leaders are making to fund Obama's executive amnesty..."},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?”  Answer: “I think she’s honest to the people who pay her.”  MORE: @webpagelink"},{"comment_id":"10153511062521336","commenter_b":"None of them, should be able to Vote, till they Pay American Taxes for at least 10 years, then They would Understand, how We all feel, about having to Pay for their being here!","commenter_a":"Here is a photo and article - Are our elections being unfairly skewed through legal and illegal immigration ? @webpagelink","post_message":"Show us in one photo what you think needs to change in America and your photo could be featured in the first Republican presidential debate. Submit it here: @webpagelink  Don’t miss the Fox News-Facebook debate live from Cleveland August 6th on Fox News Channel!"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"10152623544456680","commenter_b":"Yes, I want our economy ran into the ground by having a college drop-out as our president. Said no one. Ever.","commenter_a":"I would rather see him run than Walker! I'm scared of Walker. After what he's done in WI, our economy would be in shambles after one year under him. @webpagelink","post_message":"Jeb Bush isn’t playing well among Republicans, Peggy Noonan writes in a new Wall Street Journal op-ed."},{"comment_id":"1136992022978933","commenter_b":"Every Bill which shall have passed the House of Representatives and the Senate, shall, before it become a Law, be presented to the President of the United States; If he approve he shall sign it, but if not he shall return it, with his Objections to that House in which it shall have originated, who shall enter the Objections at large on their Journal, and proceed to reconsider it. If after such Reconsideration two thirds of that House shall agree to pass the Bill, it shall be sent, together with the Objections, to the other House, by which it shall likewise be reconsidered, and if approved by two thirds of that House, it shall become a Law. But in all such Cases the Votes of both Houses shall be determined by yeas and Nays, and the Names of the Persons voting for and against the Bill shall be entered on ...","commenter_a":"It'll fail in the Senate, and if not Obama will veto it","post_message":"Even Democrats voted for a 'pause' on the Syrian refugee program."}]
