[{"comment_id":"10153953664426509","commenter_b":"They will invade us with mountain goats!","commenter_a":"@username so scared ..lmao","post_message":"North Korea threatened the U.S. with attack if military exercises are conducted as planned. Get details here: @webpagelink"},{"comment_id":"10155339234553132","commenter_b":"Why have this girl on TV really it is ridiculous !","commenter_a":"Take all her electronics away....and Danielle's too!","post_message":"Danielle Bregoli is back, and she not mincing words."},{"comment_id":"10153268633329197","commenter_b":"They are all dangerous!","commenter_a":"She was a nurse and still went tanning? I'm confused. Surely she knew it was bad","post_message":"This Alabama nurse was an avid user of tanning beds, sometimes going 5 times a week! Now, she has developed skin cancer and she wants to help stop others from getting the disease. See the graphic way she shared her story --->  @webpagelink (WARNING: this story contains graphic content)"},{"comment_id":"712967945491547","commenter_b":"Gals, you are missing the point.The birds ARE god","commenter_a":"Tom Beyer","post_message":"One of the prettiest scenes we've ever seen: A flock of starlings form spectacular flyover in Israel's sky (Video: Reuters)"},{"comment_id":"450484615139832","commenter_b":"Who give dam who she is jealous hater","commenter_a":"He sucks period!","post_message":"White House panicked..."},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"763958360369439","commenter_b":"A child should not have that choice any more than she can legally choose to smoke and drink.","commenter_a":"With all the people out there fighting for a woman's right to make choices for her body (abortion and birth control) how can you justify forcing medical treatments on someone? Either a person has total control of their body or they don't. Can't have it both ways.","post_message":"After treatment, she's in remission."}]
