[{"comment_id":"10157476731040725","commenter_b":"Now get you're head out of his illegal Orange trumpster butt2.. It's over flowing with his B.S for a LIFETiME!!!!!","commenter_a":"This is what I don't understand, Every Trump rally, there are 1000's of people in attendance. Not as many people show up at Clinton rallies. Yet she is ahead in the polls!! Is the media and the poll takers rigging the outcome of the polls?","post_message":"A beautiful evening in Ft. Lauderdale, Florida last night. We need to WIN Florida- so make sure you get out and VOTE this November! I am here all day - attending events -- looking forward to a great day! -DJT"},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"},{"comment_id":"10153535673013352","commenter_b":"Rosey got no pics cuz she is a big fat pig","commenter_a":"Ape in the house","post_message":"The squatter from hell: Woman ‘moves into $800,000 Martha’s Vineyard vacation home and sells the owner’s possessions in a yard sale’"},{"comment_id":"10153000542416336","commenter_b":"tHE aTHEIS GROUP NEEDS TO STOP MAKING TROUBLE. IF THEY DON'T LIKE ANGELS ON THE MEMORIAL MOVE ON WE SURE DON;T WANT YOU.","commenter_a":"What about a Christians First Amendment rights?????? I am so sick of all this...","post_message":"An atheist group wants angels removed from a teacher's memorial, claiming its presence on public grounds violates the First Amendment."}]
