[{"comment_id":"1328806503882265","commenter_b":"I bet most of these women pretending trump troubles them are the same willing to kill an unborn child at 13 weeks","commenter_a":"The whole family should crawl back in that BLACK WHOLE THEY CAME FROM..","post_message":"Donald J. Trump's son defended his father's comments caught on tape, saying other men make similar remarks."},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"452509181540789","commenter_b":"Courtney i could care less what a fugly cunt, such as yourself thinks.","commenter_a":"No one wants to see ugly bitches without a top on.....maybe feminazis, but they don't count they're not people","post_message":"We support these brave and courageous women as they demonstrate against the rise of #policebrutality nationwide. What do you think about this form of protest? Effective?   Learn more → @webpagelink #SayHerName #FreeTheNipple #StopPoliceBrutality #TFTP"},{"comment_id":"10152967718236545","commenter_b":"White male driving.","commenter_a":"He's going 5 miles an hour. 1 car go in front and the rest block him in. This isn't rocket science. I don't think this is that news worthy. Just let us know what happens when it's over. #annoyed","post_message":"UPDATE: From Fort Worth police: Citizens, for your safety, please do not stop to take pictures, stay in your vehicle.  You may want to avoid east bound I-30 in Fort Worth for a while. Traffic is backed up for miles as police are still in a low speed pursuit of a vehicle.   WATCH LIVE: @webpagelink"},{"comment_id":"1242112452475449","commenter_b":"REMEMBER!! ..The Leftist Liberal News Agencies, pushed very hard for the E.U. to take in the Islamic Immigrants with Islamic Ideologies.","commenter_a":"Islam is a cancer and needs to be removed","post_message":"President Obama says the killings in Paris are \"an attack on the civilized world.\" For more coverage: @webpagelink"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"}]
