[{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"},{"comment_id":"1035891609764351","commenter_b":"^ Africa has the most terrorism on the daily and Nigeria in particular last three months schools had radical Muslims go in and blast kids! Hundreds dead No Americans there...","commenter_a":"Terrorism in Canada is only in the mind and children shouldn't suffer because of a bunch of paranoid adults...","post_message":"The Edmonton Public School Board has put all trips on hold as well."},{"comment_id":"10154744279541323","commenter_b":"ooh, you bitch you. i wouldn't invite you to your own funeral","commenter_a":"Hillary looked like she could use a shower and some crayons when she slithered out from under her rock last night.","post_message":"\"None are without controversy.\""},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work.  She went to the hospital, where her ear was numbed and stretched even more, freeing Bart.  \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"}]
