[{"comment_id":"10152591837062061","commenter_b":"I like this","commenter_a":"For real!!","post_message":"Now that's wearable technology! China apprehends man trying to smuggle in 94 iPhones. abcn.ws/1waWmjv"},{"comment_id":"1098657656855065","commenter_b":"She's a DOPE, I don't know about Doped up.","commenter_a":"So stupid Andddddddddddddddd Hillary nearly fell stepping off the podium She looks doped up","post_message":"UNREAL! WATCH JOE BIDEN Point Out The Guy Who \"Follows\" Him Around With The NUCLEAR CODES Right After Saying TRUMP Couldn't Handle The Codes [Video]  And we have THIS clown in charge?"},{"comment_id":"10153341871609411","commenter_b":"Lady is.Europe.is ur ultimate paradise huh wow, what's ur talks pointing out? Ur a pervert who looks at European ladies as 'new lady to rape'? U think European ladies are the ultimate ones in world? U must be an ignorant fool since birth","commenter_a":"Just thinking about sex is not life, u can be happy with out thinking about sex Thinking of sex make us animal and blind and leads u to rape a new woman","post_message":""},{"comment_id":"1277987642251583","commenter_b":"When I say technology, I'm talking about millenia of advancements. Even our simplest tools at one point put someone out of work, probably starting with the wheel. If you want to walk away from technology (or just some technology) that's your choice, just don't try and force others to pay for your choice.","commenter_a":"Low skill workers have been making this argument for generations since the first automation came about and it still doesn't work. Someone still has to design, manufacture, install and service the machine. Someone has to stock supplies for it to use. Still plenty of jobs, just not the job you were doing yesterday. They are also overlooking the other basic problem that the Government doesn't create wealth. If you get a freebie from Uncle Sam, that came out of someone else's hard earned money via taxes. If we're all sitting at home due to this miracle automation, then there's nobody around to pay the taxes to fund the government. It simply doesn't work. Worse, we've seen countless times around the world how it doesn't work and people still don't get it.","post_message":"Simply put, the idea is that Uncle Sam will cut citizens a regular paycheck whether they work or not."},{"comment_id":"893334250795530","commenter_b":"@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"},{"comment_id":"1002745926520222","commenter_b":"HITLERY, MURDERS AMERICANS IN THE WOMB!!!!","commenter_a":"Stop Hate Dump Trump","post_message":"WATCH LIVE: Donald Trump speaks at his second campaign event, this time in Eau Claire, Wisconsin. Earlier in the day, he spoke to supporters in Valley Forge, Pennsylvania."},{"comment_id":"1961690760557329","commenter_b":"How gorgeous is their baby gonna be @username @username can't believe one of my other husbands got someone else knocked up tho wtf","commenter_a":"Montana Cases","post_message":"Congratulations Rosie Huntington-Whiteley!"}]
