[{"comment_id":"10156488324870093","commenter_b":"About time now shoot the poachers especially dentists lol","commenter_a":"Thanks!!","post_message":"Yay!"},{"comment_id":"863999693637372","commenter_b":"first lady has no class what so ever id be embarrased sitting next to them","commenter_a":"michelle has the class of fergusson protesters","post_message":"“Michelle Obama looks like she’s part of the cast of...\""},{"comment_id":"10154502038936077","commenter_b":"There is no good reason to watch episodes I, I I, or I I I. They suck, and you know most of the back story just by watching the originals. Episode VII was a great movie and I imagine this one will be as well. The second set of three are trash.","commenter_a":"Daniel Roach","post_message":"Do you agree?"},{"comment_id":"1018456324917286","commenter_b":"It's not Trumps place to judge. Isn't that what the gays and muslims are always complaining about?","commenter_a":"I can hardly believe that I even watched that whole segment on The Last Word With Lawrence O'Donnell.","post_message":"Donald Trump lets a supporter calling President Obama a Muslim slide."},{"comment_id":"10154125094006409","commenter_b":"Hillary is the CLOWN","commenter_a":"They already took our voices away anyway, so what difference does it make? Donald Trump didn't win the popular vote. Yet, he's the next \"President\" anyway. The guy's a CLOWN!","post_message":""},{"comment_id":"642456822585523","commenter_b":"ong! snd the PC powers that be will make a laughing-stock yet again of America & our Right to defend Our Laws!!!","commenter_a":"You get detained or arrested for saying the word \"bomb\" in an airport and this turd gets away with this? If it were a white boy, we'd never hear the end of it.","post_message":"JUST IN..."},{"comment_id":"10154093507981337","commenter_b":"She's not hot enough","commenter_a":"I love Daisy. She's gorgeous. She'd be perfect for the role.","post_message":"Daisy Ridley as Lara Croft in a new Tomb Raider?? She's been having conversations about it..."}]
