[{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"674600329361440","commenter_b":"rep need to get a life","commenter_a":"Look at that! I bet there are at least 100 people there! Maybe unpaid to boot!","post_message":"WATCH LIVE: Hillary Clinton and Elizabeth Warren campaign together in New Hampshire."},{"comment_id":"1201296159904188","commenter_b":"Trump a moron! !!","commenter_a":"Donald J. Trump","post_message":"Megyn Kelly May Have Just Crossed The Line With This Comment About Trump  She just started a battle that she will never be able to win.  Do you stand behind Trump over Megyn?"},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"1264114950298416","commenter_b":"Trump is a dick and you are a piece of ooow, I'm so scared! As if!","commenter_a":"Hey Kellyanne, I'm going to criticize the orange menace every chance I get!! Come and get me!!","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"969742843072343","commenter_b":"Women shouldn't get a free pass to kill.","commenter_a":"After a speech, pro-life activist Penny Lea was approached by an old man. Weeping, he told her the following story: \"I lived in Germany during the Nazi holocaust. I considered myself a Christian. I attended church since I was a small boy. We had heard the stories of what was happening to the Jews, but like most people today in this country, we tried to distance ourselves from the reality of what was really taking place. What could anyone do to stop it? A railroad track ran behind our small church, and each Sunday morning we would hear the whistle from a distance and then the clacking of the wheels moving over the track. We became disturbed when one Sunday we noticed cries coming from the train as it passed by. We grimly realized that the train was carrying Jews. They were like cattle in those cars! Week after week ...","post_message":"Wise words from one of our Founding Fathers. Do you agree?"},{"comment_id":"10154345626992549","commenter_b":"First off Executive orders are largely symbolic. Building a wall will do absolutely nothing for illegal immigration and drug trafficking other than to satisfy the small minority of Americans who voted for Trump. The tax payers will have dole out billions to build this \"wall\" without benefit. You can't even call this a viable \"infrastructure\" project. I do agree with deporting illegal criminal offenders and would go even further by deporting criminals with legal but non-permanent status. Not only from Mexico but anywhere. Ireland, Israel, Africa, etc...","commenter_a":"Isolationism does have consequences.","post_message":"This afternoon, President Donald J. Trump is expected to order the construction of his long-promised wall along the U.S.-Mexico border and take other executive actions on immigration. @webpagelink"}]
