[{"comment_id":"10154138194905329","commenter_b":"Look it says right here you're a little bitch.","commenter_a":"@username we got a badass over here","post_message":"When even art is tryna make gainz."},{"comment_id":"10153097192830090","commenter_b":"No! Don't bring the here we got enough idiots here already","commenter_a":"Move the Capital to Texas, will get it fixed.","post_message":"Since Obama can't provide real \"change,\" we're doing it for him.  Share what our Republican-led Congress must fix in Washington: @webpagelink"},{"comment_id":"473761302814995","commenter_b":"Get rid of all those freeloading motherfuckers.","commenter_a":"No- what part of ILLEGAL aliens does the government not understand?","post_message":"Bernie Sanders is calling for a path to citizenship for Mexican immigrants, saying \"We have 11 million people in the United States who are now undocumented and I believe they deserve a path towards citizenship... I believe that what immigration reform means is uniting families, not dividing families.\" Do you agree with this?"},{"comment_id":"10154637985014614","commenter_b":"This is not ordinary little sedan, ya know, lady!","commenter_a":"if they wanted to stop him they'd of poped his tires already","post_message":"Update: California Highway Patrol officers were in pursuit of a stolen big rig on the eastbound 10 Freeway in Riverside County early Tuesday afternoon, authorities said. @webpagelink"},{"comment_id":"10154941890619705","commenter_b":"Yeesh and I feel bad for my soy chai latte. I can't drink milk so its soy but I still feel bad about a special order. Not anymore!","commenter_a":"Melissa Lane","post_message":"And you thought your Starbucks order was complicated."},{"comment_id":"10153616192149342","commenter_b":"I can count the ppl, I can really count on on 1 hand.... With fingers to spare for a hot chick!","commenter_a":"Some of your \"real friends\" don't either. js","post_message":"How's your Facebook friend list?  #abc13"},{"comment_id":"10153584406778352","commenter_b":"stupid girls!!!","commenter_a":"They need to be committed for a long long time","post_message":"Two Teenage Girls Kidnapped a 14 Year Old, Made Her Masturbate, and Tortured Her For 17 Hours By Scalping Her Hair and Pouring Salt Down Her Throat"}]
