[{"comment_id":"10152932838822169","commenter_b":"I like the way you assume everyone is consuming too much. When sitting on our butts all day has more to do with it.","commenter_a":"Makes sense. The explosion of obesity has occurred after the advent and proliferation of fast food restaurants.","post_message":"Fast food kills gut bacteria that can keep you slim, study finds (From PBS NewsHour)"},{"comment_id":"10153855338620047","commenter_b":"Nothing will happen to any of this mafia, unless Trump is elected. I hope everyone saw the video on TV, where Obama actually told an illegal to vote tomorrow and to tell her friends it was OK for illegals to vote. It is simply a TAKE OVER OF AMERICA!!!! It is a WAR by ballot!!!! Wake up Americans because if we lose tomorrow, we lose America!","commenter_a":"Prosecution","post_message":"Sign and Share our urgent petition to demand the Attorney General's immediate resignation for breaking the sacred trust of the American people."},{"comment_id":"10156778240410354","commenter_b":"If he can't handle her, Hillary will make him her bitch. The bitch Trump. Has a ring to it.","commenter_a":"Enough of FOX NEWS \"debates\", Time to vote, enough of Rubios super pac trying to make him look good","post_message":"But the campaign's stated reason for the decision may be different than one might expect..."},{"comment_id":"10154378235307061","commenter_b":"ironic since even king himself thought malcolm x was a hack","commenter_a":"I am a white man, but it seems to me that Islam provided to Afro-Americans a system of faith and structure that Christianity failed to do. These people took names of Islamic heroes, rather than the surnames of their owners. Muhammad Ali took stature when he changed his name from Cassius (Roman name) Clay (ancestor white owner?). In America we stand up for who are and what we believe to be right.","post_message":"Malcolm X was killed on this day 52 years ago. @webpagelink"},{"comment_id":"1239000506196199","commenter_b":"WE NEED A BILLIONAIRE VIGILANTE TO STOP THE RIGGED SYSTEM THAT LET HILLARY CLINTON GET OFF!!!","commenter_a":"So he really thinks minorities are buying this load of BULL💩💩💩💩💩💩💩💩💩💩💩💩","post_message":"\"We will honor the people with the truth and nothing else,\" Donald J. Trump said during his acceptance speech at the #GOPConvention."},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10153712175233352","commenter_b":"So it would be ok to throw down in front of a toddler is that what you are saying? She should have put her down for what huh, for what? Get some sense in your head !! The only guilty party is the lil bitch who hit the girl holding a child she is a straight up coward and thats probably the only reason she hit her cause her hands were full!","commenter_a":"I think all parties are guilty the ones egging it on the mother of the child and her friend. Her friend seen what was going on so she should have taken the baby and the mother... Should have put the baby down as she see the girl kept saying put the baby down and appeared not to give a dam. Believe me all parties played their part in the hatred or what ever that got them to this point. In reality the mother used her child as a pawn thinking it would have saved her from a ass whooping putting her child in danger. Thank God the female was caught and the baby is ok. They all need to get it together... Because believe they all full of shit and played a roll in this fight...","post_message":"Texas girl, 13, who was caught on camera as she launched brutal assault on rival teen holding a toddler is now in police custody"}]
