[{"comment_id":"10157848946740389","commenter_b":"The People Must Protect the Republic, since DOJ and FBI are MIA! Trump wins in a landslide; however, the polls are a lie, and her rigging election must prove the lie! It's up to us to stop it, or America becomes just another Brazil. Infowars.com","commenter_a":"By hook or crook, ain't nothing on the books that we can't cook!","post_message":""},{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"1642069832709355","commenter_b":"I'm voting for Trump.Is it just me or is Sara palins voice extremely annoying?Like worse the that Kathy griffins creature.","commenter_a":"I approve this message. I am anxious to know Mr. Trump's running mate. Go, Donald!","post_message":"I am greatly honored to receive Sarah Palin's endorsement. She is a friend, and a high quality person whom I have great respect for. I am proud to have her support. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"10154082148493797","commenter_b":"Who cares. If they are here illegally they need to be gone!","commenter_a":"Tell them to show how they got the money to open their busines....... See fox should search before they put these articles. They did not pay taxes on one penny also they were on welfare so hmmmm think it through collecting welfare and saved a lot of money to open a business . That is fraud.......","post_message":"THE AMERICAN DREAM: Donald Trump's plan to end birthright citizenship is drawing fire from Republican challengers. In particular, one successful family from Little Village that would be torn apart if Trump got his way. That couple owns Los Mangos, which has been open since 2012 and is growing."},{"comment_id":"10153267588169497","commenter_b":"@username's a big ole pussy","commenter_a":"Deserter.","post_message":"In Focus:   The Onion breaks down what you need to know about the former POW"},{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"10154132687525579","commenter_b":"I SWEAR, THE MEN IN THIS COUNTRY ARE SUCH PANSIES NOWADAYS.","commenter_a":"No matter the numbers, you won, Bernie! America will not be the same because of your tenacity, integrity, and values! Thank you!!! We'll keep fighting. #NotMeUs If you like this comment, please contribute to Sanders's campaign at the below-posted link. @webpagelink","post_message":"Bernie Sanders: \"Tonight, while the results are still not known, it looks like we are in a virtual tie.\" Full video here: @webpagelink #IAcaucus #IowaToday"}]
