[{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what \"ATTEMPTED TO KILL THEMSELVES\" you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"10153459873801756","commenter_b":"She's a Jew deliberately provoking hatred between Christians and Muslims.. Ask yourself why...","commenter_a":"I have to say I thought more people would be for protecting speech from violence, since we're in the liberal west and all, but apparently not. Paris gets shot up and the claim is to be \"je suis charlie,\" Texas gets shot up and \"they were asking for it.\" Makes no damn sense. You're either for the rights of us all to speak without fear of being shot, or you're not. I went to a public school and I learned that Voltaire quote. Small minded terrorists of an idiot ideology that requires giving your life to kill anyone who mocks your \"sacred\" beliefs. What a load of bullshit.","post_message":"The group's executive director runs a website called Atlas Shrugs, which The New York Times says \"attacks Islam with a rhetoric venomous enough that PayPal at one point branded it a hate site.\""},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"1715229538739557","commenter_b":"True. Plus who would want to see Hillary the Hag naked","commenter_a":"She was a good looking woman, now lets see them run nude picture of Hillary or maybe Chelsea, but then that would be equal and fair treatment and they will NOT be that.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"10153607644803984","commenter_b":"Vote all those dirt bag's out we need people with balls not vagina2","commenter_a":"Now how does everyone feel about this 'War Hero'?","post_message":"BREAKING: John McCain's secret move against arming our troops here at home just got exposed, and what he did is absolutely sickening.  McCain hoped this would never come out, but we're not going to let him get away with this.  If you want to hold McCain accountable for his deplorable actions that endangered our innocent troops, be sure to share this article."},{"comment_id":"1203432829732943","commenter_b":"She'll pardon herself the first day in office","commenter_a":"If Killary gets elected, it may well really become illegal to read anything that could be detrimental about her and her actions.","post_message":"CNN: Remember, it's ILLEGAL to Read WikiLeaks Emails [VIDEO]"},{"comment_id":"10156410644080725","commenter_b":".... And thats why im voting for Bernie Sanders and not a wealthy racist biggot like yourself.Mr. Trump our country doesnt need you.. you talk about about immagrants but all your wives were immagrants? What are you but an immagrant to this country yourself! Unless your native but that would be news to us! What tribe you belong to?? I.D cards to all the muslims in this country? Is this Nazi Germany???","commenter_a":"Trump is like a pre-PC candidate! So refreshing!! I remember feeling just a leetle bit awkward at first. That made me realize just how far we've fallen! #TeamTrump2016 #MakeAmericaGreatAgain #DitchAndSwitchNow","post_message":"People have got to stop working to be so politically correct and focus all of their energy on finding solutions to very complex problems!"}]
