[{"comment_id":"1735932806679169","commenter_b":"Considering those men put their lives on the line to save ours let them fly the American Flag ,","commenter_a":"This is stupid son of a bitch","post_message":"A Rhode Island city official just called local firefighters “terrorists” and compared them to ISIS for putting THIS on their firetruck.  You just can't make this stuff up..."},{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are \"ultimately helping do ISIL's work.\"  @webpagelink"},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"10153098697497522","commenter_b":"Let's see how \"sassy\" you dumb bitches are when ISIS gets you. Take your #raisesassygirls bullshit to syria.","commenter_a":"#VOTE The Republican Radical Christian Crazy #PARTYOFHATE out of local state and Federal Government #ENOUGH #VOTE #GUNSENSE #VOTE #Hillary2016 #WitchHunt #BroomsUp #BlackLivesMatter #RAISESASSYGIRLS #FeVoteRising #DontBeAwaLLfloWer #VOTE","post_message":"Is Donald Trump suffering from imposter syndrome?"},{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."},{"comment_id":"988569754496111","commenter_b":"Wow, get jobs? because we kill all the whales every year","commenter_a":"I have no respect for the tribe. Why don't they get jobs and stop killing all the whales.","post_message":"The public weighed in tonight on whether the Makah Tribe should be allowed to hunt gray whales again >> @webpagelink"},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."}]
