[{"comment_id":"10153222530101167","commenter_b":"Ken, We still don't have all the emails she deleted several so we really don't have the entire story. But if we did get anything on Obama that would make Impeachment even better.","commenter_a":"They need to close down the Benghazi Committee and put those resources to the Hillary Email scandal.","post_message":"Stunning news: It's not just that Republicans are using the committee to launch partisan attacks on Hillary Clinton. The committee is also accused of illegally retaliating against an active duty investigator."},{"comment_id":"1264994986901695","commenter_b":"I am for the national guard to start rounding up these illegal wetbacks.","commenter_a":"Yes!","post_message":"America's Freedom Fighters"},{"comment_id":"1195181073877040","commenter_b":"Kick her ass out","commenter_a":"What does Jesus tell us about judging others. I get what your saying, but look in the mirrior and pull the plank out of your own eye before pulling the spec out of anothers. Peace","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"1439256216084684","commenter_b":"I ONLY HOPE FOR THE PEOPLE OF MASSACHUSETTS SEE WHAT A PHONY LIBERAL DOLT SHE IS.","commenter_a":"Caught Red-Handed! Elizabeth Warren's Big Secret Just Got Exposed for All to See... @webpagelink","post_message":"Is Elizabeth Warren in political trouble in Massachusetts?"},{"comment_id":"1777693052452722","commenter_b":"NOTHING BUT A BUNCH OF FILTHY FUCKING NIGGERS KILL THEM NOW!!!","commenter_a":"Come and get it you cowards. I'm just about fed up with idiots like you. Have you ever looked at who's out number.","post_message":"RACISM: Black Panther Promises To Kill All White Babies.  No media outrage, no riots, nothing.  Do you think they should all be arrested?"},{"comment_id":"893865083995373","commenter_b":"Ha! That ones funny","commenter_a":"It's bullying and an example of bigotry BUT so are a lot of costumes. People get offended a bit too easy these days","post_message":"Halloween costumes are often inspired by pop culture and one store selling the Caitlyn Jenner inspired \"Call me Caitlyn\" costume is taking flack from activists saying it's bullying and an example of bigotry."},{"comment_id":"10153301628035496","commenter_b":"Really, Brenda, perhaps you should have looked at the message she was sending. Why should we have to be subjected to her cop bashing, Black Panther, Malcolm X etc. opinions. That's not talent. Perhaps we should go back to marching bands and perhaps you should think about reporting the news or even better retiring.","commenter_a":"Wow these comments are funny to me. Beyonce did not give a hateful message. You all are upset because of what you saw visually and what the media has told you what she is singing about. Have any of you even listened to the song or listened to her response to the media turning her song into hate? And she and her husband have done a lot for the black community. They just don't have the media around to show it because that is not what it's all about.","post_message":"Brenda's Last Word on Beyonce's so-called 'way too political' Super Bowl performance.  PHOTOS from the performance: @webpagelink"}]
