[{"comment_id":"10152949556817061","commenter_b":"Women was created for man , but to reach its own God is not pleased and we all will be judged. If thus world don't change from wicked and evil ways it will be destroyed just as God promised in the wink of an eye like a thief in the night. His timing know one knows but keep it up it'll be soon","commenter_a":"To all you naysayers: IF MARRIAGE IS SO SACRED, BAN DIVORCE.","post_message":"BREAKING UPDATE: US Supreme Court rules same-sex couples have constitutional right to marry: @webpagelink"},{"comment_id":"1800961159929656","commenter_b":"This is not the true Ekklesia of Christ! I keep saying it, the true Ekklesia of Christ will have to return to the home, where it never should've come out from!","commenter_a":"You can't call this a Christian church if it goes totally against Gods word and if all that is allowed it is totally wrong to change the bible to fit your agenda. The bible says beware of wolves in sheep clothing it also says we are in this world but not of it. We true Christians are to be aware of these wolves and Not join in the sin with them but we are to pray that God will remove the scales from there eyes and pierce there heart so they can see and repent of what is so wrong that they think is right.may God have mercy on these people","post_message":""},{"comment_id":"1619415335012246","commenter_b":"Who do they think they are that they can come over to our country and try to change it? When they come here they have to obey our laws! This is our country not there we were to go to their countwe would have to obey their laws!","commenter_a":"Love the US & abide by our beliefs & the law of our land. Under God we trust & our constitution. Or GET OUT period.","post_message":"Here response is sickening.  These radicals must be stopped."},{"comment_id":"10153748749906336","commenter_b":"I want to applaud those that entered our country illegally and their main priority was to become legal and accomplished it. Talked to some that did just that as a priority. Yet, we have the illegals that come and breed like rabbits for an anchor babies. Free benefits. Or men that leave family in other countries, shack up with a women here and start rutting to produce too. Instead of becoming legal. Some have been here over 20 years. If only all would follow the steps to be here legally we would not be as we are today.","commenter_a":"I'm Hispanic and I support Donald J Trump for president Donald J Trump for president","post_message":"WATCH: Donald J. Trump invites a woman onto the stage at a Nevada rally. “I’m Hispanic and I vote for Mr. Trump!”"},{"comment_id":"1001794969843293","commenter_b":"Feminism is cancer.","commenter_a":"Sorry lady but I put my arm around my wife because I lover her. She does the same to me and we have been married for 49 years. Maybe you ought to try a little bit of love instead of hate.","post_message":"The Dame has spoken."},{"comment_id":"10153369808282377","commenter_b":"GOD BLESS PRESIDENT TRUMP...Donald Trump For President","commenter_a":"I guess I am again confused. A few days ago there was a story about Donald Trump giving both Dr. Carson and Sarah Palin a potential job in his administration should he get the Presidency and there was a great cry from many who said \"That is illegal\" Now Cruz names an entire National Security Team and it is OK? I have no problem with either of them talking about their potential teams, I just wonder why Trump's potential plans are \"illegal\" and Cruz's potential appointments are OK?","post_message":"Ted Cruz's national security team includes former Assistant Secretary of State Elliott Abrams, former Missouri Sen. Jim Talent, and former U.S. Attorney Andrew McCarthy."},{"comment_id":"10153530234038854","commenter_b":"We knew this was coming, all part of the homosexual agenda.","commenter_a":"By Law, Churches are automatically Tax Exempt, so there's no need for them to have an IRS 501C-3 status. If you don't believe it, I suggest you research it.","post_message":"This is going to get ugly… Obama’s Lawyer To Supreme Court: Religious Institutions May Lose Their Tax-Exempt Status If They Don’t Back Gay Marriage…"}]
