[{"comment_id":"1776830319009844","commenter_b":"Maybe Cat is looking for a sanctuary city for cheap labor .","commenter_a":"Thanks","post_message":"Hardworking men and women from Peoria have always taken great pride in knowing their community has been home to Caterpillar, and there’s no denying this news is a real blow. Two years ago, I joined with officials from across our region as Caterpillar announced its intention to expand its footprint and keep its headquarters in Peoria – so this news comes as a shock. Our local economy is tied to the success of Caterpillar. My hope is that Caterpillar will keep the promise it made today for Peoria to remain its largest manufacturing site. I stand with all Peorians in expressing my deep disappointment with this decision."},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"},{"comment_id":"10153738613786955","commenter_b":"And black people wonder why white people view them the way they do. When you act like a classless piece of crap, we are going to view you as a classless piece of crap. And this woman is a classless piece of crap","commenter_a":"Should have dragged this Nappy-headed skank out by her hair & shown her the gutter where she belongs......Good luck in Prison Ho'","post_message":"WHAT HAPPENED TO MANNERS IN THIS COUNTRY?"},{"comment_id":"10154177327588984","commenter_b":"Don't want her anywhere near the White House.","commenter_a":"Lies more lies everytime she opens her corrupted mouth","post_message":"Hillary's campaign is once again doing damage control...  Is Hillary Clinton one of the last people you'd want to become president?"},{"comment_id":"979292718775058","commenter_b":"Y hell yeah. I know is I do stupid stuff I would be locked up. She should be treated the same. That don't mess with her because she has money. The poor folks pay the price. The rich walk around like that are untouchable. It bs.","commenter_a":"False!","post_message":"BREAKING: FBI Finally Makes Move To Arrest Hillary Clinton…   Her time is coming to end. Say goodbye.  Would you be happy if Hillary was arrested?"},{"comment_id":"908007962567959","commenter_b":"Look at that nasty excuse of a woman.","commenter_a":"That family is severely screwed up. Corrupt financially, politically, and morally! Any wonder why this society is so bad? No. Just pathetic. And they smile in the face of this country with absolutely zero remorse or accountability.","post_message":"GROSS!"},{"comment_id":"10153649045287994","commenter_b":"People are so dumb... That's all...","commenter_a":"Is a phone really worth your life","post_message":"A man was killed at Cedar Point when he entered a restricted area to look for his cell phone."}]
