[{"comment_id":"10154444576164586","commenter_b":"I would still eat the ishhhh out of that piggy","commenter_a":"What do they expect it's part of an animal! Keep showing these disturbing photos until it makes a real difference","post_message":"This is so gross, it's no wonder so many bacon-lovers are vowing to ditch it."},{"comment_id":"10156572511460725","commenter_b":"You just hit a grand slam Ron! Trump 2017-2025","commenter_a":"Donald Trump - Think about it... will they stop him, Democrats and Republicans alike? This affects all Americans who get the short end of the stick Democrats and Republicans and Independents. Interesting take on Donald Trump Former U. S. Secretary of Education , William J. Bennett's frankly candid and shocking observations of Donald Trump's impact on the behavior of the entrenched Washington D. C. bureaucrats in both parties -- and the risk The Donald faces in so doing. William J. Bennett, Host of Bill Bennett's Morning in America Show, is one of America 's most important, influential, and respected voices on cultural, political, and education issues. He has one of the strongest Christian world views of any writer in modern times. What I See Happening In a Trump Presidency By Bill Bennett They will kill him before they let him be president. It could be a Republican or a Democrat ...","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"10157615901290389","commenter_b":"What about the arrests of all those that beat up and tried to burn people alive?????","commenter_a":"The reporters should have asked the protesters if they had a job etc.........","post_message":"Breaking News: A suspect has been arrested in the shooting death of a protester during rioting Wednesday, Charlotte's police chief says."},{"comment_id":"10155035206479369","commenter_b":"Build that wall!!!","commenter_a":"BUILD THE WALL","post_message":"Immigration fees are being hiked for the first time in six years."},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."},{"comment_id":"10153404466085950","commenter_b":"Go Trump!!! Scared?? Everyone's voting for him!!!! I'm scared of Hillary lying Clinton!!!! Speak for yourself sweetheart","commenter_a":"I'm hoping that if he's the Republican candidate, people will be scared to vote Republican and will therefore vote Democrat.","post_message":"BREAKING: Donald J. Trump will win the South Carolina Republican primary, CBS News projects @webpagelink"},{"comment_id":"10155249184754218","commenter_b":"How do we know, @username? Watching the hearings and seeing her incapable of answering questions. We know by looking at her past experience and seeing it limited to special interest. She has almost no relevant experience. Cabinet members are to be experts in their field, not solely a wealthy donor to republicans. This is not a try out situation. There is not a revote. Your assessment of Trump's hiring practices ignore what we've seen even during his campaign. He had to find new campaign managers three times.","commenter_a":"Who in his right mind would approve of her, doesn't matter if you come from the left or right, everyone can see she is unfit for the job","post_message":"Senators are expected to vote Tuesday on the nomination of Betsy DeVos for education secretary. She is expected to be confirmed, with Vice President Mike Pence casting a tie-breaking vote. Do you support or oppose her nomination? >> @webpagelink"}]
