[{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"392258217629139","commenter_b":"Does that mean old fat women can go to a strip club and ask for a job when there is an opening and sue if they are turned down?...","commenter_a":"No it's not \"fair\"...she should conform like the rest of us. What the heck is she doing in the \"fashion world\" in the first place? There is absolutely no fashion in wearing a hijab. NONE.","post_message":"Is it fair that this Muslim girl sues for not being able to wear her headscarf when it goes against company's policy???"},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."},{"comment_id":"10153630601128433","commenter_b":"America the beautiful, oh how I miss her. Being offended is the new status symbol.","commenter_a":"Of the 13 attacks, how many went unanswered? How many were abandoned during the attack by their own chain of command? How many had their back up team be ordered to stand down? How many were blamed on a YouTube video?","post_message":"As Hillary Clinton testifies at a House hearing on Benghazi, a lot of you are digging back in our archives to look at a fact-check about past attacks on U.S. diplomatic personnel overseas. @webpagelink"},{"comment_id":"10155187473209614","commenter_b":"Your armpit makes me gag hahahhaha","commenter_a":"let them do their job.... and yes if you are on list ...GOOD BYE !!!!!!!!!! SUPPORT ICE FOR THE MAKING AMERICA GREAT AGAIN...","post_message":"Los Angeles' top elected officials cosigned a letter  urge in the strongest possible terms that ICE immediately cease this practice in our city.  Since the late 1970s, L.A. police have worked to build trust within the city large immigrant community so those in the country illegally can report crimes and offer information to police without fear of deportation."},{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""}]
