[{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"818351058200569","commenter_b":"If he is here illegally, he should return home and come back through the front door!","commenter_a":" quality I would most like to magnify in human race is empathy. It brings us together in a peaceful, loving state, A very wise and educated man say it.","post_message":"New Latthivongskorn was brought to the United States from Thailand when he was 9 years old. New grew up in San Francisco, California, became an excellent student, and dreamed of becoming a doctor. A month after New graduated from Cal-Berkeley with honors, a 3.7 grade point average, and a major in Molecular and Cellular Biology, President Obama established the DACA program. DACA has allowed New to begin medical school and pursue his dream of becoming a doctor. New and other Dreamers like him have so much to contribute to our country. But if the Republicans have their way, New will be deported back to Thailand. Let’s remind them that #DACAworks."},{"comment_id":"693891444077370","commenter_b":"a lib angry bitch...","commenter_a":"First of all, she's just an angry bitch....second of all: who?","post_message":"Who does THIS Remind you of...."},{"comment_id":"908896759158872","commenter_b":"Us is what I recorded","commenter_a":"@username let's go to Vegas and stop off here!","post_message":"It one of the strangest motels you will ever visit  the Clown Motel, next to a grave yard in Tonopah, Nevada.  And if you don like clowns, or are afraid of ghosts, you may want to stop somewhere else.  Story: @webpagelink"},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"}]
