[{"comment_id":"10154766410094714","commenter_b":"Let us wave a wand and turn you into a woman...then comment about this. Have a nice day!","commenter_a":"Wow! All of a sudden women in distress coming forward. I wonder how many more will jump on the dollar filled band wagon? Doesn't this look a little suspicious? Clinton filling their pockets!","post_message":"The Donald J. Trump campaign is planning to fight fire with fire: “We’re bringing out tactical nukes now, with thermo nukes later.” @webpagelink"},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"10153210557951336","commenter_b":"She said she \"did not want him to be a Freddy Gray\" meaning dead. And no Sharon P ... If people would stop voting for fools like the ones running our congress 80% of our countries problems would be gone... maybe more..","commenter_a":"What she did was what she needed to do at that moment in time. She is a real Mother..who loves her son and wants him to grow up to be a MAN!","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"551602895008576","commenter_b":"Every time he speaks I vomit in my mouth","commenter_a":"Obama said on Nation wide TV that the Syrians are like people who came over on the Mayflower. Oh really. We know how he came over. On an elephant from Kenya. Too bad today isn't his last day.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"},{"comment_id":"10157319779090093","commenter_b":"That's because she likes women better!","commenter_a":"Loving wife, he'd boink anyone in a skirt except Hillary!!!","post_message":"\"The biggest problem is that the more he talked the weirder it was that he didn address the elephant(s) in the room.\""}]
