[{"comment_id":"628929223957206","commenter_b":"By Bitch.","commenter_a":"And don't forget to take Rosie, Whoopi, Kanye and the rest of the we're-leaving-if-Trump-wins morons with you! Good riddance to all!","post_message":"Miley Cyrus packing her bags and taking off after trying to take on Donald Trump. Say goodbye! Good riddance. Can we get 30,000 'LIKES' to have Miley leave the country?"},{"comment_id":"10153664753098797","commenter_b":"Happy Birthday Glenn :)","commenter_a":"Happy birthday","post_message":"HEARTBREAKING AND HEARTWARMING: When Glenn turned 6, his mom threw him a big party. She invited 16 kids - but not one of them showed up.   Glenn was crushed. So his mom went on Facebook to vent. What happened next is absolutely incredible. See here - and wish Glenn a happy birthday in the comments section below:"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to \"prop up\" immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"10153957571836336","commenter_b":"yep video that thieving skank so the whole world and any future possible employers can see that she is a totally untrustworthy pos","commenter_a":"hope she goes to prison!","post_message":"\"We got you on camera yesterday at Ralph's for $200, so just know that the cops are coming up here,\" Juana Martinez told the 19-year-old worker."},{"comment_id":"1786899774881601","commenter_b":"All you liberal women should really read this. You don't know who Hillary is. @webpagelink","commenter_a":"Don't continue to fall into Hillary's trap; she's laughing and the Press loves it....forget the Bimbo beauty queen of years past; we have urgent needs in this country that must be addressed and fixed, not to mention Christians being slaughtered by ISIS.","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"}]
