[{"comment_id":"10154632790424705","commenter_b":"Isabel Galindo","commenter_a":"@username xx","post_message":"Flawless."},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"1052919424727810","commenter_b":"@username go ride your train off a cliff ya Californicator!","commenter_a":"I think we should ban people who wear socks with sandals next! They look even dumber than people using selfie sticks!","post_message":"Planning on going to the Evergreen State Fair in Monroe this year? Well keep your selfie sticks at home."},{"comment_id":"10154237264628908","commenter_b":"Safe from all the predators but not from mosquitos.","commenter_a":"I like the idea of being up off the ground. I wonder if you could feel the bear or tigers fur under your back? The option of over the water is very appealing when it comes to lions, tigers, and bears oh my! Army Ant territory too. I think I would feel safer over a calm river, not up too high, but out of reach of most animals, than on the bank. Also, I imagine up in the air, not as much heat is extracted from your body as when you are on the ground.","post_message":"These tents suspend from trees! Get the experience of a hammock and a tent all in one. Thanks Tentsile!"},{"comment_id":"10154976296372789","commenter_b":"@username Wanting President Trump to fail is wicked. I don't ascribe to that just as I did not ascribe to it when the right vowed to block the former president and cause him to fail. But seeking truth and speaking truth to power is not wicked","commenter_a":"The left will fail. Wickedness will not prevail.","post_message":"'What I don't like about what is going on now, is there is an absolutely frenzied and concerted attempt to delegitimize, sabotage and destroy the Trump presidency before it even started.\"  Piers Morgan believes that the mainstream media is fueling \"hysterical\" attacks on President Donald J. Trump, and it's fundamentally \"un-American.\" What do you think? @webpagelink"},{"comment_id":"10152888529356051","commenter_b":"Well that's where becoming a mature adult comes into play. He's had three children with more than one woman not married to any of them not stable himself there for you get what you get. Young people and old people to please stop having babies you didn't plan for it. You didn't save for. And you can't afford. Whether or not the mother works as a relevant because at this point she didn't get herself pregnant and cant. Guys wrap it up put on a raincoat run the rubber road or better yet stop treating sex as an entertainment videos. Stop having sex with all these women and not looking at the big picture tell you don't drive your car without a spare so don't live your life that way be prepared","commenter_a":"my son is a father of 3 girls, he pays so much child support that he cant afford to live himself, by the time he gets paid and all the child support comes out he has any where from 20 to 30 dollars to get in through the week..He cant afford to by food, just barley has the money for gas to get back and forth to work with, while in the mean time, the mothers get $500.00 a month in food stamps, don't have to work, They live off of his money, he cant get food stamps because he makes too much..well if they seen his check after everything comes out, then they would see what he is going trough. The laws needs to change..make these mothers get out and work.Cut out the food stamps because the mothers are selling them just for the money..","post_message":"This man has gone without food for days because of all the child support he owes. There’s one big problem with this."},{"comment_id":"1115675945183452","commenter_b":"Your the one that is shaming Donald @username, you have found him guilty in public opinion.","commenter_a":"I don't believe her! She said it went on for 15mims, could have done something to stop it in that amount of time, and in a plane at that.","post_message":"Jessica Leeds said Donald J. Trump kissed her \"wherever he could find a landing spot\"  @webpagelink"}]
