[{"comment_id":"1189361681104302","commenter_b":"@username--you are right, she is a troll","commenter_a":"actually he voted for Ovomit","post_message":"These are the dangerous consequences of Donald Trump's hate speech."},{"comment_id":"10155994717525615","commenter_b":"Well, we now know which four are the cream of the crap.","commenter_a":"What does that say about the four that signed?","post_message":"NOM could only get four out of 17 candidates to sign? What does that say about their influence?"},{"comment_id":"10153717162272708","commenter_b":"No we don't have to solve the worlds problems with money we do not have. If you were a refugee from America, which countries would take you in and give you benefits FOR LIFE? Which countries would require nothing of you as a citizen of their country once they took you in??? Those refugees get better benefits than anyone who is from here would ever get......why? Because their government could care less about them so we have to save everyone from everywhere......just because. Just because they won't care about their own people.....just because we have endless tax dollars to support them all. Nope.","commenter_a":"Saying we can't take refugees is saying you don't have compassion, as humans we have to find away","post_message":"We won’t be able to take more refugees. It’s not that we aren’t compassionate. But we can’t. There’s no way to background check them. SIGN IF YOU AGREE!"},{"comment_id":"10153100496946051","commenter_b":"i hope the fry his fat white ass","commenter_a":"He deserves life. He has destroyed that child's .Sending prayers for that little Man","post_message":"An 8-year-old boy was playing outside his apartment complex when this man showed up and shot him in the face. Decide for yourselves if the man's punishment was severe enough."},{"comment_id":"10156788493850389","commenter_b":"My family and friends in Utah are behind Trump!","commenter_a":"Please Utah vote Trump!! He cares about We the People.","post_message":""},{"comment_id":"1321278027895520","commenter_b":"@username The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service","commenter_a":"The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service ?","post_message":"Thank you for the great feedback on my Immigration Speech last night in Phoenix, Arizona. I am grateful for everyones support. I want to thank the ANGEL MOMS - who I met last year when I began campaigning. I am truly humbled by their courage and bravery - they are truly INSPIRATIONAL to me. I love the United States of America - and it has been so good to me. I want to MAKE AMERICA SAFE AND GREAT AGAIN - with you, the American people. -DJT"},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying \"the American people deserve to get the full and complete facts immediately.\" Agree or disagree?"}]
