[{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning!  Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"533434026816552","commenter_b":"is that how YOU got in?? god dam roach.....","commenter_a":"Displaced... Bullshit . they are like Roach's spreading themselves out to bring their evil to more places","post_message":"\"Never has there been a greater need for tolerance, compassion and solidarity with people who have lost everything.\""},{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"699615530187912","commenter_b":"Its you Liberal Pukes who need safe spaces ! Too bad there are no safe spaces in NJ !","commenter_a":"Newt Gingrich says anyone who believes in Sharia Law should be deported. Hey Newt - I believe in Sharia law! 100%! Muh muh muh muh......MY SHARIA! Now - come try and deport me!","post_message":"\"I'm through trying to understand the sick ideology of Islamism. Instead of trying to understand it, we ought to just try to kill it.\" – Sheriff David Clarke @webpagelink"},{"comment_id":"10153754963576636","commenter_b":"oh god im sick of seeing this the vote has been and gone in favour of leave just bloody get over it ,and out of the 2 mil that have signed how many are actually british,didn't know this was a world wide petition","commenter_a":"Keep politics out of music.","post_message":"The petition is unprecedentedly popular"}]
