[{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"},{"comment_id":"1576560615982395","commenter_b":"Bitch needs to go away!","commenter_a":"The woman has been going way too much. She needs to rest. It's not exactly uncommon to get pneumonia when your constantly traveling doing events, and meeting with people on very little sleep.","post_message":"Democratic candidate abruptly left New York's 9/11 ceremony Sunday, raising questions about her health and campaign transparency."},{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."},{"comment_id":"10153197262606336","commenter_b":"Only GOD, could to do it.!! IN GOD, WE FROM MORE CHAMPION: GOD BLESS YOU Beautiful Family. THE MIRACLE EXISTING, IF YOU BELIVE.!!","commenter_a":"Rest in peace little Angel 👼🏼","post_message":"\"He is now cancer free and running and playing and laughing with God and all of the other precious children,\" a post on \"Danny's Warriors” Facebook page read."},{"comment_id":"1000336466699775","commenter_b":"Bitch Stfu quit preaching","commenter_a":"Kanye was her man at one point. I'm sure y'all have done stuff to please your significant other while in a relationship. GTFOH. Y'all clowning Amber for pleasing her man at the time?? Really???","post_message":"#ShotsFired Amber Rose Just Fired Back At Kanye West!"},{"comment_id":"10153509000593984","commenter_b":"She doesn't deserve that child!","commenter_a":"is she in jail now?","post_message":"You'll be blown away by these shocking images... I can't believe a mother would share these, or even do this to begin with...  Do you think she should be punished for this?"},{"comment_id":"259111647859034","commenter_b":"Yes $85 million!!! They're saying that he abused he used to go to the most expensive hotels, restaurants, and buy so much expensive stuff since tax payers are the ones that were paying !!! A lot of luxury vacations for Mr. Obama !! And before leaving the office he send $221 million to the Palestinians !!!! I wonder since when he was sendings them money. that's why noooo I don't miss Obama ! I don't agree on some stuff Trump is doing but I hope he can makes this country great cause Obama did a lot of F***** up stuff to this country and I guess that's what people want a president that lies to us and do stuff that we don't know !!!","commenter_a":"What? A weekend at his own property? The nerve! He should be on a beach in Hawaii, sucking up the taxpayer's money! The utter gaul of this man!!!","post_message":"LIVE NOW: Trump arrives in Florida on Air Force One."}]
