[{"comment_id":"10154666787286756","commenter_b":"But it's entirely not up to me how Islamic women choose to dress.","commenter_a":"It's crazy to me that the same people who are so feminist and or very liberal seem to not care at all about how Islam treats women. This is a great example of how they are extreme...even at the beach they have to be mostly covered.","post_message":"The Cannes mayor calls the burkini \"the symbol of Islamist extremism.\""},{"comment_id":"571042013020392","commenter_b":"If this is true, why doesn't every woman in America have problems????","commenter_a":"let them out . turn the puppys loose","post_message":"Every woman needs to read this!"},{"comment_id":"848560338575181","commenter_b":"BUILD THE WALL","commenter_a":"and this comes as a shock to no one.......ban them.","post_message":"Reports say #ISIS now has a passport machine to have its believers infiltrate our country. I told you so! We need to protect our homeland - and make it safe for all citizens. We need leadership! #Trump2016"},{"comment_id":"1016134698454262","commenter_b":"She'll just speak to someone else. Challenge her!","commenter_a":"I hate Hopkins as much or more than they do. But this behaviour is just babyish. If you want to defeat her, debate her with facts and the moral superiority of your argument. This is just forfeiting the chair to a racist moron.","post_message":"Brunel students just gave us all a masterclass in how to deal with Hopkins"},{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"},{"comment_id":"10153188400962894","commenter_b":"@username pediatricians have long ago said this is unsafe for children. Their immune systems cannot fight off adult germs. I am sure you want to keep your niece safe, right?","commenter_a":"North West is really cute. Kim should probably stopped letting Khloe kiss her baby in the mouth tho","post_message":"Kim Kardashian Shares Adorable New Photo Of North West With Her Curly Hair"},{"comment_id":"10154700832214369","commenter_b":"Stfu crackers","commenter_a":"Time to play the National Anthem.... they will all take a knee then they can swoop in for a mass arrest.","post_message":"Violent protesters rampaged through Charlotte as anger continued to build over the deadly police shooting of Keith Lamont Scott"}]
