[{"comment_id":"10155008881554411","commenter_b":"Zeyad Hopkins : @webpagelink","commenter_a":"She didn't spark anger, in fact Saudis didn't care. But @username has a case against Saudi and the USA, and yes I don't like Saudi but let's not start spreading bullshit and hate","post_message":"Just days after Merkel said burka should be banned in her own country."},{"comment_id":"783181045136903","commenter_b":"Because jerusalem is Israel. This fact will not change no matter what this president says.","commenter_a":"Why we should consult Israel? What you guys think you are? How many Palestinians have been killed in the holly land since creation of Israel? You got a country out of nothing and there is nobody who could satisfy you people.","post_message":"In new book, former ambassador and now Knesset legislator describes his impressions from when he was Israel's envoy in Washington between 2009-2013."},{"comment_id":"1306577949392367","commenter_b":"Rapidly arriving at the point where I can't bear to read or watch anything this Neanderthal does. In my opinion, he is a racist, terrorist supporting radical Islamist bent on bringing about America's downfall.......on the orders of his puppetmaster, George Soros.]","commenter_a":"Obama helps promote fake news, since it serves his purpose.","post_message":"\"obsessed”"},{"comment_id":"1721863561367662","commenter_b":"Hopefully to die of a stroke while receiving anal from pence, while he dies of a heart attack from actually getting his tiny penis erect.","commenter_a":"Lol... Wow at all the hate. Smh... Do you all think that the Muslims that come over here are going to accept your Christianity.... Lol.... Maybe some researching on how they are behaving in other Country's with the mix of the two is in order. But you all continue with your hate and see where that takes you.","post_message":"Reminder: If Trump attempts to discriminate against Muslims, we will sue."},{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"10153440852086051","commenter_b":"@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."}]
