[{"comment_id":"10153815226441636","commenter_b":"@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"1052877944789070","commenter_b":"Hillary Clinton is more smarter and experienced lady rather than her opponents, she worked in government on different positions as well as in different conditions. As soon as she become President, she will require very short time to implement her plans. #Germany has Lady Chancellor, #UK has Lady PM, now it's time for #US to have Lady President. I am not against Donald Trump and also agree with his views regarding migrated people's who cause Terror activities, Hillary too must think on this issue. No one can't risk it's own people's life for other nations innocent people. In Europe, France and Germany already paying for it...","commenter_a":"Yes!!! And then you can try to explain to your child why the first \"Woman President\" is being investigated for her actions. Then you get to try to explain impeachment. And then how to dig out of the hole of \"Well I guess girls can't do the job.\" Little kids don't get politics. That is the job for adults. And if you as an adult vote for a woman who lies, cheats, and puts her privacy above the security of the nation, then you get to pay for it down the road. But you have a choice vote Jill Stein. 2016.","post_message":"\"Mommy, how come they're all boys?\""},{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"10153635830302061","commenter_b":"@username Wow.....you are a wicked mean nasty woman!!!","commenter_a":"It was a great dance to encompass her whole journey on the show, but in no way does it compare to Nyle's or Paige's.","post_message":"WATCH: Ginger Zee & Valentin Chmerkovskiy's take the dance floor by storm in last night's Contemporary Dance to a cover of Coldplay's \"Adventure of a Lifetime.\" Dancing with the Stars Season Finale continues TONIGHT!"},{"comment_id":"399694993488875","commenter_b":"You dumb fuck the president has nothing to do with gas prices.","commenter_a":"Ain't nobody complaining bout them gas prices though","post_message":"Ironically, Manning was imprisoned and nominated for the same act."},{"comment_id":"10154146066447623","commenter_b":"@username Im against this executive order because it wasnt thought out very well at all and is just a blanket order to block everyone that is a citizen of certain countries from getting into America, even if theyve been here for years and just happen to be out of the US at the time. Im all for protection, but Trump's actions are based on nothing but his ignorance and fear. That is no way to live and that is no way to run a country.","commenter_a":"If DHS doesn't support this, isn't that a sign that maybe it's not the right thing to be doing? I'm pretty sure they're not a liberal organization, so this isn't a partisan issue. If you're scared of terrorists, I get that. But wouldn't it be better to open your mind a little and try to understand why so many people are against this?","post_message":"The Department of Homeland Security said Saturday it has suspended all actions to implement President Donald Trump’s immigration order."}]
