[{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"10153666093873132","commenter_b":"Please!!!! She is a rapist!","commenter_a":"Nik Gudel","post_message":"Altice's lawyer described her as a woman who was trapped in a bad marriage, saying she is \"troubled\" and \"has problems with viewing her own worth.\""},{"comment_id":"10155518343016729","commenter_b":"This is a repost .....As For Barack Obama, We watched him sit for 20 years in a Church whose preacher condemned America . We watched him travel the globe apologizing for America's greatness .We watched him allow guns to be shipped to Mexican criminals so they could later turn up at crime scenes to mislead American opinion. We watched him use the IRS to punish those with opposing views . We watched him shrink America's military defences ,We watched mistreatment of our veterans , We watched the Ambassador and his protectors be left to die and be covered up by a lie , We watched our nation debt be doubled , We watched the nation's food stamps recipients climb to 25% , We watched a health care system nearly implode to promote some utopian fairy tale. We watched our police be disrespected , race relations fall to an all time ...","commenter_a":"Facebook is so liberally biased. Had this been a post by a Conservative toward Clinton or Obama supporters, the account would have been terminated. Also the person would have been fired from their position immediately. So the school not yet terminating him is garbage.","post_message":"Despicable!"},{"comment_id":"10153128957476523","commenter_b":"And yet you probably voted for a whore for governor.","commenter_a":"You know what prevents STDs? Not being a whore.","post_message":"Health officials in Racine pass out free condoms to reduce STDs, but not everyone’s happy. FOX6's A.J. Bayatpour has the story:"},{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat?   Hillary: Sure! 👻"}]
