[{"comment_id":"465593756969394","commenter_b":"I agree with you Hector. The point Mrs. Trump is making is that these spoiled American young adults have ZERO idea of what hard work is. They want to live the life they see on TV but don't understand that you need to work for it, hard. The jobs that these spoiled kids don't want will get filled by immigrants.","commenter_a":"It's easy to get angry about that statement. Seems inflammatory and unreasonable right? But consider this.....we have a generation of dummies who are demanding $15 an hour to flip burgers, wash cars, and other mindless entry level jobs. When these boneheads get what they ask for, and are replaced by technology, what's left? The mopping and sweeping jobs. They already think they're too good for those jobs now, so who do you think takes the jobs? The immigrants. Put the PC sensitivity away and face facts. The spoiled, entitled, millennial cry babies created this. Let them wallow in it. @username Robby Gould","post_message":"Donald J. Trump's ex-wife spoke out in support of the GOP candidate and the need for legal immigrants."},{"comment_id":"10152738126476051","commenter_b":"What a dumb woman","commenter_a":"Just give her the money and don't accept any more invitations from her, damn !!!","post_message":"The woman who invoiced a 5-year-old for missing her child’s birthday party has a message for all the haters."},{"comment_id":"10153916920276350","commenter_b":"The dumb lady who filed said her lips started drying after putting it on...so she put more on. Idiot.","commenter_a":"I used this, got a rash and it dried my lips out so bad that they cracked and bled. I had to get medication to heal my lips, but I STOPPED USING IT!!!!!! It's not rocket science. If it hurts you or doesn't work, don't use it. I wouldn't sue over it even though it was nasty looking and hurt like no other.","post_message":"Have you had any skin issues using eos lip balm?"},{"comment_id":"1096005223798926","commenter_b":"Here we go with the wall...","commenter_a":"Trump would have never left that Marine in Mexico like Obama did...","post_message":"Donald J. Trump and Mexican President Enrique Peña Nieto give statements after meeting in Mexico City."},{"comment_id":"10155230776483690","commenter_b":"Hahaha we cn kill u indian pigs","commenter_a":"They can kill only innocents, not terrorists. Pigs.","post_message":"In less than 24 hours after Pakistan's deadliest attack in more than two years, the army kills more than 100 \"terrorists\"."},{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."},{"comment_id":"10156025741310354","commenter_b":"Go educate yourself, ALEX! The Constitution does not need revision to deny citizenship to illegal aliens, or their children. It is left vague in our founding document and is clarified by statute. The 14th Amendment defines citizenship this way: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" But even this does not get specific enough. As usual, the Constitution provides the framework for the law, but it is the law that fills in the gaps. The Constitution authorizes the Congress to do create clarifying legislation in Section 5 of the 14th Amendment; the Constitution, in Article 1, Section 8, Clause 4, also allows the Congress to create law regarding naturalization, which includes citizenship. Currently, Title 8 of the U.S. Code fills in the gaps left by the Constitution. Section 1401 ...","commenter_a":"In my opinion all the RINOs currently in office as well as the few Republicans who haven't yet achieved RINO are crapping their pants because Trump is saying what the public is thinking. Plus, Trump could give a rat's ass about what the Democrat media formerly known as the \"mainstream media\" says about him.","post_message":"Top Republican Strategist Promises a 'Cleansing' of Donald Trump Voters from the GOP!"}]
