[{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."},{"comment_id":"1010697719021125","commenter_b":"It must be true, it's on Facebook, Melanie. Facebook!","commenter_a":"Chris this was an op ed piece in a psych journal and not scientifically tested - don't tell me not to hug my dogs!😉","post_message":"Noooooo"},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant \"lock her up\" as Governor Chris Christie says \"I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.\" More: @webpagelink"},{"comment_id":"10154141723616509","commenter_b":"Just name a hotter chick","commenter_a":"Y'all tripping like Beyonce doesn't exist or something. Emilia is fine but sexiest woman alive?","post_message":"Who would you have picked? The Game of Thrones actress has been named  Esquire's \"Sexiest Woman Alive.\" @webpagelink"},{"comment_id":"1072164979509916","commenter_b":"If sash doesn't get picked","commenter_a":"I'm so done ffs @username","post_message":"The Bachelorette Australia favourite and Sam just happen to holiday in the same place at the same time   (via Daily Mail Australia)"},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."}]
