[{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"10152824862457212","commenter_b":"Yes of course. The middle aged woman who comes from a upper middle class family. Is going to tell people how to make it. Please go on.....................","commenter_a":"Cue the Conservatives of this state to tell how they worked so hard for their money, and it is everyone elses fault the don't have the means they do. In 1...2...3...","post_message":"Seeking to assess if the Horatio Alger, \"rags to riches\" narrative...remains viable, researchers measured the odds of a child born to parents in the bottom 20% of income earners reaching the top 20%. They then contrasted the chances of climbing the ladder in the U.S. to that in other developed countries. #News9 #CBSNews"},{"comment_id":"677232809133964","commenter_b":"The scumbag needs to be fired .... then she needs to be stripped of her teaching certification!!","commenter_a":"Fire her.","post_message":"This teacher threatened her student if they didn't submit to her beliefs.  She has absolutely no right to try and dictate what her students believe.  Do you think this teacher should be fired immediately?"},{"comment_id":"1406366476070873","commenter_b":"not a terrorist...a beautiful goddess.","commenter_a":"Isis Murda Spence :)","post_message":"\"Love your name. Cherish your name.\" Words of wisdom from a girl named Isis to others who share her moniker."},{"comment_id":"10153683265791336","commenter_b":"Most illegals do not get food stamps or welfare. Tons of Republicans ARE on welfare.","commenter_a":"That's great all the illegals like to hit Trump..they have money for parties and pinatas thanks to welfare Checks and food stamps! If I was living off the government tit I would hate him too..but I don't and I want my country strong again so I like Donald Trump. Trump 2016","post_message":"“We sell out pretty fast.” - Guadalupe Mendez, salesperson   (CC: Donald J. Trump)"},{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."}]
