[{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"\"We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.\" —Vice President Biden  Watch the weekly address: @webpagelink"},{"comment_id":"1626892184281597","commenter_b":"@username I didn't know whiney little bitches played hockey...","commenter_a":"The whole irony in this, is that Trump knew he was never going to be able to get Mexico to pay for the walll...and now im just waiting for some trump supporter to justify this and or blame Obama.....","post_message":""},{"comment_id":"10153630257512235","commenter_b":"She's a dumb bitch.","commenter_a":"Aaaaaaaaaaaaaaaaaaaand let the Martyring begin! Yea totally did not see that one coming..nope, wow I am so surprised! *rolls eyes*","post_message":"Oh, c'mon ..."},{"comment_id":"10154738132201037","commenter_b":"everything she does is fake.","commenter_a":"Sounds fake to me. She'll have to sue me to I guess.","post_message":"The suit alleges Kim Kardashian West was victimized a second time when the website reported that she faked the robbery and lied about the assault."},{"comment_id":"10153185628051615","commenter_b":"Dude we should just start bombing them f*** that worry about the details later","commenter_a":"Come on. Can we stop leaving out important facts like that the passport was likely planted AND fake? World and even French news is properly reporting that. @webpagelink","post_message":"LATEST: A French official says the suspected mastermind of the Paris attacks was also linked to thwarted train and church attacks. Channel 11 Morning News will have updates all morning long."},{"comment_id":"10153180740642894","commenter_b":"GTFOH. what she suppose to tell the Man not to come around cuz of the media. She ain't playing house she wit a man that has morals and wants to marry her.","commenter_a":"He telling truth i don't know why have something negative to say in all ciara interview she like drama and she was put her son in the middle that's crazy😬😬😬","post_message":"Future Covers ‘XXL’, Says Ciara Tried to Overshadow the Success of His ‘DS2’ Album [Photo]"},{"comment_id":"10158490372020354","commenter_b":"Hope they make an example out of her","commenter_a":"Jail her.","post_message":"My, my, my..."}]
