[{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"},{"comment_id":"10153263722107411","commenter_b":"Hold my dick!!","commenter_a":"Yea , meanwhile the murder capital award goes tooo","post_message":"THIS JUST IN: Mayor Rahm Emanuel is expected to introduce an ordinance that will raise the minimum age to purchase tobacco products from 18 to 21."},{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"10153906190670667","commenter_b":"Neither Chelsea, Hillary, or Bill receive a salary from the Clinton Foundation.","commenter_a":"Clinton Charitable work done in house? Don't you mean Charitible to the Clintons, with Chelsea receiving hundreds of thousands of $$ as an administrator? Gee Ya got me there Sparky!","post_message":"Mike Pence claimed that “less than 10 cents on the dollar in the Clinton Foundation has gone to charitable organizations.” That’s misleading. @webpagelink"},{"comment_id":"10154568274058690","commenter_b":"@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."}]
