[{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year?   Watch live: @webpagelink"},{"comment_id":"10153598670708822","commenter_b":"Woman driving a junk Kia SUV","commenter_a":"Awesome driving right there!","post_message":"It was a shocking sight… and some tense moments for people inside the Greenfield Giant Eagle.  An out-of-control SUV ended up on the building’s roof this afternoon, leading to evacuations over gas leak concerns: cbsloc.al/1RQuE9o"},{"comment_id":"1714085968841110","commenter_b":"WTF WORLD U LIVIN IN THEN MOTHA FUCKA GTFOH","commenter_a":"He need to take him and his gang go play I'm traffic","post_message":""},{"comment_id":"612744012249511","commenter_b":"Absolutely! Prison is where she belongs for many reasons.","commenter_a":"And she should go to the one named after her husband and put in solitary confinement so we never have to hear from this troll again","post_message":"A judge just presented new evidence that could put Hillary away for good.  Finally. Put her in jail already.  Do you agree Hillary belongs in prison?"},{"comment_id":"1719361974988639","commenter_b":"Fucking vegans","commenter_a":"Bit dramatic? Eggs are extremely good for you, provide income for a lot of people, and battery farming is on the decline","post_message":"We're just going to leave this here."},{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."}]
