[{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"1012758612153724","commenter_b":"Well, now that she will be sitting at the grown-ups table, we will notice just exactly how much food she gets all over her face.","commenter_a":"I think DT,were say that she was ugly!!!","post_message":"Carly Fiorina will finally get her chance in prime-time."},{"comment_id":"1342320752468340","commenter_b":"Happy to see a change in the Mayor's house! See ya!","commenter_a":"if first lady gets this, what can common man expect,...","post_message":"The mayor said she was merely expressing happiness for \"change in the White House.\""},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"},{"comment_id":"10153324707666336","commenter_b":"Hillary 2016! Go USA!","commenter_a":"Welp, if rand does not win the nomination I'll be voting libertarian. Good luck","post_message":"Breaking News: A bill that would allow key government surveillance programs to resume for now – after they were temporarily suspended Sunday – has cleared another hurdle in the Senate and is headed to the president's desk. @webpagelink"}]
