[{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: \"If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.\""},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"1314229205273274","commenter_b":"Stupid, greedy women who don't respect themselves LOVE Trump. I mean, look at his wife.","commenter_a":"So they're trying to use looks to get people to vote for a man who half his party do not even like.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."},{"comment_id":"10153086168389411","commenter_b":"that is why she is the ex","commenter_a":"Hell hath no fury like a woman scorned.","post_message":""},{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."}]
