[{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 \"I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.\" Pence VP Debate 10/04/16 \"That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"},{"comment_id":"533721010147110","commenter_b":"Or maybe we should learn from history instead of repeating the same mistakes over and over. Illegal immigration didn't work out too great for the Native Americans. Has illegal immigration worked out for any culture? We all have a set of keys for our lives, hence I believe we all can agree on a measure of security. I say who comes into my home, you say who is allowed into your home. We can decide on who we let into our community. I wholeheartedly welcome people wishing to be an American. I am against the culture of Islamization and separatists who don't value American principles or agree with our civil rights. There are many different developmental frameworks: Republics, Monarchy, Communism, Islam, etc. Islam is an entire framework of religion, social, economic, legal, political, and military standards which is completely incompatible with American laws, Bill of Rights, and the principles I ...","commenter_a":"I believe this is a good moment to revisit Donald J. Trump policy on going after the families of known terrorists. Seddique Mateen supported the Taliban. His son Omar Mateen should have been deported already. Trump Fan Network get the word out. Donald J. Trump will institute policies to prevent these tragedies. Furthermore, the laws designed to go on the offensive for this threat should be a mix of \"aiding and abetting felons\" with counter-terrorism.","post_message":"The FBI interviewed him twice in 2013 and again in 2014, but determined he was \"not a threat at that time.\""},{"comment_id":"10152991778321336","commenter_b":"Illegal aliens beau","commenter_a":"scary stuff","post_message":"More than 100 patients may have been exposed to a potentially deadly \"superbug\" at the Ronald Reagan UCLA Medical Center."},{"comment_id":"907517025969130","commenter_b":"May she be he first to suffer any repercussions from this decision.","commenter_a":"I'd like to know what her retirement package is!","post_message":"UNREAL! RETIRING SENATOR IS 34TH VOTE TO CLINCH OBAMA WIN ON IRAN DEAL   Obama puppet..."},{"comment_id":"558362490993134","commenter_b":"Why is it we are so intent to run our country into the ground?? Follow Trump, and mark my words, there will be a WWIII, and everyone will be pointing their guns here. We will have no allies as he will insult them all. Wake up, America.","commenter_a":"\"I will not forget.\" What in the hell do that suppose to mean?","post_message":"Do you agree with Donald J. Trump's tweet?"},{"comment_id":"10155207615341037","commenter_b":"No politics?!?!?! You are not paying attention. 😂😂😂 LOVED it. AND what she stands for....only few understand. Good for her. NASTY WOMEN!!!!!!","commenter_a":"There was a subtle political statement in her opening songs but I felt it was out there to move people together. She was nothing less than I expected. She brought down the house. The show was amazing","post_message":"Did Lady Gaga win the Super Bowl?"},{"comment_id":"1042991895769865","commenter_b":"Assholes","commenter_a":"The WORST representation of what New Yorker are really LIKE! He's a Schmuck","post_message":"Let's try this again.  (And hey, while you're here, make sure to RSVP for our \"Vote against Trump\" page, and let the world know you are going to vote against him:  @webpagelink/ )"}]
