[{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"563855710491041","commenter_b":"Such a PIG","commenter_a":"POS!","post_message":"His response is simply \"deplorable.\""},{"comment_id":"1191417507545813","commenter_b":"HELL, IF THESE PEOPLE WORKED AT A JOB AS HARD AS THEY DO PROTESTING THIS STUPID CRAP, THEY WOULD HAVE PLENTY OF MONEY !!!!!!!!!!!","commenter_a":"So the dems want to shut down Graceland via their personal propaganda terrorist cult Black Lives Matter AND they want to label WikiLeaks a terrorist organization and have put a DEAD OR ALIVE bounty on Julian Assange. These ARE troubling times. I can't believe they think the American people are that stupid. Enough is enough. Stop with the violence and let us now hear what the Clinton camp thought should be deleted. (Despite the State Dept. request for ALL email on server) I think at the end of the day people of all colors and beliefs in America will find they thought we were all stupid enough for them to screw all of us. We really all need to stick together. Unity matters now. #HumanLivesMatter #AllLifeMatters #TruthMatters Now let THAT sink in.","post_message":"Leaders of the protest say they chose Graceland because \"it demonstrates one of Memphis's most common forms of financial inequality and because the site has ties to ... the death of unarmed teen Darrius Stewart.\""},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad.  And it comes straight from YOUR pocket!"},{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."},{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"}]
