[{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"1118891848162172","commenter_b":"YES! And I hope they do throw her in jail!","commenter_a":"WTF!! Put her ass in jail! She is just as guilty, that's premeditated...she knew about the plan and let it happen","post_message":"She reportedly \"tried to talk him out of it,\" but that's it."},{"comment_id":"10154529191812669","commenter_b":"‼️‼️‼️‼️🤑WHO OPENED THE BOX OF FRUIT LOOPS❓❓❓❓‼️‼️‼️‼️‼️‼️‼️🤑🤑🤑🤑🤑🤑‼️‼️‼️THESE ARE \"cereal\" protesters lmao","commenter_a":"‼️‼️‼️‼️🤑WHO OPENED THE BOX OF FRUIT LOOPS❓❓❓❓‼️‼️‼️‼️‼️‼️‼️🤑🤑🤑🤑🤑🤑‼️‼️‼️THESE ARE \"cereal\" protesters lmao","post_message":"U.S. Senate debate and vote on Betsy DeVos to be Secretary of Education. Full video here: @webpagelink"},{"comment_id":"10153838572646756","commenter_b":"I've heard people complain about steak & lobster, but not produce.","commenter_a":"Odd that many who are not on food stamps complain when those who are eligible have carts full of healthy/quality food: seafood, steak, fresh produce. It's America -where life is a competition. If you need help, you stay at the bottom.","post_message":"People who rely on federal food stamps ate about the same number of calories, but consumed fewer fruits and vegetables and whole grains and more added sugars, according to studies."},{"comment_id":"10153414475016167","commenter_b":"Damn uppity women with their words and assertiveness","commenter_a":"They should know we Chicago folks like a good shout out. Have they never been to a Cub, Bear or Hawks game? It is enthusiastic and honest.","post_message":"Add this to the list of things the media would never attack a male politician for:"},{"comment_id":"10153273051101051","commenter_b":"The idiotic responses of this lady, smh","commenter_a":"Really? I've never heard Obama saying anything that is anti police.","post_message":"Ted Cruz just made a serious accusation against President Obama. Do you think Cruz is right about this?"},{"comment_id":"1697928997118346","commenter_b":"I DON'T WISH TO RUIN MY DAY WITH THIS MISERABLE COWARD MAGGOT--CORWARD RACIST EVIL VOLDEMORT.","commenter_a":"Vote blue across the board. Vote Democratic party in the next election. Go Hillary. DUMP TRUMP THE IDIOT","post_message":"Well, it's official: Donald Trump will be the GOP presidential nominee. Simple question: Are you voting for him?  LIKE Opposing Views for all of the latest 2016 election breaking news and debates."}]
