[{"comment_id":"870445706335391","commenter_b":"Life starts when your born. Read the Bible partically when god breathed into Adams lungs and life started","commenter_a":"Every life matters!! Save the unborn today","post_message":"Tell Congress to protect the unborn!  Click below to urge your Congressman and Senators to cosponsor the Life at Conception Act!"},{"comment_id":"1367333429993068","commenter_b":"^^^^ angry feminist.....who'da thunk it","commenter_a":"so much narcicism in society these days...so many women demanding to be seen as \"beautiful\"....its ridiculous. And the kicker, if youre a man, and you say they are fat and unattractive then you are a \"chauvanist\" or \"intolerant\" etc etc etc....but you know what, why do women not go crazy over fat rotund men??? where is the fat acceptance movement for those guys? I rest my case.....no ladies, that isnt attractive.","post_message":"'These are the women you've rolled your eyes at... or joked about with your friends'  (via Daily Mail Australia)"},{"comment_id":"1820354578210881","commenter_b":"She can't be lazy.....she must spend most of her time on her back with her legs open !!","commenter_a":"She needs to close her legs","post_message":"(But she still manages to spend £20 a week on cigarettes)"},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"10154356855773256","commenter_b":"She's an idiot","commenter_a":"She copied a kiwi who did this. Lame","post_message":"If others have the right to have their opinions of the divine reflected in their driver's license photos, then so should members of the Church of the Flying Spaghetti Monster."},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"621850294655889","commenter_b":"She's a mean old lady!","commenter_a":"So I wonder who the hater is in this election? Who the bigot is? Who is the person that calls black people Super Predators? Who calls half of America a Basket of Deplorables? Who calls all human beings but elites Little People? #BasketofDeplorables #Superpredators #LittlePeople #HillaryHates","post_message":"When you are president, you are president of all the people."}]
