[{"comment_id":"10153938983386051","commenter_b":"It appears that conservatives are pro-Sharia law after all.","commenter_a":"People willing to vote for a guy married to a former supermodel and who used to sponsor a beauty contest object to a halter top? Really?","post_message":"Some people are very upset over how Megyn Kelly dressed on Fox News last night. Here is what she wore. Decide for yourselves if there's anything wrong with it."},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"},{"comment_id":"1004919146212988","commenter_b":"I absolutely agree, bit discouraged by the corruption of our politicians which when it comes down to it is our own fault. But Liberty, freedom, and the right to self determination are Gods greatest gifts.","commenter_a":"agree","post_message":"Do you agree with Calvin Coolidge?"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"},{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"1118930614814076","commenter_b":"Palin has a mental disorder, do not vote for this woman at all Americans.","commenter_a":"She gives all Alaskan women a bad name. Duct tape would be useful over her mouth.","post_message":"She's mind-bogglingly dimwitted."},{"comment_id":"10154524280341955","commenter_b":"She's corrupt to the core.","commenter_a":"More of the trash that needs to go.","post_message":"Loretta Lynch 'Pleads Fifth' on Secret Iran 'Ransom' Payments..."}]
