[{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10154165798037212","commenter_b":"It was an accident. Please use your words kindly. The driver needs our prayers . This was a total accident.","commenter_a":"I'd kill someone hands down. Hit my kid or my dog with your car and you better pray the police get there quick enough. I'm at a loss of words for this little family. Praying for them with everything in me.","post_message":"UPDATE: A 2-year-old boy has died after being hit by a car Tuesday night in Yukon. #News9"},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"1056213647735452","commenter_b":"I didn't watch it, but I don't think it was appropriate to turn a sports event into a platform for a political statement. Perhaps the NFL should start requiring artists to submit song choices & performance videos ahead of time for approval or better yet just have a military or top-ranked college marching band perform.","commenter_a":"She's disgusting and an embarrassment to the entire country. The Superbowl was not the place for a political statement and someone at the NFL should be held responsible for her selection. She degraded the event and insulted the vast majority of Americans who chose to watch. I for one did not.","post_message":"Buckle up, 'cuz Rudy's got something to say...."},{"comment_id":"10153429543136491","commenter_b":"Not that it matters. A white woman would probably been cast anyway.","commenter_a":"WHY?! Are there no LATIN/HISPANIC actresses that can fill this role?","post_message":"Jennifer Lawrence will soon add another splashy biopic to her resume."}]
