[{"comment_id":"10154097655775736","commenter_b":"Threatening our non violent non threatening neighbors with war just because why not! Grounds for immediate impeachment!","commenter_a":"And there's no bad hombres up here?","post_message":"\"You have a bunch of bad hombres down there,\" Trump told Mexican President Enrique Pena Nieto, according to the excerpt seen by the Associated Press. \"You aren't doing enough to stop them. I think your military is scared. Our military isn't, so I just might send them down to take care of it.\""},{"comment_id":"10154997509084626","commenter_b":"YOU ARE AN INSULT TO ALL WOMEN","commenter_a":"The embryo inside you, is not your body","post_message":"LIVE STREAM: Women's March on Washington"},{"comment_id":"10153093955378487","commenter_b":"One lady in particular..","commenter_a":"He only knows war and how to use military might .... nothing more. He is the same type of person as McCain.","post_message":"Netanyahu wants a role in shaping the Iranian nuclear agreement, should one materialize. His recent actions suggest that he doesn't quite know what he's doing."},{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10152540826575047","commenter_b":"Sign me up, no they should NOT be allowed back in the US, they're a security risk!","commenter_a":"Go fight with the enemy, you be become the enemy. No tollerance for deserters of the American Constitution. You are for America, or you are against America. No gray area here. Don't let these deserters back in. They leave, they stay gone forever!!!","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"1342884069080344","commenter_b":"And deport!","commenter_a":"Anyone wearing a mask does not want to get their picture taken when they destroy, throw them in prison and make them pay for damages.","post_message":""},{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"}]
