[{"comment_id":"10157991607240354","commenter_b":"Get them out of our country!!!","commenter_a":"Can't wait to have Trump in the White House soon enough. Obama and Hillary both want to stuff America with these sexual Islamic deviants in thousands. #SaveAmerica #VoteTrump","post_message":"Had they not been allowed in the country, it never would have happened."},{"comment_id":"10153666093873132","commenter_b":"Please!!!! She is a rapist!","commenter_a":"Nik Gudel","post_message":"Altice's lawyer described her as a woman who was trapped in a bad marriage, saying she is \"troubled\" and \"has problems with viewing her own worth.\""},{"comment_id":"10156208561685354","commenter_b":"So is this a rally call to hate blacks or something? I mean, if SHE said it, then EVERYBODY in the black race must feel the same way, right? You extremists only care about the opinions of other extremists. Fuck a race war, fuck a holy war, fuck an unnecessary war.","commenter_a":"There is the face of a true racist.....","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"1011692715642632","commenter_b":"My family has been here for 10 generations and I voted for. Hillary. So stfu you hateful witch.","commenter_a":"I had 4 grandparents all born in America. I did NOY vote Trump!","post_message":"Fact check!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"259111647859034","commenter_b":"Yes $85 million!!! They're saying that he abused he used to go to the most expensive hotels, restaurants, and buy so much expensive stuff since tax payers are the ones that were paying !!! A lot of luxury vacations for Mr. Obama !! And before leaving the office he send $221 million to the Palestinians !!!! I wonder since when he was sendings them money. that's why noooo I don't miss Obama ! I don't agree on some stuff Trump is doing but I hope he can makes this country great cause Obama did a lot of F***** up stuff to this country and I guess that's what people want a president that lies to us and do stuff that we don't know !!!","commenter_a":"What? A weekend at his own property? The nerve! He should be on a beach in Hawaii, sucking up the taxpayer's money! The utter gaul of this man!!!","post_message":"LIVE NOW: Trump arrives in Florida on Air Force One."},{"comment_id":"1308657809199446","commenter_b":"Please! Let her stay home.she's not needed there are many others to take her place.","commenter_a":"Let her stay home.","post_message":"One of the dancers felt \"embarrassed and disappointed\" by performing at Trump's inauguration."}]
