[{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a \"fear monger.\""},{"comment_id":"10153356804576336","commenter_b":"The words that come to mind wouldnt be appropriate for FB or for a lady to say....smh.","commenter_a":"Obuttma is a hug a thug..what is wrong with his brain⁉⁉","post_message":"The number of detainees at the Guantanamo Bay detention center is now 116, compared to 242 when President Barack Obama took office."},{"comment_id":"980159212038244","commenter_b":"build a wall around this state.","commenter_a":"Hang the son of a B... Sheep F'r! Make an example of him!... we don't tolerate this crap in our Country!","post_message":"BREAKING: ISIS SUPPORTER Arrested In Michigan Before He Could Carry Out This Plan [Video]  “It is my dream to behead someone”"},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"\"You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.\" #CharlestonShooting"},{"comment_id":"10158427286480206","commenter_b":"Where were these feminist when Bill was galavanting around town assaulting women and Hillary was defending him?","commenter_a":"Wonder if they \"smoked\" cigars afterwards, with Bill.... 2016, the year that people protested over a word... terrific.","post_message":"A mostly-female crowd chanted \"GOP, hands off me and \"Trump thinks he runs this town, p---y came to shut it down\" outside of Trump Tower."},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."}]
