[{"comment_id":"10156595993175725","commenter_b":"WHen u get in there the illegals needed to be rounded up.","commenter_a":"and the winner for tonight is @username","post_message":"It all begins tonight - WE WILL FINALLY TAKE OUR COUNTRY BACK AND MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154420350898797","commenter_b":"She dont need those racist mother f**ckers","commenter_a":"Beyoncé has a concert coming up in Florida. Guess what? I read not enough off duty Police want to work it. Karma be a beeoch.","post_message":"BEYONCE BOYCOTT: The police union deemed her performance - which included allusions to the Black Panthers, Black Lives Matter, and Malcolm X - \"antipolice.\""},{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."},{"comment_id":"10155130620974060","commenter_b":"Yeah Yeah okey then you are one of those...","commenter_a":"UK will go out on a Friday and apply to go in on a Monday....that will suit the FTSE trading too....","post_message":"If the public is to turn against Brexit, it will do so on its own terms. The task of Remainers is to be ready"},{"comment_id":"10152781185011748","commenter_b":"A woman named Ann Coulter taught me to hate the republican party!","commenter_a":"Why is it still speaking?","post_message":"Ann Coulter slams college loans as a \"scam\" meant to make kids hate white people and Republicans"},{"comment_id":"10155066289616336","commenter_b":"@username is a dumb pussy","commenter_a":"Can't wait to hear!! PA deplorable here","post_message":"President Donald J. Trump has announced Judge Neil Gorsuch as his nominee for Supreme Court of the United States."},{"comment_id":"1285542031522022","commenter_b":"A lot of women with four children worked.","commenter_a":"BOOYAH!!!","post_message":"MUST WATCH: Kellyanne Conway PUNCHES BACK After Juan Williams Questioned How She Could Work And Raise 4 Kids: \"I don't play golf and I don't have a mistress\" [VIDEO]  I can't stop cheering for Trump's #1 woman! Just like her boss, the Left is going to quickly discover that she is not one to sit back quietly and be attacked…"}]
