[{"comment_id":"10153986223919087","commenter_b":"Trump is NOT a BS. Let's make America GREAT and SAFE again. Hillary is a liars just want the votes from the black and illegal immigrants. She just say whatever you all want to hear to get your votes. WAKE UP AMERICA!! US Citizen. Love USA!! Go Trump 2016 !!!","commenter_a":"Let's make America great again!.Hillary is a liars. We are people choice, love this name. His name is Donald Trump 2016.","post_message":"#BREAKING: “I will not be voting for Donald Trump for president,” Republican Sen. Susan Collins announced Monday."},{"comment_id":"529925163864730","commenter_b":"Kool","commenter_a":"This poor (morally) man reminds me of the KKK and how most whites were offended and embarrassed by them in the early 60's.","post_message":"Al Sharpton's career is going to come to a screeching halt after this.  His own people are turning against him. Now is the time to strike.  Can we get 30,000 'LIKES' for Al Sharpton getting fired?"},{"comment_id":"10152871258752411","commenter_b":"Tradition in high school sports.....especially football.........Give it a rest already!","commenter_a":"Lol omg. To all these people saying how mean it is. It's called having a sense of humor. It's awesome. And I'm SURE the neighborhood helps him clean it up;) relax;)","post_message":"ANYONE NEED TOILET PAPER? Coach Q's house was TP'd after Chicago Blackhawks Stanley Cup win.  Full story: @webpagelink"},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10153238433806782","commenter_b":"So you have no problem sharing a restroom with men? That's not how I perceive most women feel","commenter_a":"Oh for Pete's sake, does government really belong in the restroom???? Work on something that really matters! Schools, roads, infrastructure, the things government does belong. Are you going to post guards in every bathroom and have to check your \"plumbing\" to see what you are equipped with to make sure you are going to right one???","post_message":"A similar bill was filed in Oklahoma: @webpagelink"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"}]
