[{"comment_id":"10156457619055354","commenter_b":"She's only fit to lead her prison cell block at this point.","commenter_a":"Well, Hillary, if you hadn't enabled the enemy by letting the Benghazi attack go on, sending arms to our enemies, selling, for your own profit, 1/3 of our uranium to Russia and in many other ways letting terrorists know that it's open season on Americans, we wouldn't be having to listen to you whine that you want us all unarmed so we can't fight back.","post_message":"Unserious and out of touch."},{"comment_id":"884400811644417","commenter_b":"Once again, that blonde bimbo has diarrhea of the mouth!","commenter_a":"this guy has an ego like no other. he is disgusting to look at and if he weren't rich he would probably be a homeless pervert or a wall street runner.","post_message":"The Oracle of the Republican Party speaks out."},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"10155201901781162","commenter_b":"Maybe the writers can be more select on how they word their headlines. Maybe they do this on purpose cause they get a kick out of reading the comments. You never know.","commenter_a":"Reading is key... trumps pic did employ an illegal, but upon finding out ended her employment and aided in getting her assistance in getting legal status ... this is why america is the way it is... read a title and jump to conclusions... most of the people protesting can't really hold a conversation about why there out there.. other than 1 line headlines they repeat over and over... it's sad","post_message":"President Trump's labor secretary pick, Andrew Puzder, admits that he and his wife employed an undocumented housekeeper for years...@webpagelink"},{"comment_id":"10153978119022690","commenter_b":"I'm a hard working taxpaying citizen and I say every day this is the greatest country on the plant. America is Great proud to be an American.","commenter_a":"It's great for immigrants and illegals. Not for the hard working tax payers that pay for everything they get. And they keep raiding SS to pay for them too what's so great about that?? TRUMP MAKE OUR COUNTRY GREAT AGAIN!!","post_message":"First lady Michelle Obama at the DNC: \"Don let anyone ever tell you that this country isn great. That somehow we need to make it great again. Because right now, this is the greatest country on earth.\" @webpagelink"},{"comment_id":"10154291301186337","commenter_b":"They better pay that woman right this time, she'll put your ass on blast if you negotiate her pay in any way.","commenter_a":"So they are doing a reboot of a remake? Hollywood has really run out of ideas.","post_message":"J-LAW BREAKIN' THE LAW! If Sandra Bullock plays Clooney, then is Jennifer Lawrence Brad Pitt?"}]
