[{"comment_id":"535720006552593","commenter_b":"There's a hot, firery place in hell waiting for this bitch!!!!","commenter_a":"Thank God they found them.","post_message":"A woman in Texas is charged with child abuse after police find two toddlers tied in the backyard of a home, and six other children, ages 10 months to 13-years-old, alone inside. Disgusting."},{"comment_id":"695691723946745","commenter_b":"She has no clue !","commenter_a":"Talia Crichton","post_message":"The look on her face when Al Franken calls Betsy DeVos out for being so damn IGNORANT about education policy is simply priceless!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1156511254368903","commenter_b":"The land belong to native american until white screw it up.","commenter_a":"NO TO CHINA!!!! Our land is for the American People!! and Washington State's water belongs to THEM!","post_message":"Farmers from drought-parched California are finding greener pastures in the Pacific Northwest. And so are buyers from China."},{"comment_id":"10154203374126077","commenter_b":"Anita Mondragon I called 7 news, they immediately started investigating. Then once they had the tip everyone else ran with it.","commenter_a":"Oh so now 9 news wants to cover this. Tried to get ahold you guys and nothing. Guess now you'll pay attention when people try to get a hold of this station on news.","post_message":"Westminster Police believe 31-year-old Jarred Strenge killed a woman in her 30s last night. Anyone with information about his whereabouts is asked to call Crime Stoppers at 720-913-STOP."},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"1072562746193671","commenter_b":"You don't like China?","commenter_a":"Yes yes Mexico is paying for the Wall, I just did nit get the chance to tell them yet. I met the Mexican president, he is a great man, I have a lot of respect for him and I love him and the Mexican hombres a lot. I offered the Mexican president free premium trump wine from china","post_message":"\"[It] fully-funds the construction of a wall on our southern border... with the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall.\"  Earlier today at his \"first 100 days\" speech in Gettysburg, Donald J. Trump outlined his proposed \"End Illegal Immigration Act.\" @webpagelink"},{"comment_id":"10153738613786955","commenter_b":"And black people wonder why white people view them the way they do. When you act like a classless piece of crap, we are going to view you as a classless piece of crap. And this woman is a classless piece of crap","commenter_a":"Should have dragged this Nappy-headed skank out by her hair & shown her the gutter where she belongs......Good luck in Prison Ho'","post_message":"WHAT HAPPENED TO MANNERS IN THIS COUNTRY?"}]
