[{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4.  TO WATCH/READ MORE: @webpagelink"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"10154208733135969","commenter_b":"Why do they want to protect illegals? Wth what about the citizens","commenter_a":"IAGREE YSE","post_message":"The White House Press Secretary Sean Spicer holds the daily press briefing after President Donald J. Trump met with Intel's CEO about investing in America."},{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."}]
