[{"comment_id":"10153530679413984","commenter_b":"I hope she gets jail time!","commenter_a":"Some beasty mom will kick her face in I'm sure. As a Juvinal little will happen to her in our current legal system.","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10153733713798984","commenter_b":"Amen. And with the way that woman looks, she'll be working the counter at McDonalds.","commenter_a":"If you can't or won't do what your job requires, then find another job.","post_message":"The husband of Kim Davis wants to send a message to the judge who jailed his wife, and he only needs six words to do it. He is not at ALL happy with what is happening to Kim, but it is clear that he and his family are not going to back down from their beliefs.  Do you support Kim Davis and her family?"},{"comment_id":"1038817212861551","commenter_b":"My gurl !!!!","commenter_a":"President Hillary Clinton","post_message":"\"Don’t let anyone ever tell you that this country isn’t great.\" - Michelle Obama delivers an emotional testimony to the greatness of the United States of America. @webpagelink"},{"comment_id":"1204607766260053","commenter_b":"Crazy woman","commenter_a":"Why is she even in the news? What is wrong with people that will send her money for this fruitless action...how stupid can you be?","post_message":"WOW! JILL STEIN'S 'FIRESIDE CHAT' Exposes Her Delusion On Recount [Video]   Jill Stein trying her best to remain relevant!"},{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"10153267588169497","commenter_b":"@username's a big ole pussy","commenter_a":"Deserter.","post_message":"In Focus:   The Onion breaks down what you need to know about the former POW"},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"}]
