[{"comment_id":"611669965660278","commenter_b":"Hillary shouldn't be the Democratic nominee for the Presidential Election. She should be an inmate in a maximum security prison!!!","commenter_a":"well that would include her also wouldnt it, you know, being funded by the saudi's and all !","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"1402706749758182","commenter_b":"Awesome Donna! Way to #GrabEmByThePussy !","commenter_a":"No to Any replacement for Trump! No to Pence!! He could Never beat Hillary. Remember almost 1/2 of America did not even know who Mike Pence was a week ago and the V debate had poor ratings. 40 percent of America wull stay home on election day.","post_message":"Sen. Johnson kicked off Manufacturing Month with a special video message to students touring Pewaukee manufacturer TLX Technologies during their open house. Hundreds of students visited the business throughout the day to learn about careers in manufacturing."},{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"1574536666183131","commenter_b":"\"TO GIVE A RAISE TO ALL SOCIAL SECURITY RECIPENTS, JUST STOP TAXING THEM! Only if they make 20K or more per year. Anything less do not tax em. BOOM!","commenter_a":"Good luck! If you still believing the employment can save you. We are in a new economy, and employment insurance is not the answer..","post_message":"We are suffering through the worst long-term unemployment in the last 70 years. I want change - Crooked Hillary Clinton does not."},{"comment_id":"987930937907325","commenter_b":"That's how twisted this pervert is ! Prison !","commenter_a":"well well I never heard that stupid statement made before didn't fly with me","post_message":"UNBELIEVABLE! The audacity...  Story: @webpagelink"},{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"644515682393824","commenter_b":"Hi liar y!! Tear down that wall. Let all illegals in that wish to come in and take stuff for free!!!","commenter_a":"I love that Trump is not afraid to call bs when he sees it!!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"}]
