[{"comment_id":"579018038952469","commenter_b":"Safi Cedrick Varda this actually aired like today ..... in 2016!!!","commenter_a":"What was the point of this?","post_message":"They actually aired this."},{"comment_id":"10154046898184199","commenter_b":"I think the verbal abuse has to be severe (to the point of verbal battery) before they will enforce it but this is how the state has defined it but I'm not a lawyer and if theres a lawyer reading this could you please explain it better the rcw codes tend to be confusing.","commenter_a":"Ok so for the internet lawyers out there, or real lawyers, riddle me this: If I start cursing out someone on the street, can a cop arrest me? Have I broken the law?","post_message":""},{"comment_id":"10154116780129749","commenter_b":"Stick with the real story... Isis killers murdered people in Brussels and Paris... They are Muslim., not all muslims are like that. FACT. Focus on hunting down these Arab Dog sh*t murderers... The politically correct are part of the problem. So shut the f*ck up about this clown.","commenter_a":"OMG. Are you stupid, ignorant or both? surely this is a joke!","post_message":"\"Croydon\" started trending as Twitter was flooded with scores of tweets condemning his comments."},{"comment_id":"10153203390966320","commenter_b":"Actually it's rent stabilized...different rules...","commenter_a":"a rent controlled apartment can not cost more than 2,100 a month. It even says so in the tenant laws","post_message":"Tenant accused of listing rate stabilized apartment for $649 a night on Airbnb @webpagelink"},{"comment_id":"10154912048588128","commenter_b":"... so now that the republican congress has a republican president, can they start paying down the national debt now? :)","commenter_a":"We need to fight Islamic terrorists and China. Congrats Trump! Let's make America great again. With Love, From India. We are also celebrating in Delhi for your victory!","post_message":"President-elect Donald Trump will likely get the chance to fill the Supreme Court vacancy created by the death of Justice Antonin Scalia, and could have the chance to tilt the balance of the court more solidly conservative for decades if other justices retire."},{"comment_id":"10154592640014411","commenter_b":"actually, feminists hate people forcing women to wear/do anything, which is kinda what a ban amounts to.","commenter_a":"Burkini is everyrhing that a feminist hates,so how can feminists agree for that?","post_message":"'...attempt to raise profits and exploit a gap in the over-saturated clothing market is selling and promoting allegiance to ISIS?'"},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""}]
