[{"comment_id":"10153720539999749","commenter_b":"Andrea Lopez who is an American? You are an illegal 2 me","commenter_a":"I think Trump can cause the 3rd world war with only his mouth , the N.korean dear leader wldnt stand him for a minute","post_message":"\"Ivanka’s intervention has only served to undermine her own integrity. Just one more mortifying moment in a long line of Donald Trump’s dealings with women.\""},{"comment_id":"1024542317579852","commenter_b":"@username, Planned Parenthood doesn't sell body parts and those that say they do are lying","commenter_a":"Thanks to the fact that the local Planned Parenthood clinic was closed down in Scottsburg, testing for AIDS and other diseases was nearly nonexistent in Scott County. And now Republicans are wanting to defund Planned Parenthood despite the fact that abortions make up only 3% of what PP does. SMH... @webpagelink","post_message":"In recent weeks, the American people have learned more about the barbaric practices Planned Parenthood uses to take innocent human life. Despite the outrage of millions of Americans, Planned Parenthood’s response has been to blame the messenger or the videographer, without addressing the barbaric practice of harvesting aborted body parts.  We need to let Planned Parenthood know that the American people do not support these inhumane practices. Congress should vote to end federal funding for Planned Parenthood before we leave for August recess. I urge Senate leadership to give every Senator the opportunity to affirm that life is a sacred and precious gift that must be protected."},{"comment_id":"902571806432266","commenter_b":"THEY will be one of the 72 virgins.","commenter_a":"Its not 72 virgins they will get , its 1 -72 year old virgin, they are crazy","post_message":"You can't even imagine what is happening to thousands of children as young as 5 years old..."},{"comment_id":"970231249739794","commenter_b":"Wth are you talking about? What woman? What illegal alien?","commenter_a":"The woman killed in San Francisco by an illegal alien will never go out with her father again.","post_message":"Some quality dad time!"},{"comment_id":"10153793064907452","commenter_b":"We have to go bail him out!!! 2,000 pesos!!!","commenter_a":"Sal zorro is at it again 😂😂","post_message":"As officers rushed to the Los Angeles International Airport amid false reports of shots fired, they encountered a man dressed as Zorro outside Terminal 7. @webpagelink"},{"comment_id":"10153465361664714","commenter_b":"I'm just sorry u all have to go thur you show up lifting an I'm praying they do not take it of. I've been in your shoes girls,an the ownly way is to move on is to try an find a way to forgive an forget,I. Found it in my bible there isn't one single person out there that donest havesomething bad or a secret hidden in their closet, I'm just sorry something as this is blown so far there,but I can say this ,I love the show an praying it back on u r like my family,an I'll miss u.","commenter_a":"In not excusing at all what he did, but how is he a pedophile or rapist? Kids touching kids around their own age aren't pedophiles. It's molestation, yes. When an adult touches a child in a sexual manner, that's a pedophile. A rapists is some one who rapes another person. He didn't have sex or oral with his sisters. He's not a rapists and he's not a pedophile. He was a molester. I'm not saying what he did was nothing, but can we call it what it is without adding false titles? The diggers called trans people pedophiles and we no that's bogus, but do we need to stoop down to their level? If we do, we're just as bad in our thinking as they are.","post_message":"More on the 19 Kids and Counting scandal."},{"comment_id":"10154206928052431","commenter_b":"Politicians are non caring, or deliberately killing us. After all look at what Jackson did. Small pox ridden blankets. Yep and their attitude has not changed since. Maybe we should force better care of our people and not of these illegals.","commenter_a":"This is so very true. I was a cancer patient. Actively seeking medical help for confirmed CANCER in my body. The doctor at my clinic simply didnt show up for my first 3 appointments. All I needed was a consult, so they could refer me to an oncologist and behin treating the cancer. The first appointment was scheduled 1 month out, when the doctor didnt show, they had me see a nurse who confirmed I needed to be seen as soon as possible, and they scheduled me for 2 weeks later. Then, the same doctor didnt show for that appointment and it was another 2 week wait. Finally, on the 3rd no show I threw a fit and the clinic agreed to let me see a younger doctor who was actually in the clinic. And finally, after 2 months I got my referral to see the oncologist. In addition, because ...","post_message":"Natives Are Dying Because IHS Can’t Assure Timely Access to Health Care  @webpagelink"}]
