[{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"815781625279081","commenter_b":"this is America bitch dont like it take ur camel and ur fanatical hateful selves back to hubbabubba where the f*** u came from. i fought u over in ur backyard dont think i wont put 1 in u in mine mf","commenter_a":"Yes","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"10153598853368984","commenter_b":"How many bullets are flying in your direction in the United States of America from Muslim extremists? How many IEDs are you avoiding on your way to the grocery store? I know we all know on any given day we could face gunfire from our neighbors from all different Christian faiths. If anything you're much more likely to be attacked in the U.S. by an angry Christian than by any other group of faith. The by the number argument that you're safer over seas from terrorist attacks than at home in the U.S. is based on comparing thousands of attacks on militarized institutions over seas and a small number of attacks directed at low security military institutions & personnel in the U.S. I feel for our solders at home being attacked. Just as I mourn for those children being attack in schools around our country. The people in the malls ...","commenter_a":"\"Radical Muslims are now the rule, not the exception\".... Let's talk about this. The Muslim faith has the largest number of believers in a world full of different faiths. To consider turning against all Muslims quite literally means to turn against over a billion people. She said this was the 21st attack. So roughly 21 people of the millions of Muslims living in the U.S. are radicals. I'm no math wiz but that sounds like an extremely small percentage. Secondly, Christians around the world have killed millions of people in the name of a God that most Americans demand our president to believe in. Who are the real radicals? Continuing, a soldier serving/living in the Middle East is absolutely not more safe there from terrorist attacks than one living in the U.S. That comment should be heard clearly as one of the dumbest things ever said. This Ignorance being spread ...","post_message":"This 22-year-old news anchor's brutal beatdown on Obama's \"half-way, half-baked, tip-toe, be-friendly-to-Jihadis mentality'' has been viewed more than 1.4 million times on YouTube, and overnight --  a viral sensation.  Now, she's just revealed what made her speak out.  Do you support Tomi Lahren and her message to Obama?"},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."},{"comment_id":"583735078458513","commenter_b":"Mike( @username) what makes these kinds of statements so hateful and racist in that it taxing the ancestors of one group for the actions of the ancestors of another group. The probabilities are just as likely that your ancestors dies freeing the slaves or were not even in America in the mid 1800's or that fella demanding the free $ had relatives that sold the Africans to the slavetraders. That's how it was done. Africans selling other Africans to the traders. Throughout history all groups and races enslaved each other. Many believe the pyramids were built by slaves under the direction of African Masters. Let's try it Dr King's way by judging people by their character not color. That chip on ones shoulder can get quite heavy!","commenter_a":"No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"}]
