[{"comment_id":"10153978466591002","commenter_b":"These are Outlaw Motorcycle Gangs..not Motorcycle Clubs..Outlaw Gangs are nothing but Thugs","commenter_a":"I am in the minority here, but I feel safer with motorcycle clubs than I would anyone else. I would not turn away of I walked into a place of business and seen club memebrs in the same place. They don't just go out and rob and kill people because they want to. You can't compare existing clubs to SAMCRo from Sons of Anarchy. This is a TV show. Hell, we should have the clubs patrol the streets. Think about that one!","post_message":"After the Waco shootout this weekend, outlaw motorcycle gangs are again in the spotlight. Roger Weber takes a look at local biker gangs: @webpagelink"},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."},{"comment_id":"642967212548589","commenter_b":"YOU ARE ALL IMMIGRANTS UNLESS YOURE NATIVE AMERICAN. DEPORT YOURSELF.","commenter_a":"Trump they going to kill you man you are trouble man","post_message":"WATCH LIVE: A large group of people protesting President-Elect Donald Trump are marching in downtown St. Paul, Minnesota. Similar protests are also taking place in Chicago, New York, Washington, D.C., Philadelphia, Portland and Atlanta.  @webpagelink"},{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."},{"comment_id":"1043008155755713","commenter_b":"To prison. Oh that's right she is above she law.","commenter_a":"It wasn't a vacation it was a paid leave of absence. Hello Obama is any body home? You work for us just like Hillary. O yeah she doesn't do anything but lie.","post_message":"Tonight is the biggest fundraising deadline yet of this campaign. It isn’t about money, budgets, or even what our competitor might raise. It’s about you and me, working together to protect and build on President Obama’s progress—making sure our country is strong, safe, and fair. If you're with me, chip in $1 right now: hrc.io/1NXINOf -H"},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10153562923228132","commenter_b":"Please go up and down the beach and tell all of those women to put turtle necks on. I'm sick of seeing all of those boobs hanging out. And while we're at it, low cut shirts too. And tank tops (side boob). Stop being a hypocritical idiot.","commenter_a":"She could show a little modesty! Not everybody wants to see boobs hanging out! We used to be more modest, it's called showing a little class!","post_message":"\"I was really very hurt by this act, because I was in no way bothering him, so what gave him the right to shame me?\""}]
