[{"comment_id":"10153018260001130","commenter_b":"Darin, what exactly, is a slut?","commenter_a":"abstinence based=teachs them nothing and then they get curious and then once curious they start having sex and when that happens boom teen pregnancies and after that begins the slut shaming when the only people who should really be blamed is the schools and parents for not being more educational","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10153472677806051","commenter_b":"Ugly and a moron. She'll make some desperate man really happy","commenter_a":"😳😱","post_message":"This model decided to remove six ribs to look like Jessica Rabbit. Now she's facing the consequences."},{"comment_id":"968962986483662","commenter_b":"Exactly @username. @username, has already contradicted herself more than once. She is all over the place. That's one weird Troll.","commenter_a":"Barack Obama has done more damage to the USA then all past presidents put together...............He lies continually, he is anti-police, pro-thug, anti-life for gay marriage..... he says he is Christian but his fruits of his works are anti-Christ.....he sides with Islamic terrorists....goes against are biggest ally the Jewish Nation and has done everything he can to bring racial division to this once great nation. Treason is an understatement!!! Why don the Senate evoke the NUCLEAR option so to force our Divider and Chief veto all of the bills coming out of the Senate??? We the people should elect a person who will obey our Constitution and has faith in God, and a person who truly cares for the people and our Veteran!","post_message":"In 5 days, Congress will have to send \"must pass\" legislation to President Obama's desk to fund the government.  Sign your emergency fax petition urging them not to send a single penny of taxpayer dollars for abortion or abortion providers! Click here! @webpagelink"},{"comment_id":"10153266948641336","commenter_b":"Imagine that, another black defending them. WTG Angela, you thug.","commenter_a":"Stupid. So, they support arson, robbing and looting and destroying a city?","post_message":"Beyoncé and JAY Z reportedly paid Baltimore and Ferguson protesters' bail money, an activist claims."},{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."},{"comment_id":"640803119402199","commenter_b":"She would make a prison cell look good","commenter_a":"A better inmate. Classified is classified and a crime is a crime. I'd be in jail or hiding in Russia if I did what she did.","post_message":"Do you think Hillary Clinton would make a great president?"},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"}]
