[{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"906024782797611","commenter_b":"Them girls need to be arrested. I hope the police is watching this video and found them girls... My heart and prayers go the girl getting jump. No class at all...","commenter_a":"Jesse Chambers","post_message":"UK Girl Couldn't Take It Anymore & Passes Out On Her Feet!    Click Here To See All The Fights in This Months Comp. @webpagelink"},{"comment_id":"1111833728854862","commenter_b":"These women must be screwed up in the head! Why would you throw everything away for a sixteen year old BOY? They should have gotten their kink a little more reasonably.","commenter_a":"\"Endured\"","post_message":"The parents of a male teen student who endured a 9-hour threesome with a pair of blonde high school English teachers have sued the teachers as well as the deep-pocketed local school board."},{"comment_id":"661168074035043","commenter_b":"She has problems","commenter_a":"Dylan Ballzy","post_message":"Ermmmm..."},{"comment_id":"10153214192574170","commenter_b":"Could care less what she thinks !!!! LEAVE AMERICA!!!!","commenter_a":"Her opinion is s💱t Like her music Ghetto monkey opinions on race is ignorant and illegitimate Black rap culture is immoral dishonorable and gross","post_message":"I know, I know. \"who cares about some rapper?\"  The sad answer is \"a lot of people.\"  Conservatives have failed to engage in the pop-culture space for too long. That needs to change."},{"comment_id":"10153630601128433","commenter_b":"America the beautiful, oh how I miss her. Being offended is the new status symbol.","commenter_a":"Of the 13 attacks, how many went unanswered? How many were abandoned during the attack by their own chain of command? How many had their back up team be ordered to stand down? How many were blamed on a YouTube video?","post_message":"As Hillary Clinton testifies at a House hearing on Benghazi, a lot of you are digging back in our archives to look at a fact-check about past attacks on U.S. diplomatic personnel overseas. @webpagelink"}]
