[{"comment_id":"10154148875398721","commenter_b":"Vagitarian: when you vote for her because she has a vagina.","commenter_a":"In your lying phony dreams","post_message":"For many older women, voting for Hillary Clinton on Tuesday is about making history."},{"comment_id":"1620928861543005","commenter_b":"No one should hit ANYONE. Its assault. Penis or vagina.","commenter_a":"Im confused....she put her hands on him first. This shouldn't even be a thing.","post_message":"This football star was filmed punching a woman in the face. He's still allowed to play."},{"comment_id":"906024782797611","commenter_b":"Them girls need to be arrested. I hope the police is watching this video and found them girls... My heart and prayers go the girl getting jump. No class at all...","commenter_a":"Jesse Chambers","post_message":"UK Girl Couldn't Take It Anymore & Passes Out On Her Feet!    Click Here To See All The Fights in This Months Comp. @webpagelink"},{"comment_id":"10155895547455354","commenter_b":"Prayer's for his family and the woman that survived this crime. Where is the FBI, the commander in chief & brother Sharpton?","commenter_a":"There are no words for this outrageous act of hate. Hope they find the black sons of britches that caused this. Praying for the family......GOD BLESS YOU","post_message":"The other person in the car, who survived the wreck, says it wasn't an accident..."},{"comment_id":"10154213118095575","commenter_b":"Bingo","commenter_a":"Maher looks like a child molester","post_message":"Unbelievable!"},{"comment_id":"1676742522602038","commenter_b":"#Trump could be 1st in history to win all 50 states according to linguistic #genius. @webpagelink","commenter_a":"This shows you how corrupt the media truly is!!! This was posted 9-15-2001 by the NYPost.com. It has since been deleted because it proves TRUMP is right about them celebrating on 9/11 in Paterson, N.J. : DELETED POST URL: @webpagelink The nice thing about the web is it is NEVER truly gone! Here is an archive of the post they deleted: RECOVERED DELETE POST THEY ARE TRYING TO HIDE! @webpagelink Quote from their article proving Trump is right even though they claim to never have said such things! \"Here in New York, it was easy to get angry listening to Egyptians, Palestinians and the Arabs of nearby Paterson, N.J., celebrate as they received word of the murderous attacks in New York and Washington. But Mayor Giuliani (who has been tireless and magnificent in this crisis) rightly warned New York- ers that it would be wrong to take their anger out ...","post_message":"Look at the editorial I was just sent from the New York Post on 9/14/01 - 3 days after collapse of WTC. Any apologies?"},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"}]
