[{"comment_id":"10155542841313362","commenter_b":"Get well soon Senator Susan Collins and Merry Christmas.","commenter_a":"Thank you for the well wishes!!!","post_message":"Due to a slip on the ice, both Rob Gronkowski and I will be on Injured Reserve for the playoffs.  My ankle was broken in two places, but thanks to a successful surgery at St. Joseph Hospital with Dr. Jacob Brooks and his team, I am on the road to recovery."},{"comment_id":"10154485481559641","commenter_b":"What @username said ,is d same as oral sex...@ @username,gay pple does disgusting things as such too","commenter_a":"ORAL FECES SEX ..The Insanity, of those who participate in the ingesting of feces want acceptance for this \"NASTY\" diseased behaviors. Why because it makes for sickness, spreads a few disease`s to other humans that are deadly and dangerous disease`s. Calling the practice of ingesting feces \"normal and natural\". Tainted Blood, Fecal Infections and Perverted. Science tells us humans not to injest one anothers feces. The spread of disease is everyones business. Equality or Insanity.","post_message":"\"This will be the 22nd marriage equality bill in Australia and we still haven't got (LGBT) marriage ... what are we doing wrong here?\""},{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"},{"comment_id":"10154497186563445","commenter_b":"Our friends in england's women and children are also being raped to death or enslaved by \"refugees\" and have some of the strictest gun laws ever so I think we can cut our losses there, drug addicts.","commenter_a":"Shit","post_message":"While the DEA has been busy reclassifying CBD as a Schedule I drug, our friends in England are rightly classifying it as a medicine."},{"comment_id":"10154246184914609","commenter_b":"BUILD THE WALL","commenter_a":"Good because if you bothered watching the full video, you would see those guys attacking trump supporters and taking their signs. Those thugs (not protestors) got what they deserved.","post_message":"About that photo widely circulated across social media: “It started burning – burning really, really bad. I couldn’t open my eyes for probably 40 minutes,” the man hit says. @webpagelink"},{"comment_id":"1015570635171720","commenter_b":"he had a brick ..they can kill too","commenter_a":"\"Unarmed man tazed by police officer\" is what a headline will probably be","post_message":"Watch This Thug Learn Why It Never A Good Idea To Throw Bricks At Cops, BOOM!  @webpagelink"},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"}]
