[{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":""},{"comment_id":"10153903650539087","commenter_b":"@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"10155893621460231","commenter_b":"That's her prerogative ....","commenter_a":"Take it are leave it! but get a life.","post_message":"The singer—along with a lot of other people—isn’t buying it."},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"1147435038611171","commenter_b":"Really then why are they successfully managing to pay this in states,who have adopted the 15.00 an hour wage. Stop the lies. The people on top are only concerned with their grossly extravagant life styles. It's time to say enough is enough! No one is buying this line of crap anymore pay people a damn wage they can live on!!","commenter_a":"just read poll conducted....sample of just over 3,000 small business owners with 25 or less employees.....67% said they would sell out if could receive a purchase price of 20% loss of amount of capital invested.....wow.....would sell out if offered 80% of capital investment, going concern.....\"going concern', a reference to business in operation.","post_message":"He doesn't say it but a $15/hour minimum wage will crush many restaurants. Even higher end restaurants."}]
