[{"comment_id":"1134174459956481","commenter_b":"Put her in jail for contempt of court","commenter_a":"This trash needs to leave, NOW!!!","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS In our country you have to follow the laws of our court. If not,  suffer the consequences. Do you support this no-nonsense judge?"},{"comment_id":"1849193665299183","commenter_b":"White people are the biggest thieves known to man","commenter_a":"@username. as u know donny is completely unfit ...u dont care about your grandchildren smh sad","post_message":"WATCH LIVE: Electors are casting their ballots — will Donald J. Trump get the 270 he needs?"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"1721110158153806","commenter_b":"I wanna see this dumb bitch fight off an intruder in her home with a vibrator","commenter_a":"Pedro Tosta K. Nogueira","post_message":"These students are protesting open-carry laws by handing out dildos.  #Micbrights"},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"628929223957206","commenter_b":"By Bitch.","commenter_a":"And don't forget to take Rosie, Whoopi, Kanye and the rest of the we're-leaving-if-Trump-wins morons with you! Good riddance to all!","post_message":"Miley Cyrus packing her bags and taking off after trying to take on Donald Trump. Say goodbye! Good riddance. Can we get 30,000 'LIKES' to have Miley leave the country?"},{"comment_id":"1269427259813296","commenter_b":"SOME OF YOU IMBECILES SICKEN ME WITH YOUR OPEN MINDEDNESS TO ALLOW MORE REFUGEES AND WHICH ARE TERRORISTS COME INTO THIS COUNTRY!! WAKE UP UNLESS YOU WANT TO BECOME ENSLAVED TO THE RELIGION OF ISLAM AND LOSE ALL YOUR FREEDOM ,BE BEATEN,BE RAPED ,BE BEHEADED..ETC...ETC...THERE'S NO PLACE IN THIS GREAT COUNTRY FOR YOU UNTIL CHRIST'S RETURN,THEN SHALL YOUR FATE BE DELIVERED AND ETERNAL HELL AND DAMNATION WILL BE UPON YOURSELVES,NOT 72,000 VIRGINS AS YOU THINK !! THE ONLY VIRGINS YOU RECEIVE ARE THE INNOCENT LITTLE GIRLS 6,7,8,9,10 YEARS OLD THAT YOU ARE RAPING AND DESERVE DEATH TO YOURSELVES FOR!!","commenter_a":"STFU he said he does not reveal plan! STFU","post_message":"Broken campaign promise!"}]
