[{"comment_id":"10153910090484160","commenter_b":"We need to ban this evil witch!!!","commenter_a":"Ban cars. Cars kill people. Drivers carry insurance. It is a business that determines risk and the policy cost reflects that. Require gun owners to have insurance rather than taking them away, unless, of course, you really are trying to disarm the American people.","post_message":"\"Terrorists and dangerous individuals are using guns to kill Americans. We should make it a lot harder for them to do that.\"  Hillary Clinton"},{"comment_id":"10153257299639071","commenter_b":"@username another Hilidiot who will blindly vote for a woman for no other reason than wanting a female president.","commenter_a":"Let's be honest about this. The only reason they gave back access is because a court battle over this would have revealed to the public that every democratic campaign had access to those records, and when the Sanders campaign reported it, nothing was done. Which would have highlighted not only the DNC favoritism of Clinton, but of the fact that they have been working to shut down Bernie at every turn. Which would have meant public acknowledgement of Bernie actually having a chance to win.","post_message":"Bernie Sanders sued, and the Democratic National Committee backed off, but it's not over yet."},{"comment_id":"10152902010080950","commenter_b":"I am sick and tired of these calls. I get them all the time on my business phone and my unlisted home phone. Especially Google. They are one of the worst.","commenter_a":"You let them know not to call you again usually by hitting 3 but it doesn't matter as they'll call you again using another number. Most are spoofed numbers. I had my own phone number come up on Caller ID one time! there is a site that you can check out numbers, www.800notes.com to let others know about the callers but the telemarketers don't care about that site. I see a lot of people on there saying to \"Stop calling me!\" yet don't leave their number. Yes, I'm tired of the \"Lower Your Credit Card Interest\" or letting me know about a topical pain ointment. Be aware of those calling saying that they are the IRS or police telling you to pay up using a pre-paid debit card. Callers also try to tell you that your computer has issues and that they are from \"Windows\", not Microsoft. I mess with ...","post_message":"\"If [phone companies] came out with an ad, 'We're going to block robocalls,' I mean, I don't think they could handle the business they would get,\" Missouri Democratic Sen. Claire McCaskill predicted."},{"comment_id":"1364153086957478","commenter_b":"Let's hope NOT. NO MORE COMMON CORE! NO ON ROMNEY! KEEP your PROMISES!","commenter_a":"I agree.","post_message":"I wonder if Conway is behind the \"new\" Trump?  The whole \"lets leave Hillary alone\"... and \"lets talk to Mitt about being Sec of State\"... and \"lets hire a pro-common core Sec of Ed.\".....  It's getting harder to stay smiley faced.  We can only be pushed so far.  Enough of Mitt.  Dump him.  Give Rudy G. the job of Sec of State TOMORROW. Not only is he talented, but show some loyalty to the guy who stuck his neck out.  Stop making the man sweat it out, and start supporting the platform we voted for.  Walk the walk already.  @webpagelink"},{"comment_id":"535194776668815","commenter_b":"Enough reason to deny them into the USA!!!!","commenter_a":"Send them to the Obama White House when theyb return from vacation.","post_message":"***WARNING***"},{"comment_id":"10154233003321336","commenter_b":"@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"\"I've spent less money than almost anybody else and I'm in first place by a lot.\" – Donald J. Trump"},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."}]
