[{"comment_id":"496956050512713","commenter_b":"THEY SHOULD KEEP WALKING BACK TO THEIR COUNTRY .... IN OTHER WORDS ...... GTFO OF AMERICA !!!","commenter_a":"Feel free to walk back to where you came from!","post_message":"If you don't respect our country, feel free to leave.  'LIKE' if you think they should leave!"},{"comment_id":"10155091471801579","commenter_b":"Anything to shut down that lying screeching woman!","commenter_a":"She knew it was coming. It was part of her plan. It's all about playing the victim. Raising money.","post_message":"Uh-oh"},{"comment_id":"10153902791784087","commenter_b":"@username : Shattup Trump whore","commenter_a":"Perfect. No one should be above the law and it's disgusting how her supporters are okay with her getting away with it but when repubs get away with it they act like babies. I'm not Republican either, mind you.","post_message":"#BREAKING: The House Oversight Committee will send a formal request to the FBI as early as next week asking to open a criminal investigation into allegations that Hillary Clinton lied to Congress."},{"comment_id":"10154983391004138","commenter_b":"@username so all white men are evil? Racist!!","commenter_a":"Being US citizen, I was planning to leave the US for the first time ever to visit Africa and Dubia. Now I can't even leave and visit my love ones that I haven't seen them since 1996. I am Somali American who is proud to be Muslim but also love this country just like many Muslims. . We're all the children of Adam and Eve, one nation under God, we're all immigrants. Ban Donald trump not Muslims.","post_message":"Approximately 500 to 700 people gathered at Terminal 1 to protest President Donald Trump's ban on immigrants from seven Muslim-majority countries entering the U.S."},{"comment_id":"10153992023378145","commenter_b":"@username I agree completely!!","commenter_a":"Well, what do people expect when you're in their habitat take awake their habitats?","post_message":"Amazing Rescue: The mom started wrestling with the animal when she saw that her son's entire head was in the mountain lion's mouth."},{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"\"It's snowballing into something huge and is sending a message about the importance of immigrants to the economy\""},{"comment_id":"773980632650962","commenter_b":"i cannot stand that woman","commenter_a":"Why don't you just all tell the truth and say \"he's a muslim that's why he didn't go\" it's like anyone would do anything about it!","post_message":"Very painful to watch."}]
