[{"comment_id":"1057781130958942","commenter_b":"Hmmm... say the Lil bitch talking shit on Facebook","commenter_a":"Wtf that nigga a pussy how you going to slap another man and walk away straight pussy.... I would of shot that nigga since he want to duel","post_message":"The disrespect!"},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10153885914416336","commenter_b":"Because of the way, they TREAT WOMEN!","commenter_a":"This woman is totally ignorant. How many Muslims live in the US? Are they all terrorists? How many such shooting have taken place in the US? Are these all terrorist acts done by Muslims? Why dont you open your eyes and find out that all these terrorists have links with Pakistan and Saudi? Why nobody dares to say where all these terrorists come from or have link with? Why do you stamps all Muslims as terrorists?","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.”  Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"1271510422882923","commenter_b":"Momma ain't raise no bitch","commenter_a":"I love how everyone says stop snitching but if he/she dosnt snitch he/she could go to prison as well for withholding information. I dont give a fuck my freedom is worth more then their freedom sorry not sorry. *Heres a little side note i have an extreme case of dyslexia so if my grammar is terrible i apologize *","post_message":"\"What r u going to gain from it\" "}]
