[{"comment_id":"10156234250125192","commenter_b":"Nope she belongs to a group.","commenter_a":"I think a gofundme acct should be set up for HER bravery for standing up for our children. (In my case grandchildren). This testing bs in today's teaching in beyond rediculous. The \"common core\" math is crazy. My 12 yr old grandson just got a low grade in math and son in law said he doesn't understand it. There are mire letters than numbers in his math class. He is getting what we had in advanced 12th grade and it is just too difficult for that age to understand and too busy testing for tests to see what he doesn't understand. I pitty Florida kids in public school. Something needs to change before we lose more teachers like this. Please start teaching our kids to love learning and let our kids learn to love learning.","post_message":"A Polk County teacher recently resigned, citing what she calls 'educational malpractice,' resulting from too much standardized testing:"},{"comment_id":"10153838572646756","commenter_b":"I've heard people complain about steak & lobster, but not produce.","commenter_a":"Odd that many who are not on food stamps complain when those who are eligible have carts full of healthy/quality food: seafood, steak, fresh produce. It's America -where life is a competition. If you need help, you stay at the bottom.","post_message":"People who rely on federal food stamps ate about the same number of calories, but consumed fewer fruits and vegetables and whole grains and more added sugars, according to studies."},{"comment_id":"10154429082261378","commenter_b":"Yes...fix her a$$...so she can't bring any more babies in the world...","commenter_a":"Yes","post_message":"A judge ordered a drug-addicted mother of 4 who has worked as a prostitute not to get pregnant again. Is this order fair?"},{"comment_id":"556591217846893","commenter_b":"America needs alot less hate as well as banning corrupt career politicians, NWO,Open borders to fill there own greedy pockets Clinton the lieing witch with soldiers blood on her hands","commenter_a":"To all the hateful mean trolls, seriously and you call yourself an American. Maybe you skipped the part in school that teaches you to be human and love humanity. You can disagree with political views but when you just get mean spirited about a person...thats just wrong!! I think Americans need more love and a lot less hate!!!! Next time you call someone something, look into the mirror and see if you ever sinned yourself. \"Those without sin...cast the first stone\"!!","post_message":"A smiling Hillary Clinton just arrived on Capitol Hill for meetings with Democratic lawmakers. @webpagelink"},{"comment_id":"628263567364222","commenter_b":"I'll stick with Palin on this issue!","commenter_a":"Sarah Palin is just an nut","post_message":"Americans are now claiming that Sarah Palin is racist.  This is absurd. Sarah is under attack, let's get her back.  Do you support Sarah Palin?"},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"},{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."}]
