[{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"},{"comment_id":"602448696614153","commenter_b":"Racist pigs","commenter_a":"@username CHILD RAPIST LOVER!","post_message":"President Obama holds his first news conference at the White House following the election of Donald Trump.  @webpagelink"},{"comment_id":"10156072417220603","commenter_b":"Well take up not enough jobs with the people that keep letting foreigners in the country.","commenter_a":"Yall saying people should be able to support themselves are not understanding that jobs at McDonald's etc are NOT meant to support a family. If you have a job there and have a family they (McDonald's) and us (people that will take the hit of a min wage increase because the cost of products will go up) should not have to pay for your poor choices for not being mature and either going to college or tech school or working your way up in a company. Min. Wage jobs are for high school/college students so if youre past those ages and still making min. wage you should've made better choices and should stop expecting the same pay as people that did!","post_message":"Do you think the minimum wage should be raised?"},{"comment_id":"991950690936939","commenter_b":"Looks can be deceiving. The slob has way too much power and his history is terrible.","commenter_a":"How is Bannon so canny?? He always looks like he just work up in a bus stop with a bad hangover and isn't 100 percent sure where he left his pants.","post_message":"Trump's aides also reportedly don't know how to properly turn the White House lights on and off."},{"comment_id":"1501291303224228","commenter_b":"@username one of the Deplorables. He quotes Breitbart. You instantly lose all credibility; and can't be taken serious. Here let me fix this for you...... @webpagelink","commenter_a":"Nevermind the Democrats who are actually poisoning the people of Flint, right?","post_message":"“Mr. Trump, I invited you here to thank us for what we’ve done in Flint, not give a political speech,” the pastor said."},{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"}]
