[{"comment_id":"1276333032401449","commenter_b":"And your first lady has a dick","commenter_a":"Haters are real, she is beautiful as fuck with a clown ass husband, I enjoy having a crazy First Lady because I DONT GIVE A FUCK ABOUT A FIRST LADY! STAY FOCUSED ITS ABOUT VOTING FOR THE PRESIDENT NOT THE FIRST LADY YOU FUCKS!","post_message":"This HAS to be said!"},{"comment_id":"815801661894546","commenter_b":"Kick them out of this country","commenter_a":"If you don't like the American flag, pick one you do like..... and move to that country you bunch of losers.","post_message":"Absolutely appalling."},{"comment_id":"10152759669890779","commenter_b":"let me tell you what happin to RED ASS.","commenter_a":"Today is your birthday? What's today?","post_message":"Twenty years have puff-puff passed since the stoner comedy Friday lit up movie theaters and became not just a cult sensation but a bona-fide classic. Ice Cube spoke with us about the success of the movie, the \"Bye Felicia\" meme and why the film is so beloved. \"It's cool – get high and all that – but the movie is memorable because it's the day that the bully got his ass whooped, and everybody loves that day.\" Click through for the full interview."},{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"977678122350240","commenter_b":"Hillary is NOT with us, we are NOT with her.","commenter_a":"The Revolution!!!!! Bernie !!!!","post_message":"Bernie or Bust rally in downtown Philadelphia"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."}]
