[{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in.   Should parents have taken kids out of school for the parade?"},{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"10154979828776729","commenter_b":"Is a mean evil witch all she wants to do is kill us Americans in line her Pockets with more money how can she even be running for president? What is this country turned into?","commenter_a":"Bet she has an allergic reaction tonight !","post_message":"Holy cow!"},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"10155091022728734","commenter_b":"Look at these white American men!! Hahahah! Look at these savages","commenter_a":"Disgusting","post_message":"A 37-year-old man has been arrested after allegedly trying to pay a mother to have sex with her seven-year-old daughter."},{"comment_id":"1722780531335461","commenter_b":"That's what my husband says, so why does he get to run.","commenter_a":"@username, answer the question - how can Ted Cruz run for President and be born in Canada.","post_message":""}]
