[{"comment_id":"1779215949028239","commenter_b":"#Fuckhillary #Neverhillary #Nevertrump","commenter_a":"#neverhillary","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief.  More coverage on @webpagelink"},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"},{"comment_id":"10154327870086509","commenter_b":"If they did who cares cnn enjoy the holidays merry Christmas to the Muslim world . Leave cnn racism behind .","commenter_a":"and lovebirds don't own February. So wtf is your point?","post_message":"\"Christians don't own December,\" one atheist writer says."},{"comment_id":"10153216182159087","commenter_b":"Your FAILED IRAK WAR, for one, you stupid evil BITCH...","commenter_a":"Hey, Obama, WHY don't you have any decent responses on your EVIL warmongering failures around the world?... just cowardly U.S. policies... your shamed administration should at least stop being so hipocritical...","post_message":"“We can’t have no response,\" says Michael McCaul. \"And this administration has absolutely failed to put any sort of consequence on their actions.”"},{"comment_id":"10153598743328984","commenter_b":"We need a MUCH STRONGER policy for Illegals. These two should be Executed then they will not sneak back in the Country!","commenter_a":"Her family should sue the dept. Of immigration!","post_message":"While this 41-year-old grandmother and nurse slept in bed, she was tragically robbed of ever waking up. Our thoughts and prayers are with her family.   Do you think more needs to be done in the U.S. to prevent this from happening?"},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians.  The Mind Unleashed"},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."}]
