[{"comment_id":"948311541870934","commenter_b":"If they want to live in our country then they need to live by our laws. Things should not be changed to accommodate them! If they don't want to live by our laws they should live elsewhere! We have to abide by the laws...so should they!","commenter_a":"I don't think so .. Not in Fla","post_message":"This state is allowing burkas in driver license photos!  THIS SHOULDN'T BE ALLOWED IN AMERICA..."},{"comment_id":"1038864972829192","commenter_b":"Children would suffer if women were drafted.","commenter_a":"#getridofthedraft","post_message":"Thoughts?"},{"comment_id":"1035142053187556","commenter_b":"Either sit quietly or shoot em. Dont bitch until they get pissed to","commenter_a":"I know the cops were doing wrong but for fuck sake shut your damn mouths and calm down and shit wouldn't escalate","post_message":"WTF! Just because they \"smelled marijuana\"??? Full story here: @webpagelink"},{"comment_id":"10153918680501116","commenter_b":"Mexico take Texas, we will throw in the theocrats for free!","commenter_a":"So much for Hamilton and Madison's half baked notions about \"representative\" government. How I wish California would secede from this corrupt Union...","post_message":"But Republicans are sticking with him."},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news.  No riots, no protests, no media coverage.   Do you think he should be charged with a hate crime?"},{"comment_id":"1705293566392359","commenter_b":"Not only is she racist she has a chip on her shoulder against whites. She has done very well in this nation and it took whites to get her where she is at! Ungrateful bitch.","commenter_a":"Liberals always resort to name calling. They can't come up with a rational argument. Help Oprah go away don't buy anything of hers and don't watch her. She will then be loving whites. She's a sad woman.","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."}]
