[{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming.  The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"546785352178711","commenter_b":"Hey Cliff f u bitch.","commenter_a":"Hey @username go f yourself.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down.  She is in trouble. Let's show her our support.  Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"10153185005136323","commenter_b":"@username how can you possibly call immigration colonisation? I am an immigrant to this country and I have no intention of imposing my way of life on every person living here or subjugating the \"indigenous\" people of this land. I think I can speak for the vast majority of immigrants in saying that they also do not intend to do so. Most immigrants integrate into society. Perhaps you just don't like the way they look like. As was stated before, Britain is 85% white. All these people fearing that this country is swamped by brown and black people, Eastern Europeans and other pesky foreigners need to get their facts together. Moreover, study after study has proven that immigration is indeed beneficial to the British economy. We may also not forget that Britons emigrate to other countries in large numbers. This is not a one way street. Immigration is part of ...","commenter_a":"For a country whose language is a mix of old german, latin and celtic language, i'm laughing. In the past, Brits never had any issue with colonizing Australia our the US and imposing their culture (or \"civilization\") to the native populations. That's so ironic !","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"10154348215444609","commenter_b":"You only want your daughter to learn to suck dick?","commenter_a":"This is very wrong. If someone like same sex that's cool jus don't teach my child about it!!!!","post_message":"In case you missed it: Read about these newly approved changes in classroom instruction, put in place to comply with the nation's first law requiring public schools to include prominent gay people and LGBT rights milestones in history classes."},{"comment_id":"1723070871241628","commenter_b":"The Republican party better start listening, the real American People are speaking LOUD AND CLEAR!!!! WE WANT DONALD TRUMP!!!!","commenter_a":"Trump 2016!! The GOP is fighting for his failure, they should unite and back our choice. We need a smart President with common sense can build and secure borders, create jobs and a better future for the USA and puts the American people first. That man is Mr. Trump, lets do this!","post_message":"Thank you AMERICA! So grateful for your support- as we work EVERYDAY to MAKE AMERICA GREAT AGAIN! En route to Wisconsin now!"},{"comment_id":"10153224075406336","commenter_b":"I'm upset about it too, but let's take a look at our current President. He's stomped on the US Flag toward other nations apologizing for Americas stance for years on policy. He just keeps stomping and we just keep believing lies and hypocrisy.","commenter_a":"What a disgrace to our country!","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"861173230647951","commenter_b":"She is crazy","commenter_a":"Just 12 years? WTF","post_message":"8-year-old Julie died the same day she was going to be a flower girl at a wedding. Her mom has admitted to killing her daughter."}]
