[{"comment_id":"331807290546859","commenter_b":"Dump trump and his bitch wife","commenter_a":"trumpers are ALL bullies! Only bullies attack a man 4 against 1, not to mention punching a poor old dog.... Their mothers must be so proud","post_message":"Trump, your 'bad hombres' are right here.  Shared by Occupy Democrats. Video credit: ABC 7 News - WJLA."},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"1238572816162746","commenter_b":"...aaaaaand to jail this woman will go.","commenter_a":"A real action star. Give him an oscar award!","post_message":"Watch the moment a suspect hit an officer's car with her SUV during a high speed chase. The officer escaped with only minor injuries.  Full story: @webpagelink"},{"comment_id":"1358974884162256","commenter_b":"All these fat women suddenly come in and attack her breasts? Like, I can see the v necks but in this day and age, you call that too much? Stay jealous.","commenter_a":"You look amazing! Good for you!","post_message":"She was drinking four litres of Coca-Cola a day  (Via Daily Mail Australia)"},{"comment_id":"10152555972045667","commenter_b":"They will make some inmate a great bride.","commenter_a":"Despicable fools.","post_message":"Former Vanderbilt University football players Brandon Vandenburg and Cory Batey were found guilty on all counts for the 2013 campus rape of an unconscious woman."},{"comment_id":"758642314270568","commenter_b":"@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""}]
