[{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"2033407076758008","commenter_b":"Ghetto Trash !!!!","commenter_a":"Why would the \"demoncrats\" dump Brazil's ... nah ... to start with she's black like ODUMBER and after all she fits right in with CROOKED KILLERY ...","post_message":""},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and \"minds\" of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"10153223168071509","commenter_b":"The Christ is real but Roman Catholicsm is a Pagan Religion I think","commenter_a":"Hopefully they are totally different from the other out of touch cardinals we now have .","post_message":"For the second time during his papacy, Pope Francis has announced a new group of bishops and archbishops set to become cardinals -- and they come from all over the world. @webpagelink"},{"comment_id":"1067484166661144","commenter_b":"Ignorant woman!","commenter_a":"traitor","post_message":"VIDEO: Congresswoman Stands Up For Sharia Law And Actually Gets This Disgusting Response."}]
