[{"comment_id":"10154083522298352","commenter_b":"Stupid Bitch shit like this makes me sick","commenter_a":"Hang Her High","post_message":"MOTHER ALLEGEDLY ARRESTED FOR POSTING HER BABY ON A LEASH EATING DOG FOOD AS HER \"NEW PET\"  READ & COMMENT BELOW:"},{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."},{"comment_id":"10153178663173854","commenter_b":"i think this has been going since christ was born these people have been fighting all this time","commenter_a":"Yes Sir on that one! God bless you","post_message":"Rev. Franklin Graham: Imagine the Outcry if 21 Muslims Had Been Beheaded by Christians"},{"comment_id":"1508345139225610","commenter_b":"His wife has his balls..","commenter_a":"SEE THIS IS THE SHIT THAT HAPPENS WHEN WE APPEASE TERRORIST SUPPORTING NATIONS JUST LIKE JMMA(THE PEANUT BRAIN) CARTER AND BILL(I DID NOT HAVE SEXUAL RELATIONS WITH THAT WOMEN) CLINTOOOON DID,, NOW OBAMA IS DOIN SAME THING BUT THIS TIME HE HAS LET THEM GO NUKE,,,THEY PLAY WITH US BECUAS ETHEY KNOW OBAMA DOESNT HAVE THE BALLS TO DO ANYTHING SAD","post_message":"JUST IN:"},{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"1489236791096346","commenter_b":"Only 7% of the illegal aliens work in the fields, most work in the construction jobs, fast foods etc etc. 95 million unemployed americans need jobs, deport all illegal aliens and open up jobs for citizens not criminals.","commenter_a":"Hey Trumppets if you need a job...go apply in the fields....there's always jobs available! You got a teen that needs work, send them to pick out in the fields....give them those American jobs you ppl keep claiming immigrants are taking away!","post_message":"Donald J. Trump doubled down on his stance on immigration this week. Here's a breakdown of U.S. immigration by the numbers.  Read more about Trump's immigration speech: @webpagelink"},{"comment_id":"621932114627042","commenter_b":"NO MORE POLITICIANS. OR WORSE, A POLITICIAN/LAWYER #TRUMP2016","commenter_a":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. DETAILS: @webpagelink","post_message":"UPDATE (4 PM): In addition to the town hall, Donald Trump will also hold a rally at the David L. Lawrence Convention Center Wednesday evening. ---------------------------------------------- The Donald is coming to Pittsburgh."}]
