[{"comment_id":"1300696676663751","commenter_b":"Fuck yo bitch ass fuck you too pussy","commenter_a":"Fuck Donald Trump orange ass","post_message":"Clearly wasn't feeling the jersey!  #WSHH #WakaFlocka"},{"comment_id":"1765714417015228","commenter_b":"You girls sound like that reporter that went over there to prove her point and got killed by them. LOL","commenter_a":"Totally believe women should be able to wear burkas as part of their religious dress, same for the Jews and their hats, etc. This is disgusting.","post_message":"The bill wouldn't just prohibit Muslim women from wearing burqas or veils in state driver license photos, it would also ban them from covering their faces while driving and possibly while on any public property."},{"comment_id":"10154028098571336","commenter_b":"Yeah whatever, clueless lady.","commenter_a":"Oh come on....Carson, a very good man, has hardly run much of a campaign. If your campaign can't get traction, it's not someone else's fault!","post_message":"\"A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the Obama administration?\"  Dr. Ben Carson slammed Ted Cruz's campaign over allegations they told Iowa caucus-goers Carson was planning to leave the race."},{"comment_id":"10154230150699411","commenter_b":"Bastard british dog ottoman sunnis was wrost enemy of wahhabi saudis.check your history motherfucker.your resourceless England speard wahhabism all over world by supporting saudis.check your own history!muslim world is uniting when we unite your britain have large number of street beggars.your Uk have only tourism!end of Uk signs apeared yesterday when English team beat by West Indies!haha","commenter_a":"At least it's not as bad as the destruction of the Giant Buddhas of Bamiyan, or the mass destruction of priceless World treasures like the Hindu, Buddhist & Sikh Temples in India or the destruction at Palmyra!! Sunnism is the World's problem!!","post_message":" vandalism"},{"comment_id":"10153816221001336","commenter_b":"It will be a great day for America when this guy is out of office!!!!","commenter_a":"Not so breaking news","post_message":"Breaking News: President Barack Obama has rejected the Keystone XL pipeline.    In a press conference a short time ago, he said, “If Congress was serious about wanting to create jobs, this was not the way to do it.”"},{"comment_id":"577625642398915","commenter_b":"I was going to say not everything you see/read on the internet is true- A very nice friend once told me that- so...where's the link to the factual article or video or actual statement? You can't believe it just because somebody posted it & made a meme out of it!!!😐","commenter_a":"At least at this election I will not be voting for a party that would take such a pledge and perhaps n ever will again.","post_message":"Republicans have been plotting to obstruct Pres. Obama since the day he took office, and now they have the audacity to ask for your vote this November.   Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"437802309734983","commenter_b":"Wes spoken like a true submissive little bitch. Now go stand in the corner like a good little boy","commenter_a":"Hooray! Now, remove them immediately starting with Ferguson.","post_message":"President Obama is taking a necessary, bold step."}]
