[{"comment_id":"1301581083201877","commenter_b":"This guy is pushing an agenda !!!! Creepy","commenter_a":"Mercy","post_message":"Really? Maybe if Christians had more walls, the Muslims wouldn't have conquered the Middle East and large parts of Europe from the 7th to the 10th centuries."},{"comment_id":"517382478450045","commenter_b":"Anyone know whats happening in Europe? Muslim takeover. By sheer numbers they are over running countries and residents are falling back on rioting to fight the takeover. Muslims come into a country and this usually ends up in war and destruction of lifestyles and sovereignities. The US would be better off without them sad to say.","commenter_a":"They have NO BUSINESS in our Government!!!! Stop Muslim Take Over!!!!!!","post_message":"This is not unexpected. Click to Read ALL the SICK Details..."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"897791007078142","commenter_b":"Shes ugly","commenter_a":"Gosh is she going to lose in PA again?","post_message":"Hillary makes disturbing announcement about development in Pennsylvania. We could be looking at history right now. Will you refuse to let Hillary be your president?"},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"10152792831586130","commenter_b":"Nasty booby feeders??? Really thats ignorant! Howbabout you eat on a damn toilet and tell us how that goes","commenter_a":"Do that in private...how is that difficult?! Restrooms...everywhere!","post_message":"In a time when women are often shamed for nursing their children in public, it's good to know that one of the world's most influential leaders is in support of breastfeeding mothers."}]
