[{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"862770227128920","commenter_b":"Ted Cruz loves our country Hilary hates our country and all true Americans!! I would never vote for her or any Dem.","commenter_a":"Yes!","post_message":""},{"comment_id":"10153659904056770","commenter_b":"PEOPLE GUESS WHAT SHE WORKS FOR HILLARY NOW...","commenter_a":"Interesting Demcratic take on LGBT, since it's rumored that Hilary herself might fall into this category!","post_message":"Recently leaked emails from the Democratic National Committee revealed staffers had some less than LGBT-friendly comments."},{"comment_id":"865998906849825","commenter_b":"godless atheists,satanists THIS FUCKIN FUSE OF LOWLIFES WILL END SOON","commenter_a":"When we start seeing these statue like this around America , that means the devil have claimed this land, God is coming back soon ppl be warned","post_message":"Florida Agrees to Distribute Satanic Temple Materials To School Children"},{"comment_id":"652127268253788","commenter_b":"To you Mrs. Michele Obama I say name me just one all white college. I am not racist, I do have several black friends. Being white of course I do have more white friends, then black friends. They seem to under stand my point. But for blacks to say they can't go here or there. I don't see those barriers. I wish we all can stop this racist name calling g and pointing fingers, at each other. I know I can name at least 4 black colleges. I just want to know if anyone can name me just one all white college.","commenter_a":"why is she there? go home & drink some tea","post_message":"A race baiter who is not proud of her country."},{"comment_id":"1218431098240658","commenter_b":"May be time for this earth to be cleansed ethnically.... all with religions other than HUMANITY should be wiped off...","commenter_a":"When will it all fcking stop!!! I think when religion stops their will be peace once again","post_message":"BREAKING: Russian ambassador shot dead in Turkey by gunman screaming 'We die in Aleppo, you die here'"},{"comment_id":"908423465917375","commenter_b":"And all this time the US is an OLIGARCHY","commenter_a":"Never could understand how socialist was an insult to Americans","post_message":"Do they even really know what that word means?  Image by Occupy Democrats, LIKE our page for more!"}]
