[{"comment_id":"10152487852365927","commenter_b":"Maybe your parents should have aborted both of you!!","commenter_a":"Hang them together.","post_message":"They're PROUD!?! Wow..."},{"comment_id":"10153941813117042","commenter_b":"Cuz is not her child . evil face.","commenter_a":"My child is 8 n very timid n shy. The minute i find out some one hurt her in any way. God help them cause ima go after them.","post_message":"A day care director was caught on video hitting a child with toys. But then it gets even more disturbing from there.   Warning: Police described the video as difficult to watch."},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"10153996640170326","commenter_b":"Illegal aliens have Constitutional rights?","commenter_a":"Why is it every time Donald gives a semi sane speech, the media says he's pivoting? How many times is this now? His speeches are the same old thing. I'm going to build the wall. I'm going to ban Muslims. I don't care about constitutional rights. I will trample over all those that oppose me. I will be ruler of America!","post_message":""},{"comment_id":"541211179416415","commenter_b":"hey Trump when you talk about the refugees, can you name every refugee groups that lives in the United States and what kind of jobs they have to work to feed their family and children? BTW, every refugees family's that moved to United States are helping out U.S. economy by working at those places where no white man can stand to work there, also they are paid with minimum wage without complaining. so be grateful and welcome them to come and live in the United States, especially the Karen refugee.","commenter_a":"Mr Trump the solution of the conflict between Israel and Palestinians can be very simple America and Europe should stop sending billions of dollars to Palestinians so the Palestinians know that when they get up in the morning if they want to eat they have to work and not killing the Jews!!","post_message":"We’re going to come together and come up with solutions- and so far I cannot believe how civil it’s been up here! #GOPDebate"},{"comment_id":"10153285157239205","commenter_b":"Ignorant bitches 😂😂","commenter_a":"@username time to move for me 😂😂😂","post_message":"Trump Should Probably Start Fact-Checking His Retweets"},{"comment_id":"10152736026831051","commenter_b":"Liberal logic - Ban guns because you can call the police but the Police are Militant racists that can't be trusted so who are we supposed to call again? Ban all guns in the U.S. it will make us safer but keep the borders open so when the black market opens the guns can flow in like water. On an ending note; Police are in no way obligated to protect you from any threat per the Supreme Court so I guess when they do show up they can draw that chalk outline around your fresh corpse.","commenter_a":"Blah blah blah bullshit bullshit bullshit out of all the diehard ammosexual blowhards who love their guns. Europe doesn't have the problems we have in the country with guns. Neither does Canada or Australia. You want to believe what you want to believe. Follow the money. It's the NRA who wants you to keep your guns and fills your head with nonsense that you're just too willing to believe because you have no balls and tiny dicks. Try thinking about things instead of just buying into the rhetoric. The USA is safer now than at any other time in history. Why do you need them? Why focus on fairy tales like imagined revolutions against the government instead of focusing on things that are ACTUALLY happening like kids being killed in schools by LEGALLY OWNED GUNS.","post_message":"A company that worked on ‘Taken 3’ with Liam Neeson didn’t take kindly to his comments about the U.S."}]
