[{"comment_id":"10154241809909411","commenter_b":"@username yes they can. They feel more comfortable in turkey then Europe. Lots of racist people giving them dirty looks in Europe.","commenter_a":"Europe should consider making a deal with Greece rather then Turkey who is playing its proxy war over Refugee crisis.. European Parliament Greece is honesty and has no evil or greed sort of motive behind this cause. They can handle refugees better then turkey. Who by the way is taking advantage of the European Parliament by making a deal and asking a free hand to strike and bomb Kurds who are basically fighting ISIS which turkey is making it hard for kurds by attacking them and making it easy for ISIS to freely invade other save areas of Iraq and Syria..","post_message":"'People detained on Lesbos and Chios have virtually no access to legal aid, limited access to services and support, and hardly any information about their current status or possible fate'"},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"1758550144422291","commenter_b":"73% approve and still got 4 more months. Dam fine job sir! Hillarys new add kids are watching is stupid thats all she has. Ok hillary kids are watching as you say who cares soldiers are dieing! What a piece of garbage she is time to take out the trash Trump we love you. Voters get out and vote Trump 2016","commenter_a":"Finally a strong leader to be. Mr Trump a country with no borders is not a country. Make America great again.","post_message":"I will not let this country down. I am grateful for everything I have ever been able to accomplish. I want to give back. I want to MAKE AMERICA SAFE & GREAT AGAIN!  -DJT"},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"1718806018406509","commenter_b":"Illegals!!! Bahaha","commenter_a":"Chicago doesn't want trump, we aren't gonna deal with his jokes","post_message":"Protests continue after Donald Trump's UIC rally is canceled for security concerns: @webpagelink"},{"comment_id":"1692614590979428","commenter_b":"you have to take care of Americans first..children, the homeless, our Veterans. why do our taxes go to m.f. illegals??????","commenter_a":"Come on congress stop stuff like this. He must to have your ok.","post_message":"Obama's budget sets aside $17,613 per unaccompanied minor that illegally crosses the U.S. border."},{"comment_id":"10153569563806051","commenter_b":"They should be sent back where they came from ASAP !!! End of that story !!!","commenter_a":"Please do some research. What does your state actually offer in the way of public assistance to noncitizens? In California noncitizens are not eligible to cash assistance or Calfresh (foodstamps). No Social Security or Medicare without legal residency. So just what are you haters talking about? I hope none of you ever find yourselves in a financial situation which would drive you away from your home in order to survive. I hope you don't call yourself \"Christians\" because you are so far from the core of that belief.","post_message":"Should illegal immigrants be banned from receiving Obamacare subsidies? That was far from the case in 2015."}]
