[{"comment_id":"1234498396590570","commenter_b":"Carole, keep your day job and drop the politics. You're a suffering liberal.","commenter_a":"This is big news because conservatives want you NOT to notice that the economy is way up, the deficit is way down, unemployment claims are at a 42 year low, and Obama has unprecedented world approval. So Obama has almost rescued us from the disaster the Republicans left us when Bush was in office. But don't notice that stuff, focus on bathrooms and what Muslims are doing in countries you can't even find on a map.","post_message":"#BoycottTarget  #PRDisaster #TalkIsCheap"},{"comment_id":"10153218585709614","commenter_b":"You're right .... She probably knew he wouldn't leave his wife ... She needs death penalty ....","commenter_a":"Her \"married boyfriend\".... So 1 baby couldn't keep him, she needed 2??","post_message":"This 3-week-old baby, kidnapped and discarded in a trash dumpster, was the innocent pawn in an \"evil\" woman's elaborate plot to convince her married boyfriend that she had given birth to his twins, police said.  Giseleangelique D, 47, of Thousand Oaks allegedly sought out young mothers under the guise of a charitable organization looking for women with 1 to 2-month-old infants to assist.  That's how D found Eliza Delacruz, police say. She allegedly stalked the infant's mother and then had a co-conspirator snatch the child. Three other people were also arrested in the alleged plot, which includes an attack on another mother and child in El Segundo.   What investigators say they can't figure out is why 3-week-old Eliza was killed.  Read KTLA's story here: @webpagelink"},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""},{"comment_id":"1352047571524023","commenter_b":"Lock her up","commenter_a":"Merry Christmas from Michigan","post_message":"Pat Dollard LIVE! The secret Truth of Obama"},{"comment_id":"10155459480226729","commenter_b":"Illegal peoples was unexpected to immigration live our homeland your said them all to their ear daft.","commenter_a":"Mexico’s Enduring Legacy of Failure If Mexican President Enrique Nieto truly believes Donald Trump is a bigot for not welcoming millions of medically and criminally unvetted illegal aliens with open arms and a check made out to \"cash\", then why does Mexico have stricter immigration and foreign work laws than \"racist\" America? Every civilized nation recognizes the absolute necessity of securing their borders and maintaining the integrity of their immigration programs. It's the type of common sense that requires no apology or gratuitous reminders. Perhaps if the Mexican government wasn't so adept at destroying its own country with an endless cycle of incompetence and corruption, their own flesh and blood would not be fleeing their native homeland with nothing but the clothes on their back. And yet these are the same hypocrites who have the nerve to denounce America as greedy capitalists; that transcendent beacon of liberty, opportunity and prosperity ...","post_message":"If there's one thing I truly despise about the progressive socialist left it is their blatant hypocrisy.   One of the fall back positions for the left is always the 14th Amendment's \"equal protection\" clause. In the case of Obergfell vs Hodges (same-sex marriage) the SCOTUS ruled that marriage was an individual right and States must conduct same-sex marriages, making it the \"law of the land\" as many say.   Now, with the executive orders of President Donald Trump on illegal immigration, the liberal progressive left is again decrying the 14th Amendment's equal protection applies to anyone within the borders of the United States.   Well, based upon this, I will henceforth be carrying my concealed weapon anywhere within the borders of the United States.   Look, if all of a sudden, two men and two women have the right to be married anywhere in America, and if folks here illegally have constitutional protections, then my constitutional second amendment right to keep and bear arms shall not be infringed. You know...equal protection.   So, there it is, I just saved Congress a lot of work. Law abiding legal American gun owners can travel anywhere they want with their concealed carry permit. If we can't, then no same-sex marriage -- and no rights and protections for illegal aliens.   End of class."},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""}]
