[{"comment_id":"10153216649359705","commenter_b":"Heterosexuals have rights to same sex bathrooms","commenter_a":"PA-THE-TIC! Only country in the world that does this garbage!","post_message":"White House staff now have access to an all-gender bathroom. Here's why it's important."},{"comment_id":"1742230942710926","commenter_b":"Hillary can't speak without a Telepropter... She has no clue what tk say. Her speech pattern, body language, facial expression..etc. fake","commenter_a":"There is such a HUGE difference in the way Hillary speaks up to Americans and the way Trump talks down to Americans!!!! I am excited to see her win this!!","post_message":"History made. hrc.io/1YesHYS"},{"comment_id":"10153888455618128","commenter_b":"That's what happens when power vacuums get filled.","commenter_a":"And how did they get so strong in Iraq while you are president?.....exactly","post_message":"President Barack Obama said Islamic State had lost about 40% of the populated areas it once controlled in Iraq. “And it will lose more,” he said."},{"comment_id":"10152785175031051","commenter_b":"Headbutt got her an ass whipping-lol","commenter_a":"I can't believe I watched this. I liked the headbutt though. lol","post_message":"It started out as an ordinary day at Walmart. Then, without warning – all hell broke loose."},{"comment_id":"10153061426624411","commenter_b":"In prison in U.S. A child killer is gang raped and beat to death they hate child killers !","commenter_a":"Well it sparred prisoners a job of having to kill her. Deserves to die child killer!","post_message":""},{"comment_id":"10153039868668984","commenter_b":"Bitch....","commenter_a":"Filthy rich don't need any more money but their filthy greed demand more and more.","post_message":"I can't believe she did this. There are plenty of people out there who would kill for even a small fraction off that money...."},{"comment_id":"10153035820806770","commenter_b":"she can't even lead her servants...","commenter_a":"now she wants to bring in people to vote for her......","post_message":"Democratic presidential candidate Hillary Clinton told “Face the Nation” host John Dickerson Sunday that she hopes the United States will “lead the world” and take in 65,000 Syrian refugees over the next year."}]
