[{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: \"Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"\"Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.\"  MORE..."},{"comment_id":"10154426292152431","commenter_b":"Sending smoke for Jim's family and friends","commenter_a":"Loved his stories!","post_message":"Jim Northrup (1943–2016): Beloved Ojibwe Author, Poet, Marine Veteran Walks On  @webpagelink"},{"comment_id":"10153152969586955","commenter_b":"She'll never be president.","commenter_a":"She's going way down in polls.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10153807094811336","commenter_b":"Maybe this woman wants the truth about Hillary's evils be known .","commenter_a":"Fox news keeps exploiting this poor woman","post_message":"“[Hillary Clinton] lied to my face at a very, very hard time, and she’s been lying since.” – Patricia Smith"},{"comment_id":"10155146081185725","commenter_b":"I would never allow a nun within a telephone poles reach of me! Hahahah","commenter_a":"At least the club is consenting adults! Not a priest on scared little boy! Protest that instead you concrete vagina bitches!","post_message":"A group of suburban nuns is suing a neighboring strip club for the second time. What their complaint is this time --> @webpagelink"},{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."}]
