[{"comment_id":"10152804674496094","commenter_b":"Can't wait to put the clothesline back up...hard to hang dry all the time when you're in a deep freeze for several months of the year.","commenter_a":"Lets force them!","post_message":"Human beings are highly adaptable, but even in the face of climate change, many remain unwilling to do more than tweak their current lifestyles."},{"comment_id":"802250076569145","commenter_b":"You two should be sterilized","commenter_a":"Here comes the next Republican Party split. The birth of idocracy, with trump being the first idiocrat. All right America... Goodbye.","post_message":"On the morning after #SuperTuesday, one thing is clear: the GOP is at a crossroads."},{"comment_id":"1104058139606442","commenter_b":"Not a politician but an accomplished business man, with a reputation for getting things done right! he's got my vote and the illegals can build the F-N wall for trespassing and then get their a** on the other side. And all those anchor babys adios amigos","commenter_a":"Why did you cut him off? He was still talking. That's very disrespectful. You do that again and I will unfollow this page.","post_message":"GOP DEBATE  Watch Donald Trump affirm his commitment to not only building a wall on the US/Mexican border, but making MEXICO pay for it."},{"comment_id":"1056498011103708","commenter_b":"Build a wall and if they want to come into England charge them 1000 pound per day to enter","commenter_a":"If Westminster ? allows a second Scottish referendum then fine but along with there departure goes the and our submarine base etc you can't have your cake and eat it. ?","post_message":"The UK is crumbling"},{"comment_id":"1190297117696296","commenter_b":"What did she do ? Omg we're in trouble with these idiots able to vote.","commenter_a":"Shut up Bob Marlee's sister!!! BLM lol","post_message":"Let's Talk... tonight's debate. We're live at Union Square asking people to sound off.  Be sure to watch The Countdown: Hofstra Debate at 8pm here on Facebook and @webpagelink/  We'll have live coverage of the debate at 9pm here: @webpagelink"},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"10153904359188717","commenter_b":"@username no. The difference is Michelle has brains and doesn't pose nude like some bimbo.","commenter_a":"He takes the stage and introduces his wife who delivers a plagiarized speech.","post_message":"#ICYMI: Donald Trump's WWE-style entrance to the Republican National Convention last night was epic. Take a look: @webpagelink"}]
