[{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"},{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"1159441540761968","commenter_b":"Vote for Trump, he is the only one that will build the wall!!!!!!","commenter_a":"WTH?? Since when has this become acceptable? Build the Frigin wall!","post_message":"ILLEGALS.... ILLEGALS... ILLEGALS... They are terrorists.  @webpagelink"},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"},{"comment_id":"452480794942501","commenter_b":"She's still a bitch! Stfu bitch!","commenter_a":"Fu:-)k her!","post_message":"Should We Ban This Word To Please Michelle?  Comment 'yes' or 'no'."},{"comment_id":"10153140603601051","commenter_b":"Shut up bitch [Lizzie] !!!","commenter_a":"I believe you were given an explanation...if your son didn't understand, you sure did and should have suggested he put it on the wall or door of his bedroom. You are the parent.","post_message":"This mom didn't think anything would happen when her disabled son displayed something in his window. A few days later she got a letter from her community's management company: Pack your things and leave."}]
