[{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"10156681236645354","commenter_b":"Go Donald Trump make America great again Let's take our Country back Ban muslims God be with you and Stay Safe.","commenter_a":"Trump did NOT say Muslims should wear special ID badges. Clever editing by a hostile press invented that.","post_message":"Fox News Invites Anti-Trump, Hitler-Citing, Muslim Advocate to Join GOP TV-Debate"},{"comment_id":"10157050589675206","commenter_b":"Ok girl","commenter_a":"Nuts!","post_message":"“We are lucky that we have this son who loves Prophet Muhammad that much.”"},{"comment_id":"10153733713798984","commenter_b":"Amen. And with the way that woman looks, she'll be working the counter at McDonalds.","commenter_a":"If you can't or won't do what your job requires, then find another job.","post_message":"The husband of Kim Davis wants to send a message to the judge who jailed his wife, and he only needs six words to do it. He is not at ALL happy with what is happening to Kim, but it is clear that he and his family are not going to back down from their beliefs.  Do you support Kim Davis and her family?"},{"comment_id":"1374679629226158","commenter_b":"No they are NOT normal. Maybe they are from his neck of the world but the Western world not so much. England needs to wise up and get rid of him and the rest of the muslims that are taking the country over before its too late.","commenter_a":"Can't stand this guy what is he doing in US???","post_message":"The new normal."},{"comment_id":"1087648897921955","commenter_b":"Strange how our country hasn't been blown to pieces if all these Muslims are strapping bombs to themselves. I see your high school education didn't get you far. Must have been a sympathy pass..","commenter_a":"Send these filthy vermin back to the cesspool they came from","post_message":"The project was \"totally different from anything the government has ever done,\" Immigration Minister John McCallum said Wednesday."},{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"}]
