[{"comment_id":"10153335080543487","commenter_b":"@username - actually that's what women think but if you're not paying attention, between sitting down and standing up, sitting down is far messier.","commenter_a":"They should also sit down to piss. In solidarity.","post_message":"From our archives: An ethicist explains why he and his fiancee rejected this centuries-old tradition."},{"comment_id":"911829685530326","commenter_b":"She is a pig!!","commenter_a":"Sickening!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":""},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"689502327907012","commenter_b":"Such an amazing message.","commenter_a":"Amen..and yay for them for standing their ground! I love them,and the show.","post_message":"Obama didn't want them not to talk about Christianity on TV, so they did this instead. In America we have freedom of speech. Let's show them our support. Can we get 175,000 'LIKES' because they refused to censor their faith?"},{"comment_id":"793441997371016","commenter_b":"If they don't want to be detained. The scum should not steal. We pay for that! We need to get tougher on criminals","commenter_a":"Don't break the LAW!!! Then resist as well! Quit sticking up for criminals. This lady is an idiot to begin with don't do the crime. Choices... Make the right ones or like anyone else suffer the consequences from your choices. Maybe crime will go down if we actually don't try to protect the criminals and support our police forces. Remember enforcing the Law is for our safety. So for all you law breakers don't break the law if you don't want to take the risk of suffering the consequences.","post_message":"RAW VIDEO: A shopper claims she caught security guards at a Chandler Walmart putting a suspected shoplifter in a chokehold.  She took the video below on her cell phone. You can hear the woman shouting \"I can't breathe. I can't breathe.\" She then appears to be passed out on the ground.   Do you think security was too rough, or just doing their job?  FULL STORY: @webpagelink"},{"comment_id":"10153840102456523","commenter_b":"Your ignorant Jessica. Just Stfu","commenter_a":"Gang members shoot people to they do drive byes or just randomly shoot somebody it could be any if us blk kill blks latinos kill latinos white kil whites wow only in America","post_message":"The graphic video shows the three men listening to music, and a man in the front passenger seat holding the phone.   Suddenly, the phone drops to the floor of the car as what sounds like at least 30 gunshots can be heard in the background."}]
