[{"comment_id":"10153441968716756","commenter_b":"Then by your logic no couple on the street should be holding hands or kiss, or hug. You can't just say keep it to yourself. That has been the norm for years. They are tired of hiding. They want to be free like you and me. They want to walk down the street holding hands, they want to marry and they want you to keep your personal preferences to yourself.","commenter_a":"I don't care who you marry Just don't shove it down my throat.","post_message":"The briefs against bans on gay marriage come from the traditional allies -- and some surprising ones: small businesses, law enforcement officers and some Republicans."},{"comment_id":"847928802003105","commenter_b":"I am not Impressed with a government that steals elections so they can choose the president.","commenter_a":"This will give Rise to the Libertarian party who is right now starting to gain traction The GOP thought they had issues with @username...they wont be able to control a Libertarian Party candidate The establishment is destroying their 1 party 2 party system .... Thank you @username even if you get screwed out of the nomination you have accelerated the cause of freedom and liberty","post_message":"This is happening all over our country—great people being disenfranchised by politicians. Republican party is in trouble!"},{"comment_id":"10157765816045354","commenter_b":"Amanda, I have a question for you.At this moment in time, as we can not get a \"do over\" and the Republicans have a nominee what do YOU do? Do you \"vote your conscience\"? To what end? Don't mean to insult, but truly what do you do? Write in Cruz for President? IMO wasted vote..vote 3rd party? As neither Johnson or Stein don't have a snowball's chance in hell, they can't even get on the debate stage, wasted vote. Vote Hillary? Can't imagine that would be an option either. Any option that I have mentioned do one thing only..help Hillary Clinton. The results: 100k's refugees enter the country; amnesty for illegals who in turn get jobs, healthcare, not to mention open borders for additional immigrants to walk in through; the loading up of Federal courts and the Supreme Court with liberal judges who will destroy the very Constitution you and ...","commenter_a":"I have a better idea...Why don't YOU and the GOP along with Congress get on board with the true Liberty Loving Conservative Patriots? Yea, sure I have a lot of nerve, but then again so do you, jackass.","post_message":"\"Those people need to get on board.\""},{"comment_id":"462218217236106","commenter_b":"Transgender? It's a Guy who wears girl shit. That's no Transo, that's a stupid crossdresser who can't tell the difference between a P and a V. Sheesh! This country is Fucked up on this stupidass politically-correct bullshit. Wipe the makeup off and take the wig off or you'll get that shit Scraped off and that wig Split by angry parents and/or boyfriends.","commenter_a":"LET ME FIND OUT MY DAUGHTER, GRANDDAUGHTER HAD THIS FREAK WALK INTO THE SAME RESTROOM WITH THEM AND FOUND OUT THE SCHOOL OKed IT I`M GOING TO OWN A BIG PART OF THAT SCHOOL SYSTEM! THIS FREAK IS A MALE AND ALWAYS WILL BE ONE, HE HAS MALE DNA, MALE GENES MALE FINGER PRINTS A MALES RIB CAGE AND MALE PLUMBING NO SUCH THING AS A TRANS GENDER! THIS FREAK NEEDS TO STOP PLAYING DRESS UP AND PRETEND! HE MAY GET MORE THAN HE`S LOOKING FOR BY SOME DAUGHTERS DAD!","post_message":" girls have rights, and they shouldn have to share a bathroom with a boy, said a parent. See how this transgender student is causing a firestorm in a Missouri high school."},{"comment_id":"10153703978899087","commenter_b":"How about the thousands that are killed by blacks themselves ! Never hear about that !","commenter_a":"Bernie listens, Hillary laughs and walks away!!'","post_message":"Emotional video posted by the Black Lives Matter movement shows Bernie Sanders comforting a woman whose brother was killed by police. READ MORE: @webpagelink"},{"comment_id":"1025129017543627","commenter_b":"Preoccupied? Can women still vote? $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) Hillary Will make another Fortune!","commenter_a":"VOTEHfor both of US","post_message":"Women deserve access to the health care they need—without interference, intimidation, or violence. #StandWithPP -H"},{"comment_id":"596965907173588","commenter_b":"They BORN there.need to FIX their OWN Country..DON'T COME MESSING UP 'OURS;~~","commenter_a":"Trump will make american tax payers build the wall not mexico","post_message":"Trump Better be Serious about Border Security Promises"}]
