[{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"10150612418424999","commenter_b":"A hoe is a garden tool, ferchrissakes.","commenter_a":"Being a hoe ain't new or modern..No matter how many flowery. Words u use.","post_message":"\"If an open relationship was necessary to prove how well I loved my boyfriend, I was happy to comply.\""},{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"},{"comment_id":"1052573001452785","commenter_b":"Absolutely fuck a gun i don't hit women but that ghetto trash should've been slapped in the face","commenter_a":"This is the norm for these racist cockroaches, get a gun people because we're at war whether you like it or not................It's all thanks to that sorry POS Obama and his corrupt administration that led us here!","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10158219481290331","commenter_b":"the regardless part won't happen. if they are illegals with serious crimes on record, they will be deported. if they're citizens of rightful and legal to stay, they won't. no matter how people try to twist the issue into a hate retoric, it is for ILLEGAL IMMIGRATION.","commenter_a":"I wish I was there to ask some students why they walked out of class and I bet half of them don't know or just want to miss class. Bet!","post_message":"Large group of students at Molina HS in Dallas ISD have walked out of class in support of today's \"Day Without Immigrants\" protests. @webpagelink"},{"comment_id":"1048428675208939","commenter_b":"@username What are you reading? How did the US government start this war? The Syrians and everyone else out in North Africa and the Middle East have access to the internet and make their own decisions. When people have access to information freely they act accordingly. People have free will to think and make decisions. No one forced the Syrians to fight or oust Assad. He cracked down on protests violently and this is the result.","commenter_a":"How can Assad sleep at night knowing he is responsible for the deaths of 300,000+ of his own people. It's disgusting","post_message":"What chance is there for peace in Syria? Join our Q&A"},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"\"Madame President Hillary Clinton.\"  Do you like or dislike the sound of that?"}]
