[{"comment_id":"10153722267976509","commenter_b":"The Duggars are not Christians. They are members of a sex cult","commenter_a":"Your son molested four of your children and you tried to keep it secret? Disgusting! I'm going to pray for you when I take my birth control.","post_message":"Four of the five girls #JoshDuggar molested were his sisters, their parents said in an interview with Fox News anchor Megyn Kelly. @webpagelink via CNNMoney"},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"614337382087891","commenter_b":"you people get ready for WW 3 because that's where this is heading","commenter_a":"Hillary not trump","post_message":"Join Ohio State students on their ride to vote early LIVE with Jo Ling Kent.   Get all your election coverage here: @webpagelink"},{"comment_id":"998796643515786","commenter_b":"@username You would be ashamed at how hard it is for single man or woman from any country to apply for legal citizenship in the US. The paperwork is difficult and the cost somewhat prohibitive.Add to that English is not their native language and it becomes nearly impossible. When a mexican national pays $2500-4000 to a coyote to bring him here because it's easier and cheaper, it screams how broken our system is and how strongly we ask those who truly want to come here and work, to do it illegally. We make it easier to break the law than to obey it. We, the American people are complicit in this crime at present. This activity encourages the welfare state, trains new citizens to act irresponsibly, and costs the working class American tens of thousands of dollars each for this miscarriage of justice.","commenter_a":"Wanna know how precious your American Citizenship is? To some, it is worth paying for.. Asians have the LOWEST incidence of all minorities of being on the welfare and food stamp rolls.These women are here for Freedom and the Education afforded to their children they cannot get in their home countries.","post_message":"ANCHOR BABY BUSINESS: Asian Women Paying $4,000 Monthly to Give Birth to Babies in California so they be U.S. Citizens  @webpagelink"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":""},{"comment_id":"10153307488209087","commenter_b":"Read it again, silly bitch.","commenter_a":"Clinton was the one who started the whole \"birther\" movement against Obama. I wonder what she has planned for Sanders.","post_message":"“She is very much trying to put Bernie Sanders on the defensive, and it may be that she feels she has a chance to put this race away,” one Democratic strategist said about Hillary Clinton. “I think a lot of this is trying to end this campaign as early as possible and basically blow Bernie Sanders out of the race.”"},{"comment_id":"1714479032139903","commenter_b":"Omg","commenter_a":"Amy I want a kangaroo","post_message":"Meet Jimmy, the baby therapy kangaroo! (Footage via @webpagelink"}]
