[{"comment_id":"1215097765244658","commenter_b":"To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Theodore Roosevelt","commenter_a":"Obama top 5 worst presidents ever.","post_message":"President Obama delivers his first news conference since meeting with President-elect Donald Trump."},{"comment_id":"10157044490065093","commenter_b":"The only con-artist is Hillary!","commenter_a":"Wow. You work so hard to justify your position. What a word smith. What's your answer. Third party's ? Just how would that work? How would you fix it. You complain but you don't have any idea of merit to beat Clinton except trumps is wrong. A lot of us know he is a jerk and all the other adjectives. But unfortunately in life we have to make unsatisfactory choices when there are no other options. We have no other options except staying home and electing Clinton.","post_message":"\"I'm talking about his core supporters, the people who didn just enthusiastically buy his con, they helped sell it to the rest of us.\" -- David French"},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"102418186941623","commenter_b":"@username 99% of the Republicans that seem to comment in these venues seem to share the same ugly views. Those that aren't like that need to speak up more.","commenter_a":"That's because Republicans are selfish, self-righteous, hypocritical pieces of shit who are blowing loads over their new ability to grab power.","post_message":""},{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"\"When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'\" Hillary Clinton said."},{"comment_id":"994271287356316","commenter_b":"Hell no our government is so jacked in the head they need a 50 caliber hole there to straighten them out","commenter_a":"🖕🏿off your selfs in silence. how ignorant","post_message":"Would it be unchristian if I said in a Texas accent ... 'Eff them?' Help me. Your friend, Doug in Texas. @webpagelink"}]
