[{"comment_id":"10150745246359999","commenter_b":"More difficult than jamming his shirt into his pants","commenter_a":"*Insert Fat Jokes Here*","post_message":"Governor Chris Christie must now cram his vast political ambitions back into a space the size of New Jersey."},{"comment_id":"10158027884060354","commenter_b":"I'm proud I didn't vote for Trump who is a racist, woman groping sleaze and fails to pay a hard working startup business owner caterer because he told her she would get more business when people hear she catered his wedding and had to pay her employees out of her pocket. And believes because he is rich he has the right to treat women as he pleases. You can vote for him not me. My husband thinks he's NUTS!","commenter_a":"He's still under numerous criminal and civil investigations, whether they are by the FBI or not. Numerous court dates, numerous lawsuits, etc, etc.","post_message":""},{"comment_id":"419035241611690","commenter_b":"Ladies, use what ever you want, it is no one elses business","commenter_a":"Idiot !","post_message":"This GOP legislator has invented new female anatomy."},{"comment_id":"482111261979454","commenter_b":"She is in another country Germany . We have No rights there to forbid it. But in our country that's a different story all together. If swimming in a public facilities she should abide by laws of that community or township. If theme parks can refuse for you to wear cut offs then the should forbid that attire, and get out. They have more than enough money to put in their own pools. Our own laws presented by our President is destroying our country from within.","commenter_a":"This is going to far!!!","post_message":"A judge just ruled that public pools must allow Muslims to swim in 'Burkinis'.  We're tired of Muslims infiltrating our country. This stops now.  Do you agree that 'Burkinis' are WRONG?"},{"comment_id":"1136752646369001","commenter_b":"No the world is laughing at America","commenter_a":"The most pathetic, delusional president in history by far. Terror, hatred, murder and division all over the world like none in recent history and he says something so outrageous? Embarrassing and the world is laughing at this fool.","post_message":"Obama thinks we're living in the most peaceful time in history."},{"comment_id":"10153198327501051","commenter_b":"Love the whole idea!!","commenter_a":"They have French one's in Canada","post_message":"Are you okay with requiring all businesses to conduct their dealings in English only?"},{"comment_id":"10152817094974877","commenter_b":"I agree zimmerman was guilty as -ell. But this woman is even more guilty if you research her case. I feel sorry for the next man she meets. She'll kill the next one for sure.","commenter_a":"This is crap! This woman should be allowed to live her life....she didn't take a life...meanwhile George Zimmerman roams free! This is why it is important, people, to vote - local elections affect you more than national elections....VOTE, VOTE, VOTE!","post_message":"Marissa Alexander is officially a free woman, delivers powerful statement to reporters. Read the details of her release below.  Grio fam, will Alexander's case inspire more changes to Florida law?"}]
