[{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"\"Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.\""},{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"},{"comment_id":"10153209922201491","commenter_b":"Yes, let's leave the talk up to celebrities. Why should parents teach their kids anything? Brilliant, world.","commenter_a":"Admins, please contact me through inbox messages","post_message":"Jessica Biel: \"We want girls to know what their [body is going through] so they don’t feel scared or ashamed or gross.\""},{"comment_id":"1242442195775531","commenter_b":"Some people like me are deathly afraid of spiders!!! Black widows can kill people!","commenter_a":"These foods are from plants. They grow outside on a farm. There are bugs and animals outside. Bugs crawl on plants! Good grief. Dump your produce in a colander in the sink and wash it.","post_message":"YIKES! A Bothell woman tells KIRO 7 she found a black widow spider hiding in her package of grapes.  Gary Horcher is talking to the woman, who has a warning for shoppers. >> @webpagelink"},{"comment_id":"10153818527657623","commenter_b":"Nope, because how would we get our food? Most illegals work in Agriculture, and farmers said they don't want them removed. I don't think illegals are our problem. They pay billions each year in taxes. For example, food, sales, telecommunications, cable, transtportation, gas, etc. If we got rid of them, we would lose in the end no matter how many jobs we would get in industries that don't require I-9s.","commenter_a":"It's sad, heartbreaking, and demoralizing to people on that side of town that have tried to do anything to help curb the problems. The answer is not to make the situation worse by closing the store. The store is the lone grocery story on that side of town @username. That is not going to help. The solution is to deal with the poverty on that side of town. People steal and rob and sell drugs for economic reasons. They are broke basically. That's why on the Westside the BP got robbed by the White lady. She was broke, and she committed an armed robbery because she got desperate and didn't know what else to do. It's the same thing that has been happening on the Eastside, it's just spreading across the city. We have to build up both sides. There are things the city could do to help, such as, ...","post_message":"\"Everybody was like 'yes' when we saw him come in. Because we knew it was going to be a good night. Because he would make us laugh.\""},{"comment_id":"927307860637643","commenter_b":"Don't exist anymore? Are you serious?","commenter_a":"Kkk really doesn't even exhist anymore. And this has nothing whatsoever with the kkk. This dude was probably killed by other gang bangers and the gators got him. I would like to know where In the hell you come up with the kkk our of this story?","post_message":"It's looking like the police, the courts, the whole town are covering up for the KKK. What do you think?  From (Y) Counter Current News - MBD"}]
