[{"comment_id":"551295498386832","commenter_b":"Hillary is crooked af it's the perfect excuse.. Get a life.","commenter_a":"Love you Bernie but I can't support your endorsement. I know you'll continue to do what you can from your position and if given the opportunity to support you I will do so. But it looks like I will have to change my vote to Trump this year. I will not support Hillary under any circumstances.","post_message":"Thank you, Bernie Sanders. Proud to fight alongside you."},{"comment_id":"10154904389672235","commenter_b":"First, someone like me will have to tell the old hag to STFU and get out of the lady's face.","commenter_a":"I wonder how long it willl take for it to sink in to the deplorables that this sort of behaviour is intolerable, and they will be held in contempt for it by civilized people?","post_message":"BOOM!"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"10154510747482446","commenter_b":"exactly wouldn't lower myself following that nasty woman.","commenter_a":"Hate mongering liberal degenerates that do what they normally do... Act like revolting pieces of trash that they ALL are","post_message":""},{"comment_id":"10150612418424999","commenter_b":"A hoe is a garden tool, ferchrissakes.","commenter_a":"Being a hoe ain't new or modern..No matter how many flowery. Words u use.","post_message":"\"If an open relationship was necessary to prove how well I loved my boyfriend, I was happy to comply.\""},{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."}]
