[{"comment_id":"10154035210569024","commenter_b":"Tap her phone - stop her from murdering people","commenter_a":"Well police next time you see this lard ass limo cross the line pull it over and ticket HER. She is an EX Senators EX dept of state she has NO PROTECTION rights from being stopped and charged.","post_message":"“AFTER SPENDING A ENTIRE YEAR COURTING BLACK LIVES MATTER…”"},{"comment_id":"777290672402535","commenter_b":"She is a whiny bitch","commenter_a":"Yes","post_message":"Megyn Kelly Stabs Fellow Fox News Stars In The Back, This Is Horrible   She should be ashamed of herself.  Do you think Megyn Kelly should be fired?"},{"comment_id":"10154156199607235","commenter_b":"Seriously? WTF?","commenter_a":"William Kenneth Dockery","post_message":"WHAT."},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"10153294684803132","commenter_b":"This witch is EVIL!","commenter_a":"She should be charged with murder.","post_message":"\"When he actually started to carry out the act, he got scared again and exited his truck, but instead of telling him to stay out of the truck ... Carter told him to 'get back in.'\""},{"comment_id":"1029984087043663","commenter_b":"Lying Bitch!!","commenter_a":"Now that Hillary has come up with the idea of barking like a dog if a Republican or Bernie lies,I think its a super idea and should be applied to her. The problem is if you barked at her everytime she lied it would sound like a pound and never stop!","post_message":"Hillary claims she's always tried to tell the truth to the American people - but I think many of them would beg to differ...  Do you think Hillary Clinton has been dishonest?"},{"comment_id":"1702389236690262","commenter_b":"#NRAWhore","commenter_a":"Screaming about process that eliminates the ability to make progress is criminal.","post_message":"The sit-in by House Democrats is nothing more than a publicity stunt. The bill they're talking about was already defeated in the United States Senate. It's time for them to #StopTheStunt."}]
