[{"comment_id":"10153141686007093","commenter_b":"No she isnt..cause when you see a 400 lb woman wear them and you can see through them then you will be on her side! !!!!!!!!!!!!!!!!!!#!!!!!!!!!","commenter_a":"She's just all butt hurt because she doesn't have a nice body to pull off wearing leggings like they're pants ;)","post_message":"It's leggings season. But according to one woman's viral rant, a lot of people don't wear them correctly... @webpagelink"},{"comment_id":"965589516846855","commenter_b":"Rubbish. MUSLIMS are 90%terrorist","commenter_a":"If someone calls themselves a Christian and then goes and shoots people at a movie theatre, are you going to then say all Christians are bad? The thing is, all Muslims are not terrorists. My fiance is a Muslim his family are Muslim but they are not terrorists. Why should he have to wear a badge and be watched when he did absolutely nothing. Terrorists do not have a religion they don't have a \"look\" anyone can be a terrorist and saying we should badge all Muslims is just plain hate.","post_message":"\"Being Muslim doesn't make me any less American than you are,\" she wrote in a letter to Donald J. Trump that's now gone viral."},{"comment_id":"1074652632613170","commenter_b":"SURE, CLINTON LIES EVERY TIME SHE OPENS HER MOUTH !","commenter_a":"She needs a nose job.","post_message":"RINO Sen. Susan Collins is a ________________."},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."},{"comment_id":"10153090058473984","commenter_b":"Fry her dam ass","commenter_a":"GOOD!!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary...  Should she face criminal charges for this?"},{"comment_id":"10153750563214497","commenter_b":"Liar. You're not a prostitute.","commenter_a":"As an African American prostitute I find this offensive.","post_message":"For more world-renowned reportage, visit theonion.com."},{"comment_id":"10154697358601037","commenter_b":"Where's Hitlery?-Oh Yea, Taking ANOTHER Sick Day Because Yesterday She Had 300 Supporters Show Up To One Of Her Rallies While President Trump Was Speaking To 3 THOUSAND Of His Supporters.....#Laughable #HitleryIsToast #RepublicansWinning","commenter_a":"In business you make profits If you don't. Then you not in Business.","post_message":"“Can you imagine Ronald Reagan ... saying, ‘It’s good business to take advantage of people’s misery’? Rooting for that misery?” — Joe Biden on Donald J. Trump"}]
