[{"comment_id":"10155146637143984","commenter_b":"Sad part Brenda Gantt at best they will pat him on the hand deport him without any consequence for ehat he did, he will turn around without a wall to stop them and illegally enter again.There was an incident ehere a woman lost her daughter unborn grandchild and new son in law to an illegal no consequences.She and several tried to get illegals deported what she got in my oppinion was a slap in the face, it cost too much to send them back where they came from.SERIOUSLY SHE PAID THE ULTIMATE PRICE TO BE TOLD THAT? No i say meet the authorities at the border say here are illegals we are returning.We need stricter rules if they are here they need to suffer same consequences a citizen does, whether here on a visa or illegal with no consequences for judgement given from court","commenter_a":"Ha ha Mexico will never pay for the wall and when they send the illegals back I can't wait to see all of you working in the fields","post_message":"Jaws hit the floor as soon as Trump revealed when the Mexico wall is going up. This came as a complete shock to Mexico, and is going to go a long way in shaping Trump's presidency..."},{"comment_id":"575394812634636","commenter_b":"Thanks for the giggles","commenter_a":"i know i'm not the only one who thinks dwayne johnson looks like the rock","post_message":"The brawl occurred after Cage reportedly pulled Vince Neil off of a woman at the ARIA Resort & Casino."},{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10153644347998188","commenter_b":"Your opinion from your dreams Beck! It is a year before the election it is speculation at this point!","commenter_a":"I have been impressed with Carly for a few months and thought she did really well getting her points across, only wish she would be a little more warm and natural. She needs to be more likable. Rubio was outstanding with his knowledge of world affairs and ability to connect. Very presidential. Dump the Trump!","post_message":"Biggest winner: Carly Fiorina biggest Loser: Trump.  She looked presidential, serious, sharp, well informed, non establishment and tough.  Second place:  tie Rubio and Cruz  Close third: Carson (although because he is so different in volume, pace and style he may surprise me and others)  Biggest loser was so clearly Trump.  He is just not likable.  I just don't believe he is liked by tea party members.   I stood with them and looked into their eyes, is poke with them, marched with them and there is just nothing they have in common except being fed up.   If that is all he has, it is going to crater quickly.   He looked like a bully, sleazy and I just can't imagine good hearted, humble, faithful Americans falling for this arrogant anger much longer.   What average non political woman will connect with them?  Runner up for loser:  Bush.  He was rattled.  It is clear, he hates Donald trump.  While there were a couple of times I felt sorry for Bush. It didn't make me think he would be great if he were rattled by Putin or the mullahs.  This was a mortal wound for bush I think.  Also the big loser:  America.  It was so childish much of it.     #gopdebate #cnndebate"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"10154927346797577","commenter_b":"Dose right here john make u wish u were born female","commenter_a":"Sweden should book these cunts two seats each for return home to goat fucksville, one for them n one seat beside them for their amputated cocks. U no im right so u lefties stay to the fucking left.","post_message":"5 Afghan refugees convicted of raping a young boy will not face deportation because their “homeland is too dangerous.”"},{"comment_id":"10153687843588854","commenter_b":"She has less worth than a used condom","commenter_a":"She deserves a place in cellblock B","post_message":"Unreal: Susan Rice Calls Benghazi A “False Controversy”…"}]
