[{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"684042675091009","commenter_b":"Hillary is guilty as sin . She should be in prison along with all of her Clinton Crime Mafia.","commenter_a":"Maybe he is scared of being the next victim to die like the FBI suspected leaking the emails.","post_message":"BREAKING: CLINTON CLEARED...Was This A Coordinated Last Minute Trick To Energize Hillary's Base?   This only proves why we need TRUMP to DRAIN THE SWAMP! We are a Banana Republic!"},{"comment_id":"10156436861080354","commenter_b":"Barbara is either asleep or as dumb as a box of rocks!","commenter_a":"BABA STREISAND is a LIBTARD MORON, Like her EVIL BUDDY HUSSEIN OBUMMER...!! EAT SHIT BABA SHEEP STEISAND..!!!","post_message":"You've GOT to see her characteristically snooty and elitist statement..."},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"10154008398892093","commenter_b":"an old woman did this on her apartment and end up with this, be careful guys","commenter_a":"Well my heater doesn't work right now guess I have to dress warm going to bed. Other than that I love this weather.","post_message":"How are you preparing for the first hard freeze of the season? bit.ly/2gAPzAa"},{"comment_id":"10152984965615950","commenter_b":"@username what a BITCH","commenter_a":"Cute. But this is not the 1st time they put the glasses on the baby.","post_message":"WATCH: Adorable viral video shows a baby seeing clearly for the first time, and it teaches an important lesson for parents: it's never too soon to check your child's eyesight @webpagelink"},{"comment_id":"10154624272397042","commenter_b":"Yea she has no right to refuse medical attention she is a minor, she could be hurt and this could look bad on us, lets slam her into a wall and toss her around to make sure she goes.","commenter_a":"If I'm not mistaken, she doesn't have the right to refuse medical treatment because she's a minor right? Her parents have to make that decision as well as them signing a Miranda for cops to question her. I hope her family sues and the officers gets properly reprimanded","post_message":"Body-camera videos of police using pepper spray on a 15-year-old girl have caused widespread uproar."}]
