[{"comment_id":"494909614001888","commenter_b":"That's it Chris we're all fucked - fucking wall climbing alligators!!!!!!!","commenter_a":"Abraham Guimaraes","post_message":"Nope. Not photoshopped."},{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"},{"comment_id":"10153567844472434","commenter_b":"Carol Adams you're mentioned here and might enjoy, grrrl!","commenter_a":"Unfollowing. I'm tired of your anti-vegan rhetoric. The fact is that eating meat is the largest contributor to climate change. It is an industry that is notorious for violating human and animal rights and destroying the global environment.","post_message":"Anything mass produced is shitty for the environment, including almond milk."},{"comment_id":"496930887161871","commenter_b":"women, they just don't listen lol","commenter_a":"Hope she went to jail!!","post_message":"\"Thank to Obama and I don't have to OBEY you\", she said to the police officer!"},{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"}]
