[{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"1135581816480053","commenter_b":"I was just going to say that! I don't even think Taylor Swift could pull off that jacket well. It's apropos for this witch though: an ugly jacket for an ugly person","commenter_a":"What's worse is it looks hideous. She could have found a nicer jacket at Kohls!","post_message":"Does something seem wrong with this picture!"},{"comment_id":"506386899562882","commenter_b":"@username. Hillary Clinton is nothing but a liar and a criminal. Her whole life is been about criminal activities.","commenter_a":"Hillary will be the next president for sure","post_message":"Donald J. Trump fans in China?  The U.S. presidential candidate who accused China of stealing American jobs also says the \"people from China love me.\"  Is this really the case?  CNN's Matt Rivers is live from Beijing, China, answering your questions and telling us what people think of the U.S. Republican candidate."},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."},{"comment_id":"1184326411634277","commenter_b":"Yup they deserve to go home and shouldn't think twice before shooting and it should be shoot to kill do the crime expect to pay the price I don't care what color your skin is point a gun at a cop expect to eat lead","commenter_a":"If you point a gun at anyone, expect to get shot.","post_message":"Do you agree?"},{"comment_id":"978703995520079","commenter_b":"And so does everyone else or they would not even bother if they did not","commenter_a":"The comments are always good for a laugh. You put up something positive & life affirming & there are sad, silly people feeling sorry for themselves who bad mouth it because it came from a successful actor. Ever wonder why he's successful? Maybe he had the right attitude & didn't blame all his problems on someone else!","post_message":""}]
