[{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"10153539588391037","commenter_b":"these pigs should have never been given the attention.","commenter_a":"If anyone believes the Duggars are all better now, please let your kids do a sleepover there and let us know. We'll wait for your report","post_message":"After weeks in limbo stemming from revelations of Josh Duggar’s sexual misconduct, the reality show \"will no longer appear on the air.”"},{"comment_id":"10153257325640950","commenter_b":"Quit smoking dumb ass broads or don't get pregnant!!!","commenter_a":"Smoking while pregnant should be child abuse. The reason it is not is that Planned Parenthood and the rest of the abortion industry wants no rights assigned to kids when they are in utero, because doing that would admit that they are a person.","post_message":"Smoking during pregnancy can lead to complications including sometimes dangerous premature births and sudden infant death syndrome."},{"comment_id":"10153684998979228","commenter_b":"Crime has gotten out of hand?? Thank you Captain Obvious.","commenter_a":"Should have been in Chicago to make St. Louis feel safe.","post_message":"St. Louis Mayor Francis Slay says crime in the City of St. Louis has gotten out of hand."},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"},{"comment_id":"10153352503921051","commenter_b":"Ha ha bitch","commenter_a":"Don't see a problem with this. Fl. Courts finally got it right","post_message":"The Hello Kitty Rapist, a horrible man whose crimes included sexually assaulting multiple women and attacking a war veteran, just learned his fate."}]
