[{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"},{"comment_id":"661168074035043","commenter_b":"She has problems","commenter_a":"Dylan Ballzy","post_message":"Ermmmm..."},{"comment_id":"10154125094006409","commenter_b":"Hillary is the CLOWN","commenter_a":"They already took our voices away anyway, so what difference does it make? Donald Trump didn't win the popular vote. Yet, he's the next \"President\" anyway. The guy's a CLOWN!","post_message":""},{"comment_id":"1288485644498385","commenter_b":"she was going to get nailed for perjury and they KNEW IT","commenter_a":"Well.... Bye!","post_message":"In case you missed the bombshell late last night, Ben Shapiro resigned from his post as Breitbart News’ editor-at-large over the management’s “disgusting” treatment of Michelle Fields."},{"comment_id":"10153002783667522","commenter_b":"She will come back with stilettos and her boobs hanging out.","commenter_a":"Oh Rodney I thought this was one of your favorite shows?","post_message":"It looks like Nancy Drew may be getting the Grey's Anatomy treatment:"},{"comment_id":"838486396292823","commenter_b":"I know how is she sleeping with the light on it should be a heat lamp!!!","commenter_a":"drink :D","post_message":"Late night eaglet stream!  Thankfully baby E9, Harriet and M15 will be warmer tomorrow!  Where are you joining us from this evening? @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"10152534767705047","commenter_b":"Revoke their passports and citizenship! Traitors should not be allowed to live here !","commenter_a":"Amen","post_message":"American citizens must not be allowed to fight alongside jihadists, only to then return to the U.S. to spread jihad here.   Sign & Share our petition to protect our homeland:  @webpagelink"}]
