[{"comment_id":"1062386963799539","commenter_b":"@username Much like one refinances one's house at a lower rate. Sure sounds Republican to me.","commenter_a":"And this political cartoon shows why he should. Personally I'd prefer that he wait and allow a Democrat president appoint him to the Supreme Court.","post_message":"Does this about sum it up?"},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"988508257851300","commenter_b":"what a women feel when do this?","commenter_a":"Back before social media, women's magazines used to use this as a rule of thumb for whether you could get away with going braless (if the pen falls, you can ditch the brassiere. if it stays, strap 'em in.) Which would be shaming in the other direction, by today's standards, I guess?","post_message":"Why #Underboobchallenge is going viral."},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"},{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"\"These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.\""},{"comment_id":"1331072000266602","commenter_b":"I guess it's just disappointing to think of anyone being THAT stupid . Smdh .","commenter_a":"Why make a video of this ? It has to be trolling .","post_message":"The teens said they will make Black people slaves, burn them, brand them and make them swim the Atlantic Ocean."},{"comment_id":"10153902236123812","commenter_b":"The native Americans should have stopped accepting immigrants. They wouldn't have lost millions of life's by those terrorist immigrants!!!","commenter_a":"ISIS doesn't need to be in America. Has everyone forgotten about the mass shootings that happen almost every day now? They can easily recruit here and never step foot on American soil. Blind hatred is still hatred.","post_message":"LATEST: Mississippi joins Ohio, Florida, Illinois, Indiana, Louisiana, Arkansas, Michigan, Alabama and Texas in refusing to accept Syrian refugees in wake of #ParisAttacks."}]
