[{"comment_id":"10154534424443984","commenter_b":"If these Punks hates us and hates the American Flag , why ????? Do you live here I'm sure if we came over your home place we would be killed","commenter_a":"I agree. If America is so bad for these buttheads, get the heck out of our Country!!! Second, if any of these a-holes are getting assistance from our Federal Government (alias all of us), STOP THAT SUPPORT NOW AND FOREVER!!! The people who fought and died for that Flag to fly is the reason these a-holes can be protesting in the first place. I would put them on a plane like the other person said, but instead of flying to ISIS country, I would just drop them out over the middle of the Atlantic and see how well they swim. Hopefully they will swim in the other direction from our Country!","post_message":"The protesters in Cleveland thought they could get away with burning an American flag in the streets... but they never expected who was coming right for them.  This is America, punks... don't mess with Old Glory."},{"comment_id":"489237724600141","commenter_b":"Fuck that dumb wench","commenter_a":"How about if you criticize a Catholic, a Jew or any Christian. What hell makes Muslims so special?","post_message":"Hillary Clinton is attempting to make it punishable by law to criticize Islam.  She just crossed the line. We can put a stop to this, let's end this right now.  Can we get 20,000 'LIKES' for freedom of speech?"},{"comment_id":"10155481461845405","commenter_b":"And I mean prosecute the farmers not the illegal immigrants. You can't blame them for coming here and getting a job . My point is Republicans won't deal with the issue in a responsible manner.","commenter_a":"And they vote Republican and employ the largest number of illegal immigrants and get away with it. The one that do should be prosecuted for it .","post_message":"Did you know that 97% of Wisconsin farms are family-owned? Wisconsin agriculture also employs 413,500 employees and that's 12% of the workforce."},{"comment_id":"1422900164405547","commenter_b":"My integrity will not allow such a travesty. She is a war monger.","commenter_a":"We can't , CANNOT, be punitive at this time in history and not vote for Clinton. I KNOW Bernie would have been a WAY better President, but I will hold my nose and vote for Clinton.","post_message":"I don't know if it's a world record but Donald Trump has been sued more than 3,500 times over the past 30 years. This isn't someone who should be president."},{"comment_id":"10154292221654411","commenter_b":"Aka....draw and quarter Snyder.....lil bitch","commenter_a":"Cunts are a shame....get rid of them...","post_message":"The problem isn infrastructure but rather 'a hate crime and mass poisoning of Black and poor people,'  filmmaker Michael Moore."},{"comment_id":"10157199868050354","commenter_b":"THE WALL, THE WALL, THE WALL........TRUMP 2016 !!!","commenter_a":"To our Canadian friends and partners. We know you watch the going's on in the U. S. sometimes even better than we do. The time is drawing near for this country to rectify its self. Please stand by and give assistance when needed to those involved. Thanks and good luck up there with your country. Hey.","post_message":"Wow."},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."}]
