[{"comment_id":"10155094370524329","commenter_b":"That is why we need physical borders to cut down on illegals crossing the borders.","commenter_a":"I waited in line for 2 years in South Africa to immigrate legally to join my husband. Why is it acceptable for anyone to enter the US illegally just because they have a geographical advantage?","post_message":"Dr. Sebastian Gorka: “When you go to bed at night do you lock the front door?”  Sean Hannity: “Yeah, and then I put my gun next to my bed and I go to sleep.”  Dr. Gorka: “If you do that, then surely the border is our front door. Surely we should have a control as to who enters our house. This is the House of America.”"},{"comment_id":"1069935306362850","commenter_b":"Wooh, I guess different strokes for...that's one ugly woman","commenter_a":"Carly not bad to the eye that's all","post_message":"Carly ROASTED Hillary over her email scandal!  Watch her sound off."},{"comment_id":"557993331054503","commenter_b":"Yes and some she A BITCH from HELL.","commenter_a":"With her freedom.","post_message":"Pentagon Attacks Trey Gowdy, Because He Refuses To Abandon Persecution Of Hillary... He Needs Your Support  He's taking a stand for the soldiers who were left to die.   Do you think Hillary needs to pay for her crimes?"},{"comment_id":"640803119402199","commenter_b":"She would make a prison cell look good","commenter_a":"A better inmate. Classified is classified and a crime is a crime. I'd be in jail or hiding in Russia if I did what she did.","post_message":"Do you think Hillary Clinton would make a great president?"},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality \"a step further.\" He says he will donate $1 million to help in the effort."},{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."}]
