[{"comment_id":"928454370547645","commenter_b":"Because only girls can get raped","commenter_a":"I am so glad that I don't have a daughter. I'd be terrified for her in this world we live in. Heartbreaking.","post_message":"'The most disgusting, sickening' gang rape at Spring Break beach party"},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"996296000407740","commenter_b":"You are going to deal with it...as he repels the illegal invaders","commenter_a":"Trump does not get it wrong when it comes to policy","post_message":"\"Wait, wait, wait...\""},{"comment_id":"604244696428800","commenter_b":"Don KorLeone","commenter_a":"son in front look lik Derrick Rose","post_message":"Police are looking for eight males who robbed speakers from a Crown Heights, Brooklyn Family Dollar and attacked an employee with shopping baskets on the way out.   Full story: @webpagelink"},{"comment_id":"1044606575560353","commenter_b":"Bwabhhhaaahhhhaaaaa.:O On 24/02/2015 1:30 AM, \"Facebook\" <","commenter_a":"Does category number 11 include parents?","post_message":"Who drinks the most coffee?  Image by I Love Coffee via AsapSCIENCE."},{"comment_id":"10155169022694411","commenter_b":"I think the Mexicans are just being drawn back to their ancestral lands annexed into parts of the US. God gave the poor Mexicans more land but the Devil took some of it. Now the population is over flowing into another country. Build the wall on the pre annexed land boundary and the problem will be solved...","commenter_a":"That wall devided a nation. This wall divides two seperate nations. Fuck outta here","post_message":"'We Berliners know best how much suffering a division of an entire continent, cemented by barbed wire and wall, has caused'"},{"comment_id":"10152818451732014","commenter_b":"Can't believe it. She had black heart so seem didn't care own baby. Y are abuse own child.","commenter_a":"How can people be so freaking stupid??!!!!!!!","post_message":"A Phoenix mother has been arrested for allegedly leaving her 4-month-old daughter in a hot SUV."}]
