[{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"371470169707944","commenter_b":"This is to Hanoi Jane. Run your bathtub to lukewarm. Get into tub. Have a nice glass of red wine. Take a razor and slit both of your wrists. Go to sleep. The world will be a better place without you.","commenter_a":"She owes the Vets she causd additional harm to in Vietnam. She needs to apologize profusely to all veterans for the rest of her life.","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10153246589888445","commenter_b":"I hope all these dumb fucks on her get arrested by the feds no one wants your dirty swag bitch","commenter_a":"Haha don't worry we got your back here in co haha oh and water","post_message":"NEW: California Wildfires Are Affecting the Pot Industry."},{"comment_id":"1206961029346060","commenter_b":"You still haven't answered the RACE question","commenter_a":"He sounds like when I BS for word count in an essay.","post_message":"Donald J. Trump and Hillary Clinton faced off in their first presidential debate. TELL US: What questions did you want them to answer? Your comments may be used on our newscasts. You can also watch the debate live on CBS2 or on CBSNewYork.com, Join us on CBS2 at 11. #Debates2016"},{"comment_id":"10155018398498258","commenter_b":"Who cares She is not that important anyway","commenter_a":"When they go low , we go high","post_message":"Congresswoman Katherine Clark is breaking from tradition to protest Donald J. Trump by boycotting his inauguration."}]
