[{"comment_id":"10154996300568827","commenter_b":"And when they do they can get arrested for indecent exposer. And if they do it in front of one child they should ALL have to register as a sex offender.","commenter_a":"Why do we need to see his returns...? He was a private citizen...show me yours...","post_message":"Protesters plan to pull their pants down to protest Trump."},{"comment_id":"1264368863598532","commenter_b":"GO straight to HELL...","commenter_a":"God has His own way to handle Him. This man is no match for God.","post_message":"This is why Trump won!"},{"comment_id":"775380562560552","commenter_b":"Your a stupid bitch","commenter_a":"This is the best show on TV. I won't be watching TLC if this is true. We can forgive things stars, football players, and men in charge of our country, but we can't forgive something a 12-year-old boy did. Standing behind the Duggars and praying for them.","post_message":"\"19 Kids and Counting\" has been canceled after Josh Duggar's shocking confession."},{"comment_id":"10153068305271051","commenter_b":"She is legal","commenter_a":"fire the cop,he must like young girls.","post_message":"This teen girl was with her friends when a police officer started hitting on her. She decided she wasn’t interested. Bad move."},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"},{"comment_id":"10153772356976323","commenter_b":"Fuck off cocksucking bitch","commenter_a":"There is no climate crisis. It is a hoax of liberal desperation. There is however CYCLICAL climate changes.","post_message":"The fate of 70 million people rests on what happens to the Mekong river. Featuring extraordinary and beautiful drone footage of south-east Asia’s vast waterway, this important piece meets people struggling to deal with the impacts of climate change."},{"comment_id":"603575639802390","commenter_b":"Dumb bitch but I completely understand there decision to shoot the Silverback.","commenter_a":"If you are such a negligent parent that you allow your 4 year old child to fall into the pen of a wild animal, you should have to descend into the pen yourself and fight the animal with your bare hands to show society that you are still fit to be a parent.","post_message":"The zoo's decision to kill a 17-year-old, critically endangered gorilla after a 4-year-old boy fell into the animal's habitat has sparked outrage."}]
