[{"comment_id":"10154136784591800","commenter_b":"Why not question why WNBA players don't make the same as NBA players? it's cause we all know the answer to that and it's the same as the answer to this. Only difference is incomplete data has been distributed for soccer players making people think their is a pay divide when in reality their is a revenue divide.","commenter_a":"If they played each other, the men's team would win and if you say \"Well that's because they are men.\" I would say \"Exactly, that's why they are paid more.\"","post_message":"Hasan Minhaj got the details on the U.S. Soccer pay gap. #EqualPlayEqualPay cc.com/equalpay"},{"comment_id":"1811292265824545","commenter_b":"Lack off question mark ? Get a life lefty. It's Facebook , not a GCSE","commenter_a":"When I was the age they look,,,,,I'd got my apprenticeship done, bought my first house and was engaged!! How very strange,,,,,,,","post_message":"\"Things are moving quickly now.\""},{"comment_id":"1006273402742336","commenter_b":"You kiss your mother with that mouth?","commenter_a":"How funny, lot of idiots on here don't realize that bin laden in the white house tremendously cut funding to nasa a while back.... This is probably giving back what he took...... Lib and Bernie voters aren't expected to","post_message":"That even more than Barack Obama asked for."},{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."},{"comment_id":"1258505287549557","commenter_b":"Nah yo Grandma shouldn't have been hoeing around on Christmas eve. Her old ass shoulda been inside","commenter_a":"Damn WsHH with the sad ass news but was santa cryin like that when his reindeer ran Grandma over","post_message":"This is heartbreaking. #WSHH "},{"comment_id":"863410587096986","commenter_b":"90% London is full of foreigners, loud mouth rude boys and junkies.","commenter_a":"But london will not make exception for trump","post_message":"London's new mayor will be an \"exception\" to his proposed ban on Muslims."},{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"}]
