[{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"},{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"10154178677146943","commenter_b":"Abedin is corrupt woman with an agenda..Hillary's agenda. Watch..if anyone goes down for corruption it will be her, and Hillary Clinton will get off by throwing her under the bus! It seems to me that HC always surrounds herself with live shields for her own protection. Everyone of them should be held accountable..starting with Hillary Clinton!! Why is she even a candidate?","commenter_a":"Lock them up...Lock them up...Lock them up!!!","post_message":"A Clinton Foundation donor and St. Louis-based political consultant begged Huma Abedin to get former Secretary of State Hillary Clinton to meet with her client, the U.S. largest coal company, according to emails released by a conservative legal group.  , I need your help now to intervene please, Joyce Aboussie, a Clinton Foundation donor with close ties to the former First Family, emailed Abedin in June 2009 after Clinton had been leading the State Department for about six months. - via The Daily Caller"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."},{"comment_id":"1410115659014394","commenter_b":"Andres Rivera illegals don't belong here","commenter_a":"IMPORTANT *** California, Montana, New Jersey, New Mexico, and South Dakota, please vote for Donald Trump on June 7. We have 126 UNBOUND delegates who can choose to not vote for him on the first ballot. We need 126+ more BOUND delegates to secure a first ballot win and avoid a second ballot! Vote for Mr. Trump on June 7!","post_message":"The good news is that my campaign has perhaps more cash than any campaign in the history of politics. That's because I am standing 100% behind everything we do."},{"comment_id":"10154077757710575","commenter_b":"WOW WORLD LEADERS RATTLED BY TRUMP JUST LIKE THEY WERE WITH REAGAN I THINK IT'S A GOOD THING THEY ARE SHAKING IN THERE BOOTS NOW THE FOLKS THAT ARE ABLE TO WORK LET'S GET THEM OFF OUR DIME MAKE THEM WORK EVEN IF THEY STAY ON WELFARE LET'S MAKE THEN CLEAN THE STREETS WORK FOR THE MONEY","commenter_a":"world leaders have no respect for Obama.","post_message":"Obama wants to make headlines...  So he attacks Donald Trump while in Japan."},{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."}]
