[{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10154378040854024","commenter_b":"Wow! That woman is looking dumber every day!","commenter_a":"Flippin greedy, deranged, bitch whore!","post_message":"“Now this is just getting ridiculous. She didn’t actually meet the standards in PA to have a recount, so she’s going to try to evade them by calling them ‘unconstitutional’. She raised enough money specifically to deal with the fees and then pulled out when asked for it. The whole point is to tie up the electors so they can’t vote for Trump.”"},{"comment_id":"1100002276704629","commenter_b":"Whats more important to the RNC? Having Hilary as President or winnning the Presidency with. Trump, a Republican. They need to listen to the people .","commenter_a":"This would most certainly put Hillary Clinton in as first female pres.","post_message":"Should Romney run as an Independent against Trump and Clinton?"},{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"10153515991569087","commenter_b":"Good. Get ridnof all these terrorists and their little terrors. Stay the hell out of America.","commenter_a":"That's real leadership So what's best for America, and not worry about pissing the liberals America come first, even above our bickering","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"1172494429493450","commenter_b":"These dumbasses should be ashamed ... No one will ever vote for either of these liars again . No Honor ..No Vote","commenter_a":"These three men will never get my vote in the future. Anyone that is with her is corrupt... Republican or not you need to go.","post_message":"GOP 'Never Trump' Candidates get a Warning"},{"comment_id":"10154593290916037","commenter_b":"Kick all them illegals out!","commenter_a":"it is what he has always said, just all the words are different now","post_message":"Christie highlighted that Trump has said undocumented immigrants will not be eligible for citizenship unless they leave and re-enter through legal channels."}]
