[{"comment_id":"1687846428128746","commenter_b":"What a nice sounding kid.","commenter_a":"Build that wall for America and make it big and strong! Trump 2016!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building!  LET'S #MAKEAMERICAGREATAGAIN  www.DonaldJTrump.com/Nevada"},{"comment_id":"865380196838555","commenter_b":"You're a dumb b****.","commenter_a":"Islamists stand together...if he were to admit islamism, he might be called an apostate.","post_message":"There’s a far bigger issue involved here than going to the anti-terror march in Paris on Sunday. That is Obama’s persistent refusal to identify the enemy as what it really is: Islamic terrorism. It’s pathetic to see the contortions our president and various administration officials and spokesmen go through to avoid using the word “Islam” when talking about the people who are waging war on the West. @webpagelink"},{"comment_id":"10155036585354108","commenter_b":"The first lady also has shown everybody her breast","commenter_a":"again","post_message":"LIVE | BREAKING: President Donald Trump will soon speak to supporters at a rally in Melbourne, Florida."},{"comment_id":"554676768026413","commenter_b":"Lu Fo see the top comments and it really shows how the middle class sees the negative effects of raising the minimum wage","commenter_a":"so small businesses will make sure they will not hire that 26th person","post_message":"BREAKING: California became the first state in the nation to commit to a $15 per hour minimum wage after Gov. Jerry Brown signed the new law Monday.   Under the plan, minimum wage was expected to increase to $10.50 per hour on Jan. 1, 2017 for businesses with 26 or more employees.  The minimum wage would then rise each year until it reaches $15 per hour in 2022."},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"}]
