[{"comment_id":"10153619806193984","commenter_b":"Neither!","commenter_a":"Guess Obama can only force Americans to follow his \"laws\" and beliefs ---- he was a tricky and mischievous politician, declared Ethiopian opposition party spokesman Yonathan Tesfaye. today he has become a passionate inspirational human rights activist. Which one should we believe? Which one should we go with?","post_message":"Well, it doesn't look to me like Obama made very many friends during his trip to Africa...  Do you agree that Obama is untrustworthy?"},{"comment_id":"10154162450013812","commenter_b":"This alone would make me patronize your establishment on a regular basis.","commenter_a":"I salute you! way to be a decent human.","post_message":"Pizzeria owner makes it a point to hire workers with disabilities: \"We did it because it needed to be done. There are no jobs out there for these kids, so they are being prepared for nothing.\""},{"comment_id":"10153161332178606","commenter_b":"with friends like that who's need enemies! She's just evil.","commenter_a":"Good. She can go to JAIL !","post_message":"Police said a teen had second thoughts about committing suicide, but his friend encouraged him to do so. @webpagelink"},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this.  Do you agree with the Iowa Gov.?"},{"comment_id":"10153014740596545","commenter_b":"@username stop right there. No Bush should be allowed in politics anymore. They've controlled things long enough!","commenter_a":"Go away Rick Perry......far away!","post_message":"Rick Perry referred to the Charleston incident as an \"accident\" on Friday; staffers said he had meant to use the word \"incident.\""},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."}]
