[{"comment_id":"1844880965799014","commenter_b":"Despicable, she has done this before....","commenter_a":"How long have these two been doing that kind of stuff? Looks kind of brazen to me! If that were my property, it would have been a totally different outcome.","post_message":"Totally. Busted. Sure, they're caught red-handed, but just wait until you see how they respond..."},{"comment_id":"1163941390354988","commenter_b":"I'm also mad that she is not wearing the gloves. I couldn't care less about a corset. Wear the gloves!","commenter_a":"Ummmm...okay?","post_message":"Emma Watson isn't wearing a corset under that yellow dress. // Beauty and the Beast"},{"comment_id":"976218969153516","commenter_b":"I hope she gets life in prison! She is a twisted individual! The other prisoners know how to handle child killers. She woo get what's coming to her then rot in hell!","commenter_a":"They all should die the very same way he did!!!!!!","post_message":"Rachel Bostian, one of three women charged with savagely beating five-year-old Alexander Stephens to death during a 22-hour abuse and torture marathon — one of the accused women the little boy’s own mom — pleaded guilty to murder and several other charges in an Ohio courtroom last Friday, according to a report in The Cincinnati Enquirer. But what led Bostian, 29, and allegedly her 26-year-old friend and Alexander’s mom Theresa Hawkins-Stephens, as well, to tie the little boy up for what... @webpagelink"},{"comment_id":"693806690773834","commenter_b":"Women should be prosscuted!","commenter_a":"I think this is where the word HOG WASH, came to be.... just saying...","post_message":"How rotten this administration is to the core when the attorney general takes the fifth to avoid incrimination!"},{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"\"The commanders are the ones who should set the rules of engagement, not politicians\""},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."}]
