[{"comment_id":"1044120348961770","commenter_b":"Whore...like she has any brains...","commenter_a":"Paula you've had your 15 minutes.","post_message":"The woman who sued Bill Clinton for sexual harassment two decades ago doesn’t want him back in the White House."},{"comment_id":"10153301604366680","commenter_b":"Get OUT !","commenter_a":"NH. Nah. NH. It's ok. NH. Isn't IA. Don't worry. NH. I","post_message":"It was bad."},{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"10153663985481509","commenter_b":"Americans don't know half the stuff the government does.","commenter_a":"Loose lips don't sink ships anymore or what?","post_message":"The U.S Air Force's 'secretive space plane'... what exactly is it? CNN Rachel Crane reports: @webpagelink"},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"}]
