[{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"},{"comment_id":"552487634912815","commenter_b":"Your racist dumb fool he's not understanding the concept on the purpose for building the wall","commenter_a":"your not going to stop drugs coming in with a wall, they have already proven that for the last 20 years. there are inventions like aero lights, tunnels, submarines. and boat. not to mention all the ways they catapult drugs over already. your all stupid for supporting this waist of tax payer money. not forgetting all the jobs they do that you office pussys wont and can't do because you have no back bone.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10153641052531509","commenter_b":"@username, I'm willing to bet that Elizabeth up there hasn't murdered any teenagers. It's possible that she's never even been arrested. I won't mourn a guy who can't seem to keep trouble away from him.","commenter_a":"Too bad the gunshot didn't kill the punk.","post_message":"George Zimmerman, acquitted in Trayvon Martin's death, has suffered a minor gunshot wound in Lake Mary, Florida, police tell a CNN affiliate. @webpagelink"},{"comment_id":"826467044152094","commenter_b":"Is Hillery totally without fault? Let's look over her speeches. Hillery would say \"WHAT DIFFERENCE DOES IT MAKE!\"","commenter_a":"Give it up Matt . Hey Matt how about Hillary apologize to the American people for all the lies she told and those four dead Americans she left to die in Benghazi 😡","post_message":"NBC's Matt Lauer is still OBSESSED with Melania Trump's speech. #RNCINCLE"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"\"If I think for some reason it's not going to work, then I go back to my business,\" Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. \"There's no question about that.\""},{"comment_id":"10152881196379753","commenter_b":"So would you rather have the Transgender in the men's bathroom? Chances are SHE Is attracted to men. So would you like HER to go in there and check you guys out? Should lesbians have to use the men's bathroom then? Fucking. Ignorant","commenter_a":"Everyone should boycott planet fitness \" Political bullshit run foul again! Hope the woman sues there ass off.","post_message":"This woman thought she saw a man using the ladies locker room at her Planet Fitness. When she complained to the front desk, they responded by cancelling her membership.  Should transgender men who identify as women be allowed to use women's bathrooms/locker rooms?"},{"comment_id":"10153060758061162","commenter_b":"What?","commenter_a":"i tink he looks cool and should have done the other side too","post_message":"SENTENCED: A man nicknamed \"Eyeball,\" because of a face tattoo that included the whites of his right eye, is sentenced to 22 years in prison for shooting an Alaska police officer.  PHOTOS: @webpagelink"}]
