[{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"10152662360374117","commenter_b":"Trevor clearly you're an angry misogynistic ass with your little troll posts. Ha.","commenter_a":"What's really alarming is that around 1 in 3 women will be sexually assaulted in their lifetime.","post_message":"Well, this is alarming."},{"comment_id":"10153779431271178","commenter_b":"Go away far away Whoopie aka Karen !","commenter_a":"Just keep diggin your hole, eventually you will all fall in!","post_message":"Actually, there is...and it's a big one."},{"comment_id":"10157253812445725","commenter_b":"#VoteTrump2016 #StopTheEstablishment #ProtectTrump #ImWithYou #MAGA","commenter_a":"We believe!!!! #trump2016","post_message":"IF YOU DO NOT BELIEVE IN YOURSELF- NOBODY WILL! •DJT"},{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."},{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM!  Shared by Occupy Democrats, LIKE our page for more!"}]
