[{"comment_id":"10153142288487217","commenter_b":"USA is a dangerous place to live in. even Army men are not safe there. the brave men was unhurt in France even in terrorist attack. but in USA he got stabbed. Muslims terrorists are everywhere in USA TODAY","commenter_a":"Ban knives!!!!","post_message":"The airman, who was hailed as hero after the French train terror attack, is in a stable condition after being stabbed in California"},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"903785579812018","commenter_b":"OH BUT HE\"S BLACK HE DON\"T KNOW NO BETTER.SHIT HANG HIS ASS","commenter_a":"So sad","post_message":"She was shot down in cold blood and there were never any riots. This was a tragedy, and she will never be forgotten. Can we get 10,000 'LIKES' in her memory?"},{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for \"being too loud.\" The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"10154157874771130","commenter_b":"@username Your comment shows you failed to do any research before blabbering...a familiar Trump trait. The Ukraine government was propped up by the Russian government at the time Manafort was dealing with them. It was Russian/Soviet Union weaponry that took the life of a cousin in Vietnam. I'm a veteran from the Reagan era and broke out in a cold sweat every time general quarters was sounded thinking Russia/Soviet Union had finally attacked us. From the day I first opened my eyes Russia/Soviet Union was my country's enemy. Today's Russian government mirrors the government of my former enemy and the GOP candidate praises their leadership and hints that we should crawl in bed with them...I THINK NOT!!!!!","commenter_a":"Well, this is not news; Dumbocrats support rigged elections not the popular support. I don't get it, why leftists are so stupid and dumb?","post_message":"Size isn't everything 😜"},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"}]
