[{"comment_id":"10153830280558145","commenter_b":"We should ban you Elena","commenter_a":"Sad but another gun happy state like this one dumb hicks and beers","post_message":"A popular reporter and her son were fatally stabbed by another son, who then fatally stabbed himself, police say."},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."},{"comment_id":"543574859135802","commenter_b":"Those dang Muslims and their transgender bathrooms...","commenter_a":"No fucking way my child would ever be placed in a school where boys could come into a bathroom with her..fuck is wrong with people?i am SOOOO glad To live in Kentucky these days..in all honesty I've always hated it here but at least my state doesn't go for all this liberal,homo,Muslim bullshit..","post_message":"What can only be described as an absolute shitstorm."},{"comment_id":"1195181073877040","commenter_b":"Kick her ass out","commenter_a":"What does Jesus tell us about judging others. I get what your saying, but look in the mirrior and pull the plank out of your own eye before pulling the spec out of anothers. Peace","post_message":"Do you think she should be KICKED OUT of the Olympics??"},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10153571769331545","commenter_b":"She prolly can throw baseball better than you","commenter_a":"@username hope I look half as good as her if I make it to 105!!!","post_message":"She's 105 and about to make you smile!  Her story: @webpagelink"},{"comment_id":"10152884015311336","commenter_b":"No that would be michelle Obama. That thing has an Adam's apple.","commenter_a":"Maybe they could use the canned food to prepare REAL meals for the kids and throw the Michelle Obama school lunches at the attacker.","post_message":"A principal in Alabama wants to stockpile cans of food in classrooms so that students can “stun an intruder \"or even knock him out\" until police arrive.  What do you think? Is this a good or bad idea?"}]
