[{"comment_id":"1263663783712155","commenter_b":"Dump her. No more talk about her.","commenter_a":"She's a slut see her tapes she delete the best ones","post_message":"The media's having a field day with Alicia Machado's attacks on Donald J. Trump.  But there's a lot in her past they won't report. And we're not talking about the sex tape everyone else is fixated with..."},{"comment_id":"10153811889982994","commenter_b":"Isn't that what the looney bin was made for? Lock her up!","commenter_a":"Hansel and Gretel's villain just got made","post_message":"'May I have a taste?' Minnesota woman allegedly threatens to eat neighbors' children"},{"comment_id":"1341354572550959","commenter_b":"Right by Tacoma General","commenter_a":"Good. That's the way it's supposed to work. You rob people, you get shot. End of story","post_message":"A man was shot and killed yesterday evening after robbing two people at gunpoint in Tacoma. Natasha Chen reports, 5 p.m.: kiro.tv/LiveNews  What we know now: kiro.tv/TacomaShot"},{"comment_id":"10153095975513606","commenter_b":"Unreal. Where I grew up the \"N\" word was used frequently. Every time I was called that I retaliated. Im not a thug or a criminal. The teacher has to respect the students and vice versa. In hindsight the student should have went to the principal and then to his parents. Im in no way condoning what the student did but its a 2 way street. Dont bash the student when we dont know exactly what rhe teacher said. Racial slurs or any other forms of racism has no place in society. My kids or the kids I coach cant even say anything like that. Either way whatever was said isn't the problem. It was the lack of respect from the teacher and STUDENT.","commenter_a":"@username you say teachers need to watch what they say. I don't get it. What about the child. Dosen't he need to be taught. I don't like what you said so I punch you. There are other ways of handling verbal abuse. This is disgraceful.","post_message":"Witnesses say a Prince George's County Schools student punched his teacher over a racially insensitive comment: @webpagelink"},{"comment_id":"1260437270671484","commenter_b":"come on something good has to happen, we had a failed bomb in a car earlier","commenter_a":"El mi nomas cesar godinez ok pinches lacras puro blu cabrones","post_message":"BREAKING: Police pursuit in Palmdale, CA (Viewer Discretion Advised)"},{"comment_id":"1072635379446872","commenter_b":"That is one sick bitch to say such a thing","commenter_a":"SHOVE A RAT UP THE NIGGAS CUNT AND COCKROACHERS UP HER ARSE, NOW RAP A SONG ABOUT THAT YAH FUKIN GOLLIWOG.","post_message":"Azealia Banks tweeted Monday that former Alaska governor and 2012 Republican vice presidential nominee Sarah Palin should be “gang-raped by black men.”"},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."}]
