[{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"},{"comment_id":"1328759877154299","commenter_b":"Karen >>> Integrity is not exactly an attribute of the Leftists. BIRDS of FEATHER, flock TOGETHER!","commenter_a":"My message to these \"journalists\". I don't care if you're talking about Trump, Obama, Clinton, or aliens. Using that kind of language is a disgrace to your job, which you obviously don't deserve. Your blatant disregard for any kind of integrity obliterates any credibility or respect you had with me. If you expect people to listen to you, make your use of language worth listening to or find another career that better employs your lack of ethics, if such a thing exists. Good luck with that.","post_message":"If a journalist said this about Barack Obama, the collective outrage from the press could be measured on the Richter scale."},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"663264380530807","commenter_b":"Yes! Disgusting!! Vulgar!!","commenter_a":"Yes,don't wish to see their underwear or ''butts''.keep them covered","post_message":"These thugs were arrested after refusing to pull up their pants.  Hilarious. Let's make this a law, who agrees?  Should excessive sagging be illegal?"},{"comment_id":"10156612932690354","commenter_b":"Washed up schmuck","commenter_a":"The difficulties were not due to him being black.","post_message":"WATCH Geraldo Rivera blame, well, YOU for Obama's failed presidency!"},{"comment_id":"10152759669890779","commenter_b":"let me tell you what happin to RED ASS.","commenter_a":"Today is your birthday? What's today?","post_message":"Twenty years have puff-puff passed since the stoner comedy Friday lit up movie theaters and became not just a cult sensation but a bona-fide classic. Ice Cube spoke with us about the success of the movie, the \"Bye Felicia\" meme and why the film is so beloved. \"It's cool – get high and all that – but the movie is memorable because it's the day that the bully got his ass whooped, and everybody loves that day.\" Click through for the full interview."},{"comment_id":"769546029761706","commenter_b":"karmas a bitch","commenter_a":"Tolerance! Take their Allah and Mohammed, tear up and urinate on it. Then we will talk tolerance.","post_message":"Italy: Muslims Destroy and Urinate on Virgin Mary Statue   @webpagelink"}]
