[{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"10154040772674778","commenter_b":"You're an idiot and idiots should not reproduce!","commenter_a":"Same sex marriage is not about love....it's about lust and sex...and it's nasty","post_message":"Here's the final paragraph of the Supreme Court decision legalizing same sex marriage across the nation. @webpagelink"},{"comment_id":"10154104815247061","commenter_b":"Its the degenerates who voted for a child rapist to run our country!","commenter_a":"I'm sorry.. I noticed some people responded to this story with the \"angry\" emoji... Why would anyone be angry at giving back to the community or better yet, to our vets?","post_message":"WATCH: President Obama and First Lady Michelle Obama serve Thanksgiving meal to residents of a retirement home for military veterans in Washington, D.C. @webpagelink"},{"comment_id":"866599370042152","commenter_b":"..Immigrants took our jobs? Really? I'll be damned! Well who gave them the jobs in the first place? Employers? They always hired the best I thought. OH! I know, those damned immigrants are the ones that sent our jobs to the Communists too, right? Lol. Watching Professional Bull Riding today. They are all Hispanics..","commenter_a":"If you can't speak our language then go back where you came from and stop taking jobs from Americans","post_message":"Plain and simple.   www.thepoliticalinsider.com"},{"comment_id":"979011448820924","commenter_b":"she would have just committed suicide another time someplace else","commenter_a":"Had her relatives posted bail, she would still be with us today. Shame!","post_message":"So close to the holidays...  A Texas grand jury has decided not to issue any indictments in the mysterious prison cell death of Chicago woman, Sandra Bland. Despite video evidence showing a display of excessive force from the arresting officer, the case now remains at a standstill.  MORE ---> @webpagelink"},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"}]
