[{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"1480804778605937","commenter_b":"FEAR-MONGERING ULTRA-RIGHT FASCISTS!","commenter_a":"Well, there's this...@webpagelink","post_message":"Washington State Republican Party chair Susan Hutchison​ is holding a news conference after the Washington state attorney general announced a lawsuit against President Donald Trump over the immigration executive order. >> kiro.tv/WASuesTrump"},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"\"This is what happens when you f*** with mother Syria all of your blood will be spilled.\""}]
