[{"comment_id":"10154067221877464","commenter_b":"@username BUT OF COURSE YOU WOULD BRING UP CHILDREN..because you are filth. All Cruz people dumber than dirt.","commenter_a":"Keep on going Ted! The more you make Trump mad, the more likely it is you beat him.","post_message":"Read more: @webpagelink"},{"comment_id":"949896131712475","commenter_b":"Even the black panthers want to kill white folks, lets start picking them up first and do something about them standing at festivals with AK 47's and other numerous guns, quit harping about only white folks having guns","commenter_a":"IT'S TIME TO DO SOMETHING ABOUT THE IDIOT'S THAT USE THE GUNS TO KILL PEOPLE SENSELESS...JUST CAUSE THEY PISSED OR DON'T LIKE YOUR COLOR!!!!!! NOT THE GUNS FAULT...THAT IS SO STUPID TO THINK IT'S THE GUNS FAULT...THAT'S LIKE SAYING BAN FORKS AND SPOONS FOR ALL THE OBESITY!!! TOTALLY INSANE!!!!!! LET'S BAN CARS FOR ALL THE WRECKS THAT KILL PEOPLE!!!! HEIGHT OF IGNORANCE!!!!!","post_message":"HELL YES!"},{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"10154415987472908","commenter_b":"DUMP TRUMP!","commenter_a":"Quite right. Remember Lincoln : \"A house divided agaisnt itself cannot stand\". Tell that to Trump who is SUPPOSED to be a Republican but he's a disgrace to their histoy.","post_message":"I do not want to see the frustration and the despair that so many people feel being picked apart by people like Donald Trump, preyed upon, in order to divide us again. A few months ago we were supposed to hate the Mexicans who according to Trump were all racists and criminals. And now we're supposed to hate the Muslims. That's not what this country is supposed to be about. We are strongest when we stand together."},{"comment_id":"10155088338670615","commenter_b":"The fact he did beaky at Buckingham Palace means he has risen in my expectations.","commenter_a":"Jamie Taylor","post_message":"We ♡ Stephen Fry! Congratulations to the happy couple!  @webpagelink"},{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the \"racism this, and political correctness that\" nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"\"I understand the true nature of the war, and slavery was not the primary issue.\""},{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"}]
