[{"comment_id":"10153203390966320","commenter_b":"Actually it's rent stabilized...different rules...","commenter_a":"a rent controlled apartment can not cost more than 2,100 a month. It even says so in the tenant laws","post_message":"Tenant accused of listing rate stabilized apartment for $649 a night on Airbnb @webpagelink"},{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"1134174459956481","commenter_b":"Put her in jail for contempt of court","commenter_a":"This trash needs to leave, NOW!!!","post_message":"Muslim Woman Refuses To Take Off Head Scarf In Court, So No-Nonsense Judge Does THIS In our country you have to follow the laws of our court. If not,  suffer the consequences. Do you support this no-nonsense judge?"},{"comment_id":"10154170271666337","commenter_b":"Umm I'm no Chris brown fan but I never heard of this chick till earlier this week. Last time I checked Chris had what people would call a very successful career and continues to make and sell records. Although I do feel for her... Life should never come to a point you need to attempt to end it.","commenter_a":"Um yes Chris Brown (nobody, singer ,wash up, hasbeen dumbass) there is a thing as attempted suicide....someone who did it and survived has ...guesss what \"ATTEMPTED TO KILL THEMSELVES\" you fucking ignorant talentless piece of shit","post_message":"Now Chris Brown has joined the ugly Kyrie Irving-Kehlani-PARTYNEXTDOOR situation..."},{"comment_id":"10154753086323967","commenter_b":"He is building a wall","commenter_a":"Come on, guys. Our new president told us this was all a hoax perpetrated by the Chinese. We're clearly in good hands.","post_message":"Unstoppable."},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"},{"comment_id":"10153513415174342","commenter_b":"They should serve the same time they kep him as their slave...","commenter_a":"Where are theBLM in this?","post_message":"A doctor and his wife moved from Nigeria to Britain in 1989 and with them came a 13-year-old -- whom they told officials was their son."}]
