[{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"},{"comment_id":"745552312280553","commenter_b":"Racism 101. Get rid of free soeech","commenter_a":"Make America Great Again","post_message":"Is this still AMERICA?!"},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"},{"comment_id":"1248799051839522","commenter_b":"Sue her!!!!!","commenter_a":"I didn't even read it","post_message":"You've got to be kidding!"},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10153617966566051","commenter_b":"Becky Jensen sorry but you are a dumb bitch","commenter_a":"Thank God","post_message":"The man noticed that a woman was crying next to him in line. When he asked her daughter what was wrong, he knew he had to take immediate action."},{"comment_id":"10153492850468984","commenter_b":"Tear them down! Burn them - just get rid of them and start a mass deportation of Muslims!!!","commenter_a":"First time I see one I am going to the ACLU and sue Islam is a dangerous cult and it offends me...","post_message":"Some of these claims seem quite bizarre. I wonder how this will be received by the American public.  What do you think?"}]
