[{"comment_id":"1508167409203284","commenter_b":"They'd kill all the children if it possibly meant no adult terrorists.","commenter_a":"Build them a safe place in their own country!!!","post_message":"“Every now and then, I’ll get a bad Skittle – but I don’t ban them all.”   - Rep. Luis Gutierrez made a dig at Donald Trump Jr.'s tweet about refugees and Skittles by chewing on the candy during a House Judiciary Committee hearing.   Read more here: @webpagelink"},{"comment_id":"10153246796329607","commenter_b":"Stop them now!!!","commenter_a":"Yes","post_message":"QUESTION OF THE DAY:   Should the U.S. stop accepting Syrian refugees? #FOX45QOD"},{"comment_id":"10153170547614170","commenter_b":"She will find a way to get out of it!!","commenter_a":"The Clintons are just like Obama, Lerner & Holder who all believe they are above the law.","post_message":"I don't know if people realize how big this is. It's such a serious violation of the law, even the New York Times is calling her on it And it's all because this woman is an obsessive control freak."},{"comment_id":"10157272858800389","commenter_b":"This is very inappropriate. It is not the job of Ginsburg to comment on any of the political constituents, democrat or republican. Her job is to interpret the law only and she is way out of bounds in this matter. If she wants to leave the country somebody would have to nudge her and wake her up because every time she is seen on tv she is either falling asleep or looking like she just woke up. It is way past the time for her to retire.","commenter_a":"This old prune needs to retire. She can't even stay awake. She's hateful!","post_message":""},{"comment_id":"10154655715146037","commenter_b":"@username many!!! What parents dress their little girls like a sex queen? Um, JonBenet's and other child beauty pageant moms- $$$, attention, fame....","commenter_a":"I am inclined to believe the story to be true. There are just too many claims against Michael not to take them seriously. Not to undermine the victims, but the thing that I really can't grasp my head around is why the parents of all of these children that Michael victimized allowed their kids not only to sleep over at a grown man's home, but also to sleep in bed with that grown man?! This makes no sense to me and the parents of these kids should be held accountable for their actions.","post_message":"When he \"began showing signs of puberty,\" Jackson was allegedly \"no longer as interested in him sexually.\""},{"comment_id":"10153001581342377","commenter_b":"right CMc and send their illegal babies with them If they weren't made in America they are not American stop giving them birth certificates you just encourage illegals to come here Is this hard to understand??","commenter_a":"It's the law. They are here illegally and, according to the law, they must be deported. Trump didn't make the law. All he's saying is that he would enforce it. The government has no problem enforcing other laws that people disagree with; why should this be any different?","post_message":"Trump's Proposed Deportation Effort..."},{"comment_id":"1252245691520631","commenter_b":"Simple...don't allow anyone in from radical terrorist countries until their country has a way to prove who the person is. Until then they can all stay there and fight in their own countries. Make their own America or their own hell. Whatever they want. But don't do it here.","commenter_a":"Time to shut the doors to these people. All. Until there is a better system.","post_message":"Don't expect to hear a word about this in the media.   This is the kind of info that is horrible for the left."}]
