[{"comment_id":"475027816013769","commenter_b":"Guess she is a shameful person.","commenter_a":"Remember, she was also \"ashamed\" that Bush was from Texas","post_message":"Dixie Chicks member Natalie Maines also took aim at Donald J. Trump, tweeting, \"As long as Donald Trump's decisions for America are as solid as his decision about his hair, we're in good shape.\""},{"comment_id":"10154807029567293","commenter_b":"Make Racists Afraid Again.","commenter_a":"Have another drink, hillbilly hick","post_message":" not a bomb in your bag, is it? the man said, according to a passenger."},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10153880713234753","commenter_b":"Do better job then Hillary","commenter_a":"Vote trump","post_message":"A Latino Trump supporter in California claims it’s a lot more difficult to publicly support Donald Trump than to come out as gay. Juan Hernandez, who is a member of the Log Cab Republicans, a gay conservative group, indicated that he was leaving the Trump rally in San Jose, California, on June 2, when a mob of violent Trump protesters attacked him, breaking his nose in the process. A friend was similarly set upon by the assailants, some of whom carried the Mexican flag and were burning the... @webpagelink"},{"comment_id":"10152865341779342","commenter_b":"Mexicans do deserve some credit so here it is. Murder up 67%- committed by illegal aliens Child molestation up 97%- committed by illegal aliens Rape up 53%- committed by illegal aliens Gang violence up 78%- illegal aliens Robbery up 62%-committed by illegal aliens aliens Car thieft up72% - committed by illegal aliens Economy down - contributed by illegal aliens Jobs down - contribution illegal aliens aliens Welfare abuse up 98% - fraudulent claims filed by illegal aliens aliens I could keep going but I think you get the picture.","commenter_a":"Want Mexican music go to Mexico. Pretty simple don't you think?????","post_message":""},{"comment_id":"10153775043868984","commenter_b":"They are monster","commenter_a":"Go Trump/Cruz","post_message":"Barack Obama may be trying to act like a humanitarian by letting in 10,000 Muslim refugees from Syria. However, what the media isn't reporting on is who Obama is kicking OUT of the country... When America finds out just who he's deporting, they're going to be FURIOUS."},{"comment_id":"10154752399793598","commenter_b":"They should be called feminazists","commenter_a":"So true!","post_message":"200 Million Girls Killed in China, Where Are the Feminists?"}]
