[{"comment_id":"10153598049151336","commenter_b":"Kill her","commenter_a":"Molly, America loves you.","post_message":"Former Baltimore Ravens cheerleader Molly Shattuck was sentenced to two years of probation after pleading guilty to raping a 15-year-old boy at a vacation rental home in Delaware."},{"comment_id":"10154131960333797","commenter_b":"It's a free country. She is free to leave!","commenter_a":"Bye bye!","post_message":"\"WHAT HAVE I DONE?\" British-born actress Emily Blunt became a naturalized U.S. citizen in August, but now she says it was a \"terrible mistake.\" What do you think? Here's what made her come to that decision:"},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"10154528974934062","commenter_b":"I want to meet Bruce Jenner aka caitlyn","commenter_a":"Don't care","post_message":"Jenner is apparently in town filming her new television show, \"I am Cait.\""},{"comment_id":"1389869284386873","commenter_b":"Nothing, absolutely nothing. Vote them all out, they deserve to be jobless.","commenter_a":"They took a lot of time off, which means they weren't doing even more stupid hurtful stuff.","post_message":"We'll wait.  Like Addicting Info for more great content!"}]
