[{"comment_id":"962901507102931","commenter_b":"Evil mother!!!","commenter_a":"That's just cruel!!","post_message":"This is what happens when a mum feeds her toddler a spicy Jalapeño chilli pepper ... 🌋🔥"},{"comment_id":"10157460185340725","commenter_b":"Awesome speech in The Motor City, Mr. Trump. Inspiring, uplifting. Gave me goosebumps!","commenter_a":"CHINA = GARBAGE","post_message":"My trade reform means STRONG protection against currency manipulation."},{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"},{"comment_id":"635686593246783","commenter_b":"@username As much as you might want there to be, there is Nothing wrong with Hillary's e-mail account! Just ask Colin Powell and Condoleezza Rice, who operated the same way.","commenter_a":"if I vote, I want it to count and be counted, that's the promise, Every Vote Counts, well except when Bush was elected","post_message":"It is probably way overdue.  Conservatives Are Destroying Our Future"},{"comment_id":"10154343066022507","commenter_b":"@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"},{"comment_id":"675938265864099","commenter_b":"@username you wish your wife could be a go go dancer.","commenter_a":"Melania is an absolutely classic beauty. Proud of our new President and First Lady. May this country start healing and become whole again.","post_message":"Donald J. Trump was just sworn in as the 45th President of the United States.   How does this make you feel?"},{"comment_id":"10154938661994328","commenter_b":"She is so cold look at her eyes they are evil!!!! They are illegal they have already committed a crime breaking our law.","commenter_a":"These left-wing liberals keep saying illegals should not be asked about their immigration papers, or lack of, because then they won't bear witness against criminals. HeII, they don't anyway! The last thing illegals are interested in is going into a Court of Law! These people will suffer in silence before testifying against one of their own. It's time for a change. In Europe, everybody has a PassPort or legit I.D. And cops and soldiers can stop you at any time. You produce that I.D. or you go to jail. Simple. Time for a national I.D. in the States!","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."}]
