[{"comment_id":"10153014740596545","commenter_b":"@username stop right there. No Bush should be allowed in politics anymore. They've controlled things long enough!","commenter_a":"Go away Rick Perry......far away!","post_message":"Rick Perry referred to the Charleston incident as an \"accident\" on Friday; staffers said he had meant to use the word \"incident.\""},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"1004502652963001","commenter_b":"Better hope Hillary don't get to be President. This country will be a goner in 4 yrs. if she does.","commenter_a":"Oh, so Democrats are crossing over to vote for Trump. I see your game plan Dems. After Nov. gets here and if Trump is the nominee you all will turn around and vote Democrat.","post_message":"#FloridaPrimary"},{"comment_id":"10156647323865725","commenter_b":"Marco Rubio supports illegals and anchor babies, no thanks!","commenter_a":"Bring the law suit against that lying politician. His ads are nothing but LIES and the only thing he does with any certainty is to lie about others and make the dishonest ads on TV trying to start a smear campaign. He's an underhanded ,sneaky and despicable person.","post_message":"RESPONSE TO THE LIES OF SENATOR CRUZ:   Ted Cruz is a totally unstable individual. He is the single biggest liar I’ve ever come across, in politics or otherwise, and I have seen some of the best of them. His statements are totally untrue and completely outrageous. It is hard to believe a person who proclaims to be a Christian could be so dishonest and lie so much.   Cruz said I would be appointing a liberal judge when in fact I will appoint a great conservative and I am the only candidate who has gone so far, at the debate, as to suggest two individuals I feel would best represent the conservative values we need to protect: William “Bill” Pryor Jr. and Diane Sykes.   Cruz says I am pro-choice, when in fact I am staunchly pro-life and have been for a long time. Like Ronald Reagan, on many issues, I have evolved.   Cruz says I am in favor of ObamaCare, when in fact I have spoken about repealing and replacing this disaster of a system at every speech throughout my campaign and since it’s inception. Meanwhile, Cruz was responsible for getting Bush to put in the judge that failed to vote against ObamaCare twice.   Cruz says I will try to take away your second amendment rights, when I am one of the strongest proponents of the right to bear arms and I say so in every speech that I have made for years. I am a proud member of the NRA and so are my sons.   Cruz has become unhinged and is lying with the hopes that his statements will go unchecked until after the election and he will save his failing campaign.   In Iowa, Cruz told thousands of Ben Carson voters that Dr. Carson had left the race and to instead vote for Ted Cruz. He apologized when the race was over. Likewise, his fraudulent voter violation form sent to Iowa voters. If Ted is going to continue to lie with such desperation, I have no choice but to fight back.   One of the ways I can fight back is to bring a lawsuit against him relative to the fact that he was born in Canada and therefore cannot be President. If he doesn’t take down his false ads and retract his lies, I will do so immediately. Additionally, the RNC should intervene and if they don’t they are in default of their pledge to me.   I am the strongest on the borders and I will build a wall, and it will be a real wall. I am strongest on illegal immigration, strongest on ISIS, strongest on the military and I will take care of our Vets. I will end common core and preserve the second amendment. I will renegotiate our trade deals and bring our jobs back to our country. I am the only person who will Make America Great Again."},{"comment_id":"10150935097914999","commenter_b":"no clue what you're talking about?? You're not a woman so sfu!","commenter_a":"No, she's a hypocrite! Have you ever watched an abortion? I have...in 20 weeks it is a baby. In late term abortion labor is induced. The baby's head is delivered. a small incision is inserted into the back of the head the knife is twisted to kill the baby. The brains and skull is crushed.","post_message":"\"Hillary Clinton owned her feminism. She sounded like the first woman running for president, defending other women — our autonomy and our control of our own bodies,\" Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"}]
