[{"comment_id":"10153702004727464","commenter_b":"He is my Prince.","commenter_a":"Conservative....I don't think that word means what you think it means.","post_message":"Act out a scene from The Princess Bride?  As you wish..."},{"comment_id":"10153259880651162","commenter_b":"I wonder what he thought was going to happen to her after he beat her w/ the hammer?","commenter_a":"Hit her in the head with a hammer and get an I bond He's the real MC. HAMMER","post_message":"HAMMER BEATING: An 87-year-old man beats wife with hammer at a hospital to avoid her surgery ..@webpagelink"},{"comment_id":"10154364197411336","commenter_b":"Lady you are unbelievable","commenter_a":"Chris Kyle: American Liar","post_message":"A federal appeals court has thrown out a $1.8 million judgment awarded to Jesse Ventura, who says he was defamed in Navy SEAL Chris Kyle's book \"American Sniper.\""},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will \"immediately terminate\" it."},{"comment_id":"10153718263126028","commenter_b":"So they take a class to prove they're old enough to safely operate a vehicle that had the potential to kill themselves and other and its ok. But they also learn about the dangers of smoking and drinking at age 13 (give or take a year) in mandatory health class yet can't smoke or drink till 18(now 21) and 21? The logic is just weird.","commenter_a":"Why is it that we don't let people smoke till 18 and drink till 21(both of which mainly affect their own health) yet we trust teenagers as young as 15 and a half to drive a vehicle with the potential to kill others? Seems a little backwards doesn't it? Saving people from themselves but not saving them from others.","post_message":"The smoking age in California is now 21. @webpagelink"},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"}]
