[{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"1147435038611171","commenter_b":"Really then why are they successfully managing to pay this in states,who have adopted the 15.00 an hour wage. Stop the lies. The people on top are only concerned with their grossly extravagant life styles. It's time to say enough is enough! No one is buying this line of crap anymore pay people a damn wage they can live on!!","commenter_a":"just read poll conducted....sample of just over 3,000 small business owners with 25 or less employees.....67% said they would sell out if could receive a purchase price of 20% loss of amount of capital invested.....wow.....would sell out if offered 80% of capital investment, going concern.....\"going concern', a reference to business in operation.","post_message":"He doesn't say it but a $15/hour minimum wage will crush many restaurants. Even higher end restaurants."},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"10153089911647483","commenter_b":"Noo, not this sweet looking nice white lady!!","commenter_a":"That's sad","post_message":"She was arrested for stealing an 8-foot HDMI cable priced at $39.99 from the Best Buy."},{"comment_id":"10153903650539087","commenter_b":"@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"1272820716123006","commenter_b":"Women like you make me so embarrassed for my gender! The same that screwed America with Obamacare. Truly disgusting","commenter_a":"There is a clear path of the Democratic Party to take the presidency, the house and the senate... This is the core issue why the FBI director was pressured to make the announcement... #Ihaveherback Grab them by the polls vote blue","post_message":"JUST IN: Federal investigators looking into Hillary Clinton email matter have obtained the warrant needed to start reviewing emails found on laptop used by Anthony Weiner and Huma Abedin."}]
