[{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10152535157075496","commenter_b":"And she protects children!!!","commenter_a":"Just because you make some mistakes in life does not mean you should not be able to work! DFACS clearly states in their policy that she is okay to work for them! There's no need to put this woman on blast like that. Making some mistakes doesn't make her incapable of helping children in need. It's unfortunate people are being so judgemental. I'm glad DFACS is protecting her in the workplace.","post_message":"HOLDING THE POWERFUL ACCOUNTABLE: A state investigator responsible for ensuring the safety of Georgia's children can be convicted of forgery and pulling a gun in a road rage incident and apparently still keep her job.   See more: @webpagelink"},{"comment_id":"899130260122396","commenter_b":"Eat what we or go back to your own country.","commenter_a":"Just go away.","post_message":"OUTRAGE"},{"comment_id":"1566749223612191","commenter_b":"Make no mistake Maggie I no where near put A women that murders children on the same level as animals. ANIMALS ARE BETTER THAN THAT.","commenter_a":"If a woman has an abortion she should IMMEDIATELY BE FIXED SO SHE CAN NOT EVER KILL ANOTHER CHILD.","post_message":"Abortion is MURDER!"},{"comment_id":"10155495493551509","commenter_b":"I love SNL.Meanwhike Trump should realize his comments about women aint no laughing matter.He's going to lose then divorce Melania then marry a young p*ssy!","commenter_a":"@username SUCKS AND BLOWS..HILLARY PLACED NATIONAL SECURITY OF THIS COUNTRY IN DANGER BECAUSE OF HER EMAILS AND YOU GO AFTER TRUMP BECAUSE OF A TIRED LATE NIGHT COMEDY SHOW..HAVE YOU NO DECENCY SO PETTY SO SMALL @username HAS BECOME","post_message":"\"Donald J. Trump's tweet that Saturday Night Live  needs to be canceled because the show did a 'hit job' on him should concern every American,\" writes Dean Obeidallah for CNN Opinion"},{"comment_id":"10152882681411028","commenter_b":"Man ..... She Can Eat LOL","commenter_a":"I just are a bagel this morning and had a great cupe of Coffey.","post_message":"Molly Schuyler ate three 72-ounce steaks, three baked potatoes, three shrimp cocktails, three salads and three rolls in way less time than it'd take for someone to cook all that food at home.  And the reason she turned down a fourth steak? She was sick of the taste -- not full. @webpagelink"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."}]
