[{"comment_id":"10155080825746037","commenter_b":"Andrea ... it is scientific fact that bees couldn't fly without wings, but, pull the wings off of that bee and it is still a bee ! Semper Fi","commenter_a":"There is a scientific basis for being transgender. The brain's gender identity and the genitals develop at different times in utero. So mismatches due to hormones are possible. If God knits these children together in the womb, He must do some transgender knitting. A boy who goes through a phase of wearing a dress is entirely different than a boy who persistently and insistently over a number of years says he is really a girl. Psychologically, it is best for these kids to use modern medicine to enable their outsides to match their insides.","post_message":""},{"comment_id":"10154156813446926","commenter_b":"It is indeed a colony of the US, and it cannot survive without Billions of dollars of aid from their masters. Israelis should decide what future do they want for their children, one in which they are perpetually fighting a war, or one in which they can make peace and learn to live with mutual respect. --- As far as ethnic cleansing is concerned..this is again the same issue. It is only ethnic cleansing when the Jews are forced out of their homes, it is not ethnic cleansing when ZIonist militants throw out Palestinians from the homes they were living in for centuries.","commenter_a":"The way I see it Israelis will be in the Palestinian villages for a long time..... society whose leaders campaign for a convicted terrorist to be given the Nobel Peace Prize, a society that teaches its children hatred and violence as part of its standard curriculum, a society that unabashedly teaches anti-Semitism through all means available, a society that puts suicide belts on children during political celebrations, a society that honors, glorifies and funds terrorists, a society that uses a hateful version of religion to poison the minds of its children, a society that engages in widespread jubilation when Jews are victims of terrorist attacks, is not a healthy society that can develop peace of any kind.","post_message":"#Israel's occupation forces in the #WestBank have used at least three Palestinian family homes as military posts in recent months"},{"comment_id":"10154858254049497","commenter_b":"Hopefully, I last a little longer than 24 hours. 🤔","commenter_a":"@username :) Honestly, I admire this about you. You explore things and excel at them. But it's just kinda funny.","post_message":" crazy. He throwing himself into cooking and collecting vinyl when he only had his microbrewing kit 24 hours."},{"comment_id":"945825838793990","commenter_b":"nothing but a whore from the sixties.","commenter_a":"Ask her to please go back to Vietnam where she loves it so much .","post_message":"Actress Jane Fonda, who 45 years ago as making the lives worse for Americans fighting for their life in the jungles of Vietnam, is now making lives worse for American energy producers. Given the fight Fonda now has against North American oil discovery and transportation, she has once again aided and abetted the enemy: Islamic oil producers. It seems Jihadi Jane neither understands how her actions are viewed by the enemy (major Muslim oil exporters, some of whose core members want to see the destruction of the United States) nor how these anti-jobs protests impact hundreds of thousands of North American families. @webpagelink"},{"comment_id":"10154034711816770","commenter_b":"You know damn well its the ladies who wizz all over the seat when they do their \"hover\"","commenter_a":"Tired of people thinking they can change the law because they are a part of a small percent of people married to same sex. It's bad enough we have men in a dress pissing all over the toilets in the ladies room.. Being gay shouldn't give you special entitlement.","post_message":"The Supreme Court of Arkansas ruled late this week that LGBT persons who are married to a child’s birth parent but not biologically related to the child do not have a constitutional right to be listed on the child’s birth certificate."},{"comment_id":"1753789991533439","commenter_b":"Well one less lesbian in the country .","commenter_a":"Stop getting our hopes up and just get the FUQ out! Useless waste of oxygen","post_message":"Rosie O'Donnell To Leave The Country For This Awesome Reason.  Good riddance. We don't want her anyway.  Would you be happy to see her go?"},{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"}]
