[{"comment_id":"10150887913809999","commenter_b":"Ya and she is going to jail if she don't win so she will say anything to get her way! She will do what ever it takes.... Murder . lie . steal. #Trump2016 #MakeAmericangreatagain #GodblessAmerican","commenter_a":"I can't believe Americans will vote for this idiotic woman, but they will and bring another 4 years suffering to the world","post_message":"\"Donald Trump has built his campaign on prejudice and paranoia. He is taking hate groups mainstream and helping a radical fringe take over the Republican Party,” Hillary Clinton said."},{"comment_id":"10152900481316336","commenter_b":"Racist bitch^^^","commenter_a":"She must be a Muslim....no sensativity to killing her own new born?","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."},{"comment_id":"689502327907012","commenter_b":"Such an amazing message.","commenter_a":"Amen..and yay for them for standing their ground! I love them,and the show.","post_message":"Obama didn't want them not to talk about Christianity on TV, so they did this instead. In America we have freedom of speech. Let's show them our support. Can we get 175,000 'LIKES' because they refused to censor their faith?"},{"comment_id":"10153307744490329","commenter_b":"Milliner - ladies hat maker. I'm cool with it","commenter_a":"Switchboard operator....pretty fitting, considering I'm a medical secrerary","post_message":"Vaudeville Star? Bootlegger?"},{"comment_id":"10153525959526336","commenter_b":"The mom is a idiot No common sense dumb woman that is it Let lock her up in a hot car and see if she likes it That little girl was soak with sweat even with the windows rolled down a little bit duh","commenter_a":"She took one kid with her and left the other one in the car????","post_message":"Video below shows the moment that officers freed the little girl from the van."},{"comment_id":"10154492654832690","commenter_b":"@username Your belief in polls probably left you disappointed on November 8th didn't it? SMH","commenter_a":"Who actually goes to an inauguration? Ask how many people are happy Obama will no longer have any control. Your poll will be more meaningful.","post_message":"Are you going to President Trump's inauguration?"},{"comment_id":"10152892004126051","commenter_b":"This sick woman took advantage of boys. This was not age-appropriate activity. Why can't you creeps see the truth in that? The kid who told did the right thing.","commenter_a":"Kids these days,when I was a teenager we dreamed of something like that happening to use but now these little sissy go crying to their mommies. don't figure","post_message":"Police took one look at what this woman did to kids at a bar mitzvah and arrested her as quickly as they could."}]
