[{"comment_id":"900975760004551","commenter_b":"Or woman!!!!!!","commenter_a":"Not just white men no man should talk like that it is bad what ever color they are.","post_message":"RT LeBron James: “White Men Don’t Have the Right to Talk Like Trump in Locker Rooms or Elsewhere”"},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"10154884706896729","commenter_b":"She wasn't worthy to be a. Olympican","commenter_a":"Then she gets disqualified and out of the Olympics!!! Send her home!","post_message":"Islamic anti-semitism on full display, folks..."},{"comment_id":"10157089744255347","commenter_b":"If Obama lied about military service/valor, would he be a hero or a liar? My guess is he'd be a liar, so how is this man still a hero?","commenter_a":"Chris Kyle was an American war hero...PERIOD. You liberal hacks need to find another hobby :/!","post_message":"American Sniper Chris Kyle told yet another lie: How many medals he received."},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"10154976880629614","commenter_b":"Ok","commenter_a":"The car man was driving was a stolen car ?","post_message":"El Monte police are heard firing multiple shots at a suspect tonight in a video provided by a witness.   One man was shot and injured after a slow speed pursuit. His current condition is unknown.   Read KTLA's story here: @webpagelink"},{"comment_id":"512225352297167","commenter_b":"put that baby arm away bitch get tight hoooeeeee","commenter_a":"Savage","post_message":"It be like that "}]
