[{"comment_id":"10153331851941509","commenter_b":"There's a law in Alabama that says a man has to walk fifty feet in front of an automobile waving a red flag, if a woman is driving. In Ca. You can't shoot jackrabbits from a moving streetcar.","commenter_a":"Honorable lawmakers. Do not longer exist. This is just a small example of how good taste, decency, decorum and such, form no longer part of our society.","post_message":"Congressman Alcee L. Hastings, citing a dildo law, among other things, has some harsh words for Texas lawmakers. Now Texas lawmakers are demanding an apology. @webpagelink"},{"comment_id":"10154357156724062","commenter_b":"Short girls struggle too the regular is always too long😔","commenter_a":"Does she wear jeans & where does she purchase them? I'm nowhere near her height but have a helluva time finding them long enough. lol","post_message":"Who is the model with the longest legs in the world? Turns out a Houston girl can now claim that title..."},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"},{"comment_id":"10154724621788984","commenter_b":"Hey Walmart has glasses 2 for the Price of one One for your dumb Head and one for Your your brown spot","commenter_a":"Lady you need to get your head out!Quit your job cause you are not of sound mind like Hillary Clinton","post_message":"Attorney General Loretta Lynch just issued a message to Charlotte rioters - and something about it immediately raised eyebrows."},{"comment_id":"10153060626041162","commenter_b":"I'm gonna jump a girl I see walk passed me Jk","commenter_a":"Notice how these kids are not American...Im sure it would be a different video here","post_message":"VIDEO: In an experiment designed to explore violence against women, young boys were asked to slap a girl.   Watch how they responded: @webpagelink"},{"comment_id":"1514959711853944","commenter_b":"This reminded me of The Series of Unfortunate Events .... But this way wayyy cuter","commenter_a":"Alicia Thomas","post_message":"This is so cute!"},{"comment_id":"10154312935051337","commenter_b":"All i can say is wow! I mean since Bran can use his powers to enter into a body does that mean he will eventually enter into the white walkers body an control him by pushing out what was put in now that would be awesome.","commenter_a":"That was by far the saddest moment of this show! Rip hodor/direwolf.","post_message":"OH. MY. GOD. Craziest Game of Thrones yet?"}]
