[{"comment_id":"10152912269504071","commenter_b":"Idiot white people","commenter_a":"Why is it still okay to use the n-word in rap music? Why haven't people of color stood up against those of the same color that use that word?","post_message":"There a few other words more volatile than this one."},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"10154375635804342","commenter_b":"@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show.   Read more about the case here: @webpagelink"},{"comment_id":"10152911551916051","commenter_b":"Thats a Black Ass Dumb Bitch... Fry the Bitch.","commenter_a":"She needs a bullet. I hope they get that poor little the home and help he needs. This makes my stomach hurt","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"484066138450614","commenter_b":"@username any woman who needs a leader is not going to be the best wife.","commenter_a":"If that was my husband, he'd know his place, and it wouldn't be in my house. More like on the pavement.","post_message":"Kirk Cameron:  'Wives shouldn't tell their husband how he ought to be a better husband'"},{"comment_id":"456122197909407","commenter_b":"Evil beast","commenter_a":"And that black power flag of the black panthers.","post_message":"OKAY THEN..."}]
