[{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."},{"comment_id":"1089590774419709","commenter_b":"The most stupid people in America are and has been those always vote against their own economical interests. While the Democrat Party still was the people's party, all the aforementioned idiots were working class Republicans, but not anymore. Now the most disgusting idiots are Democrats whom supporting Queen of Monsanto, Hillary Clinton.","commenter_a":"Vote for the ONLY Candidate who stands up against Monsanto! Bernie Sanders!","post_message":"“If Monsanto gets its way, the American people will pay a high price for corporate greed and political corruption.”"},{"comment_id":"10152859256761051","commenter_b":"Sick ! Needs the same done to her !","commenter_a":"They all deserve prison for life without parole!!!","post_message":"The judge looked this grandma in the eyes, called her the most evil person he had ever met and sentenced her to 4 life terms."},{"comment_id":"1008727995814878","commenter_b":"Wolves are twice the size of a coyote.","commenter_a":"I bet the majority of you couldn't spot the difference between between a coyote and a wolf either.","post_message":":("},{"comment_id":"10153188400898352","commenter_b":"Do u.not care bout the girl","commenter_a":"Devil dogs","post_message":"Erin Ingram who lost an arm aged 8 in pitbull attack awarded $72M by jury"},{"comment_id":"10152988460430090","commenter_b":"Don't believe this stuuuupiiidd libtard propaganda!!!!!!! 64% of AMERICANS want the PIPELINE built l!!!!!!!!!!!!!! It will create 40000 jobs!!!!!!!!!","commenter_a":"So what that the Keystone has passed the Senate! That makes this oil no less dangerous to the American people! He has every right to veto something that only benefits 2 people, and of course those who were paid, Republicans and Democrats alike. Some \" American people\" you are! Traitors to your own land! My guess is that none of you have read about the countless oil spills going on at this moment in America and Canada. With the Keystone XXL, you get only larger amounts of oil in our ecosystems. Yellowstone already has at least 50,00 gallons of oil in it!","post_message":"The House, the Senate and the American people have spoken.  Tell Obama: DO NOT VETO: @webpagelink"},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."}]
