[{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"},{"comment_id":"10152892200414753","commenter_b":"Bitch","commenter_a":"how incredibly low and self absorbed are you that you could steal money and attention this way.hope you get all the attention you want now.","post_message":"A Florida woman is facing felony charges after cops determined that she faked having breast cancer in order to swindle thousands of dollars out of friends, family, and her supporters in the community."},{"comment_id":"10154221702747629","commenter_b":"I'm sorry about your kitty.","commenter_a":"Donald will make America great again! Even if he has to do it all by himself! This is what REAL LEADERSHIP looks like libturds!","post_message":"Donald J. Trump promised to “do it by myself” if squeamish party elders refused to get a grip on the hard job ahead."},{"comment_id":"517121775126150","commenter_b":"@username. Lucile's an idiot. Just ignore her.","commenter_a":"I never defend Obummer but it's probably better to keep him out of the White House and on the golf course.","post_message":"\"There was no movement away from the golf course, according to the White House Press traveling pool, which monitors the president’s movements.\""},{"comment_id":"10153355392014087","commenter_b":"Frank, public services are for the good of the whole. Socialism is when you have a garden with beautiful tomatoes and I, being too lazy to grow a garden, get my share of your tomatoes. Not because I deserve them, because the government said you have to give them. How ling do you think you will continue to grow that garden to feed my lazy butt? Socialism fails because the workers quit working also because there is no reward to their labor. The workers will become the lazy also and there will be no tomatoes. Figured I had better break it down to kindergarten level for you.","commenter_a":"If you support sanders, go live in Cuba. Democratic socialism there already.","post_message":"Bernie Sanders is increasing the size of his campaign staff and boosting state budgets, according to a new report."},{"comment_id":"1659577024311353","commenter_b":"Trump has no chance of beating Hillary---and that is a fact. She would chew him up.","commenter_a":"Just another reason to vote for Trump!","post_message":"I'll help you PACK!"},{"comment_id":"10154430974181756","commenter_b":"The world hasn't forgotten.","commenter_a":"It's sad that it happened 2 years ago yet the world forgot them and nothing has been done to end the ordeal. Smh","post_message":"The young woman reportedly said some of abductees have died but many remain alive in Boko Haram captivity.   The mass abduction in April 2014 sparked worldwide outrage."}]
