[{"comment_id":"682213861917317","commenter_b":"We continue to deport illegals but tgey come back. We need trumps wall","commenter_a":"All traitors MUST be put into jails, All illegals MUST be deported!!! Vote Trump and Reject the evil socialism of crooked Hillary as well as insane and hypocritical Bernie! Think of North Korea and Venezuela! \"The problem with socialism is that eventually you run out of other people's money\" - Margaret Thatcher","post_message":"The protesters in New Mexico were thugs who were flying the Mexican flag. The rally inside was big and beautiful, but outside, criminals!"},{"comment_id":"10153061707381051","commenter_b":"Stupid bitch needs her face slapped until she falls out..","commenter_a":"She is no mother, glad to see someone finally called the police on one of these child abusers rather then just posting it.","post_message":"Onlookers were genuinely shocked when they saw how this teen mom was treating her child."},{"comment_id":"10153035169591051","commenter_b":"Execute her how could she","commenter_a":"They are raising a bunch of animals!","post_message":"This 14-year-old killed a 2-month-old because she didn't want her mother to adopt the baby girl."},{"comment_id":"518655931675108","commenter_b":"@username no all men do not have affairs!!","commenter_a":"Thank you Marine for speaking the truth Hillary is a liar and murderer and should be put in the electric chair, Bill is as bad as Hillary and I can understand why he was screwing Monica. From what I read Hillary likes screwing with other women","post_message":"Marine Confronts Hillary To Her Face About Benghazi, And Then THIS Happens [VIDEO]  Let's show this man our support!  Can we get 30,000 'LIKES' for this Marine?"},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"10153563067675667","commenter_b":"@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"613162948816887","commenter_b":"Try to imagine how little I care about anything this pre-teen brain has to say.","commenter_a":"She's a f*cking but job anyway....","post_message":"She is PSYCHO crazy folks."}]
