[{"comment_id":"10153779454116336","commenter_b":"She's a snake!","commenter_a":"Shes all done for now, goodbye Hillary","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"10154606331071037","commenter_b":"She will not become president!","commenter_a":"I will wait and see what he does when he is actually president this is just all talk for the votes on both Hillary bringing in all the families from Ferguson and the parents from the Military we need someone to fight for the people not against each other we already have enough of that.","post_message":"“What is Trump? He’s not a Republican. Absolutely not. Those are not the Republican principles. He’s not a Democrat. He is just himself. He is egocentric.”"},{"comment_id":"601311203355417","commenter_b":"What a dumb bitch","commenter_a":"I know lets get someone to shoot at her then we can see if she is right","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s.  This is the most ridiculous thing I've ever heard.  Are you offended by this?"},{"comment_id":"1182572491799444","commenter_b":"Mj we are talking about the ones that come here and are here illegally. You became a marine and I bet you did it the right way. Now we have a big problem with terrorist that are sneaking into all the countries. Sorry but we have to take care of all Americans first. You have to admit a country can only hold so many. Thank you for your service I am a vet myself so are my son and daughter.","commenter_a":"All these racist comments and generalizations. You should all be ashamed. I am cuban and came to the US. Im sure not many of you can say the same but i actually benefitted from government programs. I served our countries military as a marine, i hold three different degrees - accounting, finance and im a registered nurse- sonif an immigrant is taking your jobs then you didnt take full advantage of what the US has to offer, no just arrived unprepared laborer will ever take any of thoae jobs from me. I love thia country but i hate people like you that put down immigranta that only want to make a better life for themselves and family. You are whats wrong with the US today!","post_message":"Right?"},{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10152641066602061","commenter_b":"She not mom she don't deserve kids.","commenter_a":"No true mother would ever give up her child she should not be allowed to have any more children!","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life. @webpagelink"},{"comment_id":"10154248049506337","commenter_b":"Chevy only beats up womens self esteem which is better I guess. Do your research.","commenter_a":"Chevy is awesome leave him alone. Seagal is a little bitch that beats women. He's hardly even a celebrity. Chuck Norris should round house his ass.","post_message":"WHEN THE HOT SEAT GETS TOO HOT... From Chevy Chase to Steven Seagal, these celebs just couldn't handle getting roasted. Check out 'Comedy Knockout' on truTV. @webpagelink #ad"}]
