[{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"1116402168438318","commenter_b":"Darren VM They don't want the imbecile either, probably why he ran here! LOL","commenter_a":"I don't understand how this humiliates Obama. I don't understand why Michelle is included in this. I don't understand why any sane American will be for humiliation of an American President regardless of agreement on issues.","post_message":"Obama may think he's Europe's favorite politician, but Queen Elizabeth just made a stunning announcement that put Obama right in his place.  You know Michelle was furious when she heard about this."},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"},{"comment_id":"10153929399138598","commenter_b":"she does NOT belong in prison","commenter_a":"You pig","post_message":"Woman Who Killed Her 25-Week-Old Unborn Baby and Threw Him in Dumpster Appeals Conviction"},{"comment_id":"1011674828909358","commenter_b":"The thought of that ticket is NAUSEATING but a SURE WIN for you DT! The Witch and Crow will cause Havoc where ever they go!","commenter_a":"I am a Trumper and together we will defeat Hillary and her running mate.","post_message":"I hope corrupt Hillary Clinton chooses goofy Elizabeth Warren as her running mate. I will defeat them both."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"}]
