[{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"1656487827976632","commenter_b":"\"a balanced choice between having a heart and having a brain.\" Really? Who wants to vote for a thyroid? ha.","commenter_a":"@username is a balanced choice between having a heart and having a brain. The two are not mutually exclusive. #JohnsonWeld2016 #Libertarian #FreedomEquality","post_message":"Sarah Silverman and Bill Maher spent a portion of Real Time with Bill Maher Friday wondering why 29 percent of millennials – many of them former Bernie Bros – have ticketed their vote to Libertarian candidate Gary Johnson instead of Hillary Clinton. \"Gary Johnson is a fucking idiot,\" Maher said."},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10153711323820695","commenter_b":"Girl, STOP!","commenter_a":"A true example of faith. My prayers go out to him and his family. They'll get what they deserve, evil doers do not prosper.","post_message":"FORGIVENESS: That's what the wife of a man shot during a home invasion is expressing as her husband recovers."},{"comment_id":"1101493276543118","commenter_b":"More than possible! I always thought this would be the case when he first got put in jail. Been praying for his release and for all those associated with him. Been praying for his family.","commenter_a":"Is it possible that GOD used Saeed to bring the gospel to the prisoners...,GOD works in mysterious way?","post_message":""},{"comment_id":"10153117964021162","commenter_b":"Killer her","commenter_a":"At the very least, SPAY THIS MONSTER!!!!!!","post_message":"DISTURBING: This mother is accused of deliberately making her 9-year-old son sick by putting feces in his IV.  FULL STORY: @webpagelink"},{"comment_id":"912811708762070","commenter_b":"Carole finally you sound like a smart girl see you're not an Idiot after all. I like that kid Rubio. send all illegals home including Obama. By the way carole you look like the nurse who use to work for me she was an idiot but she was nice to my patients.","commenter_a":"Since voters usually vote for charisma instead of experience and intelligence, I would expect Rubio to be the greatest challenge.","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"}]
