[{"comment_id":"10153558061286037","commenter_b":"Doesn't matter. BUT FOR her illegal arrest, she would not have been in jail.","commenter_a":"aaaand boom goes the dynamite.","post_message":"Waller County prosecutor Warren Diepraam says the injuries that were found during the autopsy of Sandra Bland would be consistent with a suicide."},{"comment_id":"10153047455238984","commenter_b":"would not let that les hatefull bitch raise a golld fish, fel sorry fr her children","commenter_a":"Rosie O'Donnel's son is still trying to deal with the fact that his mother bought him from a cash strapped viewer of her tv show.","post_message":"Oops. This isn't what the left wanted them to say..."},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10154463285676178","commenter_b":"not immigrants...Illegal MIGRANTS. Immigrants come here legally.","commenter_a":"Gut punch to millions of ILLEGAL immigrants. And I feel bad because??","post_message":"The liberal media keep outdoing themselves..."},{"comment_id":"10154640595946337","commenter_b":"It's all bullshit anyways..","commenter_a":"Must be nice to be rich and privileged! If I were to protest while on the job I would .get fired. Not all white people are rich and privileged.","post_message":"The Kansas City Chiefs stood with their arms intertwined as the anthem played."},{"comment_id":"10153271300604497","commenter_b":"Sadia","commenter_a":"Bmc Covert Joe Sanders","post_message":"\"Mom and Dad are going to be thrilled when I bring literally anyone home to meet them.\""},{"comment_id":"1079865505382241","commenter_b":"This video is retarded. Women aren't funny.","commenter_a":"Adam Isaacs","post_message":"There's an absurd stereotype that women aren't funny."}]
