[{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"10154307174989411","commenter_b":"the reasons for building a wall are based on racism. Migrants dont steal jobs, dont increase crime, and create more wealth for everyone given the correct conditions. only reason to appose migration is fear of differences.","commenter_a":"Think the candidates suck? vote libertarian. check out Gary Johnson. Some socialists might not get it at first but its really the political party that represents the most freedom. Are you for gay marriage? so are libertarians. Are you for smoking weed? so are libertarians. Are you against foreign wars of aggression? so are libertarians. are you against corporate collusion with the government? so are libertarians. Are you against too big to fail banks? so are libertarians. hold on republicans, theres stuff for you too. Are you for lower taxes? so are libertarians. Are you for property rights? so are libertarians. Are you for a business owners right to deny service to whomever he pleases? so are libertarians. are you for gun rights? so are libertaria","post_message":"#DropOutHillary: 300,000+ tweets"},{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"960942283946630","commenter_b":"and the worse thing is, women are doing the cutting. sick sick sick","commenter_a":"horrible","post_message":"Female genital mutilation is a human rights violation. And it happens way too often. - Laura Willard"},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"1226004427434976","commenter_b":"Get rid of her please","commenter_a":"Anyone else would have been fired.","post_message":"Do you think The View should be CANCELLED from TV?"}]
