[{"comment_id":"1265496813476971","commenter_b":"Angry black priviledged woman.","commenter_a":"He likes ugly women , that's as close to nice as I can get.","post_message":"People say during the #Christmas season I should say something nice about Obama, so I wrote Michelle to see if she can think of anything..."},{"comment_id":"10155795275933294","commenter_b":"Bunch of bull lock all of them up @username bond then they stop this crap","commenter_a":"He got what he deserve and they should get the same","post_message":"WATCH LIVE: Protesters have taken to the streets of downtown Portland, calling for justice for Quanice Hayes, who was shot and killed by police last week."},{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"1735291753418932","commenter_b":"Tyler","commenter_a":"Julia Lynch yay","post_message":"Wristbands allow festivalgoers to return to the empty field after a trip to the parking lot to retrieve more MDMA, mephedrone, 2-DPMP, Benzo Fury, Adderall, or synthetic cannabinoids."},{"comment_id":"10153248729158908","commenter_b":"Sharon Wilkshire","commenter_a":"Nancy Brown","post_message":"Coconut oil has many health, home, and beauty uses. This oil is a simple, easy, and inexpensive replacement for many commercial products that you may be using at home."},{"comment_id":"10153660533997235","commenter_b":"She'll be fired for feminist ideology being expressed at FOX on air.","commenter_a":"Why is that \"news\"?","post_message":"In a rare lucid moment, Fox News' Andrea Tantaros NAILS IT."},{"comment_id":"683007381889840","commenter_b":"Shut, your, cunt .","commenter_a":"She has no right to be called a first lady any more than her husband has a right to be called a president!!","post_message":"The White House is trying to cover this up as quick as possible. This comes as no surprise. She is the worst first lady ever. Are you disgusted by Michelle Obama?"}]
