[{"comment_id":"907300286012867","commenter_b":"She gives blondes a bad name.","commenter_a":"There's no such thing as liberal intelligence","post_message":""},{"comment_id":"473948236146716","commenter_b":"Go die old bitch","commenter_a":"lost all respect for superbowl....half times and commercials...all just the liberal agenda PU not worth staying up to watch...won't bother with any of the sports hype next yr.","post_message":""},{"comment_id":"10152628178977016","commenter_b":"Brainwashed female.","commenter_a":"I sympathize with her feelings, but do believe that never including those with whom we disagree in any discussion only solidifies the differences. Perhaps something of event speakers' words sank into W's cranium. Perhaps his presence will help some haters think twice about their positions.","post_message":"Civil rights movement leader Diane Nash calls former President George W. Bush's attendance at Selma anniversary \"an insult to people who believe in nonviolence.\""},{"comment_id":"10153091761007016","commenter_b":"Please take me off Your facebook","commenter_a":"Obama: Pardon Chelsea Manning","post_message":"\"The U.S. intelligence community is in a very poor position to be trusted with protecting civil liberties while engaging in intelligence work,\" writes Manning. \"When you’re a hammer, everything looks like a nail; when you’re a skilled intelligence professional, everything looks like a vital source for collection.\""},{"comment_id":"1028820693878107","commenter_b":"Same maturity level as kindergarteners.","commenter_a":"Republicans should allow weapons at their convention. ..loaded weapons. ..that would make a great pay for view","post_message":"Worst idea ever."},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"1422614517766820","commenter_b":"Turn off your speakers when Hillary starts speaking or she will break your ear drum","commenter_a":"Maybe every issue liberals care about like letting men in girls showers and rest rooms","post_message":"A Donald J. Trump presidency would pull us backward on nearly every issue we care about. We can't let that happen."}]
