[{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."},{"comment_id":"10158501442080389","commenter_b":"Why is she in our country?","commenter_a":"March away and try not to get run over by a car or truck. Most of us have jobs and families to tend to.","post_message":"Despicable."},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10154592681344445","commenter_b":"Yup, they are trying to invade the US as we type. Better build that wall.","commenter_a":"Now that half the Republicans in the house have been officially brain-washed, his confirmation will take place. This country will be taken over by Islam, when it happens. Bad news for women and gays.","post_message":"\"I am confident he will serve the American people with integrity and a steadfast commitment to justice,\" the president said. @webpagelink"},{"comment_id":"10152991625460409","commenter_b":"GOD BLESS GOV RICK PERRY. I PRAY IF THE LORD LEADS YOU TO RUN FOR THE PRESIDENCY THAT YOU WIN. YOU HAVE BEEN THE BEST GOV THAT TEXAS HAS EVER HAD. I'M PROUD TO CALL YOU A BROTHER IN CHRIST AND I PRAY THAT WHATEVER YOU ARE LEAD OF THE LORD TO DO THAT GODS BLESSINGS WITH OVERFLOW TO YOU.","commenter_a":"I never understood the concept of hurting one class of Americans helps the other! Question for Obama, if the wealthiest 1% is forced to pay their fair share as you say are they more likely to sacrifice their life style to pay the tax hike with or slash the payroll aka are jobs to pay for it ? And if given the choice between getting the rich to pay ( again as you say) their fair share or having a job to provide for my family, I'll take the latter every time!!","post_message":"This administration has failed to prioritize job creation and economic opportunity. The Washington culture may be fundamentally broken, but the American spirit that built this great nation is not. America's leaders should be working to ensure every person who wants a job, has a job. That’s what this is about – making sure mothers and fathers can provide for their families and our children have every opportunity to pursue their dreams. #SOTU"},{"comment_id":"1045198175503230","commenter_b":"BS, keep our money home to help Americans who need it.","commenter_a":"What the??","post_message":"Obama pledged millions of dollars to fight climate change abroad.  And it comes straight from YOUR pocket!"}]
