[{"comment_id":"1299379106804981","commenter_b":"Uh, she should be arrested!","commenter_a":"Sorry, but if didn't want anyone to see it, he should have put it in a folder, or face down, or taken it with him when he got up.","post_message":"You should be mortified - Post Updated *******************"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"10152577798681316","commenter_b":"A percentage will watch Hannity and cry. The rest are busy being free.","commenter_a":"LOL they said this in 1777","post_message":"Freedom hardly exists in America today, where a family man who helped people purify their water naturally now faces 37 years in prison. Read Daniel Smith's story and support his fight against the corrupt US justice system. @webpagelink"},{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"1734000846853202","commenter_b":"Yes","commenter_a":"That they do!","post_message":"“When the left starts to lose, they break the law.”  Do you agree with Newt Gingrich?"},{"comment_id":"10153145409004342","commenter_b":"Woman why the hell are you on a Houston news site? Get the hell back to Arkansas.","commenter_a":"You have to kill someone because they pissed you off....seriously? Houston a breeding ground for mental cases","post_message":"Police say a man who was shot and killed while changing a flat tire may have been targeted due to an altercation at another location."}]
