[{"comment_id":"10153070666326336","commenter_b":"Kill all the non believers Haider? That's killing innocents!!!","commenter_a":"if anyone believes Iran will not pursue nuclear power they are delusional...they are playing the obama admin the same as every politician before.","post_message":"\"It is necessary that the stance of the U.S. administration be defined about this move.” - Iranian Foreign Minister Javad Zarif"},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"10154486543656037","commenter_b":"Hillary has deceived all of u!!' Rosanna, this is what she wants. You're just as disgusting as her😎😎😎","commenter_a":"Trump has been saying the system aka Democraps is Rigged. I guess they gonna start saying build a wall next lol copy cat libtards!","post_message":"Elizabeth Warren: \"The system is rigged, and Donald J. Trump would make it worse.\" @webpagelink"},{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"10154789574398132","commenter_b":"Sick people. Why do they need a child when they are idiots","commenter_a":"This is disgusting!!! Hope they rot!! That poor baby. I'm sure he has seen this many times in his short life. I'm sad for him.","post_message":"Ohio police have posted shocking photos of unconscious adults  who they believe overdosed on heroin."},{"comment_id":"895490467164248","commenter_b":"Married women have abortions too !","commenter_a":"Pro choice is about a woman's right to screw like a whore without any consequences. That's the reason Obama wants it for his kids.","post_message":"Do you agree?"}]
