[{"comment_id":"1011935972208484","commenter_b":"No amnesty. We need to figure out exactly how many workers our farmers need and make it easy to give immigrants return visas once they have been vetted then give them 5 year vias, before needing to reapply.","commenter_a":"Democrats, you have one job this November: Don't give our country to the GOP! Elect a Democratic President and give them a Democratic Congress to work with! And complete the job by dumping the GOP from state and local government!","post_message":"'Nuff said.   Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"629306997259879","commenter_b":"Well listen up you stupid, IGNORANT BITCH! If your planning to remove the word BOSSY, well then you might want these words removed also. BOSSY,BITCHY, MOODY, HORMONAL, ON YOUR PERIOD, shall I say more. All these words have the same meaning. Of all people Michelle Obama, I believe that you've been quite the fucking BOSSY ONE lately so don't fucking start PREACHING your BULLSHIT TO THE AMERICAN PEOPLE. By the way BITCH you must not have anything to do and to much time on your hands to open your BIG FUCKING MOUTH ABOUT A WORD THAT HAS MICHELLE OBAMA WRITTEN ALL OVER IT. TELL YOUR BIGOT husband your pathetic issues.","commenter_a":"I vote to ban Michelle","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"},{"comment_id":"10153163783266135","commenter_b":"When the death penalty came up, the idea was to deter people from killing. This is why I wrote, death penalty for killers. Killers should know that gas chamber is their end. But when the law starts making up excuses for their actions, every law goes out the window. Illegals guns hit the streets because its about money. When someone chooses to be stupid, is not about money, the culprit list will be long, and everybody should be hold accountable. So, should we shot everybody and ask later? There are some people who are paying the consequences for not thinking ahead, trying to uphold the laws in their hands, like some kind of hero. What exactly is a THUG? and what exactly is a GOOD person?","commenter_a":"Screw the 2nd ammendment, this clowns can not handle this right. Killer, death penalty right away!!!","post_message":"#BREAKING One person killed in shooting at Taylor Sportsplex, according to Taylor Police Chief."},{"comment_id":"10153861060719411","commenter_b":"what i see is a dead pussy just blown up.","commenter_a":"terrorist*, not jihadist... jihad is a good thing","post_message":"Video shows Jihadi hit by mortar shell mid-interview"},{"comment_id":"10154490644508132","commenter_b":"But she was slimer before","commenter_a":"Her body is not well balanced is too much up in the chest ... too much on her Back .... Kourtney and Kendall bodies are better","post_message":"Kim Kardashian West traded her neutrals and furs for a bold vibrant look! (via PeopleStyle)"}]
