[{"comment_id":"10154680917183352","commenter_b":"What these women would really look like without the weave an fake eyes an their natural color so much plastic they can make Tupper ware","commenter_a":"Are you removing that photo method man asked you to remove?","post_message":"BREAKING: T.I.’s Wife Tiny Reportedly Caught on Video Fighting and Beating Her Husband’s Alleged Mistress! ---> @webpagelink"},{"comment_id":"10153973009181409","commenter_b":"Considering Hillary shouldn't even be allowed to run she should be the one stepping down","commenter_a":"Then he should step down from running ... it's the right thing to do","post_message":""},{"comment_id":"10152457331185736","commenter_b":"@username try FUCKING OFF!","commenter_a":"143 year old coins and documents where buried in 1795? Something doesn't smell right.","post_message":"The time capsule buried by Paul Revere in 1795 has finally been opened and the contents date back to 1652.  Mobile: @webpagelink"},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."},{"comment_id":"10154083173838132","commenter_b":"They're usually thrown in an institution from a young age. They don't get job or skill training being they are looked at as \"useless.\"","commenter_a":"This is an awesome story and I am so thankful for the children that have found forever homes. I have one question if these children were left in China would they receive an education?? Or are they just forgotten about?","post_message":"What an incredible moment for these children. "},{"comment_id":"977190145651659","commenter_b":"Hey ship them all to Canada they like the trouble makers. Attention Muslims get out of the USA we don't want you here!","commenter_a":"Private school or home school. It's worth the sacrifice.","post_message":"#IStandWithAhmed was trending on social media nationwide as people expressed their support for the teenager."},{"comment_id":"521903667998585","commenter_b":"So much for ESPN claiming to be a \"all inclusive\" company.","commenter_a":"We no longer have free speech. Opinions are free speech. These liberals are destroying the Consitution.","post_message":"The final straw came when Schilling shared a virulent anti-transgender meme on Facebook. via NBC Sports"}]
