[{"comment_id":"1174478745905487","commenter_b":"The hormonal teenager that's checking people's bags is supposed to make us feel secure?","commenter_a":"I would rather be inconvenienced than shot why I watched a movie","post_message":"The chain said the procedure would inconvenience guests but provide better security."},{"comment_id":"617790755078170","commenter_b":"She a geto gutter hoe send her back","commenter_a":"I agree with Brooks.And Steven Joseph Sr.God bless that soldier .And thank you for your service","post_message":"Michelle Obama wanted this army staff sergeant to do this, but he refused.  This is amazing. We stand behind this soldier 100%.  Do you support this war hero stand against Michelle?"},{"comment_id":"1389565734436504","commenter_b":"Wow this kind of women u dot want mess with super power","commenter_a":"OMG!!!! I am bereft for words!","post_message":"He started to beat her, so she squeezed his testicles in response"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"1700820033514238","commenter_b":"Yeah , more Women would have Guns!!","commenter_a":"who voted for these people?","post_message":"Pretty sure the millions of female gun owners would disagree."},{"comment_id":"10153159766848701","commenter_b":"Pigs... Sterilize them both!!!","commenter_a":"Slam thier ASS in jail till they both get the hell beat out of them or killed by inmates.. Thier parents are proud of them now ...","post_message":"A man and woman charged with murder are accused of starving their 7-week-old baby to death in Douglas County."},{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"}]
