[{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"10155029818006543","commenter_b":"Senator Wazzy got slapped on by Senator McMackinz. Tell a ho where she's at! @webpagelink","commenter_a":"Mitch McConnell email inbox is full. Let jam his faxes with the Coretta Scott King letter now. DC Office : (202) 224-2499","post_message":"In an extremely rare rebuke, U.S. Senator Elizabeth Warren was cut off while reading a 1986 letter by Coretta Scott King on the Senate floor @webpagelink"},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"1377566012257306","commenter_b":"Sarah Elizabeth Pool like I said all that Shit is fake babe","commenter_a":"Janine April May","post_message":"Americans literally lose billions on weight loss scams."},{"comment_id":"10152614023801519","commenter_b":"Paula - The money spent by Democrats and Republicans on the Senate election was about equal - Big Corpoarate Money did not win the election for Republicans. The major reason was that 70% of Americans think the country is heading in the wrong direction under six years of the Obama administration. The WSJ Editorial Democrats vs. the Middle Class shows the devastating impact of Obama and Democratic Party progressive policies over the last five years on the middle and lower income class. Progressive Policies buy votes, but destroy prosperity. Anybody with incomes less than $70,000 has been devastated with losses of around 6% to 8% while inflation lowers buying power. @webpagelink","commenter_a":" 12-Step Program for Recovering Democrats is a WSJ Editorial to help Democrats make a recovery from the shock of the last election. Liberals call Republicans names when they have no rational argument to make. @webpagelink","post_message":"Jon Stewart lines 'em up and knocks 'em down..."},{"comment_id":"10153257305683445","commenter_b":"The irony in your statement, it's because of the illegal immigrants that America discovered weed","commenter_a":"So what if be had 'pounds' across state lines..!? Life for sh*t like that when, let's see, all the illegal immigrants get to roam free and even if they do get busted they will never see life behind bars..! Our drug laws for marijuana need to change.","post_message":"HUGE News! Marijuana Lifer Jeff Mizanskey Gets Parole."},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"}]
