[{"comment_id":"635910406556387","commenter_b":"Go away stupid black man","commenter_a":"Always has the Muslims in the forefront of his talks before even condolences ... God forbid we upset the Muslims because they practice the religion of peace!","post_message":"President Barack Obama addressed the horrific terror attacks in Nice, France and called suggestions to target Muslims in America \"repugnant.\""},{"comment_id":"10154359773191519","commenter_b":"I'm sure all the lesbians would disagree.","commenter_a":"A woman's orgasm is measured by the size of a man's bank account","post_message":"The female orgasm has befuddled men, women and scientists for centuries."},{"comment_id":"1015432805157138","commenter_b":"Oh give me a break!! Rape is on a whole other level!!","commenter_a":"This is ridiculous!! He is a legend in the wrestling world. They are letting him go over something that was said 3yrs ago?!!! Shame on WWE!!","post_message":"Reportedly for racist remarks made in 2012"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"10153240747000326","commenter_b":"anything to keep a woman from being elected President!","commenter_a":"#feelthebern !!","post_message":""}]
