[{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from \"Jaws,\" she's either very very smart or very very dumb."},{"comment_id":"10153961468913132","commenter_b":"@username she better step away from my man","commenter_a":"@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10154154214551509","commenter_b":"Hahahahaha","commenter_a":"All I know is, if I ever overdosed in a whorehouse and my wife and my mama found out, skip the cpr. I am better off dead.","post_message":"After ex-NBA star Lamar Odom was found unresponsive in a brothel owned by Dennis Hof, the reality TV star swung into damage control mode.  \"My business is built on privacy and discretion,\" he said. \"But when the ambulance pulls out and five minutes later TMZ calls me, you have to deal with it.\""},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"},{"comment_id":"1300695323356852","commenter_b":"Get educated. Oh that's right you don't want the truth only lies from the most disgusting pig.","commenter_a":"Hillary supporters, How do you put Syrian refugees before American people? How do you look a homeless vet or child in the eyes and say sorry I won't help you. Oh the same way you turned your back on American's in Benghazi.","post_message":""},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"}]
