[{"comment_id":"10153507378388487","commenter_b":"Not one female player could play to the standard of the men's World Cup","commenter_a":"Value is determined by the market. If we want to constrain the market in the name of fairness, we could get rid of the divide between men's and women's soccer and have one World Cup where the best athletes compete regardless of sex. Ensuring all players are selected based upon ability rather than sex seems fair.","post_message":"The World Cup concludes today, but the battle to equalize women's soccer with the men's game is only beginning"},{"comment_id":"1289522947781268","commenter_b":"Spoiled racist brat","commenter_a":"Michelle Obama is the most bitter, most racist First Lady in recent history.","post_message":"First lady Michelle Obama implied this week that many Americans no longer have hope because of Donald Trump's victory.  Thoughts?"},{"comment_id":"10153936528885695","commenter_b":"You run like a girl","commenter_a":"Jose Arellano that's probably why we saw the traffic earlier today","post_message":"Wait for it...wait for it -- a police officer chased three shoplifting suspects across Georgia 400 after this car crash. See the full video, plus we'll explain how it all started, at 5:14! @webpagelink"},{"comment_id":"10153476534618721","commenter_b":"You do not turn the Super Bowl into a platform for any agendas. The Super Bowl is about the teams on the field. That is all. If she wants to do that at her concerts, fine. But she was out of line doing it at the Super Bowl.","commenter_a":"Is Beyonce just another ghetto ho?","post_message":"\"Is Beyonce pregnant?\" and other dumb things people Googled during the singer's Super Bowl performance. (via Quartz)"},{"comment_id":"969371743179604","commenter_b":"Too bad Donald Trump is here to stay he's going to be the president and beware lady he's going to build a wall and you're probably one of the ones that he's going to be sending back to Mexico because you're probably illegal","commenter_a":"Bought and paid for I might add!!!","post_message":"Protestors in Mexico, I mean California, are saying Trump doesn belong in the United States. What do you think? @webpagelink"},{"comment_id":"10153104689788855","commenter_b":"WTF? The Advocate (or at least the staff involved in this article) clearly don't know what \"Twink\" is. These men are just aging well and don't have the outward appearance of what one would typically expect of their numerical age.","commenter_a":"Daryl Stephens is a hot man","post_message":"Sometimes, twink is forever (right, Darryl Stephens?)"},{"comment_id":"768694459925723","commenter_b":"With alll the evil this Bitch has done. She should be disqualified from living!","commenter_a":"Since Hillary is under investigation she should be disqualified to run for President .","post_message":"Can America survive more of the same?"}]
