[{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"10152926251994071","commenter_b":"Their porn is awesome. Fully filled girls, unlike the skinny twigs the US has to offer.","commenter_a":"Small wonder. Have you ever seen their porn? Horrifying.","post_message":"It's a \"time bomb.\""},{"comment_id":"1180918395297096","commenter_b":"@username you come from immigrants, you really believe they should be sent out or kept out. Start packing. Show just how much you believe in this wall.","commenter_a":"Yes","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"987021391354390","commenter_b":"@username: Once again, you can argue all you want day in, day out. And guess what will happen? The ongoing trend. It get's worse and worse year after year. The debt keeps climbing, yet some have their blind folders on like they can't see this way of thinking, and the economy is constantly nose diving, we are constantly going further and further in debt. Another fact, we in the South are tired of pressing 1 to listen to English while we live in America. If Hillary had it her way before she goes to jail, the mid-west and North would be in the same situation after she let them flood in and gives them drivers license, you too would be having to Dial 1, every single time you want to hear English. Think it wouldn't bother you? Think again, you'll question whether you are really living in America. After-all these ...","commenter_a":"Raise Minimum Wages - Put Small Businesses Out of Business, Take Jobs from Americans. Allow immigrants to flood the country, give them drivers licenses, and take jobs from Americans. Oppose the pipeline, Take Americans jobs. Do away with energy companies, Take Americans jobs. \"Hello, I'm @username, the hypocrite, I promise Americans jobs!\"","post_message":"Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H"},{"comment_id":"10154278341944062","commenter_b":"Personally, I believe the game should have been forfeited. Cheaters should not be the champs.","commenter_a":"Cheating is cheating. Get him out.","post_message":"A federal judge erased Tom Brady's four-game suspension - do you agree or disagree with his decision? Vote now..."},{"comment_id":"10157410522280294","commenter_b":"Love these type of storms..","commenter_a":"Thanks for the pictures. Please stay safe. If you have reports of any damage please let us know","post_message":"Dark storm clouds roll into the Cleveland area"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."}]
