[{"comment_id":"1080674971953513","commenter_b":"And then she has an ungrateful kid... Lol","commenter_a":"How do they even survive that? Oh the pain! I hope they are able to get epidurals.. 😉","post_message":"The egg is so large that in the last few days before laying it there is no space left inside the mother for food. She is forced to fast."},{"comment_id":"10154577963871323","commenter_b":"President Mitterand had wife and kids plus a lover with who he had a girl!!! Lol","commenter_a":"If it was France or even Italy it wouldn't be an issue and would be distasteful to bring up in public. In America there is a certain ownership in marriages rather than partnership. Maybe she loves him as a man and equal in mind, the fact that he does have a wandering eye (penis) may be something she is willing to accept the way we accept a partner's handbag obsession.... Just saying....","post_message":"The end of a relationship – even a years-long marriage, even an otherwise-good relationship, even with children in the mix – is, at this point, the only acceptable consequence of infidelity, and staying is posited as the inexplicable choice for a woman to make.  But life and love are more complicated than that for many people, even in 2016."},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."},{"comment_id":"10153656979036130","commenter_b":"I go, \"You know I had pulled a gun on a white girl...\" She goes, \"I knooooow!\" She got her white privilege isn't real wake up call! You know white girls LOVE to call the cops. When the cop didn't do anything and believed the guy she lost it! Long ass Facebook post! Lmao!","commenter_a":"You never hear Asian, Hispanic, African American, or any other race of men crying over the second amendment. One group only.","post_message":"The legislation mostly targets specific kinds of semi-automatic firearms -- such as AR-15s and AK-47s -- and large-capacity magazines, and adds certain registration and licensing requirements."},{"comment_id":"10153950105412757","commenter_b":"Round them up and jail them. Find the illegals and deport them.","commenter_a":"Exterminate that vermin!","post_message":"Anti Trump showdown"},{"comment_id":"1031698180201852","commenter_b":"why did this piece of shit get a job on T V anyway ??????? tampons for ear rings that is one sick hoe !!!!!!!!!!!!!!!!!!!!!","commenter_a":"Good","post_message":"\"While MSNBC may believe that I am worthless, I know better.\""},{"comment_id":"609422632593811","commenter_b":"If it is true Hillary said that, she deserves to lose big time and go to jail.","commenter_a":"this is noy the first time she threathenn to kill him. she did little over a week ago","post_message":"Whoa. You do NOT mess with the Clintons"}]
