[{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"10152946576794099","commenter_b":"doesnt matter, she is still an adult","commenter_a":"i worked the front desk at a college dorm and i cant tell you how many times ive had mommy's call and ask me where their child is because they didnt answer their phone. shes 19! give her a break.","post_message":"A Connecticut teen who was reported missing after going out with a man she met online has been found safe, police say @webpagelink"},{"comment_id":"10154278216444138","commenter_b":"Ridiculous. Killing all of these gators will not accomplish anything","commenter_a":"Let this had been a black family in a gorilla cage. The media would have been outraged about these alligators lives being snuffed out because of these negligent parents! If is says restricted or no swimming, then they should have checked with the lifeguard before putting their child in harms way!!! Not fair to those alligators and MOST DEFINITELY a tragedy for that child. There are terrible parenting skills on both sides. Black and white. Animal rights should have been on this just like Harambe. But then again, it was never about the animal. These parents should have been charged with the endangerment of their baby. Period.","post_message":"A total of six alligators were removed."},{"comment_id":"1547661255293998","commenter_b":"Bitch you out your rabbit ass mind","commenter_a":"Coo coo!!!!! One flew over the coo coo's nest, and there she is!!!!","post_message":"The classics NEVER cease to amaze..."},{"comment_id":"481313708745082","commenter_b":"nimby. they do not want to see oil rigs, how ever it is okay to strip mind in my back yard to get sand to build the roads to their beachfront homes. what a bunch of hypicrites.","commenter_a":"Thank you @username for your support for our coast !!","post_message":"With all the updates today, I wanted to make sure that you caught this earlier post with my statement on the Administration’s decision to protect the Atlantic from offshore drilling...so I’m sharing it again."},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"1027501837293064","commenter_b":"What a lying bitch , she tried to be the center if attention and it didn't work out for her. There is nobody left for her to blow, so she wants to quit. Awe.... poor little helpless girl who swallowed so much she is choking on it. Lol","commenter_a":"She brought it on herself","post_message":"Megyn Kelly has stunned her fans and Fox News with an announcement that changes everything.   She's put Fox in a VERY hard position and disappointed a lot of her fans."}]
