[{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"10153286970856167","commenter_b":"Help the refugees by free their homelands from the bad people the world support with weapon and money for other profit exchange !! They are running away from their own evil ... This evil was created by the collective separations of this planet God of profit America is the only place in the planet When soon or later the origin of the people is not matter any more .. This will hopefully be our new planet order","commenter_a":"In the 1930s we turned away thousands Jews due to xenophobia, many of them later died in camps. Are we going to repeat the same mistake now?","post_message":"Since the Paris attacks, there's been a lot of hate. Here are the top five best responses to all the bigotry. Watch:"},{"comment_id":"10154525583946336","commenter_b":"Another red herring, Republicans? We've had enough of your endless investigations that amount to NOTHING.","commenter_a":"I'm sorry to say that she could murder a nun on 5th ave. and nothing would happen ...... Why?","post_message":"\"She did it for greed and for power and for the almighty dollar.\"  In her Opening Statement last night, Judge Jeanine Pirro said it's now clear that Hillary Clinton used a private email server to \"hide her shady Clinton Foundation dealings.\" @webpagelink"},{"comment_id":"1152177854802243","commenter_b":"She's a POS lire!!! Qualified! Gimme a break!","commenter_a":"I don't believe a word she says. Right now the most important thing to her is more excuses...","post_message":"A young boy asked Hillary Clinton \"What is the most important part of life?\" Here's her response."},{"comment_id":"10154046383106509","commenter_b":"invasion of economical immigrants/social benefits leechers under camouflage of refugees","commenter_a":"Theres awfully a lot of Military age male in these \"refugees\".","post_message":"Germany to impose border controls with focus on its border with Austria. @webpagelink"},{"comment_id":"10153739704671051","commenter_b":"Dumb ass","commenter_a":"For recreational usage YES, only and dope does dope for no reason other than to escape reality. For MEDICAL use, HELL NO, it should be 100% illegal. BUT, that is not the real issue here..... the REAL issue is, THE LAW Follow it, or pay the price, SIMPLE","post_message":"Do you think marijuana usage should be illegal?"},{"comment_id":"10154273015234205","commenter_b":"@username you are so right ! And I'm glad I'm not the only one seeing this woman's racist side. @username you aren't from here your European American ! This isn't your merica it belongs to all the people ! No matter what your ancestors were once undocumented immigrants so don't speak as if you are a true American because a true American would realize that America isn't just for legals. If so you should of been long ago with the Damn mayflower.","commenter_a":"On October 22, 2016 Trump said that we would pay for it and Mexico would reimburse us. Check your facts people. We will get reimbursed through tariffs on anything that has to do with Mexico. Brilliant!!! That's why we hired you president Trump.","post_message":"Will Congress pay for Trump's border wall?"}]
