[{"comment_id":"1834572823431236","commenter_b":"\"Sick\" being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"10153992973507439","commenter_b":"Ms Reker is a WHORE","commenter_a":"What is it with the majority of women...do you not get angry, do you not want to beat the crap out of men like that? Whether we like it or not ,women, you are on your own. The only way to fight this is to fight, not because you like it but because we will have to. Your governments and I mean every government is in this together, they have planned the events, they are the movers of the migrants, they are manipulating every inch of this planet..Wake the heck up people. And women you will not only have to physically fight against the men that rape, you will have to fight against the women who are in power. The world for the general population will be returning to a dark time, a time where there were tribes and clans, you will have to be in a group to survive ...","post_message":"The Mayor of the City were hundreds of women were robbed, sexually attacked, molested, even raped on New Years Eve is blaming the victims. Worse still, the Mayor is a woman.  The mayor of Köln, Henriette Reker, intends to publish a behavioral code for the forthcoming carnival in Köln. But if you think that this behavioral code is meant for the muslim mobs, you are wrong. This behavioral code is meant for the victims, the women."},{"comment_id":"1042027782504360","commenter_b":"Bitch would've been sucking soup out of a straw...","commenter_a":"This warms my soul.","post_message":"This is some serious racism. Would you have slapped her after she spit on you?"},{"comment_id":"1514026052232145","commenter_b":"Omg can you just shut it, you selfish brat!!!!","commenter_a":"Hey I thought he was leaving this country cause he did not like here. Well be gone with your bad self","post_message":"An expletive-filled clip of Kanye West's alleged tantrum has leaked."},{"comment_id":"10153645294706756","commenter_b":"why is it people still think illegals vote? they cannot unless they are registered, the only thing the federal gov't requires for illegals is emergency care at hospitals in case of sudden illness or accident, otherwise illegals do not get food stamps or welfare and why would they try to register to vote risking getting caught? some people need to get a new talking points, this one is old and stale","commenter_a":"The Republicans made a conscious decision to go after the angry white conservative male vote with everything they had. Now they get to live with that decision, riding into the sunset as a shrinking regional party based on anger and resentment. A modern version of the \"Know-Nothings\", if you will.","post_message":"To put it one way: \"Republicans have been arguing since 2012 about — do we need to change the pizza or do we need to change the pizza box?\" says David Frum, a former speechwriter for George W. Bush. \"And I think the correct answer is we need to change the pizza.\"  But change, however they want it delivered, has come in fits and starts for the GOP."},{"comment_id":"10158588409000354","commenter_b":"Doesn't help that he no longer has any \"insider info\" from the State Department, does it ????????? Schmuck","commenter_a":"Geez, whudda thunk it.","post_message":"You can't make this stuff up.   #ClintonCash"},{"comment_id":"10153713644828984","commenter_b":"Yes build it. And people American people will have a job and steel prices go up. And we win!!!!!","commenter_a":"Build the wall. Put censors all along the border and give the border patrols the order to shoot any one who gets over or under the wall. Illegals will stop coming.","post_message":"Boom! Critics of Trump's border wall just got silenced in an EPIC way by The Donald himself. There's no way they can argue this one!  Do you agree with what Donald Trump just said about a border wall?"}]
