[{"comment_id":"920923791276376","commenter_b":"She is a scandal ridden low life scum.","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"1596643573967911","commenter_b":"She is a liar and should be behind bars!","commenter_a":"#Sethrich","post_message":"WATCH LIVE: Hillary Clinton reveals economic plan in Michigan — how will it differ from Donald J. Trump's?"},{"comment_id":"10153807094811336","commenter_b":"Maybe this woman wants the truth about Hillary's evils be known .","commenter_a":"Fox news keeps exploiting this poor woman","post_message":"“[Hillary Clinton] lied to my face at a very, very hard time, and she’s been lying since.” – Patricia Smith"},{"comment_id":"936584933056721","commenter_b":"Well bye bye you illegal immigrant because your ancestors aren't from here .","commenter_a":"Black life's matter movement is a threat to law enforcement! The Obama administration is a threat to law enforcement! Islam is a threat to law enforcement! Illegal immigration is a threat to law enforcement!...... This man is not!","post_message":"In a video he apparently posted last week on Facebook, Jon Ritzheimer calls out New York-based The Islamic Post for calling him the \"American Taliban.\" Now the FBI has issued an alert, citing he is a  threat to law enforcement."},{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"10154789513347908","commenter_b":"Bernie concede and join forces with Hillary. We all know this is what will happen anyway. We have to start now if not we will be wishing so if trump wins!","commenter_a":"Thank you, Bernie Sanders.","post_message":""},{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."}]
