[{"comment_id":"10153912025664030","commenter_b":"Kiss my ass.","commenter_a":"@username lol sleep tight","post_message":"Not Safe with Nikki Glaser asks the questions you didn't know you wanted answered.  All-new episode, tonight at 10:30/9:30c."},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"10154759718811178","commenter_b":"The Times does not have to worry about the leak, we all could hear and see how biased the moderator was.","commenter_a":"Birds of a Feather, always stick together....","post_message":"The NY Times let it slip they thought the moderator helped Kaine during the #VPDebate.  But it's what they did next that's getting attention."},{"comment_id":"1763064613956147","commenter_b":"Bitch I ain't finna lose my job over your racist ass. But don't let me catch you outside 2 months from now..","commenter_a":"First World Problems","post_message":"This is truly shameful."},{"comment_id":"10153675187678352","commenter_b":"Trust no Bitch","commenter_a":"On the next episode of Orange is the New Black....","post_message":"‘You might as well go ahead and execute me, because I’m not going to make it to 73′: Woman, 51, who beat her friend to death with a slow cooker in a row over politics is jailed for 23 years"},{"comment_id":"1256658817687479","commenter_b":"Lady I think you need a snickers bar.","commenter_a":"Yeah be on the lookout! They have white skin, blondish hair, blue/gray eyes and they shoot up movie theaters, churches, schools and clinics! Oh my bad, wrong terrorists!! Please continue! Smh....a bunch of fucktards.","post_message":"After masquerading for months as a newly Americanized housewife, Tashfeen Malik dropped the facade in a burst of gunfire."},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"}]
