[{"comment_id":"10150700585599999","commenter_b":"Trump is strong enough to protect the country from this invasion. Certainly no one on the Left is even thinking about it.","commenter_a":"Trump is a loud mouth, arrogant, self serving, person. He does not really care about the \"Regular\" folks, he is accustom to just \"Using\" them. I am a republican and can not stand him.","post_message":"Few people can address the circumstances more definitively than John Farmer Jr., who served as senior counsel to the 9/11 commission."},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."},{"comment_id":"10152884015311336","commenter_b":"No that would be michelle Obama. That thing has an Adam's apple.","commenter_a":"Maybe they could use the canned food to prepare REAL meals for the kids and throw the Michelle Obama school lunches at the attacker.","post_message":"A principal in Alabama wants to stockpile cans of food in classrooms so that students can “stun an intruder \"or even knock him out\" until police arrive.  What do you think? Is this a good or bad idea?"},{"comment_id":"756897567834154","commenter_b":"Bitch","commenter_a":"We all talk on facebook but it does no good.The women can't see what Hillary is or they haven't Google her.She was not brought up poor.never went one day without food clothes or shoes .She is a liar er and a traitor. And those who are voting for must be as bad as she is She will end USA as we see it.Hasnt the zebra done enough destroy our country? Apparently not for you dumb asses voting for the murder.I guess you have no relation in the armed forces. Because if you do there's no way you would even consider voting her in.Open your eyes","post_message":"Hillary Clinton's Career Could Be Over After She Was Caught Endorsing The KKK [VIDEO]  She is doing everything she can to get this video taken down. Let's spread it.  Do you think Hillary Clinton is not fit to be president?"},{"comment_id":"10157199868050354","commenter_b":"THE WALL, THE WALL, THE WALL........TRUMP 2016 !!!","commenter_a":"To our Canadian friends and partners. We know you watch the going's on in the U. S. sometimes even better than we do. The time is drawing near for this country to rectify its self. Please stand by and give assistance when needed to those involved. Thanks and good luck up there with your country. Hey.","post_message":"Wow."},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"\"This woman is extremely lucky. We can’t explain why he didn’t get up.\""}]
