[{"comment_id":"1252390358183610","commenter_b":"He needs to be removed from office before he does something to endanger us all He is mentally unstable","commenter_a":"Why can't trump voters see this? The guy is mentally ill big time. All I ever hear is, he said he would create jobs! So let's put us all in harms way for the \"possibility of a few jobs.\" Just plain nuts! He's not going to create any jobs and if he does it's by being unlawful. 😡","post_message":"This explains a lot..."},{"comment_id":"1150086235078889","commenter_b":"Hillary Clinton for President!","commenter_a":"This guy.....God help us all if he's elected!!!! Gary Johnson!!!! Love how he talks about jobs when he's notorious for trying to break up unions and has his own clothing line made in China!!! l","post_message":"WATCH LIVE: Donald J. Trump holds rally in Florida"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10153525353934170","commenter_b":"Hillary Rodham Clinton: Not qualified to clean my toilet.","commenter_a":"That picture looks like she has an empty head. Oh! That's Hillary Clinton! !!!","post_message":"CNN asks Hillary about tax policy, spending, the collapse of Greece, the Iran nuclear deal, the future of ObamaCare . . . just kidding! They didn't ask about any of this. They wasted almost the entire interview on trivial nonsense. The VIDEO will have you shaking your head."},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":""}]
