[{"comment_id":"762861520482540","commenter_b":"Your lady isnt going to win lol thats a joke","commenter_a":"Hmmm but notice how all places she wins have issues with the polls.. Shes a cheat and a fraud whos bought out..","post_message":"Bernie Sanders went just one for five on Tuesday, bagging only Rhode Island."},{"comment_id":"10154640595946337","commenter_b":"It's all bullshit anyways..","commenter_a":"Must be nice to be rich and privileged! If I were to protest while on the job I would .get fired. Not all white people are rich and privileged.","post_message":"The Kansas City Chiefs stood with their arms intertwined as the anthem played."},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"},{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"10153860707103812","commenter_b":"@username So she should just be allowed to sit there and disobey?","commenter_a":"Guess you should do what your told instead of thinking your above the law because your a minor. This should happen more often. It is no wonder law enforcement is backing down because everytime they do thier job they get ridiculed.","post_message":"WATCH: Video shows uniformed deputy grab a female high school student and wrestle her out of the seat and to the ground. @webpagelink"},{"comment_id":"667942883338893","commenter_b":"No.","commenter_a":"Because whites haven't been a suppressed race for hundreds of years.....does stupid hurt? I figured I would ask the idiot that runs this page wth a grade school education.","post_message":"Hmmmm....."},{"comment_id":"10153486710565779","commenter_b":"You, madam, are an idiot","commenter_a":"Well Bruce would allow a hairy old pervert in the restroom with that 10 year old girl, as long as he thought he was a woman. Let's all go to the zoo, and think we are lions and tigers, and go in their cage to do our business....... See how that works out Bruce. ;)","post_message":"Bruce Springsteen and the E Street Band closed out the U.S. leg of their 'The River' tour at Barclays Center last night with a three-and-a-half hour set that included covers of Prince's \"Purple Rain,\" John Lee Hooker's \"Boom Boom\" and Jimmy Cliff's \"Trapped.\" But it was a 10-year-old fan that provided one of the night's biggest highlights. Watch their performance of \"Blinded by the Light\" below."}]
