[{"comment_id":"1095660007120418","commenter_b":"good, dumb woman","commenter_a":"The tiger is a wild animal! What did she think would happen?","post_message":"Officials believe Jacqueline Eide, 33, entered a Omaha, Nebraska,zoo and tried to pet a Malayan tiger, which bit her hand. >>kiro.tv/TigerBite"},{"comment_id":"1532142173492916","commenter_b":"Oh we will because we need to stay united and fight. I mean go out there and protest, boycott Trump businesses, follow advice of people like Michael Moore, Bernie Sanders, Keith Olberman. I am saving my money and will travel to places where protests will be visible and impactful. Also, we have to find a way to help each other. Si se puede.","commenter_a":"2018 is just around the corner. We will clean house and send republicans packing!","post_message":"Conservatives will do anything to win what they perceive as the \"culture war.\""},{"comment_id":"10153937424304205","commenter_b":"This is why rape is so prevalent these days","commenter_a":"Every kids goes to thier mom in utah for this like this. Go spend a few years here then bitch about utah. Your making fun of thier Mormon culture... Look I've grown up in utah and I don't disagree that it's ridiculous. But your making fun of thier religion.","post_message":"A Utah high school student was having what he believed to be impure thoughts toward his female classmates when they wore their cheerleader uniforms in class."},{"comment_id":"548856361983005","commenter_b":"Yes","commenter_a":"Yes","post_message":"The NFL, coaches, and fans are sick of him and his garbage. The league has had enough. Do you think Kaepernick should be ejected from the league?"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"713646192159292","commenter_b":"Illegals wait in line like the rest.My dad came from Mexico when he was 5 years old the right way.He fight in WW2 in the Philippines.When we grew up we only spoke English.My dad said we are Americans.Every nationality has to wait in line.We can say this and that about are country but,this is the greatest country to live in.Citizens have to get off welfare get get a job.Stop being lazy,so illegals won't find work he.Government has to do there job.Find company's that higher illegals.God bless America land of the free.","commenter_a":"Seems simple enough- whatever happened to common sense?","post_message":"Share if you agree."},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."}]
