[{"comment_id":"10153307744490329","commenter_b":"Milliner - ladies hat maker. I'm cool with it","commenter_a":"Switchboard operator....pretty fitting, considering I'm a medical secrerary","post_message":"Vaudeville Star? Bootlegger?"},{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"},{"comment_id":"587553231404572","commenter_b":"Obama is putting up a higher fence around the white house this summer because people keep climbing it!!!! what about our borders?? WE NEED A WALL!!! WE NEED DONALD TRUMP NOW...","commenter_a":"You don't need a political decoder ring to understand Donald Trump he's a straight talker who speaks from the heart who's the only true outsider funding his own campaign and he's set the agenda on everything that matters. Indiana show your support and get out and vote Donald Trump for the republican nominee. If your standing with Trump your standing FOR America! TRUMP NATION 2016! # never lyin ted!","post_message":"I will not let you down. Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1320520624652837","commenter_b":"Minus the illegals AND the refugees AND the dead people!","commenter_a":"California in particular allows illegals to vote. When someone applies for a driver license in that state, they are automatically registered to vote, contrary to Federal Law.","post_message":"TEASE: TEASE: Yeah... about that."},{"comment_id":"948811408568971","commenter_b":"so far bro, all i am seeing from you is more words. do you ever do any thing but talk?","commenter_a":"Run for Congress","post_message":"Conservative Sheriff Promises  will fight for your rights.. I will die fighting for the Constitution!"},{"comment_id":"1797253250554324","commenter_b":"Tax the nfl that might cut into some of the players money lot of overpaid jerks. Funny how middle Americans love this country and those zeros will not embrace it. I see problems not the countries fault it's the politicians, take care of it at the polls.","commenter_a":"I'm done with the NFL you guys play a game and earn millions piss on all of you who disrespect our country!!!!","post_message":"BREAKING NEWS...."},{"comment_id":"10152785175031051","commenter_b":"Headbutt got her an ass whipping-lol","commenter_a":"I can't believe I watched this. I liked the headbutt though. lol","post_message":"It started out as an ordinary day at Walmart. Then, without warning – all hell broke loose."}]
