[{"comment_id":"10154347053069411","commenter_b":"45 million people on food stamps. 30 million illegal aliens allowed to run free while a record 2.3 million Americans are locked in jail. The largest national debt in the last 240 years. A record 95 million Americans are not in the labor force. The longest streak of war time in American history with 22 veterans committing suicide a day. A healthcare system than now kills a record 500,000 Americans each and every year while maiming millions more. The muslim Democrat Obama has proven he is an epic failure. Obama is killing Christians globally.","commenter_a":"People need to stop acting like that to cops if you keep resisting that's what happens! These cops are doing the best they can.","post_message":"'We f**ked'"},{"comment_id":"10153323546831747","commenter_b":"Now plural marriages are next.","commenter_a":"What a crock! States rights were dealt a severe blow today. Yesterday SCOTUS-care, today five judges ignore the constitution to impose more leftist agenda on the entire country. Overall a bad week for the USA!","post_message":"I've had some time to think about today's historic ruling. Here are my fuller thoughts...  Today, the arc of history bent further toward justice. We are a country that embraces the ideal of life, liberty, and the pursuit of happiness for everyone. With today's Supreme Court ruling guaranteeing the right to marry for LGBT couples, we came even closer to making that ideal a reality.  This decision is a reminder that we should come together as a nation in support of civil rights for all. LGBT Americans and their allies are joyously celebrating today’s landmark decision, as they should. On this same day, in Charleston, South Carolina, Reverend Clementa Pinckney, a martyr to the civil rights struggle, is being laid to rest. He was one of nine African Americans robbed of life in an act of white supremacist terrorism.  Our work to build a more perfect union never ends. Marriage equality is now the law of the land, yet there are no federal safeguards protecting LGBT Americans against employment and housing discrimination. The same Supreme Court that ruled today in favor of marriage equality two years ago gutted the Voting Rights Act, and to this day, Congress has failed in its duty to restore vital voting rights protections. Rights can be won, and rights can be lost.  We’ve helped create a fairer and more just society today, but new and longstanding civil rights struggles are on the horizon. I’m prepared to wage those battles too, because I want my grandchildren to see progress in their time. I want them to believe as I do that America’s best days are still to come."},{"comment_id":"10153902259248855","commenter_b":"She will","commenter_a":"Can only hope it won't look like don't ask don't tell","post_message":"Will she follow through?"},{"comment_id":"10152908001254071","commenter_b":"Women's sports don't even count","commenter_a":"#Webelieve","post_message":"A massive blow for the U.s. women's soccer team."},{"comment_id":"1128755127223092","commenter_b":"They are stopping them by firing these loose mouth bigots.","commenter_a":"Now employers can terminate employees for not having the same politics and ideological dogma as their bosses. The Radical Left is destroying America. They must be stopped.","post_message":"“She has expressed values that are at odds with ours and she has compromised her ability to meet the teaching and patient care mission of the School of Medicine.”"},{"comment_id":"620966654718777","commenter_b":"She is the most horrible stupid idiot that has ever lived. Look at all the destruction she has caused even after her death.","commenter_a":"Neither did Karl Marx.","post_message":"Two attempts -- one small, one large; one entirely private, one government-backed -- have both come to the same conclusion: Ayn Rand didn't understand squat about real-world capitalism."},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."}]
