[{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"\"We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,\" said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"10154075647091770","commenter_b":"You are totally right, Tucker.","commenter_a":"We turned to Hollywood to be entertained...NOT FOR POLITICAL COMMENTARY OR OP-ED! It really is that simple.","post_message":"Tucker Carlson has a message for Hollywood liberals"},{"comment_id":"10155971884414062","commenter_b":"You wouldn't even bow down to GOD himself but to some woman who \"claims\" African goddess with Indian woman hair.. okaaayyyyy","commenter_a":"I take this performance highly offensive! There is Only One King and that is Jesus Christ! #Stepdown!","post_message":"This was the first glimpse of Beyoncé since her pregnancy announcement hit Instagram at the beginning of February.  Winners' list: @webpagelink Photos: @webpagelink Full GRAMMY coverage: @webpagelink"},{"comment_id":"471302453029710","commenter_b":"Shut up bitch","commenter_a":"Lovely comments. Your humanity cards should be revoked. Two pilots died. They weren't bombing anyone. They didn't authorize an invasion. They may have left families. They made modest incomes. Let's hope we can oppose Russian foreign policies without celebrating the deaths of two everyday Russians. Condolences to their families.","post_message":"This is the sixth military aircraft accident in the country in just under six weeks."},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"1823139327950230","commenter_b":"As long as these people want to be citizens. No illegals allowed. Why are we babysitting other countries people?","commenter_a":"IMPEACH TRUMP Call and write your representative @webpagelink/ talking points 1 wants to lift sanctions on Russia so Tillerson and Exxon can drill big conflict of interest maybe even treason 2 where are his tax returns 2 unconstitutional act re immigration, the 3 Muslim countries NOT banned are those where he has business dealings conflict of interest 4 every president has had a White House medical exam, not Trump is he mentally ill 5 we can't wait for Painter and Eisen (Bush and Clinton ethics lawyers) law suit for disclosure Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist you by matching your ZIP code to your congressional district, with links to your member's website and contact page. HOUSE.GOV Find Your Representative · House.gov Not sure of your congressional district or who your member is? This service will assist ...","post_message":"Americans are making it clear: Trump's unconstitutional Muslim ban isn't going to fly.  Shared by Occupy Democrats, LIKE our page for more!"}]
