[{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"10153978119022690","commenter_b":"I'm a hard working taxpaying citizen and I say every day this is the greatest country on the plant. America is Great proud to be an American.","commenter_a":"It's great for immigrants and illegals. Not for the hard working tax payers that pay for everything they get. And they keep raiding SS to pay for them too what's so great about that?? TRUMP MAKE OUR COUNTRY GREAT AGAIN!!","post_message":"First lady Michelle Obama at the DNC: \"Don let anyone ever tell you that this country isn great. That somehow we need to make it great again. Because right now, this is the greatest country on earth.\" @webpagelink"},{"comment_id":"10156126266600615","commenter_b":"Make her pay for all the time she has wasted with her stupidity.","commenter_a":"Yes and he should block her from further action, and find her and her attorney's for wasting the court's time and money.","post_message":"What do you think? Will Judge Bunning dismiss Kim Davis' lawsuit against the governor?"},{"comment_id":"10152917419231051","commenter_b":"Seriously the Husbands deserve same treatment. I am not saying the mistress didn't have it coming . Chinese ladies are crazy !!!","commenter_a":"I don't get it! What about her douchebag husband!!? He's the one married but still decided to sleep with her sooo....","post_message":"This wife decided to track down her husband’s mistress and make an example out of her."},{"comment_id":"944125178989101","commenter_b":"Not unless the Bush Administration moonlighted at 7-11!","commenter_a":"That's an easy mistake to make, he thinks the guys that work at 7-11 were responsible for 9/11....sheesh.","post_message":"Donald J. Trump mistakenly refers to 9/11 as 7-11: “I was down there and I watched our police and our firemen, down on 7-11, down at the World Trade Center, right after it came down, and I saw the greatest people I’ve ever seen in action.\" READ MORE: @webpagelink"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"1377243338962685","commenter_b":"@username Typical liberal retards dodging the question. This isn't a matter of immigration, it's a matter of letting in the right immigrants.","commenter_a":"Good welcome to all terrorist to Canada ..According to Qubiec attack police arrested two and says......The two suspects are Alexandre Bissonnette and Mohamed Khadir Two students including one of 'Moroccan origin' have been arrested for the slaughter of six people at a Quebec mosque ...Mr. PM you are really trying to kill innocent people ...Idiot. .","post_message":"Six people were killed and eight wounded when gunmen opened fire at a Quebec City mosque during Sunday night prayers, in what Canadian Prime Minister Justin Trudeau called a \"terrorist attack on Muslims\"."}]
