[{"comment_id":"10155154391786729","commenter_b":"She claims not to know how they got there. That means they are there... end of story, now prosecute.... having them on an unsecured piece of equipment is a crime. Period.","commenter_a":"DON'T TRUST HER.","post_message":"Un-frigging-believable"},{"comment_id":"10154733856841509","commenter_b":"Hillary is a farce ridding on husbands shirt tails belongs in the kitchen not in the White House. She is a joke","commenter_a":"Trump says He's gonna make america great again but what he is actually doing is just taking all you idiots back in time and starting war and being racist again. He's kicking protestors out of the rally and saying \"All lives matter\" well then why are you kicking them? Trump's supporters are uneducated and racist as he is. Trump shames America's name. I dont really have a right to say all this since i haven't changed my nationality but i had to spit them words out as an American resident.","post_message":"CNN projects Hillary Clinton will win Maryland; Donald J. Trump will win Connecticut, Maryland and Pennsylvania. @webpagelink #SuperTuesday"},{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"10154388813222144","commenter_b":"@username and Obama won election twice and he didn't need Putin to help him.","commenter_a":"He will never be able to admit (or understand) that he will never be a \"legitimate\" president. He lives to win, but he knows he really LOST... BIGLY! (all together now.... 3 million votes.)","post_message":"But that's what happened."},{"comment_id":"646317502237529","commenter_b":"Better ban these assault tree's!","commenter_a":"I have done these cases before. There is no excuse for this type of thing to be happening if the trees are being properly inspected and cared for. There are certain types of trees that should not be in public parks because they are known to do this. God be with the family.","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"},{"comment_id":"10153780264915950","commenter_b":"Dana is a ugly bitch she loves controversy let me see where she works if she works the internet does wonders and ensure her emoloyer","commenter_a":"You're all pissed about a teenage \"KID\" using the N word a couple times in a tweet, (because according to the former Miss Teen, \"it ain't her word,-it should be no ones word, yet black America puts it out in song lyrics etc., that kids sing to) and not up in arms about a political head deleting thousands of emails and being hacked to boot. Oh, and a pretty blonde won so you're pissed there as well. News flash...the last one wasn't white! Get over it . Racism is not going away now or in the immediate future because the liberal media perpetuates most of it.","post_message":"A screenshot of 4 tweets have been making the rounds online."}]
