[{"comment_id":"10154594617592235","commenter_b":"Forgot this","commenter_a":"Typical conservative lack of knowledge. And yes, libertarians are conservatives. They are republicans. Believe me, they are republicans. Believe me. Republicans. Libertarians are republicans. Republicans. (Doing my best Trump impersonation, repeating myself over and over again. Repeating myself. Over and over. Believe me. Over and over)","post_message":"What the hell?  They announced victims right from the start."},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills.  God is so good."},{"comment_id":"10153778518101051","commenter_b":"Whore. Really? Are you 14?","commenter_a":"Not defending her but why was the affair discovered two months AFTER she filed for divorce? Thats a little creepy on the ex husband's part.","post_message":"This man suspected his bride was up to something, so he hired a private investigator to check it out. His suspicions were ultimately confirmed and his wife was arrested shortly after."},{"comment_id":"10152578653426636","commenter_b":"Crazy moms be crazin","commenter_a":"Jeremy Blackwater Lopez","post_message":"A mother is now facing charges after she allegedly forced her children to drink poisoned apple juice.  According to authorities, she came up with the plan because she was mad at their father."},{"comment_id":"10153715026934199","commenter_b":"Yup, tell Alaska pipelines are safe.","commenter_a":"you know, a pipeline is the safest mode of transportation.......","post_message":""},{"comment_id":"1301566109863416","commenter_b":"~ Peoples personas don't change without great effort, just ask any addict. ~ Why is it always the retarded republican that thinks they can tell people what to do? Can't quite quantify and validate your reasons for voting for the Trump tard?? ~ Let me help you. Trumps tax plan is a joke that gives radical tax breaks to the rich, while promising 0% tax for people making under 25K. People who make under 25K already don't pay any taxes, and the rich already have enough tax breaks and loop holes. @webpagelink ~ Trump says he wants to stop outsourcing, yet his clothing line and make America great hats are made in China. @webpagelink ~ You might think he's good with money, but Trumps companies filed for bankruptcy 4 times in recent history. @webpagelink ~ Trump wants to build a wall to keep criminals and drugs out, Yet criminals are ...","commenter_a":"Very good & funny","post_message":""},{"comment_id":"944125178989101","commenter_b":"Not unless the Bush Administration moonlighted at 7-11!","commenter_a":"That's an easy mistake to make, he thinks the guys that work at 7-11 were responsible for 9/11....sheesh.","post_message":"Donald J. Trump mistakenly refers to 9/11 as 7-11: “I was down there and I watched our police and our firemen, down on 7-11, down at the World Trade Center, right after it came down, and I saw the greatest people I’ve ever seen in action.\" READ MORE: @webpagelink"}]
