[{"comment_id":"10153416181512217","commenter_b":"if I had to go, this is how I'd do it","commenter_a":"@username this is like your entire sense of humour in one headline","post_message":"Father Stephen Crossan has taken extended leave from the priesthood."},{"comment_id":"772199822829043","commenter_b":"Don't give in!!!! Let the threaten a lawsuit then tell the idiot atheist to go home & leave his town alone!","commenter_a":"Leave","post_message":"‘It’s very surprising that one guy can come from out of state and start all this’"},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""},{"comment_id":"455979541241733","commenter_b":"Get a life, lady!","commenter_a":"how many illegals have we settled in nh that are on medicaid using this? what towns are they in, do we have a sanctuary city in nh or are we planning to?","post_message":"Good to see that more than 41,000 Granite Staters have signed up for coverage under Medicaid in the first year of the program. While I continue fighting to improve the Affordable Care Act, I'm glad to see health care reform moving in the right direction in New Hampshire."},{"comment_id":"464672456990682","commenter_b":"Fire her.","commenter_a":"Go to jail and never see the sun again.","post_message":"Do you believe this lady has the right to continue to defy the law?"},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"},{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."}]
