[{"comment_id":"479579702230323","commenter_b":"Yes","commenter_a":"Finally!!","post_message":"Do you think Hillary should be facing criminal charges right now? [Watch below]"},{"comment_id":"10153397569465950","commenter_b":"Girl power!! I'm sure he deserved it.","commenter_a":"So. The boy must have said it done something very intimidating to push get to this point don't have think?","post_message":"The viral video of a high school lunch fight shows a girl throwing a boy to the ground. At one point someone tries holding her back, but then she breaks free and knees the boy in the face before running away."},{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10154658880931178","commenter_b":"just some dumb f****** n*****","commenter_a":"I still have no idea who this guy is.","post_message":"Under fire music star Chris Brown ranted against the cops and praised #BlackLivesMatter."},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"849277451776263","commenter_b":"im glad he was never my minister...and oprah needs to get the heck off television and go to another country and spread her crap","commenter_a":"The Bible does Not Change over Time. God put forth his Word to his People. He is the Same today as he was Yesterday. She should Read the Bible and see what Gods says.","post_message":"Oprah asked former megachurch pastor when Christianity will embrace gay relationships.  His answer seemed to take her by surprise."}]
