[{"comment_id":"10154904389672235","commenter_b":"First, someone like me will have to tell the old hag to STFU and get out of the lady's face.","commenter_a":"I wonder how long it willl take for it to sink in to the deplorables that this sort of behaviour is intolerable, and they will be held in contempt for it by civilized people?","post_message":"BOOM!"},{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"},{"comment_id":"1231022086976838","commenter_b":"Look at the size of that wood. Those are strong birds. Yet so very gentle with their chick.","commenter_a":"Menifee California","post_message":"BREAKFAST TIME! Looks like Momma Eagle is feeding her new hatchling. More info: @webpagelink Where are you watching from this morning?"},{"comment_id":"10156430237125294","commenter_b":"Lol the military spread photos with weapons like we were suppose to","commenter_a":"As a photographer I wouldn't have taken this picture. A girl and her bow is a great idea. But not in a threatening manner like this.","post_message":"She has to give the school another photo. But, her mom is asking why someone else was allowed to do it in the past..."},{"comment_id":"10152857633614753","commenter_b":"why these people even walking the earth...round them up and send them to isis","commenter_a":"Assholes a","post_message":"These people need to be banned from America."},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."}]
