[{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"},{"comment_id":"1359423070754409","commenter_b":"WOW gives a whole new meaning to hard boiled and 3 minute egg","commenter_a":"So we're any charges filed on the creeps who took advantage of her bad luck?","post_message":"The woman admitted she exchanged sex for money and that she performed sexual acts in a chicken coop."},{"comment_id":"1684251881603765","commenter_b":"Both if possible. The Press. Too much disregard for the truth.","commenter_a":"Can we drain them together ?","post_message":"Which swamp would you drain first?"},{"comment_id":"420321631489464","commenter_b":"how about someone do a drive by on these losers, it would do the world a great deed.","commenter_a":"Non existent","post_message":"Can you Imagine the Media Coverage if These Guys Were White?"},{"comment_id":"10154534955796336","commenter_b":"Hillary will NEVER do time for all the crimes she has committed. She and Bill have been getting away with their CRAP for YEARS. Just because it's a different year, doesn't mean anything will change.","commenter_a":"Hillary Clinton will win the election in November. Then, sometime between November and January, Hillary will be indicted. The IRS is now investigating the Clinton Foundation and the whole e-mail thing isn’t over yet. Once under indictment she won’t be able to assume the Office of the President in January. Tim Kaine, who will not actually be the Vice President because neither he nor Hillary have been inaugurated, cannot assume the Presidency. The Speaker of the House can’t move up to it because there is already a sitting President and Vice President. So President Obama, in an Executive Order citing “emergency situation,” gives himself another four years in office is the only way possible. Obama has been planning this for a while now, knowing he has enough on Hillary to indict her. Had the Attorney General indicted her based on evidence from the FBI this plan wouldn’t have worked because ...","post_message":"\"The terrorists overseas utilize our strengths – which are compassion and empathy – against us.\"   Kris \"Tanto\" Paranto, who survived the attack in Benghazi, expressed his support for a more rigorous vetting process for refugees."},{"comment_id":"10153678323388908","commenter_b":"Interesting - are Israelis more tightfisted than racis","commenter_a":"Luisa","post_message":"A cafe in Israel has decided to give a 50 percent discount to tables mixing Jewish and Arab diners, in an attempt to ease racial tension..."},{"comment_id":"541947015995878","commenter_b":"Impeach this peace of crap in the WH !","commenter_a":"boo the windbag muslim !","post_message":"Americans are furious after Obama hammers christians on TV.  What disrespect. He's gone too far with this.   Do you think Obama is out of line?"}]
