[{"comment_id":"10154379177365579","commenter_b":"Thats illegal zach. You have to come here to get it.","commenter_a":"If only he lowered the debt, defeated terrorists, raised the employment level, etc. as well as he cracked jokes.","post_message":"FULL REMARKS from President Obama at his final White House Correspondents' Dinner."},{"comment_id":"10153512476881337","commenter_b":"Dat nigga is fuccin NASTY!!!!","commenter_a":"AE Guy Hung Nhi Vo","post_message":"GET EXCITED: The Predator is about to enter the Mortal Kombat X world..."},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"10153971160946320","commenter_b":"@username - LOL. That's ok. Some people need a little help to find their funny in the morning.","commenter_a":"The moment you realize the Jon Stewart photobomb.","post_message":"Retired firefighter Ray Pfeifer was honored at City Hall for his work in persuading Congress to extend Zadroga Act benefits for thousands of 9/11 first responders suffering from 9/11 related illnesses.  Thank you for caring and fighting for what was right. Read: @webpagelink"},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"10153799327541336","commenter_b":"He was not hitting her I hope.she spends years in jail,she could have killed that officer","commenter_a":"Got Her.","post_message":"A woman used her car as a weapon and knocked over an Auburn Hills police officer to flee a traffic stop. Breianna Smart was caught and arrested."},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"}]
