[{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"1802278956685902","commenter_b":"She is winning calm down","commenter_a":"Bahahaha 95% of the comments are anti Hillary and they have us believing she is winning...","post_message":"We're in Denver, Colorado, where both Bernie Sanders and Elizabeth Warren are holding a rally for Hillary Clinton."},{"comment_id":"10153203390966320","commenter_b":"Actually it's rent stabilized...different rules...","commenter_a":"a rent controlled apartment can not cost more than 2,100 a month. It even says so in the tenant laws","post_message":"Tenant accused of listing rate stabilized apartment for $649 a night on Airbnb @webpagelink"},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"10156102999530354","commenter_b":"If he's not an illegal, he should be. What a POS. If you feel uncomfortable around the American flag, then get the hell out of our country.","commenter_a":"while your education comes out of our pocket screw you anti american crap","post_message":"Look what Matthew Guevara has to say about the American flag..."},{"comment_id":"1016358938401725","commenter_b":"MONEY !!!!! That's all they care about !","commenter_a":"probably worried about all the money they have stashed in offshore funds they may have to pay tax now","post_message":"\"I don't think I've ever wanted magic more.\" J.K. Rowling, James Corden and more British celebrities react to the historical #EURef vote. @webpagelink"},{"comment_id":"10153799805727623","commenter_b":"They need to be handcuffed at all times !","commenter_a":"Now report how many inmates are killed by correctional officers every year","post_message":"4 correctional officers are assaulted at a North Carolina prison:"}]
