[{"comment_id":"10154847976925560","commenter_b":"This is so sad and disgusting...and women kill for these bags.","commenter_a":"This is just bullshit","post_message":"This is why Hermes & Louis Vuitton bags have those bumps on them. [GRAPHIC]"},{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"},{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"},{"comment_id":"10153634339640695","commenter_b":"Randy isn't even from the south. He's a Yankee. He has no say in whether it would come down or not. Just trying to yank your chains.","commenter_a":"take that dirty monument down!!!","post_message":"Instead of removing the carving, one councilman says they should add to it to better reflect Georgia history. What do you think?"},{"comment_id":"10152805684357377","commenter_b":"Bout time someone got a pair! Keep your ducks in a row bro. I'd like to see her in a 4x8 with obstructed view!","commenter_a":"They trying to stop Hillary at all cost.","post_message":"Klayman reveals the details on The Steve Malzberg Show. Watch Newsmax TV on DirecTV Ch. 349, DISH Ch. 223 and Verizon FiOS Ch. 115. Get Newsmax TV on your cable system."},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10153717683207894","commenter_b":"@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"}]
