[{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."},{"comment_id":"10153188303164087","commenter_b":"Put this bitch in jail.","commenter_a":"Looks like she gets the \"CHAIR\" same as Ethyl Rosenberg!","post_message":"Hillary Clinton’s personal email server hosted two “top secret” emails, a new report reveals."},{"comment_id":"1051602538269331","commenter_b":"STFU!","commenter_a":"Obama is one of them! The blood of those in Paris rests on him. \"The greatest threat is global warming....\" Obama caused those deaths in Paris.","post_message":"UPDATE"},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: \"This is a bunch of scumbags. That's what they are, who are all organized around making money.\" @webpagelink"},{"comment_id":"511120385679668","commenter_b":"Our government pushes meth, heroin and every other drug, but its OK because they say it is?","commenter_a":"Let's not forget that a large portion of the prison population in the U.S. has been incarcerated because of nonviolent drug charges.","post_message":"Listen here: @webpagelink"},{"comment_id":"1131610686905195","commenter_b":"@username back your claims up with citations and credible sources! @webpagelink","commenter_a":"Bernie says it best, \"You've got some middle class people working longer hours for lower wages -- they pay their taxes, they support their schools, they support their infrastructure, they support the military. But the billionaires? No, they don't have to do that, because they have their friends on Capitol Hill. They pay zero in taxes. So Trump goes around and says, 'Hey, I'm worth billions, I'm a successful businessman. But I don't pay any taxes. But you, you make $15 an hour? You pay the taxes, not me,'\" he said. \"That is why people are angry and want real change in this country.\"","post_message":"Millions of Americans work hard and pay their taxes. So why doesn't Donald Trump pay his?"},{"comment_id":"1716657778577521","commenter_b":"no not true.I have seen proof LOL","commenter_a":"When faced with criticism of their candidate, Trump fans are quick to argue that Trump is better suited to be president than Obama or Hillary. The choice is NOT between Trump and Obama or Trump and Hillary. The GOP is choosing THEIR standard-bearer. The choice before us AT THIS CRITICAL MOMENT is between Trump and anyone of three other Republican contenders. Who will have the moral character to stand up against Hillary or Bernie? I choose CRUZ!","post_message":"Is there a real connection between hand size and penis size? We decided to investigate what the science says on the matter..."}]
