[{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153039031790329","commenter_b":"Kriti Kothari","commenter_a":"One for you Bella La Verde","post_message":"Find out which one of these redheads will light your fire."},{"comment_id":"10153169080361336","commenter_b":"What's up with that first woman who RAN in the other direction? Nice.","commenter_a":"They only pitch in to help the fallen man and good Samaritan after RUNNING AWAY FIRST!","post_message":"The 28-year-old hero leaped on to the tracks to save the man from getting hit by a train and other commuters helped to pull them both to safety."},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""},{"comment_id":"629437257246853","commenter_b":"All I can say she is a stupid bossy bitch. Wtf they need to be kicked out of the whitehouse on their ass and put in prison all the laws they have broken. Don't know why they haven't impeached him yet. It's not racist.","commenter_a":"ugly worthless nigger","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"10154030694113812","commenter_b":"I think the kind of look like little foxes... so cute!","commenter_a":"I don't know the reason they call them red pandas when they resemble Raccoons","post_message":"After a 2-year hiatus, red pandas have returned to the Smithsonian’s National Zoo and Conservation Biology Institute."},{"comment_id":"10153440852086051","commenter_b":"@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."}]
