[{"comment_id":"10154932317190690","commenter_b":"\"A bit of a bear\"??? What IS it with this woman and BEARS?","commenter_a":"I hope she takes care of that grizzly bear problem once and for all.","post_message":"Education Secretary Betsy DeVos: \"For me personally, this confirmation process and the drama it engendered has been a bit of a bear.\" Full video here: @webpagelink"},{"comment_id":"10152803478324877","commenter_b":"And so are you......","commenter_a":"Cosby is guilty.","post_message":"Malcolm-Jamal Warner Breaks His Silence On The Bill Cosby Rape Allegations. Read what the 'Theo' actor had to say about his TV dad.   Grio fam, is this a fair comparison for him to make? Sound off."},{"comment_id":"1071811879506489","commenter_b":"^ and I can see you sucking my cock @username.","commenter_a":"I can see Cruz flying a plane into a building or mountain.....","post_message":"Ted Cruz recently compared himself to Galileo, and compared those who accept climate change to flat-Earthers.  No. Just no.  Image via Forecast the Facts."},{"comment_id":"10153238696686813","commenter_b":"@username Oh yea you and and stupid California is a payer State... you dumb asses pay twice as much to live in pollution surrounded by painted hills of immigrants. You people have made mad bank off the backs of Immigrants, thus the reason you want more. Dumb Blonde wow, I thought that was a cliche!","commenter_a":"The people of this Country are tired of being worked into Slavery to merely exist... The continuous need to help outsiders with no regards to the effects of the US Citizens that do not need anymore competition for jobs and affordable housing is Un-Patriotic and a spit in the face to every working class American and their children and grandchildren. We are asking the Federal Government to listen to the People's request but they are blatantly ignoring and denying our request to stop this invasion. Anyone that stands for the Big Federal bully tactics should go down with them when the Civil unrest begins.... It's coming, just wait for it! There are far more Citizens on this land than the Police, Military and Government goons combined! KEEP POKING THE BEAR! NO REFUGEES OR IMMIGRANTS are Welcome here don't you get it.... Take your ass to California and mooch off the ...","post_message":"GOOD NEWS: Court denies Texas motion to block Syrian refugees, and finds Texas unlikely to win lawsuit.   “There is nothing in the law that gives the state veto power over any decision of the federal government or permits any state to discriminate against certain refugees based on their nationality, in fact the law says just the opposite,\" said ACLU of Texas’ Rebecca Robertson. #refugeeswelcome #allfaithswelcome"},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"10154283340572061","commenter_b":"You need an education woman. The president has already spoken. People like you really scare me. Your like a lose cannon with no direction, hurting the innocent! I don't agree with you but would never think of slamming you or causing you hurt. Everyone needs to figure out how to get along or there's not going to be a world to live in for any of us.","commenter_a":"Where are words from the president? Words, that's right, he has a short vocabulary. He can't say it's going to be great, really, really, great. When I tell you, it's going to be yuge. Sad America, when disaster strikes, your president is somewhere eating caviar sulking about his weak inauguration numbers. smh","post_message":"At least 16 people have died over the last 48 hours due to tornadoes, as a violent system of storms works its way across the Florida Panhandle and parts Georgia and Alabama: @webpagelink"},{"comment_id":"10153581421506336","commenter_b":"How do you go so wrong in life before you're even out of high school??","commenter_a":"But they look like law abiding professionals","post_message":"Four high school students have been arrested in the carjacking and kidnapping of a Texas border patrol agent who was vacationing with his family in Florida authorities said."}]
