[{"comment_id":"855612107818751","commenter_b":"So then please elaborate what does happen once that sperm penetrates that egg-I'll wait.","commenter_a":"The egg, once fertilized, then has to implant to become life. Not sure conception counts, not without implantation. Otherwise, you're telling every woman who takes birth control pills she is a murderer.","post_message":"The evidence is clear: life begins at conception!"},{"comment_id":"1263042020429217","commenter_b":"She started the whole thing ...she spit on him and was calling him a n***** ...she even lied and said she didn't even hit him or anything and begged for the video to not be shown.she is also suing the restaurant and this is not the first time she assaulted someone and lied about it .she is scum and a money hungry bitch","commenter_a":"Everybody saying she deserved it, just hope your daughters don't instigate something and get her ass beat.","post_message":"Totally uncalled for!  #WSHH #Oklahoma #JoeMixon"},{"comment_id":"689708227853298","commenter_b":"Evidently the back of your father's hand never helped you because you're still talking crap go home Joe go home","commenter_a":"Hypocritical scum. \"This is a Big f---ing deal\". Didn't you say that?","post_message":"Vice President Joe Biden: Donald J. Trump's language would have gotten me \"the back of my father's hand\" abcn.ws/2fOBDpy"},{"comment_id":"10153615145678598","commenter_b":"this woman is sick and will be judged by God. I wouldn't want to be in her shoes when she stands before God!","commenter_a":"And you get an abortion! And you get an abortion! And you! And you!","post_message":"Hillary Clinton: “I Think We Should Do Everything We Can” to Promote Free Abortions"},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"},{"comment_id":"1267683656603525","commenter_b":"She has totally lost it, poor woman.","commenter_a":"Why can't the average Democrat see the pattern of off the wall psychotic behavior that has plagued the left for decades? Conservatives don't riot in the streets, have \"safe spaces\" where only we are allowed to speak, give participation trophies, or any of the other garbage. Conservatives use facts to make their points and progressives use emotions to emphasize their fake news and rally the infants rally the indoctrinated. The mass hysteria on the left is causing the country to lose focus on the threat of the real danger of the three prong attack on America and the one person at the center of all three. Barack HUSSEIN Obama is race baiting with his attacks on white cops which spurred into BLM attacks on all whites. He openly aids and encourages illegal immigrants. He built and carried in the Trojan Horse Muslim refugee program. Each of these are for the ...","post_message":"Jill Stein's crazy recount effort is over, and the realization of her epic failure launched her into a nutty rant. Stein seems drunk as she starts to shake and yell about Donald Trump, and it's really bizarre. During this strange outburst, she demands Trump  \"put down\" one thing that proves she is also delusional.  @webpagelink"},{"comment_id":"10153203916923984","commenter_b":"Stand By Him- Military knows they are the boss-but a chaplain has an higher boss. Military should not let this man go.","commenter_a":"Why only a 1 month assignment as assistant? Is that the norm? Missing pieces of this story.","post_message":"This highly decorated vet and former SEAL chaplain is facing something unexpected after 19 years of service...  Do you stand by this lieutenant commander?"}]
