[{"comment_id":"10153357415706782","commenter_b":"They should all be illegal They cause cancer.","commenter_a":"Waste of time and money","post_message":"Lawmakers passed a tanning bed bill through a committee Monday. The bill would make it against the law for anyone under 18 to use a tanning bed.  What do you think of the bill?"},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, \"I felt like this weight had just been lifted out of me, and people knew where we stood.\""},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"10153312472421323","commenter_b":"Over kill..............","commenter_a":"It's a wonder the shells didn't bounce off the medals.","post_message":"Hyon Yong Chol, who heads the isolated country’s military, was purged and then executed by firing squad with an antiaircraft gun, watched by hundreds of people, South Korean media reported on Wednesday."},{"comment_id":"10153400883926813","commenter_b":"@username SHE is a girl.","commenter_a":"I love this brave kid.","post_message":"Great victory today! Court rules in favor of our client, transgender student Gavin Grimm, in his challenge to Gloucester High School’s discriminatory restroom policies!  Watch Gavin's video where he stands up for students everywhere."},{"comment_id":"215680145570500","commenter_b":"Who cares what she thinks?","commenter_a":"Stick to pretending to be someone else and saying someone else's words!","post_message":"Not a fan of Meryl Streep's politics? According to her, you may as well be a Nazi."},{"comment_id":"911844395571846","commenter_b":"Hillary is Hillaryous!!!","commenter_a":"Oh great, more solar energy... Solyndra anyone? $535 million more in gov't grants to a failed technology? Better to build a nuke plant AND it doesn't take up as much space, it would take miles and miles of solar panels to even come close to a nuke plants energy output!","post_message":"Do you agree with Hillary Clinton? #DemDebate"}]
