[{"comment_id":"10153541648111336","commenter_b":"Trump is in favor of obumercare or something like it.","commenter_a":"WE HAD AN ELECTION AND WERE PROMISED BY THOSE WHE ELECTED THAT THEY WOULD DEFUND AND REPEAL OBAMACARE they haven't done either or even tried looks like both sides are out to destroy us!!!!!TRUMP FOR PRESIDENT!!!!!!","post_message":"The first Obamacare-created insurer to go under could cost federal taxpayers up to $140 million, according to a new court filing."},{"comment_id":"949528478479092","commenter_b":"why can't they just leave things alone change this change that !!!!!","commenter_a":"The man who stopped the corrupt bankers is dumped. How extraordinary.","post_message":"Not everyone is happy about the change."},{"comment_id":"1108272855874801","commenter_b":"she has a penis","commenter_a":"She looks like a man..","post_message":"Terrible!"},{"comment_id":"10153856538795575","commenter_b":"Great post😀","commenter_a":"People say that Mr Trump doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan he's giving you an outline. Why? Every time he brought something to the table, the other candidates take it and run. Such as immigration, the wall and other issues. I can guarantee you that he won't give you his full plans in detail until he standing at the podium next to one of the Democrats. That is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business without a strategy, and a form of negotiation already set. This man is prepared in business and it will be prepared when the time is right in a debate. He is a brilliant man, and he will not ...","post_message":"CHAOS in Alabama --  20,000 EXPECTED AT TRUMP RALLY!"},{"comment_id":"10154362431207293","commenter_b":"@username She may surprise you.","commenter_a":"Pennsylvania must be filled with idiots. The KKK and White Supremacists have always held high number of members in that state","post_message":"“Put in Trump and we’ll win again,\" one voter said."},{"comment_id":"1247078658692220","commenter_b":"Bitch no it ain't, ole flat volleyball shaped head ass","commenter_a":"John H. Gonzales III this is @username hair style rn","post_message":"He needs a fitted cap asap!  #WSHH #Haircut"},{"comment_id":"10153248558026336","commenter_b":"Is eating pussy a sin??","commenter_a":"Just absolutely heartbreaking. So glad their little one survived. Prayers for all involved in this devastation.","post_message":"Melissa and Michael Mooneyhan died shielding their young daughter from a tornado in Arkansas. The girl, who is about 18 months old, survived."}]
