[{"comment_id":"10154031292643132","commenter_b":"She still looks like a dude","commenter_a":"Good for her! She took care of herself, had a HEALTHY weight gain, and gets to enjoy the results.","post_message":"It's hard to believe this is just after ONE week!"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"},{"comment_id":"570057943197857","commenter_b":"Agree with you @username","commenter_a":"That too faced Lib says things a sailor wouldn't say on a drunken night","post_message":"Jamie Lee Curtis ripped Donald Trump for his \"lewd\" comment on Lindsay Lohan."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"10153976487996130","commenter_b":"we are living in the country that has no national insurance and crazy people can have a gun. poor sick people will die without government help and crazy people can massacre a lot of people easily and at one time with a gun.","commenter_a":"Kasa","post_message":"Another mass shooting. Another national address by President Obama."},{"comment_id":"10153117964021162","commenter_b":"Killer her","commenter_a":"At the very least, SPAY THIS MONSTER!!!!!!","post_message":"DISTURBING: This mother is accused of deliberately making her 9-year-old son sick by putting feces in his IV.  FULL STORY: @webpagelink"},{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"}]
