[{"comment_id":"10153462081617452","commenter_b":"Get a life lady!!","commenter_a":"She should be FIRED ...","post_message":"\"You're saying I can't have a hairstyle because of your culture? Why?\"  San Francisco State University is investigating a confrontation between a black student and a white student over dreadlocks."},{"comment_id":"10154727514062235","commenter_b":"Between crooked Trumpkin and crooked Hillary I'm going to vote for Hillary.","commenter_a":"A vote for Donald Trump or any politician who supports his candidacy is a vote for discrimination. Period. No exceptions. No excuses. You might as well tell your Black, Latino, Asian, LGBTQ, Muslim, Jewish, Native American, non-Christian, disabled and woman fellow Americans they are not welcome in the U.S.","post_message":"Okay, Mr. Trump adviser, there is a big difference between a fact and just something you wish was true."},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"560619820771155","commenter_b":"Happy Thanksgiving Dr. Carson and family!","commenter_a":"God bless and keep you both always,many more Thanksgiving to share our blessings.","post_message":""},{"comment_id":"10153665573326077","commenter_b":"Yep bet you never did anything wrong in your life","commenter_a":"Wth is wrong with kids nowadays... Everyday they are up to something crazy !! Yesterday was drinking fuel with soda , today is this , tomorrow?? What??","post_message":"Have you heard of the \"duct tape challenge?\""},{"comment_id":"10153328047582217","commenter_b":"I think it was just you and me. I don't even remember the boys being there?? I can't really remember the play either, just waiting at the stage door after!! I think your right about Minnie driver too.","commenter_a":"@username :-)","post_message":"🎶 So no one told you life was gonna be this way...🎶 😃"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"}]
