[{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the \"Dollar menu\" and make it \"Five dollar menu\" then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    \"...we work to offset any impacts of future wage inflation through technology initiatives,\" said Wendy's."},{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"10153011198456717","commenter_b":"Time to jail her ass","commenter_a":"Yay!","post_message":""},{"comment_id":"10153176907066130","commenter_b":"And not be forcibly altered. Don't circumcise babies!","commenter_a":"Before picture or nahhh","post_message":"\"We need to remove the stigma. We should be able to alter whatever we please, free of the judgment of others.\""},{"comment_id":"10153531144626350","commenter_b":"I agree. God bless you Lil child.","commenter_a":"This is courage","post_message":"Looking good, Leah!"},{"comment_id":"1726486197616166","commenter_b":"She needs a male beside her. They wont vote for","commenter_a":"Love my Senator, Tim Kaine. But Elizabeth Warren should be the Veep pick. Please make it happen, Madame Secretary!","post_message":"Watch live as Hillary and Senator Tim Kaine take the stage in Virginia ⬇️"}]
