[{"comment_id":"10153201571853812","commenter_b":"Hes a witch!","commenter_a":"Ahmed Shannon Nathan Jake Conrad Robert Ya Ron Ronaldo","post_message":"WATCH: In Portland, Maine, it is cold. Very cold. THIS cold. -- [ VIDEO: Portland Police Department] - ABC News Weather"},{"comment_id":"10153177685071800","commenter_b":"Lol all these super women who, according to themselves, work so much harder.... Men work more hours, more dangerous jobs. Statistics are a bitch. The pay gap is a myth. Plain, simple. Even a feminist can see it. But yall keep pretending. Keep that victim thing going.","commenter_a":"People. It takes literally five minutes or less to find a credible publication explaining exactly what the wage gap is, and it really isn't anything in fact. It's just kind of inherently flawed, it is NOT based on men / women doing the same work but rather every man's wage and every woman's wage for EVERY FULL TIME JOB PERIOD, from waitress to business executive. It doesn't mean men are paid more automatically for being men, it just means men are generally getting the higher paying jobs (which there are legitimate sociological reasons for), OR men are more willing to do dirty / dangerous jobs that women are generally unwilling to do. So assuming of ten... Oh I don't know, sewer workers making 20 dollars an hour , eight are men and two are women, and of ten store clerks making 13 dollars an hour , eight are women and ...","post_message":"Jon: You're telling me we're going to print a human heart out of a Xerox machine before women get pay equality? Kristen Schaal: I'm telling you we're going to print human hearts out of Xerox machines 30 years before women get pay equality!    ► Jon and Kristen Schaal discuss the gender pay gap: @webpagelink"},{"comment_id":"760411690754543","commenter_b":"We have enough oil in this country for the next 400 years but John Bush wants arab oil imported not american oil","commenter_a":"We've had enough of oil energy and oil families like yours. Get lost. You're not welcome on this planet anymore.","post_message":"If we embrace our energy revolution, we can create millions of jobs and higher wages: @webpagelink"},{"comment_id":"10153229519907377","commenter_b":"sick of protesters .come to our country and complain ,get them back to the life they love","commenter_a":"Who let the trash in in the first place ?","post_message":"\"There is hatred against us that is unbelievable,\" Trump told the rally, according to CNN, after Hamid and several others were ejected."},{"comment_id":"10154777446051336","commenter_b":"she's a prick","commenter_a":"It's disgusting Megan Kelly should shut up and be suspended with her biased comments shut her up! And stop playing Miley Cyrus music in the background! She said she is leaving if Trump wins. Bye Miley!","post_message":"\"The American people have spoken and the American people have elected their new champion.\"  Tonight, Vice President-Elect Mike Pence thanked the American people for his and Donald J. Trump's election victory, before introducing the President-Elect."},{"comment_id":"10153596919524205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"Amanda Kovanis","post_message":"Donald Trump has been running a populist campaign, and during the Republican primary that has meant saying outrageous things to impress conservative voters. Will he change his positions when he becomes the Republican nominee?"},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining \"i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.\" A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"}]
