[{"comment_id":"1784575138485488","commenter_b":"How would she know what honor is?","commenter_a":"Honor .... She doesn't know what that means........","post_message":"Clinton says she wants Trump to know what \"American honor\" looks like. What do you think about her speech?"},{"comment_id":"10153582550231336","commenter_b":"Hi Donald Trump, what about putting those illegal people in the row to go fight against IS IS if they want to stay so bad. The America way!!!!just a thought.","commenter_a":"Hillary will send food stamps.","post_message":"In an interview, Donald J. Trump said that he would deploy U.S. troops to Iraq to seize ISIS-held oil fields, in order to choke the financial spigot that fuels the terror group."},{"comment_id":"1099934806735302","commenter_b":"These are the ones that should be deported","commenter_a":"yes go for it1","post_message":"ISLAM GAME OVER: Dutch politicians call for mosques to shut down and ISLAM to be outlawed!   Do you agree? It's a death cult anyway..."},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"},{"comment_id":"10154601814298812","commenter_b":"Beaver girl you are the lowest BS, send you to middle east good luck, Israel girls know how to fight, and the Frenchie girls know how to fight, you know like the French under ground","commenter_a":"Maybe they could present plans to \"Make America Great/Safe/White/America again\" Instead of hosting the \"We hate Hillary\" show. They really do just pander do the lowest common denominator.","post_message":"So far, speakers have mentioned Hillary Clinton an average of just over six times in evening speeches at the GOP Convention."},{"comment_id":"10153195806687217","commenter_b":"Thats the day nearly over! They're normal human beings like the rest of us, go to bed earlier! !!","commenter_a":"Yes, specially for night creatures like me ,actually 7-12 pm would be better (It's a fact that your brain is more active at night)","post_message":"Yawn! Should teenagers be allowed to start school at 1.30 pm?"},{"comment_id":"543375892529200","commenter_b":"She wouldn't survive!","commenter_a":"She should go to Sinaloa, they've been purging for a couple of years now, plenty of Mexicans to choose from there","post_message":"\"I would kill as many Mexicans as I could in one night.\"  A waitress, who was apparently upset that a customer didn't leave a tip, has been fired after she tweeted a racist comment."}]
