[{"comment_id":"10153101911354877","commenter_b":"Give an inch and they take a mile.... true, but knowing that why even give an inch? She's just trying to get attention. If she were a normal woman she would be on every comment feed talking about \"like me on instagram\"","commenter_a":"I don't understand why some celebs consider sharing EVERY aspect of their lives but when they are judged or talked about they immediately ask for 'privacy'.","post_message":"'I demand that I climax': Nicki Minaj gets candid about her sex life in Cosmo - and where she sees herself in ten years.   Grio fam, do you find it refreshing when celebs open up like this? Or is it T.M.I?"},{"comment_id":"1748972275334787","commenter_b":"Even if the woman was standing to pee, they are inside a stall with the door shut, Us woman don't peek under the stall to watch other woman pee...only pervs do that","commenter_a":"The thing that makes me LAUGH is people have most likely ALREADY shared a bathroom with someone who is trans and didn't even know it!","post_message":"It doesn't make ANY sense…  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"541211179416415","commenter_b":"hey Trump when you talk about the refugees, can you name every refugee groups that lives in the United States and what kind of jobs they have to work to feed their family and children? BTW, every refugees family's that moved to United States are helping out U.S. economy by working at those places where no white man can stand to work there, also they are paid with minimum wage without complaining. so be grateful and welcome them to come and live in the United States, especially the Karen refugee.","commenter_a":"Mr Trump the solution of the conflict between Israel and Palestinians can be very simple America and Europe should stop sending billions of dollars to Palestinians so the Palestinians know that when they get up in the morning if they want to eat they have to work and not killing the Jews!!","post_message":"We’re going to come together and come up with solutions- and so far I cannot believe how civil it’s been up here! #GOPDebate"},{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"},{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10154164608531438","commenter_b":"Can masculine looking lesbians use the bathroom in your world Dina? Doesn't sound so.","commenter_a":"I think this is a positive thing, but most people I've talked to that oppose that bathroom scenario is not from the perspective of the transgender, but from what harm could come from people abusing that system to gain access to bathrooms they wouldn't normally have access to. If there was a way to guarantee kids and women's and men's safety in the bathrooms, then I don't think people would mind..regardless, we should be teaching both genders to not be dick holes to other people, regardless of what bathroom they most identify with.","post_message":"This moving ad on transgender bathroom rights will air for Fox News viewers during the final night of the Republican National Convention."},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."}]
