[{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"@username 😂","post_message":"Watch out"},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":""},{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"952491891550656","commenter_b":"It's CA...go figure...N CA that is which is even worse","commenter_a":"Too bad there is not a \"Dislike\" button","post_message":"JUSTICE."},{"comment_id":"10153695940741955","commenter_b":"Does she get virgins too?","commenter_a":"ew....that is all...","post_message":"UNDER THE BURQA"},{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"},{"comment_id":"1760125540941984","commenter_b":"They're far better than Hillary and her crooked minions! If she gets elected, we'll be under Sharia Law so fast your head will spin!","commenter_a":"Too funny - it just continues to be the funniest convention of all time - Hey, Christie a few months ago when you were running yourself - you decardedTrump unqualified to be President - too funny. All of these clowns: Christie; Gingrich; Pence and TRUMP are all an embarassment to the GOP party.","post_message":"Delegates at the Republican National Convention chant \"lock her up\" as Governor Chris Christie says \"I welcome the opportunity to hold Hillary Clinton accountable for her performance and her character.\" More: @webpagelink"}]
