[{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"10154095475454575","commenter_b":"Fry him.with low power so he feel the pain .","commenter_a":"Just fry him. No need for him to live another day","post_message":"The toddler and the 14-year-old have been diagnosed with HIV, genital herpes and chlamydia."},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":" Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."},{"comment_id":"1030788763705100","commenter_b":"Yup, start by getting rid of his useless ass.","commenter_a":"Asshole","post_message":"President Obama talks about the urgency of Climate change, saying \"We've proven that the choice between our environment, our economy, and our health is a false one. We've got to strengthen all of them together.\" What do you think?"},{"comment_id":"10153753103761037","commenter_b":"@username tell me that in 12 months... no Bernie, no Trump, no Clinton and no JEB... then who's left? Let's talk again when there's only days left of this nonsense.","commenter_a":"Jim Webb won this debate: he got more exposure out of the media tonight than he has had since he began his candidacy. Compared to Clinton he looks honorable, compared to Sanders he looks responsible. Since those two are the media darlings, those are the only two he needs to be compared to until he can get out of single digit polls. If any of those candidates expect to get moderate Independent and Republican voters next fall, they need Webb on the ticket… unless Trump manages to stay in the race.","post_message":"Bernie Sanders defends his record on guns after Hillary Clinton pounces. #DemDebate"},{"comment_id":"1148491358514249","commenter_b":"She would not make a good POTUS. She ran HP into the ground.","commenter_a":"I have thought the same thing about Carly Fiorina. I like her and believe technically she might make a good president. But she has a \"look\" about her, not about beauty or sexiness, but a look like she's been hurt badly sometime in her life and is going to have a nervous breakdown at any minute. Leadership also relies heavily on appearance and Ms. Fiorina's \"look\" just isn't motivational. It's almost all about appearance...when is the last time you've seen a multi-million dollar preacher that looks like he/she just lost their puppy? This country is going to need vitality to rebuild itself and she does not project that; FDR would not be photographed in his wheelchair and people still talk about Jimmy Carter's preacher look. We need and I haven't seen anyone that \"appears\" to resemble him, except maybe Sen. Marco Rubio, and only somewhat, a JFK.","post_message":"Trump was watching a newscast when a video clip zoomed in on rival Republican 2016 candidate Carly Fiorina. \"Look at that face! Would anyone vote for that?\"said Trump."}]
