[{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"10153854573245779","commenter_b":"Bullshit","commenter_a":"If were a boy... all feminazis here asking death penalty.... hypocrisy","post_message":"A 14-year-old girl sent suggestive pictures to a classmate and now she might have to register as a sex offender. Here's why this is absurd."},{"comment_id":"1055522267818446","commenter_b":"We're sick of Reruns. Turn the channel. Clintons are history. Make them go away.","commenter_a":"Close, but no cigar","post_message":"“Donald Trump has called your dad an abuser of women, and your mom his enabler. What do you think of his attacks on your parents?”"},{"comment_id":"1091574534232574","commenter_b":"Why this government is all B/S! Why this government is all B/S! It left over 180,000 tailor and mobile homes in Louisiana that the people never used and this sh**hole of a government could have added to that number and moved them all over the Midwestern farms for many of this countries people living off long term benefits! Just relocate mom and her 2-3-4 or more kids out there to work the farms! I think that this would be much healthier for the kids than being raised in many respects in slum cities and neighborhoods This bullshit about Americans are unwilling to work the farms, well, maybe if they are forced to, or all subsidy will end, maybe they with their children will learn a healthier way! And other women, who may consider this lifestyle, may think twice! The only reason that this government wants the border open is to ...","commenter_a":"Yes","post_message":"\"Cuban nationals should be treated under the same immigration rules as nationals of other countries.”"},{"comment_id":"10154310503686519","commenter_b":"I'm sure the travel site is a very bad site and many people are saying that the site is bad, disgusting and their reviews are a disaster. Trump won't subscribe to the site until they say he is great and then the site will be good. But it's very sad now. His hotel is the greatest hotel and anyone who doesn't think so is a looooser.","commenter_a":"Banktrump International Hotels, get over it!!","post_message":"You have to read their review of Trump's hotel for yourself."},{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"}]
