[{"comment_id":"10152958959170927","commenter_b":"she can give up citizenship which is just fine with me, at least in this country she can say this stupid remark, want to try to do so say in Hungry","commenter_a":"Leave","post_message":""},{"comment_id":"10153588117402235","commenter_b":"An abortion is cheaper than kids...just sayin","commenter_a":"Ummm...2 things here...this jail is ridic for withholding/failing to administer medicine for an inmate...but also, stop having kids if you can't afford them...now these kids will be a burden on the system and are at risk to perpetuate this same cycle...aren't condoms like $5 wtf","post_message":"He was arrested for unpaid child support.   Now he's dead."},{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"},{"comment_id":"1158715757578534","commenter_b":"Jail house for this chick!","commenter_a":"Sorry don't remember any championships","post_message":"It's just a matter of Hillary living the rest of her life out in prison or free.  Do you want to see Hillary go to JAIL?  @webpagelink"},{"comment_id":"1150774161677077","commenter_b":"She needs to be unseated","commenter_a":"Trump will get rid of the Democrats and Republicans that have been in the Senate and Congress way too long and Barbara Boxer is one to go for sure. All of a sudden because Hillary lost the election now the Electoral votes have to go, maybe if you picked a candidate that wasn't crooked and a continual liar you might have had a better chance. Enough of the liberal bulls--t accept the loss and move on.","post_message":"This comes after Hillary Clinton won the popular vote, but lost the election."},{"comment_id":"798927580297819","commenter_b":"What a mouth","commenter_a":"Run those @ssholes out of the country...!!! Freedom of speech does not include burning our flag...!!!","post_message":"Protestors Start Burning American Flags, Immediately Receive Instant Justice From Patriotic Bikers [VIDEO]   Click the link below to watch the full video    @webpagelink/  SHARE this if you support these patriotic bikers!"},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"}]
