[{"comment_id":"10154894095826509","commenter_b":"Good doctor. Dumb woman","commenter_a":"@username :)","post_message":"\"My prayer is when you see that next baby with Down syndrome lovingly tucked in her mother's womb, you will look at that mommy and see me, then tell her the truth...Your child is absolutely perfect.\""},{"comment_id":"10154142762821756","commenter_b":"Carol Andrews Wilfork ....\"Concerned about appearances?\" Good one! Hillary Clinton would never be allowed to be an angry, cantankerous revolutionary with wild hair like Bernie....she would not make it in American politics. Women have to play a completely different game...and look good doing it or they are toast!","commenter_a":"Perhaps true criticisms of Rubio, but along with Rand Paul find them to be the most rational and reasonable persons at the debates.","post_message":"Some say the first-term Florida senator is inexperienced. Some say he's inconsistent. And others question how his loss in Iowa is being spun into a quasi-victory."},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"},{"comment_id":"1841493012732673","commenter_b":"Another Asshole.... crawl back under the rock you came out from and take that Orange face dumb ass with you","commenter_a":"Really??","post_message":"Straight from the horse's mouth!"},{"comment_id":"10152921219620090","commenter_b":"@username , do not believe Florence , we everybody chosen by God. Not Jew , only, hahahaaaa","commenter_a":"Israel can take care of itself! We need to take care of USA and quit spending, spending, spending!","post_message":"We're proud to stand with Israel & stand against terrorism.  We're calling on Arab governments throughout the Middle East to help advance this goal. Join us, here: @webpagelink"},{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."},{"comment_id":"10152631358675779","commenter_b":"He's hip pop. And of course they do numbers most ppl think the radio is all there Is to offer. And I'd say 3 ouuta 4 drake fans r girls. Drake can go hard but he chooses not to cuz that don't sell albums to women...so instead he's like \"long as my bitches love me\" lol","commenter_a":"It's funny how people who don't like hip-hop or don't like Drake's music post derogatory comments .If you don't like it don't post it,I think music like Young Thug(or when Gucci Mane was hot) & HALF of what I hear on the radio is trash lyrically but perfect for a party,but I don't sound off on it b/c the numbers that these songs/mixtapes/albums do,speak for themselves regardless of what we as neigh-sayers,b/c it's not our cup of tea,may say about it.Although I am biased to Drake's music,I love music period so why don't we all just take a lil advice from a19 year old(myself) & actually be grown about what we post instead of being ignorant cause honestly,8 times out of 10,nothing we say is taken into major consideration by the famous.In the words of Kevin Durant,\"Why do you tweet?\" lol...dang","post_message":"Is it an album? Is it a mixtape? Who cares? The 17 tracks Drake released at midnight last Thursday hit harder and hold together more cohesively than most big-budget event albums. Click through for our full review of ‘Too Late.'"}]
