[{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""},{"comment_id":"511888302293280","commenter_b":"this man deserves the right to express himself he fought for our freedom and i thank him and all vets it was not a bullshit war no war is bullshit lives are lost and families are destroyed we need to get back on track in this country starting with respect for each other","commenter_a":"Just because you fought in one bullshit war doesn't mean you automatically get a platform to spout your opinion about crooked cops claiming BULLSHIT on disenfranchised citizens are starting another war! Those killed by cops are ALSO AMERICANS...just FYI.","post_message":"When  asked if he was concerned about his safety, he said, “I’ve seen more than all this. I’ve been through the riots already.”  -Linda"},{"comment_id":"10154985176733690","commenter_b":"He talk easily bcoz he live well but Philippine's nation will suffer .China will dominate Philippine.","commenter_a":"G","post_message":"Duterte said the Philippines could do without US aid, called Americans \"sons of bitches\" and \"hypocrites,\" and praised China for offering what he said was huge financial assistance."},{"comment_id":"10153475546708734","commenter_b":"So why is she crying rape now? It's not going to get her out of the ticket, is it?","commenter_a":"Sorry but she is not a victim! And the so-called officer is a POS!","post_message":"The female victim initially agreed to engage in a sex act in exchange for money. Then during that encounter, Tucker allegedly pointed a gun at her and forced her to engage in another sex act against her will."},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."}]
