[{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."},{"comment_id":"10153053821551051","commenter_b":"Nazi bitch. Do that in front of me. Evil","commenter_a":"Again school employees who think they have the answers this is awful and someone should take her food away from her","post_message":"A school official walked up to this little girl, picked up her lunch and threw it in the trash in front of everyone. The girl immediately began to cry."},{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"10153120807760671","commenter_b":"I think it a historical landmark and therefore cannot be torn down and if its not it should be. Even in its dilapidated stated it is still beautiful and the history that building has is a part of everyone who grew up on this area. #SAVETHEHOTELMARYSVILLE!!!","commenter_a":"Make it a church","post_message":"What should happen to this hotel?"},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"493375190853061","commenter_b":"Ban muslims from holding a job AND ban them from welfare benefits! Starve them out of our country!!!","commenter_a":"Now I know why CVS has become so powerful in the insurance business. Owned by Muslims, friends of Obama. So many large companies are now making their employees use only CVS to get their medications. CVS charges more for all their medications. So wrong.","post_message":"His Muslim boss tried to harass him for being Christian, be he wouldn't back down.  Amazing. Let's show him we have his back.  Do you support his stand against his Muslim supervisor?"},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"}]
