[{"comment_id":"10153359922053984","commenter_b":"No more Muslims in this country. Enough is enough. Send the Muslims and Obama packing.","commenter_a":"Trey I love you to the moon and back, you are our only hope!!!!!! Keep up the wonderful things you are doing.","post_message":"Classic Trey Gowdy. State Dept. wants to send Muslims to these U.S. states, but they'll have to get through him first.  Do you agree with Gowdy's demands?"},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"10152833385031749","commenter_b":" .","commenter_a":"You are right Brent!","post_message":"\"America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.\" —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"512162555660096","commenter_b":"@username, Kanye will never be President.","commenter_a":"Trump","post_message":"WATCH: Video of full Donald Trump campaign rally in Phoenix, Arizona."},{"comment_id":"10152589003412894","commenter_b":"That bitch got implants","commenter_a":"I agree with C completely. He has God given talent. She has what God and cosmetic surgery gave her. She has no talent. She did not invent big, voluptuous butts.","post_message":"Charlie Sheen Pops All the Way Off on 'Zero Talent' Kim Kardashian: 'Go F Yourself'"}]
