[{"comment_id":"653037578220154","commenter_b":"We always saluted the flag every day at school. And sais the Pledge of alligence. Also prayed.","commenter_a":"YOU CANT BE SERIOUS !!!! RULED AGAINST' THE AMERICAN FLAG ???? NO WAY IN HELL SHOULD THIS HAPPEN !!! NO WAY !!!! .","post_message":"The court has just ruled against the American flag.  This is un-American. We stand for the flag forever and always.  Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"614623428725949","commenter_b":"Should of shot the bitches in the fu$king faces, enough of this shit with these animals","commenter_a":"They are racist.","post_message":"Burqa-Clad Muslims Sue For “Racist” Treatment… Get a RUDE Wake Up Call"},{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."},{"comment_id":"682877985236113","commenter_b":"Carrie is a rich beeeatch!","commenter_a":"Liberals need to keep their views to themselves....Carrie, is a sweet mother and wife, and can teach her son what she wants to teach him, regardless what others might say: Because, He is HER child not the Liberal idiots, out there...!!!!!!","post_message":"Liberals are going after Carrie Underwood for her faith, she needs your support.  She is a true Christian. Let's get her back.  Can we get 85,000 'LIKES' for Carrie Underwood's faith?"},{"comment_id":"10155052267050695","commenter_b":"This world was based on religious freedom I'm showing mine...","commenter_a":"Good but killing him is no better than taking the life of any one else... God will be his final judge","post_message":"Nine church members were shot and killed at Emanuel AME in downtown Charleston in 2015."},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"},{"comment_id":"483277565194949","commenter_b":"Jesus wouldnt like that she kills babies for a living.","commenter_a":"So sorry you folks are tearing this young woman apart, would Jesus do this?","post_message":"What'd you think, folks?"}]
