[{"comment_id":"1717609118507402","commenter_b":"She can move her wretched ass OUT!","commenter_a":"Please","post_message":"Michelle Obama: Every single day, \"I wake up in a house that was built by slaves.\""},{"comment_id":"1237593022967110","commenter_b":"@username Because God made her a woman, SHE chose to be a sinner!","commenter_a":"Mormons are a religious cult not Christian in any shape or form. The only way that woman will ever change will be by the power of the Lord Jesus Christ and him alone.","post_message":"Beaten and made to carry bags of rocks for 18 hours a day"},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10153931593886336","commenter_b":"Let's add panderer to Hillary's resume after liar. Perfect qualifications to be the next President.","commenter_a":"She has mislead the Hispanic voters by lying to them. Just because they do not understand the law and the BS she has so taken advantage of them. Hillary for Prison in 2016.","post_message":"A campaign post aimed at winning over Latino voters has backfired and instead is drawing the ire of many social media users for purportedly playing up ethnic stereotypes."},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration.  See more: @webpagelink"},{"comment_id":"10153188126467293","commenter_b":"What is this, then? \"That multicolored background is not gonna save you.\"","commenter_a":"That qualification was executed with a double standard.","post_message":"For all those who doubt the women's accomplishments."},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."}]
