[{"comment_id":"10152805642283145","commenter_b":"Nope.","commenter_a":"@username te montas?","post_message":"The Orlando Eye attraction will be the tallest observation wheel on the east coast of the United States, and today the first passenger capsule was installed.   Will you ride the Orlando Eye? Check out photos of the progress >> @webpagelink #WFTVat5"},{"comment_id":"10150700585599999","commenter_b":"Trump is strong enough to protect the country from this invasion. Certainly no one on the Left is even thinking about it.","commenter_a":"Trump is a loud mouth, arrogant, self serving, person. He does not really care about the \"Regular\" folks, he is accustom to just \"Using\" them. I am a republican and can not stand him.","post_message":"Few people can address the circumstances more definitively than John Farmer Jr., who served as senior counsel to the 9/11 commission."},{"comment_id":"10153694817752293","commenter_b":"All they have to do is ask and I'd let a nurse snap all the dick pics she wanted.","commenter_a":"And her name is Johnson ....","post_message":"Police discovered a photo and video on the nurse’s laptop."},{"comment_id":"1601888236769214","commenter_b":"I personally like the idea of amnesty for those already here, then very strict implementation of immigration laws and immigration reform after that. Breaking up families is not a solution to this problem. These raids will just cause more pain and foster bad feelings. If they're here, let them stay, get them legalized so they help support the system they're using. Then lock it down and form a clear, sensible, reasonable, doable path to citizenship. we don't need a wall. We need penalties on companies that hire illegals, and serious reform on the \"war on drugs\" that incubates environments that force people to flee their homes. We have to stop blaming people who are looking for a better life, and start finding ways to help our neighbors reach the same level of community peace that we enjoy.","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence.  Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped.  Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."},{"comment_id":"10154370280236519","commenter_b":"Dear mikka, your existence proves that feminism is still very much needed in this day and age. As long as drooling troglodytes such as yourself still talk shit like this, there still is work to be done. Thanks for confirming.","commenter_a":"modern feminism is not related to feminism of the past..... modern feminism is pointless","post_message":"The plight of the bitter nerd."},{"comment_id":"10154855250569062","commenter_b":"please name a book that would represent all citizens lol come on now. Tennessee is like 81% christian so i think the book works fine @webpagelink/ it represents the people not the government, so there is your seperation :P","commenter_a":"Even when I was an atheist, the bible was a good read. Some of them just need to get their head out of their butt to look at things objectively.","post_message":"Good idea? Bad idea?"},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"}]
