[{"comment_id":"1795749220655470","commenter_b":"The point is assult rifles are banned already....","commenter_a":"Too bad what you carried in Iraq was a selective fire M4, not a semi-auto ArmaLite rifle, you can't teach common sense, but you can at least know the difference between an Assault rifle and a AR-15","post_message":"I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando"},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"10154225504351336","commenter_b":"Can't stand her","commenter_a":"Oh come on now, we all know she is in with Trump...She's a plant by Fox news and the Trump group to bring attention to him....It's the oldest trick in the book...but ya, I can't stand her either.","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"10153177262869205","commenter_b":"Christmas is actually a pagan holiday as is Halloween.","commenter_a":"Saying public schools shouldn't close for holidays includes Christmas people therefore if schools were to remain open on that holiday you'd end up bitching because your kids had to be in class on Christmas! Everyone should have the right to observe religious holidays due their beliefs even if its just a personal day off!","post_message":"Should Schools Close on Muslim Holidays?  h/t AJ+"},{"comment_id":"997724686914554","commenter_b":"Natenyahu, be a man and accept refugees to Israel!","commenter_a":"Hungry is right!","post_message":"A Syrian father laid to rest his wife and his two little boys in Kobani after they drowned as they tried to flee to Europe. This, as desperation and anger deepens among people escaping conflict and poverty. Read more: @webpagelink"},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."}]
