[{"comment_id":"1141758235909203","commenter_b":"Bucket of losers and needy Mexicans. She was right.","commenter_a":"Actually, The founding fathers were rich aristocrats who valued property rights at a premium, so much so that they limited the right to vote to land owners, who at the time were the billionaires of their day. It isn't right that billionaires can buy elections, but that probably would have been the intention of the founding fathers.","post_message":"When the Founding Fathers wrote the Constitution, I’m pretty sure they weren’t thinking “Let’s make sure billionaires can buy elections.”"},{"comment_id":"893070080803922","commenter_b":"I wouldn't vote for Killary,If she was last person on Earth! She A Liar and a Bad egg!!","commenter_a":"The movie idiocracy.....we are living it!","post_message":"Jesse Watters: \"What do you think Hillary Clinton's biggest accomplishment has been?\"  Answer: \"She has gone around to certain places – Brooklyn, she's been to Queens.\"  MORE: @webpagelink"},{"comment_id":"606361476221098","commenter_b":"WAKE UP AMERICA! The racists in our White House have no intentions of getting out. *Note* the race baiting going on now and the targeting of police departments. Obama is trying to start a race war so he can federalize law enforcement and declare Marshall Law so he can stay in office. Too many Americans are distracted by gay marriage and flags to pay attention to his real agenda. Look how he has the South stirred up... he knows that's his biggest problem, freedom loving, gun carrying Christens he knows will defend their rights! GOD HELP US ALL!","commenter_a":"Good grief! What do these people want! I have been picked on and had blacks make racist remarks to me all my life! I just keep on keepin on with the Lord! She only feels inferior because she wants to and as usual the whites get the blame!","post_message":"Controversial video just leaked that shows what Michelle thinks about white people.  This is extremely offensive. We need to spread this, and show the country she's a racist.  Do you agree Michelle Obama is the worst first lady ever?"},{"comment_id":"1038422129567160","commenter_b":"What a POS !","commenter_a":"Go home to Canada and take hiller with you.","post_message":"CRUZ F*CKS CONSERVATIVES, VOTERS and TRUMP  @webpagelink"},{"comment_id":"1155965127752480","commenter_b":"I made the same point on a post on face book and was told I was comparing apples to oranges. P","commenter_a":"Cecil the Lion was made up of \"clumps of cells\"...WTH. Clumps of cells are ALIVE! All those dunderheads seem to forget that THEY were clumps of cells at one time too!","post_message":"I am one of the people being pilloried, by the way, in elements of the Drive-By Media for daring to compare Planned Parenthood to Cecil the Lion.  People on the left who are overly concerned with Cecil the Lion say they are offended that they are being accused of caring more about animals than they are about \"clumps of cells.\""},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"10155818308010354","commenter_b":"Black thugs.","commenter_a":"Idiots!","post_message":"It wasn't enough for the mob of 50 teens to ransack the Walmart.  When they saw the disabled man in the motorized wheelchair, they wasted no time..."}]
