[{"comment_id":"10154655790571101","commenter_b":"We will see the illegals go!","commenter_a":"But he promised the morons a yuge wall and told them the Mexicans would pay for it.","post_message":"\"These are dreamers who are seeking the American Dream, and we should embrace them rather than do a bait-and-switch.\""},{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"},{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"1202757773119671","commenter_b":"Yes Ivanka Trump would not be anywhere without her rich daddy!","commenter_a":"If it was not for her family name no one would listen to a word this really stupid spoiled brat has to say. You actually have to do something or have accomplished something to be a voice worth listening to and this twit as done nothing. Additionally hanging around with a child molester like Dunham shows just how pathetic she is.","post_message":"Chelsea Clinton tried to shame Ivanka Trump on live TV, but it immediately blew up in her FACE! This proves that Hillary Clinton has NO CHANCE!   Let's get 3,000 SHARES to show that we don't need a Clinton anywhere near a position of power!"},{"comment_id":"10153447585542293","commenter_b":"No, it is true. That's why I've been buying men's razors for years. The women's version of the same razor is always more expensive.","commenter_a":"I don't think this is true. We have options now. I buy a lot of products at the dollar store and later find them in retail for $3-4.00. It's always about comparison shopping.","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10153202858353352","commenter_b":"Nigger Bitch??? Hahaha So Original","commenter_a":"Only because he was a black cop..... If he was a white cop that cracker would be locked up..","post_message":"Gun enthusiast who shot police chief four times during raid walks free because cops 'didn't have enough evidence to charge him'"},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"}]
