[{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"10153090646372411","commenter_b":"omg it's getting old","commenter_a":"Madisen AndCody LMFAO! I'm not surprised are you?!?","post_message":"BREAKING NEWS: Chicago Bulls Derrick Rose was injured in practice today after taking an elbow to the face.  He will undergo surgery tomorrow. \"After the procedure, a timetable for return to play will be determined,\" the team said."},{"comment_id":"10153098035411336","commenter_b":"No black race can prosper in caucasian society africa today has more midlle class than india our people in united states are in hell we africans has more future than them i hope one day they would come back to their motherland and leave the caucasians with their stolen land","commenter_a":"Time to clean up your act. Why do Asians, Europeans and other immigrants acclimate themselves into society but after 150 years blacks still expect others to take care of them. They are a society of takers and beggers. I'm sick of it. Why has Oprah, Conde Rice, Colin Powell and many others succeeded? ... they conformed to society, got an education and accepted responsibility for their own life and THEY WON.","post_message":"\"Nobody from ISIS ever terrorized us as a people as the police do us daily,\" Nebraska State Sen. Ernie Chambers said during a recent legislative hearing."},{"comment_id":"667942883338893","commenter_b":"No.","commenter_a":"Because whites haven't been a suppressed race for hundreds of years.....does stupid hurt? I figured I would ask the idiot that runs this page wth a grade school education.","post_message":"Hmmmm....."},{"comment_id":"10153806670970329","commenter_b":"No. I'd rather have this Screw spiders","commenter_a":"THIS IS WORSE THAN 100 SPIDERS","post_message":"Always look under your bed! (via BuzzFeed Trending)"},{"comment_id":"1274512465962929","commenter_b":"Look at the fucking rat you idiot!","commenter_a":"Ray this is the first one I don't know if I would 😂","post_message":"Would you? #WSHH"},{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"}]
