[{"comment_id":"10154512331514087","commenter_b":"I don't blame them! I wouldn't want to work with the Chump either. But is that more inexperienced, mindless sheep the Chump can put in their place?","commenter_a":"LOL, I wasn't fired, I quit","post_message":"BREAKING: All State Department senior management officials have abruptly resigned."},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."},{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"10152943088035950","commenter_b":"OMG, this woman is beyond ridiculous. WTF for real.","commenter_a":"@username. Then we have these morons !","post_message":"A special education teacher accused of holding an autistic boy upside-down and lowering him head-first into a trash says she was trying to \"shake out that trashy behavior.\""},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"10153005348800496","commenter_b":"So it's from not walking?","commenter_a":"Can someone explain to me how they grow like that? What about wild horses? Thanks.","post_message":"Disturbing: @webpagelink"}]
