[{"comment_id":"10154602840309877","commenter_b":"It's not going against the majority, it's supporting a fascist bigot. Only a fool wouldn't know the difference! Girl bye! Your post was asinine.","commenter_a":"Dang....wow. That was unnecessary. Smh So if you go against the majority then you get fired or blackmailed. Yeah, okay. That's totally okay, just sit down, shut up and get on the broad path like everyone else.","post_message":"It was all good just a week ago."},{"comment_id":"1230498736993040","commenter_b":"why was she doing in the motel with him for. bah bah bah any way what has all this got to do with running the country .alot of men have had women but Trump is rich and they are after his money so stop so he may have kissed someone well i sure they wanted him to women were after him when he was younger and maybe now to .come get a life..","commenter_a":"Interesting!!","post_message":"\"When I saw her on TV crying, I felt like she did a 360-degree turn here.\"  Full Interview: John Barry refutes the sexual misconduct accusations against Donald J. Trump made by his cousin and former 'Apprentice' contestant Summer Zervos."},{"comment_id":"1757450071143314","commenter_b":"Get your foot off the furniture! What an embarrassment she is!!!","commenter_a":"Chewbacca!!!! Lol","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153331816764087","commenter_b":"Time to make another donation to PP!","commenter_a":"and this is how our tax money is spent! Disgusting, we should defund all these Republicans, 1 month no pay for each time you waste our money on senseless, going nowhere bills. Aren't there bigger problems to solve?","post_message":"Senate Majority Leader Mitch McConnell on Tuesday dispelled speculation that Republicans might drop a provision defunding Planned Parenthood from an ObamaCare repeal package."},{"comment_id":"1603960996557680","commenter_b":"Deport her","commenter_a":"Racist pig!","post_message":"Ridiculous...  Take Oprah Winfrey off TV right now."},{"comment_id":"1099934806735302","commenter_b":"These are the ones that should be deported","commenter_a":"yes go for it1","post_message":"ISLAM GAME OVER: Dutch politicians call for mosques to shut down and ISLAM to be outlawed!   Do you agree? It's a death cult anyway..."},{"comment_id":"1790704097809032","commenter_b":"Pssst when's the last time the KKK has assassinated a cop in the streets? When's the last time the KKK burned down and looted their own towns? Who do you think BLM are voting for? Btw, do a Google search of who created the KKK. Democrats. Who freed the slaves? Republicans. Who passed a law allowing blacks to vote? Republicans. Who's the only candidate that voted against Civil rights? Hillary when she was a Goldwater.","commenter_a":"Yes. Except it is his supporters who are the real embarrassment. Buying into the lies of this conman. Feeling empowered, the violent white national (KKK) movement is showing itself in daylight. Embarrassment is not a powerful enough word.","post_message":"Yep.  Image by Occupy Democrats, LIKE our page for more!"}]
