[{"comment_id":"10152755752215950","commenter_b":"White kids who grow in the same exact environment would most likely participate in these activities, just like black kids who grow up in the same environment as snotty white kids will most likely also be snotty kids. We're all a reflection of our environments, we do as we see we do as we are taught!","commenter_a":"This is a social problem not a race issue..","post_message":"Police say a large group of high school students swarmed a gas station and beat a man who was reportedly helping an older woman to her car."},{"comment_id":"10153252921156833","commenter_b":"Good for the homeowner! Its time these THUGS learn that our homes ARE NOT THEIR PROPERTY AND THEY CAN'T ENTER WITHOUT OUR PERMISSION.","commenter_a":"Love this...","post_message":"An Albuquerque Police spokesperson says that a homeowner awoke to noise in his house and grabbed a firearm, thinking there was possibly an intruder. The homeowner checked the house and found a man, identified as 28-year-old Robert Bartley, crouching in his kitchen holding what the man said \"appeared to be knife.\" According to police, Bartley approached the homeowner saying he was going to kill him."},{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."},{"comment_id":"676190932571485","commenter_b":"She needs to be committed to a psychiatric ward for life","commenter_a":"OH Puke.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces.  This is absolutely ridiculous. She should be ashamed of herself.  Do you think Rosie O’Donnell needs to keep her nose out of politics?"},{"comment_id":"1086229651436699","commenter_b":"I bet the real problem some have is that Black females got into West point, never mind graduate from there.","commenter_a":"When you lower the entrance standards to one of the world's greatest Military Academy, this is what you get...","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"1791155854463672","commenter_b":"We ARE heading to this disaster because we still hold on to capitalism and free market","commenter_a":"Bobby Schar","post_message":"Thanks for that Brian ..."}]
