[{"comment_id":"10153938743204087","commenter_b":"Karma is a Bitch!!! #NEVERHILLARY #STILLSANDERS #JILLNOTSHILL. #DEMEXIT","commenter_a":"And Bernie wants us to support her boss Hillary.","post_message":"DNC chairwoman Debbie Wasserman Schultz referred to Bernie Sanders' campaign manager as \"scummy\" and a \"damn liar\" in a leaked email published on Friday by Wikileaks."},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are \"Cheat Days\" helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"10154941549643057","commenter_b":"@username You can't get back in the US because of a wall.","commenter_a":"Wow! He really showed him! The walls still gonna happen! No more cancerous illegals!","post_message":"#BREAKING: Mexican President Enrique Peña Nieto says he will not attend a planned Jan. 31 meeting with President Donald J. Trump, hours after Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"870530659649023","commenter_b":"This seems to imply, the next President has to be a woman...","commenter_a":"I completely agree with her that Hillary is not the woman for the WH. And I'm looking hard to find the one who will do all they can to put us back on track as a Nation, restore our economy, and undo the damages done to our International Affairs across the world. We need to sure up our relationships with our friends and work harder with the ones who threaten the peace and safety of this world to ensure they do not get nuclear capabilities and the ability to use them. We also need to clean up our Nation from illegals and close our Borders so that they are not so easy for illegals to cross them. We need some common sense leadership for this Nation instead of all the socialism and liberalism, lies and corruption that is tearing this Nation apart. Hillary Clinton has already proven she can not ...","post_message":"Want a female president?   Skip Hillary. Look at Carly Fiorina!"},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"1034762863247926","commenter_b":"She is a super predator","commenter_a":"@username is a strong leader, she is qualified, she is experienced, she is compassionate, has a lot of accomplishments, has been fighting for the equality and human rights her entire career, UNDERSTANDS foreign policy and the EFFECT and OUTCOME of her message domestically and abroad! #IAmWithHillary","post_message":"This country belongs to all of us, not just those at the top—not just the people who look one way, worship one way, or even think one way."}]
