[{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"10155422567365615","commenter_b":"Assholes","commenter_a":"I hope Greg Abbott gets HIV.","post_message":"They say a budget is a document that turns values into money."},{"comment_id":"1107032922700941","commenter_b":"Kyle Broussard","commenter_a":"That should be an Olympic sport!","post_message":"This guy has some skills.  (Via JukinVideo)"},{"comment_id":"10154352639558271","commenter_b":"That maybe so but I do agree with her ideas. Today's education is a joke and only benefits unions and their members. You might disagree but that's my story and I'm sticking to it.","commenter_a":"I think generals know more about the military than a civilian. I don't think you would want a dentist fixing your car. Wise up sir.","post_message":"There may be a theme to the way Donald Trump is selecting members of his cabinet.  Metro State professor Norman Provizer talks about the President-elect's choices with Anne Trujillo Denver7 today at 4pm on Politics Unplugged."},{"comment_id":"610480015827201","commenter_b":"I'm a New Yorker and I don't like this weather lol","commenter_a":"If you're a New Yorker you should be used to this weather","post_message":"A winter weather advisory is in effect tonight from 6pm to 6am. Meteorologist Jeff Smith talks forecasting and answers your questions."},{"comment_id":"10154666787286756","commenter_b":"But it's entirely not up to me how Islamic women choose to dress.","commenter_a":"It's crazy to me that the same people who are so feminist and or very liberal seem to not care at all about how Islam treats women. This is a great example of how they are extreme...even at the beach they have to be mostly covered.","post_message":"The Cannes mayor calls the burkini \"the symbol of Islamist extremism.\""},{"comment_id":"10153448119649753","commenter_b":"What a great idea, Helen! Let's all go out and buy guns and have daily shootouts in the malls of America! If I had a choice between keeping you here or one of the Muslims I know, I'd pick the Muslim.","commenter_a":"They were Muslim terriost keep your guns ready if you don't own one get one get a carry permit if you go to the mall take your gun we have to stop them obummer wants to protect them wants to let more in write your govnor insist we don't want them here","post_message":"ISIS has reportedly claimed responsibility for the San Bernardino, CA shooting that took place on Wednesday, December 2. For the past couple days, the Federal Bureau of Investigations has only speculated that the shooting – which claimed the lives of 14 victims and left 19 injured – was an act of terrorism, but have not confirmed. Now, the come forward with a chilling statement about the San Bernardino shooting and the Muslim newlyweds responsible for the massacre – Syed Farook, 28, and his... @webpagelink"}]
