[{"comment_id":"10153700840423812","commenter_b":"She just mad cause she can't have a slice lol","commenter_a":"Some one pls buy these ppl a cake.","post_message":"Couple married for 60 years eats a piece of their original wedding cake every anniversary. They store cake in a coffee can, and moisten it every year with brandy before eating another piece. @webpagelink"},{"comment_id":"968012613239597","commenter_b":"Wtf? This is annoying. She was extremely fat, tried out for a show, lost all kinds of weight and is now complaining. If it was horrible she should have left. Choices! I'm sure this wasn't the first time she felt humiliated. I mean come on... She was all about it when she was trying to win some money... She sucks","commenter_a":"Totally off topic but her mannerisms remind me of Ginny Goodwin as Gigi in He's Just Not That Into You","post_message":"The way she describes her experience competing in the show ... it's so messed up."},{"comment_id":"10154932317190690","commenter_b":"\"A bit of a bear\"??? What IS it with this woman and BEARS?","commenter_a":"I hope she takes care of that grizzly bear problem once and for all.","post_message":"Education Secretary Betsy DeVos: \"For me personally, this confirmation process and the drama it engendered has been a bit of a bear.\" Full video here: @webpagelink"},{"comment_id":"10153268798664170","commenter_b":"I'm sure asexuals all over are just shaking their heads and thinking the rest of the world is delusional in this quest for \"happiness\" which Hollywood and Madison Avenue thrive upon.","commenter_a":"Gay conversion therapy.... Sounds like a good way to convince gay youth to commit suicide. Let them be who they are. Perhaps we should have idiot religious zealot therapy","post_message":"I think families can make this decision for themselves, don't you?"},{"comment_id":"10156516063715206","commenter_b":"Trump is a pig and she stuck it to him with class.","commenter_a":"Watch yourself here on the video without sound even...you come off snobbish arrogant and grumpy and that is exactly what Trump meant by your face. You are well spoken, but you are not a happy person obviously. Not one smile! Mostly grimace. As to your subject matter-good for the blows to Hilliary and putting Christie in his place. But your arrogant head bobbing when talking about meeting foreign leaders etc. is just overboard. You better get on board with Trump, only the media and establishment hate him and are tryin their best to convince audience that he is hated. VOTERS want him!!! Voters love him!!!","post_message":"Putin won't listen to more talk. We need to show him there's strength, leadership, and courage on the other side. Pitch in $3 to rebuild America's role in the world.   @webpagelink"},{"comment_id":"377454052442889","commenter_b":"Let's BAN Muslims, this is our country and our freedom of religion!!!! They need to go back home where they belong to do this in their own country!!!!😡😡","commenter_a":"If the Muslims choose t o.live here, Don' t tell us what you want. This is America and a lot of us are Christians and we don't need or want immigrants telling us to change our beliefs. If you don't like our beliefs and our freedoms, maybe you should g o back to you country and try to get along. If you choose to stay here and enjoy our life and freedoms, then stop telling us to give up.our beliefs. I suggest you join a branch of service and share the responsibility of living here instead of holding your hands out for every thing you can get for free. It's time we stand up to you and what you want. I'm tired of it. God bless America!!!!","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"1190463677676992","commenter_b":"Immigration laws are not being in forest because it only applies to legals and not illegals. It's time to make stronger laws and strongly in force them. Also illegals shouldn't be given drivers licenses or any form of ID until they become American citizens.","commenter_a":"The way I see it is this, if people come here and they are illegals SEND THEM BACK TO WHERE EVER IT WAS THAT THEY CAME FROM, the next step is build a wall that's high enough with barbwire around it so they can't try anything","post_message":"Do you agree?"}]
