[{"comment_id":"10153629881103188","commenter_b":"So why aren't the women and children coming instead of all the able bodied young men who destroy things when they get to Europe?","commenter_a":"Wolves in sheep clothing!! Wake up Europe and do not be so naive!! Do not grant any of these people permanent citizenship. Send all able bodied back to Syria to fight for their country!!","post_message":"Millions of fleeing refugees are crashing into Europe like a tsunami."},{"comment_id":"10153703121996051","commenter_b":"If you are joking haha good one...if not well...Abusive bitch? Kids tested? Gwah lordy be. What a generation of pansies..","commenter_a":"There are ways to pin this abuse on this bitch. The father has to use some tactics to have the courts on his side. I would get the kids psychologically evaluated, have them testify in court in regards to the mother's abuse and a list of other stuff. I would make this bitch pay!","post_message":"A dad was looking through his son's iPad when he stumbled across this footage of the boy's mother."},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"10154633905401336","commenter_b":"LOL, Yahoo doesn't have that many accounts....is this a hoax for attention?","commenter_a":"Your World with Neil Cavuto----- You are talking to a brick wall today,","post_message":"Breaking News: Yahoo says at least 500 million accounts were hacked in 2014, and reportedly believes the culprit was a “state-sponsored actor.” @webpagelink"},{"comment_id":"10155049967862619","commenter_b":"Is that how they saying thank you to Israel for taking care of there refuges and is nobody can have Golan except Israel because were given to Chosen People God so Syria,Palestinian and all Muslim keep your hands away from Israel territories.Amen.","commenter_a":"BE STRONG GOD ALWAYS WITH YOU''","post_message":"Benjamin Netanyahu - בנימין נתניהו responds to Syria!  -VirtualJerusalem.com"},{"comment_id":"1089996267688050","commenter_b":"A woman who is drugged won't remember being raped. Guess that makes it ok?","commenter_a":"at least we don't remember it","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"989439721086384","commenter_b":"Thank you, Senator for being on the right side of this issue.","commenter_a":"How dim do the gun owners have to be, make guns so easy to use, and easy to get and they can't figure out why there are so many shooting? Clowns.","post_message":"Our hearts go out to the families of the victims and to the community of Lafayette. Once again the scourge of gun violence has claimed the lives of innocent Americans in a place where they have every right to feel safe. This chilling crime is yet another reminder that gun violence can strike anywhere, at any time.  When will Congress act to reduce gun violence?"}]
