[{"comment_id":"1495672320492892","commenter_b":"Leave her there","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"621940064660952","commenter_b":"everyone can do something....u are allowed to make a certain amount of money....pay enough and you can get any documentation from a doc. disable now a days has a broad spectrum.....defining disabled. ....I know Vets that have missing limbs and they have to prove every year that the limb is still missing and gas nit grown back","commenter_a":"these so called christian politicians could learn some thing about welfare and hand outs to people who don't want to work. 2 Thessalonians chapter 3 verse 10. (even when we were with you we commanded you this,if anyone will not work neither shall he eat. amen.","post_message":""},{"comment_id":"10156131502720500","commenter_b":"Joyce think how scary it will be to criminals","commenter_a":"It will be scarey to see people walking around with guns","post_message":"Floridians with concealed carry permits could soon be able to walk around with their guns on display. Would you support open carry? @webpagelink"},{"comment_id":"877374009072027","commenter_b":"What they should do is put them to work while they are on welfare and lowering government al expenses! A few hours here and there will save a bundle! Stop giving them a free handout and not allowing them to contribute to society! Eventually, get them a regular job and get them off welfare!","commenter_a":"Yes! To all of them!","post_message":"Do you support drug testing for welfare recipients?"},{"comment_id":"1000833690051404","commenter_b":"@username ugly bitch but you so obsessed with nigger videos","commenter_a":"I scrolled through the comments hardly any white folks made comments why? Let this had been a story about someone doing all this to dogs, cats or a damn hamster and there would be uproar they would have condemned this women to the hottest pits of hell.","post_message":"8 Gruesome Facts About Notorious Female Slavemaster Madame LaLaurie"},{"comment_id":"576578859168253","commenter_b":"STRONG.","commenter_a":"C U N T!","post_message":"Describe Hillary Clinton in one word."},{"comment_id":"10154925152646320","commenter_b":"Omg bottom left woman.. I hope after seeing her fkn face she would stop doing drugs !!","commenter_a":"Dam, they should've left Tiffany Dawn Evans alone. If that girl can make money from sex, cudos to her.. poor thang!","post_message":"Almost a dozen people in South Carolina were arrested on prostitution charges. Some of them were also charged with drug-related offenses...  @webpagelink"}]
