[{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10153317110562377","commenter_b":"Illegals work to build the wall with fair pay. They can stay. No brainer.","commenter_a":"They will pay.","post_message":""},{"comment_id":"10152893596581336","commenter_b":"Oh look, Obama making his own rules again...surprise","commenter_a":"Who's the party of NO now.","post_message":"\"Congress needs to show patience.\"  Moments ago, President Barack Obama said he will veto any legislation from Congress that added new sanctions against Iran. @webpagelink"},{"comment_id":"10153669770570950","commenter_b":"My thought exactly. If you see the pictures and videos, there are lounge chairs and tables just feet away from the water. People can read the \"no swimming\" sign, but an alligator is not going to think twice about coming on land. I think Disney needs to close off areas where there are gators. I lived in Tampa for four years, and gators were everywhere near water. You just knew where they were, and if you didn't, there were signs. I doubt people did not know about the alligators; you can always spot them especially if there are more than three. This could have been prevented.","commenter_a":"Why were alligators allowed to be so close to where human activity is? Especially DISNEY WORLD where 1000's of children are on a daily basis??","post_message":"Officials are pulling alligators from the nearby lagoon and putting them down to check for the boy's body; so far, they haven't found him."},{"comment_id":"10153480074973352","commenter_b":"She need the death penalty","commenter_a":"PROTECTED CUSTODY CAUSE YOUR ASS IS GRASSED BABY KILLER .","post_message":"Mother who drugged her two-year-old daughter and suffocated her because she was worried her ex's new girlfriends would take her place is jailed for 37 years"},{"comment_id":"10154108531615950","commenter_b":"Wrong. Abortion is a huge problem and IS murder. IF A PREGNANT WOMAN GETS MURDERED ITS DOUBLE. HOMICIDE..DOUBLE STANDARDS","commenter_a":"Why are people so fixated on someone's death? That is, ONLY if the tool used happened to be a firearm? Why not by other tools and means? #1. There is no gun death epidemic in America. In fact, many more people are killed each year by abortion, alcohol, tobacco, obesity, vehicles, prescription drugs, drownings, STDS... #2. Murder is not on the rise in America. In fact, violent crimes across the board are down some 50%, and have been falling for the last 20 plus years. This despite the fact that firearm ownership is quickly rising more each year. Studies even show where private firearm ownership is the highest, crime is the lowest. #3. Many of the same people who are supposedly against the deaths of a small percentage of people by firearms, are perfectly happy to murder their own sons and daughters by the millions each year. Talk about hypocrisy! ...","post_message":"Police locked down a South Florida mall after one person was killed and another was injured in a shooting."},{"comment_id":"10153498336211955","commenter_b":"Why would anyone go? Build the freaking wall.","commenter_a":"Are they trying to raise money for the wall?","post_message":"MEXICO ORDERS TOLL TO CROSS IN"}]
