[{"comment_id":"10153455356180779","commenter_b":"@username Yes, she is, without a doubt!","commenter_a":"Dude is garbage. Talented but garbage. LOL trying to spark a feud with Taylor swift, makes a song about gold diggers then marries one...","post_message":"Nearly two months after 'The Life of Pablo' debuted at Madison Square Garden – followed by a Tidal stream-only release, a declaration that the album would never be on Apple Music, then the eventual dispersion of 'The Life of Pablo' to Apple Music and other streaming services – Kanye West's latest LP has finally found its way to the top of the Billboard 200."},{"comment_id":"890357731026345","commenter_b":"Sorry, but this is America. You want to live here you can follow American law. If you want to live by YOUR ethnic rules, head back to where you came from. Way to go Texas!","commenter_a":"As if Texas was ever going to let them take over and see they did it so covertly their government never even realised what was going on...Wake up Australia it is no different here","post_message":"TEXAS: Bad News For The Islamic Tribunal In Texas, Muslims Furious   There only room for one governing law in the United states, we will have no side show from the Islamist who want Shari. If you want Shari then...  @webpagelink"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"642248339288322","commenter_b":"Len dersima denen aşağılık sülük seni her zaman ki gibi kışkırtma aynı şeyleri tekrar etme çabası Amına kodumun iti seni","commenter_a":"They are commemorating kurdish terrorists. It s a scandal!","post_message":"LIVE: Rally to commemorate Kurdish activists killed in Paris (Courtesy Ruptly)"},{"comment_id":"10152619091801636","commenter_b":"Read, stupid cow, before you open mouth: @webpagelink","commenter_a":"Smart people. Never vaccinate your baby!","post_message":"'The UK's anti-vaccination movement is alive and well, and we can't ignore it'"},{"comment_id":"1238686566209877","commenter_b":"Well said! Agree 100%","commenter_a":"The norm in our country any more. White on black, is racism. Black on white, poor black kids had no daddy & raised in a poor neighborhood! That half an half in the White House. He has no compassion for his \"white\" heritage, only the black side. Pathetic man!","post_message":"A white pizza delivery kid was out working hard, trying to make ends meet. Then he got a call to deliver a pizza to these two thugs.  What happened once he got there will turn your stomach.  This should outrage the entire nation, but the media, Al Sharpton, and Barack Obama don't want to say a word."},{"comment_id":"1708394149424069","commenter_b":"@username these people spoke in opposition to Trump's Muslim ban by indicating that Muslims are not all terrorists just like all Republicans are not all terrorists. By the way you know the US will never enforce a religious test for immigration NOR will be build a big beautiful wall....that Mexico will pay for :)","commenter_a":"What a wonderfully empathetic understanding and patriotic party the GOP followers now seem to be..to actually disparage this woman is one of the worst things ever...what in the hell is the matter with ALL of these inhuman people?","post_message":"The mother of a service member asked Mike Pence why he continues to stand by Donald J. Trump after his comments about the Khan family.   Many Trump supporters at the rally did not take kindly to her question.  Coverage: @webpagelink"}]
