[{"comment_id":"1777981479109906","commenter_b":"Karma will catch this hag","commenter_a":"Vote her out !!!!!","post_message":"This Florida prosecutor tried 77 kids as adults in a year  65 of them were black.  #MicBrights"},{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""},{"comment_id":"1720867398159945","commenter_b":"She's a basket case.","commenter_a":"@username he absolutely rekt her","post_message":"Sparks just flew at the Democratic debate. Bernie to Hillary Clinton: \"Excuse me, I'm talking.\"  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153696423508717","commenter_b":"And are spelled out for me in MY bible","commenter_a":"Hi! I'm an ignorant Facebook commenter. I disagree with/HATE anything that makes me uncomfortable and refuse to believe studies that are in contradiction of my beliefs. Only studies that agree with me are real. God bless!","post_message":"A new study in the Journal of Developmental and Behavioral Pediatrics finds that the kids really are alright."},{"comment_id":"10153385776126323","commenter_b":"\"Studied film and literature\"... Bahahaha bitch please...you are obviously no intellectual titan","commenter_a":"Though at least as far as the so-called \"New Atheists\" go Dawkins - along with Daniel Dennett - actually has substance to what he says and knows how to contextualise his arguments (some of the time). Christopher Hitchens sounded like an intellectual but acted like a thug. And Sam Harris is frankly one of the most pathetic and risible writers to garner an otherwise intelligent audience in this century so far. Ego the size of a planet - with a humourless sense of his own importance despite the impotence and unoriginality of his work - without even the charisma of Hitchens or the intellect of Dawkins/Dennett to back it up.","post_message":"“How dare you force your dopey unsubstantiated superstitions on innocent children too young to resist? How DARE you?”  Is Richard Dawkins a hero, a heathen, or a liability?"},{"comment_id":"842856589085016","commenter_b":"Jesus never existed. It's all in your head woman.","commenter_a":"The should stop being christian then","post_message":"\"...a most agonizing situation.\""},{"comment_id":"1396465177113199","commenter_b":"Stfu Hilary won POPULAR vote.","commenter_a":"Cry baby losers. You can't say he's not your president and it be true. If you live in the USA he is your president. Keep throwing tantrums and rioting, destroying property, setting cars on fire. You are just going to make more people vote for him next time.","post_message":"Fear not!  Shared by Occupy Democrats, LIKE our page for more!"}]
