[{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"},{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."},{"comment_id":"572796029562276","commenter_b":"If Bernie runs as an independent Hillary is ******","commenter_a":"So much investigations can't you win any states without ppl saying you cheated must suck getting caught.... #stillsanders #hillarigged #tonedownforwhat #whichhillary","post_message":"It isn't enough to just say we support equal pay for women. We have to do everything we can to make it a reality."},{"comment_id":"10153072204470329","commenter_b":"Girl I'm trying to kick it with u","commenter_a":"Leida Maria1020806391970270610210023845541574Alicia Jo","post_message":"We all have that one co-worker who is obsessed with Beyoncé...  via BuzzFeed BFF: @webpagelink"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to \"prop up\" immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"10154094538521955","commenter_b":"If anyone thinks it is going to be easy taking this country back from these marxists.....think again!","commenter_a":"Police, once again are ordered to let Thugs throw rocks at them. These protests are like Disneyland for the Criminal element.","post_message":"UPDATE: RIOT AT TRUMP NM RALLY..."},{"comment_id":"10153854379994486","commenter_b":"Criminal Hillary, silly Bernie out, Biden in without costing him a cent","commenter_a":"Good!","post_message":"If they're not panicking yet..."}]
