[{"comment_id":"10154068476123717","commenter_b":"The tea party and Republican Party are two separate entities","commenter_a":"That's because Hillary best represents the ideals of Reagan-era Republican Party. Trump represents the modern-day teabagger nutjob Republican Party. All the corruption and lies of the former with half the brain cells.","post_message":"It may surprise you, but George Bush Sr. knows who he is voting for come November, according to a Kennedy: @webpagelink"},{"comment_id":"10153551674003984","commenter_b":"Latino's vote democrat most of the time anyway. Illegals shouldn't be voting. Lets crack down on cheating. voter ID.","commenter_a":"So now conservatives have to worry about the huge amount of Latinos who will vote Democrat in the 2016 elections, just because Trump voiced the truth about those coming here illegally. We have over a year to go before a candidate is chosen, giving the criminals who came over the border illegally plenty of time to change the minds of Americans.","post_message":"These days, Donald Trump seems to be at the center of every controversy.  He might just be in the midst of another one after this actress just thanked him for his stance on immigration...  Do you agree with Donald Trump's views on immigration?"},{"comment_id":"10153607644803984","commenter_b":"Vote all those dirt bag's out we need people with balls not vagina2","commenter_a":"Now how does everyone feel about this 'War Hero'?","post_message":"BREAKING: John McCain's secret move against arming our troops here at home just got exposed, and what he did is absolutely sickening.  McCain hoped this would never come out, but we're not going to let him get away with this.  If you want to hold McCain accountable for his deplorable actions that endangered our innocent troops, be sure to share this article."},{"comment_id":"10155184641741509","commenter_b":"They wanted that sweet Brazilian booty","commenter_a":"I really think these dudes were out looking for mad hookers and they got robbed because of it LMFAO!!!!","post_message":"JUST IN: US swimmers Jack Conger and Gunnar Bentz were removed from their flight from Rio de Janeiro to the United States by Brazilian authorities, US Olympic Committee spokesman Patrick Sandusky told CNN Sports contributor Christine Brennan. Earlier this week, the two swimmers were with teammates Ryan Lochte and James Feigen, who are wanted for questioning by Brazilian police after questions were raised over their accounts of being robbed."},{"comment_id":"888341521222544","commenter_b":"She sounds worse than the other guy Holder.","commenter_a":"Another dumbass handpicked","post_message":"Add your name HERE: @webpagelink"},{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."},{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."}]
