[{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"10153357415706782","commenter_b":"They should all be illegal They cause cancer.","commenter_a":"Waste of time and money","post_message":"Lawmakers passed a tanning bed bill through a committee Monday. The bill would make it against the law for anyone under 18 to use a tanning bed.  What do you think of the bill?"},{"comment_id":"1410810932269586","commenter_b":"What a wanker.","commenter_a":"Demented old cray cray white man, losing touch with his cash cow. He's milking that cow because it's dying and he knows it. Will need to start a new job with no talent!","post_message":""},{"comment_id":"1099934806735302","commenter_b":"These are the ones that should be deported","commenter_a":"yes go for it1","post_message":"ISLAM GAME OVER: Dutch politicians call for mosques to shut down and ISLAM to be outlawed!   Do you agree? It's a death cult anyway..."},{"comment_id":"585038108344735","commenter_b":"@username We've heard all the BULLSHIT IDIOT.","commenter_a":"This man and his comrade, Tad Devine, are two of the most dishonest, hateful individuals ever involved in a major campaign. Bernie's toast and he knows it. Hillary is going to put them away for good by June 7th!","post_message":"Still. Attacking. Hillary."},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"}]
