[{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"1040060042672919","commenter_b":"This is BS, she just knocks the baby down with her & don't care. Stupid lil witch!!!!!!!","commenter_a":"OMG!!! ANIMALS!","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"1756436014601478","commenter_b":"Bye BITCH","commenter_a":"Makes me want to vote Trump","post_message":"The Fate of the Republic Hangs in the Balance..."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"444470795746949","commenter_b":"It's all about him he really doesn't care about us what a dick","commenter_a":"He has zero fuks to give.","post_message":"As 43 Americans are killed by tornadoes during the Christmas holiday, Obama golfs (again)..."},{"comment_id":"10154433105394087","commenter_b":"I'm an independent, but republicans are completely full of shit. And they don't mind the smell. Their platform is based on racial deportation.","commenter_a":"100% TRUTH","post_message":"\"Unless more leaders in the black church recognize that blindly supporting one party, which has done nothing to earn that support, is not benefiting those that they serve, the church will continue to lose its political influence.\""},{"comment_id":"1022105807844423","commenter_b":"@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"}]
