[{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10154271222713984","commenter_b":"She is a liar and manipulator ..","commenter_a":"A vibrator up her cooze? Call out the nuke-sniffing pig from South Park.","post_message":"Hillary Clinton was about to give a speech when suddenly the reporters heard a very strange noise... they knew immediately that Hillary was hiding something.  We know Hillary can't be trusted and this proves it... everyone needs to know what Hillary just did."},{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"551724101692742","commenter_b":"He is the Only Hope we have,,,,,,,,can't keep Letting Career politicians Destroy Our Country!","commenter_a":"Yes I do!!!","post_message":"More than half of Trump supporters say he won't be able to fix America.   Do you think Trump will be able to 'Make America Great Again'?"},{"comment_id":"10153295318271130","commenter_b":"Then those girls who don't know how to do that stuff better learn. Especially the condoms. That's both partners responsibility.","commenter_a":"And I am sure girls do not know how to buy their guys condoms, strap-ons and penis rings. So what???","post_message":"They didn't have a chance."},{"comment_id":"10154070103774916","commenter_b":"Shillary can't beat Dumper because she can't hold on to the Bernie followers who will leave the DemoRatic Party as soon as she gets the nomination. We aren't Democrats and we won't vote for her. #MassExodusOfTheDNC","commenter_a":"Hillary Clinton and Demographics and the American people will CRUSH Racist Republican Lying Cowards Donald Trump or Cruz.Who are vile bigoted ignorant chicken hawks warmongers un-American racist hateful assholes. HILLARY 2016.","post_message":""},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."}]
