[{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"10154150197679714","commenter_b":"It'll crack her make-up!","commenter_a":"Maybe they want to see you smile because they want to see you happy. Happy is a beautiful thing. It's not show me your boobs and make ME smile.","post_message":"So how should Hillary Clinton — or anyone — respond the next time it happens?"},{"comment_id":"10153445603501051","commenter_b":"If I was the Dad I would be the one in jail...I would had killed that bitch over and over again","commenter_a":"Sorry if I was dad he wouldn't be in Jail he would be in the ground dead!","post_message":"When the boy's 11-year-old sister saw what was happening, she threw herself at the attacker and screamed for her father. But at that point it was too late."},{"comment_id":"1377243338962685","commenter_b":"@username Typical liberal retards dodging the question. This isn't a matter of immigration, it's a matter of letting in the right immigrants.","commenter_a":"Good welcome to all terrorist to Canada ..According to Qubiec attack police arrested two and says......The two suspects are Alexandre Bissonnette and Mohamed Khadir Two students including one of 'Moroccan origin' have been arrested for the slaughter of six people at a Quebec mosque ...Mr. PM you are really trying to kill innocent people ...Idiot. .","post_message":"Six people were killed and eight wounded when gunmen opened fire at a Quebec City mosque during Sunday night prayers, in what Canadian Prime Minister Justin Trudeau called a \"terrorist attack on Muslims\"."},{"comment_id":"1208055202644589","commenter_b":"F*** GLOBALISM","commenter_a":"This country is in bad shape","post_message":"And the brainwashing starts. Included in the curriculum will be globalism too. Yaaaayyy... @webpagelink"},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"}]
