[{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"10153854573245779","commenter_b":"Bullshit","commenter_a":"If were a boy... all feminazis here asking death penalty.... hypocrisy","post_message":"A 14-year-old girl sent suggestive pictures to a classmate and now she might have to register as a sex offender. Here's why this is absurd."},{"comment_id":"1126715847370658","commenter_b":"A very excellent metaphor. Kinda bugged that I didn't come up with it myself!","commenter_a":"Ok, lets operate in the realm of hypothetical for a moment. Assume, if you will, the following: 1) There is a civilization capable of inter-solar system travel. 2) They would be bothered enough to interact with a species that cannot manage such travel. 3) We could hope to withstand attack if a species fulfilling [1] and [2] decides that we aren't worth keeping around. It seems to me that such a civilization, if it exists and meets those conditions, would be able to discern the effect of the gravitational field produced by our humble planet. To make it invisible in a visually perceptive sense is naive and utterly useless in the face of such circumstance.","post_message":"Should we be hiding?"},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"10154823170036162","commenter_b":"That is what I called the good work","commenter_a":"@username dammm","post_message":"WOW: Have you seen this? Loyal Cubs fans in Nebraska knocked it out of the park with their Halloween decorations this year, honoring the team! Their decorations include a \"Go, Cubs, Go\" light show!!!  Thanks to Sabrina and Paul Faire for sharing their video with #abc7chicago."}]
