[{"comment_id":"10155207761586509","commenter_b":"We don't do that to white people Bill....","commenter_a":"Just imagine if it was the other way around. They would have been met by heavily armed border guards pointing automatic weapons at them. They would have been put in handcuffs and leg irons and paraded before a judge and then be jailed for a ridiculous amount of time.","post_message":"Oops. 1,500 Americans accidentally floated over to Canada. @webpagelink"},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"10153183398771234","commenter_b":"Poor deluded woman.","commenter_a":"Donald Trump you have my vote","post_message":"Has Donald Trump always been, well, Donald Trump? According to his one-time roommate, the answer is..."},{"comment_id":"10157109427360354","commenter_b":"but.. its ok if your a doctor and have permission?","commenter_a":"She looks evil!","post_message":"A woman from Boulder, Colorado, was sentenced to 100 years in prison for attempted murder and unlawful termination of a pregnancy after attacking a stranger and cutting her baby out of her womb."},{"comment_id":"1263484480357673","commenter_b":"He emptied out gitmo... FOR himself and KILLARY.... Good IDEA!!!!! NOW JUST go.... YOU horrible DISGUSTING TRAITOR!!!! Plant.... Unlock the docs.... Barry is a CRIMINAL!!!!!","commenter_a":"Their plan is working. Next up, single payer govt. system.","post_message":"IMPLOSION.  Carriers dropping out.  Rates skyrocketing.  UPDATE:  @webpagelink"},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"10154738183646336","commenter_b":"But who's the hideous woman in the video?","commenter_a":"Well... he's certainly on the right show","post_message":"\"I understand why you're angry. You have every right to be angry – the system has failed you. But he is not the solution.\"  Filmmaker Michael Moore has a message for Donald J. Trump supporters who feel let down by the government. @webpagelink"}]
