[{"comment_id":"1243167749095092","commenter_b":"When i said this far. I'm talking about she's the presidential candidate. Her ass should be in jail by now.","commenter_a":"WAIT!! Who is to say she has gotten \"This Far!\" The News Media!?? Her rallies attract less than 400 people on the average. I believe. I know democrats who are voting for trump that have told me They don't even like him but Hillary will destroy this country! Everything we see and hear is from the \"NEWS MEDIA!\" Listen America, I saw and heard an interview with George Soros overseas last week. He said Donald Trump will win the popular votes of the American people by a \"Landslide!\" BUT!..We have found the Achilles heel of Western Civilization. The electoral votes. Hillary will win by the way the electoral votes have been put in place....America this is scary. The election is rigged way more than the news media is letting us know. I'm sure Donald Trump knows this too. Personally I am praying and asking God to intervene in this election ...","post_message":"Arkansas's attorney general just issued a jarring statement about Hillary Clinton, the state's least favorite daughter.  What the AG says needs to be seen by every American."},{"comment_id":"10152987685511051","commenter_b":"She is a whore. Why give her a pretty name. The whore was not forced to spread her legs to two guys in the same month? That makes her a big whore.","commenter_a":"The fathers of these twins are no better! I like how everyone always seems to too put blame on the women for her having sex with multiple men but it's take 2 to tango! Men are just as dirty.. It a 2 way street!","post_message":"The judge just made it official: these twin girls have one mom and two different dads."},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"979192058784862","commenter_b":"LOL! You are So Silly. That Will Be The Last Win For Cruz in The Primary elections now. There is NO way Cruz can Get Anywhere Near The Delegates Trump Has and after the Next 5 elections all in the Northeast Where Trump Will Win In a Landslide, Cruz is Now Done!!! BYE BYE LYIN TED!","commenter_a":"thanks Gov. @username for endorsing Ted Cruz! I always respected you and prayed for you when all those protesting liberals gave you a hard time. and I don't even live in Wisconsin. we are 741915279236631s and we do need to pray for each other. 2 chronicles 7:14.. prayer does help!. Congrats to Ted Cruz for a great win. thank you Lord!","post_message":"Thanks Wisconsin for showing that common sense conservative leadership is valued! #TedCruz"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."},{"comment_id":"997942853639367","commenter_b":"Shut up ! this is ridiculous ! I refuse to allow illegal immigrants to pour into this country.","commenter_a":"Yes","post_message":"Seattle Mayor Murray, officials and advocates are holding a press conference in response to President Trump's executive orders on immigration.  Do you think Seattle should remain a sanctuary city?"},{"comment_id":"10153154499205047","commenter_b":"I agree, so strap on your guns and make sure we have at least 30 per mile waiting 24 hours a day, around 50,000 a day, and see how long we can do it until Trump gets the 7 billion dollar wall built, and then starve everyone, because we won't have anyone to work on our farms.","commenter_a":"It is obvious they are crossing our border and Washington is doing absolutely nothing to stop it. It is also obvious that there will be another attack here in America and Washington is doing nothing to stop it. Their solution is to take our guns away from us so we have no means of protection what so ever. America wake up! We must get rid of Obama before he gets us all killed, it is just that simple!!!","post_message":"We know ISIS wants to infiltrate our homeland, yet our borders remain unsecured.  It's time to take action.  It's time to guard our borders.    Sign our petition if you agree: @webpagelink"}]
