[{"comment_id":"10154650449348987","commenter_b":"What are the plans for Jax airport?","commenter_a":"Protect outside animals from water, rising, falling etc...","post_message":"Mike has the latest track change for Hurricane Matthew. Tune in and ask questions!"},{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."},{"comment_id":"10153891528986162","commenter_b":"@username John Koester isn't this by you ?","commenter_a":"Abner Calzada","post_message":"WATCH LIVE: Reports of fatalities in active shooter situation in San Bernardino, sources say --> @webpagelink"},{"comment_id":"10154014226755329","commenter_b":"Wants it now","commenter_a":"Luis Lkns","post_message":"This is fact."},{"comment_id":"10154203076004087","commenter_b":"Of course Axelrod.... in the mean time we have to keep a corrupted woman out of the WH by massively voting for another candidate... Just get back in the swamp and be happy Axelrod Traitor !","commenter_a":"It has been revealed that part of the Clinton strategy is to incessantly blare from any and all platforms that it's game over, Hillary already won, Trump can't win, etc. Of course the reality is that Hillary can't fill high school gyms with supporters while Trump fills arenas. So, only a few more days till we know if votes still count or if we live in a rigged system controlled by some shadow government and foreign interests.","post_message":"\"I don't know any consultant on either side, any strategist, who privately believes that Donald Trump is going to win this election,\" Obama campaign strategist David Axelrod said."},{"comment_id":"603875656469680","commenter_b":"Get rid of her.","commenter_a":"Down with Miley and her shit. I remember when I was young and knew everything. If we all boycott her maybe she will have time to reflect on what she said in the past.","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10154692738382235","commenter_b":"Continue to do what she's done for 20 years, try and destroy the Clintons. Keith Olbermann lays that out bare @webpagelink","commenter_a":"It will be interesting to see what Kellyanne Conway will be doing once Donald is finally embarrassed by getting wiped out in the election, and not only dumps her but blames her for his loss.","post_message":"Kellyanne Conway got A LOT more than she bargained for ..."}]
