[{"comment_id":"10153908258427235","commenter_b":"Clowns with Guns!","commenter_a":"Listen up numbnuts, the oath to protect the constitution against all enemies foreign and domestic means that YOU are the enemy and should be eliminated. YOU are the one threatening the government, YOU are the one who hates America. YOU are a moron and a #faketriot.","post_message":"These guys are treasonous."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"544801219019682","commenter_b":"No questions from me Dr Carson.I just thank God for you, and know your here because God has plan for you. Dr Ben to win.","commenter_a":"Why do you think intensifying the war on drugs is a good thing?","post_message":"Each night I try to take some time to answer a few questions. You can send your questions to me by texting them to ASKBEN (@username) or you can email them to me at AskBen@BenCarson.com.  Before I get started tonight, I want to remind everyone that I will be on both Meet the Press (NBC) and Fox News Sunday this Sunday morning.  Also, Discovery Life will re-air a special about my medical career on Sunday evening.  Check local listings to find the times in your area.  The first question is about the Benghazi Hearings.  I didn’t get to watch to whole hearing but I have read the press accounts of them.  It is extremely clear that Secretary Clinton knew the attack was a terror attack and not a riot based on a film.  Yet, she and the Administration continued to purposely misrepresent the nature of the attack publicly for days.  Missing emails from that crucial time would no doubt provide better clues for who knew what, when.  Of course, that email has been deleted.  I have thought about this some and I think I know now what Hillary was destroying by erasing that server – her credibility.  It is another sad story in a long line of politicians who failed us.    The next question is about Medicare.  Annette from Ohio wants to know if I really want to abolish Medicare as was reported in a Washington politician tabloid.  The answer is of course NO.  I am interested in how we can both save money and deliver better service to our nation’s seniors.  You will no doubt hear of this kind of reporting which is meant to scare people from making any changes to the Washington power base.  I practiced medicine for 39 years.  Throughout those years, I often was disgusted with insurance companies.  Our current system is spinning out of control.  More and more state exchanges are going out of business.  Premiums continue to spiral out of control for those that can’t afford coverage.  Now reports begin to surface that millions of seniors will face massive premium increases.  We need a system where consumers are empowered and protected.  We need a system where you and your doctor decide what is best for you.  We need a system where each of us can monitor costs and levels of service.  I will soon offer such plan.  Until then, please take these press attacks for what they are…the last gasps of the Washington power class.  Finally tonight, I want to end on what many people sent me regarding the two new polls in Iowa today.  Three polls in two days all with the same results.  Each has me significantly ahead by 8 or nine points in Iowa. While of course I am delighted with the results and all of our hard work, now is the time to work even harder.  I am in Iowa tonight and all day tomorrow.  We will continue to fight to deliver our We the People message not just in Iowa but in every state across the country.  Thank you for standing with me.    Goodnight!   Ben"},{"comment_id":"976154972433526","commenter_b":"thats cause they want illegals to vote","commenter_a":"Buying votes","post_message":"Really?!"},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"1217472704997930","commenter_b":"WE MUST STOP CORRUPT CROOKED LYING KILLARY...If she gets into OUR White House she will appoint the nest Supreme Court Judge...GOD Forbid it be the MUSLIM POS OVOMIT. This will affect US, OUR CHILDREN and OUR GRAND CHILDREN for years to come. She will do her best to cost us OUR SECOND AMENDMENT RIGHTS, While keeping the Secret Service ARMED to protect HER SORRY ASS !!!! She will FLOOD OUR COUNTRY WITH SYRIANS, TERRORISTS, and ILLEGALS.... OUR Borders will NEVER BE CLOSED. AND all of this we will be FORCED TO PAY for with her PROMISED RISE IN TAXES on the MIDDLE CLASS. if that DOESN'T KILL US, we can always be BOMBED, BEHEADED, RAPED or MURDERED by ISIS....GET A CLUE, OPEN YOUR EYES, SEE HILLARY'S AMERICA , BUT THINK TWICE BEFORE YOU VOTE FOR THIS TRAITOROUS B*TCH !!!!!!....TRUMP 2016 !!!!!","commenter_a":"TOO many martinis & pills.","post_message":"Democrats are in full-on panic mode after reporters scooped a picture of Hillary Clinton literally UNABLE to stand. This is going to intensify speculation about her health BIG TIME.  Do you think that Hillary Clinton is fit to serve?"},{"comment_id":"10156147874195725","commenter_b":"YES AND TAKE GLENN BECK WITH HER.......","commenter_a":"Agreed.","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."}]
