[{"comment_id":"1077069452383729","commenter_b":"@username she better be overreacting","commenter_a":"Yo this made me think if that shyt gonna hurt @username","post_message":"She's not ready for a tattoo"},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"10153513356977061","commenter_b":"Oh god please... What a fake","commenter_a":"Worst First Lady and president ever ....E V E R ...","post_message":"WATCH: Pres. Barack Obama and First Lady Michelle Obama do the Whip/Nae Nae at The White House Easter Egg Roll. abcn.ws/1VPZxxV"},{"comment_id":"1062574083799120","commenter_b":"Yay! Maybe your daughters can grow up to be war criminals! #progress","commenter_a":"I am joyfully and unabashedly with you Hillary! My two little girls are so excited. It means the world to watch them see the new possibilities in the US with you!","post_message":"The New York Times: Hillary offers \"a vision in which middle-class Americans have a real shot at prosperity, women’s rights are enhanced, undocumented immigrants are given a chance at legitimacy, international alliances are nurtured and the country is kept safe.\""},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"10153733539132169","commenter_b":"\"thank you for your service\"","commenter_a":"Jasmine Taylor","post_message":"Join The National Memorial Day Concert (PBS) this Sunday at 8/7c for an evening of remembrance, featuring General Colin L. Powell, Renée Fleming, The Beach Boys, Katharine McPhee, Trace Adkins, S. Epatha Merkerson, Esai Morales, Alfie Boe, Trent Harmon Music, Maestro Jack Everly and co-hosted for the eleventh year by Joe Mantegna and Gary Sinise. Join the conversation at #MemDayPBS"},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"}]
