[{"comment_id":"10153541850619712","commenter_b":"It's Bush's fault, and you're a Racist. Let's audit the EBT accounts of people to ensure that they are not out selling 2 for 1 groceries, to get their Malt Liquor and Newport's. There is no Free Ride, you Generational Welfare Leeches. Some people shouldn't Breed!","commenter_a":"that what they do","post_message":"Despite calls for his ouster after making controversial comments about lead poisoning, Gov. Larry Hogan's housing secretary will keep his job."},{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"},{"comment_id":"1705584226349949","commenter_b":"IF HITLER TRUMP GETS IN WE THE LITTLE PEOPLE CAN KISS OUR ASSSSSSSETS GOOD BY CAUSE HE WILL BE FOR THE RICH AND MAILNLY HIMSELF WAKE UP AMERICA BEFORE WE HAVE ANOTHER MAD MAN IN CHARGE","commenter_a":"What an Idiot..mathsssssssss you cant","post_message":""},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1024079497651798","commenter_b":"She's not a model , clearly, unless she is modelling Down Syndrome !","commenter_a":"Yes it's great and all but why does she constantly be labelled as the Down syndrome model, just call her a model.","post_message":"'People with Down syndrome can do anything' (via Daily Mail Australia)"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."}]
