[{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152542079335927","commenter_b":"What state elected this Muslim trash","commenter_a":"Minnesota has a Muslim problem. There has been over 40 of its citizens gone over to the Middle East to fight for ISIS. The liberal democrats will welcome these terrorists make to the United States with open arms.","post_message":"It's a tricky situation preventing money from getting into the hands of terrorists."},{"comment_id":"371470169707944","commenter_b":"This is to Hanoi Jane. Run your bathtub to lukewarm. Get into tub. Have a nice glass of red wine. Take a razor and slit both of your wrists. Go to sleep. The world will be a better place without you.","commenter_a":"She owes the Vets she causd additional harm to in Vietnam. She needs to apologize profusely to all veterans for the rest of her life.","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"1611989915762064","commenter_b":"Women are objects to Trump- not people. Unfortunately, that's nothing new and despite all the changes in the way our society views and treats women today, they are still objectified. Some women today even objectify themselves- Beyonce, the Kardashians, many others who make themselves sex objects in order to \"succeed\". As a female, you can't be an actress, a musical artist, a broadcaster on CNN or any other job in the public eye unless you're young and attractive. So if you're shocked or offended at Trump's words, you've been living under a rock. There are tens of thousands of men who think and talk like him and they're your fathers, brothers, husbands, co-workers, bosses, judges, CEOs, doctors, lawyers, cops and US Presidents. It's nothing new and it will never change.","commenter_a":"Sad for her. He is such a shameful person.","post_message":"JUST IN: Melania Trump issues statement following release of husband Donald J. Trump's 2005 sexually-charged remarks: \"The words my husband used are unacceptable and offensive to me. This does not represent the man that I know.\" abcn.ws/2dmz2yg"},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"10153752724022016","commenter_b":"In her ear? Why the hell would she listen after she is elected, considering she's not even listening now, when she needs our vote? I doubt she'll hear a damn thing, once she swears that oath. The revolution isn't dead, but its not gonna happen through or in the DNC.","commenter_a":"SOCIALLY THERE IS NO OTHER CHOICE, ITS HILLARY WITH SANDERS AND WARREN IN HER EAR! THE REVOLUTION IS NOT DEAD! -?","post_message":"\"Emphasizing the negatives of Donald Trump, while certainly easy to do, will not be enough to get millennials to support Hillary Clinton. The Clinton campaign needs to unapologetically embrace issues that will inspire this critical millennial voting bloc to come her support.\"  Otherwise...."},{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"}]
