[{"comment_id":"1172312176140350","commenter_b":"BUILD THAT WALL!!!! BUILD THAT WALL!!!!","commenter_a":"Lol","post_message":"EXACTLY!"},{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"},{"comment_id":"650058555184723","commenter_b":"If they prove he's here under false terms. He an illegal. Hell yes deport him. Send him 2 where he could B put in jail. What a smear on the face of America.","commenter_a":"Would be great if this were true & a Blessing to the USA.","post_message":"Obama to be removed this country after justice department lawyer does this.  Get rid of him. He doesn't deserve to stay in this country.  Do you agree Obama should be deported?"},{"comment_id":"1532770816783042","commenter_b":"You are a gross old creeper anyways. Have fun jerking off the rest of your life.","commenter_a":"Fuck black Lives matter!","post_message":"Black Lives Matter is a racist hate group! Share if you agree!!"},{"comment_id":"10153331066431162","commenter_b":"Who cares!? It's not like he did it himself and besides back in the day that's what people did. It wasn't right but that's what happened alot has changed since.","commenter_a":"It does not matter he did not do it if we look hard enough I'm sure we all have someone in our family history who's done something we are not proud of","post_message":"Ben Affleck is coming clean about why he wanted to keep a slave-owning ancestor a secret @webpagelink"},{"comment_id":"626166684240577","commenter_b":"She is a idiot ass","commenter_a":"She always does that is why nobody watches the show the POS is on.","post_message":"Whoopi Goldberg made a sad attempt to play the race card, big mistake. What liberal filth. She needs to be taken off TV. Are you tired of liberal trash polluting the media?"},{"comment_id":"10154570466249575","commenter_b":"Funny how a white teen cant even go to a middle school without murdering a classroom full of people. Funny how a white man cant go into a black church and not kill 8 or 9 people. Funny how a white man cant be around his cousin without sleeping with her","commenter_a":"Amazing how I can attend a tractor show in middle America with 100+ people and not one person was shot,stabbed,assaulted, but yet have one black cookout and all hell breaks out","post_message":"This man is facing preliminary charges of attempted murder and criminal recklessness after police say he shot two men having a backyard cookout Saturday.   Officers say the incident started when the suspect confronted the men about a vehicle blocking the alley where he was trying to drive."}]
