[{"comment_id":"1694121650829136","commenter_b":"@username the immigrants themselves cannot legally however once they have a child in America we won't kick them out because they have to raise there American born child this is the idea called anchor babies","commenter_a":"What about his son? His wife is from Hungary right and his other kids had a Mother not American. How does that work?Ship them back I guess.","post_message":"\"No, it’s not in the Constitution. If you read and if you look, and if you go to the real scholars, like different people that I can give you, they will tell you.\" – Donald Trump  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"875427632505785","commenter_b":"I prefer to be even more accurate than that. The legal term is \"Illegal Aliens\".","commenter_a":"Hey Fox 10! I love you, but this has to stop! It's ILLEGAL IMMIGRANTS NOT JUST IMMIGRANTS! Immigrants are preserved for those who came here LEGALLY. GET WITH IT!","post_message":"More than 1,800 immigrants that the federal government wanted to deport were nevertheless released from local jails and later re-arrested for various crimes, according to a report released Monday. What do you think about these findings?"},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"493465740841719","commenter_b":"Good I will not go there!!","commenter_a":"I wont be there so shove your coffee and other product up your big rich white ass","post_message":"Should we boycott now?"},{"comment_id":"1558210104487104","commenter_b":"So we fib a little bit.","commenter_a":"Lol BRUHHHHH 😲😲😲 Mike Scott","post_message":"This skydiver performed some of the stunts when Iron Man 3 was filmed in NC. Tomorrow night on FOX, he's performing a huge stunt without a parachute. Will you be watching?"},{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"1190682247676976","commenter_b":"Hey Bitch you may go to prison after all !!!","commenter_a":"No accountability on behalf of Killary Clinton for the Email scandal Teflon Bill and her remain unscathed in her unsecured private server and passing of top secret state emails, after only a 30 minute talk with Loretta Lynch Bill got it all worked out last week, oh and the FBI director was an Obama employee, how convenient! I bet if she becomes our president she will be protecting the Nuclear codes the same way and making sure her Iranian Aide Huma Abedin knows just where to keep or use them, no worries. Please don't vote for this KILLARY, because our nation can't afford someone willing to sell us out so easily, email scandal, enriched uranium scandal with Russia, Saudi money foundation scandal, Unsecured borders, she will take all your guns, and not to mention Benghazi. Trump 2016","post_message":"Up until now Hillary Clinton has faced a lot of serious charges, but nothing compared to the one that just got brought up.  If this goes through, Hillary's about to get hit with the most serious charge a leader can be accused of.   There's no way the media will let this get out..."}]
