[{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"932260496814809","commenter_b":"You believe and listen to the \"man hating\" feminists which aren't a legitimate example of the feminist movement.","commenter_a":"Thank you. It's time the \"real\" (for lack of a better term) feminists become the majority over the \"man-hating\" feminists.","post_message":"It's so misunderstood, but they clear it up — by using the word 32 times. - Rebecca Eisenberg"},{"comment_id":"10153867338207212","commenter_b":"And she's voting for Hillary. Smh","commenter_a":"She's such a cute lady- I wanted to hug her!!","post_message":"Thousands of Oklahomans are voting early, including a 100-year-old woman who has a message for young voters. #News9"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."},{"comment_id":"10153496475494575","commenter_b":"\"She has since filed an appeal.\" Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.\""},{"comment_id":"10153506757381509","commenter_b":"Maybe the people voting on abortion laws should reconsider......","commenter_a":"She needs to be charged with murder.","post_message":"Dynel Lane, 34, has been charged with criminal attempt to commit murder in the first degree, unlawful termination of pregnancy, and seven other counts for allegedly cutting a fetus from a pregnant woman's womb. @webpagelink"},{"comment_id":"10155955897895354","commenter_b":"The nasty b*tch just wanted attention and guess what? Now everybody is giving it to her.","commenter_a":"For the life of me I will never understand killing these magnificent animals. I just don't understand how it can be wonderful, thrilling, exciting or in any way fulfilling to kill an exotic animal. And then chop it's head off or whatever you do with that giraffe and have it mounted. Makes not one bit of sense let alone any kind of satisfaction.... Just don't get it.STOP IT NOW!!!!","post_message":"This hunter is single-handedly breaking the Internet today.   Check out the photos of her other controversial kills..."}]
