[{"comment_id":"1286858341353620","commenter_b":"who cares !!! no one !!! let that bitch fall !!!!","commenter_a":"She is sick. She was having a seizure. She is lying about her health. She was the only one wearing sun glasses and I thought it strange. She is a basket case.","post_message":"BREAKING:  HILLARY HAS MEDICAL EPISODE AT 9/11 CEREMONY in NYC.  Swept away by security detail.  VIDEO  @webpagelink"},{"comment_id":"1034922753266951","commenter_b":"Dumb bitch","commenter_a":"Sarah Palin humiliates herself every time she opens her mouth. Do us all a favor - shut up.","post_message":"She just picked the WRONG fight."},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10154593290916037","commenter_b":"Kick all them illegals out!","commenter_a":"it is what he has always said, just all the words are different now","post_message":"Christie highlighted that Trump has said undocumented immigrants will not be eligible for citizenship unless they leave and re-enter through legal channels."},{"comment_id":"10153957571836336","commenter_b":"yep video that thieving skank so the whole world and any future possible employers can see that she is a totally untrustworthy pos","commenter_a":"hope she goes to prison!","post_message":"\"We got you on camera yesterday at Ralph's for $200, so just know that the cops are coming up here,\" Juana Martinez told the 19-year-old worker."},{"comment_id":"10154250481564032","commenter_b":"There have been no riots in Arizona. But I absolutely agree with the voting statement.","commenter_a":"If these rioters would've spent this much effort & time and actually woke up, got out of bed and VOTED.....they wouldn't have this problem.","post_message":"There have been several \"Not My President\" demonstrations in large cities and school campuses across the country."},{"comment_id":"1015814318563348","commenter_b":"Illegals are getting benefits. Its not my fault that youre too much of an idiot that you cant see that. And because of our backwards government giving handouts to everyone of these assholes, theres not enough resources left to give them to the people who really deserve them. Stop being such a dumb cunt. Every chance i have to take part in getting rid of these parasites, you better god damn well believe that i will!","commenter_a":"And illegal immigrants shouldnt be in the us either. Have you seen the jails in this country? If you break the law, they lock you in nasty, unsanitary cages like fucking animals. If you break yhe law, you get what you deserve!","post_message":"These conditions should not be allowed anywhere, especially in the U.S."}]
