[{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"10152510366081813","commenter_b":"Sound like another feminists that loves the idea of discrimination. Gee, imagine finding you here.","commenter_a":"And then ACLU discriminates by stating \" This one is dedicated to all the girls out there\".. LOL","post_message":"This one is dedicated to all the girls out there who prefer reading science fiction and history books to love stories.  @webpagelink"},{"comment_id":"10153694012485779","commenter_b":"Smart women!","commenter_a":"See some women aren't as smart as men","post_message":"Part support group, part grassroots political organization, Republican Women For Hillary was founded in Washington, D.C. where GOP women were commiserating about Donald J. Trump. Meet the Republican women who are backing Hillary Clinton."},{"comment_id":"860452347398311","commenter_b":"What an idiot, can she really be this stupid? If this passes for high intelligence, I must be a genius","commenter_a":"You really cannot fix stupid","post_message":""},{"comment_id":"1244871155548303","commenter_b":"You ain't going anywhere you f. Ing. Liars.......where u gonna make your money.....u should feel lucky that this is the only bonehead country that would pay your assets to do anything on film!!! BIG FAT LIARS......THEY R WHAT THEY IS !!!!!","commenter_a":"Yea.........see ya","post_message":"The last slide Don Jr. has a nice surprise for all of them!"},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"10154280185019032","commenter_b":"Why are there exceptions made to people who are in the US ILLEGALLY? No other country changes their laws to fit the demands of illegals!","commenter_a":"From a friend.... Friends, I desperately implore you to please please educate yourself on DACA, one of President Obama's Executive Orders which our President-Elect Donald Trump is threatening to revoke. DACA is intended to be a temporary solution because our gridlocked, partisan Congress refused to pass the Dream Act, for which there has been wide bipartisan support. DACA allows undocumented young people whose parents brought them to the US as children to have just a few temporary rights. If these kids meet several requirements and pay about $500 initially and when they renew (after two years), they can defer deportation and be allowed to work legally. DACA is especially important because it allows these young people to legally work and to pay taxes. In my experience, most of these young people quickly find work and use their money to pay for college tuition, to buy school supplies for their younger ...","post_message":"President Obama created DACA as an executive action in 2012. President-elect Donald Trump has said he will \"immediately terminate\" it."}]
