[{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon \"in the name of the LAW\"? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"1234200423314954","commenter_b":"Yes they are I seen it. \"All white people to the back of the line\"","commenter_a":"It is! People need to get over it. Standing on freeways and burning buildings is not the answer!","post_message":"Do you support or oppose anti-Trump protests?"},{"comment_id":"1318079928223893","commenter_b":"Get out of White House. NOT MY PRESIDENT.","commenter_a":"still trying to convince America that he wasn't the worse president ever","post_message":"President Obama holds a press conference with Greek Prime Minister Alexis Tsipras. It is the final overseas trip of his presidency."},{"comment_id":"855492334499315","commenter_b":"Leave her in the hot car","commenter_a":"Idiot to the max.......","post_message":"It has happened again. Police say a woman left her child in a hot car Friday, now she's facing charges."},{"comment_id":"10154420350898797","commenter_b":"She dont need those racist mother f**ckers","commenter_a":"Beyoncé has a concert coming up in Florida. Guess what? I read not enough off duty Police want to work it. Karma be a beeoch.","post_message":"BEYONCE BOYCOTT: The police union deemed her performance - which included allusions to the Black Panthers, Black Lives Matter, and Malcolm X - \"antipolice.\""},{"comment_id":"1816579521955760","commenter_b":"@username please explain since you are, \"so sure\". Provide facts. Also, a bit of advice folks, just because you believe it doesn't mean it's true.","commenter_a":"No matter the outcome, people who voted for him and constantly protect him with ignorant comments, will just keep saying \"we won, we won\". They aren't exactly sure what they won since their candidate keeps back peddling on his entire platform. They'll just know that they won. We all lost. Ignorance, racism, labels, anger, and an immature person won.","post_message":"Computer scientists spot voting irregularities in swing states two weeks on from Trump's election."},{"comment_id":"10152578499710950","commenter_b":"Sore ass losers.","commenter_a":"Redonkulous !!!","post_message":"\"Uh, excuse me?\"  LISTEN: Reporters ask New England Patriots coach Bill Belichick about \"Deflate-Gate,\" and he is not amused: @webpagelink"}]
