[{"comment_id":"10154441744191509","commenter_b":"WE STAND WITH TED CRUZ----WE WONT VOTE FOR JIMMY NUTS CARTER ENDORSE TRUMP OR ILLEGAL ALIEN AMNESTY PROMOTER RUBIO.","commenter_a":"Jessi Spires Ben Kraja Alex Gochis Tyler Teejay Chase","post_message":"Three white nationalist leaders have formed a super PAC for Donald J. Trump, even though Trump doesn't want their support.  #NewHampshire voters are getting a robocall with a simple, disturbing message."},{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"},{"comment_id":"10154648123623812","commenter_b":"@username if Hillary would've have been held accountable 14 years ago, she'd be in prison.","commenter_a":"ABC news and the Washington Post- Lies. ABC headline is ridiculous. Newt Gingrich still backs Trump. The media is banking on people only reading the headline, and not the story.","post_message":"Newt Gingrich, one of Donald J. Trump's most ardent supporters and once rumored to be his vice-presidential pick, says Trump is \"proving he is more unacceptable\" than Hillary Clinton."},{"comment_id":"10152967093391051","commenter_b":"Your a heartless bitch","commenter_a":"Waaahhh","post_message":"Since school officials refuse to do anything about her bullies, this teen is now turning for help elsewhere."},{"comment_id":"781142075321254","commenter_b":"She should be in prison for what she's done","commenter_a":"She just needs to ask","post_message":"Would you be upset if a nurse did this to you? @webpagelink"},{"comment_id":"10153842833302756","commenter_b":"Racist? Ok then. Keep letting the Muslims in this country to terrorize. Let the BLM people go unchecked and keep killing our Police. Let illegal Mexicans in to drain our already overtaxed healthcare system and bring more drug violence. No, no more. It ends now.","commenter_a":"I can't wrap my head around how anyone comprehends what he's saying. He literally says the same thing OVER AND OVER, but I guess that's the only way his racist, small-minded supporters can understand him.","post_message":"Republican presidential nominee Donald Trump spoke with Newswatch 16 after his rally in Scranton on Wednesday. See more here: @webpagelink"},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"}]
