[{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"10154614899766729","commenter_b":"The woman is already bought and paid for, she is an insult to any decent woman!","commenter_a":"Bitch please!!!!!!!","post_message":"Where is the mainstream media on this? Complete silence..."},{"comment_id":"10153532462028352","commenter_b":"And nobody in those stores were killed btw","commenter_a":"Use your brains people, this story isn't getting plastered all over the news because she's a good mother,AMERICA GETS OFF ON SEEING BLACK MEN GETTING ATTACKED.. And this is a perfect way to hide behind the actions of his mother. They love seeing black men being put in \"check\" and being demeaned in public....AND Have you ever seen a black mother hit her son for enlisting in the military to fight some people that has no effect on the oppression of blacks in America ?","post_message":"‘I didn’t want him to be another Freddie Gray': America’s favorite mom speaks out after smacking masked son and dragging him from riot"},{"comment_id":"10153299711818037","commenter_b":"We'll have the latest on @username @ 5. New reports say 60 dead.","commenter_a":"Silvia, so glad yall are already back, scary 😁","post_message":"UPDATE: Paris police prefect Michel Cadot said all the attackers are believed dead, although authorities are hunting for any possible accomplices."},{"comment_id":"317547525326742","commenter_b":"To pay the illegals","commenter_a":"GREAT NEWS!! You just keep spiking those taxes..why stop there..RAISE TAXES ON EVERYTHING....YOUR GOING TO NEED IT! Besides..dont you left winged morons believe in taxing yourselves into welfare?? Good job!! GO CALIFUCKUP!!","post_message":"Robbing Peter to pay Paul..."},{"comment_id":"1005179532861447","commenter_b":"Jail her for life","commenter_a":"What a screwball! Have a heart attack but don't beat your child! Moron!","post_message":"A Florida woman is accused of beating her child after the juvenile flushed more than $700 down the toilet: @webpagelink"},{"comment_id":"10154189668593352","commenter_b":"Husbands fault!!","commenter_a":"She's young and does not realize the damage that she's doing and the fact that she cannot deny it!","post_message":"Sidechick Embarrasses Wife on Social Media – Posts Videos of Her And The Husband Doing 'You-Know-What'! (PHOTOS)"}]
