[{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"10154046383106509","commenter_b":"invasion of economical immigrants/social benefits leechers under camouflage of refugees","commenter_a":"Theres awfully a lot of Military age male in these \"refugees\".","post_message":"Germany to impose border controls with focus on its border with Austria. @webpagelink"},{"comment_id":"716711075186137","commenter_b":"Then go back home. Get out of America. We don't want you Islam or Sharia law.","commenter_a":"If that is what they want, I would assume they would be buying airline tickets for a flight back to a Muslims country.","post_message":"Muslims Try To Pass Sharia Law In Alabama So Citizens Do THIS.  We live under the law of the constitution. They are taking a stand.   Do you support these patriots?"},{"comment_id":"10154512852146350","commenter_b":"@username I'm well aware that her mother is white. Someone should let HER know that","commenter_a":"Alicia Keys is so talented and beautiful. It's really a shame that she's a racist.","post_message":"\"It's about just being who you are and not letting anybody tell you who you should be, Alicia Keys said."},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."}]
