[{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"1432409323458617","commenter_b":"@username and dodging sex with Trump is her game.","commenter_a":"So when the conservatives were freaking out about Michelle Obamas bare arms I don't recall them freaking out about Malaria laying naked on a fur or in bed with another woman. Were is your outrage now hypocrites. This woman doesn't have an ounce of class compared to the classy Michelle Obama.","post_message":"There's secret meaning in Melania Trump's style."},{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"561305640738010","commenter_b":"Yeah men can't back out....it's called child support lol","commenter_a":"Men should be made accountable and pay all money through a court.","post_message":"We couldn't agree more!"},{"comment_id":"10155189580834411","commenter_b":"@username ... Crawl back down your sh!thole!","commenter_a":"Everyone should boycott Israel. They are an apartheid state with no regard for international law. The bulldozed over 100 homes in the first week of 2017.","post_message":""},{"comment_id":"1305769832812876","commenter_b":"Lock that b@tch up","commenter_a":"TODAY'S WIKILEAKS..Donna Brasile, GO READ UP! She got advance questions from CNN Debate, Hillary v. Bernie Sanders for Democratic run. She is the most corrupt politician possibly in our Country's history.","post_message":"As secretary of state, Hillary restored our reputation around the world and made us safer."}]
