[{"comment_id":"1364883926864562","commenter_b":"Go tell her that bitch","commenter_a":"You are nothing but a disgusting pos Michelle after the sex scandals you have had, you are a freakin hypocrite lady, at least Trump's children were brought up right and with class unlike your daughter, you just need to shut the Fk up.","post_message":"Michelle Obama says Trump is guilty of \"bragging about sexually assaulting women, and this has 'shaken' her. What do you think about her comments?"},{"comment_id":"10153895109342994","commenter_b":"Let Canada take in all the refugees - America doesn't want or need them.","commenter_a":"That's Canada! Friendly and welcoming people :) Wish the rest of the world was like that..","post_message":"A church in Canada is making a statement in the holiday season that's brewing controversy - and they're going beyond the church sign."},{"comment_id":"10153272181918812","commenter_b":"When you have this cancer gene, your chances of getting cancer are much higher. And yes, a women should have the choice to live longer or die sooner...","commenter_a":"I think its just crazy that shes having everything removed and she didnt even have cancer just because its running in the family doesnt mean she will get it my lord cancer can show up in any part of the body","post_message":"Angelina Jolie's mother, grandmother and aunt all died from cancer: @webpagelink"},{"comment_id":"10152763984611051","commenter_b":"they need to fire those officers, charge them criminally and hope she wins the lawsuit","commenter_a":"I'm thinking alot of you didn't read the article. Female police officer, in Canada, one month on the job, immediately suspended from the job after the attack, has since resigned.","post_message":"This officer arrested two people: a drunk teen and a rapist. She put them in the same backseat but only handcuffed one. Guess which one."},{"comment_id":"10152807087037434","commenter_b":"Sad & in no way did I consider her or her character on sex in the city a role model ! This is sad because she made a ton of $ pretending to be a woman that writes for a living- most (not all) writers know the definition of a word before the use it or wish for a movement in its name! Geesh SJP can't you pretend to be smart????","commenter_a":"I think people need to stop asking celebrities for their opinions on feminism. They are just as likely to be total ignoramuses as anyone else. Exhibit A right here.","post_message":"\"We would be so enormously powerful if it were a humanist movement.”"},{"comment_id":"1209790529075949","commenter_b":"Jill Stein has no chance but at least you are not voting for Hillary. Thanks for that","commenter_a":"Bernie, this is but another example of you and Jill Stein agreeing on things. You two are the only ones who care about the people. You should reconsider your endorsement of Hillary. I know you endorsed her because you promised to support the democratic nominee, not because Hillary is a good candidate and not because you expect her to keep her promises of the few progressive things she's claimed she'll push for. I undersrand the implication of going back on your promise is a political no-no and would be used against you if Hillary loses. You'd be blamed for Hillary losing. But still you should consider Jill Stein. You know the USA needs a new Populist Party. You know that the only reason that made the Democratic Party progressive and gave us progressive presidents like FDR is due to there being strong progressive third parties back then to compete with ...","post_message":"If we are going to take on the fossil fuel industry and protect our planet, I need Zephyr Teachout by my side in Congress."},{"comment_id":"10154048392259087","commenter_b":"Mexicans might cross a border but not a fucking ocean.","commenter_a":"\"The Wall\" is just what he said to get racist white votes. You're a fucking moron if you think a wall would be built. Let alone be efficient. There's OTHER ways in!","post_message":"\"We didn't discuss who will pay for the wall,\" Trump admitted."}]
