[{"comment_id":"883127565153756","commenter_b":"We have aspects of both a Republic, and a Democracy","commenter_a":"We will never know the truth.","post_message":"I really hope everyone on Facebook reads this."},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."},{"comment_id":"1325725004111513","commenter_b":"They're both adulterers. Trump cheated on his first 2 wives","commenter_a":"It is actually possible for both to be true: Trump is a conniving, egomanical pig who won't stop at destroying others to get to the White House and Cruz is a lying adulterous pig who would also be a big hypocrite. Sigh. And all of it unfolding on Good Friday. You can't make this stuff up....","post_message":""},{"comment_id":"988932794475475","commenter_b":"black so slap on the wrist and tell her NO NO","commenter_a":"Thanks Obama! This is how you are destroying America! I hope you and all of your kind are happy. No wonder this nation is falling apart.","post_message":"She will pay for this!"},{"comment_id":"1717613511850715","commenter_b":"Shoot everyone of those goat humpin bitches! Problem solved!","commenter_a":"It's time to take a stand America !!!","post_message":"Muslim Man Kills Pregnant Woman For Coming To Close To His Mosque. He ended two lives for nothing. Justice needs to be served. What do you think his punishment should be?"},{"comment_id":"976984712394583","commenter_b":"it was a $130,000 bust lol.... oooh what an impact. Responsible gun owners who will do things like \"not break the law\" and register their firearms, aren't going to buy them illegally on the black market. The people who are looking for guns to commit crimes with will continue to buy them on the black market. Changing any laws will not change this fact. In other news, water is wet.","commenter_a":"Holy silenced Uzis.","post_message":"This is why criminals get guns so easily."},{"comment_id":"1717265371820481","commenter_b":"Calling for a border restored and a return to LEGAL immigration IS NOT RACIST. We will not give our country to you - but you may join our country if you ask! VOTE TRUMP!","commenter_a":"Go trump","post_message":"BREAKING: Anti-Trump protesters rally at Columbus Circle and are heading to Trump Tower. Are you there? @webpagelink"}]
