[{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"667242780097527","commenter_b":"YES!","commenter_a":"Yes","post_message":"Would Donald Trump be a better president than Obama?"},{"comment_id":"579876898863510","commenter_b":"that chick with the bad bouttabe me in a second","commenter_a":"How cooked Darnell Fraser-Carroll Darnell Rea","post_message":"Ghosts from The Ring and Grudge opened a Japanese baseball game"},{"comment_id":"1091574534232574","commenter_b":"Why this government is all B/S! Why this government is all B/S! It left over 180,000 tailor and mobile homes in Louisiana that the people never used and this sh**hole of a government could have added to that number and moved them all over the Midwestern farms for many of this countries people living off long term benefits! Just relocate mom and her 2-3-4 or more kids out there to work the farms! I think that this would be much healthier for the kids than being raised in many respects in slum cities and neighborhoods This bullshit about Americans are unwilling to work the farms, well, maybe if they are forced to, or all subsidy will end, maybe they with their children will learn a healthier way! And other women, who may consider this lifestyle, may think twice! The only reason that this government wants the border open is to ...","commenter_a":"Yes","post_message":"\"Cuban nationals should be treated under the same immigration rules as nationals of other countries.”"},{"comment_id":"958116217578241","commenter_b":"Hillary had two terms (8) years in the White House. Hillary was involved in everything bill Clinton did!! Hillary had two terms (8) as a New York senator. Hillary had a term (4) years as Secretary of State. Yet, the old girl thought she could have her own server and NOT be held accountable for classified emails... When are Americans going to get pissed enough to hold the shrew responsible?? Hillary left four AMERICAN men to be tortured until dead in Benghazi. Could this be what she and her aids are hiding? As of Friday, as per a JUDGES order nothing has been turned over. The two aids hide behind an attorney and Hillary just never answered... Monday such be very interesting!","commenter_a":"She needs to STOP Monsanto instead of defending them. We all have a right to know what is in our food.","post_message":"Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: @webpagelink"},{"comment_id":"513861468804433","commenter_b":"Go home u witch","commenter_a":"Moron Muslims are every where lock and load it's time to to what our own goverment won't","post_message":"Muslim woman makes outlandish accusations about Americans on TV.  What a joke. This is the kind of ignorance that starts wars.  Do you agree this woman needs to be silenced?"}]
