[{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"10153596919524205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"Amanda Kovanis","post_message":"Donald Trump has been running a populist campaign, and during the Republican primary that has meant saying outrageous things to impress conservative voters. Will he change his positions when he becomes the Republican nominee?"},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"},{"comment_id":"10154113431396037","commenter_b":"Wolves in sheep's clothing","commenter_a":"...sickos for 'god'...","post_message":"The Christian Prayer Center website not only charged consumers $9 to $35 for prayers but also \"deliberately\" confused some consumers into signing up for recurring monthly payments, according to authorities."},{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"}]
