[{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10154557639632619","commenter_b":"Jerusalem is the old city of Israel.","commenter_a":"IDIOT COMES IN ALL SHAPES & SIZES & STATUSES!!!!!!! ISRAEL FOREVER!","post_message":"Jordan's King Abdullah II threatened an \"explosion\" over Israel cracking down on violent Muslim riots on the Temple Mount, stating that he will broach the issue at the UN next week."},{"comment_id":"731521210341165","commenter_b":"You mean the Wars the Bush started and Obama ended? Also James now that you've mentioned hospitals, in Syria we as a country have never bombed a hospital, it was Russian and Syrian Regime bombs that caused those explosions. Banning or restricting the immigration from certain countries has been happening for as long as the United States had borders. But this is the first time we have banned people of a certain religion from entering the country. Even though these Muslim men, women and children are suffering just as much as their next door neighbors who are Christian or Jewish.","commenter_a":"Where were these people when Obama was bombing the countries the refugees are fleeing from?","post_message":"Americans across the country protested against Trump's travel ban."},{"comment_id":"10152594345774071","commenter_b":"What girl with an f cup wants to wear a bra with half inch width straps? VS bras aren't comfy anyways.","commenter_a":"The bigger the size the harder is must be to line up the targeted areas with the proper tie downs ...","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."}]
