[{"comment_id":"10153057043503984","commenter_b":"Kick her dumb ass out of office!","commenter_a":"NO!!!!!! We the people need to come together and figure out what to do about these people. No one in Washington is.","post_message":"I guess she's revealing her true intentions behind becoming someone in power... I wouldn't want to live under her rule.  Do you think this new mayor should be allowed to put restrictions on the Constitution?"},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10153987272260667","commenter_b":"Readup Trump's plans for America @webpagelink","commenter_a":"I'm over this, I am over ALL of this nonsense!!! This entire Campaign is an embarrassment to the world!! #AbrahamLincoln2016","post_message":"Here’s how it all started."},{"comment_id":"1374717489237646","commenter_b":"Deport all Mexicans","commenter_a":"Alot of snowflakes on here. Trump!!!!!","post_message":"LIVE NOW: Donald Trump speaks at a \"Thank You Tour\" rally in Mobile, Alabama."},{"comment_id":"10153648281727093","commenter_b":"What an ignorant woman.","commenter_a":"She shoulda kept her mouth shut. Definately part of the problem not the solution... Our Dallas officers have absolutely ZERO to do with the recent ON CAMERA MURDERS of those men. So NO JOHNSON IS NO MARTYR. HE WAS A VILE POS THAT GOT JOHNNY C4d","post_message":"The first African-American Miss Alabama said she knows it's not right to feel this way, but can't help it... @webpagelink"},{"comment_id":"10154325578499255","commenter_b":"hurry with that wall.and maybe with all the money they make they will build it for you.","commenter_a":"The Republican Establishment goes nuclear.","post_message":"This has to sting.  By Daily Kos user ericlewis0"},{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."}]
