[{"comment_id":"1031268323551304","commenter_b":"Why is it OK for transsexuals to lure gays into gay bars and not women to attract straight men into a restaurant?.........libtards double standard!","commenter_a":"Uhhh.. What's the problem?? We know this... They know this.. They know that we know this.. Who's getting hurt by this? Do much for women being empowered. They're not helpless..You can't have it both ways.","post_message":"This leaked memo says it all"},{"comment_id":"1759531520987240","commenter_b":"@username Trump's wife was an immigrant and all she did to cum to U.S., is spread her legs!","commenter_a":"My native American vote for Trump although the Chief of the Cherokee tribe supports Hillary Clinton. Trump President of the United States 2016 all the way to Trump Towers aka the White House. Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of ...","post_message":"It is time for rule by the PEOPLE, not rule by SPECIAL INTERESTS!"},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"10153778518101051","commenter_b":"Whore. Really? Are you 14?","commenter_a":"Not defending her but why was the affair discovered two months AFTER she filed for divorce? Thats a little creepy on the ex husband's part.","post_message":"This man suspected his bride was up to something, so he hired a private investigator to check it out. His suspicions were ultimately confirmed and his wife was arrested shortly after."},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"},{"comment_id":"10157668685335389","commenter_b":"This woman is not!!","commenter_a":"I know women are going to hate me but if Hillary becomes president I can see why they didn't allow women to vote until the 1920s?.... women are overwhelmingly voting for Hillary over Trump this is how stupid most women are...MOST...not all... their kids and grandkids will be screwed for life","post_message":"Perspective."}]
