[{"comment_id":"10153404039272293","commenter_b":"@username police kill blacks at a rate disproportionate to their total percentage of the population an assertion supported by The Guardian statistics. Police killed almost five black people per every million black residents of the U.S., compared with about 2 per million for both white and hispanic victims. @webpagelink","commenter_a":"Tamir was a 12 year old boy. TWELVE!!!","post_message":"\"I saw the weapon in his hand coming out of his waistband,\" one officer wrote in his statement. \"The threat to my partner and myself was real and active.\""},{"comment_id":"10154045995555329","commenter_b":"@username No Danie, they're too scared to do anything because FEMINISTS THREATEN TO KILL THEM.","commenter_a":"As a man who would literally NEVER talk to a woman like this, I'm ashamed and embarrassed that men actually do. Makes me sick. I was always taught to treat women with respect. Guess that doesn't apply to my fellow man...","post_message":"ICYMI"},{"comment_id":"716457901822319","commenter_b":"You the ugly one!","commenter_a":"She know she UgMo...lol..","post_message":"Isn't this a great response when they questioned Serena about her beauty?"},{"comment_id":"10158074585980294","commenter_b":"The only thing that woman is in line for is a jump suit with stripes","commenter_a":"Here's hoping Hillary gets 271 at the least!!!","post_message":"By law, the Electoral College meets on December 19. But how does it actually work? Here's a quick lesson on tomorrow's events."},{"comment_id":"10153215772461943","commenter_b":"I don't trust her, Should be tried for treason","commenter_a":"Was never any doubt, when her mouth moves, she is lying!","post_message":"** Now we have smoking gun proof of Hillary Clinton involvement in the lying Benghazi  points used by Susan Rice... Please SHARE this breaking news story! **"},{"comment_id":"10153169832344087","commenter_b":"Can you give an educational description of what is a liberal and a conservative","commenter_a":"Maybe he should have gave the same talk to the average liberal they are after all at the same mental stage as a second grader","post_message":"“The congressman chose to give an example of the current situation in Iran, and made some inappropriate comments about ‘Do you know what a nuclear weapon is? Do you know that there are schools that train children your age to be suicide bombers?'\" one parent said."},{"comment_id":"1087900891233676","commenter_b":"The country would be safer if deported the republican/Tea Party.","commenter_a":"Thats why this year to come. I invite all registered voters to hit the polls. So this son of biatch don't win.","post_message":"After seeing Trump on TV, 8-year-old Sofia was terrified that the army was coming to take her away."}]
