[{"comment_id":"10152929148789342","commenter_b":"That statement coming from a welfare trashy tattooed old skank. Go figure.","commenter_a":"aand let the killings begin...smh","post_message":"BREAKING -- The Texas Senate has given preliminary approval to allowing concealed handguns in college classrooms, a day after passing a measure allowing open carry of guns most everywhere else in America's second most-populous state.  FULL STORY ---> @webpagelink/  What do you think -- are guns on campus a good idea?"},{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"\"Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.\""},{"comment_id":"10153221736289087","commenter_b":"Hey Reid we do not want this BS in our country!! YOU GET IT?? WE THE PEOPLE WANT ALL OF YOU TO FOLLOW THE CONSTITUTION! WE STILL HAVE FREEDOM OF SPEECH IN THIS COUNTRY! WE WILL NOT BE PUSHED AROUND! WE DO NOT WANT SHARIA LAW HERE! WE DO NOT WANT ANYONE WHO WANTS IT HERE TO LIVE IN THIS COUNTRY! GET IT? GOT IT? GOOD!!!!!","commenter_a":"When will,Dirty Harry apologize for his Viscious atracks,insultscandvcharges,against innocent republicans like mitt Romney ????? Reid is a very bad person.","post_message":"“I call on every Republican to denounce Ben Carson’s disgusting remarks,” Senate Minority Leader Harry Reid said. “That shameful intolerance and bigotry should have no place here."},{"comment_id":"1038035722930072","commenter_b":"For all you little girls out there here is your biology 101","commenter_a":"Al u people that stand with planned parenthood are just as disgusting as they are., hope your babies don't get ripped apart limb from limb you sick bastards","post_message":"#BREAKING: \"Planned Parenthood & our CA affiliates today filed a lawsuit against the people behind [the] widely discredited video smear campaign,\" tweeted Planned Parenthood president Cecile Richards."},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"970690569690664","commenter_b":"Good luck... Whomever the bitch was that reported my post. Truth hurts don't it troglodyte?","commenter_a":"Am I the only one to realize that all of these mass shootings are done by men?","post_message":"America's easy access to guns almost led to another devastating tragedy..."},{"comment_id":"10153039923756037","commenter_b":"^ pathetic.","commenter_a":"Tranny.","post_message":"#MichelleObama relished watching children ride their bikes and walk their dogs inside the White House as she pushed her \"Let's Move\" campaign forward."}]
