[{"comment_id":"10153580270695575","commenter_b":"If this is true, which I'm sure it is, how sick. But this is what the female liberals want. Oh is saying female liberals not PC?","commenter_a":"The Missing link!","post_message":"The Gateway Pundit - Muslim Dad Kills 4 Year-Old Daughter for Not Covering Her Head"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10153904664428010","commenter_b":"Illegals deserve to be deported not unseat Americans for health care.","commenter_a":"Anyone who has ever worked in a hospital could have told you. So many before the ACA never would have qualified or been able to afford. Everybody in this nation deserves access to our health care system.","post_message":"California's version of Medicaid will test the power of the Affordable Care Act."},{"comment_id":"10154774473425575","commenter_b":"@username - islamic women are smart enuf to use these clueless American women to further their islamic agenda. but the women marching think its a march to protest defunding planned parenthood. very sad to be very dumb.","commenter_a":"can the 200K marching women be shipped to syria or where ever hamas HQ is? - lmao","post_message":""},{"comment_id":"1708937832702911","commenter_b":"I would like one illegal immigrant or one Mexican to please answer this question. Why is an American considered a racist because we want a wall to control the people that we allow in this country. You just can't have open borders and allow anybody and everybody to come in that is not a country anymore. Furthermore why is it that Mexico has a Huge fence with Barbwire and guards in towers with rifles by the Mexican Guatemala border??? What hypocrites!!! Maybe because Mexico does not want illegal immigrants coming into their country from the Guatemala border but Americans are racist if we don't want illegal immigrants coming into our country. Totally absurd!!","commenter_a":"And they have the Bundy 's in jail and killed Levoy . These violent protesters get to go home alive .","post_message":"HOW INSANE! Photos and videos you must see from last night:  @webpagelink"},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good.  We won't stand for Shariah in America and neither should you.  Do you support banning Islamic laws in all 50 states?"}]
