[{"comment_id":"10153409489988010","commenter_b":"AIR COOLED vs. WATER COOLED. Not all motorcycles are designed alike. Bikes also have a tendency to overheat in higher/hotter temperatures.","commenter_a":"I've heard a common argument in favor of lane-splitting from motorcyclists that it's a necessary practice due to the lack of cooling on motorcycle engines. To avoid overheating, motorcyclists cannot sit idle very long as automobiles do. I've always wondered what the full truth is behind that.","post_message":"Motorcycle lane-splitting — the rush-hour time saver for bikers that enrages many drivers — may be poised for formal legalization."},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"10156149159940354","commenter_b":"There's NO MYTH! ASSHOLE! I RESCUE PIT BULLS TOO, It's Dumb F**KS like you and your brother James that give Pit Bulls a bad Rap! Also DumB F**KS like this woman in the article! Check Cesar Milan, Pit Bulls & Parolees, Etc etc! OH NEVER MIND You're probably a Liberal Obama lover too!","commenter_a":"I OWN PIT BULLS, It would be impossible for me to order mine to attack ANYBODY! I could leave them in a room with an infant crawling on the floor without a worry! THIS woman IS THE REASON Pits have a bad Rap! These dogs were trained to be mean! Lock her ass up for 25 YRS! I Doubt the two dogs can be saved, they'll have to be put down!","post_message":"***WARNING: GRAPHIC VIDEO***"},{"comment_id":"10152782566181051","commenter_b":"I hope the next time Kanye storms the stage whoever is up there just decks him. What a POS!!!","commenter_a":"I thought west was leaving the USA. What happened? We'll help pack you up and get you out of here!","post_message":"Beck just issued a response to Kanye West’s rant about him not deserving a Grammy."},{"comment_id":"10153557927483984","commenter_b":"More liberal stupidity","commenter_a":"This is just getting Americans used to having freedom taken away from them. One step at a time until Americans have no freedoms to do anything. This will stop when Liberal politicians are voted from office.","post_message":"Wow. Taking the Confederate flag down from state capitols was controversial enough, but this is on a whole new level. A lot of people are going to be furious...  Do you think Congress has gone too far?"},{"comment_id":"10156552625375354","commenter_b":"Let me try this again without hitting the return button prematurely. The Hijrah is mandated in the Qu'ran. It seems to be proceeding according to their plan. So long as Merkel and her other Western apologists permit unfettered entry in their respective countries, Islamic conquest via mass immigration will have been accomplished even ahead of schedule.","commenter_a":"Islam is not a religion or a race. It is an illegitimate organized group of murderous thugs and has been since it began. Their modus operandi is always the same. The videos in the links are about Islam. @webpagelink . There is more here @webpagelink . Watch the first one. The second link has many more videos by Dr. Bill Warner.","post_message":"Tensions are rising on the Mediterranean Island of Corsica, a province of France, where authorities have banned all public protest..."},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"}]
