[{"comment_id":"10150911052459999","commenter_b":"She ain't gonna be there folks - Someone on the DT team has a modicum of intelligence - Trump had an affair with his 2nd wife while still married to the first -inviting Flowers would Gain Hillary a Lot of Sympathy - guess what, it isn't the woman's fault when her husband cheats -Trump is Stupid & his handlers have to keep reining him in - Pitiful","commenter_a":"THE BLACK NARRATIVE IS TO COMMIT \"CIVIL DISOBEDIENCE\" PROVOKE THE POLICE INTO INJURING OR KILLING THEM, THAN SUE TO GET A $$$ SETTLEMENT. MOST ALL BLACKS INVOLVED IN THIS SCHEME HAVE A BLACK LAWYER'S NUMBER ON THEIR SPEED DIAL.","post_message":"Donald J. Trump's team flatly denied that Gennifer Flowers would attend Trump's first debate with Hillary Clinton. Flowers's claims of an affair with Bill Clinton imperiled his 1992 presidential campaign."},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"465186890273018","commenter_b":"This....this is brilliant lol","commenter_a":"No this nation was bast of God an build around it get it right dumbass","post_message":"The Anti-Media radio show is live at NOW! Listen from your computer or phone here: www.UCY.tv/TAMR  Call in and join the conversation: 1-718-717-8296  via Murica Today"},{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"10154083516697541","commenter_b":"She a Dildo lover lol..hahaha","commenter_a":"Hahahahhah! Dildo lover! @username lol","post_message":"Kylie Jenner won't be posting on her own app anymore after an inappropriate message went up without her approval."},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"10153652003074203","commenter_b":"he's going to destroy both political parties!","commenter_a":"Hes for real gonna destroy the republican party... and all of us love him for it","post_message":"One thing is pretty clear: Donald J. Trump isn going away for awhile."}]
