[{"comment_id":"10154678664866037","commenter_b":"#CutHerLoose","commenter_a":"She should stay in jail where she belongs.","post_message":"Tulsa police officer Betty Shelby turns herself in after being charged with first-degree manslaughter — but has since been released on $50,000 bond."},{"comment_id":"10153369808282377","commenter_b":"GOD BLESS PRESIDENT TRUMP...Donald Trump For President","commenter_a":"I guess I am again confused. A few days ago there was a story about Donald Trump giving both Dr. Carson and Sarah Palin a potential job in his administration should he get the Presidency and there was a great cry from many who said \"That is illegal\" Now Cruz names an entire National Security Team and it is OK? I have no problem with either of them talking about their potential teams, I just wonder why Trump's potential plans are \"illegal\" and Cruz's potential appointments are OK?","post_message":"Ted Cruz's national security team includes former Assistant Secretary of State Elliott Abrams, former Missouri Sen. Jim Talent, and former U.S. Attorney Andrew McCarthy."},{"comment_id":"10153448214053984","commenter_b":"That lady has a problem nice in front of kids","commenter_a":"He was absolutely right in what he did. People like her should be called out. They have no respect for any rules, they think they don't apply to them.","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"966234590136262","commenter_b":"Love this, her & Ann Coulter make me sick. Both need to go away","commenter_a":"She is like Ann coulter. Such people must be sentenced for a lifetime. Her intolerance is making me angry.She must be imprisoned.","post_message":"Pope Francis is furious."},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"}]
