[{"comment_id":"1292924254103022","commenter_b":"RACISTS EVERYWHERE! SMDH! HILLARY DOESN'T have to PAY for the BLACK VOTE! RACISTS SHOULD KNOW that by NOW! Lol! She was under PRESIDENT OBAMA! The BLACK VOTE IS HERS from the beginning.","commenter_a":"lets see, hillary was SHOCKED at trumps language 30 years ago and then invites and praises someone who uses language that would even make a sailor blush......shame, shame, shame........disgusting is disgusting is disgusting and TRASH is TRASH no matter who is saying or singing the words.......and hillary not only apparently supports this type of language and music, but invites them to share her state.......so disgusting","post_message":"CROOKED Hillary Praises Cop Haters Beyonce And Jay-Z Who Drop N-Word Bombs All NIGHT! BOYCOTT!!!"},{"comment_id":"656303624531597","commenter_b":"Fuck off bitch!","commenter_a":"What the hell does Mexico have to do with our policies, Take care of your own place and f-off Mexico.","post_message":"Claudia Ruiz Massieu, foreign minister of Mexico, has called on the U.S. to pass a new ban on firearms that she labels “assault weapons.”"},{"comment_id":"651012365080931","commenter_b":"The most Corrupt Woman in the world","commenter_a":"SEE YOU IN PRISON SOON HILLARY = JAIL TIME FOR #YOU !!","post_message":"La decisión que tomemos en cuatro días tendrá un efecto en nuestro país por décadas. hillaryclinton.com/planparavotar  Comparte esto si estás de acuerdo:"},{"comment_id":"10153195780106130","commenter_b":"I'd give her an orgasm!","commenter_a":"Who's the asshole out there denying women orgasms??? Selfish prick!","post_message":"\"Don’t not have an orgasm. Make sure he knows that you’re entitled to an orgasm.\""},{"comment_id":"1272162789512502","commenter_b":"She couldn't pay me enough, so I know Trump never tried. What a wrinkled up hag.","commenter_a":"They were all paid of course","post_message":"BREAKING! Newly leaked information shows Jessica Leads, who's accused Trump of raping her, has VERY CLOSE ties to Clinton Foundation.  This is NO COINCIDENCE! The timing of these accusations with these new facts about Leeds are TOO HARD TO IGNORE!!!!  Let's get 3,000 SHARES to spread the TRUTH about these rape accusations against Trump!"},{"comment_id":"1263663783712155","commenter_b":"Dump her. No more talk about her.","commenter_a":"She's a slut see her tapes she delete the best ones","post_message":"The media's having a field day with Alicia Machado's attacks on Donald J. Trump.  But there's a lot in her past they won't report. And we're not talking about the sex tape everyone else is fixated with..."},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."}]
