[{"comment_id":"10153984542943690","commenter_b":"Stop stealing their land and tell the settlers to gtfo","commenter_a":"he knew the house would be demolished. he was selfish and brought it upon his family. The others thinking of attacking us should see this before they do anything they will regret","post_message":"\"Muhannad was killed but why do you have to destroy a house belonging to six others...what about the children and his elderly relatives?\"   @webpagelink"},{"comment_id":"10154416469089342","commenter_b":"@username deal with it, pussy.","commenter_a":"Rip","post_message":"BREAKING: Former Cuban leader Fidel Castro has died at age 90"},{"comment_id":"519399201582629","commenter_b":"I hope one of hillary Clinton refugees knocks on your front door. . . You will probably be dead after that tho. . . She will continue to destroy this country and you want her to. . . Good job","commenter_a":"To bad his parents and Trump feed the poor kid lies. She has not been found guilty of anything and in this country you are innocent until proven guilty. You need to get of the Benghazi kick. The ambassador's family has come out and said it was not the State Department or Secretary Clintons fault. Grow up people. You would rather have a racists , hatred spewing, women hating asshole in office?","post_message":"BOOM!"},{"comment_id":"10152858682652411","commenter_b":"She should have been tazed!!","commenter_a":"I don't condone what the the officer did but the situation would've been completely different if the little brat did what she was told.","post_message":"Breaking News: The police officer whose video-recorded actions at a North Texas pool party have drawn national attention and comment has resigned from the police force."},{"comment_id":"1038359476176309","commenter_b":"Hope they catch her she is a predator","commenter_a":"Where Racist Al Sharpton? If he is against HATE crimes then why wouldn't he and his Racist organization make a big outcry about this hate crime. Oh! I must be dreaming......... For a racist pig like Al and his followers to make a peep to the news media about such a HATE crime, it would have to be a white on black crime with white police men cheering on the beating.","post_message":"Life in Obama's America  Disturbing video of a white woman (holding her baby) being attacked by blacks, as blacks film and laugh at the attack."},{"comment_id":"10153289049898256","commenter_b":"See? You sound like someone who is over 40.","commenter_a":"Stefan, stop being a dinosaur.","post_message":"And now an important message from Chicago Confidential columnist Melissa Harris:   Please stop putting two spaces between sentences. It makes you look like a dinosaur.  What say you: One space or two?"},{"comment_id":"1085736288142060","commenter_b":"Crazy woman!","commenter_a":"So sick of these lifer politicians & their lies.","post_message":"Nancy Pelosi's pointing fingers (again)...."}]
