[{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"10153153528689071","commenter_b":"You mean in the houses where tragedy still occurred, like drownings, accidental poisonings, falls etc? Not the sharpest tool in Lowes are ya?","commenter_a":"This sort of thing happens less often in houses without guns, but I'm sure that's just a strange coincidence.","post_message":"An awful tragedy happened in Chicago."},{"comment_id":"10153329238969228","commenter_b":"So what Johnny they were here before you were... immigrants.","commenter_a":"A permanent plaque in the public sidewalk for a kid who tried to kill a police officer in broad daylight?! May as well let all the murderers, rapists, and sexual predators go free and give them all a museum!","post_message":"Mike Brown's dad works to remove the memorial in the middle of Canfield Drive in Ferguson.  This would have been his son's 19th birthday.    A permanent plaque will be placed in the sidewalk after a Ferguson paving project.  The objects will be temporarily stored by Urban League"},{"comment_id":"10155066550807994","commenter_b":"White racist people that's who.","commenter_a":"This is how they return the favor for his dream","post_message":"I HAVE A DREAM. Before Martin Luther King Jr. gave his speech in front of 250,000 in Washington, DC - the great American delivered a very similar version right here in Detroit two months earlier. READ & LISTEN:"},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"},{"comment_id":"1003302019710656","commenter_b":"Sure let them get married. Let them suffer like the rest of the world. Oh and wait till they start getting divorced! HAHAHHAHHAHAHA Your welcome ass holes!! HAHAHHAHHAHHAHAHHAHHAH","commenter_a":"It’s My Right To Discriminate Against Republicans Since I Do Not Agree With Their Lifestyle Many conservatives who oppose equal rights for homosexuals do so based on “religious principles.” It’s a defense for ignorance that I always find amusing considering how many “biblical laws” are completely ignored because it would be almost impossible to abide by them. So, I've decided to use this right-wing ignorance to my benefit; I've decided that it’s my right to claim “religious freedom” to discriminate against many Republicans since I do not believe in the lifestyle choice they've made to be bigots. Republican and/or a bigot is a choice After all, in a state such an Indiana (which just legalized the right for citizens to discriminate against people with whom they disagree based upon their religious beliefs), shouldn't people in that state (or any other state with similar laws) then be allowed to discriminate against ...","post_message":"With the arguments for marriage equality heating up soon at the Supreme Court, TakePart.com has a handy \"here's what's up\" article full of background, context, and facts. Yay, learning!"}]
