[{"comment_id":"1030591920403417","commenter_b":"Sorry, obama was a bad idea, and hillary was worse.","commenter_a":"Of course it's not. We knew what he was going to be, but his voters were too stupid to listen. They refused to heed either his own goddamn words, or the words of anyone else saying \"THIS IS A BAD IDEA.\"","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"1713306218956490","commenter_b":"Way to go. Ivanic","commenter_a":"If any women want an equal chance in any profession, then Donald Trump is their man for President. He has given women great opportunities in his businesses. He will create many jobs for all Americans","post_message":"Wow, great response!  Ivanka Trump is pure class."},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""},{"comment_id":"1106803252686150","commenter_b":"She is a LIAR","commenter_a":"How could Trump have the nerve to accuse Bill Clinton of being abusive to women? Just listen to Megan Kelly: \"You called women slut, pig, dog and disgusting animals. How long will America put up with this low life of a man.","post_message":"“I don't really care about the Monica Lewinsky thing other than I think that Hillary was an enabler,” Donald J. Trump said. \"And a lot of things happened that were obviously very seedy, I mean, he was impeached for Heaven's sake!\""},{"comment_id":"10153560600894087","commenter_b":"DUDE ....PAYED FOR? ....REALLY? ....Hillary Clinton is the biggest political whore to ever walk the planet....SMARTIN UP","commenter_a":"Chris Christie is bought and paid for. Don't be surprised when he gets a position in Trump's cabinet. Donald Trump is used to paying off politicians. And some think he will change things in Washington. Lol. What a joke. \"I've got to give to them. Because when I want something, I get it. When I call, they kiss my ass.\" - Donald Trump on giving money to politicians.","post_message":"“Get in the plane and go home,” Donald J. Trump told Chris Christie after the New Jersey governor introduced the real estate mogul at a campaign rally. WATCH:"}]
