[{"comment_id":"10154249002506409","commenter_b":"At the opposite end of the mall where Trump stood you are only able to see 1/2 of the mall. That 1/2 had a crowd, the rest of the mall was sparsely filled but you could only see that from an ariel view. Crowd scientists say Trump's inauguration crowd was half the size of Obama's and they are correct, especially when you compare views of both ends of the mall--anyway--who really cares about this anymore?","commenter_a":"Obama was the first African American president I would expect the crowd to be quite larger for him","post_message":""},{"comment_id":"10153268989822894","commenter_b":"A marriage should have 3 parties involved at all times!! Furthermore, I don't think women will ever understand how men think..ijs","commenter_a":"Y'all are so quick to judge. Giving him passes to cheat, doesn't necessarily mean he has cheated. And because she's allowing him to do it without being affected means that nothing is wrong with her self-esteem. If she just doesn't want to give her man something, then she leaves it up to him to decide where to get it. And who's to say he's making the decision to cheat? I highly doubt if she's allowing him to do it and not caring, then he isn't. That's so not how men work. And to say that they shouldn't have gotten married is stupid because they've been married for a while and I'm sure she has grown to bring about this decision with her husband. And you're not married for sex anyways. LOL!","post_message":"Mo’Nique Explains Why She Gives Her Husband ‘Free Passes’ to Cheat: ‘They May Give Something I’m Simply Not Willing to Do’"},{"comment_id":"10153400875176833","commenter_b":"my Vote WILL NOT BE FOR HER!!! I want to Keep the Constitution. We she get in the white house you can kiss this Country and are Constitution good bye..","commenter_a":"Where's sirhan sirhan when you need him ?","post_message":"Never mind all the rhetoric about how Hillary Clinton can get the Democrat Party presidential nomination because some fringe elements don think she radical enough. The Hill reports that  for gun control [an increasingly fringe group in their own right] have high hopes for Hillary Clinton presidential run, seeing her as  ally who can finish the push for tightened background checks that has stalled in President Barack Obama second term.  Indeed, Clinton has been a vocal gun control supporter for more than 20 years."},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10154689824655575","commenter_b":"get rid of this bitch","commenter_a":"Morons","post_message":"Is Jill trying to keep the money rolling in?"},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"}]
