[{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"\"watching roaches climb the wall, if you called your dad he could stop it all \"","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"10153128310892452","commenter_b":"Go get it. Keep pushing 👍🙏🙏","commenter_a":"People that don't know,.... one word,......Research!!!!! Google it up!","post_message":"Selena Gomez has revealed that she's receiving chemotherapy after being diagnosed with lupus. abc7.la/1P0VU5F"},{"comment_id":"614347815409395","commenter_b":"Easy win! He will roll across her !","commenter_a":"Will she be stoned throughout the debate?","post_message":"Who do you think will win the first presidential debate?"},{"comment_id":"723136044452880","commenter_b":"We've had enough of these bull Shite DEBATE CRAP!! Stop this insanity, who agreed to this shite?","commenter_a":"wont be watching","post_message":"The debate you can't miss.  Watch Thursday, March 3rd at 9p ET on Fox News Channel and stream live on foxnews.com."},{"comment_id":"10154900824501037","commenter_b":"Obama is playing on Americans. He wants to play a nice guy. He knew all powers for executive orders has been striped off him. He wants to turned american workers against trump's adminstration. And gain cheap popularity from clueless workers. Obama's intentions for america is bad. this is just a cover up. Watch out. He will try something like this again even wen he knew that he doesn't have power to do so. Just to make names for himself n pave ways for his wife 2020. Am one person obama can't fool. All his doing is to put trump in a tight corner n make him look like a bad guy. His a hypocrite and no one shud take him serious. Hilary and obams wants to make sure that trump did not succeed.","commenter_a":"I hope this judge dies of pancreatic cancer.","post_message":"A devastating blow to one of Barack Obama's signature achievements for boosting wages."},{"comment_id":"10153793026628010","commenter_b":"@username Try entering Mexico illegally and see what happens","commenter_a":"Most illegals can't come on work permits or marry for papers. Most hope to just work and return home. Lebanese, Greeks, Armenians and Syrians, Salvadorians are fleeing their countries do to violence. Are they criminals for entering the USA, and other countries in order to want to survive? Wanting a better life isn't a crime.","post_message":"It is the fourth immigrant detention facility in the U.S. where protesting detainees have refused food in recent weeks."},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"}]
