[{"comment_id":"613869622133977","commenter_b":"She wants to, if you see the full speech, it is quite clear.","commenter_a":"I didn't vote for Angela Merkel but I have to come to her defence. I don't believe her aim is to discriminate anyone. She is speaking about \"Vollverschleierung\" which means to completely cover the face. I don't think she wants to ban all veils.","post_message":"Elizabeth Plank explains her opposition to German Chancellor Angela Merkel's proposed veil ban."},{"comment_id":"10153329997574342","commenter_b":"Thanks, Becky.","commenter_a":"Great picture Reed","post_message":"What a fantastic photo sent in by Reed W.  It's a shot of the sun coming up over the HPD Memorial.  Reed posted it to honor HCSO Deputy #DarrenGoforth.  @webpagelink"},{"comment_id":"10153523843241323","commenter_b":"Get a gf!","commenter_a":"In good times and bad times ........dick head there is prob shit about you but she's doesn't tell you ! She just except the idiot you are !","post_message":"How do I tell her how I feel without hurting her feelings?"},{"comment_id":"530424503814796","commenter_b":"I'd be out of a job!","commenter_a":"what is illegal is letting ASS HOLE groups like the GAY patriot put their STUIPD SHIT on facebook they should be put in jail for life","post_message":"A popular company is forcing their employees to wear head scarfs.  This has to be illegal.  Would you quit if they tried to force you to wear a headscarf?"},{"comment_id":"1170889439672424","commenter_b":"The people who are fighting for our clean water and sacred burial land i applaud you, it is sad to see once again big corporate doing as they please at the expense of the people and bull dozing minorities but hey this is nothing new when has America respected minorities let alone there rights and means of survival, most of the people apposed to this never lived in a state of emergency where there water was flammable or had to be boiled even places today like flint still have contamination in there water, smh alot of you people need to wake up and realize the treaty(1890s)was broken and that property was not supposed to be sold or messed with but when has the white man ever kept a treaty with the red man.","commenter_a":"Ritini Mahuru Anabelle Palza","post_message":"Activists in Standing Rock, North Dakota were shot with rubber bullets and sprayed with water in freezing temperatures. @webpagelink"},{"comment_id":"10153179280538690","commenter_b":"Learn to convey your thoughts properly before getting all nationalistic. It makes you look even more ignorant than you already are for making such a bigoted comment.","commenter_a":"I think some American got fid up angry because some Muslim in America lived there got passport got education and freedom, then they turn back against Americans burning their flag and terrorizing people.","post_message":"Police have not yet given any possible motive for the attack. The hashtag #ChapelHillShooting  has gone viral, many of the tweets criticising the US and other Western media for not covering the shooting.   @webpagelink"},{"comment_id":"1793385047544902","commenter_b":"@webpagelink wrap.com/trumps-law-firm-won-firm-of-the-year-award-in-russia/","commenter_a":"How are we continuing to allow this to happen? How high a mountain of evidence must be built before someone in charge realizes something has to done to prevent his reign from commencing?","post_message":"You literally can't make this up..."}]
