[{"comment_id":"596781463820482","commenter_b":"IF YOU HAVE A PENIS YOU DO NOT BELONG IN THE WOMAN BATHROOM! GIRLS NEED TO LEARN FOR THEIR OWN PROTECTION TO KICK A GUY IN HIS BALLS IF HE MAKES ANY MOVES TOWARD HER!","commenter_a":"Just asking for big trouble to start","post_message":""},{"comment_id":"1807238972845517","commenter_b":"NEVER GONA HAPPEN !!!!! BTW do any of these people know history???? Do they know that the first slaves were sold by Their own people???? Yes African people sold their own!!!! Now how the fuck.is that anyone's fault but their own peoples????","commenter_a":"We will not pay. No one in my family or ancestors had anything to do with slavery. Enough is enough move on.","post_message":"You May Have To Pay African Americans For Slave Reparations   Come try and get our money.  Will you pay for slave reparations?"},{"comment_id":"10154090084173690","commenter_b":"That will not happen, they will NEVER dominate Europeans. It would take a better class of people than the rough beasts who are now slouching toward Europe.","commenter_a":"Saudi Arabia and other rich muslim countries take in muslim refugees,,,,muslims have a big plan to dominate europ and later force Sharia laws on them","post_message":"Four Balkans countries have announced a daily cap on how many people can pass through and Austria has restricted entry for hundreds of thousands."},{"comment_id":"10152800082481051","commenter_b":"Should have killed the scumbag the first time !!!","commenter_a":"It was a domestic violence crime, that should have kept him behind bars. You figure out why.","post_message":"This guy was released after admitting to stabbing a woman to death in front of her children. Guess what he did one month later."},{"comment_id":"10153378846018037","commenter_b":"Exactly!","commenter_a":"KXAN - you love to get a good argument going, don't you?","post_message":"Did the grand jury make the right decision?"},{"comment_id":"10154258976231770","commenter_b":"@username and for the record we did do something about, we went after the people responsible for it! It just took 10 years because these animals lives in caves, and theses lots of caves over there!","commenter_a":"Trump said he will take care of America first and he is he said he will deport Illegal aliens and he is he said he will bring back jobs to America and he is and he said he will build a wall on our southern boarder and he will !!! AMERICA FIRST !!!","post_message":"\"There are lots of constitutional questions that reasonable people can disagree about. Whether the president can exclude foreigners from seven terror-prone countries is not one of them,\" writes Ann Coulter."},{"comment_id":"611945445596715","commenter_b":"To accept defeat to a liar, who had the questions ahead of time, who has lied over and over - HOW CAN HE ACCEPT IT? I doubt the American's will acept Hillary as president, as they rejected Obama!!!! Voter fraud is alive and well. NO voter ID? Illegals being PAID TO VOTE DEMOCRAT? HARDLY FAIR OR BALANCED.","commenter_a":"Why wasnt it asked to hillary..","post_message":"During the final Presidential debate, Trump refused to say if he would accept the results of the election. Many believe this will threaten the time-honored tradition in which the loser recognizes the legitimacy of his opponents election to office in order for a peaceful transfer of power to occur.   Should Trump accept the results of the election if he loses?"}]
