[{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"602527166571478","commenter_b":"Certain ppl should stop reproducing","commenter_a":"@username fuckin retard","post_message":"So Dumb: She Thought She Found A Hack To Charge Her Iphone!"},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"10153854482548854","commenter_b":"She's shrewish","commenter_a":"I do not know why? But I do not like Fiorina...She looked like a teacher who is lecturing a student. She sound defensive as if she is always under attack.","post_message":"Carly Fiorina Calls Out Clinton And Obama For Politicizing San Bernardino Shooting"},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":" have only been two black winners in the last 20 years for album of the year.\""},{"comment_id":"10153494218169705","commenter_b":"If only we had as much passion directed towards stopping child slave hunters around the world","commenter_a":"Betty is a National Treasure and girlfriend can let loose whenever she wants","post_message":"Betty White has some harsh words for the Minnesota dentist."},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"}]
