[{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"},{"comment_id":"383095042054511","commenter_b":"@username who the fuck needs a third world country when animal whore leaches like u and your mom keep my taxes well spent in my own country. Keep up all the hard work in defending the fucking animals in the post and I'll set aside a little part of everyone of my days providing good reading pleasure for all of the rest of us the know a money grubbing whore when we see one. And u would definitely make a great whore make no mistake. Just like your mom was.... Now go out and b the best whore u can b and quit falling back on my taxes to earn a cocksucking living. Thanks","commenter_a":"Limit welfare to 3 yrs unless disabled. ,quit paying for children to be born with taxpayets money. If you have achild and cant pay uour hospitol bill keep thier tax returns n apply them untill bill is paid off","post_message":"This mother of 12 lives entirely off government benefits. She also funds her plastic surgery with taxpayer money. She makes more per year than most people earn at work annually.  A petition has been created demanding that she get her benefits revoked. Do you support revoking her benefits?"},{"comment_id":"980669235328527","commenter_b":"That is exactly what they should do no money","commenter_a":"I do not know who those three boys are but they sure made me a proud American--What angers me with these Administrators do not care that the cemeteries are full men and women who fought and died for what that flag represents--I with @username","post_message":"Tennessee School District Bans All Flags, Including the American Flag (VIDEO)  @webpagelink"},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"\"Davis is simply wrong,\" lawyers for Kentucky Gov. Steven Beshear said."},{"comment_id":"10153828669523984","commenter_b":"So tell me what religion does rule the world ! Plus most of you are SCARED because you have either been the bully or profited from the bullying of other countries ! Just admit that you don't know how get your power back ! It seems to me that 9/11 made our county a rape victim and you see the rapist in every Muslim ! But we've used the same tactics! Oh , you didn't mind sending missionaries over there to convert them , but we don't want them here, even the ones that became Christians ! We reap what we sowed and you still don't see it or get it ! You can't kill them off . We tried that already ! Change how we deal with them for starters. Or we can squat to their level and try again ! But if you yourself are not going to ...","commenter_a":"I think this is a good example of why not to allow sharia law in the United States. We have our own laws that need to be enforced. When you come here that's the laws you follow. Muslims don't rule the world. Time to set them straight","post_message":"These Muslims were going around burning churches, but they were in for a RUDE awakening when they showed up at this one...  Concerns about Sharia being implemented in the United States have been escalating, do you think we could see this spread to the U.S.?"},{"comment_id":"10156418277360354","commenter_b":"Hey Rhonda! Cool last name!","commenter_a":"Which is exactly why Obama wants our guns...So we CAN'T take them out.","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."}]
