[{"comment_id":"1028079707241669","commenter_b":"Yes oooo. They know what their children are up to. Let the people deport them.","commenter_a":"Damn right.","post_message":"French Mayor Says ‘No More Muslims’, Orders The Destruction Of The Infamous Calais Camps And Expulsion Of Over Seven Thousand Muslims  @webpagelink"},{"comment_id":"10153516025754705","commenter_b":"No wonder you don't have any friends woman","commenter_a":"I hope this creature is captured and eaten by the Japanese","post_message":"What a spectacular creature."},{"comment_id":"10154194496471336","commenter_b":"I don't know about you, but I can read and retain two stories at a time!","commenter_a":"Amazing how this makes news in Canada while 4 people including 2 Canadians are being held hostage by ISIS in the Philippines!","post_message":"VIDEO: Things heated up quickly at the New York International Auto Show when a Porsche 911 Turbo caught on fire. @webpagelink"},{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"10153583217394712","commenter_b":"I'm getting hit with smokers tax and I don't smoke. Time to divorce my wife and let her and kids go on state insurance and I'll pay penalty !! It's the American way.","commenter_a":"Up up and away....the never ending story of insurance rate hikes. We pay. $1200 a month as it is....SMMFH","post_message":"The state's largest insurer says they are dealing with more than $100 million in losses and other issues that have driven up costs."},{"comment_id":"1202995606404444","commenter_b":"Made all her money from being sexy. Buuuuuwahaaaaaahaaa","commenter_a":"Funny how a party girl talks about porn","post_message":"COMMENTARY from Matt Walsh:  “I don’t have my Bible in front of me, but I’m pretty sure Pamela Anderson being accused of puritanism is a harbinger of the End Times.”"},{"comment_id":"10154866849395329","commenter_b":"Becky with the good hair have a stadium full of seats please","commenter_a":"*21 things no one asked for. There, fixed it. *waits for angry Trump supporters to start complaining in the comments*","post_message":"We asked Donald J. Trump supporters to write down a misconception about them and here's what happened."}]
