[{"comment_id":"10153498985924032","commenter_b":"Did these girls post this photo, or did it get posted by the prankster that took the photo?","commenter_a":"Expelled? Yeah, because interrupting what is obviously NEEDED education is the answer here... Maybe they should sue Snapchat as well, because this wouldn't have gotten the attention it did if they hadn't posted it on the app. *insert eye roll here*","post_message":"The petition was started by change.org and already has more than 39,000 signatures."},{"comment_id":"10154746753444657","commenter_b":"@username, while I agree that security along our border is non existent and with the possibility of terrorist using it to their advantage it needs to be dealt with. I think it's a complete fallacy that illegal immigration should be such a focal point in this election. Its not our biggest problem. Our growing deficit and out of control federal government seem to be a bigger threat to our country!","commenter_a":"We are going to loose this election while small minded people focus on small minded things. Stock footage and former adult stars in commercials aren't going to destroy this country the people are! Because they can't seem to focus on the problems we are facing and examine the solutions of the candidates.","post_message":"Oh, the perils of stock footage."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"},{"comment_id":"10153489141693984","commenter_b":"No that bitch crazy","commenter_a":"Hope she isn't elected.....","post_message":"With what we know about Hillary's perfectly planned events, it is not too far-fetched to believe what these people are accusing her of...  Are you hoping all the Clinton controversy will force Hillary out of the race?"},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel.   (via Strange Inheritance)"},{"comment_id":"10154182389496337","commenter_b":"I would totally argue your point...but I have a rule about never arguing with beautiful girls!","commenter_a":"How is that a surprise? He's the most amazing character of all time! The little man casts a very big shadow.","post_message":"THE REAL \"MAIN CHARACTER\" ON Game of Thrones might surprise you..."}]
