[{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"10156346841015725","commenter_b":"Build the wall","commenter_a":"America should close the borders. You do not lock the front door of your house because you hate the people outside. You lock it because you love the people inside. A country's border is its front door.","post_message":"From South Carolina last night- this is what I call a real supporter! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"556548184511652","commenter_b":"You people seriously think our border with Mexico will keep terrorists out? You think that if we can't tell the difference between refugees and terrorists, that we would actually be able to sort them out at the airport? If we didn't want to take refugees we should not have involved ourselves in the war.","commenter_a":"To the people who support bringing in Syrian refugees: Have you ever thought that some of these \"refugees\" could be disguised and actually be ISIS terrorists taking advantage of this situation with a free pass to get here? I think we need to use common sense and take the obvious security precautions and NOT accept these people!","post_message":"My interview last night with Sean Hannity."},{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"10153953951823690","commenter_b":"How can funding settlement building be tax exempt these people are supporting a war.","commenter_a":"As an American, I'm happy to see this. It is long overdue for this to come to light. Being against apartheid SA, then without question supporting Israel is disgusting hypocrisy. That support fuels additional tension between the US and the middle east. It must end and Israel needs to be held accountable.","post_message":"A lawsuit has been filed in a US court seeking to stop non-profit groups from sending billions of dollars worth of tax-exempt donations to support illegal Israeli settlements and the Israeli army @webpagelink"},{"comment_id":"1316090455150672","commenter_b":"Swamp monsters","commenter_a":"tells you a lot about this so called president","post_message":"Truly deplorable.  Thanks to 1533 Days."},{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."}]
