[{"comment_id":"896147533775276","commenter_b":"We Americans are beat. Face it effort to assist citizens verses supposed immigrants (illegal) is futile. We are sold out! The few elite own the few corporations and all are subjects of the foreign owned NON \"federal\" reserve! GOVT benefits were advertised south of the border. The border is not secure. Enforcing US deportation laws are ordered on STANDING DOWN. An increasing invasion of illegal foreigners flock into our nation. So now, the govt is offering huge tax rebates to illegals never having paid taxes! I give up! America can never survive.","commenter_a":"NO I DO NOT AGREE!!!!!!!!!!!!!!!","post_message":"PETITION HERE: @webpagelink"},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"551602895008576","commenter_b":"Every time he speaks I vomit in my mouth","commenter_a":"Obama said on Nation wide TV that the Syrians are like people who came over on the Mayflower. Oh really. We know how he came over. On an elephant from Kenya. Too bad today isn't his last day.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"10153647321457235","commenter_b":"Hide yo wife, hide yo kids...","commenter_a":"Crazy people with guns, what could go wrong?","post_message":"They're advocating open insurrection.   US Marshals are not BLM and this ain't the Bundy Ranch -- and you know what that means?"},{"comment_id":"10153186882059641","commenter_b":"hmmm as long as it's not cooking drugs, printing fake marriage certificates, scamming, and turning young girls into prostitutes... #NOTOXENOPHOBIA AND ALL ILLEGAL ACTIVITIES","commenter_a":"I hope South Africans will not hear this, they will accuse the robot of taking their job and another xenophobia again.","post_message":"This robot chef will soon be able to cook 2,000 recipes. Pity it can’t eat them: @webpagelink"},{"comment_id":"1783407658566153","commenter_b":"Bitch!!! the only ones not giving up their power are You, Hillary, and Obama!! You need to give it up!! You lost!","commenter_a":"\"The biggest way we give up our power is by not knowing we have it to start with.\" --Alice Walker (paraphrased)","post_message":"This week's fireside chat is a call to action. Trump and his allies are trying to block the democratic process and our right to a vote we can trust.  If you are near New York City, join us at Trump Tower on Monday morning at 10 AM to stand up for democracy."},{"comment_id":"10153884646907183","commenter_b":"Why you picking on us white folk here in Georgia? Keep that bitch far away from us!","commenter_a":"Katrina Pierson should be in Milwaukee or Georgia. The media is paid to review everything Trump said and to soil it. They don't care about the real news, another cop assassinated through race- baiting rhetoric from Obama and HRC. Milwaukee is rioting. The streets of Chicago are still killing fields. Clinton is racketeering money through the foundation in pay for play schemes. Yet Ms Pierson has only one thing to do on this Sunday. Find dirt on what Trump said and exploit it. Is this the kind of values we should accept from these UnAmerican sewer-valued people?","post_message":"Did you ever hear of a \"novelty tradition\" in politics?"}]
