[{"comment_id":"916567641696749","commenter_b":"Book should have been titled; Chicken Shit in the Mango Tree. Married 31 years raised by a mother 2X divorced and once widowed. The families do not get over these Selfish POOR ME decisions. Families are for life.","commenter_a":"Why don't you profile some of the people who have not just dumped their inconvenient families? Let's see a profile of couples who have been bored, or \"grown apart\" and worked at their marriages instead of taking the easy and selfish way out. This guy \"gained so much more\" because he cared only about himself.","post_message":"\"I thought 'I have to do this ... it will be horrible for all the people I love most in life. But I have to do it.\""},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"},{"comment_id":"810172682363901","commenter_b":"Send the illegal aliens back","commenter_a":"Illegal immigration is an old problem, the native Americans used to call it \"White People\"","post_message":"It's as simple as that!  www.headlinepolitics.com"},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"10153757259492293","commenter_b":"It's really about saving cash if you don't need boxes remotes and other material it cheaper on your end but much cheaper for them","commenter_a":"Awesome! Tired of the wires and boxes! Yay!","post_message":"This could be a win-win."},{"comment_id":"872563469430677","commenter_b":"2 delightful trolls. Get a life, ladies.","commenter_a":"militant? Lets be honest: muzlim terrorists/murderers","post_message":"A policewoman was killed in a shootout in southern Paris, triggering searches in the area as the manhunt widened for two brothers suspected of killing 12 people at a satirical newspaper. Read more: @webpagelink"}]
