[{"comment_id":"10152890902061336","commenter_b":"Immigrants must obey the law...review history.","commenter_a":"What's wrong conservatives are these immigrants too brown for you?","post_message":"Mexico is now issuing birth certificates at its U.S. consulates so illegal immigrants can avoid deportation."},{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"10153371613511336","commenter_b":"Leave it alone. Enough already!!!!!!!","commenter_a":"REALLY? think theres much better ways to spend our tax dollars","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"1490217797705011","commenter_b":"She's not a Christian,the BIBLE says we will know them by their fruits , her fruit is rotten !!!","commenter_a":"That is because liberals are REALLY, REALLY STUPID!!!","post_message":""},{"comment_id":"1784031898507079","commenter_b":"She is a heartless bitch!","commenter_a":"She still hasn't gone to Louisana like she said she would after the devastation from the recent tropical storm that passed through there . And wasn't it her and her campaign who accused Trump of making Louisana a political stunt when he went to help after? Here she is making it political when it's time to focus on evacuations, preparation and people's well being.","post_message":"As Florida residents prepare for Hurricane Matthew's impact, Clinton buys ads on the Weather Channel."},{"comment_id":"10153836733820950","commenter_b":"You are a sick women. Hope you burn in hell","commenter_a":"Disgusting","post_message":"The mother reportedly removed the infant from the closed fridge after 3 hours."}]
