[{"comment_id":"10156690146685231","commenter_b":"You beating her implies you didn't educated her about her role in society or her worth. Beating her is so drastic & dramatic. Talking & educating her would be much more powerful.","commenter_a":"If that girl were mine I'd slap her into next week but then again no child of mine would refer to herself as meat or be that cheap","post_message":"A high school boy asked a girl to prom with a sign that said, 'I prefer dark meat. Prom?'.... There's some things wrong here."},{"comment_id":"10153745269073984","commenter_b":"that bitch needs to be in prison, hell yeah she and this country need her to just go away.","commenter_a":"Yes. She is wasting our time!","post_message":"A Fox News correspondent just revealed one surprising thing about this Hillary event that you won't see on TV, and it's definitely an embarrassing moment for the Clinton campaign.  Do you think Hillary Clinton should drop out of the presidential race?"},{"comment_id":"509555075871545","commenter_b":"We will never stop fighting for animals! <3","commenter_a":"OMG ! Enough already ! So very very sad...Cruelty to these animals is dead wrong wrong wrong. Aaron for putting this out there for all to see ! Thanks Keep showing everything you can. You are doing important work. This is your real work here on the planet '","post_message":"It takes the feathers of approximately 75 birds who go through THIS to make ONE down comforter.  It's 2016. There is no excuse for this."},{"comment_id":"10152969881283188","commenter_b":"Leave Sarah alone!","commenter_a":"I agree with ya Glenn. Any dog will let you know if they don't like being bothered- for whatever reason. If the dog had wanted to move, he would have done so. Some people just like causing grief for others.","post_message":"On hate and Sarah Palin  In seeing that we have not seen or spoken to one another in maybe two years, sadly, I would not describe Sarah and I as \"friends\".   With that being said, \"lay off her!\"  As a huge dog lover myself, and two dogs that are like members of the family, I know that NO dog is going to lay around or take abuse.   For their dogs to lay down and allow trig to \"use him as a stepping stone\" shows that this dog loves, understands and is one with trig.  What is wrong with people.  Don't you have any cops to shout down, or chant \"kill, kill, kill\" or worse yet, don't you have any cops to gun down and execute in cold blood?\"  Where is the outrage?  Where is the media?  Where is our God?  Forgive me.  I know where he is.  We have exchanged Him for a cheap electronic, silicon filled or Wall Street version of God.     \"The gods of the copy book heading with terror and slaughter return.\"  Look out here they come.  I have been unplugged from the news for two weeks.  As I am making my final leg home with my dogs by my side, I decide that I would catch up on the news only to click on this story on the blaze.  What a mistake.  My wife always says, \"stop looking, it will all still be there in a week or two.\"   How right she is.  Look at what we have become.   Get a life.   Stop hating people.  We are not all going to agree.  As I said, the well between Sarah and I was poisoned by those who wished to control and hate.  I think.  Maybe I did something to poison it myself.  Could be.  I have done stupid stuff in the past without realizing it.  Her, them or me, makes no difference.  History bends toward justice and this it will all sort itself out.   That is okay.  We are not meant to agree nor am I someone that \"needs\" celebrity friends.   She doesn't always agree with me I am sure AND THAT IS OKAY!     I bring this up for all those on the left that think that we are all cut from the same cloth politically or socially.  We are not.   I have nothing to gain politically here, what I do have in common with Sarah is what I have in common with you too ... HUMANITY.    Do we even understand that concept anymore?  This has nothing to do with dogs, and if it does, you don't know what the hell you are talking about.  Maybe you have one of those little purse dogs.  This is a lab.    A boy and his dog.  This is all about hate for the Palins.    What is the meaning of diversity on the planet on which you live?    Sure there are crazy haters on the right and it is up to those who choose to set examples to shun them from our own personal ranks, but Personally, I have found the most violent and hateful are those who preach tolerance.   If you think it is horrible what a little sweet boy is doing with his dogs permission, Let me show you what millions of girls and women are doing to their children in the death camps of planned parenthood,  Black lives matter!   White lives matter!   Blue lives matter!    ALL LIVES MATTER!  I despise what we are allowing ourselves to become.  I will not join any one on this journey to the gates of hell.    LOVE and charity, forgiveness and understanding are the answers.  We all want to belong to something bigger and better than what we currently see.  We want to know we are being heard and can make an impact and we want control of our lives.  No one in Washington, republican or democrat, is helping us build that world.  The parties, universities and the media are shaping a culture of the silence of the lambs.    I reject that view and personally, because I can only effect me and those around me, I will take the beam out of my own eye first.   I have changed how I say and approach much of what I do, with the understanding that tables need to be upturned from time to time, but I will also work to wake those willing to be awakened about who is helping shape this culture.  Defund the GOP.  Democrats, unite.  When you clean out your house and we clean out ours, with malice toward none and charity toward all, we will be on the road of recovery and maybe our children will be able to live in a world where you income, sexuality, gender or political leanings mean exactly what they should mean:  NOTHING.  \"Forgive them Father, for they know not what they do.\" @webpagelink"},{"comment_id":"886419331393489","commenter_b":"Blacks have been raping, stealing and destroying everything they touch as long as they have existed and are still doing it today but t hey also never create anything. If you don't believe it just look at Africa that they are so proud to be from it hasn't evolved much from cave man days. So STFU Othello you racist douchebag.","commenter_a":"First of all not all black people shoot police, you have a bunch of crazy white people you can include, and also rednecks or countrymen use foul language and abuse women so are they considered thugs considering he said what a thug is ?","post_message":"TRUTH"},{"comment_id":"669515329853116","commenter_b":"obama's peaceful religion! muslim Orcs bring intolerance, hate, terror, destruction, and death. The culture and \"civilization\" manufactures nothing else but!","commenter_a":"Just why would you call her crazy. They can flip into terrorism at any time. The parents should not have hired her. Stupid.","post_message":"Russian police arrested the nanny and charged her with murder after she was found at a subway station holding a child’s severed head, yelling \"Allahu Akbar,\" according to reports."},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."}]
