[{"comment_id":"10152942237502452","commenter_b":"My question is.... Wtf was she doing in lake elsinore....","commenter_a":"Why was she in Lake Elsinore?","post_message":"The owner of Wolfee Donuts in Lake Elsinore wants an apology from Ariana Grande after surveillance video allegedly caught the pop star licking doughnuts at his shop. abc7.la/1CqmnVO   Grande also says \"What the **** is that? I hate Americans. I hate America\" when a tray of doughnuts appears in front of her."},{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"10153202617203690","commenter_b":"Stupid girls!!","commenter_a":"We must ask ourselves why and find the antidote. The only way.","post_message":"Security forces estimate some 600 British Muslims have travelled to Syria to join the conflict there, some of them with the Islamic State of Iraq and Levant group."},{"comment_id":"10156554094585615","commenter_b":"what an ass","commenter_a":"He's so wrong. I can judge him too.","post_message":"He calls declaring same-sex couples \"apostates\" just a \"policy disagreement.\" Meanwhile, LGBTQ kids are dying by suicide."},{"comment_id":"10153222485020329","commenter_b":"George Bush","commenter_a":"How come the penis got a fun name but not the vagina???? You're all Sexist Pistols.","post_message":"Urethra Franklin FTW. (A BuzzFeed BFF original.)"},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"10153992023378145","commenter_b":"@username I agree completely!!","commenter_a":"Well, what do people expect when you're in their habitat take awake their habitats?","post_message":"Amazing Rescue: The mom started wrestling with the animal when she saw that her son's entire head was in the mountain lion's mouth."}]
