[{"comment_id":"10154069512515329","commenter_b":"Georgie McCarthy","commenter_a":"That moment in \"Dilemma\" when Kelly Rowland uses excel to text Nelly.","post_message":"\"Life is one big party when you're still young, but who's gonna have your back when it's all done?\""},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."},{"comment_id":"10153252207146509","commenter_b":"Look at yourself and get off your high horse, lady.","commenter_a":"It's only free for freeloaders and illegal immigrants! The rest of us r still going to be up to our eyeballs in debt!","post_message":"President Barack Obama says he'll propose making two years of community college free \"for those willing to work for it.\" Do you agree? More details will be announced Friday: @webpagelink via CNNMoney"},{"comment_id":"1772017636373096","commenter_b":"Women have no business being police officers. Would you give her the Nuke Codes? Imagine Hillary Clinton","commenter_a":"Surrounded by 5 fellow officers? Whatever! You murdered a father of 4 on a disabled Vehicle call.","post_message":"The attorney for Tulsa Police Officer Betty Shelby says she believed Terence Crutcher was attempting to reach into his car to retrieve a weapon. In her interview with homicide detectives, she said, \"I was never so scared in my life as in that moment right then.\""},{"comment_id":"10154173951544199","commenter_b":"I agree.....and you know that kind of thing is coming....gender nutral bathrooms.","commenter_a":"I think this is just another poor choice.If I am going to buy a toy for a child its helpful to know where I'm going.If I want one for my grandson or grand daughter it saves me time knowing which section to go to.Kind of like going to grocery shop and trying to find a specific item but every aisle just says \"Groceries\".","post_message":" change is a step towards removing gender limitations in childhood, but when one of the world largest retailers does this, the ripple effect will be significant."},{"comment_id":"1143390539087332","commenter_b":"#HillaryALLTheWay #HillaryClinton2016 #ImWithHer #MadamPresident #Hillary2016 #OutForHillary #ShesWithUs #WomanCard #StandWithHillary! #TeamClinton #LoveTrumpsHate #Ready4MadamPresident #DealMeIn #GoHillary #HillaryForMe #HillaryForPresident #Rally4Hill2016","commenter_a":"Oh Lisa Lampanelli never fails....","post_message":"LOL! The look on his face is PRICELESS."},{"comment_id":"10154686785341323","commenter_b":"Clarkson and Mary Berry should do a show together. Cut from the same cloth - she's just quieter about it.","commenter_a":"Wells said sir David. We all love clarkson.","post_message":"Unnatural history."}]
