[{"comment_id":"10153953968561491","commenter_b":"@username: get it right. SAD!","commenter_a":"when in the hell? @username @username","post_message":"\"Trump’s message to young people of color is simple: what do you have to lose? In my young optimistic eyes, after the last eight years of the Obama presidency, there is little left to lose.\""},{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"1089996267688050","commenter_b":"A woman who is drugged won't remember being raped. Guess that makes it ok?","commenter_a":"at least we don't remember it","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"1023389334348744","commenter_b":"freaking australia","commenter_a":"How so they come up with 95 millions years?","post_message":"This bizarre species of shark is thought to date back at least 95 million years."},{"comment_id":"1035291306577703","commenter_b":"Science does trump random personal stories. (pun intended)","commenter_a":"I live in Savannah Georgia the South Carolina border is 10 mins away from me, 9 out of every 10 people I meet regardless of sex color sexuality or background supports trump, most support him silently they are not going to run around screaming that they support trump they are not participating in polls their voices will be heard at the ballots","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development.  More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"1558210104487104","commenter_b":"So we fib a little bit.","commenter_a":"Lol BRUHHHHH 😲😲😲 Mike Scott","post_message":"This skydiver performed some of the stunts when Iron Man 3 was filmed in NC. Tomorrow night on FOX, he's performing a huge stunt without a parachute. Will you be watching?"}]
