[{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."},{"comment_id":"1111328388897763","commenter_b":"Grow a set you whinny little pussy!","commenter_a":"In America we all have the right to support which ever candidate we choose! Why be afraid God is on your side! I choose Trump! We have that right in America! I do think the present government in America is creating all this fear and I will vote Republican. If you don't want to abide by our Constitution and Congress Approved Amendments maybe you don't belong in America. IN GOD WE TRUST. WE WANT OUR AMERICA GREAT AGAIN","post_message":"\"I don’t deserve to feel afraid at my school,” said another student."},{"comment_id":"1249235748461513","commenter_b":"Hillary laughed after getting a child Racist off with 2 months served !!!","commenter_a":"In 1978, Bill Clinton violently raped Juanita Broaddrick in a Little Rock, Arkansas, hotel room, then, as he was leaving, looked at her bloody lip and said: \"Better put some ice on that. Corroborated by five contemporaneous witnesses Knowing full well about Bill Clinton proclivity to sexually assault women, about three weeks after that rape, Hillary Clinton cornered Broaddrick at a party and said, pointedly, just want you to know how much Bill and I appreciate the things you do for him. Do you understand? Everything you do. In the early 1990s, Bill Clinton invited a young female staffer to his hotel room at the Excelsior Hotel in Little Rock, dropped his pants and said, it. As CEO of an organization, Bill Clinton had a young female intern just months out of her teens, perform oral sex on him while he made business calls. That girl name was Monica Lewinsky. ...","post_message":""},{"comment_id":"10153002783667522","commenter_b":"She will come back with stilettos and her boobs hanging out.","commenter_a":"Oh Rodney I thought this was one of your favorite shows?","post_message":"It looks like Nancy Drew may be getting the Grey's Anatomy treatment:"},{"comment_id":"1053111538057600","commenter_b":"Both of these mooches need to get out.Better make sure they don't steal anything, like clinton did when she left the whitehouse.","commenter_a":"She looks bored big time.","post_message":"I agree!"},{"comment_id":"843581439108369","commenter_b":"I hope God rolls videotape. I HAVE to see this evil bitch explain this at Judgment Day.","commenter_a":"I hear a lot of people saying that abortion should be legal in rape cases. I tend to disagree. We shouldn't punish an innocent baby because of the sins of the father. I mean how many of us would be here if we were punished for the sins of our mothers and fathers?? Murdering your baby doesn't make you any less raped. My opinion is the morning after pill should be available with every rape kit.","post_message":"What the hell is wrong with this woman?"},{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."}]
