[{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"1697499920518952","commenter_b":"Um that's the point! Either way a wall effects their economy and they don't want it! As far as causing more immigrants to come here, that's the benefit of the wall! How stupid can people to to listen to and believe the lines off bullshit that people like oboma feed us?!","commenter_a":"fuck obama","post_message":"Here ya go...  WATCH:"},{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"10153068348838717","commenter_b":"That is true but we all know she will never be a President","commenter_a":"She's just a Lying P.O.S!!! She will NEVER be a President!!!","post_message":"Presidential candidate Hillary Clinton sits down with Josh McElveen on CloseUP."},{"comment_id":"1783100141966543","commenter_b":"We should build a wall at the California line and put all the liberals in it...","commenter_a":"Wutttt ?????","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"},{"comment_id":"473948236146716","commenter_b":"Go die old bitch","commenter_a":"lost all respect for superbowl....half times and commercials...all just the liberal agenda PU not worth staying up to watch...won't bother with any of the sports hype next yr.","post_message":""},{"comment_id":"10154606331071037","commenter_b":"She will not become president!","commenter_a":"I will wait and see what he does when he is actually president this is just all talk for the votes on both Hillary bringing in all the families from Ferguson and the parents from the Military we need someone to fight for the people not against each other we already have enough of that.","post_message":"“What is Trump? He’s not a Republican. Absolutely not. Those are not the Republican principles. He’s not a Democrat. He is just himself. He is egocentric.”"}]
