[{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"686756008181644","commenter_b":"Yes she is a Scumbag!!","commenter_a":"Yes she is","post_message":"The father of a victim from Benghazi calls Hillary A 'Scumbag' We send our condolences for his loss.  Do you think Hillary Clinton is a scumbag?"},{"comment_id":"1054874157886389","commenter_b":"Well lets start with little jebs mommy! She is one horrible excuse for a human being!!","commenter_a":"whatever happened to divided CHURCH and STATE,,???","post_message":"A Republican strategist had the gall to defend Jeb Bush for supporting the public shaming of women who don't live up to his strict conservative \"Christian\" standards."},{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"10153746116545326","commenter_b":"@username I'm still waiting for the tons of stepford wives to come.","commenter_a":"Lots of bitterness coming from the Sanders.","post_message":""},{"comment_id":"877009682392087","commenter_b":"If you are a salaried worker, no overtime pay. Which means you get a set rate of pay weekly or biweekly and have to work how many ever hours you have to, to finish your job. Whether it's 30 hrs or 50 hrs you get the same pay. It's like that for a lot of managers and supervisors.","commenter_a":"I must be in a bubble, I thought anything over 40 hrs is overtime, I have always been paid time and a half for anything over 40 always. What is it the restaurant businesses? Who doesn't pay overtime?","post_message":"This is HUGE! \"A hard day's work deserves a fair day's pay,\" the President said in his announcement.  Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"899754210061920","commenter_b":"What do you care what she does or has? She doesn't have 2 brain cells to rub together!","commenter_a":"From what I understand, they don't drink alcohol at all. So I don't think she would fit in. Sad thing is that because of the alcohol and drugs she uses, she looks a lot older. I'm actually older than she is!","post_message":"Is Lindsay Lohan converting to Islam?    See what she was photographed holding."}]
