[{"comment_id":"1616592381975838","commenter_b":"THAT WOULD BE YOU SUCKER","commenter_a":"Anytime a socialist, communist and the far-left is aware of someone who can reshape our country to what it once was, scares the hell out of them and will say things like the above. Sanders statement, viewpoints make no sense at all and fail miserably in the arena of logic.","post_message":"Sanders says Trump is \"a pathological liar who changes his mind every single day.\" Agree or disagree?"},{"comment_id":"10153288204601130","commenter_b":"@username And don't even get me started on that bullshit that women think they \"feel free\" because they can hide their faces and bodies behind that stupid piece of cloth. That's not freedom dummies, that's another way of mind fucking, you can also feel free of not needed to know how you look if you spend 40 years in jail in a separate cell where no one will even know you exist.","commenter_a":"He's not holy, no one has ever been a holy person , enough your closed mind religious bullshit.","post_message":"No one rocks a baseball cap quite like the Holy Father."},{"comment_id":"10153011055951336","commenter_b":"He is against us having freedom from OPEC !! We could be self contained and let the Muslims go to being dependent on us !! If no one byes oil from them they are through! OB knows this, that's why he vetoed pipeline 👿","commenter_a":"Job killer.","post_message":"Breaking News: President Barack Obama has vetoed the Keystone XL pipeline bill."},{"comment_id":"416029885255267","commenter_b":"@username why your government killing cows on throw them on street to make violence ?","commenter_a":"If Islam follows their one and only Prophet Muhammad who was a rapist, murderer, and pedophile be peaceful? Remember his youngest wife being 6 and forced to have sex at 9. Please tell to me how this is possible? No jokes or hate being meant just really need answers.","post_message":"For the past 5 months - media poll experts & establishment politicians have predicted that my campaign will fail. As the polls indicate - we are growing, and will continue to do so - thanks to your support!  What else do you think they are capable of under estimating? Terrorism? Threats of cyber-attacks? I DO NOT WANT TO FIND OUT! When I am elected #POTUS - I will see to it that we DO NOT find out!"},{"comment_id":"10153967665463984","commenter_b":"This is one ugly woman","commenter_a":"Consider the source folks. Look what she married. Speaks volumes doesn't it.","post_message":"Michelle Obama took to Twitter over the weekend, and posted a disgusting image that features a U.S. Marine.  This is so typical of the Obama White House, and Twitter users everywhere called her out on it.  It's disgraceful that Marines are treated like this by the family they're there to protect."},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"487160908141156","commenter_b":"Well Boo Fing Whoo you dont Like what she wore . Its Not a Fashion show , and this Women as been through More then I ever Hope you Ball less Lib Media assHoles ever have to go through. Leave her alone.","commenter_a":"Any one that saw the movie must know that we saw just a portion of what This couple meant to each other. We have no idea of what she is going through. Her grief is probably a lot worse than any one can imagine. So do us all a big favor and leave her alone. As far as I'm concerned, it's no bodies business what she wears. I applaud her for honoring him in the way she deams appropriate. He's definitely an AMERICAN HERO. So isn't she. God's Speed to her.","post_message":"Liberals slam Taya Kyle over what she wore, but she's not backing down.  We stand behind the Kyle family 100%. Let's show her our support.  Can we get 20,000 'LIKES' for Taya Kyle?"}]
