[{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"456730087850905","commenter_b":"This is a no-Brainerd! Of course it should be banned!","commenter_a":"Yes","post_message":"Should Shariah Law Be Banned In The US?  Comment 'yes' or 'no'."},{"comment_id":"826467044152094","commenter_b":"Is Hillery totally without fault? Let's look over her speeches. Hillery would say \"WHAT DIFFERENCE DOES IT MAKE!\"","commenter_a":"Give it up Matt . Hey Matt how about Hillary apologize to the American people for all the lies she told and those four dead Americans she left to die in Benghazi 😡","post_message":"NBC's Matt Lauer is still OBSESSED with Melania Trump's speech. #RNCINCLE"},{"comment_id":"10154998158283734","commenter_b":"She needs to be only allowed to Work at a Garbage Dump!! No Place else as long as she's alive!!","commenter_a":"She should get three to fives years of community service clean up","post_message":"According to police, the woman pictured below is accused of putting menstrual blood and saliva on a customer's burger."},{"comment_id":"544054039123949","commenter_b":"Drain the SWAMP","commenter_a":"President TRUMP 🇺🇸","post_message":"REPLAY: Republican presidential nominee Donald Trump at a rally in Tampa, Florida."},{"comment_id":"10153412977987293","commenter_b":"Racist white lady alert","commenter_a":"I've never seen or heard of another president blamed for more things out of their control.","post_message":"It's not like he keeps a dais parked in front of the desk all the time."}]
