[{"comment_id":"1470099699674042","commenter_b":"And your mom should apologise to the world at large. I think you know why.","commenter_a":"Stfu Ryan. You couldn't figure your way out of a paper bag with both of the ends open. You are an embarrassed part in the political arena.","post_message":""},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"550509575137335","commenter_b":"So do it already arrest her corrupt ass because she is dangerous to our society.","commenter_a":"yeah...won't hold my breath !! 'smh'","post_message":"FINALLY..."},{"comment_id":"10153333178554087","commenter_b":"Guess what Kerry illegals have no constitutional right to stay here either.","commenter_a":"Except for a little thing called the Constitution. And laws. I didn't notice the call to shut down churches after the white Christian kid walked into a black church and executed parishioners","post_message":"“Nobody wants to say this and nobody wants to shut down religious institutions or anything, but you know, you understand it, a lot of people understand it,\" Donald J. Trump told Sean Hannity. \"We’re going to have no choice. There's absolutely no choice.\""},{"comment_id":"10154111897691813","commenter_b":"Do illegal aliens have constitutional rights?","commenter_a":"Good to know. But I was told one time, Border Patrol agents can effect a search of your vehicle WITHOUT a warrant, and up to 12 miles from an international border.","post_message":"ICE is targeting families who have fled some of the world’s deadliest countries – escaping persecution and uncontrolled domestic and gang violence. Know your rights.  More information at: @webpagelink"},{"comment_id":"1108180832531570","commenter_b":"You need to get out more, specifically a museum.","commenter_a":"Ppl are quick to doubt things like this but believe whatever Fox News tells them. Meanwhile every civilization that recorded their history speak of giants. How can one make up or imagine Giants without being exposed to them or having seen them? Just like they wrote about hybrid races u think they made it up? Nope I think archaeologists (not all) but as a whole cover things up so they can keep getting funded. I don't by into dinosaurs, I think they are the hybrids ancient cultures speak about but hey if a man in a white lab coat says the grass is really blue a third of mankind would eventually start to see blue too. To each Is own tho","post_message":"A team of archaeologists have uncovered the skeletal remains of a giant in the Bulgarian city of Varna. Located on the eastern shores of the Black Sea, Varna is now a major tourist attraction. The area has a rich culture and its history goes all the way back to 5,000 BC. The oldest golden treasure in the world was found during excavations at the Varna Necropolis and carbon dating revealed it was buried more than 6,500 years ago. Thoughts?"},{"comment_id":"10152920261777014","commenter_b":"White people belong in Arizona, unlawful criminals do not.","commenter_a":"Sheriff Joe is TRYING to do the job he was elected to do. The Feds do not like it !!!!","post_message":"YAY or NAY: Do you approve of the job that Sheriff Joe is doing?"}]
