[{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"10156503411730354","commenter_b":"Obama and Bergdahl both need to be tried for treason, found guilty then shot.","commenter_a":"obama's plan is working.","post_message":"***BERGDAHL AND OBAMA HAVE DISGRACED AMERICA***"},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"1781541005401492","commenter_b":"Praying","commenter_a":":(","post_message":"Live coverage from Eyewitness News: NJ Transit train crashed into the station at Hoboken Terminal.  More details: @webpagelink Photos: @webpagelink"},{"comment_id":"991707680869704","commenter_b":"Sorry ladies - simply not a fan and not willing to jump on her bandwagon because she seems to be the only female who's interested and has the ability to pursue it.","commenter_a":"Wouldn't vote for her if you paid me.","post_message":"If Republicans want to wage a war on women, they'll have to go through Hillary first."},{"comment_id":"541066452731681","commenter_b":"Melania Trump speaks 5 languages and has a degree in architecture and design!!! That sets a new HIGH STANDARD FOR THE FIRST LADIES!!! I LOVE Donald Trump","commenter_a":"If we really get to vote and they really count them correctly, Trump will WIN..... but that remains to be seen. Trump one great American for President ! Go Trump !!!","post_message":"Join us at a TRUMP 2016 Presidential Rally near you! Daily updates at www.donaldjtrump.com/schedule - we look forward to welcoming you! Thank you for your continued support!"},{"comment_id":"1194642483887307","commenter_b":"Still need to deal this evil bitch a Blow","commenter_a":"easy defense... animal was not collared, violated leash laws, and was a threat to their own pets and property.","post_message":"She killed the cat because she believed it was a stray and became a nuisance, but a couple who testified in court this week said “Tiger” was their pet."}]
