[{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"1723525614585873","commenter_b":"Brady Wix Baillee Schott","commenter_a":"Elias Deltoro Ryan Michael","post_message":""},{"comment_id":"483414185182495","commenter_b":"She has NO AUTHORITY!!!","commenter_a":"Who is she- he","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153959431701756","commenter_b":"10,000 troops + ??? = Peace. Duh.","commenter_a":"Sure, send ground troops, take out Isis on a matter of weeks and then... What?","post_message":"Sen. Lindsey Graham says he wants to send in upwards of 10,000 ground forces as part of a coalition to fight ISIS."},{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"},{"comment_id":"10153519151958984","commenter_b":"Leave the park alone, it should be a safe haven for enjoyment; TAKE THE BLACK BITCH DOWN, she has no business being there with that attitude.","commenter_a":"There is so much STUPIDITY in the world anymore. I don't think we should discriminate by race or religion but could we just get rid of the stupid people!","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful.  The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"}]
