[{"comment_id":"507799699345070","commenter_b":"yeah right.there only big when they got a gun...fucking pussy hole pigs","commenter_a":"Anyone who hates the cops is an idiot. It's time the police took some control back","post_message":"I keep hearing about this \"war on cops\". Here is more proof that it is actually a war on citizens, not the other way around."},{"comment_id":"10154426729152446","commenter_b":"Wtf. Who do they think they are. Little unqualified woman","commenter_a":"wth???","post_message":"@webpagelink"},{"comment_id":"1291146050978446","commenter_b":"I really like this nasty woman VOTE BLUE>","commenter_a":"I love Senator Warren! She is a ball buster and has no problem getting her point across. We need more like her in the Senate. Go Elizabeth.","post_message":"She's had it with the hypocrisy and double standards..."},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"},{"comment_id":"1311480565578355","commenter_b":"@username. She in Aussie. This yo opportunity to get rekt by her wrecking ball. Heh.","commenter_a":"Noooooooooooooooooooooo we don't need pollution here","post_message":"Miley Cyrus could soon be calling Australia home."},{"comment_id":"1143371025741432","commenter_b":"Can't stand this big ass getto fat bitch","commenter_a":"Illuminati whore","post_message":"Obama declared her a great role model for children, now Beyonce has released a sickening video.  But the violence and feminism in it isn't the worst part. Look who actually shows up in the video with her..."},{"comment_id":"10156981662980603","commenter_b":"She's a stripper, no joke.","commenter_a":"Obviously this woman is so used to wear no or very little clothes that she sees nothing wrong with that \"outfit\" she wore.","post_message":"Do you think her shorts were inappropriate?   A. Yes B. No C. I don't know"}]
