[{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled.  This shows everything wrong with the entitlement mentality."},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"948811408568971","commenter_b":"so far bro, all i am seeing from you is more words. do you ever do any thing but talk?","commenter_a":"Run for Congress","post_message":"Conservative Sheriff Promises  will fight for your rights.. I will die fighting for the Constitution!"},{"comment_id":"1041402059258074","commenter_b":"But Brandon. . .who do you think PAYS for their jail time? You do and are you willing to pay for all illegal's jail time along with all the criminals we already have in our prisons?","commenter_a":"Why we would give anything to a illgale alien is news to me.don't get me wrong immergration is great if done legaly. All illeagle aliens need is about 5 years in prison then immeaditly deported.","post_message":"Ready for Americans to put American priorities first!? It's that easy!  FOLLOW US!----> Freedom Daily"},{"comment_id":"10153625690231130","commenter_b":"typical black racist asshole!!","commenter_a":"This whole comment thread is a perfect example of what white privilege looks like. If you're white, you have no idea what its like to live in a world where people like you are marginalized. To white people, no nominations must mean that there are no great black movie directors this year. No great black actors this year. No great black actresses this year. In the whole world. But Tom Hanks gets nominated for a movie in which he didn't even talk? GTFOH.","post_message":"Zero actors of color are included in the The Academy's best actor or actress categories for the second consecutive year."},{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."},{"comment_id":"10152713958671051","commenter_b":"Note, Date women closer to your age.","commenter_a":"Be careful in what you want!","post_message":"A 69-year-old man thought he and his 17-year-old girlfriend had something truly special. You can probably guess how this story ends."}]
