[{"comment_id":"10152618671965950","commenter_b":"Don't care about that spoiled rich brat.","commenter_a":"Praying for her .. loved Whitney's music.still love her music.. such a sad time for the.family.. especially Sissy Houston.. God heal Bobbi Khristina.. play her MAMA music. They say that will help. To hear someone they loved voice.","post_message":"Despite mixed reports over Bobbi Kristina Brown's condition, family members ask the public to #StillPrayForBK."},{"comment_id":"1579733685658472","commenter_b":"But let's bring them here, and take our guns.","commenter_a":"If the FBI AND Homeland Security interviewed the shooter 3 times and still let him go, then with those standards how are we supposed to believe that Syrian Migrants are going to be properly vetted and America still be safe?","post_message":"American must now get very tough, very smart and very vigilant. We cannot admit people into our country without extraordinary screening."},{"comment_id":"10153146580383352","commenter_b":"@username she is one lost soul,","commenter_a":"I Pray that evil spirt of homosexuality never come upon my kids, those demons had their way with that young boy, this is sad, when a person is not happy with who The Lord made them, an idol mind is the devil workshop, the devil does not care who he comes after, teach Boys to be boys and girls to be girls., no need to reply to comment with negative remarks, if you don't agree, but this is a sad and ridiculous situation.","post_message":"Suicide note of 17-year-old transgender girl is DELETED from her Tumblr page after her Christian parents demand message blaming them for her death be removed"},{"comment_id":"1790539951180053","commenter_b":"Yes I'm so glad we have had 164 shootings still at war . and trillions more in dept millions more in wellfare a totally screwed up healthcare system. Iran nuclear deal giving Iran billions . can't read it if you don't sign it . let's lie to the Americans because they are to dumb to see it . it was a video we are sorry ,sorry you destroyed our embassy killed raped and mutilated our people. Here is a couple of billion dollars and forget what you already owe us . oh and can we raise the dept drilling again or we won't pay SSI to the people who ducking paid into it . but let's keep those welfare checks going got to keep my peeps happy . get Chicago how are those tough gun laws going , highest rate of gun crime in the country . yup more gun ...","commenter_a":"Thank you GOD for giving us President Obama for two terms!!!!!!","post_message":"Hear that Donald J. Trump? President Obama DGAF about how you describe a terrorist attack."},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."},{"comment_id":"594388797376563","commenter_b":"To all of you saying fair game and all that.... You are no better than the republicans that did it Michelle Obama, you should be ashamed of yourselves","commenter_a":"People of character do not talk negatively about someones' spouse nor kids. End of that discussion. With that said, I sincerely hope Carson never holds any public office at this stage of his life due to what appears to be his deteriorating mental faculties. He is running for president of my country so that is a legitimate comment of my concern of his abilities. This comment does not in any way extend to any members of his family.","post_message":"He's a candidate, so that means she is automatically in the spotlight - but do people really need to be so cruel?"},{"comment_id":"10153154056999087","commenter_b":"I dont believe Obama is favorable in other countries eyes as i have seen some of what other countries say about him bowing to the arab king,,while not saluting our countries flag that many died for.. as far as the immigrant worker.. maybe in yester year they took menial jobs but now i know plenty that take 20,00 hr jobs from americans who are willing to do it...just by being here being here illegally oh and should i mention the illegals get paid cash so most collect welfare and food assistance along with housing , wic and health benefits the whole time....im tired of seeing my fellow americans collect welfare and food assistance cos they cant find a job to support their families.. Being illegal is breaking the law..if they cant follow our law to stay out unless processed properly and not enter illegally do you really believe they will ...","commenter_a":"Donald Trump is on his way to offending every nation, we deal with.... want to really watch us lose our standing in the world? Elect this dufus.","post_message":"\"Negotiating with Japan, negotiating with China, when these people walk into the room, they don't say, 'Oh hello, how's the weather, so beautiful outside, isn't it lovely? How are the Yankees doing? Oh they are doing wonderful, great,' \" Donald J. Trump said. \"They say, 'We want deal.' \""}]
