[{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153226865953132","commenter_b":"He's happy. That's all that should matter","commenter_a":"Sarah Nemes","post_message":"Bruce Jenner's children are rallying around his decision to transition to female."},{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":""},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."},{"comment_id":"10153525058378984","commenter_b":"I I do not believe in Political Correctness, I believe in following and standing for my Christian Convictions, and e e expecting others to respect me and what / how I live, as much as I respect others .... and I do not need the Government to tell me how to do it or try to force me to abandon any part of my faith.","commenter_a":"Frankly I dont give a damn what they say.","post_message":"Wow, I thought I'd heard it all from the politically correct left, until I saw this...  Do you think liberals are getting out of control with their constant censorship of America?"},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"}]
