[{"comment_id":"10154744245648812","commenter_b":"If these thug out moms stop killing their kids everyday in the dam news","commenter_a":"And not one BLM protester was there. It's glaringly obvious that black lives really don't matter to them when it comes to black on black violence and by the way...contrary to popular belief and as told by one of those protesters black on black violence is not a myth, it is real and one should look no further than Chicago to see that black on black violence continues to rise at a rapid rate.","post_message":"Chicago saw its bloodiest month in two decades this August, with 90 murders, 384 shootings and 472 total shooting victims."},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the \"alt-right\" in a speech on Thursday."},{"comment_id":"549469748549029","commenter_b":"That's y he got molested in jail for being a fucking bitch... Some1 should at least throw some boiling water on him so he can see how that feels","commenter_a":"Ryan Smith","post_message":"Heartless: Scumbag Throws Boiling Hot Water On A Cat!"},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"10155994061055354","commenter_b":"I'd really like to know what these morons see in this group that would make them leave the US ,.and join a group who sodomizes little boys and rapes little girls, kills anyone who disagrees with them and thinks they are right. ?","commenter_a":"She had a hard time deciding join isis or black lives matter! It's pretty sad to see the kind of warped minds our society is producing another lost soul gone to waste!","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS.   Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"1205517149514372","commenter_b":"Go away, Racist, Tax Evader, Liar, Sharkton! No more White House Visits! Hopefully Sharkton and Hillary share the Big House soon!","commenter_a":"Loser!","post_message":"Rev. Al Sharpton warned that \"all that many of us have fought for all our lives is at stake\" following Donald Trump's victory in the presidential election and vowed that \"we are not going down without a fight and Donald Trump needs to know that.\""},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"}]
