[{"comment_id":"10153076081181051","commenter_b":"Bitch go kill yourself","commenter_a":"It's like being at the zoo when a monkey wants a banana","post_message":"When this woman found out the store was out of Skittles, she snapped."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"1462621683757857","commenter_b":"Facts !!! What a joke, just like her supporters...zombies","commenter_a":"CLINTON IS THE WORST THING FOR OUR COUNTRY.... LYING HILLARY","post_message":"They haven't voted for a Democratic president in two decades or more."},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"10153639666243138","commenter_b":"You, m'dear, are brilliant. Wish I was a Floridian.","commenter_a":"Since we have Debbie Wasserman Schultz to hold to the fire for unfairly slanting the elections, I thought it might be productive to take her to task and donate to her democratic rival in Florida's 23 district Tim Canova. Knock her right the hell out of her seat in congress. Might wanna throw him 5 bucks and help him send her packing. It matters.You don't have to live in Fla to donate, it affects us all. @webpagelink #TellHimBernieSentYa","post_message":"I'm not saying Donald J. Trump won by appealing to the KKK, but if the hood fits…"},{"comment_id":"1219218918112237","commenter_b":"This is how Clintons work! So illegal!","commenter_a":"THIS PERSON NEED'S TO RESIGN IMMEDIATELY,BILL CLINTON HIRED HER TO WORK FOR THE DOJ WHEN HE WAS PRESIDENT.DO YOU THINK THERE MIGHT BE LITTLE THANK YOU PAYBACK.","post_message":"The DOJ is still investigating Hillary Clinton for possible criminal wrongdoing regarding her private email server, so why would Attorney General Loretta Lynch meet privately with former President Bill Clinton?"}]
