[{"comment_id":"798433503628356","commenter_b":"What the hell is wrong with women???","commenter_a":"Well said Kimberly!","post_message":"Hundreds of thousands of Americans are marching on the streets of the nation's biggest cities for the Women's March"},{"comment_id":"10154506279023812","commenter_b":"Lana Mushamel Rico","commenter_a":"Rip Rico!","post_message":"Marine combat dog that served two tours in Afghanistan and went on 240 missions is laid to rest. RIP Rico."},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"10154400338828812","commenter_b":"what a fking con artist","commenter_a":"Box of chocolates. Gump trump","post_message":"Donald J. Trump continues to refuse to release his tax returns and declines to reveal his tax rate. “It’s none of your business...you'll see it when I release but I fight very hard to pay as little tax as possible.”"},{"comment_id":"842473555789986","commenter_b":"Why doesn't she leave planet earth!","commenter_a":"And the bad news is what?","post_message":"She's gone."}]
