[{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake?  Only if you like to have fun..."},{"comment_id":"846989298730657","commenter_b":"I thin Aaran Afalava needs to do some homework about the way marriage has been done in the past.","commenter_a":"Why is this so special? My parents were together for 57 years...... If lesbians and gays want to be treated like everyone else why do they (and you) feel that everything they do is a milestone, or 'historic' or ...something! If they want to be treated like everyone else then they need to quit acting like they are something special.","post_message":"\"People seem to understand our relationship with no difficulty at all. They seem to know what we want them to know, which is that we are a loving couple, living a normal, happy life, just as we hope they are.\"  - Lennie Gerber and Pearl Berlin"},{"comment_id":"748124945338392","commenter_b":"Ima start fukin new bitches","commenter_a":"Kisses from Mar del Plata!","post_message":"We're less than 5 days away!"},{"comment_id":"10153110276422550","commenter_b":"No she has make up in the first picture","commenter_a":"Two different people...","post_message":"\"If anyone needs a little motivation to not lay in the tanning bed and sun here ya go!\" A 27-year-old mother hopes her graphic selfies of painful skin cancer will serve as a warning for others. Her story --> @webpagelink"},{"comment_id":"880395268723393","commenter_b":"She was armed with a deadly weapon. I hope she suffered.","commenter_a":"She was probley scared when all those security came at her with guns drawn thats why she tryed to move the car. Hands on steering wheel not reaching for wepon. They didnt have to shoot her.have you noticed all the killings for petty crimes like selling cigerettes, stealing a pk of cigerettes. Being homeless, even jaywalking or talking back to police. This is not a good situation. Real criminals who rape and torture getting away with it because the police would rather arrest or kill someome who is not a threat. I am ashamed of the police who do these things and the other cops who watch and do nothing and of the law that always finds brutal cops innocent. I am afraid of the police many people are. Since when should we pay for a legalized brutal mob. May god help us","post_message":"New details emerge about the 2013 shooting of an unarmed woman on Capitol Hill."},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."}]
