[{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"},{"comment_id":"10155498405191729","commenter_b":"That's where he belongs. Back stabbing ungrateful dodo.","commenter_a":"Eeek. What ticket would he be on? Dem?","post_message":"Interesting..."},{"comment_id":"10156399276440354","commenter_b":"What are you a freaking psychic? How would you know who is Christian?","commenter_a":"Man look all this Christian compassion.","post_message":"Ex-porn star Bree Olsen: \"It's bulls**t.\""},{"comment_id":"10153660041871770","commenter_b":"Shes a idiot to.like we care what a gold digger has to say oh she fits in with crooked Hilary","commenter_a":"Who cares care","post_message":"What?!"},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, \" For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.\" ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves\" There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"430432623811698","commenter_b":"Soon Obama can seal the new border and Mexico can deal with these ingrates..LOL","commenter_a":"more obama (gov't) bullshit!","post_message":"BREAKING..."},{"comment_id":"10152906505382169","commenter_b":"Fascist pigs always think they'll be spared by the police state for being boot licking authoritarians. Never really works out that way though.","commenter_a":"America is a complete mess right now because of the Flower Power Generation, Obama, and liberal lunatics. Way to go, @username, just fanning the flames even more with this story. I'll be glad when the Flower Powers die off and we can have America normal again.","post_message":"TONIGHT: Return to the most divisive moment in American history since the Civil War, and witness the mayhem that followed the Kent State shootings.   THE DAY THE ‘60S DIED airs at 8/7c on PBS as part of a special programming block commemorating the Vietnam War. #VietnamPBS Learn more: @webpagelink"}]
