[{"comment_id":"10153369808282377","commenter_b":"GOD BLESS PRESIDENT TRUMP...Donald Trump For President","commenter_a":"I guess I am again confused. A few days ago there was a story about Donald Trump giving both Dr. Carson and Sarah Palin a potential job in his administration should he get the Presidency and there was a great cry from many who said \"That is illegal\" Now Cruz names an entire National Security Team and it is OK? I have no problem with either of them talking about their potential teams, I just wonder why Trump's potential plans are \"illegal\" and Cruz's potential appointments are OK?","post_message":"Ted Cruz's national security team includes former Assistant Secretary of State Elliott Abrams, former Missouri Sen. Jim Talent, and former U.S. Attorney Andrew McCarthy."},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much \"Southern heritage,\" why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"1026595164030198","commenter_b":"what was this brain dead bitch watching????","commenter_a":"A dues paying member of the old hag society.","post_message":"When did Andrea Mitchell become an official spokesperson for Hillary Clinton?"},{"comment_id":"10153087285766491","commenter_b":"Hilarious female!","commenter_a":"Stop talking about her. Shes not funny get over it. Stop trying to make her famous by shoving her down our throats","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"10154039827188984","commenter_b":"I hope it was a woman that pulled the trigger","commenter_a":"I am so grateful to my Lord that I do not have to live in a war torn place like this... never feeling safe and never knowing when you went to market if a suicide boomer was going to show up and kill you and others!! Never knowing when you rhusband was going to demand sex or molest your little daughter!! What a horrible life that would be!","post_message":"This terrorist fighter was excited to show off his machine gun skills to his buddies.  He stepped out beside a building, started to open fire, and then there was a CRACK followed by a dull thud."}]
