[{"comment_id":"10154580142688132","commenter_b":"Me too! Those hot mamas work for those bodies!!","commenter_a":"I personally loved it","post_message":"Fergie is making a statement!"},{"comment_id":"1760785597541885","commenter_b":"Yes I believe","commenter_a":"Yes","post_message":"VIA : God Is Love"},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show.   Read more about the case here: @webpagelink"},{"comment_id":"884069771715072","commenter_b":"Remove the traitor ASAP !","commenter_a":"Yes.","post_message":"Obama Announces DEVASTATING Executive Order Right Under All Of Our Noses.  He is completely abusing his power.  Do you think Obama should be removed from the White House?"},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"},{"comment_id":"10153416828258525","commenter_b":"Sure hope he's single so girlfriend or wife don't wipe him out and leave him with nothing JS","commenter_a":"Paige Zirkle Calhoun","post_message":"$2 MILLION FLORIDA WINNER: Not only did the Sanford teenager match all five numbers, it was his first time playing and he used a play slip that he found that was already filled out!  STORY: @webpagelink"}]
