[{"comment_id":"1754978767895197","commenter_b":"Trump going to build that wall around your house.","commenter_a":"good lord, no tact at all. Biggest moochers on the planet, biggest joke presidency. Not enough he more than doubled the national debt, now in his mere final weeks, they go ahead and keep living high on the hog. Trump was not my pick among GOP candidates, but doing this stuff for 8 years while telling successful hardworking citizens ,\"you didn't earn that\" or \"some folks are going to have to give up their piece of the pie\" really screamed to everyone on how we don't want this again.","post_message":"Aloha Obamas!"},{"comment_id":"10157991607240354","commenter_b":"Get them out of our country!!!","commenter_a":"Can't wait to have Trump in the White House soon enough. Obama and Hillary both want to stuff America with these sexual Islamic deviants in thousands. #SaveAmerica #VoteTrump","post_message":"Had they not been allowed in the country, it never would have happened."},{"comment_id":"1275227535851049","commenter_b":"she can go back to sleeping with cruz! lol","commenter_a":"When he loses, I hope this woman just disappears into obscurity, and gets to feel what it's like to be left behind by Trump. She's an ignorant tool.","post_message":"She had a meltdown after the host repeated Trump’s words verbatim."},{"comment_id":"10153589847823984","commenter_b":"I'll help her pack to get the hell out of America! What a twit...","commenter_a":"If she is on welfare take her check and benefits away. Then make her do community service cleaning the toliets in a national park.","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"999642010128853","commenter_b":"Close the border! People that come to this country should not try to change it to suit their needs / religion. When they come here they should accept our customs and laws. If they don't like them.STAY THE HELL OUT! simple!","commenter_a":"Bullshit","post_message":"EVERYONE needs to keep this in mind tonight."},{"comment_id":"10154523076746028","commenter_b":"Milo is trash","commenter_a":"And most of you laugh when our president calls all of the BS networks and papers \"fake news\"!","post_message":"Eek."},{"comment_id":"1404176169614167","commenter_b":"We disgusted to look at you and your ugly ass fucking husband !!!!!","commenter_a":"Not sure who you are polling.. please tell me why democrats lost so big this election... because people were disgusted with her and her husband!!","post_message":"Michelle Obama continues to rank as one of America's most admired First Ladies. Do you admire her?"}]
