[{"comment_id":"10155763487209951","commenter_b":"About time our officers and first responders have someone who supports them, instead of condemning them before the whole story is revealed. Thank you, President Trump!","commenter_a":"Umm gun control. Might help with that","post_message":"WATCH LIVE: President Trump speaks to top police chiefs and sheriffs at the Major Cities Chiefs Association conference."},{"comment_id":"10154593290916037","commenter_b":"Kick all them illegals out!","commenter_a":"it is what he has always said, just all the words are different now","post_message":"Christie highlighted that Trump has said undocumented immigrants will not be eligible for citizenship unless they leave and re-enter through legal channels."},{"comment_id":"10154068476123717","commenter_b":"The tea party and Republican Party are two separate entities","commenter_a":"That's because Hillary best represents the ideals of Reagan-era Republican Party. Trump represents the modern-day teabagger nutjob Republican Party. All the corruption and lies of the former with half the brain cells.","post_message":"It may surprise you, but George Bush Sr. knows who he is voting for come November, according to a Kennedy: @webpagelink"},{"comment_id":"10153777739548690","commenter_b":"But the don't need people like you black monkey","commenter_a":"Long live Israel long live the Jews... I just wish i was an Israelite so i can walk into the occupied west bank and tell those occupying Muslim extremist that God gave that land to the Jews... Jews fight for their right...i love the Jews with my life. God bless Isreal.","post_message":"Inside Story: Israeli government leaders have repeatedly said they don't want changes at the Al-Aqsa Mosque in Jerusalem.  Israel is also accused of funding groups advocating major changes to who can pray at the sacred and sensitive site in Jerusalem.  What are the implications of Israel action? And with growing discontent in the occupied Palestinian territories, is it a recipe for more unrest? @webpagelink"},{"comment_id":"1120776417932667","commenter_b":"Whoop-te-do! What an earth-shattering piece of news that is! One loser endorses another loser... ho-hum.","commenter_a":"the end of Jeb","post_message":"Lindsey Graham endorses Jeb Bush for president"},{"comment_id":"10153869125358812","commenter_b":"Why are Christians punished for praying. No one says others have to follow.","commenter_a":"Wow","post_message":"High school football coach suspended for praying at games attends as a spectator while  Satanists gathered outside of the stadium: @webpagelink"},{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"}]
