[{"comment_id":"946732062040088","commenter_b":"Right. Because all those women raped enjoyed it. *eyeroll*","commenter_a":"If you don't want to get pregnant that is a choice. If you don't want to get pregnant, don't have sexual intercourse. There's other ways to find physical satisfaction than sexual intercourse & they won't create a baby. Abortion IS NOT a means of birth control. It's murder. For those who are for abortion as a woman's choice, what about the choice of all of those female babies that have been aborted?","post_message":"So true."},{"comment_id":"1271510422882923","commenter_b":"Momma ain't raise no bitch","commenter_a":"I love how everyone says stop snitching but if he/she dosnt snitch he/she could go to prison as well for withholding information. I dont give a fuck my freedom is worth more then their freedom sorry not sorry. *Heres a little side note i have an extreme case of dyslexia so if my grammar is terrible i apologize *","post_message":"\"What r u going to gain from it\" "},{"comment_id":"10158335910850389","commenter_b":"California LARGEST INSANE ASYLUM IN THE WORLD Written by Chuck Garner on January 23, 2017 6:00 am - Interesting that the LA Times did this. Lou Dobbs reported this on CNN and it cost him his job. The only network we would see this on would be FOX. All the others are staying away from it. Whether you are a Democrat or Republican, this should be of great interest to you! Just One State be sure and read the last part try for 3 times. This is only one State If this doesn open your eyes, nothing will! From the L.A. Times. 1. 40% of all workers in LA County (10.2 million people) are working for cash; and not paying taxes. This is because they are predominantly illegal immigrants, working without a green card. (Donald Trump was right) 2. 95% of warrants for murder in Los Angeles are for illegal ...","commenter_a":"\"Alternative President Donald J. Trump\" you've been in the The White House only a week and already you're a total failure and made a complete fool of yourself so no wonder you LOST the popular vote and had such a SMALL crowd at your inauguration....by the way Mr. Alternative President you are delusional and need mental health treatment so please get some professional help before your words or actions are responsible for killing people....","post_message":""},{"comment_id":"10156171659485354","commenter_b":"Get the f away from American . I brought my religion to this country !?? I keep mine in side , Don't wear that ugly scary thing over your face !!! That scares me wear it inside or with you groups . You weren't born with it you're gonna die for not wearing it !?? I don't I promised to accept and care for what was in America . I ve got to see with my eyes . It is deadly scary to me , can't be around them .","commenter_a":"It was a fake bomb the next one won't be if that was a white kid he would be jailed you can't even point your finger because it represents a gun and you get kick out of school. So what gives with this","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"10153239066656491","commenter_b":"No he wouldn't lol. Hagrid wouldnt be close to slytherin","commenter_a":"All muggles should be sorted to Hufflepuff.","post_message":"J.K. Rowling isn't afraid to tell Harry Potter fans when they're wrong."},{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."},{"comment_id":"10153161344347507","commenter_b":"with balls like that, she is a man","commenter_a":"Maybe she'll find same sex love in jail and change her tune","post_message":"If she didn't want to do the job she was elected to do, why is she still there?"}]
