[{"comment_id":"10153900355041378","commenter_b":"They are all crooked! This is what happens to women who try to play (and cause trouble) in the all boys club that is politics.","commenter_a":"Clinton should of appointed her to be her VP","post_message":"#BREAKING - One day after she was convicted of perjury and other offenses, Pa's Attorney General answers calls for her resignation. @webpagelink"},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"},{"comment_id":"657334997759787","commenter_b":"The key is this. Why was he walking away from the officer with his hands up? Then going for the door of his vehicle. Also they dispatched a helicopter to the scene well prior to the shooting. There is way more than the media is showing.","commenter_a":"Cop should get the chair for this shit","post_message":"In a video, an unarmed man is seen walking with his hands up. Moments later, a police officer shoots him."},{"comment_id":"909807282450701","commenter_b":"Great place for a Drive By Shooting!!","commenter_a":"- Funny, they don't look like brothers.","post_message":"Who paid the bill?"},{"comment_id":"10153389617181509","commenter_b":"Tell the pigs this same info.....they dont seem to remember the law and if they need it,give them your info and have them subpoena it...like theyre legally required to do","commenter_a":"No Law or Rule against. As some police assume?","post_message":"A growing number of people are turning their cameras on cops. You can learn more via CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat"},{"comment_id":"517056128505278","commenter_b":"@username I'm pretty sure much of what you typed is not true.","commenter_a":"Hillary should be forced to work as the next ambassador to Libya. She can hire the Mexican drug cartels as her security since Obama armed them better than he did our embassy in Benghazi.","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."}]
