[{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think \"Womanwhining\"","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term \"manslamming\" comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."}]
