[{"comment_id":"10153171709824456","commenter_b":"HISTORY","commenter_a":"I am so glad I took part in history glad to be a Masonic brother","post_message":"The march to Montgomery is underway...  @webpagelink"},{"comment_id":"10153185005136323","commenter_b":"@username how can you possibly call immigration colonisation? I am an immigrant to this country and I have no intention of imposing my way of life on every person living here or subjugating the \"indigenous\" people of this land. I think I can speak for the vast majority of immigrants in saying that they also do not intend to do so. Most immigrants integrate into society. Perhaps you just don't like the way they look like. As was stated before, Britain is 85% white. All these people fearing that this country is swamped by brown and black people, Eastern Europeans and other pesky foreigners need to get their facts together. Moreover, study after study has proven that immigration is indeed beneficial to the British economy. We may also not forget that Britons emigrate to other countries in large numbers. This is not a one way street. Immigration is part of ...","commenter_a":"For a country whose language is a mix of old german, latin and celtic language, i'm laughing. In the past, Brits never had any issue with colonizing Australia our the US and imposing their culture (or \"civilization\") to the native populations. That's so ironic !","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"549294818565391","commenter_b":"Its not a womans choice to kill an unborn child if you dont want a child dont have sex its that simple","commenter_a":"It's each woman's choice.","post_message":"Today marks the 43rd anniversary of the Supreme Court's decision in Roe v. Wade. On this somber day, I know it's difficult not to be discouraged that the Supreme Court's decision in Roe still stands. But now is not the time to give up. We must work together to continue promoting a culture of life in Arkansas and America. Read more:"},{"comment_id":"10153884127193854","commenter_b":"I do not now abut you ..but me ? I am jew ...","commenter_a":"One day Michael Moore you're going to get what's coming to you youre a evil lowlife person and disgusting and Stephen Colbert had you on his show last night I wouldn't watch that democratic hypocrite of a show","post_message":""},{"comment_id":"10153006139081602","commenter_b":"I think it would help lessen the burden on other welfare programs, if some benefit recipients were getting educated and coming off programs.","commenter_a":"Better to pay for this than all the bums on welfare and any state run handout that people take advantage of.","post_message":"Two years of community college could now be free for all, according to a plan President Obama is scheduled to propose Friday."},{"comment_id":"10153324817246523","commenter_b":"And this is only the beginning of another year in Wisconsin.","commenter_a":"Oh people quit ur whining an complaining! It's sickening! It SNOWS every year, this is nothing new!!! Blah, blah, blah!!!","post_message":"NEW: We're been upgraded to a winter storm WARNING in southeast Wisconsin."},{"comment_id":"816614281820679","commenter_b":"You have got to be kidding 49. Unbelievable! Evil surely takes its toll. She looks horrible. I am older than her!","commenter_a":"Can you believe the skanky crack whore, also known as KellyAnne Conway, is only 49? She looks like she is late 60's or early 70's... This is the toll that selling your soul to the devil will take on you!","post_message":"She did sell her soul to the Devil, after all."}]
