[{"comment_id":"1759120751072019","commenter_b":"I don't want refugees coming in and I want Muslims out","commenter_a":"Wear a Make America Great Again hat! Fuckem!","post_message":"This was powerful!"},{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights \"Freedom of Religion\".","post_message":" girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.\""},{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"\"I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.\""},{"comment_id":"1116694178387110","commenter_b":"Jim Kelley who's disingenuous now? Context is everything, two debates are scheduled during major NY sports team match ups. The other during his good morning America interview.","commenter_a":"Bernie is not even registered as a Democrat. He is just running on the Democratic ticket for funds and benefits. He should have run as a socialist, Oops, I mean Independent. Hillary 2016","post_message":"Hillary Clinton cree que la educación es la clave para salir adelante. Lee el artículo."},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"},{"comment_id":"10153162026679091","commenter_b":"Stephanie, he wants ILLEGAL immigrants gone. And Americans have been doing just fine before the influx of Mecican Illegals before and will after!","commenter_a":"He'll be crying when there is nothing for him to eat because its the immigrants that work the field for our food, and run our plants that provide our meat. He wants immigrants gone, he should be the first to leave. Give this land back to native American people, the earth was pure and clean. Be a leader Trump, lead yourself out","post_message":"Donald Trump has released his specific plan for immigration reform: @webpagelink"},{"comment_id":"10153475591131051","commenter_b":"What a real sick bitch needs to go down for good she dont need her other kids go down bitch","commenter_a":"Prayers for that baby girl","post_message":"When residents here stumbled across an alcoholic mother trying to eat her own daughter alive, they decided to handle the situation personally."}]
