[{"comment_id":"10153906190670667","commenter_b":"Neither Chelsea, Hillary, or Bill receive a salary from the Clinton Foundation.","commenter_a":"Clinton Charitable work done in house? Don't you mean Charitible to the Clintons, with Chelsea receiving hundreds of thousands of $$ as an administrator? Gee Ya got me there Sparky!","post_message":"Mike Pence claimed that “less than 10 cents on the dollar in the Clinton Foundation has gone to charitable organizations.” That’s misleading. @webpagelink"},{"comment_id":"10155056114144749","commenter_b":"hoorah!","commenter_a":"Good review worth reading.","post_message":""},{"comment_id":"10154966388510329","commenter_b":"She tried to eat my tuna pasta wee bitch","commenter_a":"@username I hope you make nice pals like Pippa 🐶","post_message":"Good girl, Pippa."},{"comment_id":"524375314431275","commenter_b":"She is a disgusting human being.","commenter_a":"Lord what a pig.","post_message":"President Bill Clinton's accusers are publicly condemning Joy Behar for calling them \"tramps.\" @webpagelink"},{"comment_id":"959675597399526","commenter_b":"Hillary 2016 Hillary 2020","commenter_a":"Hillary!","post_message":"It sounds like voters have already decided who they are going to vote for in the presidential election. Have you?"},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"1765015350452806","commenter_b":"This tells the whole story.","commenter_a":"Why can't people understand that the Clinton's are career politicians who amassed millions for themselves while being public servants and working in government? While working \"supposedly\" for we the people, they became millionaires. The same group of 1%s Hillary rallies against she is card carrying a member of.","post_message":"Don't let U.S. Senator Tim Kaine fool you -- the Clinton Foundation is a bastion of corruption."}]
