[{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"@username Jeff Smolen @username lmao","post_message":""},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"10152856733741051","commenter_b":"Cheryl, get real, freak!!","commenter_a":"He is a Race Baiter distracting from what he is secretly doing to America. His agenda is clear to me, DESTROY AMERICAN FROM WITHIN!!!","post_message":"President Obama hopes that Wednesday night's shooting of two police officers doesn't distract people from one really important fact about Ferguson."},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink   THIS is why they swim in circles in their tanks.   The chart at 0:20 seconds explains it ALL."},{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"10153428324682293","commenter_b":"Yes but she identify as female sexually fluid","commenter_a":"My daughter is sexually fluid, she identified herself as a lesbian during high school years and she wasn't allowed to have girls sleep over ( unless they were childhood friends), my other two daughters were not allowed to have teenager males sleeping over.","post_message":"\"I wouldn’t have dared bring a boy into my room while I was in high school. Do the same house rules apply to same-sex relationships?\""},{"comment_id":"1277154398974272","commenter_b":"How does she keep getting elected ??","commenter_a":"Liberal Ass Clown","post_message":"Remember that time Nancy Pelosi reassured us that Obamacare was going to be \"affordable?\""}]
