[{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":" need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year?   Watch live: @webpagelink"},{"comment_id":"798433503628356","commenter_b":"What the hell is wrong with women???","commenter_a":"Well said Kimberly!","post_message":"Hundreds of thousands of Americans are marching on the streets of the nation's biggest cities for the Women's March"},{"comment_id":"697111387146106","commenter_b":"Go get them","commenter_a":"Unleash the Donald","post_message":"Donald Trump says he would bomb the sh*t out of ISIS during speech.  You have to watch this. He is absolutely right.  Do you support Donald Trump?"},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"10153161008224087","commenter_b":"Yvette Eva Hirsch. Where does everyone come up with this comparison? Hitler wanted to kill any non white people. If you weren't blonde haired with blue eyes you were killed. And even then if you meet that criteria and a Jew you where still killed. Trump wants to build a wall and establish a true border which should have been done long ago. He wants to have illegals leave. They are illegal after all and by the current laws shouldn't be able to work due to its illegal to employ a illegal. Notice there is no killing, no rounding up of people based on race. Mexico's constitution doesn't even allow citizens from Mexico to be given citizenship to a child born in another country citizenship in that country. This all started when everyone stopped trying to offend illegals by calling them UN documented to make it sound better. The fact ...","commenter_a":"Maybe the establishment should sign a pledge to treat him fairly, and honor the will of their base!","post_message":"Donald J. Trump said that if he signed the pledge not to run as a third-party candidate, he expects to \"go up 10 or 15 percent\" in polls."},{"comment_id":"10153408271028338","commenter_b":"The mom didn't! The dog was roaming loose around the neighborhood when it attacked the child","commenter_a":"Sue the dog owner...? Why did the mom have the kid there around the dog?","post_message":"The boy's grandfather says he already spoken to a lawyer and plans to sue the dog owner in his grandson death."}]
