[{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"10153046924231519","commenter_b":"@username, when has Ann Coulter ever told the truth?","commenter_a":"I cannot stand the mind of Ann Coulter or the things that she says. But the personal attacks don't add anything to the argument. There's plenty of solid evidence to dispute among the things she says and has written. \"Old and sad,\" \"horse face\" and other things don't contribute to the discussion. They make the left look as bitter and unreasonable as the extreme right.","post_message":"This debate is a perfect example of how right-wing \"facts\" make their way though the delusional echo chamber..."},{"comment_id":"10153301053671770","commenter_b":"What do they call a female dog ?","commenter_a":"He wants back in the white house so he can shame us again.","post_message":"Clinton let out her inner dog during a speech Monday."},{"comment_id":"10150668295129999","commenter_b":"She ugly","commenter_a":"Colleen Crann Generation Z is going to college.","post_message":"“In short, there’s a strong ‘you do you’ ethos among teens today.”"},{"comment_id":"839189072876028","commenter_b":"Women 4 Trump","commenter_a":"@username is the smartest, strongest, most beautiful woman in America, and she will be our next president. #ImWithHer #SheGotOurBack #WeGotHerBack #HillaryAllTheWay","post_message":"Trump’s attacks on women’s health are inexcusable—and the rest of the Republican candidates are just as bad. hrc.io/1St92h4"},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"},{"comment_id":"10154125640609071","commenter_b":"Success is subjective. I'm fairly certain her and her family would be happier if neither of them worked so hard at their music careers.","commenter_a":"Why would you put front and center a couple that hates police officers and deals drugs? great role models you morons.","post_message":"“You have the same number of hours in the day as Beyoncé.”"}]
