[{"comment_id":"10154318850908010","commenter_b":"Round them up & deport them!","commenter_a":"You darn California bed wetting liberals are scared, #Trumps going to take your benefits and make you get a job.","post_message":"Some Trump hats were set on fire."},{"comment_id":"1127692307251779","commenter_b":"Fucking dumb bitch.","commenter_a":"Here we go again with the IFLS lies and propaganda","post_message":"The parents, who had chosen not to vaccinate their child, are “devastated” and have now had their younger daughter immunized as a result."},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"460222577435670","commenter_b":"Build the Wall, send all illegals home with the babies, end sanctuary cities, take care of our Vets and end abortion. Yippee!! Go Trump.","commenter_a":"Everyone like how he \"tells it like it is\"---after he becomes president and tells YOU the truth about yourselves, don't call for impeachment!","post_message":"When asked for the reason behind his recent political success, Donald Trump gave this simple answer."},{"comment_id":"10154322735965963","commenter_b":"Deport all illegals","commenter_a":"This is bull nothing but bull! I have family that works and pay taxes and just to renew the green card 💳 cost a lot of money","post_message":"LIVE: Minneapolis police are monitoring the Caravan of Love protest that started at City Hall and is heading toward the U of M. The estimated crowd of 2,000 is marching in support of immigrants and refugees."},{"comment_id":"10154732909385586","commenter_b":"I am glad that this horrible woman will be banned from the store. Shame.","commenter_a":"Betcha Grandma cashes her SS check every month","post_message":"An elderly woman is shown yelling at another woman and her friend, using racial slurs, cursing and telling them to “go back to where they belong.” How's that for Christmas spirit?"},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"}]
