[{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"1390535574339520","commenter_b":"Horrible creatures","commenter_a":"@username this is why you don't panic","post_message":"The bird was trying to steal her ice cream"},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"10153165834319411","commenter_b":"Errrmm... only one that i can think of.","commenter_a":"Russian threat !! NATO's a war monger since its creation,based on Anglo Saxson ,Viking ,etc...of blood thirsty tribes !","post_message":""},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10153778466329497","commenter_b":"Yea Scott, because we were all alive to see that. Lol","commenter_a":"As a guy who bleeds black and is proud to come from Chicago where I've personally seen every single professional team in town win their respective championships except the Cubs. Thank you Mets!","post_message":"Via Onion Sports  Cubs Fan Criticized For Selling Playoff Seat To Mr. Met"}]
