[{"comment_id":"10152948923481336","commenter_b":"Generale brazilian lord me brazilian","commenter_a":"Angel Diaz Stacey Diaz @username Tom Tom Sheppard","post_message":"A breathtaking photo from the U.S. Navy shows a rainbow over the bow of the Nimitz-class aircraft carrier USS John C. Stennis (CVN 74)."},{"comment_id":"10155035206479369","commenter_b":"Build that wall!!!","commenter_a":"BUILD THE WALL","post_message":"Immigration fees are being hiked for the first time in six years."},{"comment_id":"1417324464960761","commenter_b":"We were all originally from somewhere else. The wretched refuse remember! You know the statute of Liberty!!","commenter_a":"Remember Americans are paying for their free benefits!!!","post_message":"What do you think?"},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"10154179126579411","commenter_b":"Gotta love the \"former\" officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":""},{"comment_id":"10153380578865950","commenter_b":"Maybe you're jealous, because you're a fat bitch.","commenter_a":"Well, considering Beyonce was involved, it was bull. I refused to watch it because of her and the song she was performing. Screw her and her terrible lyrics and slutty wardrobe/dancing. You're lucky Lady Gaga was there (never thought I'd say that...) to save the performance aspect. #nomorebeyonce #shesaterriblerolemodel #picksomeoneelsenexttime","post_message":"Compared to past Super Bowl halftime shows, this year's was relatively tame: no \"left sharks\" or wardrobe malfunctions here. Who was your favorite performer?"},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""}]
