[{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."},{"comment_id":"1192416514111710","commenter_b":"Then he cuffs the man after shooting him in the back smh","commenter_a":"How in the hell do you feel threatened by a man who is running in the other direction? This guy is full of crap.","post_message":"Former officer Michael Slager: \"What makes me upset is that nobody knows what actually happened.\""},{"comment_id":"10153195806687217","commenter_b":"Thats the day nearly over! They're normal human beings like the rest of us, go to bed earlier! !!","commenter_a":"Yes, specially for night creatures like me ,actually 7-12 pm would be better (It's a fact that your brain is more active at night)","post_message":"Yawn! Should teenagers be allowed to start school at 1.30 pm?"},{"comment_id":"10153237445176323","commenter_b":"Godddd she's so needy. That hoe def aint loyal. We all know what happens to hoes like that...they get burnt","commenter_a":"@username @username dam Cheryl is annoying... Defriend straight away","post_message":"When is Cheryl's birthday?"},{"comment_id":"10153606211671509","commenter_b":"Gee I wonder where he gets his behavior from ?","commenter_a":"Good job mama :) the world needs more like u","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"506778712863385","commenter_b":"Hillary up to her old tricks #NeverHillary","commenter_a":"It should be a mural of Obunghole screwing a goat.","post_message":"The artist included the phrase: \"Make Everything Great Again.\""},{"comment_id":"1115505231842557","commenter_b":"Because there are so many foreigners in London working illegally, they can't keep up!!","commenter_a":"They shouldn't be allowed to operate, they're all rip off merchants on benefits, why does tfl turn a blind eye.","post_message":"'How do you charge £600 for half-an-hour?'"}]
