[{"comment_id":"10157646411850093","commenter_b":"But a woman who puts dow","commenter_a":"Who wants to manage him? It is just human nature to defend yourself when someone tells lies about you. There is no proof that he called this lady Miss a Piggy and Miss Housekeeping. The video showed him defending her and complimenting her. I don't believe her story. She just wanted her 15 minutes of fame and the Clinton campaign probably paid her. I want a President who stands up for himself when attacked. I certainly defend myself when someone lies about me!! We need a strong leader!!!","post_message":"Leading conservatives are engaging in wishful thinking."},{"comment_id":"10156351998640354","commenter_b":"NO HE IS NEVER GOING TO BE A WOMAN. BORN MALE ALWAYS MALE JUST A TWISTED FRANKENSTEIN MONSTER THAT OUGHT TO BE SHOT. @username","commenter_a":"NO MEN IN DRESSES IN ANY LADIES ROOMS ANYWHERE IN AMERICA. EVEN IF HE HAD HIS GENITALS REMOVED.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it \"cannot condone behavior that is counter to the values this brand has long stood for.\""},{"comment_id":"10152994622700796","commenter_b":"Women are more likely to have chronic pain, be prescribed prescription painkillers, be given higher doses, and use them for longer time periods than men. Women may become dependent on prescription painkillers more quickly than men. Women may be more likely than men to engage in “doctor shopping” (obtaining prescriptions from multiple prescribers). Abuse of prescription painkillers by pregnant women can put an infant at risk. Cases of neonatal abstinence syndrome (NAS)—which is a group of problems that can occur in newborns exposed to prescription painkillers or other drugs while in the womb—grew by almost 300% in the US between 2000 and 2009. ---@webpagelink","commenter_a":"These addictions for many were not choices but had a slow way of happening. Many were prescribed pain relieving drugs after surgery or have a bad back or another painful injury and the doctors wrote prescriptions for opioid medicine like the were going out of style. The family that owes the company that make Oxy, are literally billionaires now just by selling Oxycontin. When you write millions of prescriptions for Oxy in less than 20 years, what the hell do you think that will happen? Many of those people become addicts if you take these drugs for a long enough time. When the doctors stop writing scrips, the people turn to any source available. IMO, Doctors are responsible for the current heroin epidemic in this state and country.","post_message":"“It focuses on a social service intervention as opposed to criminal justice intervention, and it’s been very successful in Seattle,” Portland Mayor Michael Brennan, who is a licensed clinical social worker, said."},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"642298305928438","commenter_b":"she needs to bait Bill to keep him away from other lady`s","commenter_a":"Even if this is true, what does it say about Trump that he is so easily baited. Trust me Little Miss Bimbo, Trump doesn't need anyone to bait him, he finds ways to be an ass all by his lonesome.","post_message":"It isn't like he makes it really hard. I don't think he needs any help."},{"comment_id":"1266389850103907","commenter_b":"@username, do you kiss you're mail man with that mouth? Ms classy","commenter_a":"Every responsible voter should remember these days of how badly the democrats have acted after the Trump win and NEVER AGAIN vote for or put a democrat into a position of power, as they become once elected monsters absent completely of morals and integrity.","post_message":"Georgia Secretary of State now asking Trump to look into why the Department of Homeland Security has been trying to hack the Georgia voter database"}]
