[{"comment_id":"10154141987653145","commenter_b":"@username Yes! Thugs with guns and badges paid by our tax dollars.","commenter_a":"This is where we are today: Killer cops kill civilians and get away with it. Civilians kill cops and either get killed by other killer cops, or if very lucky, they get arrested, charged, and sentenced. Killer cops have no empathy for civilians they kill, or their families. The copsuckers show no empathy for the victims of killer cops who again, get away with it. If the killer cops, along with their apologists don't show empathy for the victims of police killings, why should civilians show empathy for the killed cops? If the killer cops won't shed tears when civilians get killed by cops, why should civilians shed tears when cops get killed? If the killer cops along with their apologists think it's OK for the civilians to be killed by cops (the unjustified killings), why shouldn't the civilians think it's OK for the cops to be killed? Only if ...","post_message":"The slain officer was a special agent with the Georgia Bureau of Investigation. Police say the gunman remains at large this morning."},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"},{"comment_id":"10153557938016438","commenter_b":"That woman is a criminal with a capital C.","commenter_a":"This is why I love Hillary Clinton!","post_message":"Clinton knows the only word a politician enmeshed in scandal needs."},{"comment_id":"10153380056966770","commenter_b":"Get rid of Obamacare and the illegal aliens!","commenter_a":"I so despise Hillary Clinton. Why don't they indict her already.","post_message":"Hillary Clinton wants to use Obamacare to provide health coverage for illegal immigrants."},{"comment_id":"10153356905187439","commenter_b":"Mussies I swear they're really just opressed homosexuals","commenter_a":"Bastards.","post_message":"@webpagelink"},{"comment_id":"1051072661621517","commenter_b":"Get them the hell out of America!","commenter_a":"Sadly delusional.","post_message":"THIS IS ISLAM: Typical Muslim Cockroach  And Tortures Co-Worker For 5 Days To Make Her Convert  @webpagelink"},{"comment_id":"1566280200058671","commenter_b":"@username stop arguing with fools...","commenter_a":"It is being stolen. We have a President that won a large majority, that has high approval from Americans, and the GOP says it should be up to the guy that won a minority in an incredibly low turnout election.","post_message":"\"It's being stolen from the Obama administration and the construct of our Constitution. And it's being delivered to an administration that has no right to fill it.\""}]
