[{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"},{"comment_id":"895449430498298","commenter_b":"Both are DICKS!","commenter_a":"A shame that both our prez and attorney general drew the guilty card before any investigations. Instigators to anti-police sentiment? Comments like Paul's are simply deniers to the findings of two separate independent investigations that produced identical findings. That is, Brown never had his hands up, was never surrendering and he was the aggressor.","post_message":"The Justice Department has finally confirmed what many of us were certain was the case: Ferguson police officer Darren Wilson told the truth about what happened when he said he shot Michael Brown in self-defense. After a six-month investigation, the DOJ concluded that Brown, allegedly a thug and a thief, was not trying to peacefully surrender when the incident occurred. He did not hold his hands up and say, “Don’t shoot.” And he was not shot in the back, as some alleged. @webpagelink"},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."},{"comment_id":"1117162291652524","commenter_b":"Get over it she is covered in the right places and so what if she wasn't. Are you ashamed of your body so let's slam others?","commenter_a":"She is such a skank!!","post_message":"WOAH!"},{"comment_id":"10153724329286336","commenter_b":"How about all countries fight isis and then the refugees CAN STAY HOME !","commenter_a":"The last time Russia was in the battle with the Muslim''''''''''''''''s they lost. They run back home and was broke after a decade. I say let them do it again while we rebuild our defense up again.","post_message":"\"If he wants to fight ISIS, let him fight ISIS – why do we always have to do everything?\"  Donald J. Trump told Bill O'Reilly that the U.S. has invested trillions of dollars and thousands of American lives in the Middle East, and he thinks it’s great that Vladimir Putin wants to take over what America has started. @webpagelink"},{"comment_id":"1729831163913652","commenter_b":"According to her, if you don't vote for her, your a Sexist.","commenter_a":"If youre thinking of voting because shes a woman Please dont vote at all This is about the future of the U.S And this *woman* Cares nothing for equality women Nor blacks... Nor anyone but her corporate buddies","post_message":"Hillary Clinton told a colorful story in Reno that ended with the former secretary of state barking like a dog to slam Republicans ... @webpagelink"},{"comment_id":"1353674218062160","commenter_b":"Dawn you're clearly a sexist. Lol.","commenter_a":"Yeah and the Republicans made such a big deal about Hillary's reset with Russia. The Donald just might sell out to Russia. Just how many millions did the Donald get from Putin?","post_message":"Donald J. Trump can scrap U.S. sanctions on Russia and other national security policies with just a signature."}]
