[{"comment_id":"10156133513175389","commenter_b":"No!!!!! They want to change our culture to theirs, we shouldn't allow that!","commenter_a":"We should allow Christians in.","post_message":"Question of the Day: Do you think America should be taking in refugees from the Middle East?"},{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1629939420634866","commenter_b":"I agree with Trump. YOU WANT TO SELL IT HERE,THEN BUILD IT HERE!","commenter_a":"Protectionist policy won't work. America is not making any friends with actions like this. Don't buy American will soon be the global response.","post_message":"Checkmate!"},{"comment_id":"893350990721431","commenter_b":"She's not getting my vote","commenter_a":"Go Hillary!!! :)","post_message":"All across the country, people are working hard and making plans for their futures. Hillary is getting started too. Be a part of her campaign from the very beginning:"},{"comment_id":"1587581361533554","commenter_b":"Can we let her off with this one? I think it's in the public interest if we don't see that. The photographs of her having sex in a field were enough.","commenter_a":"I protest to this, I wouldn't wish that sort of cruelty on any sausage. Plus lets face it there would be no room for the sausage when her head is so far up there..","post_message":"On 4th May Hopkins tweeted \"If Sadiq Khan wins London, I will run naked down Regent Street with a sausage up my bum in protest #LondonMayor2016.\"  She later tweeted: \"I'm a woman of my word.\""},{"comment_id":"1104019902949566","commenter_b":"If she would screw a muslime she would bang anyone , they are animals","commenter_a":"Why does his 15 minutes of fame feel like 15 years?","post_message":"Apparently angry that his girlfriend cheated with a “dirty Muslim,” Zimmerman posted nude pics and contact info for his now ex-girlfriend."},{"comment_id":"10153826016756680","commenter_b":"Trump's no. 1 fan has a warning for us. David Duke Warns If Hillary Is Elected Black Men Will Rise Up, Kidnap White Women From Walmart And Rape Them ! The Republicans little secret that Trump exposed. 40 percent of them are racist and were dormant waiting for an opportunity like Trump. Vote blue from the top of the ticket to the bottom","commenter_a":"Thank you Hillary. As a gay man I understood it took you a while to get where you are, but I applaud you for your commitment to stand up for LGBT rights. #ImWithHer","post_message":"The NCAA announced it will relocate all of its championship events from North Carolina scheduled for the current year."}]
