[{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"1212505538766794","commenter_b":"Karma's a bitch.","commenter_a":"Well there goes this investigation out the window. An admitted ammosexual is heading This investigation. .","post_message":""},{"comment_id":"10153464024014087","commenter_b":"Nothing will convince me that illegals not being here would not mean more money in the pockets of people in my nation who are living in poverty today and because my fellow countrymen are the only thing important when it comes to my nation.....my political support will only be for candidates who will remove illegals from my nation as my Constitution requires","commenter_a":"If illegals were back outside our nation....jobs would be much easier to get for our citizens","post_message":"President Barack Obama's three-pronged plan includes wage insurance of up to $10,000 over two years, expanded unemployment insurance coverage and more opportunities for laid off workers to retrain and reenter the workforce. WATCH:"},{"comment_id":"10154419020458812","commenter_b":"@username check your facts. You're showing how ignorant of the law you really are. IF it happens, remember that's all part of what YOU wanted.","commenter_a":"The people allowed leadership into power who passed the bill. Vote them out or put pressure on them. You, the people are responsible. So losing out on economic activity and entertainment is the price. Soon comes loss of education funding. Whats more important?","post_message":"JUST IN: Maroon 5 canceling upcoming shows in North Carolina because of the recent passage of the HB2 legislation. \"Everyone should be treated equally.\" @webpagelink"},{"comment_id":"10154012731783352","commenter_b":"You know there has to be issues with her if the white men think you are crazy!","commenter_a":"I hate when you left a man they started to talking shit Dave Justice go sit your ass down some place and stop talking smh","post_message":"Halle Berry’s ex Dave Justice tells why he’s finally speaking out about the A-list actress, who tried to ruin his life and did the same thing to ‘Eric, Gabriel and Olivier’"},{"comment_id":"10153712266449199","commenter_b":"Nutter psycho...we need her out on the streets ..","commenter_a":"She killed him...we all know it..","post_message":"BREAKING:  Hung jury in Jodi Arias case, judge will now decide her fate"},{"comment_id":"10153358491932217","commenter_b":"where were these anti-facists when Women were attacked in Cologne","commenter_a":"Natalie","post_message":"Bricks were thrown as far-right & anti-racism protesters clashed in Dover."}]
