[{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"713245288832825","commenter_b":"I guess you are one of those women","commenter_a":"Yessss lets celebrate that we have a president think women can be treated like trash and women can stay at home creatimg babys. You women that voted him should celebrate for that","post_message":"Watch as President-elect Donald J. Trump and Vice President-elect Mike Pence kick off their  you tour in Cincinnati, Ohio."},{"comment_id":"10154170724496409","commenter_b":"@username, according to YOUR new president, we can all drop by your house and grab your pussy...Don't get mad at me, trump said it was alright.","commenter_a":"Obummer sucks. DONALD TRUMP. None of you can change that. Poor pitiful liberals you really do make yourselves look desperate and ridiculous","post_message":""},{"comment_id":"1862154907348470","commenter_b":"I'ma tear that fried rat clean down!! I got moves to make and a child to feed. I'm a proud fried rat eating father! Haaaaah","commenter_a":"spider","post_message":"Which would you choose? #WSHH"},{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"},{"comment_id":"10155406778245231","commenter_b":"Couple? Ha! You are uninformed white women have been weaving in droves for years. Weave is weave texture is not a determining factor.","commenter_a":"Does that include white women too?","post_message":"But will he take their money when they purchase tickets?"},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"}]
