[{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"},{"comment_id":"10152691502210927","commenter_b":"I agree they are just like his kids - Brats who think they deserve everything on a silver platter.....Put them back on the top of train cars headed for Central America","commenter_a":"Y r yall so against latinos/ mexicans last i checked they were here n mingled with natives b4 many of urs ancestors, when did they push, steal, lie, march families out of their lands","post_message":"Illegal aliens are just like our kids according to Obama."},{"comment_id":"10152788051453445","commenter_b":"Aussie bastard cannibas its called! Sydney university are offering $10,000 if any1 can find another plant!!","commenter_a":"@username Steven Bains","post_message":"WHAT?!? A new strain of #marijuana has been discovered!"},{"comment_id":"1678077472472997","commenter_b":"Fuck all Muslims and let them go to hell!!!!!","commenter_a":"So sad. It's bad enough that the boy lost his life, but for the Father of the murderer to defame his character is just too much.","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"10153044647531680","commenter_b":"For such a homely woman, she certainly is getting a boat load of dates all of a sudden.","commenter_a":"Go ahead and meet her! Just turns off every moderate republican and makes him that much more of a joke.","post_message":"Ted Cruz, whose staff has been in touch with her lawyer, plans to visit Davis at the Carter County Detention Center, where she is being held, in the early afternoon."},{"comment_id":"10156577141610603","commenter_b":"Now we have another whack job in Washington today. Something is in the air, like desperation.","commenter_a":"According to public records, Ford has an extensive criminal history, including charges for burglary, fleeing police officers, grand theft and an unspecified felony. Most of the incidents occurred in Broward County, Fla., and date back to 1996. His girlfriend said: He is an alcoholic, violent, depressed. It’s my belief he is in desperate need of medical & psychological help!”","post_message":"Cedric Ford was at work when he was given a 'protection from abuse' order roughly 90 minutes before he went on Thursday's deadly shooting spree, according to police."},{"comment_id":"10153605944168984","commenter_b":"No more abortions no more planparnthood","commenter_a":"My niece had a baby at four months completely formed , she is still so sad about it death , they held and took pictures. I don't know how this is not murder in the womb ? Cause a abortion is! !!","post_message":"Even with all evidence going against them, Planned Parenthood keeps on coming out with one unbelievable excuse after another.  Do you think it's time to defund and get rid of Planned Parenthood?"}]
