[{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"983326201715214","commenter_b":"his momma owes him a butt whooping is all... since he probably got no daddy","commenter_a":"Send him back to Africa and let him live the life he would have had if his ancestors would have stayed there","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING."},{"comment_id":"10154343066022507","commenter_b":"@username But they were to be submissive to white brutes if married to them. And she was married to a white brute. Her lies did not influence either Till's murder or the trial's outcome.","commenter_a":"People are quick to point out how different things were back then for blacks but don't forget how different they were for women, especially in the Deep South. What she did was horrendous, don't get me wrong, but I have no doubt that she feared for her own life. She was married to a man that could commit that kind of a crime. The article said that she was hidden away around the time of the trial with HER HUSBAND'S FAMILY. Don't you think she was threatened by them? I have no doubt of it. Being a women, even a white woman, was only marginally better than being black down there at that time. She will answer to God but, have no doubt, she has had to live with the knowledge of what she's done and had reminders along the way of what that entailed with reminders in her own ...","post_message":"60 years after this poor boy was brutally murdered, she finally admits the truth?"},{"comment_id":"10154689857838487","commenter_b":"What a complete idiot","commenter_a":"He gave his brain away, didn't he. That's got to be the reason. He was selfless and gave his brain away.","post_message":"Carson accused Kay of making him  bad guy, and asked Joe Scarborough, the show's host, to  her microphone off so I can talk."},{"comment_id":"415868471934780","commenter_b":"as soon as they put one foot on our soil we must be ready to drop bombs on them.","commenter_a":"I am ready for them arats.","post_message":"They're here!!"},{"comment_id":"1320166798020657","commenter_b":"You are Sooo Pretty, Young Lady!","commenter_a":"Why is right. Totally agree, Brandon!!","post_message":"TheBlaze news update with Sara Gonzales and Brandon Morse."},{"comment_id":"1049118838444933","commenter_b":"Ross I'm quiet familiar with what you and others want, but that's not the way it is,especially me. I served this country for my beliefs and I'll be damned whether people like you like my opinions or not. One day when the liberals get their way and all the refugees and ILLEGALS are let in this country then maybe you may see what I'm talking about. Either way its not my problem, I've served my time and paid a life time of taxes and still paying. No I think Ross today's society are out of touch with reality is the problem.","commenter_a":"As an older person I've come to the conclusion you can't blame these young snot nose, entitled brats. This is the environment that's been created by the liberals, so everybody can feel hunky dory.","post_message":"She probably won't be too pleased..."}]
