[{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"1604088796561359","commenter_b":"someone get through their thick headed skins, that this is America and we do not have to do it. You respect my religion and I will respect yours, but this is not freedom of religion or freedom of anything but trouble. Your here follow our ways like all other immigrants have done.","commenter_a":"First of all why would you apply for the job at the place if you're Christian?","post_message":"THIS Muslim Company in The U.S. Is Forcing Their Christian Employees To Wear Headscarfs!"},{"comment_id":"550590221774115","commenter_b":"Republican presidential candidate @username has admitted to lying about his application and acceptance to the U.S. Military Academy at West Point, Politico reported on Friday. The retired neurosurgeon and current GOP frontrunner has been using the story as a central point of his personal life during his campaign.","commenter_a":"But its just been confirmed that you lied about West Point. You're done in my book. Before that, I supported you.","post_message":""},{"comment_id":"10153068260504804","commenter_b":"It didn't read like that in my head...haha!","commenter_a":"Best president in my lifetime, second only to George Washington in my opinion.","post_message":"Today would have been the 104th birthday of our nation’s 40th President Ronald Reagan. As we remember President Reagan and his exemplary leadership, please take a few moments to watch this video compilation of some of the most memorable moments of his 8 years as President.    @webpagelink"},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."},{"comment_id":"1824366427776560","commenter_b":"Build that wall starting January 20, 2017.","commenter_a":"Build that wall !!!!","post_message":"URGENT: Please vote now.  Do you support building a wall with Mexico?  A new national poll released today says 53% of Americans DO NOT want a wall along our southern border.  The question is, do you?"},{"comment_id":"387361158112432","commenter_b":"the WHAT?","commenter_a":"A lot better then the B.N.R. CRAP","post_message":"What did the Christian left do to draw the ire of Fox News?"}]
