[{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"675644415959470","commenter_b":"God bless you one of our hero","commenter_a":"Spencer , sorry this happened to you! Hope you are recovering fast and gaining strength every dsy.","post_message":"We all remember Spencer Stone and 2 other heroes stopping the Islamic terrorist attack aboard a train. Just days ago Stone attempted another heroic act, but this time wasn’t so lucky… Can we get 40,000 ‘LIKES’ for this American Hero?"},{"comment_id":"10153101958805329","commenter_b":"I love that now it's called \"fat shaming.\" She made a choice to eat healthy, work hard and raise her kid. What is wrong with that? Society is annoying sometimes.","commenter_a":"What it's bad is telling people what to fucking do!!!","post_message":"“I have a kid, a six pack and no excuse.”"},{"comment_id":"1163757976970226","commenter_b":"The man was certainly considerate in this instance.","commenter_a":"During his eight-year presidency, [George W.] Bush did take 879 days of vacation, including 77 trips to his Texas ranch.","post_message":"Wow. I never knew this about George W. Bush. When he was in the White House, he would never leave for Christmas vacation until the day after Christmas. His reason for doing so was simply amazing...  This story really illustrates the difference between Bush and Barack Obama..."},{"comment_id":"10153936558477144","commenter_b":"Oh for f* sake leave your vagina at the door please and REALLY look at her record.","commenter_a":"Clinton is a rich aristocrat white woman, check your privilege please, the only thing that she has in common with other women is a vagina. She was first lady, rising to power off her husband's victories she was lifted up to senator and paid well to do nothing, she then ran for President and lost to another man who then lifted her up to SoS, when she ran that office to the ground she left only to win by the efforts of the media and DNC who have a vested interest in seeing her high office. In doing so ruined the chances of America to regain control of our democracy.","post_message":"“That is how good you have to be if you’re a woman running for president. And she still might lose! To this, the least qualified candidate ever to lurch into the public spotlight and shit on Gold Star moms, while cradling Putin’s sweaty sack.\"- Samantha Bee"},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."},{"comment_id":"803115886455778","commenter_b":"Shoot that mother f***** in the head","commenter_a":"Courtney Surprenant my fear at dollar tree or anywhere really","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"}]
