[{"comment_id":"10154138194905329","commenter_b":"Look it says right here you're a little bitch.","commenter_a":"@username we got a badass over here","post_message":"When even art is tryna make gainz."},{"comment_id":"10158086481670389","commenter_b":"Good! She needed ti be fired!","commenter_a":"Glad that person was fired.","post_message":"In Case You Missed It"},{"comment_id":"1178312252188803","commenter_b":"The site did not breech their privacy......they all willingly made the choice to put their name and information on there to cheat on their spouse......the site did not do anything negligently....the hackers got in.....they have been able to get into top secret government systems.....how is a website for cheaters supposed to be expected to have better security than the government? The hackers are the ones at fault.....and the idiots who allowed themselves to be exposed by trusting something as insecure as the internet to cheat on their spouse!","commenter_a":"I disapprove of what they did but the site breeched their privacy.... Hope every penny goes to those that were cheated on","post_message":"All allege breach of contract, negligence and violation of various state and privacy laws by Ashley Madison and Avid Life Media LLC"},{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"1409742245732910","commenter_b":"Pitiful woman","commenter_a":"Is she d","post_message":"Perhaps if she listened to Louisiana’s governor instead of right-wing rags, she’d understand better."},{"comment_id":"10155169857528690","commenter_b":"Que triste, que bom que salvaram!! Quero adotar!!!","commenter_a":"Daniela","post_message":"91 dogs and 10 cats were rescued from a suspected puppy mill in Australia."}]
