[{"comment_id":"10153302141658812","commenter_b":"women wearing tuxs are on fashion runways @webpagelink so why can't she wear one?","commenter_a":"Every single girl should show up in a tux, and every single guy should show up in a dress.","post_message":"Principal says gay student can't wear tuxedo to prom. @webpagelink"},{"comment_id":"10154091446565736","commenter_b":"Get her butt out of there .... YOUR FIRED","commenter_a":"I'm SHOCKED that an Obama-appointed Democrat is trying to undermine the new president. Did you really expect anything less? The Democrats aren't about to let President Trump do his job without throwing up every possible roadblock. They're just sore losers.","post_message":"\"I am responsible for ensuring that the positions we take in court remain consistent with this institution solemn obligation to always seek justice and stand for what is right,\" she said."},{"comment_id":"1375338609150152","commenter_b":"It's a bit of a give and take, really. Housing bubbles are good for homeowners and sellers, but when they burst, it's good for the people looking to buy homes. Both scenarios benefit real estate speculators in their own way.","commenter_a":"The housing crisis was NOT good for average Americans. It was a terrific thing for the realty speculators.","post_message":"Trump is literally arguing that America needs a president who will act like a selfish billionaire."},{"comment_id":"1038011639567708","commenter_b":"Hell no, look at her go though Kalen would move","commenter_a":"Wtf imagine if this was kalen lol @username","post_message":"At 6 months and 27 days old, little girl breaks the record for the youngest person to ever water ski. @webpagelink"},{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, \" W\".","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."},{"comment_id":"10153588597752042","commenter_b":"Its not indecent exposure. Breasts arent genitals and they are legal in ny. Also its 2015, so if they ban toplessness in nyc or just the times square section, men jogging around topless or wearing loose tanktops showing nipples should be banned as well. Its the same body part. As a matter of fact men in beach should wear something to cover their bare chests as well. Its only fair to women.","commenter_a":"Nope! First Amendment vs. Decency! The problem was old-styled Garbage at Times Square, that problem was solved by then-Mayor Giuliani in late 1990s. DeBlasio was too socialist today!","post_message":"NO MORE NUDITY: After several calls of criticism about topless, body painted women in Times Square, a Bronx politician has introduced legislation to ban toplessness across New York. Do you think this should be passed?"}]
