[{"comment_id":"10152651937258067","commenter_b":"You're wrong. Red letters mean it was quoted, a parable told by Jesus. If you don't believe the Bible Stephanie Morris, that's fine. But you can't question why a church would make a decision if you don't believe in the book that the church is built around.","commenter_a":"Question is, why did that church invest in money-changers? What would Jesus think?","post_message":"A church in Indianapolis claims JPMorgan intentionally mismanaged church funds and only cared about maximizing fees. @webpagelink"},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"},{"comment_id":"1022450851126484","commenter_b":"And let's not forget, all of the terrorist attacks on United States soil have been committed by less then 100 Muslims. How many more United States citizens must die before this insanity is stopped?","commenter_a":"How about we see how she rules on things before we pass judgement? If her rulings are in accordance with the laws then who cares. If she starts using Sharia law to pass judgements then we can raise an issue.","post_message":"This is why we can't have nice things...but SERIOUSLY!"},{"comment_id":"906397572824353","commenter_b":"Wow!! She's got u brainwashed!","commenter_a":"Dear Mrs.Hilary, Sweetness in your speech , talent in your mind, Peace in your eyes, strength in your hands & I wish always victory in your life..Pl accept my heartiest congrats & do your best to bring peace & harmony to the whole world. I am from Sri Lanka & once again pl accept my best wishes for you madam...go ahead go ahead & do your best not only for America but to the whole world madam..May the blessings of the triple gem be always upon you..tc, Gd luck","post_message":"Hillary Clinton supporter screams \"Not your fault\" after candidate says she \"deeply\" regrets the \"angry tone\" of the campaign. @webpagelink"},{"comment_id":"10153428206108984","commenter_b":"She needs prison time!","commenter_a":"As far away as possible","post_message":"Looks like this is coming back to haunt her...  Do you think Hillary Clinton needs to stay far away from the White House?"},{"comment_id":"10154589153096336","commenter_b":"The only place Hillary should be is in prison! #trump2016","commenter_a":"MAY HAVE???????","post_message":"Newly released emails suggest a senior Hillary Clinton aide stage-managed her first hearing on Benghazi by feeding specific topics to Democratic Senator Robert Menendez. @webpagelink"},{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."}]
