[{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"},{"comment_id":"10153030490451800","commenter_b":"Pageants are Insults to women and we should be past these DOG and PONY shows by now.","commenter_a":"Evidence That Beauty Pageants are Epic failures \" SARAH PALIN\". VAPID AS ANY CANDIDATE FOR ANY OFFICE ANYWHERE ANYTIME THE ONLY BIGGER IDIOTS ARE HER DONORS AND PERSONS STUPID ENOUGH TO BUY HER BOOKS. When I find one of her books for 15 cents at a Thrift store I will shred it and use it to Line my cats Litter BOX. ( If i don't find a Donald trump book first)","post_message":"\"Good for Miss Lebanon and Israel for rising above your countries' political squabbles to say to the world that on the inside, we're the same. And also on the outside, apparently they're the same. They're almost completely identical, it's really inspiring.\" -- Jon Stewart @webpagelink"},{"comment_id":"10153554565881615","commenter_b":"... Murder is obviously horrible... But I would like to expand capital punishment beyond that... To a crime I put equal to murder... Child molestation ... Or child RAPE. Unthinkable. Monsters like that should be eliminated as well.","commenter_a":"Will waste even more money to keep him in our prison system or on \"death row\" ... Please use capital punishment in cases like this and actually FOLLOW THROUGH WITH IT!","post_message":"BREAKING: Allen Wade has been found guilty on all counts in the murders of Susan and Sarah Wolfe, who were killed in their East Liberty home more than two years ago."},{"comment_id":"960118844029903","commenter_b":"Umar hayat, do u know people are injected with relegion, so they r blind what happent to u , u r a muslim and should not speak like this. See irain is only state which helps palsitane , a sunni state but our Arab the grand state of muslims is quite , wht does that mean. Leave blindness and b a responsible muslim","commenter_a":"which islamic republic ? Iran is a shia majoosi state dont use the name of islam with a sheetani state","post_message":"The Iranian president says the Islamic Republic will firmly deal with any acts of aggression: @webpagelink"},{"comment_id":"10153917677820695","commenter_b":"Is that the guy walking/running or it's the photo of a car he supposedly driving?","commenter_a":"Police just released this surveillance photo of the man, who was driving a silver car. They say the victim was a 65-year-old woman.","post_message":"#BREAKING: Officers are searching for the man who sped away from the Walmart parking lot.  We have a reporter on the way to the scene and will have a live report on the Channel 2 Action News Nightbeat at 11."},{"comment_id":"1372477109489879","commenter_b":"She can take a shower and be clean afterward! Lol","commenter_a":"If the girl wanna be clean.. Let her be in peace...","post_message":"'Alaikum salam'"},{"comment_id":"1741083142832713","commenter_b":"She plagiarized!","commenter_a":"Keeping it classy!","post_message":"\"On July 28, 2006, I was very proud to become a citizen of the United States – the greatest privilege on planet Earth.\"  Melania Trump, wife of presumptive GOP nominee Donald J. Trump, spoke about her pathway to U.S. citizenship and thanked veterans who protect the freedoms we enjoy as Americans. @webpagelink"}]
