[{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"1308394922562170","commenter_b":"Go build the wall then","commenter_a":"Put them in jail and large fine, deport the illegal immigrants now, cut federal funding, build the border wall, close all sanctuary cities/schools, take care of Americans/veterans first, if they legal learn our laws, constitution, and English , this is our country and if they don't like, they leave.","post_message":"A protester burns an American flag during marches through Olympia today. Video from The Olympian.  Latest updates: bit.ly/2j3yanl"},{"comment_id":"1013388188713944","commenter_b":"All the illegals !!!","commenter_a":"All this happen cause of sin of Obama take our flight mh370 and keeping our passanger","post_message":"Will the blue helmets arrive to relocate tens of millions of Americans?"},{"comment_id":"10152812337251749","commenter_b":"#iAmProudiAmBlack. #MyGirlFriendisBlack bcoz i only wanted a beautiful lady. Make these hashtags go viral and discourage nutty whites around the world who see blacks as apes. Tell them that: #BlacksRuleTheWorld. #ObamaIsBlack bcoz he is a great.","commenter_a":"Then it needs to be made a right","post_message":"\"We have finally ended the debate in this country of whether or not health insurance is a right or a privilege. We think everyone in America has a right to have adequate health care insurance. And the Affordable Care Act gives them that right.\" —Vice President Biden  Watch the weekly address: @webpagelink"},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"\"I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.\" —President Obama  Read the President's latest message to OFA supporters: @webpagelink"},{"comment_id":"10152910640286770","commenter_b":"Buzz off you jerk!","commenter_a":"Who is this \"Jon Stewart\"? Is he Portuguese?","post_message":"Jon Stewart: \"Donald J. Trump has no control over the projectile vomit of dickishness that comes out of his mouth every time he opens it.\""},{"comment_id":"10153982489146438","commenter_b":"talentless racist bitch","commenter_a":"talentless bitch","post_message":"It's an incredible visual album, but how is it as an aural album?"}]
