[{"comment_id":"10153231600851491","commenter_b":"Well the last 3 harry Potter movies should had been directed by a woman then","commenter_a":"thats not how sexism works. Sexism is if there are qualified female directors available to direct, and they choose to hire a less qualified male director. If there are no qualified female directors available thats not sexism","post_message":"Emma Watson: \"I have been directed by male directors 17 times and only twice by women.”"},{"comment_id":"10155034112494445","commenter_b":"She's nervous he may grab her by the pussy!!!","commenter_a":"She looks nervous as would I this has been a big day for them, STOP THE HATE, she is a beautiful woman... let's be real how would you be if the entire world was watching you!?","post_message":"President Donald Trump and First Lady Melania Trump share their first dance as the First Couple.  @webpagelink"},{"comment_id":"10153235652851519","commenter_b":"He has a brain?","commenter_a":"Trump's hair is getting into his brain, not Mansanto.","post_message":"Very presidential..."},{"comment_id":"1187034151348219","commenter_b":"On the flip side the battle is going... ok ish","commenter_a":"\"Hold X to flip over\"","post_message":"Caption contest time! ~Josh"},{"comment_id":"10154243663794160","commenter_b":"I bet he's caring a lot more women. As a woman, couldn't vote for Clinton. As a woman, she's an embarrassment to women.","commenter_a":"I pray, I pray, I pray","post_message":"Donald J. Trump is losing female voters."},{"comment_id":"981168698591584","commenter_b":"Wow! That's insane.","commenter_a":"They have been","post_message":"Tel Aviv says the Israeli military must have a freer hand to shoot young Palestinian stone-throwers."},{"comment_id":"602134433280545","commenter_b":"Nina act like she fucking BERNIE GO HILLARY CLINTON FOR PRESIDENT OF UNITED STATES","commenter_a":"She just wanted to play Ted Cruz nobody needed that. Those that supported Bernie have to move forward and help defray trump this is what he's asking them to do. Let us not be divided and loose to trump.","post_message":"Bernie Sanders’ supporters say they are being severely mistreated at the DNC."}]
