[{"comment_id":"10155117699521178","commenter_b":"Especially women not yet born.","commenter_a":"So... the baby killers are really not for ALL women? Gotcha. 😂😂👀","post_message":"BREAKING: Pro-lifers not welcome at women's march after uproar from feminists."},{"comment_id":"10153953740523132","commenter_b":"Read!! Read!! Read!!!!!!!!!","commenter_a":"Did the other driver not stop to report it?And no one saw?","post_message":"People driving on the freeway told police they thought the body was a \"Halloween prank.\" It remained on the sign for 2 hours, police said."},{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."},{"comment_id":"1368989116512954","commenter_b":"This is a poorly done troll job","commenter_a":"How about cutting the businesses taxes and then giving that money to illegal immigrants and other countries and people on welfare who can work?","post_message":"After liberals raised the minimum wage again, this restaurant owner had had enough. Here's how he took matters into his own hands and made sure his customers knew it...  This is what the left does NOT want to talk about when it comes to the \"fight for $15.\""},{"comment_id":"1796926360545603","commenter_b":"I well tell you some thing... The isis was made by usa","commenter_a":"Vote Trump. .... what's the matter killary fans u guys worried. ... U should be","post_message":"We are going to get rid of ISIS! America needs real leadership. #MakeAmericaSafeAgain"},{"comment_id":"10153097192830090","commenter_b":"No! Don't bring the here we got enough idiots here already","commenter_a":"Move the Capital to Texas, will get it fixed.","post_message":"Since Obama can't provide real \"change,\" we're doing it for him.  Share what our Republican-led Congress must fix in Washington: @webpagelink"},{"comment_id":"1471521346221666","commenter_b":"@username I cannot in this day and age believe that someone as backwards uneducated,unread as you still exists. You know all that crap has been debunked yet you continue to stream it. I don't know if you are a troll or not but there is no brain matter in your skull.","commenter_a":"He is just a rich piece of trash. Money can buy you tons of stuff, but it cannot buy you decency, morals, health or happiness.","post_message":"It just keeps getting worse!"}]
