[{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"1603818663247762","commenter_b":"The Lying Queen","commenter_a":"The Clinton Crime family song Dirty deeds done dirt cheap AC/ DC Clinton Crime family song","post_message":"WATCH: Hillary Clinton news conference on FBI investigation."},{"comment_id":"10153429350692623","commenter_b":"She would have gotten her old azz beat. Period!","commenter_a":"My question is what did these people do to provoke the volunteer? Why did they not comply with her request to leave and then they could have gone to someone else for help. I have seen people treat the volunteers like dirt- maybe this woman couldn't take it any longer. Don't judge unless you were there and saw the entire event unfold.","post_message":"Wake Forest Baptist Medical Center is responding to a disturbing incident caught on camera involving one of their volunteers."},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"},{"comment_id":"10154094538521955","commenter_b":"If anyone thinks it is going to be easy taking this country back from these marxists.....think again!","commenter_a":"Police, once again are ordered to let Thugs throw rocks at them. These protests are like Disneyland for the Criminal element.","post_message":"UPDATE: RIOT AT TRUMP NM RALLY..."},{"comment_id":"10152871258752411","commenter_b":"Tradition in high school sports.....especially football.........Give it a rest already!","commenter_a":"Lol omg. To all these people saying how mean it is. It's called having a sense of humor. It's awesome. And I'm SURE the neighborhood helps him clean it up;) relax;)","post_message":"ANYONE NEED TOILET PAPER? Coach Q's house was TP'd after Chicago Blackhawks Stanley Cup win.  Full story: @webpagelink"},{"comment_id":"1725539231054043","commenter_b":"Big wall!!","commenter_a":"I read the interview with Kirsten. It was great and it does reveal a side of Donald Trump that we don't see at rallies. Very nice!!! Trump 2016!!!","post_message":"A very interesting piece, by a very good writer, Kirsten Powers."}]
