[{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining \"i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.\" A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"},{"comment_id":"10154003948143812","commenter_b":"I know it's late but does anyone have her address?","commenter_a":"Thanks to all that helped i know she was happy","post_message":"8-year-old girl who survived a fire that killed her family receives more than 700,000 Christmas cards from around the globe. \"It really moved a whole community.\""},{"comment_id":"10153482227782377","commenter_b":"The corruption mongers who have like leeches suck the blood and financial life out of this country find being with Trump is of no benefit to them therefore its a matter of running scared when we find out who they are their done!","commenter_a":"were never conservitves in the first place @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2","post_message":"In the wake of his Indiana primary victory, some Republicans are breaking with party tradition and refusing to support Donald Trump under any circumstances."},{"comment_id":"1841509832747191","commenter_b":"Cause you are a psycho bitch..","commenter_a":"because your a lying sack of shit!!","post_message":""},{"comment_id":"700248193457289","commenter_b":"@username honey your aluminum cap should b worn at all times ...","commenter_a":"When he opens his mouth he divides. Expected from a 1/3 white 1/3 black and 1/3 Arab who is a closet Muslim. Conflicted hate eVeryone but MUSLIMS. THATS TRUTH NOT A FALLING LYIN' tree.","post_message":"Probably... but we'll never really know will we?  Hostile Politics"},{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: \"So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"}]
