[{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"964590076909747","commenter_b":"I wouldn't vote for that FAT SOB for dog catcher!!!!!!!!!!!!!!!!!","commenter_a":"Lol he can't control his staff with the George Washington bridge debacle and he wins the cnn award ? Lol notice they dident ask him about that...it was like always a trump bashing...I'm voting trump the media makes it easy for me to come to this conclusion","post_message":"It's official!"},{"comment_id":"10153937424304205","commenter_b":"This is why rape is so prevalent these days","commenter_a":"Every kids goes to thier mom in utah for this like this. Go spend a few years here then bitch about utah. Your making fun of thier Mormon culture... Look I've grown up in utah and I don't disagree that it's ridiculous. But your making fun of thier religion.","post_message":"A Utah high school student was having what he believed to be impure thoughts toward his female classmates when they wore their cheerleader uniforms in class."},{"comment_id":"10153947034057464","commenter_b":"Cruz for president 2016","commenter_a":"I think what irritates me the most about the republican election right now is people are voting for Trump because they think he is going to stand up for the American people, NEWS FLASH people he's not going to, he has illegal immigrants working for him, he has donated more to the Democratic Party than the Republican Party, and he was one of the people who supported Obama care. He is not our best choice he's our worst choice. He's a frigging liberal that is in the election to help Hillary get in why can't people see that!!'","post_message":"WATCH Ben Ferguson on why he's endorsing our campaign.  Join the #CruzCrew: tedcruz.org/volunteer"},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"10154838138336509","commenter_b":"If she does a good job, why should anyone care that she is single?","commenter_a":"China, it's non of your business. So proud of our new president.","post_message":"\"As a single female politician, she has no emotional encumbrances of love, no family restraint, no children to worry about. Her political style and tactics are often emotional, personalized, and extreme.\""},{"comment_id":"1214061615292067","commenter_b":"@username Just WHAT is racist about wanting to put up a wall to help keep illegals out of our country? What is racists about wanting to deport those illegals who are here? Since when did ILLEGAL become a race?","commenter_a":"I got my country back and I'm not giving it up to some drunk retarded ignorant fool like Palin","post_message":"Sarah Palin says it's time for everyday citizens to take our government back. Do you feel the same way?"}]
