[{"comment_id":"10154363651421323","commenter_b":"Irony? He hasn't been right wing, he's been a German-Iranian guy.","commenter_a":"Irony A German born rightwing neo-nazi shots up the place wanting foreigners to get out! Online echo chamber immediately call him an Islamic terrorist immigrant","post_message":"The situation in Munich is still developing. This is what we know so far about the shooting."},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed \"Clock Boy\" Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"},{"comment_id":"897196563636468","commenter_b":"Nailed it! Being as, I saw this last night and asked, who is this woman!","commenter_a":"Funny how Kelly Clarkson's known over a couple of continents, yet what's her face has never been heard of over here.","post_message":"Some people wait a lifetime for a comeback like this  well done, Kelly Clarkson."},{"comment_id":"701341166639263","commenter_b":"Did porky hamas say something. Shame","commenter_a":"(Eo) amaso ne estas felia pro Amnesty International.","post_message":"Hamas is NOT happy with Amnesty International"},{"comment_id":"10153868854236336","commenter_b":"Heck yeah","commenter_a":"It's OUR country. We don't have to agree. I'm sick of people like this telling other people to leave. You don't make the rules buddy.","post_message":"\"The silent majority has been silent way too long.\"  Harris County Sheriff Mike Jolley says he's proud to be political incorrect, and if you don't like it, you can leave his county. @webpagelink"},{"comment_id":"133746713872563","commenter_b":"Burn in Hell scumbag","commenter_a":"You mad!!!!!","post_message":"JUST WATCH: Here's a snippet from the sentencing of Michael Morgan, the man convicted of killing two children in a house fire. @webpagelink  What do you think?"}]
