[{"comment_id":"10154874909449369","commenter_b":"No actually one of my best friends is a gay black woman. She knows I love her.. she is just not childish enough to allow difference of vote affect our friendship.. we have had since we children. :) Bcuz she is grown.","commenter_a":"I have grown to respect Mike Pence. Great choice!","post_message":"Vice President-Elect Mike Pence is taking over President-elect Donald Trump's transition team, replacing the former chair of the operation."},{"comment_id":"10155455512331509","commenter_b":"Victim shaming is another way trump supporters are deplorable","commenter_a":"Ok time for JIMMY to come forward! Killery Klinton once fatshamed me at an OutBack SteakHouse in St Louis MIssouri! When eating i accidently flung my porkchop underneath her table where her dog was ( guess SHE is allowed to bring dogs). When i was wrestling the dog to get my porkchop back she called me a FAT idiot! #JimmyComesForward #FatShamerKillery","post_message":"Another woman is accusing Donald J. Trump of groping her, saying he allegedly put his fingers up her skirt"},{"comment_id":"1297673556961425","commenter_b":"She has taken UGLY to a new LOW!!!!","commenter_a":"This awesome. Trump just keeps on winning.","post_message":"Awful Rosie O Got Slammed With Worst News Of Her Career After Election, She Screwed!!!  The news just keeps getting better for America!!!"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10156742074775354","commenter_b":"the millennials need to really research socialism & check out the countries that have it now & they are worse off than ever ...want to wait in lines for food? be lucky to get a loaf of bread, some milk & maybe a little veggies or fruit...guess they would change their minds if they really knew what that would do to this country....jobs worse, financially drained families from such high taxation etc...healthcare would be ...forget it...more deaths ...socialism is plain & outright destruction & more misery than this country could stand....then we'd have bigger problems with the refugees forcing their crap down our throats...is that what you want you idiot millennials?","commenter_a":"This millenial would like to thoroughly dissociate himself with most of the rest of the generation.","post_message":"GENERATION SANTA CLAUS?"},{"comment_id":"615536761924441","commenter_b":"It open season on black people out here...I swear..the day when the rabbit has the gun is almost near.","commenter_a":"Well world, what do you think of the greatest country in the world now???","post_message":"Remember little Aiyana Stanley-Jones? She was only 7-years-old and ASLEEP when a Detroit cop fatally shot her in the head. Now it's official: EVERY LAST CHARGE against the cop who killed her has been DROPPED! He will face NO punishment AT ALL!  Are you surprised?"},{"comment_id":"10153965474855579","commenter_b":"Oppose...no refugees, period.","commenter_a":"TAKE A LONG PAUSE.","post_message":"Syrian Refugee Program: Your Message to Congress? Support, Oppose or Take a Pause?"}]
