[{"comment_id":"875788715811158","commenter_b":"@webpagelink, watch this and tell me is this ridiculous?","commenter_a":"Worse than ridiculous","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10154627500178812","commenter_b":"Wow. Ugly duckling. This is the type of woman who supports men who want to take all your rights away, ladies. Feast on that.","commenter_a":"Shut up ABC, ones a Princess, the others a ugly duckling!! One upholds her beliefs, the other goes with the flow!! Referring to # 1 for the first gal, # 2 for the second picture.. ABSOLUTELY NO COMPARISON!! ABC, this would be called gender racism!!! Un Cool!!","post_message":"When you look at how much Chelsea Clinton and Ivanka Trump have in common, their friendship isn't so unbelievable."},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10155133952496162","commenter_b":"@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.\" Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"10154148875398721","commenter_b":"Vagitarian: when you vote for her because she has a vagina.","commenter_a":"In your lying phony dreams","post_message":"For many older women, voting for Hillary Clinton on Tuesday is about making history."},{"comment_id":"10153454337713984","commenter_b":"BITCH","commenter_a":"Garbage! They want us to kidos their feetj!","post_message":"This incident has led to calls for a boycott of United Airlines, but not everyone is jumping on board...  Do you think this airline attendant acted fairly?"},{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."}]
