[{"comment_id":"10154179510106409","commenter_b":"Lmao. Now she can STFU.","commenter_a":"Lol. Yes!!! I saw this coming and I'm loving it. Fall of the bully. Does she still want to fight Mayweather? Dwl","post_message":""},{"comment_id":"1242392142481615","commenter_b":"Scumbag.","commenter_a":"Is that hair under her arm. Yuk!","post_message":"TRASHY, AGING Pop-Star Madonna Uses Picture Of Pubic Hair To Recruit Females For Anti-Trump Inauguration March  ***WARNING***Picture contains partial nudity."},{"comment_id":"10154090084173690","commenter_b":"That will not happen, they will NEVER dominate Europeans. It would take a better class of people than the rough beasts who are now slouching toward Europe.","commenter_a":"Saudi Arabia and other rich muslim countries take in muslim refugees,,,,muslims have a big plan to dominate europ and later force Sharia laws on them","post_message":"Four Balkans countries have announced a daily cap on how many people can pass through and Austria has restricted entry for hundreds of thousands."},{"comment_id":"10153615775017235","commenter_b":"In actuality, the video is being shown in reverse to make the officer look bad. He was actually using his gun to pull bullets out of the man in an attempt to save his life.","commenter_a":"I can show you a video where it looks like a deputy shoved a mans face into the wall. Then when you see it from the other angles you will see that the man tripped and the deputy tried to reach for him.","post_message":"Watch this. This is awful"},{"comment_id":"604244696428800","commenter_b":"Don KorLeone","commenter_a":"son in front look lik Derrick Rose","post_message":"Police are looking for eight males who robbed speakers from a Crown Heights, Brooklyn Family Dollar and attacked an employee with shopping baskets on the way out.   Full story: @webpagelink"},{"comment_id":"973903779296042","commenter_b":"One of the stories the parents were arrested because they did it:( it wasn't an accident.","commenter_a":"I really enjoy reading all the comments by individuals who apparently parent in the most perfect way. (*said sarcastically*) It is so easy to judge someone else, heaven forbid some terrible accident happens on your watch and you have complete strangers calling for your head. In any case, my heart breaks for this family and the loss of their child.","post_message":"#BREAKING A 2-year-old has died after falling into an unsecured septic well near Burlington. >> kiro.tv/SepticWell  Henry Rosoff is heading to the area to learn more on this heartbreaking story."},{"comment_id":"815801661894546","commenter_b":"Kick them out of this country","commenter_a":"If you don't like the American flag, pick one you do like..... and move to that country you bunch of losers.","post_message":"Absolutely appalling."}]
