[{"comment_id":"10152733923177217","commenter_b":"Probably think females don't know anything about cars.","commenter_a":"Another keyboard warrior.","post_message":"TV presenter in Twitter break after Top Gear \"threats\""},{"comment_id":"10153416119358203","commenter_b":"WTF is wrong with these people? How could they do that to such an innocent life","commenter_a":"that's outright murder!","post_message":"‘This baby won’t stop breathing!’: Abortionist strangled baby born alive while nurses stood and watched"},{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because \"he thinks radical Islam is a passing phase.\""},{"comment_id":"758642314270568","commenter_b":"@username @username DAMMM SHUT DOWN","commenter_a":"Hilary is no Obama, she is WEAK. She is a sell out in moments notice. She has no platform. The democratic platform was handed to her by Bill.","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"10153161345041336","commenter_b":"Good for the wife!!!","commenter_a":"Hooray!!!!! McDonald is hiring!","post_message":"Donald Sterling gave his mistress V. Stiviano a Ferrari, Bentley, and Range Rover and also covered the majority of her $1.8 million duplex.  But his wife, Shelly Sterling, just got it all back."},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"10158310227560389","commenter_b":"I think they are GRRRRRRRREAT!!!!! For the first time in my adult life, in a long, long time, I feel very proud to be an American!!! President Trump has done more in his first few days, than Obama did in 8 years!!!! Thank God we are rid of Obama and his family!!!","commenter_a":"He is doing great as we expected doing what he said he would do !!","post_message":"Question of the Day: What do you think of the moves President Donald J. Trump has made so far?"}]
