[{"comment_id":"1215097765244658","commenter_b":"To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Theodore Roosevelt","commenter_a":"Obama top 5 worst presidents ever.","post_message":"President Obama delivers his first news conference since meeting with President-elect Donald Trump."},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"1267683656603525","commenter_b":"She has totally lost it, poor woman.","commenter_a":"Why can't the average Democrat see the pattern of off the wall psychotic behavior that has plagued the left for decades? Conservatives don't riot in the streets, have \"safe spaces\" where only we are allowed to speak, give participation trophies, or any of the other garbage. Conservatives use facts to make their points and progressives use emotions to emphasize their fake news and rally the infants rally the indoctrinated. The mass hysteria on the left is causing the country to lose focus on the threat of the real danger of the three prong attack on America and the one person at the center of all three. Barack HUSSEIN Obama is race baiting with his attacks on white cops which spurred into BLM attacks on all whites. He openly aids and encourages illegal immigrants. He built and carried in the Trojan Horse Muslim refugee program. Each of these are for the ...","post_message":"Jill Stein's crazy recount effort is over, and the realization of her epic failure launched her into a nutty rant. Stein seems drunk as she starts to shake and yell about Donald Trump, and it's really bizarre. During this strange outburst, she demands Trump  \"put down\" one thing that proves she is also delusional.  @webpagelink"},{"comment_id":"10154119835601770","commenter_b":"Give those real freaks, real deplorables if you will... a hand they know Clinton is one of them!!","commenter_a":"They feel sorry for the looser and I mean a dirty looser","post_message":"Remember when Vice President-elect Mike Pence was booed at 'Hamilton'?"},{"comment_id":"1046205432190874","commenter_b":"Paul, I'm in Columbus, too. Do you think this is a Trump thing?","commenter_a":"At 11:35PM tonight, we lost our feed for your show locally on CBS affiliate WBNS. I missed your monologue, but I'm sure it was just an alternative coincidence.","post_message":"Tonight on The Late Show... from the film 'The Comedian,' actress Leslie Mann, an interview with comedian Lewis Black, and from Schitt's Creek, actor Dan Levy!"},{"comment_id":"10153811785661486","commenter_b":"Aamen","commenter_a":"Wow","post_message":"A relative of Princess Diana, Prince William and Prince Harry has moved one step closer to sainthood."},{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."}]
