[{"comment_id":"10157208654565294","commenter_b":"Preach!","commenter_a":"God I wish we could stop talking about this guy. Who cares he's a waste and obviously doesn't want to try and help himself in anyway. Glad he's at least not on the Browns any more.","post_message":"\"I hate to say it but I hope he goes to jail. I mean, that would be the best place for him.\""},{"comment_id":"10153809270614454","commenter_b":"Hurrah! Hurrah! Hurrah!!!","commenter_a":"Couldn't happen soon enough. Long overdue .","post_message":"ICYMI: This week, Hong Kong pledged to ban the import and export of Ivory goods. #SaveElephants"},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"10150531763884999","commenter_b":"These tacky foreigners need to leave. Find another city to hide your tax-free money in. Please!","commenter_a":"Jia Ying Kho","post_message":"He may be a 'whale' at the clubs, but he's also spending millions on high-end New York real estate."},{"comment_id":"1625836147707451","commenter_b":"That would be very hard for her to do.","commenter_a":"Why wait, just blow your brains out. Wait, that's why you said that, you don't have a brain","post_message":"Typical Hollywood liberal with an overreaction to everything."},{"comment_id":"10153773357374877","commenter_b":"WTF... Where I live... White people be blasting they music so cut the crap!","commenter_a":"Ugh","post_message":"Driving While Black: Cops drag black man from his car and Taser him for playing loud music.   Grio fam, this is wild!"},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."}]
