[{"comment_id":"1590956274524819","commenter_b":"I won't stay there","commenter_a":"The should arrested the hotel owners and the stupid cops that arrested the veteran.","post_message":"I am boycotting this hotel. Veterans deserve BETTER!"},{"comment_id":"10153420455089087","commenter_b":"Oh Brett. That's terrible. I am the wife Brett. I live in Texas, 10 generations next door to Mexico. Are there bad people there coming here? yes! Do we need immigration laws? yes! Will a wall stop it. No Brett. It wont matter how beautiful the wall is or how much it cost or who pays for it. Those drugs you smoke are going to make it here. Nothing you can do about it. The cartel will get immigrants and dope here. If anything there will be more killing and keeping that wall up is going to be draining on the economy. It's impossible.","commenter_a":"Trump's ability to showboat and boast out loud has a hypnotic impact on people who should know better. Please don't buy into Trumpmania.... he is all talk and I thought we were tired of that. You people have short memories. He was a full on liberal democrat just a few short years ago. Trump is telling you what you want to hear. He has no intentions of fulfilling these vocal obligations. It's all lip service and he will cater to his businesses before the people. Just because Bush isn't a loud mouth narcissist doesn't mean he can't get the job done. Trust me, you will never be so sick of anything as you will be of The Donald and his ego driven power play.","post_message":"“Donald I’ll take you on one-on-one in a debate, any time, any place,” Jeb Bush declared. “You name it and I’ll do it.”"},{"comment_id":"470542439803003","commenter_b":"He","commenter_a":"If she was a man...say so.","post_message":"Michelle thought she could have her way, boy was she wrong.  She forgot that there are still real Americans ready to expose her, we support them 100%.  Do you support their stand against Michelle?"},{"comment_id":"10153091862830329","commenter_b":"Some women like to be told.","commenter_a":"This world needs to stop being offended by everything, and just let people live their lives.","post_message":"A pledge email from the University of Southern California’s Alpha Chi Omega chapter published by Jezebel today shows how authoritarian the sorority’s rules are for things like hair color, eyebrow shape, and required Spanx wearing."},{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"1827275810826011","commenter_b":"Fuck you, bitch. Your head is up your little ass.","commenter_a":"vote for none of the above, the masses need to start a revolution and jail the corrupt 1% who pretend to give democracy in a nwo dictatorship , wake up and fight for your human rights","post_message":""},{"comment_id":"1211132575573437","commenter_b":"In the end, no ones opinion will matter; only God's word... Read it... One God, One way to heaven and One way of marriage- Man and woman... not two men, or two women or two women and a man or one man and 10 women.... Marriage is between a man and a woman...The bible says be fruitful and multiply so if you want to convince bible believers, let two men physically produce an offspring from their body or two women or one woman without the help of a male sperm .... that alone should convince you it's not natural or right...","commenter_a":"Gov needs to step in and force her out!! Call for that emergency meeting and have her step down!! Why are we entertaining this woman...","post_message":"\"Davis is simply wrong,\" lawyers for Kentucky Gov. Steven Beshear said."}]
