[{"comment_id":"1310724188980341","commenter_b":"This woman has nothing better to do.","commenter_a":"idiot","post_message":"Hey, stop \"appropriating\" our language..."},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"10152649909240950","commenter_b":"Yeah you stupid pussy!","commenter_a":"We'll all be speaking ISIS by Sunday","post_message":"Here is what would happen if DHS runs out of money on Friday:"},{"comment_id":"10152542079335927","commenter_b":"What state elected this Muslim trash","commenter_a":"Minnesota has a Muslim problem. There has been over 40 of its citizens gone over to the Middle East to fight for ISIS. The liberal democrats will welcome these terrorists make to the United States with open arms.","post_message":"It's a tricky situation preventing money from getting into the hands of terrorists."},{"comment_id":"2049822328577410","commenter_b":"@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"\"Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.\" - Bill Moyers and Michael Winship"}]
