[{"comment_id":"10153391344478352","commenter_b":"Crazy mother sucker","commenter_a":"Oh boy! Here we go! Before it starts, dont blame nothing on Islam.They went blowing up people out of their own desires.Islam had nothing to do with it.","post_message":"Car-jacking victim of Boston bombers tells court how they admitted to terror attack, demanded GPS to get them to New York and played CDs of ‘religious music’"},{"comment_id":"10153263722107411","commenter_b":"Hold my dick!!","commenter_a":"Yea , meanwhile the murder capital award goes tooo","post_message":"THIS JUST IN: Mayor Rahm Emanuel is expected to introduce an ordinance that will raise the minimum age to purchase tobacco products from 18 to 21."},{"comment_id":"10154682154393984","commenter_b":"She's the whore of Babylon","commenter_a":"Let me tell you all her dx.......she needs Jesus Christ!!! Maybe she is possessed by a demon, highly likely......! God has allowed her to come to ruin because she wont turn from her wicked ways.....for those who do not like my comment.....read your bible, you will find out lots a things God allowed to turn people away from sin!!!","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems.  Could this expert be right?"},{"comment_id":"786579818199262","commenter_b":"He SUCKS DICK..........","commenter_a":"Dangerous would be the truth.","post_message":"BREAKING: Obama Makes Sickening Announcement, This Will Cost Lives  He will ruin this country before his term is up.  Do you think Obama is reckless?"},{"comment_id":"1214762191878123","commenter_b":"🙈🙈🙈🙈","commenter_a":"Beynimde... 😱😱😱 @username","post_message":"This was living in her brain."},{"comment_id":"929005763900127","commenter_b":"Not as pathetic as your lying Hillary.","commenter_a":"Trump even takes a GOOD idea like term limits at EVERY level of elected governing and ruins it with his hate, ignorance, and by being the WORST candidate for President ever his pathetic nothingness and lack of depth daily shows how weak and what a fraud this TRUMP is. Pathetic. LISTEN LEARN THINK FEEL and VOTE smart.","post_message":"Donald J. Trump has vowed to limit House members to a 6 year term and Senators to 12 as part of his broader plan to \"drain the swamp\" and reduce the amount of influence lobbyists have in Washington.  Read more: @webpagelink"},{"comment_id":"10153424422192377","commenter_b":"cruz wants megyn on his side, strong women has nothing to do with it.","commenter_a":"Give me a break!!","post_message":"\"Listen, I know that Donald — it makes him feel really tough; it makes him feel like a very, very big man to threaten people. And in particular, he seems to have a problem with strong women,\" Cruz said. \"I don't know why that is, but it seems to really bother him.\""}]
