[{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10153941418821167","commenter_b":"Nope! He's going to insist that the debate was rigged.","commenter_a":"I haven't seen a whooping that bad since my cousin said the F word in front of Grandma. #KillaryKilled #TrumpTucksTinyTail #debates","post_message":"\"Overwhelmingly Hillary Clinton\""},{"comment_id":"10154606331071037","commenter_b":"She will not become president!","commenter_a":"I will wait and see what he does when he is actually president this is just all talk for the votes on both Hillary bringing in all the families from Ferguson and the parents from the Military we need someone to fight for the people not against each other we already have enough of that.","post_message":"“What is Trump? He’s not a Republican. Absolutely not. Those are not the Republican principles. He’s not a Democrat. He is just himself. He is egocentric.”"},{"comment_id":"10152808147960927","commenter_b":"That is a disgrace and a dishonor to our nation's flag god help us people needs to open their eyes and stop being stupid!!!!!!!!!!!........","commenter_a":"Just filthy sexual habits","post_message":"MLK's niece warns on gay marriage: 'God will have the final word in this matter.'"},{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"},{"comment_id":"10153097755761323","commenter_b":"\"Oh, climate change beat ISIL.\"","commenter_a":"I wish I never clicked on the comments.","post_message":"\"Using the weather as a weapon to subjugate the globe sounds like the modus operandi of a James Bond villain\""},{"comment_id":"10156869276120725","commenter_b":"Thank you Wisconsin! #TRUMPTRAIN #makeamericagreatagain","commenter_a":"The era of appeasement is coming to an end! They are only making the majority stronger and more galvanized than ever! All are welcome on the Trump Train - GO TRUMP!!! #Trump2016 #TrumpTrain","post_message":"THANK YOU, AMERICA! I love you!"}]
