[{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"10154130637278352","commenter_b":"I'm positive with all the comments you got some backlash lol, but keep in mind they're fucking disgusting bitches ha ha ha ha","commenter_a":"There's nothing wrong with breast feeding, but this is disgusting to put your almost 4 year old on the boob.... Want your child to drink your breast milk? invest in a pump....","post_message":"Mother defends breastfeeding her three-year-old son claiming cows' milk is bad for children as she encourages more women to feed toddlers this way"},{"comment_id":"10153569375843203","commenter_b":"Unless Rosie O'Donnell is raping you, she isn't forcing herself on you. I know many gays and I must be lucky to have escaped their revenge and then forcing their lifestyles on me since I'm still straight. Rosie O'Donnell is and always will be a loudmouth and a celebrity. Don't like it? Don't watch her.","commenter_a":"..Many of them are miserable, intolerant people hellbent on revenge ,forcing their lifestyles on others, and making everyone else miserable also.....Example : Rosie O'Donnell - one of the most miserable, intolerant people forcing herself onto the public...","post_message":"Study finds homosexuals less healthy, happy than heterosexuals    @webpagelink"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10154364197411336","commenter_b":"Lady you are unbelievable","commenter_a":"Chris Kyle: American Liar","post_message":"A federal appeals court has thrown out a $1.8 million judgment awarded to Jesse Ventura, who says he was defamed in Navy SEAL Chris Kyle's book \"American Sniper.\""},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"}]
