[{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"763776567072060","commenter_b":"F**k em both... Let's \"take em out\" ....","commenter_a":"Anyone who couldn't see this before is blind. Those two have always been allies.","post_message":""},{"comment_id":"1724725117769666","commenter_b":"Hey Matt good thing she doesn't have a dick or you would be down sucking it","commenter_a":"No. She is above the law, and we all know it.. Anyone else would have been charged by now!","post_message":"Hillary Clinton has just declared that there's \"not even the remotest chance\" that any charges against her will stem from the investigation into her emails, but I am sure MANY Americans are hoping she's wrong..."},{"comment_id":"10154062407918812","commenter_b":"The kids in low income areas would just grow up as failures and,we'd support them as inmates. Abortion is cheaper in the long run, and saves people from being victims of their future crimes.","commenter_a":"$500,000 doesn't compare to the $500 Million taxpayer dollars that go to the organization that is (Un)Planned Parenthood, strategically placed in low income areas across America and helps thousands of new mothers kill their own children in their own wombs. Can the Fed do something about that??","post_message":"Oregon governor says armed group’s continued occupation of federal land has cost taxpayers nearly $500,000."},{"comment_id":"519848751523867","commenter_b":"Zel Zainoor and Arez Ezman does this help?","commenter_a":"Psyco people now have an excuse to feel normal.","post_message":"Don't you just want to squeeze him?"},{"comment_id":"10154240737001323","commenter_b":"Too bad she is going to lose in November, she won't be able to cheat so easily then","commenter_a":"Trump a sure winner","post_message":"Hillary Clinton declared victory over Bernie Sanders Tuesday."},{"comment_id":"1247830038560637","commenter_b":"Don't care! Neither of these boobs is worth 2 shits under a bird! Garbage on two feet both!","commenter_a":"NEVER WILL BE THE BEST FIRST LADY. GO TRUMP.","post_message":"Will voters care about controversy over Melania's speech?"}]
