[{"comment_id":"10154024040699497","commenter_b":"Stop being such a pussy!","commenter_a":"And people are just standing for this? I follow the Onion, and certainly didn't fall in line with Justice Scalia's opinions, but let me tell you this - this is a new standard of low. I could leave a brief comment, but this is so far beyond the usual pallor of any statement even a satirical form of journal should ever make, I find myself disgusted into making a statement. As human beings, we are all equal in death, but as Americans, we are something more. We are held to a certain equity of values that we inherit no matter where we fall on the narrow spectrum of political attitudes held in this country. And I am personally offended by the scrapping masses of groundlings hurling insults about a dead political figure before his family had even had a chance to attend the funeral. Shame on all of you. Good ...","post_message":"BREAKING:"},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"10153363421176438","commenter_b":"Whore = prostitute. Whole other issue.","commenter_a":"yea its true...normal guys care and dont really want to settle down with a past whore","post_message":"Trainwreck says straight men care about their girlfriends’ “number.” Is that true?"},{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."},{"comment_id":"820665888078295","commenter_b":"Silly woman","commenter_a":"Wtf? Isn't non schooling illegal (and 5... That's stupid... once they are on solids why breastfeed?)","post_message":"Neither of her kids can read as she refuses to let them go to a mainstream school."},{"comment_id":"10156008718310354","commenter_b":"Omg still an ugly turd inside and out. Who cares what this bitch thinks or says!!!","commenter_a":"Yeah.... there is someone with less class than a pig.","post_message":"Just when you thought she couldn't be any more vile..."}]
