[{"comment_id":"10153128957476523","commenter_b":"And yet you probably voted for a whore for governor.","commenter_a":"You know what prevents STDs? Not being a whore.","post_message":"Health officials in Racine pass out free condoms to reduce STDs, but not everyone’s happy. FOX6's A.J. Bayatpour has the story:"},{"comment_id":"10152692455750950","commenter_b":"Bullshit...gay people are a disease and should be eradicated....I say we boil them alive in acid","commenter_a":"these people are a minority forcing their perversion on everyone else. So when are the pedophiles and rapist going to start marching too","post_message":"LGBT groups march in Boston St. Patrick's Day parade @webpagelink"},{"comment_id":"470542439803003","commenter_b":"He","commenter_a":"If she was a man...say so.","post_message":"Michelle thought she could have her way, boy was she wrong.  She forgot that there are still real Americans ready to expose her, we support them 100%.  Do you support their stand against Michelle?"},{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"10153860707103812","commenter_b":"@username So she should just be allowed to sit there and disobey?","commenter_a":"Guess you should do what your told instead of thinking your above the law because your a minor. This should happen more often. It is no wonder law enforcement is backing down because everytime they do thier job they get ridiculed.","post_message":"WATCH: Video shows uniformed deputy grab a female high school student and wrestle her out of the seat and to the ground. @webpagelink"},{"comment_id":"1136375496397870","commenter_b":"SHE IS A DEMON POSSESSED WOMAN.","commenter_a":"Yes put Her in Prisone for life. For all the life's she took. Hillary Clinton we know what your up to and trust me God has not forgotten about you either.","post_message":""},{"comment_id":"10154224264151500","commenter_b":"@username ur queen is pregnant","commenter_a":"Kristina Vinson twins omg","post_message":"The Carter family grows."}]
