[{"comment_id":"10152703657281051","commenter_b":"This woman is clearly abusing the system!","commenter_a":"Christine I enjoyed reading your comment I too came from a family of 11 I'm number 10 my daddy was the sole provider he injured himself and was off of work for a couple of months my mom said they had to get assistance which was very hard for my father when he returned to work he paid every cent back its funny how people can respond so quickly maybe we should just pray","post_message":"This mother of 11 lives almost entirely off government benefits. Last week, she announced some big news."},{"comment_id":"10153717683207894","commenter_b":"@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"10153695954333984","commenter_b":"Carly should be in the prime time debate","commenter_a":"We need a female leader on that stage who isn't whining \"i'm so week and gutless I need a man or goverment to get me better pay and by my birth control for me.\" A real grown up woman who can take a blow and still be standing. Go Carly go","post_message":"Despite a pretty big poll surge, this 2016 Republican candidate may be kept off main debate stage again...  Do you hope to see Carly Fiorina in the next debate?"},{"comment_id":"950131068413281","commenter_b":"Women have had the right to vote for 90 plus years males much longer. We have had no choice in gender on voting. We have a choice now. I believe in choice. Every time s women has tried to run both parties go out to wipe them off the earth. The surprise is people still fall for this game.","commenter_a":"My vote is going to Hillary not another old white man","post_message":"A great point."},{"comment_id":"10152864782686336","commenter_b":"Musa, you're butt ugly!!","commenter_a":"Please disclose his identity so that these western pigs would stop blaming islam for all their atrocities.","post_message":"Breaking News: 1 of 3 suspects in Paris terror attack surrenders to police, French judicial official tells the Associated Press. @webpagelink"}]
