[{"comment_id":"10155201433711320","commenter_b":"There's no Native American blacks and Latinos in Eastern Europe. The perfect place for RACIST AMERIKKKA","commenter_a":"Yeah the country is being lead by white supremacy you people find this okay?? oh wait a minute...This is RACIST AMERIKKKA. WHAT more can you expect.","post_message":"This is a live look at Washington, D.C.  Are you pleased with what our nation's leadership is doing right now?"},{"comment_id":"1136375496397870","commenter_b":"SHE IS A DEMON POSSESSED WOMAN.","commenter_a":"Yes put Her in Prisone for life. For all the life's she took. Hillary Clinton we know what your up to and trust me God has not forgotten about you either.","post_message":""},{"comment_id":"1080774725297647","commenter_b":"Given the history of Egyptian-Israeli relations it doesn't seem at all out of place","commenter_a":"We salute Egiptian people. This reminds us of GEORGE W. BUSH lrt him try to fly to Iraq there will be rain of rotten shoes on him","post_message":"An Egyptian lawmaker has been attacked with a shoe in parliament after he invited the Israeli ambassador to Cairo for dinner."},{"comment_id":"10154190789236336","commenter_b":"This is so exaggerated. I bet this was seen as an opportunity and she had someone else bruise her. She did not almost go down and showed no pain or upset on the video. She also shouldn't have approached Trump like that in the crowd. His life has been threatened so someone would have pushed her back. Maybe she should stay home. Also it sounds like this is her M.O","commenter_a":"Too bad...she wasn't in ANY way hurt...she's shooting for her 15 minutes of fame...","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"1741105056106659","commenter_b":"BWAHAHAH AND THAT'S WHAT MAKES AMERICA GREAT!","commenter_a":"Carla Stovall Jeanne' Cleopatra Thompson Anthony Stovall BLOOP!!!!","post_message":"TRUTH: Kaepernick's critics are failing to see the larger point. Roland Martin nailed it with this one.  Shared by Occupy Democrats, LIKE our page for more. Video from MSNBC."},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"496840043839909","commenter_b":"No she should not!!!!!!","commenter_a":"well at least something can move them","post_message":"America in uproar after this Sarah Palin Picture leaks.  We stand behind her 100%. We need to show her our support.  Should Sarah Palin Refuse To Take Down This Picture?"}]
