[{"comment_id":"10153522493691167","commenter_b":"Wow I wish this guy would go away","commenter_a":"He is who? A old confused white guy","post_message":"Nope."},{"comment_id":"10153744432513984","commenter_b":"Keep hammer at them. Abortion is murder.","commenter_a":"I like Trey Gowdy...good for him.","post_message":"BOOM! Gowdy just laid the smack down on libs and Planned Parenthood with a series of hard-hitting questions that totally undermined the arguments in favor of abortion.  Do you support Trey Gowdy's fight to defund Planned Parenthood?"},{"comment_id":"10153746708116770","commenter_b":"That's the style whores wear today","commenter_a":"She's need to be excuted !","post_message":"Holy sheer."},{"comment_id":"655930237930888","commenter_b":"Shut up fat ass racist bitch","commenter_a":"Yes","post_message":"Oprah goes on a ridiculous rant about why Americans 'disrespect' Obama.  Get this liberal trash of the air already.  Do you think Oprah is the racist?"},{"comment_id":"10154233484170496","commenter_b":"She's a smart woman","commenter_a":"At least she kept her yap shut","post_message":"What do you think of Lady Gaga's Super Bowl halftime performance?  PHOTOS: @webpagelink  (Photo by Patrick Smith/Getty Images)"},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"}]
