[{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"},{"comment_id":"1420287694697641","commenter_b":"So where should she be deported for blatantly taking advantage of British taxpayers?","commenter_a":"Reminds me of my mum 9 kids 3 adopted. 4 in care and 2 stayed with her if you cant look after that many kids don't have them ! Keep your legs closed and get your tubes tied !! Why they didn't do that anyway is beyond me","post_message":"'She should have had her tubes tied'"},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"1147885218663043","commenter_b":"@username , no wall is going up! 😂","commenter_a":"His supporters don't care having an asshole for president , they just wanted a white man .","post_message":"Trump's supporters are not going to be happy about this."},{"comment_id":"10154156847317623","commenter_b":"This has got to be the dumbest comment I've heard in a while. You and the Cash Me Ousside chick should go hang out and play in traffic.","commenter_a":"Who puts a three month old into daycare??? Mom is so concerned etc. But that three month old needs his/her parents not daycare workers anyway. Plus no charges should be filed if daycare was not made aware of the lactose intolerance. Sounds like a lil neglect on both sides of this. Plus whoever took the video should have stopped this from even happening. This worker although breaking the rules was trying to help out a baby who is clearly already in duress when the parents should be the one taking care of them at such young age. I can almost bet that mother is more mad she had to take her kid to the hospital and missed out of her drinking time and watching tv time. Thats just my opinion!","post_message":"A North Carolina mom says a day care worker breastfed her 3-month-old son and made him sick."},{"comment_id":"1461455587203411","commenter_b":"Some aren't. I guess this is part of \"Make America Great Again\". I'm confused. I'm mad. I'd laugh, but I laughed that Trump was running for President and laughed at the circus the ensued. Now look where he is!!!!","commenter_a":"Seriously? This has gotten completely out of control. We are better than this.","post_message":"After national polling indicated an extreme gender gap among presidential support, some Trump supporters took to Twitter to demand a repeal of the 19th amendment — which in 1920 gave U.S. women the right to vote."},{"comment_id":"10157959432550354","commenter_b":"She belongs in prison. Trump for all Americans","commenter_a":"Poor behavior is poor behavior, no matter who does it! Teachers are now reporting a sharp rise in bullying and rude talking out and racist comments directed at other children after Trump began his campaign. If you are acting like an idiotic, alt-right Trump supporter at home, your children are seeing and hearing this and thinking this is how people should act. Stop it now! You are creating a whole new generation of haters.","post_message":"\"I believe they were paid to come attack Trump supporters.”"}]
