[{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"},{"comment_id":"1387099161383134","commenter_b":"No, your mother giving birth to a bitch was","commenter_a":"Oboma is a scared ass chicken shit bitch","post_message":"CHECKMATE."},{"comment_id":"750651481734699","commenter_b":"Sounds to me like the other parrents in the school system should demand the girls immediate expulsion for the good of their own children.","commenter_a":"Fuck that cop if that was my daughter he'd be a dead mother fucker","post_message":"This could be BIG. Does this change your opinion on the whole incident?"},{"comment_id":"10153268434242061","commenter_b":"we're proving it as we speak. record rainfall here in texas and it's still not over. weather is weather, period.","commenter_a":"Kevin Michael Wahler","post_message":"This is Buffalo in 2014 and 2015. First time the city has had no measurable snow in 116 years."},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"10153897957233352","commenter_b":"Stfu","commenter_a":"He was a menace to the world. He destroyed so many lives so that he can so call keep the children of Columbia to stay away from drugs. What a bum. He destroyed lives right here in the USA., way too many.","post_message":"My life with the world’s most infamous drug lord: Pablo Escobar’s son reveals the heartbreak, fear of violence and how his father once burnt $2MILLION in cash to keep warm one night on the run"},{"comment_id":"10154793363900575","commenter_b":"Fucking right a wall","commenter_a":"You have a wall? Why you so upset ?","post_message":"THE WALL JUST GOT 10 FEET TALLER..."}]
