[{"comment_id":"1080661608696757","commenter_b":"Stfu!","commenter_a":"Way to go Lebron!! Millionaire rappers should do rap outs in support of someone who pointed an EXACT replica of a Colt 1911 at police. Yes it was a pellet gun, but if the child was educated at home on gun safety and how to never point anything that resembles a gun at police officers he would be ALIVE today.","post_message":"\"This issue is bigger than me; it’s about everyone. And gun violence and tragedies and kids losing lives at a young age, some way, somehow we need to understand that that matters more than just an individual.\"  - LeBron James"},{"comment_id":"1282426895139188","commenter_b":"Build That Wall","commenter_a":"So sad! Blue lives matter","post_message":"LIVE NOW: Procession now underway in the LA area, for an officer who died in a shooting there this morning. FULL STORY: @webpagelink"},{"comment_id":"10155238822815579","commenter_b":"In 2016 he US allowed 38,901 Muslim refugees also 37521 Christian refugees.","commenter_a":"In a practical sense, Obama had a ban against middle eastern christians. He seemed pleased they were being made victims of genocide, instead.","post_message":"President Trump: \"World Is A Mess & Angry\" - AGREE or DISAGREE?"},{"comment_id":"10154475429571336","commenter_b":"One could only hope. But she seems to be too slimy to catch!","commenter_a":"Wikileaks founder, Julian Assange, has said that Wikileaks has obtained information that, when released soon, will guarantee a Hillary Clinton indictment. During a recent interview with ITV, Assange said his next release will “provide enough evidence” to see Hillary arrested.","post_message":"At the Veterans of Foreign Wars VFW convention, Donald J. Trump slammed Democrats for not mentioning ISIS during their DNC speeches. @webpagelink"},{"comment_id":"1383456038414113","commenter_b":"We got the house the Senate and the White House. LOL your liberal agenda happen no more.","commenter_a":"TWO YEARS...VOTE EVERY ONE OF THESE BASTARDS OUT!!! They have proven by pass this legislation that they are unfit and untrustworthy to serve the people that they purportedly \"represent!\"","post_message":"They're so brazen..."},{"comment_id":"10154742195526178","commenter_b":"The X miss universe is Hillary's friend plus the miss X universe is in a world of hurt on her own now she's in trouble with the law","commenter_a":"RUSH: The thing that's ironic about this, they're claiming that Donald Trump bullied this ex-Miss Universe. Has anybody asked about Hillary Clinton bullying all of the bimbos that have erupted during the course of her and her husband's political career? This is so screwed up. If there is anybody in this campaign who doesn't pay women what she pays men in her office, it's Hillary Clinton. If there's a woman in this campaign that bullies other women and has been acclaimed for it, it is Hillary Clinton","post_message":"Now First Lady Michelle Obama is getting into it with Donald Trump."},{"comment_id":"1112768188788371","commenter_b":"This is his third baby mama. The guy is an absolute psycho and she is a dumb doormat.","commenter_a":"It's not about breastfeeding. It's domestic violence. He has strict rules for his partner, including this new one related to breastfeeding. He's a controlling arsehole.","post_message":"He wants his wife to stop breastfeeding when their son turns 8 months old."}]
