[{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"942747445773052","commenter_b":"BUTT UGLY !!! Just NASTY. Please Leave.","commenter_a":"Who cares if she leaves the country?","post_message":"If only...[Read Below]"},{"comment_id":"10154163706682908","commenter_b":"The insurance companies own half our congress. That's why. Obama had to settle for the ACA. Couldn'tget them to bring single payer to the floor.","commenter_a":"The reason we spend the most with the worst outcomes is because we save people who wouldn't have ever had a chance elsewhere in the world. Our 911 system is a model for the global community and have a lots of saves who would've died elsewhere. The people that we save and live often go on to live on ventilators and long term care. Ever been to sub-acute hospital? That's where all $ to outcome ratio goes out the window. Are you going to be the one to tell someone you're pulling the plug on their ventilator because they are costing too much?","post_message":""},{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"647476645408815","commenter_b":"Please don't get me started on this WITCH","commenter_a":"HAHAHA Hillary blasts Trump for being a parent! Trump went to Scotland to support his son for building the golf course! He was being a father! Hillary is the one who can't handle business. She lost $6 billion on her watch.","post_message":"Hillary Clinton blasted Donald Trump, saying during this time the U.S. needs a leader that will \"put the interests of the American people ahead of their personal business interests.\" What do you think about this?"},{"comment_id":"1711622465785020","commenter_b":"Let us take a look @ a hypothetical example? Every house in your neighborhood left all of their doors & windows wide open when they were home & when they went away. When they returned some had many people living in their home that refused to leave, use everything that they work years for. Took over the master bed room & some decided to kill their pets for religious reasons. Others kill neighbors as they walk home. The neighborhoods within 100 miles of your home became rapid with sex trafficking, drugs, gangs, shootings, suicide bombing, & more. Will U still leave your doors, windows wide open? Would U want better protection from unwelcome intruders? U may even ask for a gated community. So Y would anyone get upset about Trumps logic on protecting America. Build a wall, only let legal immigration through our front doors. Build a strong military & ...","commenter_a":"BELGIUM JUST ENDORSED TRUMP! #BRUSSELS #VOTETRUMP @webpagelink","post_message":"**BREAKING NEWS**  I agree!!"}]
