[{"comment_id":"10153629371177235","commenter_b":"Gay marriage Trumps Straight Marriage, get lost Huckabee:)","commenter_a":"Down with Huckabee, as Donald would say, LOOSER..... .","post_message":"If God already 'solved' racism, he didn't do a very good job ..."},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10157784004785206","commenter_b":"Those poor girls should be removed from her household. Smh.","commenter_a":"SHe WIggity Wack!","post_message":"Nina Peterson has made over $1 million being a companion to older rich men, but she insists she’s not a prostitute."},{"comment_id":"10153448119649753","commenter_b":"What a great idea, Helen! Let's all go out and buy guns and have daily shootouts in the malls of America! If I had a choice between keeping you here or one of the Muslims I know, I'd pick the Muslim.","commenter_a":"They were Muslim terriost keep your guns ready if you don't own one get one get a carry permit if you go to the mall take your gun we have to stop them obummer wants to protect them wants to let more in write your govnor insist we don't want them here","post_message":"ISIS has reportedly claimed responsibility for the San Bernardino, CA shooting that took place on Wednesday, December 2. For the past couple days, the Federal Bureau of Investigations has only speculated that the shooting – which claimed the lives of 14 victims and left 19 injured – was an act of terrorism, but have not confirmed. Now, the come forward with a chilling statement about the San Bernardino shooting and the Muslim newlyweds responsible for the massacre – Syed Farook, 28, and his... @webpagelink"},{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to \"The Great American Melting Pot\"? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"844826018983911","commenter_b":"Not even close Alex... Talk about a swing and miss.","commenter_a":"Unconstitutional. Pass it all you want. Taxing something that's a Constitutional right represents an undue burden (exactly what the tax is intended to do).","post_message":"It all makes sense now....THIS is how they're going to stop people from getting guns. They don't need a ban at all..."},{"comment_id":"1054840971250301","commenter_b":"Whats wrong with a severed finger ride. That's what it looks like!","commenter_a":"this world gets stranger by the day, disgusting","post_message":"Because why not?"}]
