[{"comment_id":"1307596852595922","commenter_b":"Bangkok, Thailand","commenter_a":"Seoul","post_message":"Check out this LIVE rocket launch! Shortly, a Russian rocket will launch from Kazakhstan and travel to the International Space Station, and you can watch it LIVE right here. This is an uncrewed rocket, and it will deliver food, fuel, clothes, and other supplies to the astronauts on board the ISS. Where in the world are you watching from?"},{"comment_id":"10153580791529170","commenter_b":"She is so stupid she thinks she Smarter than anyone else but Slick Willie has been out fooling her all of her life","commenter_a":"i guess im stupid","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"946981455339195","commenter_b":"Lesbians...ya gotta love 'em, or give 'em to ISIS to be burned alive.","commenter_a":"Al Sharkton must go too!","post_message":"Well, that's one way to go out."},{"comment_id":"10152972323790950","commenter_b":"Sick bastards!!!!","commenter_a":"For now...I am going to let this investigation work itself out for evidentiary findings. Meanwhile, I choose to hive him the benefit of the doubt. Such is the way we were taught in college.","post_message":"BREAKING: Subway spokesman Jared Fogle is a suspect in a child porn probe, a law enforcement source says."},{"comment_id":"10153867019782061","commenter_b":"That was good","commenter_a":"What an idiot.Typical liberal though.","post_message":"WATCH: Penny-wise or penny-foolish? Man decides to pay a fine with 22,000 pennies, but over-paid doing so."},{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"10153634685079255","commenter_b":"You are ill informed at your preference. REAGAN was the first president to turn a blind eye with a wink = let the Latinos and work for way below minimum wage as we all get RICH RICH =GREED TAKES OVER AMERICA AND BLATANT HATE ABOUNDS.","commenter_a":"Typical Democratic attack. People, the bottom line is this: ENFORCE THE IMMIGRATION LAWS already in place!! The Republican attacks on immigration are soley to counter Hussain Obamas illegal actions concerning immigrants! We as a Nation CANNOT AFFORD what his policy is going to do us! I believe we all know Thuh Donald's ideas are out of bounds, what is your solution?? I don't want to see children born of illegals deported,.. I do want to see those families placed into the process of becoming American citizens. The system is broken and quite frankly NO ONE has an answer to fix it, all you want to do is bitch about the other party. Politics as usual...","post_message":"Nailed it.  By Daily Kos user and AFL-CIO President Richard Trumka"}]
