[{"comment_id":"600616960147229","commenter_b":"@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"843353782366711","commenter_b":"Not soon enough I cannot stand she's a pathetic liar a disgrace to our country","commenter_a":"Oh please let it be! Haven't we suffered enough?","post_message":"Hillary EXPOSED!"},{"comment_id":"10153075277316770","commenter_b":"This hag is despicable,","commenter_a":"anything that comes out of this woman's mouth is bullshit just saying","post_message":"Debbie Wasserman Schultz says Republicans \"alienate women, alienate the LGBT community... [and talk] about it at their debates. Kicking immigrants out of this country, talking about taking away healthcare from Americans, talking about which candidate is worse for women and take their healthcare away, deny their rights, oppose equal pay for equal work.\""},{"comment_id":"10152627900846680","commenter_b":"We need to get rid of lowlife like Amy Klobuchar and her fellow treasonous, America-hating Democrat scum...Loretta Lynch is proving she'll be another Holder...we don't want nor need her to continue breaking laws for Barry O.","commenter_a":"The now extreme right GOP, are now preaching that all democrats/Liberals are lawless. Ted Cruz as a the son of an exiled ultra conservative and enraged anti-Castro Cuban, was brought up to think by his father, that all Liberlas are Communist and are out to overthrow the US government. I quess according to the GOP and Ted Cruz's definiton of Liberalism, which he defines as lawless, John Locke, one of the fathers of Western liberallism, who inspired the writers of the American Declaration of Independnece like Thomas Jeffersen, were all lawless! If this is true who is then lawless...","post_message":"Sen. Amy Klobuchar: \"So why has her nomination languished for nearly four months — longer than any nominee for attorney general in recent memory? And why have senators like my colleague Ted Cruz insisted that she is somehow lawless?"},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"1272162789512502","commenter_b":"She couldn't pay me enough, so I know Trump never tried. What a wrinkled up hag.","commenter_a":"They were all paid of course","post_message":"BREAKING! Newly leaked information shows Jessica Leads, who's accused Trump of raping her, has VERY CLOSE ties to Clinton Foundation.  This is NO COINCIDENCE! The timing of these accusations with these new facts about Leeds are TOO HARD TO IGNORE!!!!  Let's get 3,000 SHARES to spread the TRUTH about these rape accusations against Trump!"},{"comment_id":"10154496338258525","commenter_b":"Would love to see more of Bindi, Robert and Terri would love a show from the zoo. Steve will always be one of the greatest wildlife conservationist to have ever graced us with knowledge and just a fun loving man truly missed","commenter_a":"Crykie I miss him","post_message":"REMEMBERING STEVE IRWIN: His daughter, Bindi, who continues to walk in her father's footsteps, posted a touching tribute to The Crocodile Hunter on what would have been his 55th birthday. Rest in peace, Steve Irwin. \"Always in our hearts.\"  STORY: @webpagelink"}]
