[{"comment_id":"449537148504213","commenter_b":"Lindsay Graham needs to shut the Hell up","commenter_a":"I guess I am part of the dark side and this asshole is one of the bright politicians that are bankrupting America!??","post_message":"Lindsay Graham made this highly controversial comment about Donald Trump. Do you agree or disagree with him?"},{"comment_id":"10154803405263128","commenter_b":"@username - worked at Her campaign she is the most corrupt person with Her $150 million from countries w Sharia Law - Killary wants globalization. Google Bilderberg Group","commenter_a":"I've lived in Utah for almost 3 decades. The state's Mormon mouthpiece, The Deseret News, has already denounced Cinnamon Hitler as \"evil\" and a wannabe dictator. That should be a warning to all you Republican conservatives out there of the quality of your candidate.","post_message":"While most political prognosticators are closely tracking a familiar group of about 10 presidential battleground states, Utah is emerging as one of the most surprising wild cards in the 2016 race."},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"1867778023454493","commenter_b":"Yeah, all those vacations, all of that golf. It must have been a real bitch.","commenter_a":"Yes We Can dear President Obama and Yes We Will. Thank you for your service and your hard work for this country, against the constant and relentless Republican opposition, dissent, disrespect, hatred and racism.","post_message":"\"I'm asking you to believe... YES WE CAN!\"  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156128714545725","commenter_b":"About time he helped his teammates out","commenter_a":"Them mugfucken Cubs been killen","post_message":"What a game! Let's hear it for the Cubs ----> @webpagelink"},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're \"yucky\"? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"640946546065952","commenter_b":"So support Hillary who takes millions of dollars from countries that practice Sharia law that kill women and kill gays for no reason! Also who's husband is a known sexual abuser and a rapist and she persecuted the sexually abused victims of her husband. Yet Hillary said she supports women's rights, what a joke. Wake up ladies!!! I'm wondering if Hillary hired these people to go there and start riots. Hillary Clinton is a evil corrupt woman who is mentally, physically and morally unfit to be our commander in chief!","commenter_a":"Go Trump.","post_message":"We're LIVE from Trump Tower New York, where the National Organization for Women (NOW) is leading an anti- Donald J. Trump protest."}]
