[{"comment_id":"10153541380362093","commenter_b":"@username obviously you think you are what you arent thats why its called a disorder im not going argue... is the sky green? is grass blue.. no... and im not going to argue that it is.... and the problem isnt so much trannies like i said its men who know what they are that are now not looked at twice for going to the womens restroom, nobody will bat an eye even if his intentions are evil...","commenter_a":"As a transgender person, I'm sorry that me having to do a natural bodily function in the bathroom that matches my gender identity affects your life so much. Get over it, we're here to stay. I was born and raised in Texas, regardless of what y'all say about us, I'll still be using the men's room.","post_message":"The founder of the movie theater believes the bathroom debate has gotten out of control and hopes his new design will make the issue a non-issue for customers... @webpagelink"},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"10153378871661130","commenter_b":"@username get a life and get out of the reproductive business of women.","commenter_a":"Planned Parenthood is more than abortions and those who only focus on that are very closed minded. I support planned parenthood.","post_message":"The REAL truth."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"},{"comment_id":"1149779331709743","commenter_b":"Bastards of the ocean!","commenter_a":"The arseholes of the sea. Cha Henry @username","post_message":"Wow, what an asshole."},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"634938303363415","commenter_b":"god i hope his on his way to you for judgment","commenter_a":"Hey Obama time for you to step down!!!","post_message":"Obama's health is at risk, he may not finish his presidency.  He should resign. If his health is becoming an issue, it's a no brainer.  Would you be happy to see Obama resign from the presidency?"}]
