[{"comment_id":"10154973344274166","commenter_b":"@username my daddy would never. Then again he's only had one wife and never talked about groping his children.","commenter_a":"They about to get cozy. He is so in lust with her.","post_message":"Here's a look at Pres. Trump and daughter Ivanka as they departed Washington unannounced to honor slain Navy SEAL Chief Petty Officer William \"Ryan\" Owens. Read more: @webpagelink"},{"comment_id":"10153079641390950","commenter_b":"Bitch, fuck you and the white man!","commenter_a":"Jorge Ramos can kiss my hispanic behind! Go back to Univision y callate la boca! Legal hispanics are tired of paying for ANY illegals from ALL COUNTRIES (not only Spanish speaking) with our hard earned tax dollars!","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"10153366334404024","commenter_b":"I don't trust anything that Obama says or does.","commenter_a":"Get him for war crimes.","post_message":"Doctors Without Borders Rejects Obama’s Apology: Demand Investigation Into What It Said Was An Alleged “War Crime” @webpagelink"},{"comment_id":"1118930614814076","commenter_b":"Palin has a mental disorder, do not vote for this woman at all Americans.","commenter_a":"She gives all Alaskan women a bad name. Duct tape would be useful over her mouth.","post_message":"She's mind-bogglingly dimwitted."},{"comment_id":"858391040863023","commenter_b":"Hillary should be strapped to the front of the bus in bumper to bumper traffic.","commenter_a":"another clown to join the clown bus! Out of touch with reality","post_message":"Dr. Ben Carson is running for president. Here's where he stands on the issues..."},{"comment_id":"1097247357003041","commenter_b":"Bitch please","commenter_a":"These cops did nothing wrong. They asked him why he was filming and they were trying to protect there fellow officer. Everyone needs to stop hating on the police.","post_message":"We just received this, these cops are ABSOLUTE CHILDISH BULLIES! Full details: @webpagelink They got right up in his face like they were looking for a fight, they have ZERO respect for anyone outside of their little gang."}]
