[{"comment_id":"10153044187631717","commenter_b":"No one wants to physically hurt her, we just want her to do her job. Such exaggeration!","commenter_a":"well they need too cuz this B*tch is Crazy!","post_message":""},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."},{"comment_id":"10153675906043132","commenter_b":"Ben's is too good for her He's lucky she sent him home He had too much class for her","commenter_a":"Shawn wins - there.","post_message":"Last night's The Bachelorette: Let's discuss."},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":""},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say \"Islamic extremism.\"  \"If Fox didn't talk about this, they’d have nothing else to talk about,\" Holder said."},{"comment_id":"10154595854899203","commenter_b":"It has nothing to do with civil rights get real. If the NFL wants security they can hire their own. The police are voluntary for the game.","commenter_a":"Pathetic. A cop's job is to protect and serve, not protect and serve who they agree with. Bad cops.","post_message":"They are furious with Colin Kaepernick."}]
