[{"comment_id":"10153043301434411","commenter_b":"probably a women could define.","commenter_a":"So does this apply to women?","post_message":"Warning! Selfie men!"},{"comment_id":"10154515564959657","commenter_b":"Get a big boat and ship them back.","commenter_a":"Not sure if I'm buying this, I've heard multiple different stories from a couple of families to 10k of them.","post_message":"VIDEO===> Bus loads of refugees arrive in New Orleans today."},{"comment_id":"10153071973637217","commenter_b":"Whats up with the broken leg? Haha random","commenter_a":"... well ... coulda been worse !","post_message":"24 unconscious, several dislocated shoulders and 1 broken leg"},{"comment_id":"10153551437246336","commenter_b":"Hello!! They treated him like that bc they believe him to be a wolf in Sheep's clothing. I find him very entertaining but he is the Clintons wild card. He will divide the republicans so democrats will win. They even point blank asked him when he became a republican and all he can say is I changed my mind.","commenter_a":"@username owes Donald Trump an apology. Get rid of Megyn Kelly while you're at it.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"},{"comment_id":"10154331295400695","commenter_b":"Praying","commenter_a":"Lord I pray for these families. Unless you have lost a child no one can even imagine the heart break they feel right now. I ask you Father to walk along side of each one of the family members wrap your arms around them to let them know you are right there for them to lean on you or carry them thru this. They have now entered the choir of angels . God bless all","post_message":"#PrayforUGA: We just received these photos of Christina Semeria, Halle Scott, Kayla Canedo and Brittany Feldman, the four UGA students killed in last night's tragic crash. Our hearts go out to their families and friends. @webpagelink"},{"comment_id":"10153252921156833","commenter_b":"Good for the homeowner! Its time these THUGS learn that our homes ARE NOT THEIR PROPERTY AND THEY CAN'T ENTER WITHOUT OUR PERMISSION.","commenter_a":"Love this...","post_message":"An Albuquerque Police spokesperson says that a homeowner awoke to noise in his house and grabbed a firearm, thinking there was possibly an intruder. The homeowner checked the house and found a man, identified as 28-year-old Robert Bartley, crouching in his kitchen holding what the man said \"appeared to be knife.\" According to police, Bartley approached the homeowner saying he was going to kill him."}]
