[{"comment_id":"10153434512226749","commenter_b":"Oh we WILL get your guns. We will save this country from the terrorist gun owners","commenter_a":"Give it up Obama....you're not getting our guns! Stricter gun laws will only make more people buy them illegally!","post_message":"It's time to do something. @webpagelink"},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"852688794861003","commenter_b":"Biggest POS IN AMERICA TODAY, then KILLARY","commenter_a":"Yes","post_message":"President Obama continues to top lists of most admired people in the world. Do you admire him?"},{"comment_id":"10154079684393812","commenter_b":"A bitter old lady move on. About as important as blm.... Next","commenter_a":"And I care what the stepsister of Ann Frank thinks????","post_message":"Anne Frank's stepsister: \"If Donald J. Trump became the next president of the U.S. it would be a complete disaster...I think [Trump] is acting like another Hitler by inciting racism.\""},{"comment_id":"1150363668364697","commenter_b":"In other words you won't be out of pocket otherwise you could still go ahead and spend a tiny bit of the fortune you have made from the British people, you'r an utter disgrace to this country. put some back in instead of out you fuckwit arsehole virgin c**t.","commenter_a":"Tell us what the deal was, then we can make a judgement. Could be bs. for all we know.","post_message":"And Richard Branson has cancelled a deal costing some 3,000 jobs..."},{"comment_id":"10153155195841323","commenter_b":"It's dangerous to be right when the government is wrong. -Voltaire","commenter_a":"reminds me of the USA..","post_message":"Inside B’Tselem, the Israeli human rights group accused of treason for documenting the violations of its own government."},{"comment_id":"1157925847657525","commenter_b":"she should be charged with fraud.","commenter_a":"God please let this happen....she is evil as Hellary","post_message":"ClashDaily.com"}]
