[{"comment_id":"10153039868668984","commenter_b":"Bitch....","commenter_a":"Filthy rich don't need any more money but their filthy greed demand more and more.","post_message":"I can't believe she did this. There are plenty of people out there who would kill for even a small fraction off that money...."},{"comment_id":"1047246341998727","commenter_b":"Illegals should have NO rights in voting, wokring or anything here....PERIOD.","commenter_a":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","post_message":"Hillary and Bernie want taxpayers to cover healthcare for illegal aliens. What do you think?"},{"comment_id":"557200064439948","commenter_b":"I think Donald Trump was building a wall for the excess humans.","commenter_a":"okay so you are planning to eliminate mosquitoes .. do u have any plan what you guys are going to do with the hundreds and thousands of excess humans?","post_message":"\"Eliminating mosquitoes could leave predators without prey.\""},{"comment_id":"10153721482309641","commenter_b":"Rap Artists RToy : Here it is the good part of Qur'an 5: 32 Qur: Whoever kills an innocent person it is as if he has killed all of humanity","commenter_a":"Quran (5:33) - \"The punishment of those who wage war against Allah and His messenger and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be imprisoned; this shall be as a disgrace for them in this world, and in the hereafter they shall have a grievous chastisement\" Quran (8:12) - \"I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them\" No reasonable person would interpret this to mean a spiritual struggle. Quran (8:15) - \"O ye who believe! When ye meet those who disbelieve in battle, turn not your backs to them. (16)Whoso on that day turneth his back to them, unless maneuvering for battle or intent to join a company, he ...","post_message":"\"I think he damaged all his brands in all Muslim countries.\""},{"comment_id":"10152820559047144","commenter_b":"To hell in a hand basket. The women will have to bale them out.","commenter_a":"Most of those pharma pain killers are just synthetic heroin.","post_message":"A recent study found heroin abuse was 19 times higher among people who had previously abused pain relievers."},{"comment_id":"10153341871609411","commenter_b":"Lady is.Europe.is ur ultimate paradise huh wow, what's ur talks pointing out? Ur a pervert who looks at European ladies as 'new lady to rape'? U think European ladies are the ultimate ones in world? U must be an ignorant fool since birth","commenter_a":"Just thinking about sex is not life, u can be happy with out thinking about sex Thinking of sex make us animal and blind and leads u to rape a new woman","post_message":""},{"comment_id":"1800692713478186","commenter_b":"Your first woman president wants to bring ISIS TO AMERICA. IF SHE WINS YOU BETTER START PACKING HEAT AND GET ON YOUR KNEES AND PRAY. YOU WILL NEED IT.","commenter_a":"An America that believes it's ok that Americans have lost jobs? An America that believes healthcare costs for many Americans should increase? I get that the Affordable Healthcare Act has helped millions Americans, but at the expense of millions of other Americans. Also, an America that believes it's ok to accept donations from countries that house terrorists and are suspected of funding them? An America that let's people get away with breaking certain laws? This is the reality of @username America. FYI, not supporting Trump Chris Keniston, Veteran's Party of America supporter.","post_message":"Tomorrow, we have the chance to stand up for the America we believe in. Share this if you're voting. hillaryclinton.com/makeaplan"}]
