[{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"857457044291637","commenter_b":"One man will never accomplish that .That will never happen.","commenter_a":"Obama is very naive when it comes to the Arabs. Maybe he is trying to have faith in human nature.that will not work in that cesspool in the middle east.That viewpoint does not even work here in a fairly civilized country.","post_message":"“Even if Israel has to stand alone, Israel will stand.”"},{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"1085742424820999","commenter_b":"Steven Lumb then ask yourself why. She must be doing something right.","commenter_a":"So after my 12 years teaching and three post-grads I am still not allowed to call myself a professor but she can, in her first teaching job, what a joke.","post_message":"2016"}]
