[{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."},{"comment_id":"10155589843380231","commenter_b":"That Saltine needs to o put on her white sheet and HOOD and shut the hell up.","commenter_a":"Which is why she's scared to show her face...stand by your convictions woman!","post_message":"At least one McKinney resident is standing by the police, insisting that the actions taken were appropriate."},{"comment_id":"579876898863510","commenter_b":"that chick with the bad bouttabe me in a second","commenter_a":"How cooked Darnell Fraser-Carroll Darnell Rea","post_message":"Ghosts from The Ring and Grudge opened a Japanese baseball game"},{"comment_id":"10154562664816037","commenter_b":"Build Bridges Not Walls","commenter_a":"YES!! as part of an overall plan on illegal immigration . Please Remember that Sen. Hillary Clinton voted twice and lobbied for a border wall!!!!","post_message":"Would Donald J. Trump's proposed wall help?"},{"comment_id":"1390535574339520","commenter_b":"Horrible creatures","commenter_a":"@username this is why you don't panic","post_message":"The bird was trying to steal her ice cream"},{"comment_id":"665165626971083","commenter_b":"Never Clinton!! She praised Robert Byrd A known KKK LEADER AND KLAN RECRUITER and a complete liar and flip flopping scumbag!! And her SEXUAL PREDATOR Husband need to be put in jail!! We need to set limits on how long you are allowed to run in government and all these establishment criminals that keep getting elected and ruining our country on both sides need to go !!!!","commenter_a":"I don't believe that !!","post_message":"Unless things change extremely fast, Clinton will officially lock up the Democratic nomination after the California primary. Will you be supporting her this November?"},{"comment_id":"730940317039149","commenter_b":"I agree this is by far the worst president ever as my father always said the day that America elects a Black President it will be the end of America's Freedom and safety and he was right Obama is a Muslim Terrorist and he had one plan and he's doing it we no longer are the Greatest Country in the world","commenter_a":"obama is muslim and islamic Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Musiims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The ...","post_message":"Absolutely Sickening."}]
