[{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"10152726918051051","commenter_b":"She should really be charged with Involuntary Manslaughter...","commenter_a":"Some people should have no children Stupid ass how can she do that","post_message":"This woman left her 2 small kids alone to get her hair done. When she returned, there were firefighters everywhere."},{"comment_id":"10153596919524205","commenter_b":"Fuckdonaldbitchasstrump!!!","commenter_a":"Amanda Kovanis","post_message":"Donald Trump has been running a populist campaign, and during the Republican primary that has meant saying outrageous things to impress conservative voters. Will he change his positions when he becomes the Republican nominee?"},{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"1452361001456073","commenter_b":"Fuck Trump he is a real dangerous piece of shit he must be taken down at any and all cost do whatever you can to make sure this ultra right wing low life piece of garbage does not become President. Trump do us all a favor die soon asshole.","commenter_a":"Nice pose for his new Facebook picture!!","post_message":"He got TORCHED on twitter."},{"comment_id":"10150640777899999","commenter_b":"Did she send that message on her illegal server?","commenter_a":"Donald Trump- the gift that keeps on giving. Signed Hillary Clinton","post_message":"Donald J. Trump promoted tweets that called Megyn Kelly a “bimbo” and that said she “bombed” as a debate moderator."},{"comment_id":"1149825048400467","commenter_b":"Everybody is sick of her! She just needs to go away!!","commenter_a":"Fox and news should never be together! News is ok and fox is ok but fox and news makes no sense!","post_message":"Source: Fox is ‘Sick’ of Megyn Kelly; ‘Fox News Needs to Cut Her Loose’  @webpagelink"}]
