[{"comment_id":"953749507999241","commenter_b":"I don't care if someone is breast feeding, but I cannot stand when attention seeking bitches claim they want equal \"rights\" but actually want to go around showing off their shitty bodies, crying for attention. Don't even try to tell me men and women's chests are the same, our chests have evolved for thousands of years to feed a child, men's have not. Just like men generally have a lot more muscle mass, they have evolved to meet the needs of his family while the mom nurtures and takes care of the babies. You are NOT feminists, you are an embarrassment to the female society. I want to fight for the rights of women who can't leave the house without a male, and are brutally forced into genital mutilation. The ones who are so \"oppressed\" because it's not socially acceptable to be naked in public make my blood boil. Like ...","commenter_a":"sorry, I don't want to see it either and I have 3 children myself. it's wonderful, its necessary and its private.","post_message":"Talk about a great response from the mom. (via TakePart.com)"},{"comment_id":"1393104724052131","commenter_b":"@username - Woman you should stop watching Fox!!","commenter_a":"This is so stupid. History will show that President Obama is one of our best presidents and also one of my most maligned president for no other reason for the color of his skin . He is one of our most educated presidents, he is also one of our most Christian presidents who didn't have to say he was Christian because he's lived it by being a faithful husband a wonderful father and a patient man who has reached across the aisle and had his hand slapped over and over and over again by hateful Republicans who put party before their duty as servants of this country . He without any help from the Republicans have brought us back from financial ruin that was left by the last Republican president given millions healthcare and under his leadership on military has killed those perpetrated 911 and killed hundreds of Isys and ...","post_message":"A Louisiana newspaper sent a very strong message to President Obama today. Do you agree with the paper on this?"},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."},{"comment_id":"884938878291056","commenter_b":"I'll fuck her up","commenter_a":"@username let matce do this she won't ever have that boy again!!!!!! I'll do everything in my power to get him from her","post_message":"Woman Checks A Mother Abusing Her Autistic Son At A Wafflehouse!"},{"comment_id":"10153940708678690","commenter_b":"@haider ali what if bangalese ask the same about our PM or army chief then will you welcome their comment ? mind your own business,they are still better than us,we destroy our country on Islam but they dont want wahabi islam in Bangladesh....if our ISI stop exporting terrorism & wahabism to other countries,no one will blame us.","commenter_a":"Bangladash should change their pm. Hassena is worse lady i ever seen.","post_message":"Police said the seven men are linked with the banned armed group Jamaat-ul-Mujahideen Bangladesh.  The JMB members fought back as police raided the building, tossing a grenade at the security forces, but there were no reports of any injuries."},{"comment_id":"10152906216427522","commenter_b":"Freddi Birkhder you are too stupid to pour piss out of a boot even if the instructions are on the heel. The Cheney/bush thugs negotiated the withdrawal from Iraq you mindless twit. GFY","commenter_a":"Not surprised!!! Christians are being blown up!by Isis,and Obama is smiling!evil man.","post_message":"Yes, he too is reading Ta-Nehisi Coates' new book:"},{"comment_id":"487105228080821","commenter_b":"She do it just for the publicity ..","commenter_a":"Probably already dated a few Bruce Jenner's in prison...","post_message":"Can you believe this story?"}]
