[{"comment_id":"1151797721550248","commenter_b":"@username \"All people of Muslim faith need to be monitored ,suspend any and all travel for them born here or not .\" \" All Mexicans not here legally will be deported and any child born here who's parents are illegal will be deported \" Mexico doesn't send their best,just drug dealers and thieves. \" Maybe because I don't lick windex off of the windows of the Trumpian short bus but sounds racist to me.","commenter_a":"Good bye all the never trumps see you after you realize that not voting for trump is just another vote for hillary who no one wants. Sorry that people didn't vote for your candidate probably because they are tired of politicians saying what you want to hear and not doing any of it.","post_message":"Republican National Committee Chairman Reince Priebus says the meeting with Donald J. Trump was great."},{"comment_id":"1091280717559605","commenter_b":"@username, are you really that concerned this man will not reach his full potential of sexual pleasure!? He's a man for christ sake! The last thing he needs is anymore reason.. I don't miss the excess skin they removed from vag after giving birth. Wasn't doing me any good, and it would've been in the way. You still got the umbilical cord hanging out of your puss or what!? Never know, you might miss it..","commenter_a":"I knew it caused both my boys pain, but I still had them both circumcised. Haven't regretted the decision at all.","post_message":"Maybe that circumcision was a bad idea after all, huh?"},{"comment_id":"10153632735051636","commenter_b":"@username typical this comes out after assignment submission","commenter_a":"Just wondering how many u turns this is now ?","post_message":"A good day to bury bad news"},{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"10154763479136037","commenter_b":"No surprise to Hillary. She pays for this stuff. @webpagelink","commenter_a":"No matter who ultimately did this, and I hope they are caught and prosecuted, the way both the candidates reacted tells you everything you need to know about how they will govern.","post_message":"Donald J. Trump immediately blamed \"animals representing Hillary Clinton\" for the attack."},{"comment_id":"363657737155854","commenter_b":"She needs to die","commenter_a":"Don't watch her either to me she is just stiring up trouble","post_message":"Is Oprah a race-baiter?"}]
