[{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"10153595833422439","commenter_b":"@username - stop them in their tracks? When? So far we've done nothing and the media's not reporting on stuff as ordered by our gay muslim prez! Meanwhile he's flying hundreds of thousands more in and setting up cells all over our Country. Trey Gowdy tried to stop it in SC and the planes and buses keep coming and dumping them.","commenter_a":"I don't think the muslims fully understand that the American people will unite and stop them in there track. God Bless America","post_message":"Coming to America. It’s just a matter of time. The only difference between Islam in Europe and Islam in America is we started importing whole Muslim communities a lot later than Europe. But we are on the same path to ruin."},{"comment_id":"10154579392684062","commenter_b":"Apparently not a gem if she can't get someone her own age. And it really doesn't matter. She is sick and needs to be Put in jail!","commenter_a":"I bet she's white","post_message":"She hasn't been arrested yet."},{"comment_id":"10153373472869411","commenter_b":"Bugger off Rosa!","commenter_a":"Will sodomite marriage replace traditional marriage in Ireland?","post_message":"Check out our interactive map of the #hometovote trending worldwide  inside this article"},{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."}]
