[{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"10154551399261178","commenter_b":"Ummmmm I don't think so","commenter_a":"The roaches got away...Cleveland turned on the lights , Philadelphia turned out the lights...the roaches got away","post_message":""},{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"525608654307175","commenter_b":"Have dreams that often come true about other people.","commenter_a":"How do you know if you have a gift? My husband thinks I am a empath... I feel energies but don't know how to interpret them.","post_message":"We LIVE with Theresa Caputo! Send us your questions for the Long Island Medium."},{"comment_id":"639206099603302","commenter_b":"trump chooses palin for vp he loses my vote pay attention america to this family","commenter_a":"why would a person with any common sense support ANY ONE who assaults anohter person? that does not even make good sense. no matter why she assaulted the other person, you do not strike another person. she could have just left the party if she was offended by something said. it was a crime.. crimes are punishable by arrest and payment for that crime no matter who you are.","post_message":"Bristol Palin is in trouble with the law after this incident at a party.  We need to show Bristol our full support. We support her and the entire Palin family.  Do you support Bristol Palin?"}]
