[{"comment_id":"631130463744199","commenter_b":"Obama don't care what \"Our\" Constitution says!!!!!","commenter_a":"unconstitutional","post_message":"Obama said that America wants him to run for a third term, here's how they responded.  What a joke. This is absolutely ridiculous.  Do you think Obama should run a third term?"},{"comment_id":"10153319630981135","commenter_b":"Take her car away!","commenter_a":"FOUND IN OHIO.","post_message":"Nancy Carfes was last seen around 8:30 a.m. Monday morning in the area of Wayne and Warren Roads."},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"10154274349426051","commenter_b":"CAN I HELP AL , GET THE HELL OUT OF THE U, S, A, DUMB ASS","commenter_a":"He is ALL mouth--did anyone really think any of these ppl. were going to leave? WHO would want them?","post_message":"The Rev. Al Sharpton has finally decided if he'll leave the country now that Donald Trump is President."},{"comment_id":"10153505225891615","commenter_b":"These two are animals !!!!","commenter_a":"From that shiner, I wonder if our esteemed and trusted servants might have exacted a little street justice... Nah - THATS ILLEGAL!!!!!","post_message":"Shocking testimony reveals new details about the Uniontown toddler who was only 10 lbs at the time of her death. WPXI Cara Sapida is in court right now.   TONIGHT AT 5: Cara shares the disturbing testimony from an ER doctor and state trooper about the day little Lydia died."},{"comment_id":"1171553619565468","commenter_b":"I can't even watch the View. Those women are bullies and *itches and make me want to slap them.","commenter_a":"Whoopie and Joy make me sick. They are so rude and disrespectful that I'm amazed they still have jobs.","post_message":"Whoopi and Her Liberal Hacks at 'The View' Tried to Bully Trumps Manager, But She Knocked Them The Hell OUT in Front of MILLIONS! (VIDEO)  Everyone's SICK of Hillary's scandals! Lets get 4000 SHARES if you are too!!!"},{"comment_id":"844885798949835","commenter_b":"Hillary was responsible for keeping wages at slave wage, oh and she sits on the Walmart board of directors too, if ya didn't know. Hillary sure likes to pull out the ACE cards for protection, still doesn't exclude that she is a liar, and a criminal of the highest order. As truly Democratic Trump holds the GOP hostage, and Cruz is stupid, full of shit, and a wingnut, and Hillary is a criminal: @webpagelink TRUMP BFF and CRIMINAL? REALLY! Get the word out, SHARE THIS! FEEL THE BERN! DOES USA WANT A KNOWN CRIMINAL IN THE MOST POWERFUL SEAT IN THE NATION/WORLD?","commenter_a":"Good for them Walmart can afford it, don't forget Walmart is the reason most of the factories closed b/c they brought cheap shite from China and the working man bought a TV or whatever from China that was cheaper so factories couldn't compete which is what Walmart wanted. I never have and never will shop there.","post_message":"Walmart faces another lawsuit loss..."}]
