[{"comment_id":"1329355063770614","commenter_b":"And yet, billions of US tax dollars are given to foreign governments each year without the consent of tax payers. It's disgusting and so sad that we have Americans living like this and Obama and the entire Democratic party wants to bring hundreds of thousands more refugees into this country to live on the taxpayer dole! How stupid are we to keep putting these people into positions of power this way?!!","commenter_a":"There are many homeless in the Seattle area that live in tents because they don't want to have the restrictions that comes with living in a homeless shelter. Restrictions with when they come and go and what goes on there.","post_message":"OBAMA PUSHES AMERICANS INTO TENT CITIES.  Hillary will keep them there.  VIDEO  @webpagelink"},{"comment_id":"10154184964563352","commenter_b":"Melissa..legalizing illegals will devastate black employment..for every available job it will be 150 Mexicans to every 3 blacks...it be horrible for us","commenter_a":"Hes gonna stop illegals from coming taking black jobs..hes gonna kill obamacare fines..wat sensible black would disagree","post_message":"Trump says black Americans 'are going to like me better than they like Obama' – even though the president has 'a slight advantage'"},{"comment_id":"10153548183098984","commenter_b":"Unless you're Native American, almost all Caucasians have ancestors that were thieves, murderers, and rapists. Shall we remember our horrible history? Shall we remember how Caucasians forced their way through other's land? Shall we remember the genocide that occurred? Shall we remember public lynches? Shall we remember the Trail Of Tears? Shall I go on?..... Who are the TRUE criminals here? Caucasian ancestors FORCED their way through due to greed. Most other immigrants come to America to WORK to provide for their family. So I repeat, UNLESS you're Native American, you come from immigrants as well, possibly even illegal. You're ancestors (Caucasian), if they've been here since the 1700s or 1800s, could have been the murderers, thieves, and rapist roaming around tormenting innocent. An add-in...who will do super low-pay labor? Mexicans are hardworkers, even when we are living in severe poverty, we still try to WORK. Anyone who has common ...","commenter_a":"Donald Trump is to good for any of them....you can't tell a Liberal the truth","post_message":"Donald J. Trump just taught these guys trying to bully him a SERIOUS lesson on why you do NOT try to play hardball with The Donald!   Do you think he has more backbone than Obama?"},{"comment_id":"10154789649578256","commenter_b":"@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, \"The one style lesson you can actually learn from Donald Trump,\" columnist Eric Zorn writes."},{"comment_id":"10154092643775950","commenter_b":"FUCK OFF RACIST","commenter_a":"who cares, just get out","post_message":"What are Barack Obama's post-presidency plans? \"Take Michelle on vacation. Get some rest. Spend time with my girls and do some writing, do some thinking.\" Watch more from his press conference in Peru: @webpagelink"},{"comment_id":"783181045136903","commenter_b":"Because jerusalem is Israel. This fact will not change no matter what this president says.","commenter_a":"Why we should consult Israel? What you guys think you are? How many Palestinians have been killed in the holly land since creation of Israel? You got a country out of nothing and there is nobody who could satisfy you people.","post_message":"In new book, former ambassador and now Knesset legislator describes his impressions from when he was Israel's envoy in Washington between 2009-2013."},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"}]
