[{"comment_id":"992247137464743","commenter_b":"The women that hate Amber Rose are either ugly or fat or both. A secure woman has NO REASON to hate on another woman.","commenter_a":"I love seeing a post about 2 women making a serious public statement about the hate women recieve and then reading nothing but hate on those 2 women (BY OTHER WOMEN) in the comments.........","post_message":"Jaw-dropping. #VMAs"},{"comment_id":"10152763067471051","commenter_b":"Let that bitch rot.","commenter_a":"So @username all she has to do is profess her love for Jesus and all is forgiven. Huh......smh","post_message":"When her fiance broke up with her, this woman decided to make his 3-year-old daughter pay."},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"1658190531136070","commenter_b":"Racist unethical cheater!","commenter_a":"This garbage troll shouldn't be allowed to breathe at all!","post_message":"Geraldo Calls The Constitution Bullsh*t And Then Goes On Epic Rant Slamming Americans  Kick him off Fox. He doesn't deserve to be on the air. Do you think he should fired?"},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, \"body fillers\" etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"\"I'm paying now for my vanity.\""}]
