[{"comment_id":"952115494844980","commenter_b":"Because Mark she would be a WOMAN President!!! That's it!!!","commenter_a":"I'm from Brazil, and i support @username to President of USA. <3 #GoHillary","post_message":"Rising fifth grader Emily had a big question for Hillary in New Hampshire:"},{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"\"Make dating great again!\""},{"comment_id":"1717613511850715","commenter_b":"Shoot everyone of those goat humpin bitches! Problem solved!","commenter_a":"It's time to take a stand America !!!","post_message":"Muslim Man Kills Pregnant Woman For Coming To Close To His Mosque. He ended two lives for nothing. Justice needs to be served. What do you think his punishment should be?"},{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"10156386712435354","commenter_b":"Dumb asses.. Nuclear terrorism ( round the corner) is far worse than gradual climate change..","commenter_a":"And he is a greater threat than Climate change. So I guess that makes him a greater threat than terrorism too !","post_message":"A DEVASTATING indictment every American should see..."},{"comment_id":"1038727149505600","commenter_b":"Trump, get your ass to basic training, and stop with your faux patriotism act.","commenter_a":"Hahaha.","post_message":"Trump 'always felt that I was in the military' when he was at military-themed boarding school @webpagelink"}]
