[{"comment_id":"602448696614153","commenter_b":"Racist pigs","commenter_a":"@username CHILD RAPIST LOVER!","post_message":"President Obama holds his first news conference at the White House following the election of Donald Trump.  @webpagelink"},{"comment_id":"10154389291904614","commenter_b":"@username....Aka: RACIST!!","commenter_a":"I don't wanna sound racist but did you know 68% percent of rape is commited by African americans in los angeles spew on me all you want I got the statistic straight from the FBI website","post_message":"LAPD is looking for a man who tried to sexually assault an 80-year-old woman in her Hollywood apartment, leaving her in critical condition and still sedated due to her injuries.   The victim opened the door to the attacker after he knocked, apparently targeting her at random, police said. He pushed into the apartment and beat her, but she was \"feisty\" and able to fight him off, an LAPD captain said.  The man, who was caught on surveillance video, is described as a black man 25 to 30 years old, 6 feet tall, 220 pounds. He wore a black Penn State hoodie at the time of the attack."},{"comment_id":"10153635350921636","commenter_b":"He's definitely got issues!","commenter_a":"So kill urslf wtf","post_message":"'I could just kill myself and I wouldn’t have to face today'"},{"comment_id":"1720867398159945","commenter_b":"She's a basket case.","commenter_a":"@username he absolutely rekt her","post_message":"Sparks just flew at the Democratic debate. Bernie to Hillary Clinton: \"Excuse me, I'm talking.\"  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1711261402459148","commenter_b":"Hilly would be in the slammer if she wasn't in the cartel","commenter_a":"BERNIE","post_message":"Chaos on the convention floor as the Stop Trump delegates chant for a \"roll call vote.\" RNC officials officials denied the roll call vote over the rules.  Fuill convention coverage: @webpagelink"},{"comment_id":"10152862835371336","commenter_b":"The ft hood shooter was an American serviceman","commenter_a":"What about Benghazi and Ft. Hood?","post_message":"\"This is an act of violence, an act of terrorism that we condemn in the strongest possible terms, and we are going to stand shoulder to shoulder with our allies in France.\" – White House Press Secretary Josh Earnest on America's Newsroom moments ago"},{"comment_id":"1259980317411527","commenter_b":"That says alot about him.... smh. He hasn't given any serious amount of attention to our military and now he wants them to turn on the new commander in chief. #HURRYUPJANUARY#","commenter_a":"Will be so glad when POS OBAMA is GONE!!! WORST President EVER!!! A racist TRAITOR!!!","post_message":"OBAMA TELLS TROOPS To Rise Up Against Trump…Protest His Authority…Feel Free To Criticize Him [VIDEO]  43 more days..."}]
