[{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."},{"comment_id":"10153978615223812","commenter_b":"Go Hillary! 2016!!!","commenter_a":"GO BERNIE","post_message":"Here's what the ABC team is doing in the minutes leading up to the #DemDebate..."},{"comment_id":"10154960801467232","commenter_b":"@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"946644428709749","commenter_b":"Wow seriously? Talking about reading too much into something. It is a cartoon meant for entertainment. Good grieft! You know where I got my sense of womanism from? My MOTHER! Yep, that is who shaped who I am.","commenter_a":"Missed the most important point fat, ambitious women are evil, unnaturally thin submissive and child-like women are good.","post_message":"Not only is this hilarious, but it is *so* on point. Kudos, ScreenJunkies.com."},{"comment_id":"10152996938497293","commenter_b":"Sorry you can't understand science. Maybe you should go back to high school.","commenter_a":"So the WaPo says evolution is fact, even though it's theory that can't be demonstrated? Bias is a wonderful thing.","post_message":"This can go down as one of the best examples ever of why it's downright impossible to convince someone who's \"opposed\" to evolution that it's a basic fact."},{"comment_id":"1800961159929656","commenter_b":"This is not the true Ekklesia of Christ! I keep saying it, the true Ekklesia of Christ will have to return to the home, where it never should've come out from!","commenter_a":"You can't call this a Christian church if it goes totally against Gods word and if all that is allowed it is totally wrong to change the bible to fit your agenda. The bible says beware of wolves in sheep clothing it also says we are in this world but not of it. We true Christians are to be aware of these wolves and Not join in the sin with them but we are to pray that God will remove the scales from there eyes and pierce there heart so they can see and repent of what is so wrong that they think is right.may God have mercy on these people","post_message":""}]
