[{"comment_id":"1712662805615424","commenter_b":"What a drunk bitch. What is she? Fucking 3?!","commenter_a":"Leigh Mangubat","post_message":"Guy Records His Girlfriends Meltdown"},{"comment_id":"10154579846521337","commenter_b":"Uproxx spreading the word of obama lets keep stoking the fires of divison","commenter_a":"Why is the kid running? I mean...I personally see cops running towards me I'll probably freeze like a deer in headlights. The cops would've likely seen their theory was ridiculous once they got close to the kid and moved on.","post_message":"“I was scared for my life. I was thinking that they were going to shoot me.”"},{"comment_id":"10154454599501162","commenter_b":"That lady is an idiot","commenter_a":"What the f @username Angela Lemonjello Caringella Care Re","post_message":"Harbor seal pup euthanized after being carried off a beach in a plastic shopping bag."},{"comment_id":"10153139326127293","commenter_b":"just facts he was no hunter just by what was done and his lousey shooting . he had no business hunting.","commenter_a":"he didnt know what he was doing and the guides were obviously dirty.","post_message":"How a dentist who killed Cecil the lion shelled out $50,000 for the trip."},{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"10153148918692217","commenter_b":"@username yeah because he will send you back to Mexico..... and will put a full stop to cross jumping.... All those tunnels on the US border in Texas will also be sealed.","commenter_a":"old news.","post_message":"Using their tune? Donald J. Trump needs to \"Dream On\" 🎶"},{"comment_id":"10153882229389062","commenter_b":"Man she looks like a man!","commenter_a":"I don't think she got the memo.","post_message":"The 6 officers charged in Freddie Gray's death have been released on bail @webpagelink"}]
