[{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"10153847766591336","commenter_b":"That's Air Craft Carriers in english.","commenter_a":"So let's tell everybody what our Navy is doing!! Stupid media.","post_message":"On Monday, the aircraft carrier USS Harry S. Truman departed Naval Station Norfolk to head to the Middle East to combat ISIS. (Credit: U.S. Navy)"},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"466981083492472","commenter_b":"Fuck them get out if our country Fucking terrorists","commenter_a":"No,","post_message":"Should Christianity Be Banned To Please Muslims?  Comment 'yes' or 'no'."},{"comment_id":"1410810932269586","commenter_b":"What a wanker.","commenter_a":"Demented old cray cray white man, losing touch with his cash cow. He's milking that cow because it's dying and he knows it. Will need to start a new job with no talent!","post_message":""},{"comment_id":"1743707409231060","commenter_b":"Trump is gonna stomp that old bitch!! Watch and see!!","commenter_a":"They know she is much more qualified, not even close! And even Repubs don't want to be responsible for putting a nut case in the White House.","post_message":"More bad news for the Trump campaign..."},{"comment_id":"10154412876021491","commenter_b":"Does this tour detour to the location of the White House MLK Bust? I hope they know where it is. Don't depend on Time, though.","commenter_a":"Shruti Maheshwari","post_message":"Here's how to score a major deal on a scenic getaway."}]
