[{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10153785867669228","commenter_b":"Yo mama a obese dummy she should of swolled yo daddy nut.","commenter_a":"Oh like white bithes don't steal stfu","post_message":"Three women pushed shopping carts full of toys from a Toys''R''Us"},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"1134556746600853","commenter_b":"She's no better.","commenter_a":"Trump is the devil...if he be elected to be the president...he's gonna start the world war III. HILLARY 2016-2020 !!!","post_message":"Estas son las promesas de Trump. Así podría ser su presidencia…."},{"comment_id":"1224337737632979","commenter_b":"I thought it was absolutely hilarious. Maybe the hood rats should have a bit more respect rather than planning their next drug deal.","commenter_a":"If she can't handle her job and behave professionally, then she shouldn't be an educator. Period. Her being a teacher and all you would think she would be able to find another way to get her point across. The way she spoke and behaved was unacceptable. She grabbed that boy and then went on to say racially inappropriate things. She's a disgrace to teachers.","post_message":"Aren't teachers suppose to be the example?  #WSHH"},{"comment_id":"10153513286844575","commenter_b":"This lady is clueless lol","commenter_a":"This is sad leave churches alone go to a justice of peace & get married the ones trying to sue they think it is a way to get rich it makes me sick","post_message":"Four Kentucky couples are suing a clerk who is refusing to issue gay-marriage licenses — or any marriage licenses at all.  Rowan County Clerk Kim Davis says her Christian beliefs prevent her from complying with the #SCOTUSMarriage decision, so she will no longer issue marriage licenses to any couple, gay or straight."},{"comment_id":"842473555789986","commenter_b":"Why doesn't she leave planet earth!","commenter_a":"And the bad news is what?","post_message":"She's gone."}]
