[{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."},{"comment_id":"259111647859034","commenter_b":"Yes $85 million!!! They're saying that he abused he used to go to the most expensive hotels, restaurants, and buy so much expensive stuff since tax payers are the ones that were paying !!! A lot of luxury vacations for Mr. Obama !! And before leaving the office he send $221 million to the Palestinians !!!! I wonder since when he was sendings them money. that's why noooo I don't miss Obama ! I don't agree on some stuff Trump is doing but I hope he can makes this country great cause Obama did a lot of F***** up stuff to this country and I guess that's what people want a president that lies to us and do stuff that we don't know !!!","commenter_a":"What? A weekend at his own property? The nerve! He should be on a beach in Hawaii, sucking up the taxpayer's money! The utter gaul of this man!!!","post_message":"LIVE NOW: Trump arrives in Florida on Air Force One."},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."},{"comment_id":"10153069048676770","commenter_b":"Both are bitchs","commenter_a":"I see that Meryl has picked her poison.","post_message":"\"How can people like Meryl Streep and Hillary Clinton envision themselves as rebels when they are the establishment?\""},{"comment_id":"10153759061706051","commenter_b":"This is soo EVIL & SICK!!! Where were\\\\ R the kids parents??? Future Monsters in Society?","commenter_a":"poor little guy. he wanted to belong with the older ones. I hope the parents of this little guy sue the crap out of the murder's parents. The older kids had to be displaying signs of aggression.","post_message":"A 6-year-old boy was brutally tortured and killed by 5 other children. It gets worse."}]
