[{"comment_id":"828526300671280","commenter_b":"Hillary can't control own husband......let alone our country.","commenter_a":"incompetent bitch would not have far to go thanks to obummer .","post_message":"This is the worst thing that could of possibly gotten out.  America has to do whatever it takes to keep them away from the White House.  Do you think Hillary will run our country into the ground if she gets elected?"},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"},{"comment_id":"1015432805157138","commenter_b":"Oh give me a break!! Rape is on a whole other level!!","commenter_a":"This is ridiculous!! He is a legend in the wrestling world. They are letting him go over something that was said 3yrs ago?!!! Shame on WWE!!","post_message":"Reportedly for racist remarks made in 2012"},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."},{"comment_id":"400393906751871","commenter_b":"Thank you. You pieces of uselessness. You screwed the Americans who voted your asses in but you will come up for re election. We Americans will not vote you back. You just handed America over to the democrats for life now that the illegals will have the paper work to slant the elections. Morons","commenter_a":"McConnell and Boehner are both hipocrits ~ they are not for the people and are not for the GOP Obama has them in his back pocket!","post_message":"Did Mitch McConnell just cave to the Democrats' demands?"},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"},{"comment_id":"835505926554037","commenter_b":"I bet she get tax breaks on her taxes.take a few seats missy","commenter_a":"C U NEXT TUESDAY !!!","post_message":"Does this woman realize she's shopping at Walmart, where wages are so low that many workers qualify for public assistance?"}]
