[{"comment_id":"1183433338419583","commenter_b":"@username Because they prefer her to Trump-- which is good.","commenter_a":"#HillaryClinton4President Bill Clinton's Presidency brought prosperity and economic stability leaving for the first time a projected surplus. George W Bush came along and reaped havoc on every financial sector, leaving millions losing their homes, Savings depleted and left America in the worst economic crisis since the great depression. Barack Obama won the Presidency and without any help from obstructionist Republicans, Obama saved America from another Depression and stabilized America's financial sectors. We need to Support and Vote Hillary Clinton for President of the United States to continue President Obama's Legacy and Policies, building on his successes and making America even greater than what it is. Republicans have been and continues to be America's Greatest Enemy! Twitter @sheriffali","post_message":"Bernie Sanders closes the gap slightly with Hillary Clinton this week following his victory in the Indiana."},{"comment_id":"10153189678699342","commenter_b":"Its just a restrainin b device the kid will learn to be still nithing wrong here ppl get upset about anything ive had to ohysically jold my 18 month old down to get his shots this would have been better","commenter_a":"There is the option of oral sedation.","post_message":" couldn see my kid in the body bag just strapped down to the bed, I couldn handle it.\"  A man heard his daughter screaming during a dental checkup and then found her like this: Restrained in place with a device known as a \"papoose board. It's legal for dentists to use them."},{"comment_id":"825517894248057","commenter_b":"Sure I can agree with that but you need a way to pay off debt. Taxes are revenue for the government which are used for various expenses. When you balance the budget that means you are simply not paying down debt but spending less than you have. We need to start moving in a direction where we will run surpluses and thereby pay off previous debt. Just like a company, a government should not be run by debt. Now theoretically by increasing taxes = more revenue which could be used to pay off debts but that doesn't always work in modern society. We are a people who now are all run my debt, we own nothing anymore.","commenter_a":"Realistically the only way to reduce the deficit is increasing taxes. The problem is Hilary wants to increase to help her buddies and Bernie wants to increase taxes to add more social services. The other two will uses those taxes, cut spending and find other ways to be more efficient to reduce deficit.well trump will cuz Cruz will just have to give money to his buddies in the establishment","post_message":"HA! Look at how much the tax plan of each candidate will directly affect your paycheck...  Your jaw will drop when you get to Bernie Sanders..."},{"comment_id":"880395268723393","commenter_b":"She was armed with a deadly weapon. I hope she suffered.","commenter_a":"She was probley scared when all those security came at her with guns drawn thats why she tryed to move the car. Hands on steering wheel not reaching for wepon. They didnt have to shoot her.have you noticed all the killings for petty crimes like selling cigerettes, stealing a pk of cigerettes. Being homeless, even jaywalking or talking back to police. This is not a good situation. Real criminals who rape and torture getting away with it because the police would rather arrest or kill someome who is not a threat. I am ashamed of the police who do these things and the other cops who watch and do nothing and of the law that always finds brutal cops innocent. I am afraid of the police many people are. Since when should we pay for a legalized brutal mob. May god help us","post_message":"New details emerge about the 2013 shooting of an unarmed woman on Capitol Hill."},{"comment_id":"1829686510610987","commenter_b":"Just go away Jill. You are as bad as Crooked Hillary. No one believes you.","commenter_a":"So Sad, wasting more taxpayers hard earned money. I hope Trump puts that piece of shit Hillary in jail. I'll never vote for a Democrat again.","post_message":"FUBAR!"},{"comment_id":"908658009268823","commenter_b":"@username still smarter than that orangutan! That orange menace!","commenter_a":"Hillary Clinton is a walking oxymoron... Innocent yet Guilty!","post_message":"Hillary Clinton rips into Donald J. Trump for his critique of retired four-star Gen. John Allen, saying it's unpresidential to \"insult and deride our generals.\" @webpagelink"},{"comment_id":"910749262351462","commenter_b":"SHE IS A BITCH.","commenter_a":"I'm going to have to block this site, even though I agree with it, almost all the time. This is stooping to the level of the opposition, mudslinging and negativity. Pretty ugly.","post_message":"Trump has won the hearts and \"minds\" of Tea Party Republicans, and he isn't afraid to take on the GOP establishment and party elite."}]
