[{"comment_id":"1806555102961372","commenter_b":"Why does she keep bringing up controversy. Be done with it Megan! And get over yourself!!!","commenter_a":"Obama has flooded our country with muslims over the last 8 years to buy votes and destroy our country. America First an no PC.","post_message":"\"I welcome immigrants. I welcome people from all over the world to join us here. But I want to make sure that it's safe for Americans in my country that I fought for,\" Carl Higbie told CAIR Florida leader Hassan Shibly."},{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"\"I don't wear a toupee. It's my hair, I swear,\" Donald J. Trump said."},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"10154385949804087","commenter_b":"@username I think he ran away like a little bitch","commenter_a":"If all you ding-bat liberals would have acted like mature adults, all the EXTRA security wouldn't be needed and costs would have been much less. But no, you all ad to act like psychotic juveniles so this is what you get.","post_message":"The New York Police Department is blasting Republicans in Congress for refusing to cover costs to protect Trump."},{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"893865083995373","commenter_b":"Ha! That ones funny","commenter_a":"It's bullying and an example of bigotry BUT so are a lot of costumes. People get offended a bit too easy these days","post_message":"Halloween costumes are often inspired by pop culture and one store selling the Caitlyn Jenner inspired \"Call me Caitlyn\" costume is taking flack from activists saying it's bullying and an example of bigotry."},{"comment_id":"10152842809974877","commenter_b":" how do these hoes even get in ???!?? I wana know HOW ?! Lol","commenter_a":"How does this even happen wTF? @username","post_message":"Gang Leader Who Impregnated Four Prison Guards Gets Reduced Sentence. Read and watch more on this prison corruption case and his deal.   Grio fam, sound off with your thoughts on this case."}]
