[{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"1937711623123134","commenter_b":"If Clinton is chosen over Trump, there will be a howl in the land like never heard before.....the fix would be in for the political elite and the upper 1%","commenter_a":"OMG. It's over. Get on with life.","post_message":"In Opinion, Harvard professor Lawrence Lessig says there is precedent for such a move."},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"},{"comment_id":"10153966142134411","commenter_b":"Ahaha...Bryndzova giving all you nazis away...hahahahaha","commenter_a":"Bandera was a patriot who fought the Soviet murderers in his country.Glory to Ukraine!","post_message":""},{"comment_id":"10153064039634411","commenter_b":"Apart from the many proven lies? He was a cold blooded killer, how's that heroic?","commenter_a":"That bit about Jewish controlled media ... Whoa! How repetitive. And untrue. A sniper's job is to reduce the length of war by taking out one person at a time who appears to be aiding the killing of Americans. Thus Not mowing down a big group, thus not continuing backlash. Yes, he died young, at age 38. The movie is portraying the truth.","post_message":""},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"868576086513962","commenter_b":"My mako 10 rounder has never feed a full magazine flawlessly","commenter_a":"I think we shouldn't have to do this, there shouldn't be a magazine restriction","post_message":"What do you think about this?"}]
