[{"comment_id":"600616960147229","commenter_b":"@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"1139241312762564","commenter_b":"Woman? Never will be. With or without IT.","commenter_a":"Be happy Caitlyn. You are a strong woman.","post_message":"Monica Lewinsky: \"BEAUTIFUL\" Rosie Perez: \"Wow\" Questlove: \"Respect\""},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"10153542533598352","commenter_b":"Wtf.....it's not like her f ing nipple is sowing or something.....how about telling the girl who come with the dress so short they can't bend down to pick up something.....how about telling the girl with their clothes so tight they can't breathe.....sweetheart enjoy your time screw them.....if they still messing with you just let hulk out and tare the place apart....well I would....I can't have fun no body having fun","commenter_a":"That's messed up they just trying to find things wrong","post_message":"Mother slams school officials who insisted her daughter's floor-length, long-sleeved prom dress was 'too revealing', claiming they 'targeted' her because she is 'plus-size'"},{"comment_id":"955398181243627","commenter_b":"And we will ship them out idiots","commenter_a":"BIGGEST WANKER MUSLIM OF ALL TIME","post_message":"This is only the beginning..."},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."}]
