[{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"1181257421894286","commenter_b":"Lmao. Wouldn't that be frowned upon?/ wouldn't we be illegal immigrants?","commenter_a":"#getyourasstomars","post_message":"Aldrin wants us on Mars by 2040."},{"comment_id":"10153539209048487","commenter_b":"Oh please tell us what you know about Locheed /Martin!","commenter_a":"Cuz Lockheed Martin sucks","post_message":"The F-35 was supposed to be inexpensive, adaptable, and reliable. How did it become the most expensive aircraft in history?"},{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"},{"comment_id":"10155373545461162","commenter_b":"Black Women abuse their daughters and worship their sons.","commenter_a":"GM, Giving praise to God, that the baby is home safe","post_message":"HELP FIND THIS GIRL: A 12-year-old girl went missing from the Austin neighborhood on the West Side Wednesday afternoon. Claudia Jackson was last seen about 3:30 p.m. when she left her home in the 400 block of South Laramie after she was reprimanded, police said. Anyone with information is asked to call police at (312) 744-8200. \"SHARE\" to bring Claudia home. @webpagelink"},{"comment_id":"967437919978383","commenter_b":"Bruce, you're just doing way to much now....you've had your 'fun' trying to outdue the Tupperware Girls and all, but this is enough now","commenter_a":"Ratings dropped.","post_message":"In one tweet, it seems Caitlyn Jenner's political support may have shifted."},{"comment_id":"10153206762797377","commenter_b":"That's right!!! They have started doing everything you have talked about! Next they will start Building the Wall!!!! Lmbo!!!! Go Mr Trump!!!","commenter_a":"They can`t stop the peoples chose for Trump that`s already there!!","post_message":"Trump Tweets: Wow, because of the pressure put on by me, ICE TO LAUNCH LARGE SCALE DEPORTATION RAIDS. It's about time!"}]
