[{"comment_id":"10154026278303812","commenter_b":"She killed herself she was the ignorant idiot","commenter_a":"How about a conviction and prison time for a change, send the message loud and clear.","post_message":"JUST IN: TX grand jury indicts trooper who first stopped Sandra Bland in her car on perjury charge. @webpagelink"},{"comment_id":"1263484480357673","commenter_b":"He emptied out gitmo... FOR himself and KILLARY.... Good IDEA!!!!! NOW JUST go.... YOU horrible DISGUSTING TRAITOR!!!! Plant.... Unlock the docs.... Barry is a CRIMINAL!!!!!","commenter_a":"Their plan is working. Next up, single payer govt. system.","post_message":"IMPLOSION.  Carriers dropping out.  Rates skyrocketing.  UPDATE:  @webpagelink"},{"comment_id":"10153986219495950","commenter_b":"You must be getting paid a pretty penny, lady. #HillaryForPrison2016","commenter_a":"Wikileaks, Hitlery's thugs throwing bombs, stinking libtard filth?","post_message":"“I’m very excited to see Hillary become president,” gushed Natalie Portman."},{"comment_id":"1351703334882522","commenter_b":"He should be raped to death by chainsaw","commenter_a":"Place him in the general population of prison. He won't last. That is the one crime they don't tolerate.","post_message":"Petition Created To Publicly Hang Benjamin Taylor, Who Raped 9-Month-Old To Death!  This guy is sick, its our duty to make sure he never harms another child."},{"comment_id":"1175870485808384","commenter_b":"YES\"","commenter_a":"Obama does not want us to abide with that law. What the hell are you talking about. Where do you get your information at.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1193491007392830","commenter_b":"@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"}]
