[{"comment_id":"10153371613511336","commenter_b":"Leave it alone. Enough already!!!!!!!","commenter_a":"REALLY? think theres much better ways to spend our tax dollars","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10153693446321037","commenter_b":"Women on women issues unless it's Bills sexual affairs then she doesn't care.","commenter_a":"Maybe she should have first looked to tackle it at the White House when she was living there.","post_message":"Hillary Clinton is the first 2016 presidential contender to address the issue of campus sexual assault on the campaign trail, but she may not be alone for long."},{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"\"[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,\" said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"10153203916923984","commenter_b":"Stand By Him- Military knows they are the boss-but a chaplain has an higher boss. Military should not let this man go.","commenter_a":"Why only a 1 month assignment as assistant? Is that the norm? Missing pieces of this story.","post_message":"This highly decorated vet and former SEAL chaplain is facing something unexpected after 19 years of service...  Do you stand by this lieutenant commander?"},{"comment_id":"888413677941681","commenter_b":"We are aliens!!!!","commenter_a":"Blacks are the only ones seen. Thats good news. It could only mean that whites are aliens.","post_message":"Google Identifies Black People As Gorillas & Other Image Recognition Fails"},{"comment_id":"908022272624161","commenter_b":"How dare they,women please make your votes count!","commenter_a":"I don't understand how any woman can be a republican!","post_message":"Another day, another Republican attack on women. Shame on them.  Read more here: @webpagelink  Image by Occupy Democrats, LIKE out page for more!"},{"comment_id":"10153427555429087","commenter_b":"How the hell do you not get 1000 signatures? Hahahahahaha","commenter_a":"Fail @username","post_message":"A spokesman for the Ohio secretary of state has confirmed to The Hill that Martin O'Malley failed to get the necessary 1,000 signatures to appear on the March 15 ballot."}]
