[{"comment_id":"1025040644216607","commenter_b":"@username , I think there is, but would have to look it up. Basically the way it would work though is if impeachment is not possible, a no confidence vote by congress could in effect say we no longer recognize this Presidents authority. Members of congress can be sanctioned, why not the POTUS?","commenter_a":"What we need is Nation wide non-compliance with, or recognition of authority, or any further orders coming out of the White House. Personally I think a no confidence vote is in order. Write your Congress and demand the sanctioning of the President until the end of his term, for gross executive over reach and abuse of power.","post_message":"The president continues to show his disregard for millions of Americans with his 'Bathroom Order,' never bothering to consult with parents. Instead, he decided to issue an order threatening the loss of funding and lawsuits from the government to schools that don't comply."},{"comment_id":"1801777286727036","commenter_b":"She won't get paid for this job","commenter_a":"Kellyane Conway you are a pollster and not a campaign manger and it is showing. You have never been part of a winning national campaign your whole political career, and with Donald \" The Crook\" Trump it looks like your record will be kept intact. Your only hope is that everyone has missed this army of Donald \" The Crook \" Trump supporters out there that just can't wait to vote from Donald \" The Crook \" Trump. But the only factual data that we have right now is early voting numbers,and so far Hillary Clinton is leading in the battle ground states including Florida,if Donald \" The Crook \" Trump looses Florida it is ball game over, he will never reach the 270 electoral votes to win the election. He has to win Florida, North Carolina, Colorado, Nevada, and turn a blue state or two red. I guess anything ...","post_message":"\"Apparently the Hillary Clinton team is playing follow the leader, with us in the lead.\"  -Kellyanne Conway"},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"10154189751584062","commenter_b":"Whiney tail! That's what my mother would have called him. Shame!","commenter_a":"He sounds like he needs a pacifier and a security blanket. ..","post_message":"Garnet Coleman is defending his claims that he felt mistreated during this traffic stop last month, despite what the video shows. Some law enforcement groups are demanding an apology - hear what he has to say about that tonight at 10. You can see video of the entire stop here: @webpagelink"},{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"10153383966333352","commenter_b":"This isn't cute in fact it's sad that some women are going to grave lengths to look like someone else.","commenter_a":"She's just stupid","post_message":"Sisters attempting to copy Kylie Jenner’s plump pout left with swollen blue lips after repeatedly sucking a bottle"},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"}]
