[{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"951268851580640","commenter_b":"Nadia: You must one miserable bitch in real life. you have the nerve to pretend to know Shannon well enough make the unfounded assumptions you just made. You have no idea what her function at Walmart even is yet you make this idiotic comment. Let me guess, you hate YOUR job and so have this need to crap on others? Her simple point was that it's a myth that all Walmart employees are on or qualify for foodstamps. Keep on hating and being ignorant!","commenter_a":"I have worked at walmart for ten years. I don't even qualify for wic because I make too much money! And with my first baby on the way I could have used the assistance. Not every single walmart employee is on food stamps. Oh and I also bought a house, got a nice car, all while working there....crazy","post_message":"That's a one cent difference, folks. Only *one* cent.  Many thanks to Slate.com for the image (and the facts)!"},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"444744122316849","commenter_b":"YES IMPEACH Obama and his Administration","commenter_a":"The state of affairs in America is so sad. All about obama.","post_message":"Did President Obama do this on purpose or could it have been by accident?"},{"comment_id":"10153593873146130","commenter_b":"Bobby McDonald. you are 100% wrong. the only way felons and nut jobs can get guns illegally is through criminal connections which already increase their chances of arrest. why you would rather want to get rid of BGCs so criminals can get guns in a Walmart is something so irrational and naive i simply cant understand that kind of thinking.","commenter_a":"It's incredible that there are people out there that call themselves responsible gun owners but have a problem with background checks","post_message":""},{"comment_id":"1638898229733425","commenter_b":"Everything good in your speech, but I believe illegals should not be getting welfare or food stamps, or free health care or education it's just a magnet and most of them are not paying into payroll taxes. You are still avoiding what you are going to do with the illegals that aren't criminals. Actually they did break the law if they came here illegally and if they stay here even if they don't get citizenship it's still ammnesty. You need to be up front with what you are going to do.","commenter_a":"Great speech!!!!","post_message":"Thank you for your wonderful support last night- with regard to my Immigration Speech that I delivered at the Phoenix Convention Center. I love this country - and you, the people. Lets MAKE AMERICA SAFE AND GREAT AGAIN! I love you! Donald J. Trump"},{"comment_id":"1777981479109906","commenter_b":"Karma will catch this hag","commenter_a":"Vote her out !!!!!","post_message":"This Florida prosecutor tried 77 kids as adults in a year  65 of them were black.  #MicBrights"}]
