[{"comment_id":"10150859256639999","commenter_b":"What a great joke....I mean choice for first woman president! Way to be a role model for young thugs of this great nation! Proud non supporter of the most despicable woman in the world! Rot in prison and may you get your soul back from satan! God bless America and God bless the American dream!","commenter_a":"She'll have plenty of time to read in prison!","post_message":"\"She’ll drop everything for a few minutes of blowing kisses and reading Chugga-Chugga Choo-Choo with her granddaughter,\" Chelsea Clinton said of her mom."},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10154687828874657","commenter_b":"DEPORT this terrorist!","commenter_a":"Most universities are cesspools","post_message":"Amazing. ISIS recruiters are infiltrating our schools as teachers, now?"},{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"},{"comment_id":"10153644679730927","commenter_b":"Of course, if you are a dissenter, you will be eating in prison. If it's so great in Cuba, why do we still have Cuban refugees fleeing to the US? Could it possibly be due to the oppressive Marxist-Leninist Castro regime? Leftist fools admire their heroes, communist revolutionaries Fidel Castro and Che Guevara. Patterson should stick to writing novels.","commenter_a":"So go live there James......it's called socialism, or communism. New cars are 1958 chevies, and you forget the rationing lines weekly for food? Plane flights now available for you James, and don't let the door hit you in the a$$.","post_message":"WATCH--\"I think in this country we should at least take care of the basics. So we doing a bad job in that area. Really bad ...\""},{"comment_id":"848078538560940","commenter_b":"Only fucking idiots want her","commenter_a":"Am I the only person who likes her? Yikes.","post_message":"Hillary Clinton could finally shatter that glass ceiling."}]
