[{"comment_id":"10155622855165354","commenter_b":"Pretty soon we'll be sending them on chartered flights, like the illegal immigrants we're busy with right now.","commenter_a":"uh huh!!","post_message":"Infuriating..."},{"comment_id":"10153334889369369","commenter_b":"Crazy btch","commenter_a":"@username Olivia Salvatore","post_message":"At 3 stories high and 3,000 square feet, this might be America's largest closet.  [\"Secret Lives of the Super Rich\" airs tonight at 10p ET/PT.]"},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"},{"comment_id":"1138559072849036","commenter_b":"Are you still w trump ? Onilk Deleon","commenter_a":"If you really want to start sending these people a message. Start taking these videos and comments and send them to their employers.","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC.  #MicBrights"},{"comment_id":"10155994717525615","commenter_b":"Well, we now know which four are the cream of the crap.","commenter_a":"What does that say about the four that signed?","post_message":"NOM could only get four out of 17 candidates to sign? What does that say about their influence?"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"10153724102627217","commenter_b":"Ms. Herod... Majority of UK science budgets are coming from EU... Now a lot of most important science projects are too expensive for even the US alone... Not to mention working scientists who are working in UK aren't British, but from EU who are paid by EU... UK's science sector is one of the biggest looser after EU exit...","commenter_a":"Lol pmsl...so now learning science has alot to do with brexit...not very intelligent then are you...we had science before we went into it we still have it & for all the years to come ...please stop with the crap ..we are & we will be better of out","post_message":"Are you a scientist worried about #Brexit? Here's the latest."}]
