[{"comment_id":"10154740685431337","commenter_b":"Hillary is the whore of Islam.","commenter_a":"If Hillary is elected president, Putin said he will wage nuclear war against the United States, but I guess that's not a big deal...","post_message":"Barack Obama's 10 Essential Sci-Fi Movies And Shows:  The Matrix Star Wars: Episode IV Star Trek: The Original Series Cosmos (...)"},{"comment_id":"481049412085639","commenter_b":"Send her ass back over there fucking trader.","commenter_a":"Hate it!!!","post_message":"A woman who left home to join ISIS just got served up some karma.  Good. Anyone supporting ISIS is a traitor to America.  Click 'LIKE' if you agree!"},{"comment_id":"10153738419359062","commenter_b":"How about we stop the meth, heroine and cocaine on the streets?","commenter_a":"There's go's the neighborhood","post_message":"Not just limes in the back of this truck!"},{"comment_id":"10153434092834586","commenter_b":"First let's remove these beautiful creatures from these ugly hateful humans, then hook them up to the carriages to earn money. Ugly people with ugly hearts. Disrespectful pos.","commenter_a":"Its not fun for the poor horses","post_message":"This is what happens when you voice concern for injured carriage horses in #NYC.   What kind of person could do this?! #BanHorseCarriages"},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"},{"comment_id":"10154201387086037","commenter_b":"How many people did Jesus kill? How many sex slaves did Jesus have?","commenter_a":"In the Quran Mohammed said to \"cut off their heads\". That's the Islamic role model. Just be glad that role models Jesus and Gautam Budhha didn't say the same about \"infidels\". There would be even more chaos...","post_message":"\"He was brainwashed but we do not know by whom, when or where,\" said a family friend."},{"comment_id":"10154347399052045","commenter_b":"@username well those kids shouldn't be causing trouble then no incident would have to end up like that. Just go school then go home then trouble won't follow you, like the old saying if you walk like a duck, talk like a duck, act like a duck then you're a duck... don't hang out with ignorant bad apple kids just be smart about it...","commenter_a":"These people ars out protesting, these 2 teenage kids that assaulted an off duty police officer. And because of one of these kids comes up from behind and hits this officer while holding his friend by the shirt he pulls out his gun and fires it into the ground, NOT INTO THE AIR, people protest. If these kids got the butt handed to them in there home growing up they wouldnt be out in the streets causing problems. The kids r lucky they dont have a bullet wound in the A $$","post_message":"Protesters in Anaheim are blocking streets to demonstrate against an off-duty LAPD officer's confrontation with a teen in which he fired his gun. @webpagelink"}]
