[{"comment_id":"772199822829043","commenter_b":"Don't give in!!!! Let the threaten a lawsuit then tell the idiot atheist to go home & leave his town alone!","commenter_a":"Leave","post_message":"‘It’s very surprising that one guy can come from out of state and start all this’"},{"comment_id":"10153622480508690","commenter_b":"Nna, infact you get am","commenter_a":"And this is not a problem at all to the world peace, unless when Israel bombs Hamas terrorists, then it will be a problem for the world peace. Hehehehehehehehe One good thing people should learn is that Muslims from the unset, have always wanted to dominate. Whether Muslims like it or not, Israel of today will never succumb to them again. If Israel is the problem of the world, then Palestinians should try and leave the land of Israel and let's see whom Israel will kill again. Thousands are dying in Syria, Yemen and Iraq, yet it's not a problem to the world peace. Tell that to the birds. Never ever succumb to the demands of any Muslim community, if u give them one today, tomorrow they will demand for 3. Always push them back or they will over run u. This is why i pity Europe,maybe they are not ...","post_message":"Syrian government has conducted nearly 7,000 air strikes during the month of July, according to the Syrian Observatory for Human Rights, making it the most intense bombing reported in one month since the beginning of the conflict in 2011. @webpagelink"},{"comment_id":"665287136906749","commenter_b":"sadistic bastards will rot in hell.......","commenter_a":"Horrifying...","post_message":"The religion of peace continues to disappoint. @webpagelink"},{"comment_id":"10153040281701051","commenter_b":"And don't go back for her. Let her walk her crazy ass home.","commenter_a":"Dump her ass at the lake then go take care of your business","post_message":"This husband was so stunned by his wife’s behavior that he took out his phone and started recording the whole thing."},{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."},{"comment_id":"10153443725952293","commenter_b":"O AGORA SOSSEGA E ME DEVOLVE MEU DESODORANTE","commenter_a":"Victoria Dowsley","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10153017747911130","commenter_b":"Yes, this guy has lost her mind...HA! Nut job liberal.","commenter_a":"God bless him.....dont judge what you dont understand","post_message":"\"I am a woman.\""}]
