[{"comment_id":"10153187072706107","commenter_b":"How about a constitution change that says if both of your parents are illegal then you're illegal even if you're born here. No more anchor babies. No dream act, no in state tuition, nothing. The illegals are a slap in the face to the people who are legally trying to immigrate.","commenter_a":"Good Paul!","post_message":"Just minutes ago, on Fox News' On the Record, I announced I will introduce legislation this week to cut off ALL federal taxpayer funding for so-called \"sanctuary cities\" -- until they start abiding by federal law.  For taking this stand, I know I'm going to be attacked like never before.  But I think it's high time someone did something!  The truth is, for years politicians in BOTH parties have promised you and me secure borders.  But all we have to show for those promises is sheer lawlessness.  This President has time and again sought to go around Congress with illegal and unconstitutional executive actions regarding immigration.  And now many American cities are following in lockstep in open defiance of federal law!  These so-called \"sanctuary cities\" prohibit the use of funds to enforce federal immigration law, usually banning officers from even asking about a person's immigration status.  These cities become magnets for illegal immigrant criminals and gang members who have been deported multiple times, but know they're safe if they can just stay within a city's borders.  This can't be allowed to stand.  Not when we know terrorist organizations are looking at our porous southern border as a way to gain entry into the United States.  Not if we are to save the concept of rule by law.  My bill would end all federal taxpayer funding for these cities until they start ENFORCING federal immigration law.  I know these cities will shriek and moan that there shouldn't be any strings attached to all of your tax dollars.   They'll say they're entitled to pick and choose what laws they recognize.  And you can bet our national media will be on their side, and come after me with everything they have.  But it's time politicians cared more about keeping their promises to the American people than what our national media says.  If you agree, I need to hear from you right away.  Please sign your \"Enforce Immigration Law\" petition and agree to your most generous contribution of $20.16 IMMEDIATELY: @webpagelink"},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":""},{"comment_id":"1221087354570479","commenter_b":"It is French and Spanish ancestries some of the women probably do have more hair than the guys... I should know I was one pretty hairy teenage girl growing up in New Orleans!","commenter_a":" school board has a policy that does not allow any facial hair on male students, Tangipahoa Parish school superintendent Mark Kolwe told ABC News. So female students can have facial hair? Seems sexist to me.","post_message":"The school told all students with facial hair that they had to shave before the ceremony, but the rule was not enforced during the school year."},{"comment_id":"765874163568797","commenter_b":"Unfortunately, so true.","commenter_a":"How are you guys able to post, I thought the Obama phones were shut off already?","post_message":"We have nobody to blame but ourselves..."},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"},{"comment_id":"10153133093676491","commenter_b":"OMG IK WIL DIT NU AHH NERD FEELS OVERLOAD","commenter_a":"@username Bram Van der Maat","post_message":"Attention, fans of The Lord of the Rings Trilogy."},{"comment_id":"10153240103694575","commenter_b":"Don't nobody wanna hear that mess they need to charge her as an adult.","commenter_a":"You failed at parenting now it's time the state steps in with a real punishment!!! I don't know why that woman is trying to act like if someone beat her kids like that she wouldn't want to beat the crap out of them! Fact is you raised the one that did it. SHE MADE HER BED NOW IT'S TIME TO LAY IN IT!!","post_message":"Russ McQuaid spoke today with the mother and grandmother of the teen girl accused of attacking another girl and a young boy in Brookside Park.  The suspect's mother says her daughter suffers from PTSD and other ailments.  See more of the interview here: @webpagelink"}]
