[{"comment_id":"10154497186563445","commenter_b":"Our friends in england's women and children are also being raped to death or enslaved by \"refugees\" and have some of the strictest gun laws ever so I think we can cut our losses there, drug addicts.","commenter_a":"Shit","post_message":"While the DEA has been busy reclassifying CBD as a Schedule I drug, our friends in England are rightly classifying it as a medicine."},{"comment_id":"10153727792982217","commenter_b":"Written by a 14 year old, no doubt!","commenter_a":"300 times more massive??? Someone needs sacking and a lesson in English 😂😂","post_message":"After a five-year journey, NASA's Juno Mission to Jupiter is ready to apply the brakes.  #BBCGoFigure"},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"583963178430303","commenter_b":"Fucking slut","commenter_a":"I think it's actually kind of good. There's a silver lining in everything. She will now live in the free world and be faced with the reality that she ruined her life. Every second of every day. Being out will slap her harder than a cell ever could after being locked up for so long.","post_message":"Leslie Van Houten has been in prison for 46 years now."},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"828087617226661","commenter_b":"Do you think if someone wrung her neck her face would pop off???","commenter_a":"I can't see her face without wanting to punch her in it.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"494457030748305","commenter_b":"Bitch u should forgive me","commenter_a":"@username hope u forgive me","post_message":""}]
