[{"comment_id":"1192273137481692","commenter_b":"Isn't this a dam foolish question to be asking of the citizens of US...why would we want Shariah law to begin with...they are taking over and our govt is allowing it...they have to conform to our CONSTITUTION here in America...can't do it, go back to your hole that practices Shariah wicked law..","commenter_a":"Yes! there is NO place in our country for Sharia law so take your laws home, Obay the constitution your in America.","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10153573375216509","commenter_b":"Take away her license and fine/jail her","commenter_a":"Very cruel person","post_message":"A Texas veterinarian posted a proud photo to Facebook of herself smiling as she dangled the limp body of a cat she allegedly shot with an arrow. The vet said it was a feral tomcat. People who saw the post were outraged. Now, animal rights activists are pushing for charges.  @webpagelink"},{"comment_id":"10154420186151194","commenter_b":"Allah is shopping like à sodomized bitch right now","commenter_a":"who just saw that giant fuckin orb?","post_message":"LIVE: Anti-ISIS military op near Mosul, Iraq"},{"comment_id":"10153058283284411","commenter_b":"Carlan those who behead people in the name of fake Islam are created by Mossad , CIA and MI6 have been given training by them please wake up to the reality CNN and fox news are not just the lives stop your hatred against us muslims please leave us alone , those isis members have kept their fake muslim names","commenter_a":"Germany starting shit again... Shocker.","post_message":""},{"comment_id":"10155235641066037","commenter_b":"Very true, so it's OK for them to think they can sneak in because they can't afford to become a citizen? We have plenty of people out of work and those are jobs the unemployed could be working now isn't it. No wonder Trump wants to cut funds to these city's. That opens up more jobs to Americans, because there is a minimum wage in states and you are not suppose to hire illegals.","commenter_a":"Sanctuary city's think the above the law and don't have to enforce the law.","post_message":"\"I don't have a clue,\" said U.S. Homeland Security Secretary John Kelly."},{"comment_id":"1053026444717108","commenter_b":"Good. She is druggy scum! She deserves to never ever see him again!!","commenter_a":"Mother, child bond, find away to keep them together","post_message":"PLEASE SHARE: Puyallup police are asking the public to be on the lookout for endangered 5-day-old Jeshua Taylor and his mother (pictured) Myra Maria Aguilar. Police said Myra appears to have fled with Jeshua in an attempt to keep the child from state custody. >> @webpagelink"},{"comment_id":"1135446926503853","commenter_b":"And own the chef world John peck !! You're gonna kill it !!","commenter_a":"So those aren't His arms ?","post_message":"BEAUTIFUL: Former Marine sergeant John Peck lost his legs and arms when he stepped on a homemade bomb in Afghanistan.  Thanks to a double arm transplant, Peck says the best thing about having arms again is that he can hold his fiancee's hand and become a chef.  PHOTO: Brigham and Women's Hospital MORE: @webpagelink"}]
