[{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"},{"comment_id":"10153310876381770","commenter_b":"@username right lol these idiots.","commenter_a":"Even as a Republican voter, I believe that we don't need another Bush in the White House.","post_message":"Jeb Bush is suspending his campaign for the Republican presidential nomination following a dismal performance in the South Carolina primary."},{"comment_id":"383095042054511","commenter_b":"@username who the fuck needs a third world country when animal whore leaches like u and your mom keep my taxes well spent in my own country. Keep up all the hard work in defending the fucking animals in the post and I'll set aside a little part of everyone of my days providing good reading pleasure for all of the rest of us the know a money grubbing whore when we see one. And u would definitely make a great whore make no mistake. Just like your mom was.... Now go out and b the best whore u can b and quit falling back on my taxes to earn a cocksucking living. Thanks","commenter_a":"Limit welfare to 3 yrs unless disabled. ,quit paying for children to be born with taxpayets money. If you have achild and cant pay uour hospitol bill keep thier tax returns n apply them untill bill is paid off","post_message":"This mother of 12 lives entirely off government benefits. She also funds her plastic surgery with taxpayer money. She makes more per year than most people earn at work annually.  A petition has been created demanding that she get her benefits revoked. Do you support revoking her benefits?"},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."},{"comment_id":"10153377125868984","commenter_b":"This administration doesn't WANT to bring people together. They constantly pit people against each other with inflammatory, insulting rhetoric - while involving themselves with the worst of the worst (like Al Sharpton). The entire world is up in flames and it's getting worse and not better.","commenter_a":"She's just pathetic.","post_message":"Michelle Obama just issued a message to black America about what white people do to \"folks like you and me.\"  This woman needs to be exposed for what she is telling our youth... spread this everywhere so Americans know who's REALLY trying to divide the country."},{"comment_id":"10157626698695603","commenter_b":"Stupid woman needs to be arrested .","commenter_a":"Thank God someone called the police and didn't just stand around videotaping it.","post_message":"Thankfully, the cats were not injured during the rampage."},{"comment_id":"10150798110624999","commenter_b":"@username, the Constitution says nothing about corporations having the same rights as The People, either.","commenter_a":"The constitution says nothing about abortion","post_message":"Oklahoma lawmakers have voted to ban virtually all abortions. That's flatly unconstitutional, the Editorial Board writes in The New York Times Opinion Section."}]
