[{"comment_id":"10152916992026749","commenter_b":"stfu","commenter_a":"Horrible man!!!!!!","post_message":"First Steps."},{"comment_id":"10152747797741051","commenter_b":"Not a nun no more now she's a sum cause that's what she got","commenter_a":"I thought nuns were sworn to celibacy","post_message":"A nun was rushed to the hospital with extreme pains. When the doctors told her what was happening, she couldn't believe it."},{"comment_id":"895085380544226","commenter_b":"she shouldn't be driving on suspended license and the police where doing there jobs","commenter_a":"go back to where you blong","post_message":"(Video) If she wins, it will place Sharia law above our own and above the safety of police officers.  It wouldn't be the first time this part of Michigan has seen Sharia law placed above the law of the land....  @webpagelink"},{"comment_id":"877412165685172","commenter_b":"As long as you're legal. Either way, hard work or not your family broke the law so you're criminals. It's the truth. The country is better off without illegals.","commenter_a":"Please please all illegals and Mexicans and Mexican-Americans keep posting your stories. We need to show Trump and his ignorant followers the truth!!! Post your stories. Post your families stories. Flood the Internet and Facebook with the truth of why people of every nationality and every nation come to America!!! Make it known and state the facts and truth!!!!!! Bring ignorance to its knees.","post_message":"She really nailed \"The Donald!\""},{"comment_id":"10154346437467464","commenter_b":"Because of Ted and politicians like him, we are going to have Hillary for president. There won't be a America left for another president. They will bring in millions more illegal aliens that will vote democrat and the republicans will be an endangered species.","commenter_a":"Too bad Cruz's Pride is giving it away to the democrat socialist party!!!","post_message":"Texas is blessed to be home to so many of our men and women in uniform, and El Paso’s Fort Bliss is a crucial base for those who serve on the front lines to keep our entire nation safe and secure."},{"comment_id":"10154079186342541","commenter_b":"@username what are you talking about ?","commenter_a":"Officers do well checks. Would have taken a few seconds for a FB friend to call the cops and have that phone traced.... SMH.","post_message":"\"It's amazing for someone to sit there and see somebody or hear them take their last breath, and nobody did anything.\""},{"comment_id":"10153728692094117","commenter_b":"Lol pussy","commenter_a":"Reason can go fuck itself. If you are a pro-Trump libertarian, like my page.","post_message":"\"You know−the Constitution−there's nothing like it. But it doesn't necessarily give us the right to commit suicide, as a country, OK?\""}]
