[{"comment_id":"10153188449234087","commenter_b":"Go to jail!","commenter_a":"You should have called it a sin. We readily forgive those, just not mistakes.","post_message":"\"That was a mistake. I’m sorry about that. I take responsibility, and I'm trying to be as transparent as I possibly can,” Hillary Clinton told ABC News's David Muir."},{"comment_id":"10154266644379087","commenter_b":"@username news flash f*ck face, when he is in office in january, he will cut off 12 billion in aid to Mexico and hence they pay for the wall, stfu and deal with you LOST, LOST,LOST","commenter_a":"Not very Presidential attacking the Press that is protected by the 1st amendment. Can you imagine the Right Wing outcry if Obama had tweeted about the negative coverage he was receiving from Foxnews?","post_message":"Trump's tweet comes just days after telling \"60 Minutes\" he would be restrained on Twitter as president."},{"comment_id":"1052361568153705","commenter_b":"A lot of people who follow this page will probably chuckle at this... But those are actually two very evil women you see picture there.","commenter_a":"#Hillary2016","post_message":"Hillary and Cecile Richards sat down with Refinery29 and talked about everything from “mansplaining” to the future of abortion rights."},{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied \"let the floodgates open and let every single person just come on in\". If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"\"He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,\" Jeb Bush said of Donald J. Trump."},{"comment_id":"10153891528986162","commenter_b":"@username John Koester isn't this by you ?","commenter_a":"Abner Calzada","post_message":"WATCH LIVE: Reports of fatalities in active shooter situation in San Bernardino, sources say --> @webpagelink"},{"comment_id":"786106801492916","commenter_b":"How in the world someone in the right mind, not see how how corrupt this woman is! She meeds to go back to school , she needs to learn what the meaning of \"C\" is. Not recalling 39 very important information, i think this Rat should be in jail. Go Trump, keep doing your thing, I'm sure you can destroy her nerves, and soon she will have a nervous breakdown. This is America, American decide our President, not immigration or the Latinos. I'm a Cuban American and very proud, of this country! Trump for America","commenter_a":"Its already been answered. Its because she is CROOKED!","post_message":"The polls are close so Crooked Hillary is getting out of bed and will campaign tomorrow. Why did she hammer 13 devices and acid-wash e-mails?"},{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."}]
