[{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"1154038954631400","commenter_b":"@username show this to your boo.","commenter_a":"This made me think of you, Raima. And also laugh really hard.","post_message":"Will Ferrell: comedian, actor, just your average millennial."},{"comment_id":"969075749885792","commenter_b":"That was you , a hoe and a drug user","commenter_a":"Your corruption comes to an end today Hillary! You have stiffed this nation, you have deceived the American people. NO MORE CLINTONS, America will not let you disgrace this nation any more!","post_message":"Todo por lo que hemos trabajado se decide hoy. Comparte esto si apoyas a Hillary: hillaryclinton.com/buscador"},{"comment_id":"949480448492859","commenter_b":"I know and all white people are racist, and all blacks are bad and all people named Ana are jerks. Yeah I get it.","commenter_a":"Whatever people think about Trump, he's not as stupid or delirious as the Democrats who put Israel and the USA in jeopardy of a nuclear strike, and gave the biggest supporter of terrorists over $150 billion dollars to wipe us out... Our government is carrying political correctness to the point of suicide, just like all the European nations did by taking in millions of so-called refugees... People think it might be dangerous if Trump has his hands on the nuclear arsenal... how is that any worse than giving nukes to our biggest enemy who daily threaten our extinction and Israel's extinction??? AND CRUZ was behind all these deals. We don't need him in the WHITE HOUSE. Lawyers are liars and he is not different than the rest of the lawyers around this country.","post_message":"Carly Fiorina: It's time to unite behind Ted Cruz: @webpagelink"},{"comment_id":"10157833326000093","commenter_b":"The most hated woman in the world !","commenter_a":"Time to put the Clintons and their never-ending, gross and creepy scandals out to pasture.","post_message":"The Clintons and their minions deserve to be driven from public life."},{"comment_id":"10153396046867452","commenter_b":"what if they didn't do it... cut it off anyway????????????????","commenter_a":"Thats the best freaken law ever. Pass it nation wide","post_message":"\"They have marked this child for life, and the punishment should fit the crime.\"  If an Alabama lawmaker gets his way, part of the punishment for people who commit sex crimes against children will be castration."},{"comment_id":"10158731027245206","commenter_b":"No pair of shoes, living or dead, is worth 700 buckers. Stop it. This makes me miss the old days, when you'd never hear about some spoiled girl and her \"serious,\" attention-getting problems.","commenter_a":"Material stuff irrelevant .. dog love for ever by the way very ugly shoes","post_message":"This mischievous pup sunk her teeth into some high fashion — literally — when she chowed down on her owner’s new $700 Christian Louboutin heels."}]
