[{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"},{"comment_id":"1790539951180053","commenter_b":"Yes I'm so glad we have had 164 shootings still at war . and trillions more in dept millions more in wellfare a totally screwed up healthcare system. Iran nuclear deal giving Iran billions . can't read it if you don't sign it . let's lie to the Americans because they are to dumb to see it . it was a video we are sorry ,sorry you destroyed our embassy killed raped and mutilated our people. Here is a couple of billion dollars and forget what you already owe us . oh and can we raise the dept drilling again or we won't pay SSI to the people who ducking paid into it . but let's keep those welfare checks going got to keep my peeps happy . get Chicago how are those tough gun laws going , highest rate of gun crime in the country . yup more gun ...","commenter_a":"Thank you GOD for giving us President Obama for two terms!!!!!!","post_message":"Hear that Donald J. Trump? President Obama DGAF about how you describe a terrorist attack."},{"comment_id":"10153854981326509","commenter_b":"No mardi, flo is absolutely correct. There's no mass influx of Mexicans if that fence comes down. They can already cross the border with very little paperwork anyhow. Your fears are quite blown out of proportion.","commenter_a":"Highly dislike this man. He's everything America doesn't stand for.","post_message":"To quote the businessman himself, Donald J. Trump seems to be a \"very rich\" man. @webpagelink"},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"10154148373635736","commenter_b":"His daughter/wife would hate that.","commenter_a":"When they said \"small hard object\" I just assumed the president had gotten excited.","post_message":"Police received a report Friday that President Trump's motorcade \"had been struck by what was believed to be a small hard object.\" He was passing through Palm Beach on his way to his Mar-a-Lago resort nearby, where he spent part of the weekend."}]
