[{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"},{"comment_id":"1017389715024162","commenter_b":"@username Muslim terrorist ? Kill them simple.","commenter_a":"When you head to the polls in November, remember, Hillary Clinton tweeted this : \"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" — Hillary Clinton (@HillaryClinton) November 19, 2015..","post_message":"Newt Gingrich said President Barack Obama and Hillary Clinton are \"misleading\" the American people about the #OrlandoShooting by refusing to say \"radical Islamic terrorism.\" @webpagelink"},{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"349180888539647","commenter_b":"Yeah, women's lib.","commenter_a":"I'd rather have her NOT have a romance - I thought that was the whole point!","post_message":"The hashtag #GiveElsaAGirlfriend began trending as many Twitter users voiced their support for a gay character in the Disney movie. What do you think?"},{"comment_id":"889958597769015","commenter_b":"Don't like her!","commenter_a":"What is there left to say. Sarah Palin \"will send them to kick Isis out\"sounds like he will put troops on the ground. Just what Isis wants. She sounds as bad as Trump. She doesn't even know what is coming out of her mouth. Mental problem. Think before you vote!!!!","post_message":"“No more pussyfooting around!”  That’s what she said... Here are the best one-liners from Sarah Palin's endorsement of Donald J. Trump: @webpagelink"},{"comment_id":"1080058818698124","commenter_b":"Boycott Marco and Kasich media attention until they get out! Spread the word! They have no glide path and are trying to protect rhino control on the outcome of the nominee!","commenter_a":"Trump is winning the Blaze poll 68% at this posting. Better get some bots for Cruz going so he can cheat to win, he's good at it.","post_message":""},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"}]
