[{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"},{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"},{"comment_id":"10153427905081051","commenter_b":"stupid woman I hope she gets in big trouble .People like her don't need pets .They are a big part of the family","commenter_a":"GOOD! SHE NEEDS TO BE IN TROUBLE!","post_message":"Friends and family took one look at this woman's Facebook update and immediately called the police."},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"477247782478735","commenter_b":"All of that and his arrogance!","commenter_a":"All of the above and more","post_message":"How will you Remember Obama? www.eaglerising.com"},{"comment_id":"10153490516091337","commenter_b":"You mean unlike theAmerican Killers of babies, rapist, serial killers, the ones signing up to be terrorist! Jake you're a blinded fool!!","commenter_a":"Illegal immigrants are coming in from all over South America , through Mexico, and the Mexican government is doing nothing to prevent it. And if you people watched anything besides cnn and msnbc, you would know that a lot of them, not all, maybe not a majority, but a lot, are killers, rapists, or drug cartel agents, and since crossing our border which is leaking like a sieve have continued those harmful activities in the US. But obviously Trump is a bigot for describing what is really occurring. The fact is he is one of the few candidates who has described a coherent plan for what he would do as president, and been more open to the media by far in the short time since announcing his candidacy than Hillary ever has. I hope he blasts her back into the Stone Age in the general election if he wins the ...","post_message":"\"It’s not Mexicans necessarily. They’re coming from all over.\"  2016 GOP presidential candidate Donald J. Trump talked about \"killers\" and \"rapists\" again..."},{"comment_id":"545790502236393","commenter_b":"Liberals are NOT PRO ABORTION! WE ARE ANTI RELIGIOUS FANATICS THINKING THEY CAN RULE OUR BODIES! We are also pro families once children are born. We are anti poverty and anti starving and neglected children. We are as los anti ignorance!","commenter_a":"You will Never be president of my country. Nor will you ever dictate what I can or cannot do with my body. You creep.","post_message":"Really? He thinks that alienating 51% of the registered voters in this country is the way to get elected?"}]
