[{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153734549101323","commenter_b":"Fucking Liberal fucks! Feminist whores! Leave Star Wars alone!","commenter_a":"I'm not sure whether the viewer would have got the right impression of Jabba if instead of enslaving Leia he'd have given her a thatcheresque power suit and asked for her opinion on current affairs!","post_message":"It's one of the most memorable, weird, gross and resonant moments from The Return of the Jedi, and from Star Wars in general – and Disney is working to disavow it."},{"comment_id":"10154358010096037","commenter_b":"why would u put this animals pic on here??u people r the problem,neither his name nor his pic should be glorified","commenter_a":"Coward, plain and simple. Bury him in a casket of gay smut and pork.","post_message":"Omar Mateen, identified as the Orlando gunman, pledged his support for ISIS in 911 calls made amid his attack, according to the FBI. @webpagelink"},{"comment_id":"10150599168414999","commenter_b":"You only have the right to vote under certain criterion. If you want to use language like \"never was\" then I assume you forgot that only property owners were allowed to vote under the original constitution and blacks were also excluded. Changing times demand we evolve to the need. At this time we have tens of millions of Illegal aliens who have the ability to fraudulently vote. That is a potential problem.","commenter_a":"For me this is not about party politics as I am unaffiliated. 70% of Americans want voter ID. This is not about blocking the vote, this is about blocking the illegal vote. 52% of Dems, 82% of Repubs and 72% of independents agree want this, why should we ignore what is an obviously good idea?","post_message":"Democrats are most likely going to attack a host of measures, including voter identification requirements that Democrats consider onerous, time restrictions imposed on early voting, and rules that could nullify ballots cast in the wrong precinct."},{"comment_id":"521171901404436","commenter_b":"No I sure hope they stop these refugees from coming to our state in Arizona!!! Don't want them here!!!","commenter_a":"Come on fla...join texas","post_message":"Is your state in this MAP?"},{"comment_id":"10155378344568132","commenter_b":"As phoney as her boobs...","commenter_a":"That fantasy world u r capable of living in will soon have u filing for bankruptcy Missie!","post_message":"Mariah Carey says she's \"incapable of being in the real world and surviving."},{"comment_id":"1305769832812876","commenter_b":"Lock that b@tch up","commenter_a":"TODAY'S WIKILEAKS..Donna Brasile, GO READ UP! She got advance questions from CNN Debate, Hillary v. Bernie Sanders for Democratic run. She is the most corrupt politician possibly in our Country's history.","post_message":"As secretary of state, Hillary restored our reputation around the world and made us safer."}]
