[{"comment_id":"10154602642789062","commenter_b":"They need to close all of them they are evil an come from tha devil","commenter_a":"I hate Walmart.","post_message":"Wal-Mart is closing 269 stores, more than half of them in the U.S. - YOUR THOUGHTS?  UPDATE: 2 Houston stores closing -> @webpagelink"},{"comment_id":"10154641793644614","commenter_b":"She's a freaking pig!","commenter_a":"Hope she rots in hell!","post_message":"The mother of Victoria Martens, the 10-year-old girl who police say was drugged, raped and killed, had allegedly used an online dating website to arrange for men to sexually assault her daughter in the past, according to a search warrant.   After her daughter was brutally killed, Martens told police that she watched her boyfriend, Fabian Gonzales, assault the little girl \"for sexual gratification,\" according to the criminal complaint.  (Warning: The below story contains graphic and disturbing content)"},{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"1081030328612686","commenter_b":"Go bang your mother with a mace","commenter_a":"All you people saying taxation is theft are such complete morons. Taxation is a membership fee to live in the USA where we have benefits that greatly outweigh the cost. Why don't you renounce your citizenship and gtfo out of the USA and move to Antarctica if you don't want to be taxed. Bunch of unpatriotic pieces of human garbage in here.","post_message":"Wouldn’t it be great if you could refuse to pay your taxes until you decided your tax rate was “fair”?"},{"comment_id":"867191473393219","commenter_b":"@username illegal. Get ready to be deported or just leave. Leech","commenter_a":"I am not even American, i live in New Zealand and i support @username. Long before Trump ran for president i believed he is the man for the job. Smart, strong, dedicated and beyond all else brave enough to stand up for his vision and commitment, if anyone has what it takes to make change for the better it is Donald Trump. From all the way here in New Zealand - i have confidence in Donald Trump to clean up and create change. THANK YOU!","post_message":"Thank you FLORIDA! #VoteTrump on March 15th! #MakeAmericaGreatAgain"},{"comment_id":"968036809901222","commenter_b":"Take the criminals away first","commenter_a":"FAST & FURIOUS ???","post_message":"This is one of those times where a picture is worth a 1,000 words!"},{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the \"Wall\" you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The \"Wall\"you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."}]
