[{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.'  Is Ted Cruz right about Donald Trump?"},{"comment_id":"1213161752065703","commenter_b":"Report real news leave this story alone","commenter_a":"Do you realize that this constant back and forth over this story just reminds us that so-called 'journalists' in this age have NFI what they're doing? Being thorough is better than first, you all sound like a cross between TMZ paparazzi and the National Enquirer. Get a grip, you hacks.","post_message":"REAL OR FAKE? A Tennessee TV station stands by reports of a Santa's encounter with a dying child."},{"comment_id":"1916222085104197","commenter_b":"I thought Barbie vaginas were that lot marching in London recently lol","commenter_a":"Haha a what can I get a KenCock then in bits ere me like!!!","post_message":"Increasing numbers of women are going under the knife to have a 'Barbie vagina'  as a result of watching internet porn"},{"comment_id":"914001441995307","commenter_b":"Awsome woman!","commenter_a":"Barry Sheldon this was what I was talking about earlier","post_message":"BREAKING VIDEO: Mother Beats Her Son When She See Him Rioting in Baltimore  Mother of the Year Award? She goes straight hood on her son.   @webpagelink"},{"comment_id":"10152564935772217","commenter_b":"pussy","commenter_a":"D man is a fool is dis how you catch a thief","post_message":"Brave or stupid? This passer-by tackled a robber who'd just raided a jewellery shop in London: @webpagelink"},{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"1753310708283376","commenter_b":"F all them towel heads and illegal immigrants. It's time to Trump all your dumb asses","commenter_a":"What did you expect of an ILLEGAL, MUSLIM, ALIEN who should be IMPEACHED AND TRIED FOR TREASON AGAINST THE USA! HOWEVER, the ELECTED OFFICIALS WILL DO \"NOTHING\" AGAINST THIS \"TERRORIST\"!","post_message":"Obama Admits He Is Embarrassed By Americans [VIDEO].  He is the worst president in the history of our country.  Do you think Obama is the embarrassment?"}]
