[{"comment_id":"10153842036026336","commenter_b":"Is that all....disgusting? We can rid the nation of this vermin if we decide to get together and do it.","commenter_a":"Oh he didn't misread anything. He knows exactly what's going on and it's all part of his agenda to destroy America. Disgusting.","post_message":"Charles Krauthammer said that Obama's strategy to fight ISIS is not working because \"he thinks radical Islam is a passing phase.\""},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO:  A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink  The suspect even gave police a good look at him"},{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"766779530124121","commenter_b":"Vile woman","commenter_a":"LUCIFER CAN just go Home--The party is over--GOD BLESS AMERICA","post_message":"Thank you Indianapolis for the welcome. #ChooseCruz tomorrow: @webpagelink"},{"comment_id":"10154085328776782","commenter_b":"But if you are here illegal then you are already breaking the law just my thought","commenter_a":"Yes, mainly so it allows/requires them to get auto insurance. Having a license won't make people more likely to be in Oklahoma or use more resources. But if an undocumented person hits my car, I have a better shot of not having to pay for it myself.","post_message":"A newly elected Oklahoma lawmaker is pushing through one of his first bills this legislative session, but it likely to get some pushback from the majority Republican House. Patty Santos has the story: @webpagelink"},{"comment_id":"977246632310796","commenter_b":"Wth is a \"male feminist\"? This term is a total failure to understand what a feminist is.","commenter_a":"Amazing! A way for men and women to share the responsibility of contraception. This is the true mark of a male feminist.","post_message":"This is ballsy."}]
