[{"comment_id":"10153852047087061","commenter_b":"Woman need to have concealed carry. Just too nasty out there now.","commenter_a":"Wtf!!!","post_message":"BRUTAL ATTACK: Police are looking for a man who walked up to a woman near a San Francisco park and began punching her in the face. Read more: @webpagelink"},{"comment_id":"1092995934129991","commenter_b":"Who has Hillary been taking campaign money from? Can you even make the connection lol","commenter_a":"I wonder why @username won't report the latest WSJ national poll. @webpagelink #ImWithHer #HillYes","post_message":"Electability has become a cornerstone of Hillary's campaign."},{"comment_id":"2180920135465808","commenter_b":"@username Where did you get that nonsense? She doesn't get a pension.","commenter_a":"Imagine if Michelle did this. They would say she doesn't love her country and she's disrespecting the The White House (as if that were a thing). Repugs are the biggest hypocrites ever","post_message":""},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"437802309734983","commenter_b":"Wes spoken like a true submissive little bitch. Now go stand in the corner like a good little boy","commenter_a":"Hooray! Now, remove them immediately starting with Ferguson.","post_message":"President Obama is taking a necessary, bold step."},{"comment_id":"10152904940001636","commenter_b":"Death penalty. Make em think twice. We need to set an example out of these murderers.","commenter_a":"Charge the worthless parents. What was he doing alone in a public park with a pellet gun like that and no orange tip and a pistol none the less. Horrible parents","post_message":"A judge found probable cause for multiple charges against the officers involved in the killing of 12-year-old Tamir Rice."},{"comment_id":"10154136218409384","commenter_b":"She's just the best, go home to your expensive home and shut up...","commenter_a":"Everyone should see the damage that democrat loal gov't can do.","post_message":"It was my privilege to call to order House Democrats' hearing on the Flint Water Crisis. In an American city, thousands and thousands of children have been drinking and bathing in poisonous water for more than a year. It was not an unavoidable natural disaster. It is a man-made catastrophe. Now, thousands of children are at risk of lifelong damage from lead exposure – unless we help get them the care, attention and resources they need. We have a responsibility to help the people of Flint tell their story – and to be sure that story is heard loud and clear in the halls of Congress. The story of Flint challenges the conscience of America. It holds lessons and warnings for communities across the country."}]
