[{"comment_id":"908443172532257","commenter_b":"She should have NEVER been arrested to begin with !!!!! Anyone who would arrest an AMERICAN for carrying a firearm doesn't deserve to live in AMERICA !!!! PERIOD !!!!!","commenter_a":"Finally!!!","post_message":"Shaneen Allen, a Pennsylvania mother of two who didn’t know she was entering a “gotcha” zone when she drove across the New Jersey state line with a handgun in her purse, is clear of all charges following an 18-month legal ordeal in which a prosecutor had originally hoped to pursue harsh punishment as a caution to others. @webpagelink"},{"comment_id":"1589593461282497","commenter_b":"What a dork...........","commenter_a":"This guy is putting himself in the same catagory as Trump when he talks this way about anyone. He could have made his point without all the cursing.","post_message":"The very end is the best part.  Thanks to The Liberal Redneck. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1146551715438403","commenter_b":"@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.\""},{"comment_id":"1521164361521907","commenter_b":"11, MILLION illegal immigrants, @username. I won't write it out, you might have trouble counting the zeros. That would cost the US 4+ BILLION dollars, but hey- you might not realize how much money that is. Once the current illegals are removed from the work force, it would cost 1.4 TRILLION dollars and the likes of a recession no one in our lifetime has ever seen, but in the meantime, you rock on with your idiot self.","commenter_a":"Good fella for calling his royal Ass out on such ridiculousness.","post_message":"Kudos to the NBC reporter for calling Trump out to his face. Earlier today, Trump said he wouldn't rule out creating a national registry of Muslims, or giving them special IDs. That's NOT the American way. Spread his shame.  Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155169857528690","commenter_b":"Que triste, que bom que salvaram!! Quero adotar!!!","commenter_a":"Daniela","post_message":"91 dogs and 10 cats were rescued from a suspected puppy mill in Australia."},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"10153444075108132","commenter_b":"Pretty sure she's had surgery and botox.. or some serious airbrushing was done. Cripes everyone at 50 has a wrinkle.","commenter_a":"Thank you for picking someone normal and down to Earth without a bunch of surgery","post_message":"Sandra Bullock is PEOPLE's #MostBeautiful Woman! @webpagelink"}]
