[{"comment_id":"10154024040699497","commenter_b":"Stop being such a pussy!","commenter_a":"And people are just standing for this? I follow the Onion, and certainly didn't fall in line with Justice Scalia's opinions, but let me tell you this - this is a new standard of low. I could leave a brief comment, but this is so far beyond the usual pallor of any statement even a satirical form of journal should ever make, I find myself disgusted into making a statement. As human beings, we are all equal in death, but as Americans, we are something more. We are held to a certain equity of values that we inherit no matter where we fall on the narrow spectrum of political attitudes held in this country. And I am personally offended by the scrapping masses of groundlings hurling insults about a dead political figure before his family had even had a chance to attend the funeral. Shame on all of you. Good ...","post_message":"BREAKING:"},{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10154570112539497","commenter_b":"*grandma hands me a $10* \"Go get yourself a cup of coffee!\" \"Grandma, this is a $10...\" \"Then get yourself 3 cups of coffee!\"","commenter_a":"Jennifer Ann Winchester","post_message":" don tell your parentsthis is just between you and me. Good boy."},{"comment_id":"913542928735066","commenter_b":"President Barack Obama saved America while dealing with racism, hate and obstruction.... @webpagelink","commenter_a":"Look at his eyes. He's not just low energy. He's medicated.","post_message":"Ben Carson thinks being called out on homophobia is what's destroying America."},{"comment_id":"10153018136071130","commenter_b":"I think ikea is a great test to the relationship for sure. I've gone with many friends who argue with their SO the whole time, who later break up... Whereas me and my bf of almost 10 years have gone together many times and have a blast","commenter_a":"Jacob opppsss","post_message":"Attention couples: this store will make you want to kill each other."},{"comment_id":"747243702046419","commenter_b":"Women hate mothers. Go figure.","commenter_a":"@username same story but the comments...","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"967371493322599","commenter_b":"Yes yes definitely. I'm thinking a hot tire around the neck for the rhino poaches would be justice served.","commenter_a":"Maybe we need to do that to the Rhino poaches here in South Africa...","post_message":"Chinese villagers beat dog thieves for NINE hours and tie the dead animals' bodies around their necks"}]
