[{"comment_id":"977190145651659","commenter_b":"Hey ship them all to Canada they like the trouble makers. Attention Muslims get out of the USA we don't want you here!","commenter_a":"Private school or home school. It's worth the sacrifice.","post_message":"#IStandWithAhmed was trending on social media nationwide as people expressed their support for the teenager."},{"comment_id":"1003361709753187","commenter_b":"Coming from someone who puts stupid cartoons of her self on Facebook! Lol. Maybe Leslie could get a brain in the next one and give up on Hillary!","commenter_a":"When trump gets elected maybe this bug eyed freak will leave and take his high girlish voice with him","post_message":"*Shivers*"},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"10153765423589170","commenter_b":"@username you are spot on 100%. You don't allow a foreign entity into your country and let them have an area nor let them \"work it out\". Because that area gets a little bigger then a little bit more before soon they are running the country.","commenter_a":"Rahm assisted his Muslim brother Obama in degrading the police when they did do their job. Now the police are afraid to do their jobs.","post_message":"The irony here is that it's HIS ideology that has cops afraid to do their jobs.  His ilk spent the last eight years calling everyone racists.  Now he has the nerve to complain about the outcome?"},{"comment_id":"644296295760949","commenter_b":"I'll wipe my butt with everyone that comes my way","commenter_a":"Not even on a penny","post_message":"Obama is trying change our countries money.  He has absolutely no right to even consider this change.  Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"10153389153527169","commenter_b":"Don't despair. I have a niece named Gretchen. You are not alone! ;)","commenter_a":"Try being a Gretchen. I was literally the only one in my entire school all through k-12. I NEVER encounter tiny Gretchens but I'm only 31 so maybe there's still time?","post_message":"Is Your Name Going the Way of the Dodo Bird? (From OZY)"},{"comment_id":"10153688828342014","commenter_b":"Is this a female prison?","commenter_a":"Enact everyone who knows our job, calls us all corrupt, tells us we're poorly trained, and blames us for the inmate's behavior in 5, 4, 3, 2, 1...","post_message":"ATTACKED: A PCSO officer is going to be OK after being violently attacked by two inmates STORY: @webpagelink"}]
