[{"comment_id":"550293038455179","commenter_b":"Keep waiting! Americans are on to this BS! We gonna put a stop to millions flooding in here every year!","commenter_a":"Millions of hard working immigrants are still waiting on that promised immigration reform. Remember? November 20th 2014. Merry Christmas Obama and family.","post_message":"\"On behalf of Malia, Sasha, Bo, Sunny, Grandma, and everyone here at the White House, Merry Christmas.\" —President Obama  Watch the weekly address."},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"10153530669581955","commenter_b":"HahahahahagagagagagahahahahahagahahahahagahahahagahahahahahahahahahahahahahahahahahahHahahahahahahahahahahahahahahahahahahahahahaha. Fucking HA! The bitch was married FOUR FUCKING TIMES. Maybe..... Just... Maybe..... SHE'S the one fucking our morals over? Hmmmm maybe YOU are the one fucking our morals over? Hmm","commenter_a":"I admire you..I would have done the same thing if I were in YOUR position..they are destroying the morals of our society..","post_message":"JAILED FOR NOT MARRYING THE GAYS"},{"comment_id":"1128296473875405","commenter_b":"Hillary is a Crooked lying Killer, Put Her in Jail & Make America Safe Again!!!","commenter_a":"Quanell X, leader of the New Black Panther Party in Houston, Texas, said this week on a local news program that black Americans should examine Donald Trump outreach to the black community and the relationship that black voters have with the Democratic Party. @webpagelink","post_message":"What you need to know about the \"alt-right,\" and Donald J. Trump connections to white supremacy and hate groups: hrc.io/2c3kLXT"},{"comment_id":"10153951102966234","commenter_b":"She should had gotten revoke of gun license and probation","commenter_a":"@username u was jus talkin bout dis , she got 3 years","post_message":"Itiyanah Spruill pleaded guilty to child endangerment charges in connection with the death of her 4-year-old son."},{"comment_id":"10155089338768984","commenter_b":"AND WHY SHE NOT IN JAIL.","commenter_a":"Seat her in the last row.","post_message":"The Clintons' plan for President-elect Donald Trump's inauguration were just revealed, and it's leaving everyone speechless."},{"comment_id":"644948305695748","commenter_b":"She is still ugly","commenter_a":"I wish I could believe she would pay for this and Obama too","post_message":"Michelle was just caught red handed and is about to be charged with treason.  Good. It's about time she was exposed.  Do you agree Michelle Obama does not belong in the White House?"}]
