[{"comment_id":"1002745926520222","commenter_b":"HITLERY, MURDERS AMERICANS IN THE WOMB!!!!","commenter_a":"Stop Hate Dump Trump","post_message":"WATCH LIVE: Donald Trump speaks at his second campaign event, this time in Eau Claire, Wisconsin. Earlier in the day, he spoke to supporters in Valley Forge, Pennsylvania."},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: \"After the failure of 'After Earth,' a thing got broken in my mind...\""},{"comment_id":"10153355011548984","commenter_b":"That mayor is an idiot.","commenter_a":"So what would you call someone who would break out the windows of someone elses property or burn someone elses businesses or homes?","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"10155528648886729","commenter_b":"Let those people lose a day's wage and let those business' lose a day's earnings. Who cares. We should have no illegals working, instead the long term welfare kings and queens should be working to earn those welfare checks.","commenter_a":"I have a question. If all the Chavez supermarkets, which the Hispanic community supports by shopping there, closes for the day where will a mother go to get that gallon of milk she needs? Also, will the supermarket pay any employee that doesn't work today?","post_message":"Oops."},{"comment_id":"10153421158184726","commenter_b":"The Confederates nearly destroyed the United States!! They were slave owners and rouges! You lost the war now get over it and burn the damn flag!!!!","commenter_a":"The subject of slavery needs to be relegated to history books and musems right along with the battle flag of the Confederacy. I sick of hearing in about slavery, let's talk about dinosaurs -they don't exist either.!!!","post_message":"WATCH: Rand Paul: It's Time to Put the Confederate Flag in a Museum... Do you agree with Paul?"},{"comment_id":"1005304559506884","commenter_b":"@username wow dude! go tell that to china, india, russia...they pollute the air you breathe in an astronomically higher number , last i checked, the earth only has one atmosphere.","commenter_a":"God be with you and your team as you go forward for our great state of Kentucky.","post_message":"\"They bribe us with our own money to stick it to ourselves. And we will not do that anymore in the state of Kentucky.\""}]
