[{"comment_id":"683548041835774","commenter_b":"Let them go home!","commenter_a":"Don't like Halloween, keep your children & yourselves in the house with the lights off....","post_message":"Halloween has been banned in this state as not to 'offend Muslims'. This must be some kind of joke. They can't stop us from celebrating. Will you celebrate Halloween regardless?"},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"\"Today is beautiful,\" said Anna Kendrick."},{"comment_id":"10152715468475736","commenter_b":"Well, it would also be illegal to shoot undocumented immigrants.","commenter_a":"SHOOT ON SIGHT.","post_message":"The sea lions are making their way into town now! (Well one of them is.)"},{"comment_id":"10154282425457439","commenter_b":"Pussy's","commenter_a":"They are clueless","post_message":"The Armenian and Greek genocide by the Muslim Turks is reason enough not to build such a mosque. And what makes these knuckleheaded officials so sure that the imam won't teach and preach jihad. The jihadic doctrine is a critical component of Islam."},{"comment_id":"714422425388653","commenter_b":"Get out of this country!!! The USA was great until you damn Devils Muslims started to come here!!!","commenter_a":"I don't care. Take that shit off. What do you have to hide. You want to wear it , wear it at home.","post_message":"She filmed it.   WATCH the video very closely..."},{"comment_id":"10153355011548984","commenter_b":"That mayor is an idiot.","commenter_a":"So what would you call someone who would break out the windows of someone elses property or burn someone elses businesses or homes?","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"}]
