[{"comment_id":"1765509470395082","commenter_b":"This morning someone on ABC said Trump supporters don't take him seriously. Republicans never gave President Obama a chance. They blamed him for everything and they worked tirelessly to make him a one term president. If Trump wins America will be the laughing stock. Even the Russian government knows that. Donald a Trump blames everyone democrats for everything that is wrong but he has yet to say how he's going make America great again. Unless building a wall to keep out the illegals is how few intends to make America great again. I was team Bernie but since he didn't make the cut I have to go with the lesser of two evils. I can't vote for someone who fuels hate and bigotry.","commenter_a":"It's not up to this man to judge anyone soul. He is filled with hate against Mr Trump, he need look inside to his own darkness!!","post_message":"Khizr Khan, the father of a US soldier slain in Iraq in 2004, says Donald J. Trump has a \"black soul.\" @webpagelink"},{"comment_id":"10152788051453445","commenter_b":"Aussie bastard cannibas its called! Sydney university are offering $10,000 if any1 can find another plant!!","commenter_a":"@username Steven Bains","post_message":"WHAT?!? A new strain of #marijuana has been discovered!"},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming.  The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"10153664039221350","commenter_b":"Liz.....STFU!","commenter_a":"I am seriously sick of the name Caitlyn Jenner and anything with a Kardashian in it. How about reporting on something worthy or being considered interesting.. or a news story.","post_message":"\"I think about my life  and where I'm at in my life right now,\" Caitlyn Jenner told Matt Lauer. \"What a tremendous experience this is.\""},{"comment_id":"821592037937050","commenter_b":"And unfortunately it is another woman saying it. SMH","commenter_a":"Doesn't someone always say: \"Forget these women\"?","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\"  - Phylicia Rashad"},{"comment_id":"10155108703501320","commenter_b":"Take a good look at the non Christians. What ever you do this the least of theas you do to me","commenter_a":"No one, has the right to decide about the live of a anborn child. Every one has the right to live and be loved","post_message":"WATCH LIVE: We're at the The March for Life where thousands of anti-abortion activists are marching on Washington."},{"comment_id":"1204140369633795","commenter_b":"Did Queen Elizabeth die and they forgot to tell us about it? Holy hell had busted out all over England and some muslim dude is acting like the king! What's up England?","commenter_a":"Dear God, what will happen next? Aren't things crazy enough?","post_message":"Yes, this is real..."}]
