[{"comment_id":"10153912824075579","commenter_b":"This women reminds me of what I leave behind in the toilet!!!!! And It really stinks! FLUSH!","commenter_a":"Whatever her stylist is doing, keep doing it. Love that green leather jacket!","post_message":" had a pretty long day yesterday. Hillary Clinton addresses the DNC Women Leadership Forum.  Watch complete video from the event here: @webpagelink"},{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"},{"comment_id":"1044665095680389","commenter_b":"Women wouldn't exist without men we build your houses your roads your public offices we farm the food etc etc shut the duck up ungrateful twat your couldn't survive 2'days in the wild without a man to hunt or scavenge for you","commenter_a":"I love this. If a man posted a picture of a cup that said \"tears of women\" or some other bullshit these women would be up in arms. Ridiculous.","post_message":"so this I guess is a thing now???-mo  Shop.tacticalshit.com"},{"comment_id":"10154716215431800","commenter_b":"Better? Human Rights just went out the door the moment Trump was elected, something that America has practiced for decades and what the world envied us the most....Hypocrisy much?","commenter_a":"oh yeah, I heard President Duterte say Trump was just like him. Changing the world...but is it for the better?","post_message":"Donald Trump, fresh off Hair Force One, meets President Obama at the White House."},{"comment_id":"10153457478146770","commenter_b":"She can't stand herself either!","commenter_a":"Fright night with the Obamas","post_message":"We did NOT see this coming..."},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"1039059936190258","commenter_b":"That's not what Margaret said, and the fact that you think it was is a pretty clear indication of how little you understand about this and comparable situations, Pat.","commenter_a":"Answering for dead soldiers is abusive? If she can't handle this she's absolutely not fit for president.","post_message":"\"Republicans are squandering millions of taxpayer dollars on this abusive effort to derail Secretary Clinton's presidential campaign.\" - Rep. Elijah Cummings"}]
