[{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":""},{"comment_id":"10154209285520969","commenter_b":"Madeline why then, where we're your masses in Nov. Your just sad","commenter_a":"Patricia slice that is such a lame fucking saying","post_message":"WATCH LIVE: The Senate votes on the nomination of Jeff Sessions for Attorney General after Republicans voted to silence Elizabeth Warren."},{"comment_id":"1140838815950861","commenter_b":"@username now you're gay bashing but Muslims love male goats","commenter_a":"I bet Obama won't send anyone to her funeral...crickets. RIP Sister in Blue We have the watch from here.","post_message":"A Virginia officer who was on her first shift with the Prince William County Police Department was shot and killed Saturday and two other officers were wounded in a standoff stemming from a call about a domestic-related incident."},{"comment_id":"1112791138738235","commenter_b":"1 stupid bitch","commenter_a":"Unfortunately she is right more often than not.","post_message":""},{"comment_id":"452813904909190","commenter_b":"Why doesn't the women who complained go back to Africa? Why walk over our freedom of expression?","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"891951477509756","commenter_b":"Hang the jihadi cunt for spawning the 2 Hajis. She is just as guilty!","commenter_a":"Can you fit two in the gas chamber?","post_message":"The apple doesn't fall far from the tree."},{"comment_id":"10154427590982577","commenter_b":"Shes just a lil woman thang. Ughk. Hillary should be in prison.","commenter_a":"Isn't it funny how she plays dumb to this stuff too? On her 60 minute interview she said she had no knowledge of these emails even though it's all over the news. She plays dumb to every scandal and people still blindly follow this idiot","post_message":"Wikileaks Crashes The DNC   The Clinton campaign is pointing its crooked finger at the Russians as the culprits responsible for hacking the emails of the Democratic National Committee going all the way back to last summer. John Podesta, the chairman of the 2016 Hillary Presidential campaign claims Russian President Vladimir Putin is aiding Donald Trump’s campaign because there is as AP reports  “a kind of bromance going on”.  As if one more fabrication of reality could sway the narrative back to the Democrat's camp. And whether the Russians hacked the DNC emails or if it was the Romanian hacker claiming responsibility known as Guccifer 2.0 really doesn’t matter.  What matters is that now the American people know how riddled with deception the DNC truly is. The political machinery propping up Hillary's campaign is quickly coming apart at the moment she should be dominating. The released 19,252 wiki leaks internal emails that were hacked from seven officials at the DNC have served as a battering ram, exposing a organization laden with deceptive practices on a monumental scale.  Aside from the DNC's obvious favorability of Clinton over Sanders because of her gender and the jabs taken at Sanders religion. The emails detail a manipulation of the media of grotesque proportions. Relegating mainstream media to nothing less than a propaganda machine.  In this email the DNC’s National Press Secretary Mark Paustenbach says of a Politico reporter Ken Vogel “ Vogel gave me his story ahead of time/before it goes to his editors as long as I didn't share it. Let me know if you see anything that's missing and I'll push back.\""}]
