[{"comment_id":"449511958572680","commenter_b":"This lady is nothing but a liar...","commenter_a":"Muhammad ordered beheadings and other extreme violence as does the Quran today and all of Islam idolizes them as does Obama and Hillary!!","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."},{"comment_id":"10156410831030725","commenter_b":"U not Gona win ginger bread","commenter_a":"Letssss go !!!!!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"10153994527466509","commenter_b":"Cnn is getting paid big time to support him.","commenter_a":"@username, is Trump paying you to write about him, not an hour passes by without you guys writing about Trump. Looks likes he is the only one running for presidency, can't even remember last time I saw a story about Obama. Please give everyone a fair playing field.","post_message":"Donald J. Trump is going to make a decision \"very soon\" regarding a third-party run, he says. @webpagelink"},{"comment_id":"10153268798664170","commenter_b":"I'm sure asexuals all over are just shaking their heads and thinking the rest of the world is delusional in this quest for \"happiness\" which Hollywood and Madison Avenue thrive upon.","commenter_a":"Gay conversion therapy.... Sounds like a good way to convince gay youth to commit suicide. Let them be who they are. Perhaps we should have idiot religious zealot therapy","post_message":"I think families can make this decision for themselves, don't you?"}]
