[{"comment_id":"10154453619319030","commenter_b":"@username @username @username Kirsten Kolch Don't call her a bitch, but BUY YO BITCH SOME CHOCOLATE!!!","commenter_a":"Ching Lee Susan Ngo lmao so this is where I heard period sync","post_message":"Key & Peele is gonna teach you dudes something at Menstruation Orientation.  Watch the full episode: @webpagelink"},{"comment_id":"1017475884956418","commenter_b":"And bruce will NEVER be a woman!!","commenter_a":"How about this we let kids be kids and not put labels on everything until they're old enough to know what it means","post_message":"\"We believe all students deserve respect... regardless of their gender identity.\""},{"comment_id":"10153138744168487","commenter_b":"Criminals will find anything, they're criminals after all. If they could kill you with love they would do! More guns will never make any situation safer; regardless of the victim feels they would have been safer with a gun. Chances are a criminal will know how to use one and you won't. Guns should be outlawed on a whole not made readily available to whoever wants one.","commenter_a":"so does higher rates of car ownership.","post_message":"A reminder from 2014 that higher rates of gun availability correlate with higher rates of female homicide."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"1448117561874659","commenter_b":"They generally don't prohibit it but they train the employees to give the robbers the money because the owners have insurance for that.","commenter_a":"Looks like 30 people who should have been able to defend themselves and their businesses.","post_message":"A trio of armed teenagers is now accused of more than 30 robberies across King and Pierce counties."},{"comment_id":"10155745966725354","commenter_b":"She is a twatwaffle","commenter_a":"WIGGER WOMAN","post_message":"Instead of just admitting \"I'm really white,\" we get a bunch of jargon like \"the dialogue has unexpectedly shifted internationally to my personal identity in the context of defining race and ethnicity.\"  Check out the full woe-is-me open letter:"},{"comment_id":"10153802169701519","commenter_b":"Lol that's it. I'm mad women can do something. You got me. Get real","commenter_a":"No it isn't. Feminism is. Hey dummies you realize this whole free love shit means men win right? You don't want to make a man commit, so men sleep with you and then drop you when they want. They don't have to commit or treat you right because they can go find some other chick not interested in holding a man down, fuck her then leave again. Men win you idiots","post_message":"Literally."}]
