[{"comment_id":"893334250795530","commenter_b":"@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"},{"comment_id":"10154398939341523","commenter_b":"There are TONS of awesome, respectful, wonderful men; just as there are TONS of nasty, evil, sexual predator females.","commenter_a":"I would still like to know which of my rights are being violated.","post_message":"Milwaukee County Sheriff David Clarke reacts to the Women's March in Washington to protest Donald J. Trump's presidency -- calling it \"an absolutely freak show.\" @webpagelink"},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"10153980841689062","commenter_b":"Good glad yall didn't. One thing you can't replace is a life/lives. Hopefully everyone understands","commenter_a":"@username did u still go to Houston","post_message":"Hail is coming down with heavy rainfall off Beltway 8 and Antoine as heavy storms begin to move into the area. Stay safe out there!  Radars: @webpagelink Share your pics/videos: photos@khou.com."},{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"405246192933309","commenter_b":"To many people have nothing to do but bitch","commenter_a":"What is wrong with it, it could mean God bless or whatever God you pray to","post_message":"Should this religious phrase have been banned?"},{"comment_id":"1620932058215182","commenter_b":"Cse'Doobie Major bruh.. she can blink and ash that bih","commenter_a":"Brittlynn Jacob Ygnacio","post_message":""}]
