[{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"1077135272363972","commenter_b":"Stop the madness! Go home!!","commenter_a":"Ignorant people taking up the time of our officers who put their lives on the line everyday. Hope none of them have to call 911 one day.","post_message":"Hundreds of protesters marched through Buckhead, blocking part of Peachtree Road. Several people were arrested. @webpagelink"},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""},{"comment_id":"447163662137908","commenter_b":"Sinc you obviously are just a walk around, I'll ask you directly. HOW DOES LIMITING THE LAW ABIDING HELP ANYONE?","commenter_a":"You forget one little thing about this video. No matter what type of gun is used, gun laws only make the law abiding victims and give criminals an advantage.","post_message":"When the 2nd Amendment was written, the world did not have machine guns or assault rifles."},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"},{"comment_id":"1837033666540739","commenter_b":"Get a brain, lady!","commenter_a":"Obama may get another year!! If we get rid of the Trump and send him back to Russia!!","post_message":"<3 <3"},{"comment_id":"1108180832531570","commenter_b":"You need to get out more, specifically a museum.","commenter_a":"Ppl are quick to doubt things like this but believe whatever Fox News tells them. Meanwhile every civilization that recorded their history speak of giants. How can one make up or imagine Giants without being exposed to them or having seen them? Just like they wrote about hybrid races u think they made it up? Nope I think archaeologists (not all) but as a whole cover things up so they can keep getting funded. I don't by into dinosaurs, I think they are the hybrids ancient cultures speak about but hey if a man in a white lab coat says the grass is really blue a third of mankind would eventually start to see blue too. To each Is own tho","post_message":"A team of archaeologists have uncovered the skeletal remains of a giant in the Bulgarian city of Varna. Located on the eastern shores of the Black Sea, Varna is now a major tourist attraction. The area has a rich culture and its history goes all the way back to 5,000 BC. The oldest golden treasure in the world was found during excavations at the Varna Necropolis and carbon dating revealed it was buried more than 6,500 years ago. Thoughts?"}]
