[{"comment_id":"10152754691111051","commenter_b":"It's wonderful to know he has an optic nerve and so may one day be able to see!","commenter_a":"Why did they lie to her to start with !!!!!!!!","post_message":"This mom repeatedly asked why her new baby wasn’t opening his eyes. Doctors said his face was just a little swollen. Two weeks later, she found out the truth."},{"comment_id":"10154339068600399","commenter_b":"@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"\"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!\"  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."},{"comment_id":"10154927346797577","commenter_b":"Dose right here john make u wish u were born female","commenter_a":"Sweden should book these cunts two seats each for return home to goat fucksville, one for them n one seat beside them for their amputated cocks. U no im right so u lefties stay to the fucking left.","post_message":"5 Afghan refugees convicted of raping a young boy will not face deportation because their “homeland is too dangerous.”"},{"comment_id":"1138559072849036","commenter_b":"Are you still w trump ? Onilk Deleon","commenter_a":"If you really want to start sending these people a message. Start taking these videos and comments and send them to their employers.","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC.  #MicBrights"},{"comment_id":"10154960801467232","commenter_b":"@username what benefits do you offer","commenter_a":"They call it pennsyltucky for a reason. Outside of philadelphia its all trailerparks and farms.","post_message":"The Southern Poverty Law Center defines a hate group as an organization that has  or practices that attack or malign an entire class of people, typically for their immutable characteristics. @webpagelink"},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"10153044187631717","commenter_b":"No one wants to physically hurt her, we just want her to do her job. Such exaggeration!","commenter_a":"well they need too cuz this B*tch is Crazy!","post_message":""}]
