[{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"1028264733936445","commenter_b":"It's it funny how liberals say they can get guns from other place but amazing thing is that these people can't make it down to get a ID to vote. Guns we can get cross states lines a ID nope can't do it.","commenter_a":"Cant be. They have banned guns in Chicago. Every one of those murders had guns? Doubt it, cuz guns are Illegal. Hey murderers, stop breaking gun laws and start stabbing people the legal way! #Sarcasm","post_message":"2,326 people were shot in Chicago in 2015."},{"comment_id":"10155875428813009","commenter_b":"She cant even talk, another wacko","commenter_a":"Fake News! Liar!","post_message":"Nancy Pelosi was asked about Trump's Supreme Court nominee. Her answer left CNN's Jake Tapper speechless."},{"comment_id":"1304804312923886","commenter_b":"Your kids would be better off in a Orphanage than with you..","commenter_a":"Lock them up","post_message":"They blazing new trails."},{"comment_id":"10156482909420354","commenter_b":"Take your hijab and stick it where the sun does not shine.","commenter_a":"How about a \"dress American day\" for the Muslims? I thought not.","post_message":"Wear-a-Hijab-for-a-Day Events at Universities!"},{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."}]
