[{"comment_id":"10153239420904087","commenter_b":"WooHoo - I'm stupid as hell says Trumpette fool hoping to be wife #4.","commenter_a":"Woohooo! #Trump2016","post_message":"“I think Donald J. Trump changed the opinions of the African-American pastors that were in the room,” Pastor Darrell Scott told CBN News. “They saw a side of him outside of the media depiction, and that they would give strong consideration in regards to supporting his presidency.\""},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"689620071188876","commenter_b":"Then they should Cancel the game until they show some respect for the USA","commenter_a":"I'm done with the NFL!","post_message":"This whole NFL squad will join Kaepernick in protesting the National Anthem on Sunday."},{"comment_id":"10153560278573188","commenter_b":"Legitimate question, Glenn. I am a blood-bought, evangelical Protestant, holy-rolling Right-Winger. I am a Trump supporter. Trump is not a conservative as I am. And yet, he has said enough things that I agree with. And then his approach seals the deal. He is pro-life now and believes Planned Parenthood's recent atrocities warrant a government shutdown. Yes, he did say in the future he would consider looking into the \"good\" things that Planned Parenthood does for women's health. This tells me two things: he doesn't have a clue who or what Planned Parenthood really is now but would make sure he did before supporting their refunding and he's a business-minded man, who when put between a rock and a place he knows nothing about (PP), he's not going to burn his bridges- at least until he's sure about what he's talking about. Trump is spot on when it comes to ...","commenter_a":"No candidate is perfect. Trump comes as close that can be done. Support your new President. May God in 2016 replace Obama with a man that knows how to get things done and not one that takes years to figure it out. Trump 2016 may the Lord guide and strengthen you and give you wisdom to do your job. Peace be with you.","post_message":"I really want to understand."},{"comment_id":"927123483991626","commenter_b":"Oprah is a racist","commenter_a":"Yes !!","post_message":"Oprah threatens anyone who opposes Obama.  Get that liberal trash off of TV.  Do you think Oprah is the racist?"},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"1006130662760739","commenter_b":"And that White women take full advantage of affirmative action every day, it's not just for black people","commenter_a":"Does he ever need a history lesson. Start with \"When Affirmative Action Was White,\" and \"The Half Has Never Been Told,\" to start.","post_message":"The famous actress' brother brags about manipulating affirmative action policies to get into medical school."}]
