[{"comment_id":"1398317006928016","commenter_b":"I don't particularly like or support this woman for the position. But this is petty.","commenter_a":"Christian Heredia 😂","post_message":"Trump's Secretary of Education. Speechless."},{"comment_id":"10155008790239214","commenter_b":"@username please educate me as to exactly how NM receipt of federal dollars will be affected by the senator's boycott of the inauguration.","commenter_a":"Please don't join that ship of fools boycotting the inauguration. New Mexico needs those federal dollars.","post_message":"The president-elect is taking to twitter this weekend to harass a civil rights icon and the Director of National Intelligence. I think we can all agree that is not how Donald Trump should be spending his time."},{"comment_id":"445100202281687","commenter_b":"Hey here is an idea to the asshole who runs this page, stop defending these fucking criminals. Weed is ILLEGAL. Don't fucking run asshole. The fucking cop should have curb stomped him","commenter_a":"this police guy is a liar ,you deserved your termination,your insane....","post_message":"This is just disturbing. What a lame excuse this cop who has been reported multiple times in the past used for his violent behavior. Now he is defending his actions.   Do you think his violence is justified?  *Warning* GRAPHIC Video: @webpagelink"},{"comment_id":"10154210673661509","commenter_b":"Sean Small look up The Southern Poverty Law Center. Look at how many WHITE HATE GROUPS that exist. A lot of them have the word AMERICAN in their names. Some of them you probably don't even know they are considered HATE GROUPS. Only 2 black hate groups are listed and BLM is not one of them. The fact that you harp on on BLM just shows you are ignorant. Why don't you focus on the NUMEROUS WHITE HATE GROUPS??? Why don't you focus on getting rid of these people in white hate groups who continue to infect this country with a disease she doesn't seem to be able to cure \"RACISM\"?? Maybe if you and people like you concentrated on fixing your HATEFUL and RACIST THINKING then racism and discrimination wouldn't exist and the BLM would have no reason to be. I don't condone violence at ALL. Violence again police ...","commenter_a":"Strange that this makes news, but when the Black Supremacist from the BlackLivesMatter hate group sends out hits on cops... they are called freedom fighters and said to be striking out against oppression. They are either both evil or both good. You cannot have it both ways.","post_message":"Two Virginia men were arrested on accusations of being white supremacists plotting to bomb black churches and synagogues as part of a race and hate war, federal authorities said."},{"comment_id":"1415709005136234","commenter_b":"And that makes you a sissifed bitch punk your mom is more of a man","commenter_a":"Here is your first lady wanna be conservatives. #REPUBLICANFORSALE #NeverTrump.","post_message":"They REALLY think they have her here. But here’s the thing…"},{"comment_id":"1097693670320210","commenter_b":"Triple gross, have their hair all over my sheets, NO WAY!!!!","commenter_a":"Gross","post_message":"One New York couple has successfully acquired a bed large enough so that they and all 8 of their rescue pups can sleep comfortably. \"They love to just be near us. So however we can make that happen, they're happy.\""},{"comment_id":"10153768350172452","commenter_b":"It's not when you split lanes... it's when traffic is going about 30mph, motorcycles are going 60, and we in larger vehicles try to switch lanes. A small bike going twice our speed appears almost out of no where.","commenter_a":"We split lanes for one main reason: Safety! In a world with endless distractions, the rear ending of motorcyclist almost always ends up with a fatality.","post_message":"Gov. Jerry Brown has signed legislation that moves California toward condoning the practice of lane splitting, in which motorcyclists drive between two lanes of cars."}]
