[{"comment_id":"563771597144022","commenter_b":"Stfu","commenter_a":"Why the Attacks on Gary Johnson, are you Afriad he's going to take it, from crocked Hillary ? I like some of his Policies, his open boarder policy is why I am not voting for him. but A vote for him is a vote for Him, and you saying he doesn't know any Foreign leaders, this is the same guy who climbed Mt. Everest. and Kilimanjaro. You are trying to twist what he said, He said he can't think of any World Leaders he admires.","post_message":"Here's what happened when Libertarian presidential candidate Gary Johnson was asked if he knew the name of North Korea's dictator."},{"comment_id":"815444651917532","commenter_b":"Pathetic woman.","commenter_a":"I now understand why she has those dark bags under her eyes. She stays awake all night long thinking and writing down excuses she will have to use the following day to explain her ignorance and untruthful behavior.","post_message":"\"Well, I don't know,\" Clinton said. \"That's what they offered.\""},{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"1156907360996940","commenter_b":"That's a huge bitch!","commenter_a":"DAYUM!","post_message":"This is one of the largest black holes ever discovered. It is 7 BILLION times the mass of our sun."},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10153424148207016","commenter_b":"If she's been forced to left that means that's not what she wants to do I will never ever ever ever ever ever vote for that woman. I'm voting in this election because we have to get rid of Republicans and bought Democrats but I'm writing in Bernie Sanders","commenter_a":"After picking myself off the floor from laughing so hard, I have figured out that one way or another, Senator Sanders will be the real winner no matter what happens in this race. A change is coming in American politics, and even Hillary Clinton won't be able to stop it. Delay it, maybe, but the majority of the American people from all sides have had enough with business as usual at their expense and are mad as hell about it. Just look at the long lines at the polls and the huge turnouts at Bernie Sanders' rallies if there are any doubts - that is the beginning of the revolution which Sanders is talking about.","post_message":"Left enough already?"},{"comment_id":"1555862094712251","commenter_b":"@username your mom should be happy because I will leave the country","commenter_a":"@username and by the way why is he paying his staff 12$ an hour??","post_message":"\"If you're both screaming at each other, the viewers won't be able to hear either of you\": Bernie Sanders and Hillary Clinton trade back-and-forths on minimum wage.   Live updates from the #DemDebate: @webpagelink"}]
