[{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""},{"comment_id":"751484411652421","commenter_b":"It's designed to expand and contract no matter what the fuck it is you do. Stop acting like Waist Training is associated with organ ruptures because it isn't. No woman has ever died from using a waist trainer in our society because we have made vast improvements in it's design. You can't be like \"WELL WHEN YOU'RE PREGNANT YOUR BODY NATURALLY CONTORTS\" It contorts either way. The organ placement isn't even permanent when using a waist trainer it is almost the same exact process except rather than an expand you are placing the pressure in other areas making it look evenly distributed. The entire point is that nobody drinking, smoking or who is Obese (Yes we can tell when someone is obese) should be complaining and bitching at women who are using waist trainers periodically to go out, or to exercise about \"health\" without sounding like an absolute hypocrite. We ...","commenter_a":"So...insanely tight corsets are coming back into style? Didn't we learn anything from the history of these awful garments?","post_message":"Waist trainers are terrible for you, but the media keeps pushing them on women.   To learn more about the health risks associated with waist trainers, follow this link: attn.link/1T22tWr."},{"comment_id":"980529482041405","commenter_b":"She crazy bruh","commenter_a":"She is so confused 😂😳","post_message":"Watch: She has to be seen to be believed. Somebody take away her car keys!"},{"comment_id":"10152846459704205","commenter_b":"African wisdom here seems to be too verbose.","commenter_a":"Larry is a voice which needs amplifying as he speaks to our being qualified to run America's business of governing. His professorial countenance with assurance of our intelligence to grasp the duties and tasks for citizens of our land to undertake he does with the smoothness that is purely African wisdom.","post_message":""},{"comment_id":"10153100399077377","commenter_b":"We The People, continuously have said, \"Impeach Obummer Now!\" He has by far surpassed any former president with impeachable offenses, but not one congressman has started the process! Do we sit here yelling in vain? What are we waiting for? We all know he is not looking out for our best interest. And yet our congress wonders why Donald Trump is FIRST in All POLLS! Let's MAKE AMERICA GREAT AGAIN! VOTE FOR DONALD TRUMP","commenter_a":"They are always talking about working and being hard working. When someone tries, the republicans shut them down. Make up your freaking minds , republicans. Or is it you people to work at what you say, for the pay you say, when you say, without any remarks or compensation . That's called slavery. Republicans ended that years ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"1723943734489970","commenter_b":"Not only ridiculous, but stupid. What did Muslims have to do with the Holocaust? There far more people that are not offended by things that offend the Muslims. It is still our country, who make only one race happy all the time. Leave this alone and it may just prevent the horrible era from ever happening again. God please help us.","commenter_a":"WRONG!!!","post_message":"Schools Are Dropping The Holocaust From History Lessons To Avoid Offending Muslims. Things are getting ridiculous. Do you think this is wrong?"},{"comment_id":"1146022832118940","commenter_b":"How much did this investigation cost you???? Lying bitch.","commenter_a":"Hey liar, the FBI doesn't release information on investigations.","post_message":"Clinton is calling for the FBI to release more details on the investigation, saying \"the American people deserve to get the full and complete facts immediately.\" Agree or disagree?"}]
