[{"comment_id":"10153245276305950","commenter_b":"Right clown ass hoe bitch go die","commenter_a":"And we call these animals humans??! Disgusting how they are getting away with treating the people who put their lives on the line to defend them. We should allow them to continue to kill each other ... that would mean less barbaric, meaningless, animals taking up valuable oxygen","post_message":"WATCH: Some \"angry\" protesters clash with police in Chicago video of #LaquanMcDonald's shooting released @webpagelink"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":""},{"comment_id":"10154841543903984","commenter_b":"Go to prison Hillary! !","commenter_a":"This is proof this election is and will be rigged. There's absolutely no way Hillary is leading in the polls. She will win but by using massive voter fraud.","post_message":"Fox Business Network just took a serious swing at Hillary Clinton, and it definitely was NOT a miss. The network exposed on-air the one thing mainstream media would never show you, and Hillary does NOT want it seen."},{"comment_id":"10157765816045354","commenter_b":"Amanda, I have a question for you.At this moment in time, as we can not get a \"do over\" and the Republicans have a nominee what do YOU do? Do you \"vote your conscience\"? To what end? Don't mean to insult, but truly what do you do? Write in Cruz for President? IMO wasted vote..vote 3rd party? As neither Johnson or Stein don't have a snowball's chance in hell, they can't even get on the debate stage, wasted vote. Vote Hillary? Can't imagine that would be an option either. Any option that I have mentioned do one thing only..help Hillary Clinton. The results: 100k's refugees enter the country; amnesty for illegals who in turn get jobs, healthcare, not to mention open borders for additional immigrants to walk in through; the loading up of Federal courts and the Supreme Court with liberal judges who will destroy the very Constitution you and ...","commenter_a":"I have a better idea...Why don't YOU and the GOP along with Congress get on board with the true Liberty Loving Conservative Patriots? Yea, sure I have a lot of nerve, but then again so do you, jackass.","post_message":"\"Those people need to get on board.\""},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"1057942617592596","commenter_b":"@username go choke on some bacon goat humper","commenter_a":"Just so I'm clear, Hillary supports illegal aliens coming over here and doesn't support Donald J. Trump wall, but builds a wall to keep Americans out of the DNC? OK, that makes sense....","post_message":""},{"comment_id":"10152767856712426","commenter_b":"Hide yo kids hide yo wife","commenter_a":"Michelle Grider","post_message":"Startling!"}]
