[{"comment_id":"664826563698227","commenter_b":"She should have been in the nut house a long time ago! Along with most liberals crazies!","commenter_a":"What a brainless numb scull.","post_message":"If there was a prize for \"worst listener ever\", Nancy Pelosi would be the far-and-away winner."},{"comment_id":"10154244294358132","commenter_b":"I love me who do you love? Stop posting naked pictures of yourself you hoe!!!","commenter_a":"Omg! She doesnt know what to do to get attention!","post_message":"Kim Kardashian West is letting it all out."},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."},{"comment_id":"1753310708283376","commenter_b":"F all them towel heads and illegal immigrants. It's time to Trump all your dumb asses","commenter_a":"What did you expect of an ILLEGAL, MUSLIM, ALIEN who should be IMPEACHED AND TRIED FOR TREASON AGAINST THE USA! HOWEVER, the ELECTED OFFICIALS WILL DO \"NOTHING\" AGAINST THIS \"TERRORIST\"!","post_message":"Obama Admits He Is Embarrassed By Americans [VIDEO].  He is the worst president in the history of our country.  Do you think Obama is the embarrassment?"},{"comment_id":"1722289054713180","commenter_b":"notice how she talks about white man?","commenter_a":"@username Former foreign minister , has failed in its mission and has caused much of the confusion the US administration @username was not calling things by their names correct .. for example, terrorist organizations ( liberation movements ) , states that support extremism ( our friends ) , dictatorships ( our partners ) @username win means that a disaster occur American nation","post_message":"Women across the country lose out on every paycheck—and women of color feel it the most. Our families can’t wait: It’s time to ensure equal pay for women. hrc.io/EqualPayDay #EqualPayDay"},{"comment_id":"10155174752479916","commenter_b":"now suck it!","commenter_a":"Fuck that cop, fuck all cops","post_message":"Protests are ongoing in Anaheim today after an off-duty cop discharged his firearm in a crowd of young teens."},{"comment_id":"10155183488410725","commenter_b":"He's an idiot and so is she. Standing there looking at him talk his crap. It's ridiculous.","commenter_a":"He's a freaking moron","post_message":"Kanye West's rushing the stage at last night's Grammys wasn't a joke after all, it seems----> @webpagelink"}]
