[{"comment_id":"10153670710614255","commenter_b":"Nitwit with not very many followers - whew!","commenter_a":"Check the 14th Amendment Mike - you are dead wrong.","post_message":"Facepalm."},{"comment_id":"1740879046184782","commenter_b":"lock this crooked Bitch up.","commenter_a":"They are untouchable. We all know that by now. Waste of time reporting anything they do. Dems see them as heroes and the saviors of all...","post_message":"It's about time."},{"comment_id":"1655285394531583","commenter_b":"Salty tears are most delicious. Is it January yet??","commenter_a":"A BIG thank you to the 53% of American registered voters who chose NOT to vote; because of YOU and only YOU, Donald J. Trump will be our next POTUS.","post_message":"This is the real reason Barack Obama is going against Vladimir Putin, two weeks before he leaves. This is what the mainstream media won't tell you. Make sure every American knows the truth."},{"comment_id":"1053358344760417","commenter_b":"shut our borders to any and all refugees ! whats wrong with you ?","commenter_a":"I'm seeing some really terrified Americans making terrible accusations about Syrian refugees .. people who are fleeing from terrorism themselves. I'm finding your people somewhat heartless and they sound from my perspective to be violent and racist themselves... No different in fact than the terrorists that have become their perpetrators. This is what fear does to people.. Aggressive behaviour .. We are so much more than this. I felt so sad when I read the response to Obamas humanitarian speech. So sad that you people have such fear and hatred inside you. This attitude of hatred and intolerance against people you don't even know personally will never make a better world. It just perpetuates the same old story. I feel Sad. Very very sad today.","post_message":"\"Many of these refugees are the victims of terrorism themselves – that's what they're fleeing. Slamming the door in their faces would be a betrayal of our values.\"  - President Obama  Watch more here: @webpagelink"},{"comment_id":"529094357257035","commenter_b":"No, no I'm not.","commenter_a":"You are just another phoney.","post_message":""},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being \"one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"636085169915395","commenter_b":"Fuck her .Nan I can't wait for her and her worthless ass husband to get out of office.","commenter_a":"I think her and her fucktard of a husband both have lost their fucking minds we are in America people if u don't like it get the fuck out!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason.  She is a racist. This is complete madness.  Do you think Michelle Obama is out of her mind?"}]
