[{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"10152807177319753","commenter_b":"There's a lot that factors into our timely death. We can decide to die early. I.e. Suicide. And we can die cus of our own stupidity... Jumping off a building without a parachute. It can be because of health problems. But even with all these possibilities God is the one who truly decides when we go. That's why we have so many stories that are miracle stories. Ppl surviving when they shouldn't. And sometimes unfortunately we are taken so soon. The reason being that we are all here to serve a purpose on this world for God. And when we have done such... Then God brings us home. If you read her nieces comment she lived a fulfilling life. And what ever the reason may be she completed her life. Losing a loved one is hard. I have lost a dad, and seven friends and my own kid being 23. ...","commenter_a":"GOD MAKES NO MISTAKES. SHE DIED 7 DAYS LATER. THE NUMBER 7 MEANS COMPLETION. HER LIFE WAS FULFILLED. GOD MADE THIS DECISION. I SYMPATHIZE WITH THE FAMILY, HOWEVER GOD WILL MAKE SURE THOSE CHILDREN ARE LOVED THROUGH FAMILY AND ALL THAT LOVE HER. HER LEGACY CONTINUES THROUGH HER SONS.","post_message":"After 20 years of being unable to conceive naturally, the mother had spent a decade going through various fertility treatments in hopes of having children. After 30 long years, Lisa’s dream came true and she found out she was not only pregnant, but pregnant with twins. Unfortunately, the joy was short-lived, as she passed away just seven days after her babies’ births."},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"1084003008332003","commenter_b":"#VOTETRUMP AND BUILD THAT WALL!!!!","commenter_a":"Melania will have the last laugh. She is smarter and prettier than this idiot, not to mention more accomplished and wealthier.","post_message":"Unreal..."},{"comment_id":"10154326754201636","commenter_b":"Well I don't think she has that strength","commenter_a":"Can she slap Nigel Farage and Boris Johnson, and get away with it?","post_message":"The incredible powers you didn't know the Queen wields"},{"comment_id":"10152758056381051","commenter_b":"In her own bed? I would've picked something heavier than a shoe! Id burn the bed.","commenter_a":"He is scum her bed he needs to loose his penis cause hr is thinking with his small head","post_message":"When this wife got home and found her husband in bed with another woman, she decided to teach him a lesson."}]
