[{"comment_id":"10153816221001336","commenter_b":"It will be a great day for America when this guy is out of office!!!!","commenter_a":"Not so breaking news","post_message":"Breaking News: President Barack Obama has rejected the Keystone XL pipeline.    In a press conference a short time ago, he said, “If Congress was serious about wanting to create jobs, this was not the way to do it.”"},{"comment_id":"1137109363022484","commenter_b":"You bought that car 🚗 off your daughter you broke bitch. Lmao","commenter_a":"And they have reproduced. Smh, Plant potatoes you'll get potatoes.","post_message":"Smh... All while their child is present #WSHH"},{"comment_id":"946547988774787","commenter_b":"Theresa, get a job, I'm retired! Baaaaaaaa, sheep!","commenter_a":"I don't care what Stewart thinks; I'm not one of his unemployed sheep!","post_message":"\"I honestly have nothing other than just sadness, once again, that we have to peer into the abyss of the depraved violence that we do to each other, and the nexus of a just gaping racial wound that will not heal, yet we pretend doesn’t exist.”  -Jon Stewart"},{"comment_id":"10153239579440329","commenter_b":"Bitches be trippin'","commenter_a":"@username @username Cayla Ray hmmm I don't know anyone like this","post_message":"That One Co-worker who gets weird when people touch their stuff."},{"comment_id":"10156442483085231","commenter_b":"Bitter Brother Committee..... If he didn't want a kid he should've strapped up....but since he wanted a souvenir from Ciara the singer, but not from Ciara the woman, he has a fiscal responsibility to provide for his kid....that's so 1940 to say \"she trapped him\" because a man can alleviate all of that by condom, vasectomy or not \"bussing it wide open\".....if they're so worried about \"getting trapped\", they should do something about it...I mean since \"females\" are sooooo devious","commenter_a":"She stay eating off her dudes... First it was Missy, then bow, then 50, then future, then Russell, now future again... That snatch is a trap... Russell better tread carefully","post_message":"Loose lips causes lawsuits. Ciara isn't playing when it comes to protecting her name and son."},{"comment_id":"1672047073075950","commenter_b":"I hope this doesn't help Hillary. She needs to be indited & serve time.","commenter_a":"they are setting the stage to let hillary off with murder","post_message":"Breaking News: Defense Secretary Ash Carter has decided not to demote General David Petraeus. @webpagelink"},{"comment_id":"1081387115239718","commenter_b":"Ill stick with what my doctor reccommends","commenter_a":"so I should not take medicine and just live with acid reflex? I have been taking Nexium for many years.","post_message":"People who take certain popular medicines for heartburn, indigestion and acid reflux may want to proceed more cautiously."}]
