[{"comment_id":"785581448243402","commenter_b":"The people who are voting I know this is past but I can't vote for someone who can't keep our ambassadors safe and than with no feelings states what does it matter their dead well would she say that to if it was her family I as a lifetime dem. has changed my vote to rep. And if woman are smart trump hires woman, his wife's have their own jobs and buisnesses, and despite what Hilary says habout equal rights can woman want equal rights when you say men, have to clean up ,or need to be better looking, but if a man says it we can't take it what's good for the goose is good for the gander than we should be able to take it , rosie deserved what she got , and so did othe trump doesn't hate woman and to tell the truth hilarys open borders ...","commenter_a":"Funny that Hillary claims she wants to follow Obama steps after she has criticized him. Let's not forget this is the woman that as New York Senator voted for the Iraq War and in her own words she did it to thank you for George W bush help to New York during 911.","post_message":"\"She’s battle tested, she’s got a dirty uniform, and that’s who you want fighting for your kids’ future.\""},{"comment_id":"10153063364393188","commenter_b":"Idiot and hypocrite. So he says he was a solider.","commenter_a":"He's a traitor and needs to be deported immediately","post_message":"Really?"},{"comment_id":"1144750032228005","commenter_b":"Here we have someone taking things just a lil too seriously","commenter_a":"\"Discovered\" more like created...","post_message":"Pokemon are a diverse class of creatures that were first discovered by Japanese scientists Satoshi Tajiri and Ken Sugimori in 1996."},{"comment_id":"1350622528302641","commenter_b":"Lady you're an idiot","commenter_a":"Nobody cares","post_message":"Islamic leaders respond to OSU attack today."},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"},{"comment_id":"1283090895060069","commenter_b":"You don't know what you talking about a****** Hillary love douchebag","commenter_a":"Eric Reynolds","post_message":"Every Trump supporter should see this.   Video by Gavin Newsom. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156035361815354","commenter_b":"and its only the begining","commenter_a":"WHAY ELSE????","post_message":"An UNDERWATER tunnel."}]
