[{"comment_id":"10153444924104312","commenter_b":"Because it would cost pharmacutical companies lots of money if they didn't have cancer and other illnesses. Basically, all it is is reducing the amount of acid you put into your body from drinking soda, etc. They even make stuff you add to your water to alkalize it. Things like soda, obviously, and even milk although it is alkali in the container, once ingested it turns acidic and wreacks havoc on your body. Lemons, albeit acidic on the outside actually turn alkaline once ingested. You can actually look up guides to acidic and alkaline type foods. If you go to a Walgreens, health store, or wherever and pick up a roll of test strips in the health aisle, you go home, pee in a cup/container, dip the test strip in and look on the chart to see how much acid is in your body, then you take the steps necessary ...","commenter_a":"Want the cure? Eat right and use alkaline test strips until you test as alkaline as possible. Cancer feeds off the acid in the body, the more acidic you are, the better chance of the cancer spreading. If you are alkalized, cancer has nothing to feed on.","post_message":"A young woman has become the first person in the world to give birth to a healthy baby using ovarian tissue that was removed and frozen when she was still a child."},{"comment_id":"1701375029922619","commenter_b":"tough woman hiding behind a mask and hooded sweatshirt, hopes she wears that same outfit in prison","commenter_a":"Why are most democrats fat, stupid, and ugly","post_message":"Obama has allowed STUPID to take over this country...and it's putting American lives in danger!"},{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."},{"comment_id":"1169322949765857","commenter_b":"I understand that the left hates and has an unnatural desire to control everyone around them. It's just what they do; and it's the reason they should never be allowed to hold any position of power. To hate for no good reason is insane. Obviously none of the people here who hate Trump have no idea WHY they hate him except maybe that they were manipulated to do so. You don't have to like him; you're not hiring someone to be your friend (although that might be the only way you can get friends); you're hiring a POTUS so vote with honest logic. Not feelings.","commenter_a":"There's no denying the fact that he's more wealthy than even the elitists in Washington can hope to be; AND it's obvious that if you're that wealthy; the IRS has already seen your taxes so there's nothing hidden about his returns except just like yours; they're not PUBLIC knowledge. The only ones who want to make a big deal about them are the people who are scraping the bottom of the barrel trying to find something they can twist into a questionable issue that the most ignorant of voter will be swayed with.","post_message":"“There’s nothing to learn from them,” said Donald J. Trump."},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"1163431957079567","commenter_b":"Lord knows what kind of sinister crap Letterman is in to. Look at him.","commenter_a":"Letterman stopped being funny/relevant in 1994.","post_message":"When did David Letterman morph into Father Time?  Yeesh."},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."}]
