[{"comment_id":"10152631358675779","commenter_b":"He's hip pop. And of course they do numbers most ppl think the radio is all there Is to offer. And I'd say 3 ouuta 4 drake fans r girls. Drake can go hard but he chooses not to cuz that don't sell albums to women...so instead he's like \"long as my bitches love me\" lol","commenter_a":"It's funny how people who don't like hip-hop or don't like Drake's music post derogatory comments .If you don't like it don't post it,I think music like Young Thug(or when Gucci Mane was hot) & HALF of what I hear on the radio is trash lyrically but perfect for a party,but I don't sound off on it b/c the numbers that these songs/mixtapes/albums do,speak for themselves regardless of what we as neigh-sayers,b/c it's not our cup of tea,may say about it.Although I am biased to Drake's music,I love music period so why don't we all just take a lil advice from a19 year old(myself) & actually be grown about what we post instead of being ignorant cause honestly,8 times out of 10,nothing we say is taken into major consideration by the famous.In the words of Kevin Durant,\"Why do you tweet?\" lol...dang","post_message":"Is it an album? Is it a mixtape? Who cares? The 17 tracks Drake released at midnight last Thursday hit harder and hold together more cohesively than most big-budget event albums. Click through for our full review of ‘Too Late.'"},{"comment_id":"674485572723233","commenter_b":"she needs to sit down and shut up","commenter_a":"Talk about a nightmare! Handler, look in the mirror!","post_message":"Lefty comedienne Chelsea Handler goes on a racially charged rant against Trump.  Just imagine if a conservative said anything like this?"},{"comment_id":"10156213230310725","commenter_b":"Yes but most came here legally not sneaking across a boarder and none of us got free food free housing free health care or free college. You think all that is fair for us to pay the bills of someone illegally sneaking across our boarder or overstaying there visa. How many Americans have been murdered or robbed or raped by them? Far to many!","commenter_a":"Everyone are immigrants to US America .... Okay!!!!!!","post_message":"Notice that illegal immigrants will be given ObamaCare and free college tuition but nothing has been mentioned about our VETERANS #DemDebate"},{"comment_id":"896237380506542","commenter_b":"Guess what all you fools there are just as many women that talk a hell of a lot worst then Trump dreamed of all you holier-than-thou women out there quit acting like Polly pure bread get a grip. What's worse is that all that comes out of Killarrys mouth is diarrhea 💩💩💩😈😈😈😈","commenter_a":"If Hillary & Supporters are so butthurt over something Trump said 11 yrs ago, then why would Clinton accept endorsements from \"Rappers\" who had said FAR Worse things about Women then Donald said in Private 11 yrs ago? Some of the Vile things said by these Musicians is so demeaning to Women but yet Clinton doesn't reject their Support?? Nor does Her Supporters?? Calling the Kettle black!!! Copied","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\"  Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"10153820090941336","commenter_b":"Queers are perverted sickos...","commenter_a":"Don't be a pervert. Churches don't have to tolerate your Perversions","post_message":"\"It feels like they are extending an olive branch and hitting you with it,\" said Wendy Montgomery, who is Mormon and has a 17-year-old gay son. \"It's like this emotional whiplash.\""},{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"}]
