[{"comment_id":"1073442816041814","commenter_b":"We all get there no matter who you are 4 days coming it will be so funny she doesn't know what she's talking about but you have to look at it he's an ignorant liberal socialist!!!!!!!! When she gets old just let her die!!!!!!!!! She is stuck on stupid!!!!!!!","commenter_a":"You will be old idiot","post_message":"Totally nuts!"},{"comment_id":"10153517218270329","commenter_b":"Yes, we do want what we can't have. Love what you have (unless you hate your big boobs. Then know there are ways to help a girl out).","commenter_a":"Having big boobs is a nightmare. I would never ever ever want big boobs again EVER!!!! Ladies with small ones have no clue what it is like and should stop pretending like they have the same issues. It is patronizing to women that really do suffer. And men, shut it because your opinion is not important when it comes to living with the issues that come with big boobs. OK, so have a great day everyone :))","post_message":"Hey there, boob sweat."},{"comment_id":"1589013221321122","commenter_b":"Bring back War Crimes Donald! #MakeDonaldDrumpfAgain","commenter_a":"Mitt Romney was and still is a total lightweight! Time for a candidate who's the real deal! Time for Americans to play the TRUMP card!! Adios illegals!! #MakeAmericaGreatAgain #TrumpTrain","post_message":"WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153773404108984","commenter_b":"You Gotta Love America !!! :) I Do !!!","commenter_a":"Go Obama.","post_message":"The head of the National Sheriff's Association just threw down and issued a blunt threat to Barack Obama. This cop isn't going to take Obama's anti-cop attitude any longer, and now he's going to do something about it. This is awesome."},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."},{"comment_id":"10156419008515725","commenter_b":"#VoteTrump #TheDonald #ArrestObama #TrumpTrueAmerican #TheTrumpArmy #TrumpNow #MakeAmericaGreatAgain #TrumpFan #TrumpTrainSNL #TrumpForPresident #CompetentTrump #ItsGonnaBeYuge #NoRefugees #GetOnBoardTheTrumpTrain #BuildTheWall #TakeAmericaBack #Trump #OurVeteransMatter #WomenForTrump #TrumpNation #GeorgiaForTrump #CitizensForTrump #TrumpBreathOfFreshAir #MerryChristmasPresidentTrump #LoveTheDonaldsTone #BalancedBudget #TermLimitsForCongressAndSenators #GodBlessDonaldJTrump #GodBlessAmerica","commenter_a":"Americans are sick and tired of being on the back burner . We are the American people who work and should have a voice . We need a President whos gonna have our backs and Trump your it .","post_message":"People like what I say, people respect what I say. I started a discussion that needed to happen. #GOPDebate"},{"comment_id":"1066188120157365","commenter_b":"You don't know shit lady !","commenter_a":"Those of you that are saying \"cry me a river\" are the same ones who probably laughed along with Trump when he mocked that disabled reporter, but it's all good because you get what you give, karma doesn't forget about anyone","post_message":"Meryl Streep just called out Donald Trump for bullying at the Golden Globes."}]
