[{"comment_id":"10154169270413908","commenter_b":"Tony 'Osman' Andrews","commenter_a":"Ups, that was ,me...:)","post_message":"For those of you who are unaware of this observatory, it's captured some fascinating shots of unexplained aerial phenomena."},{"comment_id":"693348717485384","commenter_b":"Someone beat his ass.......again.","commenter_a":"A disgrace to the American oeople...Harry Reid you are way, way past your usefulness, so why don't you just go home","post_message":"SEN HARRY REID (D) UNLOADS ON THE SENATE FLOOR HATE SPEECH AGAINST TRUMP (VIDEO)  @webpagelink"},{"comment_id":"10153760611904087","commenter_b":"@username not as big of a liar as HilLiary!! She's the queen of lying, pandering and flip flopping! #WhichHillary","commenter_a":"Thank you VP Joe Biden for saying: \"I feel confident that Hillary Clinton will be the nominee and I feel confident she'll be the next president\". Coming from you that's awesome!!!","post_message":"“I feel confident that [Hillary Clinton] will be the nominee and I feel confident that she’ll be the next president,” said Vice President Joe Biden."},{"comment_id":"10153860953039614","commenter_b":"Total fool.......actually wore than Hitler. Hitler is dead. Trump is still with us. For now.","commenter_a":"Clown","post_message":"A heckler interrupted Donald J. Trump at a rally in South Carolina, as the billionaire presidential candidate called for a \"total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"  \"They have no respect for human life,\" Trump said, referring to \"people that believe only in Jihad.\"  He has previously called for surveillance against mosques and said he was open to establishing a database for all Muslims living in the U.S.  Read KTLA's story here: @webpagelink"},{"comment_id":"1104163209700456","commenter_b":"Is she as dumb as a rock or what ?","commenter_a":"Just take this ignorant ass in jail.... Trump!!!!!!!","post_message":"Even after being caught cheating in elections, check out Democrats' excuses."},{"comment_id":"10154248049506337","commenter_b":"Chevy only beats up womens self esteem which is better I guess. Do your research.","commenter_a":"Chevy is awesome leave him alone. Seagal is a little bitch that beats women. He's hardly even a celebrity. Chuck Norris should round house his ass.","post_message":"WHEN THE HOT SEAT GETS TOO HOT... From Chevy Chase to Steven Seagal, these celebs just couldn't handle getting roasted. Check out 'Comedy Knockout' on truTV. @webpagelink #ad"},{"comment_id":"10153429629189087","commenter_b":"Deport all illegals","commenter_a":"California...the Land of fruits and nuts...and illegals...and terrorists","post_message":"\"America is great. Trump is disgusting. Anybody but Trump,\" read words dotted across the sky above the annual Rose Parade in California on Friday."}]
