[{"comment_id":"535259990005462","commenter_b":"I wish Dr Carson was our nominee! However, Trump is and he must win or our nation is doomed. Clinton has proven to be the most corrupted, evil lying politician ever!! It's beyond me that anyone in their right mind could support her!","commenter_a":"How can you defend this man?","post_message":"It's a shame that The New York Times and the media are on an all out witch hunt against Donald J. Trump. The media should be fair and balanced, not biased."},{"comment_id":"10153459562633445","commenter_b":"No jail time and no probation for less than ounce....Wasted time n court's and jail space.....GET REAL GO FOR CARRIER CRIMINALS ,AND MURDERS ,LOCK THEM UP NOT A POT SMOKERS GETTING BELIEF N PAIN MANAGEMENT ,NO PILLS ,DAAAAAAA","commenter_a":"www.premierepotpourri.com","post_message":"#Pot Matters: Marijuana, the Courts and Probation"},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"\"Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?\""},{"comment_id":"10154242646146336","commenter_b":"Lots of ladies in Texas have CHL (concealed handgun license) enter at your own risk!","commenter_a":"Caitlyn Jenner is harmless. But lots of creeps out there will go into the women's room to do things other than pee. It's only a matter of time before we hear the horror stories. Be careful ladies.","post_message":"Donald J. Trump said this morning that he does not agree with North Carolina passing a law on bathroom use by transgender people.  He added that if Caitlyn Jenner visited Trump Tower she could use whichever bathroom she prefers. @webpagelink"},{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"1215709481782562","commenter_b":"Women's bathrooms are disgusting. Humans are disgusting.","commenter_a":"Seriously, why do women or trans, want to share the bathroom with the male species. The mens washroom is disgusting and I hate going into them myself. Please end this, men for men, women for women.","post_message":"Spotted at the Canadian National Exhibition in Toronto...   (Photo: Joshua Ostroff/HuffPost Canada)"},{"comment_id":"10153505158314877","commenter_b":"Racist POS!","commenter_a":"Stupid POS.","post_message":"Sam's Club CEO Blasted as 'Racist'...Because She Believes in Diversity. Watch how the backlash started below.  Grio fam, here's our message for Rosalind: Keep up the good work. What's your reaction?"}]
