[{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"},{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"\"[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,\" said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."},{"comment_id":"10153541248725950","commenter_b":"Rape and borders. @webpagelink","commenter_a":"If it had been for Berniestan or Queen Hillary, then nobody would have noticed it and @username would not have written any articles on it.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10158382623765093","commenter_b":"It would be illegal to play it. It is national Security. and Illegal.","commenter_a":"Flynn talking about sanctions people what more important a Russia helping to stop ISIS around the world and stop aggression or keep Obama sanctions on them and never accomplish anything .Only reason Obama put sanctions on them while leaving was to stop Trump from making deals with the to help stop ISIS","post_message":"\"It seems inconceivable that Flynn did not consider the likelihood, the virtual certainty, that he was calling a wiretapped line.\" -- Andrew C. McCarthy"},{"comment_id":"661665720654565","commenter_b":"NOT NO BUT HELL NO!!! SEND THEM BACK WHERE THEY CAME FROM!!! ANOTHER PLANET!!!!","commenter_a":"No.","post_message":"The Obamas are celebrating 24 years of marriage today. Are you proud to have them in the White House?"}]
