[{"comment_id":"10154834976184885","commenter_b":"Laws change and some should including this one. At one time I could own a person and woman couldnt even vote 100 years ago. This flag represents the ultimate sacrifice made by millions of Americans including my family. I can guarantee that if I see it I will gladly go to prison to make sure they will never be able to burn another flag.","commenter_a":"It's OK to not pay your taxes, just don't burn the flag.","post_message":"The Supreme Court ruled in 1969 that burning the flag was protected by the First Amendment"},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"},{"comment_id":"1172312176140350","commenter_b":"BUILD THAT WALL!!!! BUILD THAT WALL!!!!","commenter_a":"Lol","post_message":"EXACTLY!"},{"comment_id":"10153139193807377","commenter_b":"It's very hard to forget that he was voted in not only by the majority but by illegal aliens and dead people. Yes that's true, and just because he was voted in doesn't mean that there are more people who want him out of office. He is not a leader, he doesn't know foreign policies . Isis is his fault! He removed all our military from Afghanistan and the other countries. Had we stayed they would not be where they are today! Hellery Will follow obuma in his running this country, and if You think he is Bad you Haven't seen anything yet. Her lies and deceit hopefully will Take her out for Good. Do you know that more than likely he will Go down in history as one of the worse presidents in our country so you might rethink that statement.","commenter_a":"Why can't you impeach him? If the majority agrees that he needs to be impeached, so what are you waiting for?","post_message":"The top Republican lawmaker joined half of US state governors in urging President Barack Obama to suspend the scheme. Do you support Speaker Ryan's efforts on this? Vote Here: @webpagelink"},{"comment_id":"872957136089257","commenter_b":"lol bitch...u aint smart","commenter_a":"Harashi Dang u get this pic? Lol","post_message":"Classic. ~Will  More photos at Afghanistan Combat Footage - Funker530"},{"comment_id":"641480782679805","commenter_b":"She bad as fk though!!!","commenter_a":"@username wwyd? 😂😂😂","post_message":"What would you do???  #WSHH"},{"comment_id":"10153241305633984","commenter_b":"Stupid bitch ,,,,,","commenter_a":"Shes fucking retardes","post_message":"Wow. She is NOT doing herself any favors...  Are her critics right to be outraged?"}]
