[{"comment_id":"10153285740536336","commenter_b":"Gays can't create life? Hmm. I guess lesbians can't get pregnant or gay men can't inseminate a surrogate either. Anyone can create a life. But can they nuture a life? Plenty of gay parents out there do, while a shitload of straight parents don't.","commenter_a":"Sickening, YES! Just more proof of the changing times and how people deviated from their upbringing b/c they want to do what they want; not what is right...no respect for self or others....DISEASE!!!","post_message":"BREAKING NEWS: Ireland votes to legalize gay marriage. The traditionally Catholic nation saw 62.1 percent of Irish voters vote “yes” on gay marriage referendum in what is seen as a landslide victory for gay-rights advocates."},{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"10154019133956045","commenter_b":"Ronald Collier","commenter_a":"They could have let this woman get a ride home,,, or even took her home.. she wasn't on the road at the time.. where is the love in this world? I bet she was writing an unbiased story about the council meeting discussions..","post_message":"A Franklin County teacher has been arrested while working at a second job."},{"comment_id":"1248101021932790","commenter_b":"ALL CiTIZENS in this country have ID, ALL of them. so STFU about ID laws, only the corrupt want them","commenter_a":"Only clueless and the corrupt don't want voter id laws, REAL citizens WANT them as they stop the DEAD, non citizens and people voting multiple times. All of which are the exclusive territory of the left and the Dems.","post_message":"Dem Strategist Blames Hillary's Wisconsin Loss on Voter ID Laws [VIDEO]"},{"comment_id":"718460845008873","commenter_b":"never happen... if they couldn't massage their egos with those little golden idols... their would dry up and blow away.... or perhaps blow each other (y)","commenter_a":"Oscar - a trophy given by actors to actors for being actors. Like it makes the world a better place - NOT.","post_message":"Hollywood SCUMBAGS Might CANCEL the Oscars to Protest Trump"},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"},{"comment_id":"10153401880031336","commenter_b":"Way to show tolerance","commenter_a":"pft just toss it in the garbage with all the other religious hog wash biblical nonsense!","post_message":"Police have recovered a relic believed by some to be the Holy Grail – the cup Christ drank from at the Last Supper."}]
