[{"comment_id":"10153304280001051","commenter_b":"She is a fence jumper!!!","commenter_a":"I approve he's the best President we ever had I love America !!!","post_message":"Simple question: Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."},{"comment_id":"827935373908552","commenter_b":"A straight shooter, she would do this country good","commenter_a":"Barack Obama is NOT furious about anything Sarah Palin does or says; he is the President of the United States, and she is a moron.","post_message":"Sarah Palin lays into Obama for this reckless call!  Do you agree with her?"},{"comment_id":"1765372970348268","commenter_b":"No she is a lier","commenter_a":"Feel free, one and all, to hit me in the head with something hard and heavy if you ever get wind of me agreeing with Hillary on anything.","post_message":"Hillary Clinton rebukes Senate Republicans for refusing to hold a hearing on U.S. Supreme Court nominee Merrick Garland, calling it \"low-minded politics\". Do you agree or disagree with her?"},{"comment_id":"10153785163219411","commenter_b":"wastemans all just talks.now putin has to deal with it 😂","commenter_a":"Taliban, Isis, Hamas, Al-Qaeda, Boko Haram, Hezbollah, Al Shabab. All products of the religion of peace.","post_message":""},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":""},{"comment_id":"10153182951850950","commenter_b":"Oh, just stop with the outrage already. African countries sell these permits for more than the price of the average house in the USA, and only allow hunters to take the old males that have already reproduced. The people in the communities get the meat, sometimes by the ton.","commenter_a":"Sad. Money wins","post_message":"Though Zimbabwe's national parks authority said the shooting of a massive African elephant was legal, some conservationists said it's unethical."}]
