[{"comment_id":"10152606580602434","commenter_b":"The \"greedy bitch\" is a man.","commenter_a":"Getting married doesn't automatically entitle you to gifts or money, your guests will give what they can, if they can but surely their attendance is more important than receiving things from them? This is the most jacked up article I've read in a long time, far too much misdirected vitriol. Hope this greedy bitch gets nothing! Equating the whole situation of gift/money giving to 'living in sin' is so ridiculous and the amount of times people are directly cursed out is excessive. If you wanted to express your opinion so badly, you should have learned how to write first. Bridezilla!","post_message":"These people often fall in the same group as elitist jerks who think getting a dress from David's Bridal is \"tacky.\""},{"comment_id":"10153506495063855","commenter_b":"Stay outta Kohls then Asshole...","commenter_a":"OMG. Is kohls run by the lesbiens now? My wife told me the womens shoe section is full of work and combat boots nowadays.","post_message":"ICYMI: Kohl's melts our hearts."},{"comment_id":"1244894375530590","commenter_b":"all the illegals are not accounted for, so this is false!!!","commenter_a":"Hope it's true","post_message":"There was one big reason for leaving."},{"comment_id":"1146551715438403","commenter_b":"@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.\""},{"comment_id":"10154342648916509","commenter_b":"Shut up","commenter_a":"The decision to continue with fireworks in spite of huge fire at hotel nearby shows the sadist attitude of Arub nation.","post_message":"#NewYearsEve fireworks display continues in #Dubai as nearby hotel is engulfed in flames @webpagelink"},{"comment_id":"985301294841116","commenter_b":"@username woman you dip.","commenter_a":"Can’t we call Ted Cruz by his real name Rafael Eduardo Cruz? He never misses a chance to call the President “Barrack Hussein Obama“. including his middle name to make sure we all know he’s a “Muslim“….and good old “Ted” was born in the united states of CANADA!","post_message":"Do you agree with the ruling?"},{"comment_id":"10157293666220725","commenter_b":"Did you hear what Hillary said? She intends to talk to \"the white people\". She makes me sick!","commenter_a":"we need trump for president in 2016 go trump","post_message":"I am the Law and Order candidate!"}]
