[{"comment_id":"1510912668928758","commenter_b":"The choice is simple one's a white supremacist with thousands of racist supporters.....and the other is a woman that rubs you the wrong way","commenter_a":"What a surprise","post_message":"The endorsement will run in Sunday's edition of The Times — a day before Hillary Clinton and Donald J. Trump go head-to-head in the first presidential debate."},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"967087283327615","commenter_b":"Yes you scared little woman","commenter_a":"This muslim kid brings a suitcase filled with wires and people are being mocked for over reacting?","post_message":"Standing tall after an outrageous arrest."},{"comment_id":"10153370779851094","commenter_b":"The key attraction is hate and greed from the 1%ers and the few others who will complain we made a mistake were on rationing due to war in Syria Making America Great the trump way hahahah!","commenter_a":"People love to be dominated and abused.","post_message":"Is Donald Trump's candidacy a short-term spectacle or a national nightmare in the making? Mark Karlin discusses the dangers of writing off the billionaire's current electoral efforts."},{"comment_id":"10155050454914469","commenter_b":"White girl wasted","commenter_a":"I'm chocolate wasted","post_message":"BABY GIRAFFE WATCH: We are waiting for April to have her calf! Will it happen today? bit.ly/2l14Zin (Video via Animal Adventure Park)"},{"comment_id":"1196725563700232","commenter_b":"You left out the part where Trump plans on cutting taxes on the most wealthy as well., Then there are Trump plans for how trade with China and Mexico is going to be handled, yet even now all the products that bear Trumps name are being manufactured in China and Mexico. Perhaps to show he is working in good faith, don't you think he should have them manufactured here in the US? It is quite simple to say I'm going to do this I'm going to do that but it is far more difficult to actually do them. He might say it, if elected he might try and do it but I guarantee you he is not going to \"make\" the Mexicans pay for his wall, a wall that will actually do little to stop the flow of illegals. The gun he will hold to the Mexicans head to make ...","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, preserve the sanctity of the unborn life, preserve the sanctity of the 2nd amendment ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness","post_message":"Take a look at the companies that are partnering with this pro-amnesty open-borders group!   @webpagelink"},{"comment_id":"563277980487645","commenter_b":"What's the difference between Trumps wife's and illegal immigrants? Trumps wife's applied to become citizens through the legal process of American citizenship and now their AMERICANS. Women like u are uneducated.","commenter_a":"Look up the definition of legal immigrants and illegal immigrants... Idiots.","post_message":"Yes, Donald, have you made their travel arrangements yet?"}]
