[{"comment_id":"10154040095578701","commenter_b":"Build that wall","commenter_a":"Juan Wheeler","post_message":"Oregon State Police say a traffic stop on Highway 97 in Sherman County led to the seizure of $2.3 million worth of meth and cocaine."},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10156794589450231","commenter_b":"She looking like a dog tie her azz up","commenter_a":"Need her tubes snatched from her body...","post_message":"Pregnant mom arrested after 2 toddlers found tied up like dogs behind home."},{"comment_id":"1726142824304062","commenter_b":"These are \"outrageous\"? Come on! Blacks, African-American, People of Color, or whatever is the nonoffensive way they are referred to these days, often get a pass for calling each other the \"N-word\". What the hell is going on here! Odd double standard. Remember \"Colored People\", bad!!!, \"People of Color\", GOOD!!! Wow, what crap!!!","commenter_a":"She thought she had a friend","post_message":"Fox News chief allegedly referred to Stacey Dash as ‘the black girl’, called another anchor an \"angry black woman\"  Grio fam, are you surprised by any of this? Check out the other outrageous things coming out in this new lawsuit!"},{"comment_id":"10153581421506336","commenter_b":"How do you go so wrong in life before you're even out of high school??","commenter_a":"But they look like law abiding professionals","post_message":"Four high school students have been arrested in the carjacking and kidnapping of a Texas border patrol agent who was vacationing with his family in Florida authorities said."},{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"\"ELECTED\" enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"}]
