[{"comment_id":"10150645509299999","commenter_b":"Apple should have made an iPhone 4C. Then all the women can just buy it. Problem solved.","commenter_a":"I visited China a couple of years ago and my guide, a 30 year old woman had written herself off already for ever finding love. She told me women in China look for the 4Cs: car, condo, credit, cash in a man. I laughed. But she wasn't joking...","post_message":"“Even though she’s a successful woman, she would come back home and be nothing in her mother’s eyes because she is a single woman.”"},{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"},{"comment_id":"10153131425722293","commenter_b":"They are our imagine of the \"freedom\" .","commenter_a":"Yes.","post_message":"Experts fear a whole slew of risks that may follow should these tribes come into full contact with the outside world."},{"comment_id":"496097670580813","commenter_b":"better yet, remove them from the planet","commenter_a":"Damn muslims.","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…\" -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."}]
