[{"comment_id":"10154773205966037","commenter_b":"Hillary is the liar and murderer deserves to be in prison right now!","commenter_a":"SHUT UP TRUMP","post_message":"WATCH LIVE: Donald J. Trump holds a rally following last night's debate and says he will totally accept results \"if I win.\""},{"comment_id":"10153079641390950","commenter_b":"Bitch, fuck you and the white man!","commenter_a":"Jorge Ramos can kiss my hispanic behind! Go back to Univision y callate la boca! Legal hispanics are tired of paying for ANY illegals from ALL COUNTRIES (not only Spanish speaking) with our hard earned tax dollars!","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"10153576413974087","commenter_b":"She is a joke","commenter_a":"Says someone who championed NAFTA and called the TPP the gold standard of trade agreements. #whichhillary","post_message":"“Hillary says you walk out on America, you pay an exit tax. And if you got tax dollars or a tax deal, you’ve got to give the money back. She’s with us,” the Hillary Clinton ad says. WATCH:"},{"comment_id":"10153184111444877","commenter_b":"these now women were looking for an easy ride to stardom so was their mothers who allowed them to be around a grown man in some hotel.","commenter_a":"I think she's screwed up!! I can understand her need to defend black folks but this guy??,","post_message":"Whoopi Goldberg defends Bill Cosby: 'He has not been proven a rapist.' Watch what else Whoopi had to say below.   Grio fam, what do you think of Whoopi's comments?"},{"comment_id":"10153260664437885","commenter_b":"Phuck that man cunt.","commenter_a":"I thought traitorous dogs got shot!","post_message":"Not a DuffelBlog....this is real"},{"comment_id":"10153728622221336","commenter_b":"Women do have their own football league, Jake...","commenter_a":"A lot of sexist men just cried.","post_message":"The Oakland Athletics have hired Justine Siegal, MLB's first female coach.  Siegal is also the founder of Baseball For All, a nonprofit organization that provides meaningful instruction and opportunity in baseball, especially for girls. @webpagelink"},{"comment_id":"10153018811005927","commenter_b":"@webpagelink #dontbesilent this woman can NOT be the President of our country","commenter_a":"Wrong wrong wrong, what has happened to the USA and right and wrong?","post_message":"How did the media miss this?"}]
