[{"comment_id":"10153170103931770","commenter_b":"She's improved at lying ! And she makes Barb not feel like such a hag.","commenter_a":"Crap","post_message":"Barbra Streisand said she thinks Hillary Clinton's campaign strategies have improved a lot over the last few months."},{"comment_id":"10152849572156336","commenter_b":"Democrats have lost their minds .Send all illegals home.","commenter_a":"Ridiculous!","post_message":"Not only can illegal immigrants now pay in-state college tuition in at least 20 states, student activists and graduates of Smith College are actually raising money for a scholarship for undocumented students."},{"comment_id":"1533770763589743","commenter_b":"Stupid!!!","commenter_a":"Idiots. I don't watch or care about that crap.","post_message":"Tonight at the Oscars, celebrities will be wearing gun control bracelets (paid for by the anti-gun group Brady Campaign), while being surrounded by massive amounts of armed security. Think any of them will note the irony?"},{"comment_id":"10157615901290389","commenter_b":"What about the arrests of all those that beat up and tried to burn people alive?????","commenter_a":"The reporters should have asked the protesters if they had a job etc.........","post_message":"Breaking News: A suspect has been arrested in the shooting death of a protester during rioting Wednesday, Charlotte's police chief says."},{"comment_id":"1357661384272094","commenter_b":"Good, go ahead and secede, build another wall.","commenter_a":"Who the hell cares?Let them go.","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump  Here's EXACTLY what would happen if they got their way!"},{"comment_id":"10153502951211336","commenter_b":"Anyone who votes for her does not have a brain!","commenter_a":"She will be the next president","post_message":""},{"comment_id":"10153266614821336","commenter_b":"California has been sicking for some time! One of the things liberals in CA like to do is drive companies out of the state! Also turn off the water to the small farmers, that put 40,000 farm works out of work! Keep building houses when they don't have the water to supply to them. Build a high speed rail road that no one wants or needs!","commenter_a":"Hard to find anything dumber than a California Democrat.","post_message":"Nobody's laughing, Rep. Loretta Sanchez."}]
