[{"comment_id":"10152846459704205","commenter_b":"African wisdom here seems to be too verbose.","commenter_a":"Larry is a voice which needs amplifying as he speaks to our being qualified to run America's business of governing. His professorial countenance with assurance of our intelligence to grasp the duties and tasks for citizens of our land to undertake he does with the smoothness that is purely African wisdom.","post_message":""},{"comment_id":"10153277275566336","commenter_b":"Thugs!!! This has got to stop!","commenter_a":"Breaks my heart!","post_message":"Omaha, Nebraska police officer Kerrie Orozco was killed in a shootout a day before she was scheduled to go on maternity leave."},{"comment_id":"1036956366325374","commenter_b":"Your mom is a joke.","commenter_a":"America the land of the free .. Your gun laws are a joke","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10154741316933812","commenter_b":"Hillary will be president","commenter_a":"Remember when Hillary Clinton said the 50,000 emails she kept from the State Department (in violation of the Federal Records Act) were about yoga and her daughter's wedding? How many of the most recent set of 14,900 emails ordered made public by a federal court are about yoga or her daughter's wedding? I'm thinking zero. But hey: pertinent falsehoods under oath aren't criminal when you're aspiring to become the First Woman President (TM).","post_message":"Meet Meatball: The adorable, friendly and rotund pit bull mix that can't help but flash his brightest smile as soon as he sees a camera. \"As soon as the camera turns on he just gets this huge grin on his face.\""},{"comment_id":"800175416791290","commenter_b":"shes disgusting!","commenter_a":"I don't know anyone personally that thinks Amy Schumer is funny . Her only following is a bunch of feminist that think her over the top vulgarity makes her equal to men but even most men aren't as perverted as her .she tries to hard and it just isn't funny or entertaining.","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"380130102360204","commenter_b":"And how much are we spending on the illegals and the refugees?? Probably a lot more than the wall and the homeless combined. Let's take care of Americans and America's needs FIRST!! After we take care of our Veterans, our homeless, our children and build the wall we can consider helping those that want to come here legally!! Resources should not be going to illegals until all Americans are taken care of.","commenter_a":"I can buy a candy bar for a dollar or give the dollar to a homeless person. Wait! I can do both!!!","post_message":"We could Build a Wall, or End Homelessness... I know which one I'd Choose, Do You?  Join Us: The Free Thought Project"}]
