[{"comment_id":"10153973841258598","commenter_b":"She is a liar , a cheat, a murderer, and a disgrace to womanhood!!!","commenter_a":"FIRST WOMAN MURDERER!!! If she would kill innocent little American babies, what would she do to the rest of us?? Don't vote gender, vote for a great leader, vote TRUMP!!!","post_message":"Pro-Life Women Leaders: “We Can’t Celebrate Pro-Abortion Hillary Clinton as First Woman President”"},{"comment_id":"366282870162354","commenter_b":"Shot in head","commenter_a":"Death","post_message":"89 Year Old WWII Veteran Beaten To Death By Thugs. This is tragic. Please send your prayers. What do you think their punishment should be?"},{"comment_id":"10153135013122217","commenter_b":"Hopefully, they're one of my favourite bands☺️","commenter_a":"Ahhhhhh how come???? I still don't have my ticket 😳😨😭😭😭","post_message":"Going...going...gone"},{"comment_id":"10153301098933067","commenter_b":"Both ladies were very graceful","commenter_a":"Mr. Trump, you are really out of your ulo..... it was an honest mistake and it was acknowledged so, just move on..... better luck next time Miss Colombia... congratulations to all the contestants and the winners........ jmtc","post_message":"\"I'll tell you what I think I'd do. I think I'd make 'em a co-winner. It'd be very cool\" - Donald J. Trump @webpagelink"},{"comment_id":"967606389917498","commenter_b":"YOU're gross.","commenter_a":"gross. why did you have to post a photo?","post_message":"The most sexist obituary you've ever seen"},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"},{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"}]
