[{"comment_id":"10152893024866051","commenter_b":"Yeah ? How bout someone take a cane to your goofy ass an lets see if it looks like paint..Oh no...lets not.... forgot your ass looks like a map from rand mcnally with all those ugly stretch marks....yuck","commenter_a":"That looks like paint, not blood.","post_message":"This man’s wife has been found guilty of domestic abuse against him. Even she wasn't expecting so much jail time."},{"comment_id":"10156716294680725","commenter_b":"Trump is a scum bag who steals from Veterans!!! @webpagelink","commenter_a":"Never liked Cruz and I thought Rubio seemed like a nice guy. Not anymore...give em hell @username, your the only man that can pull this off. You have had my vote from the beginning.","post_message":"THANK YOU #TrumpTrain! Lets make it a great day! Preparing now for rally at Macomb Community College- here in Michigan!"},{"comment_id":"653404108149099","commenter_b":"@username the wet behind your ears is showing. Now go wipe the turd stains off your teeth.....turd sucker","commenter_a":"My new hero!!!!!Trump is good on embracing bullying and hate!!! Those are the results!!! Trump should go to a nursing home already!!!!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"10153825599556770","commenter_b":"Crooked Hillary's campaign is doing what they do best, and that is to take the focus off of her current health problems and turn the attention on to what Mr. Trump said in 1996 about a pageant queen. What's even more troubling is that the media is in their back pockets, treating her like she just won the presidency, while slamming Mr. Trump! Sorry, but who was it again who had 33,000 emails wiped from her private server using BleachBit that can never, ever be recovered? Who was it again who had staffers destroy their Blackberry phones with hammers? Who was it again who blatantly lied to the FBI? Who was it again whose \"key witness\" staffers were given amnesty from testifying? Who was it again who called tens of millions of Americans deplorables? And, of course, the list goes on and on and on! Isn't it amazing how crooked ...","commenter_a":"This is coming from a man who paraded his mistress around the city and let his wife be the last one to know he was divorcing her...he has as much room to talk about Hillary and Bill as Trump does...","post_message":"Former New York City Mayor Rudy Giuliani has some harsh words for Hillary Clinton."},{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10153776592904087","commenter_b":"Socialists always promote Violence. In Europe They promote Muslim Violence by being WEAK!","commenter_a":"Bernie is an enabler for the lazy self entitled youth of this country.","post_message":"\"Party leaders in Nevada...claim that the Sanders campaign has a ‘penchant for violence.' That is nonsense,\" Bernie Sanders said in a statement. \"Our campaign has held giant rallies all across this country, including in high-crime areas, and there have been zero reports of violence.\""}]
