[{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana  @webpagelink #HighProfits"},{"comment_id":"10155230776483690","commenter_b":"Hahaha we cn kill u indian pigs","commenter_a":"They can kill only innocents, not terrorists. Pigs.","post_message":"In less than 24 hours after Pakistan's deadliest attack in more than two years, the army kills more than 100 \"terrorists\"."},{"comment_id":"10153667597986770","commenter_b":"She belongs in prison!","commenter_a":"Prison","post_message":"Hillary Clinton thinks she should be president. But does she really belong in prison? @webpagelink"},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"985399901519758","commenter_b":"Stupid cow what did she expect","commenter_a":"Really?","post_message":"'I thought he was The One'"},{"comment_id":"10150864251334999","commenter_b":"He will blame the baby","commenter_a":"He will either win, or drop out so he can always claim he would have won otherwise. If he does stay till then end, and doesn't win, the reaction will look like this: 1. Demand a recount 2. Blame it on voters who didn't want to make America great again. 3. Complain that the GOP is at fault for not supporting him enough. 4. Blame his VP. 5. Demand to see Hillary's birth certificate","post_message":"The latest guessing game is whether Donald J. Trump will drop out of the presidential race before Election Day."}]
