[{"comment_id":"10152608656372894","commenter_b":"Women also cheat with their hearts minds and bodies too soooooooo","commenter_a":"The pic of him with the female outside the car looks like he was taking a pic with someone ... Ppl have cousins sisters groupies fans and friends that they don't sex !!!all these bitter broken hearted ppl jumping the gun obviously wasn't nothing serious he joking about it on Twitter .... Buuuuuut carry on","post_message":"Was Nick Young Caught Creepin' on Iggy Azalea in the Car SHE Bought Him for Christmas? [Photos]"},{"comment_id":"10153771560244060","commenter_b":"in America, a black male is sixty times more likely to be imprisoned (In the US) than a Chinese citizen in China. So China, in my estimation, has a long way to go with their threats before they infringe on the liberties of their population to the degree to which \"we\" have ours.","commenter_a":"How does a person spread a rumour? It's nonsense. Rumours are spread by masses, not individuals. I suppose the whole country is a prison anyway.","post_message":"Chinese whispers: \"spreading rumours\" online is now punishable by seven years in prison"},{"comment_id":"959009797494471","commenter_b":"Any politician that don't one our soldiers to be armed there traitor to our country","commenter_a":"I can see maybe arming an NCO or someone at a recruiting station as a deterrent against the crazies out there.","post_message":"NO CHANGE IN POLICY: Army chief urges caution on calls to arm more US soldiers in wake of fatal shooting (VIDEO)  @webpagelink"},{"comment_id":"1050271788402406","commenter_b":"My father is vet and is against privatizing !!!","commenter_a":"Privatizing is what the vets want. Who knows more about it than the vets!","post_message":"\"We cannot – and I will not – put our vets at the mercy of private insurance companies without any care coordination or leave them to fend for themselves with healthcare providers who have no expertise in the unique challenges that are facing our veterans.\"   --Hillary Clinton"},{"comment_id":"753223974794383","commenter_b":"I am 70 years old but I still would have tried to kick that POS ass","commenter_a":"I'd love to knock his teeth out.","post_message":"Unreal. Would you intervene if it happened in front of you? Thoughts? @webpagelink"},{"comment_id":"1017654374977457","commenter_b":"But if you don't punish them and just deport them, they will be back in a matter of days ! Secure the borders and then release them all back to mexico !","commenter_a":"Depends, they should first pay the consequences for their criminal behavior and then be immediately deported. Maybe the consequences should include the death penalty, financial remuneration, work to give back to the community, such as the CCC did under FDR and the DNC.","post_message":"Donald Trump and Ann Coulter think that immigrants that commit crimes should be deported right after being convicted. What do you think?  Vote in the poll and have your voice heard!"},{"comment_id":"10153105510381336","commenter_b":"I elected Obama twice. You wingnuts act like Hillary did some sinister dastardly deed that caused 4 people to die at Benghazi.Not true..The US lies and spies and tortures and misleads as a matter of policy.J ust like Bush Rumsfeld and Cheney did. I will never vote for a conservative. Politic is a tough business. acvtually governing is something the GOP has forgotten about.","commenter_a":"What truly amazes me is that State Communications Security let her first use a personal e-mail for government business and second they let her keep an unsecured server at her home. This is a complete violation of all government communications security regulations and practices. There is no way possible that she did not send classified e-mails during her entire tenure as Secretary of State and there is no way possible that they can say that unsecured server was not hacked by outside sources. What kind of a moron would think that? The idiots that are defending this woman are absolutely CLUELESS as to the magnitude that this Security Breach is. People go to jail and/or get fired for much less than this. It is absolutely mind boggling and staggering to me that this server was not turned over and now has supposedly been wiped. This server should be confiscated and ...","post_message":"Rep. Trey Gowdy said the former secretary of state has failed to produce a single new document in recent weeks and has refused to relinquish her server to a third party for an independent review."}]
