[{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"1111328388897763","commenter_b":"Grow a set you whinny little pussy!","commenter_a":"In America we all have the right to support which ever candidate we choose! Why be afraid God is on your side! I choose Trump! We have that right in America! I do think the present government in America is creating all this fear and I will vote Republican. If you don't want to abide by our Constitution and Congress Approved Amendments maybe you don't belong in America. IN GOD WE TRUST. WE WANT OUR AMERICA GREAT AGAIN","post_message":"\"I don’t deserve to feel afraid at my school,” said another student."},{"comment_id":"952565694839683","commenter_b":"There's. room for one more clown in the car.","commenter_a":"The clown car is getting full!","post_message":"Another hat in the ring?"},{"comment_id":"1022960277760501","commenter_b":"NO Hillary, Monica, & Bill in the White House ever again. TRUMP for PRESIDENT!","commenter_a":"Madame President Hillary Rodham Clinton and First Husband Bill Clinton January 20, 2017","post_message":"“Girls can do anything.”"},{"comment_id":"822379027897898","commenter_b":"How will she do that? She is one of the causes for the problem !!!!","commenter_a":"No they just rather let America be filled and run by people who hate America.","post_message":"“We are not going to be Donald J. Trump’s hate-filled America. Not now, not ever.”  Sen. Elizabeth Warren told a fired up crowd that Hillary Clinton will fight to end discrimination in America."},{"comment_id":"10153972084976336","commenter_b":"Pretty white chick..Thug?...heck no...let her go....","commenter_a":"Thugs come in all shapes, sizes, genders and races! Thanks to the Law Enforcement for removing this thug from our streets.","post_message":"Abigail Lee Kemp was taken into custody in Smyrna without incident, the FBI’s Jacksonville, Florida, office announced."},{"comment_id":"10155915782125354","commenter_b":"I'll bet the gals concerned about this shirt just flat out don't qualify to wear one.","commenter_a":"dont want one dont buy one...must everything be a crisis?","post_message":"Feminists are up in arms about this T-shirt. Should Target cave to their demands?"}]
