[{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"1586196515000795","commenter_b":"Then duck tape her ugly ass mouth","commenter_a":"she's just another stupid liberal bitch, who doesn't deserve to live in this country. she shold go live in some isolated place, where her rants and raves can go un-heard.","post_message":"Way to go Tom Selleck. Rosie is just so rude."},{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  \"I will f*ck sh*t up!\""},{"comment_id":"1056873814372366","commenter_b":"Rightly so with people like you ..muslim countries would be crazy to let you in","commenter_a":"No churches can be build in Muslim countries, why should mosques be in Britain .Woman got 200 lashes for just reading a bible in Sadia Arabia just last week.","post_message":"The largest Mosque in western Europe is engulfed in flames"},{"comment_id":"1159441540761968","commenter_b":"Vote for Trump, he is the only one that will build the wall!!!!!!","commenter_a":"WTH?? Since when has this become acceptable? Build the Frigin wall!","post_message":"ILLEGALS.... ILLEGALS... ILLEGALS... They are terrorists.  @webpagelink"},{"comment_id":"10153528631451955","commenter_b":"What a cunt! I hope she ends up in jail!","commenter_a":"She's been divorced 3 times. If god forgave her for that 3 times, he'll forgive her for issuing a gay marriage license once haha","post_message":"DEFIANT: Judge orders KY clerk to appear in court after she again denies gay marriage licenses..."},{"comment_id":"10153956256701336","commenter_b":"Exactly!","commenter_a":"government is always looking for a new tax. The gas prices should be lower for what crude is going for right now.","post_message":"The price of Brent crude in the United States has fallen below $40 a barrel – more than $30 lower than in May of 2015."}]
