[{"comment_id":"673468959486383","commenter_b":"Can't run from jail...better hope Obama pardons her","commenter_a":"I do not think she will run in 2020, nor will the DNC even consider her after the whooping they took, she is too toxic.","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"903394569805665","commenter_b":"Blow them out of the water.","commenter_a":"Ok ok this time only send them $20 million","post_message":"New Video: Four ships belonging to Iran's Islamic Revolutionary Guard Corps (IRGC) \"harassed\" an American destroyer in the Strait of Hormuz Tuesday, a U.S. Navy official confirmed to Fox News. @webpagelink"},{"comment_id":"10153776818934255","commenter_b":"eliminate money...take their power...then its not \"too costly\" to protect the planet...and the creatures that inhabit it...its up to the people","commenter_a":"They were also in with Gov. Jeb Bush pushing education vouchers in Fl. that took money from public education.","post_message":"Unreal.  #DailyKosClassics"},{"comment_id":"1267539270005791","commenter_b":"@username , is it all intelligent, competent and strong women that intimidate you, or just Hillary? Hillary 2016","commenter_a":"He can only intimidate weak people... She's the exact opposite of that! #VoteBlue","post_message":"BOOM."},{"comment_id":"1151424271590993","commenter_b":"Hillary is a racist bitch.","commenter_a":"Sums up trumps campaign..... even his surrogates are full of shit.","post_message":"He walked out of his own church because of his lies! #DonaldTrump #MarkBurns"},{"comment_id":"10154290485811545","commenter_b":"Building a physical wall between MX is imsidious but ee must create a climate of understanding with the that they are responsible for these people comimg over illegal. We need to have serious talks with Mexico and make clear that vast fines will be waged against them if this invasion continues.","commenter_a":"He's lying like his president about everything","post_message":"Our Facebook stream has ended, but you can keep watching here: wfaa.com/livevideo  WATCH LIVE: Confirmation hearing for Alabama Senator Jeff Sessions, President-Elect Donald Trump’s pick for attorney general.  MORE: @webpagelink"},{"comment_id":"10154287334146636","commenter_b":"It's very disgusting seeing the fake news of rape and burning alive. Burning alive is the nature of Muslims and Myanmars never do that act. Rape? All Myanmars are laughing the accusing of rape because Myanmar men even don't dream to rape Bengali Muslim women.","commenter_a":"Whether true or not, Myanmar needs to show evidence rather than blanket denying n also ppl should stop pointing finger from one side n stop calling \" Buddhist terrorist\" unless u want to be called ur religion as \" terrorist\" too, think in their place before u say ! Plus I AM DONE WITH ALL SOCIAL MEDIA NEWS especially like BBC !","post_message":"Horrific"}]
