[{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":""},{"comment_id":"1797699957184669","commenter_b":"Gowdy is a total bad A!","commenter_a":"I must say that I have never heard of you before today, however after watching many you tube videos and a bit of research I am impressed by you in every way. You would make an amazing Attorney General.","post_message":"There will never be enough words to adequately express our gratitude for the brave men and women who have selflessly fought for our freedom. Thank you to all of our veterans, past and present, for your service and sacrifice to our country. May God bless you."},{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10154369349733812","commenter_b":"Take your hate, elsewhere, lady.","commenter_a":"Big f'n deal","post_message":"Pres. Barack Obama and First Lady Michelle Obama announce their daughter Malia will attend Harvard University in the fall of 2017, taking a gap year after her high school graduation next month."},{"comment_id":"10153881330947434","commenter_b":"So funny how some morons predict an armageddon just because their feminist messiah didn't win.","commenter_a":"Except for the fact that Jill is only asking for recounts in places where Trump won narrowly and has continually ignored asking for recounts in areas where Hillary won by even less votes. It's not about electoral integrity, it's about a woman having an infantile, foot stomping temper tantrum because she didn't get her own way.","post_message":"Jill Stein herself, standing across the street from Trump Tower, encouraged the president-elect to support her campaign’s efforts to ensure that every vote is accurately counted. “There is nothing to be afraid of,” Stein said, “if you believe in democracy.”"},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"10153752964580575","commenter_b":"I'm ashamed of you Mary, rape is rape. Lord help you if you ever get in that situation.","commenter_a":"I don't doubt Bill Clinton and Bill Cosby were with these women. My doubt comes from what is rape. When a woman wants something from a man and is willing to give sex for it , is that rape ?","post_message":"Bill's past is coming back to haunt Hillary. . . ."}]
