[{"comment_id":"10156245317395720","commenter_b":"What illegals are we talking about? The ones that invaded on the Mayflower? Or the ones that boldly and brazenly broke into our shores on Ellis Island?","commenter_a":"THE LAW already says certain immigrants can work without fear of deportation. They're called the ones who came here LEGALLY! ILLEGALS, on the other hand, may not work in the United States.","post_message":"184 Members of the House and 34 U.S. Senators filed an amicus brief last night supporting Supreme Court review of President Obama’s executive actions on immigration. We are confident that allowing certain immigrants to come out of the shadows, register with the government, and work without fear of deportation fully comports with immigration law and the U.S. Constitution. Read more here: @webpagelink"},{"comment_id":"10153832983220950","commenter_b":"Bitch u just said a bunch of racist shit now","commenter_a":"Yes, he did behave badly but, those two athletes who chose to speak out against the country they were sent to represent, the country that has supported their goals, trained them and gave them the tools they needed to succeed in their sport, should face the same fate as Lochte.","post_message":"Speedo wished Ryan Lochte well, but said it \"cannot condone behavior that is counter to the values this brand has long stood for.\""},{"comment_id":"10156622282140354","commenter_b":"Al Sharpton can kiss my all white hairy ass..","commenter_a":"AL SHARPTON---STILL FLAPPING HIS LIPS---HEY AL --Where were you when those three Black Thgs killes that 3 year od Black girl playing on her porch Christmas Day---oh thats right--there was no pay day in that one for you..","post_message":"Liberals are FUMING over these 2 tweets from Al Sharpton blasting liberal Hollywood hypocrites..."},{"comment_id":"10153381837831770","commenter_b":"SHES A PROFESSOR ==== HEY KIDS DONT GOT TO THAT SCHOOL SHE WENT TOO SCHOOL WITH OBAMA AN HILLERY,","commenter_a":"Ladies and gentlemen if you want to see the face of Satan then look at this woman see how she can lie like that and never change her facial expressions. This woman I believe is either a muslim or a muslim symphothiser where do these people come up with such outlandish lies like this. This woman should be locked up. Make her produce evidence of her accusations and if she cannot then Lock Her Up For Slander.","post_message":"A queer theory professor in the department of women’s and gender studies on the Rutgers University campus in New Brunswick, N.J. believes that Israel has plundered the internal organs of dead Muslims."},{"comment_id":"1249007868459199","commenter_b":"Also, where are the women?","commenter_a":"Where are all the 3 year orphans Obummer talked about?","post_message":"Obama couldn't vet the guys I went to school with in Mumbai; how does Mr. Know-It-All plan to vet tens of thousands of #SyrianRefugees?"},{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."}]
