[{"comment_id":"1238351549542994","commenter_b":"Take this woman's FB from her. That's stupid!","commenter_a":"No! Edwards did not ask Obama and liar Hillary to stay away! He's lying! He wanted them there but Obama did not want to give up his golf! Hillary is having serious health issues with seizures and needs her sleep!!!!! Trump Landslide!!!!!","post_message":"Donald J. Trump slams President Obama for not interrupting his vacation to visit Louisiana after deadly flooding in Baton Rouge and parts of Lafayette."},{"comment_id":"10152651937258067","commenter_b":"You're wrong. Red letters mean it was quoted, a parable told by Jesus. If you don't believe the Bible Stephanie Morris, that's fine. But you can't question why a church would make a decision if you don't believe in the book that the church is built around.","commenter_a":"Question is, why did that church invest in money-changers? What would Jesus think?","post_message":"A church in Indianapolis claims JPMorgan intentionally mismanaged church funds and only cared about maximizing fees. @webpagelink"},{"comment_id":"490645967790363","commenter_b":"Trump thought better of it and he was invited in. Jorge Ramos is a U.S. Citizen, a gentleman and a great reporter for Univision. Shame on Trump!","commenter_a":"trump was right","post_message":"He just got SCHOOLED!"},{"comment_id":"10152977695566234","commenter_b":"He does not have a chance in hell. Rand Paul 2016! Sweeny will NOT be our Governor either. LET FREEDOM RING!","commenter_a":"HELL NO!!!!!!! But don't worry, he'll NEVER GET THAT FAR!!!!!!!!!!","post_message":"Would Gov. Chris Christie's trademark brash demeanor be an asset as he dealt with foreign relations if he were elected president?"},{"comment_id":"1092318047486497","commenter_b":"The chick in the limo is smokin...","commenter_a":"Yet he still left the guns...","post_message":"Now THIS is how you get out of a bad date. Mat Best MBest11x always taking it to the extreme. ~Will"},{"comment_id":"1152602824750026","commenter_b":"You betcha! Right on the money! She's.a proven liar , Fraudster and a money/ power hungry bitch !!","commenter_a":". Blame Democrats for Flint Water Crisis says Michael Moore?....Democrats knew the water was poisoned for 18 months Moores tweet --> @webpagelink","post_message":"Is Sanders worried that Clinton is not honest, trustworthy?"},{"comment_id":"10153311050083037","commenter_b":"Just remember these are people fleeing terrorism NOT terrorist! Living breathing people who are desprete. THEY HAVE NO LESS RIGHT TO DO THAT THEN YOU DO... just because an accident of birth MADE YOU AN AMERICAN","commenter_a":"That is assault, and the spitter better be charged.","post_message":"\"It sickens me to know that no matter how hard I try, there still exists a blur between myself and the decency a human life entails,\" said the student."}]
