[{"comment_id":"1149825048400467","commenter_b":"Everybody is sick of her! She just needs to go away!!","commenter_a":"Fox and news should never be together! News is ok and fox is ok but fox and news makes no sense!","post_message":"Source: Fox is ‘Sick’ of Megyn Kelly; ‘Fox News Needs to Cut Her Loose’  @webpagelink"},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"},{"comment_id":"577625642398915","commenter_b":"I was going to say not everything you see/read on the internet is true- A very nice friend once told me that- so...where's the link to the factual article or video or actual statement? You can't believe it just because somebody posted it & made a meme out of it!!!😐","commenter_a":"At least at this election I will not be voting for a party that would take such a pledge and perhaps n ever will again.","post_message":"Republicans have been plotting to obstruct Pres. Obama since the day he took office, and now they have the audacity to ask for your vote this November.   Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153247740094411","commenter_b":"Suck it up mother fucker","commenter_a":"När Israel skrotat alla sina atomvapen, har dom först då, rätt att ha trovärdiga synpunkter.","post_message":"BREAKING"},{"comment_id":"10154641640883145","commenter_b":"Yes 3 station, back in the day....... Family time is lost to the streets now.","commenter_a":"Its sad that some ppl don't have a life n wanna ruin it for everyone else","post_message":"Over the weekend they announced the circus would end in May. @webpagelink"},{"comment_id":"918281018215139","commenter_b":"All depends on how many illegals are allowed to vote!","commenter_a":"Nobody","post_message":"We’re now a little more than a year away from the 2016 presidential election and Hillary Rodham Clinton, long-time Democratic front-runner, has set her sights on the Oval Office. Who in the potential Republican field can beat her? Take our poll. @webpagelink"},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination\""}]
