[{"comment_id":"611841178976490","commenter_b":"Ha.....snake in the grass. Call her out.","commenter_a":"send Hillary to live with the Arabs.","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"1406711522684967","commenter_b":"How do you know? Did you run a DNA test and look in her panties?","commenter_a":"Whenever, but still has male DNA and body parts, so still a male on the cover of the magazine.","post_message":"Vogue Paris will feature its first trans model on the cover of its latest issue."},{"comment_id":"1244573758893966","commenter_b":"I Absolutely agree! A party of the people. Even a small number of seats in the Senate will be very influential. This would apply to the House, state governors, all the way through to mayors and local city counsels are all controlled by big money politics. We must stop trans-national corporations, and their billionaire owners from sucking the life out of us! STop the vampire billionaires!","commenter_a":"There IS at least one viable and active third party, progressive and non-corporatist: The Green Party. but pundits don't like to acknowledge they exist. It's a weird denial-fetish.","post_message":"\"We need third parties in this country. And by that I don't mean another third party supported by billionaires, that centrist, you know, in the sort of Ross Perot manner. I mean parties that represent different opinions on the spectrum in the manner of the populist party in the 1890s which was really the last time we saw a third party movement, that contested the ballot from the bottom all the way to the top and they were a real political party.   Unfortunately the techniques that the populists used are against the law in most states. If we were to repeal those laws you might have a vibrant third party scene again.\" - Thomas Frank, author of the new book \"Listen Liberal\" in a 2012 conversation with Bill Moyers."},{"comment_id":"10152811499753525","commenter_b":"Evil little monster! How would you ever trust her again!!","commenter_a":"as she should be charged.","post_message":"A Colorado mother says she smelled something different in her drinks on two occasions. She confronted her daughter about it. Now, a young girl is charged with attempted murder.   READ: @webpagelink"},{"comment_id":"10152647217041680","commenter_b":"Oh no!!! Millions of jobs added with deficits cut by more than half!!! Stop the tyranny!!!! #TeaPartyFail","commenter_a":"Only 679 days left of Scum Monkey Rule.","post_message":"German Foreign Minister Frank-Walter Steinmeier was reacting to a letter signed by 47 Senate Republicans warning Iran that any nuclear deal it strikes with Barack Obama will be non-binding and easily undone. @webpagelink"},{"comment_id":"1022617317773941","commenter_b":"Is the virus an illegal alien?","commenter_a":"Where's you sense of urgency to find and deport illegal alien fellons!","post_message":"Unlike Congress, Zika infected mosquitoes aren’t going to be on recess next week – they’ll be working. The emerging Zika virus poses a serious threat to our public health, and members of Congress should not leave for recess without passing President Obama's emergency funding to fight this virus."},{"comment_id":"10154316931887654","commenter_b":"it's with the thieves,rapists and murderers! this lady is a witch!","commenter_a":"It's hard to believe that she has enough brain to keep her breathing...........The woman is a grieving mother whose son was murdered by someone who should not have been here. Our borders are sieves because of failed policy and Pelosi says he was a \"law-abiding citizen\"???? Where is her soul? Her compassion? Her empathy?","post_message":"Democrat leader sides with illegal aliens over mom whose son was murdered by one."}]
