[{"comment_id":"10153700669189586","commenter_b":"I think you are an idiot. Zoos are bad conservation centres are good! You want to show your children animals in far too small spaces and teach them this is acceptable? Why don't we then put our toddlers in gages where we can keep better eye on them.","commenter_a":"That's totally insane! BAN ZOOS!","post_message":"The kids' faces say it all."},{"comment_id":"10154174806427293","commenter_b":"Girl...you need some self respect letting yourself get played like that How much are you getting paid.You ARE getting paid right?","commenter_a":"Basically she saying HE'S CLUELESS","post_message":"Donald J. Trump's campaign manager was pushed today on \"Morning Joe\" to explain some of his recent comments."},{"comment_id":"10153737493874705","commenter_b":"Up Scumbag!","commenter_a":"But who won between Scumbag and Footlights?","post_message":"Oh, wow."},{"comment_id":"10154024832271756","commenter_b":"Garbage men make a shitload of money. pun intended.","commenter_a":"I found a great way to pay off my student loans....after college I got a job","post_message":"The government estimates that some 41 million students together owe more than $1.2 trillion."},{"comment_id":"760057160777731","commenter_b":"Kick her off the force","commenter_a":"She should be sacked for that .How are Americans letting there country , that there relatives fought for .Letting this happen . You are been invaded ,don't you see this . They are Attacking you on your land ,they burn your flag and disrespect your ways ,I never thought Americans would stand for this .Has Obama destroyed America .","post_message":"Here's Islam in action, again. @webpagelink"},{"comment_id":"10153621551297377","commenter_b":"Crazy ancient old woman.","commenter_a":"ABSOLUTELY SHE WAS OUT OF LINE. Unbecoming and in appropriate from a person in her position.","post_message":"Some are questioning whether Supreme Court Justice Ruth Bader Ginsburg was out of line for criticizing Donald Trump in two recent interviews."},{"comment_id":"10153610090283598","commenter_b":"But everything is wrong with killing someone to gain at their expense!","commenter_a":"Wow. So you can't be \"successful\" without birth control? Women can't be successful if they become mothers? Women can't be successful unless they're childless? This modern feminist movement is ridiculous. It tells women they can't have a life if they have kids. True feminism teaches that women can do anything they set their minds to because they are strong and capable. And another thing, Miss Lawerence. You have access to condoms and birth control through many other outlets that do not kill innocent children for profit. It is delusional to believe otherwise.","post_message":"Hunger Games Actress Jennifer Lawrence: Thanks to Planned Parenthood I’m a Successful Woman"}]
