[{"comment_id":"543124655889625","commenter_b":"How much more money does she need ??!!!!!!!!??","commenter_a":"Is this really Hillary Clinton? @webpagelink","post_message":"This is truly shocking..."},{"comment_id":"569916976504180","commenter_b":"@username, different country different faith but people still using the text to justify murdering gays. Was it the predominantly Muslim US States that passed the \"Gay panic defense?\" @webpagelink","commenter_a":"Good on you, Bruce. Christians warned us about Sharia law, and now they've imposed their version of it on us. Irony?","post_message":"\"Some things are more important than a rock show.\""},{"comment_id":"825939240815639","commenter_b":"Us as well!!!!! IF people do not want the AMERICAN FLAG, THEY SHOULD GET THEIR BEHINDS OUT OF AMERICA......PERIOD!!!!!!! Jo","commenter_a":"Fidiots, this is America, the laws they are SUPPOSED to enforce are AMERICAN laws. I'm so tired of the constant assault on my flag and my country.","post_message":""},{"comment_id":"10153969418599575","commenter_b":"Mike Carter was it ever great? Living on credit was the way to create happiness, no one is talking about the pitfalls!","commenter_a":"None of the other Candidates are even mentioning Veterans! They have already had 6 Debates. I am going to watch the other channel and vote for Trump!","post_message":"Donald Trump is going to skip Thursday's GOP debate.   “We’ll have an event here in Iowa, with potentially another network, to raise money for wounded warriors,” he said. “And Fox will go from probably having 24 million viewers to about 2 million.”"},{"comment_id":"10153747990651178","commenter_b":"He right she butt ugly","commenter_a":"Trump all the way.","post_message":"Which corner are you in? Fiorina or Trump?"},{"comment_id":"10154705927224255","commenter_b":"Pence is no more Christian then I am, but at least I am not a hypocrite. I don't believe at all.","commenter_a":"For as bad as Trump is, Pence is just as horrible and probably more terrifying since he tries to hide his awfulness behind his bible and has no problem signing bills into law that he doesn't even read. With Trump being \"one of the most impeachment-ready candidates ever” Pence is who would be running the White House. Here are just a few of the deplorable and insane things that Pence has done in his career of screwing over Indiana and what we could expect as a Pence run administration. - He looks up to Dick Cheney as a role model for Vice President...that alone should scare the crap out of folks. - He regularly goes blank, forgetting what he was saying, and seemingly losing track where he is and what he is doing. - He is anti-science. - He has made a career out of destroying Planned Parenthood, Roe v ...","post_message":"Bravo, Tim Kaine!"},{"comment_id":"10154249032461178","commenter_b":"She should be gangraped!","commenter_a":"Is the reverse also true?? Are you fair game if you disagree with my views?? What an idiot!","post_message":"A rapper with a history of controversy says violence against women is OK as long as they disagree with her politics."}]
