[{"comment_id":"1211081885612641","commenter_b":"It's been 20 years since we've had a caring honest president. The last 8 years have been Muslim run, no doubt. When a commander in chief refuses to acknowledge we have terrorist attacks within our USA...isis islamic terrorists","commenter_a":"Screw Obumer!","post_message":"95 YR OLD WWII VETERAN Writes Scathing Letter To Obama: “I can’t figure out what country you’re the president of”"},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10153290694163279","commenter_b":"Shut up.","commenter_a":"@webpagelink David W. Blight described the day: This was the first Memorial Day. African Americans invented Memorial Day in Charleston, South Carolina. What you have there is black Americans recently freed from slavery announcing to the world with their flowers, their feet, and their songs what the war had been about. What they basically were creating was the Independence Day of a Second American Revolution.","post_message":"As part of our Memorial Day special, watch this speech by former Rep. Pat Schroeder recorded at the conference, \"Vietnam: The Power of Protest.\""},{"comment_id":"10153898665266336","commenter_b":"Don't forget about us crazy white women !!","commenter_a":"The white boys who are already here have horrible things on their minds. When are you going to call for them to be banned Donald the clown? @webpagelink","post_message":"On last night's 'The O'Reilly Factor,' Donald J. Trump defended his proposed Muslim ban and said the U.S. \"cannot allow people to come into this country that have horrible things on their mind.\" @webpagelink"},{"comment_id":"10153198619131378","commenter_b":"Hell no he has lost his mind please hurry 2016 so he can take a much needed seat lol","commenter_a":"No more illegal","post_message":"\"Now we know the scale of this problem. It's significant. And there are millions of people who have been driven from their homes because of this violence,\" President Obama said."},{"comment_id":"10153166814916770","commenter_b":"Crook!","commenter_a":"Keeping it in the family.","post_message":"As secretary of state, Hillary Clinton sought to help a friend of her wealthy hedge fund son-in-law who was seeking a meeting with the State Department and Clinton herself to discuss a deep sea mining he had invested in."},{"comment_id":"955814454527001","commenter_b":"He involves himself into everything other than the priests who get their heads c*** off so called refugees .","commenter_a":"lmao the fact that this is an actual problem and a topic taken up by the pope, speaks volumes about the state of the humans! arent we suppose to be the most intelligent species...i mean we aren't animals that can change genders at will or to reproduce...","post_message":"\"Today, in schools they are teaching this to children -- to children! -- that everyone can choose their gender.\""}]
