[{"comment_id":"10153042217565047","commenter_b":"JH move to Israel","commenter_a":"Because our communist muslim pig so called president is one if them. America stand for Israel Defy the leadership of this commie government and fight for what is right. Stand with Gods people.","post_message":"The terrorist-led Palestinian Authority (PA) has ended its peace with Israel.  War could be imminent, so why are we still sending millions of dollars to the PA?   We must stand with Israel.  SIGN & SHARE our petition to stand with us: @webpagelink"},{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"},{"comment_id":"1581842645443556","commenter_b":"@username We saw that guy with the brains.Did you?","commenter_a":"\"i need all the white people to move to the back\" that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"},{"comment_id":"10153748050319255","commenter_b":"Thank you for your service. 🇺🇸🇺🇸🇺🇸","commenter_a":"I am an ex Special Forces Officer and I volunteer to lead The teams that are going to infiltrate Exxon and Shell","post_message":"We can only hope, Karl.  By Daily Kos user Lefty Coaster"},{"comment_id":"10154584633716955","commenter_b":"I think she should move to Mexico!!!","commenter_a":"I'm thinking she would have done that whether she won or lost.","post_message":"TIRED HILLARY"},{"comment_id":"930249893698207","commenter_b":"@username tell that to these women and many more @webpagelink","commenter_a":"Hillary takes millions from country's that rape girls at 9... Legally. And where woman can be beat stoned or imprisoned just for reporting rape.. What happened to the war on woman? Oh, big $$$$$$$$ Oops, my bad","post_message":"Hillary can't do it without you. Sign up to volunteer: @webpagelink"},{"comment_id":"1082137365131066","commenter_b":"So yeah, drug addicts can just stop for a few days to pass a test...yeah no, sorry that isn't how it works.","commenter_a":"Anyone bother reading the article? \"..recipients (of welfare) choose the day and time of the testing..\" This is how it's done in all these examples and *THAT* is why there was only one person that failed. Most drugs are out of your system (and won't show on a dipstick test) in less than 48 hours. Do *RANDOM* drug screening like I have to do for my job. No advance notice, just get here now and pee in a cup. See how many fail then.","post_message":"There are stereotypes and there is reality. Welcome to reality."}]
