[{"comment_id":"996644970358551","commenter_b":"Arrogant bitch.","commenter_a":"And there are idiots out there that support this bi---!","post_message":"Whoa, Hillary Clinton put this reporter in her place."},{"comment_id":"806051249493483","commenter_b":"Republicans....","commenter_a":"What flipping IDIOT would vote for this nut","post_message":"He leads his closest competitor by 11 percentage points."},{"comment_id":"10152574199456636","commenter_b":"Why are the females removed!","commenter_a":"After a half century of thinking / rethinking - my conclusion is that \"The Matured Feminine Approach\" (regardless the physical gender) is the today's hope for more cooperation, understanding,compassion and responsibility in the World! We need to educate and appreciate much women - especially for top leader purposes. Male thinking leaders are afraid of rivals and to lose domination","post_message":"After an ultra-orthodox Jewish newspaper removed all the female world leaders from the Paris march images..."},{"comment_id":"10156602448280725","commenter_b":"Yes I just got a form in the mail to change so I could vote for Donald Trump Thank you","commenter_a":"To all Trump voters! If you not registered as a Republican, your vote WON count in your State primary election. Your vote will Not be counted if you are not registered as a Republican. You must register as a Republican ASAP. Find out your state rules and register now. Better yet, don wait, Register Now! Make your vote count for Donald Trump 2016!!! Please share this with Donald Trump voters.","post_message":"Many people voted for Cruz over Carson because of this Cruz fraud. Also, Cruz sent out a VOTER VIOLATION certificate to thousands of voters."},{"comment_id":"877271008975026","commenter_b":"Preach my man. Preach.","commenter_a":"If you actually listen to what he's saying he explains everything and the reasoning why he was doing what he was doing. Maybe not the barrel roll but everything else is explained. The reason why he told those kids to get down was because they ran and were evading the police. I didn't see how that went down but he at least it to them and did not physically harm those kids. He used physical aggression on the girl yes, but multiple times he told them to leave...they didn't so he made an explain by trying to arrest the loud mouth that couldn't shut up and walk away. She resisted arrest and he forcefully tried placing her on the ground multiple times, where she continued to resist arrest and then for some reason it seems like the in thing to do today for young teenagers and college aged students but ...","post_message":"Here's why Officer Eric Casebolt's barrel roll is worthy of your attention..."},{"comment_id":"10153086110919411","commenter_b":"she is a child","commenter_a":"She just got out of jail 2 weeks prior for car theft and now was in another stolen car and tried getting away using the car as a deadly weapon, the cops have no idea who is behind the wheel, it doesn't matter at that point. Dumbass brought it on herself!","post_message":""},{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"}]
