[{"comment_id":"10153440624016680","commenter_b":"@username KILLERY LOVER<< YOUR SICK GO LIVE IN CANADA YOU LIBERAL IDIOT>>","commenter_a":"Donald Trump all the Way to the White House,,Heck with all the Haters and the Crooked Sander Backers,, and the ones that Love Hilary yea way to Support her a Criminal That Killed 4 American Servicemen,, she should be in prison,!!!!!!!!!!!!!!","post_message":"Donald J. Trump: Michelle Fields grabbed me."},{"comment_id":"487670684715042","commenter_b":"because someone has to protect your pansy ass","commenter_a":"If these guys are so tough with their guns, why aren't they serving right now in The Middle East?","post_message":"Who will save us from tyranny in the produce section now? -Linda"},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"},{"comment_id":"1293729747316737","commenter_b":"God she's a rotten pos","commenter_a":"Oh stop the whining! Grow up. The people have spoken so move on!!","post_message":"Chelsea Handler and Sen. Barbara Boxer didn't hesitate to shed tears at the \"sexism\" of Trump's victory."},{"comment_id":"1125267834218418","commenter_b":"His old ladies big ass!!","commenter_a":"Oh puleeze.....","post_message":"Obama posted this \"Happy Easter\" pic on Sunday, but it didn't take long before people started noticing 1 enormous problem.  Did he just get caught in a sickening lie? Probably... but decide for yourself."},{"comment_id":"10154028098571336","commenter_b":"Yeah whatever, clueless lady.","commenter_a":"Oh come on....Carson, a very good man, has hardly run much of a campaign. If your campaign can't get traction, it's not someone else's fault!","post_message":"\"A culture exists within the Cruz camp that would allow people to take advantage of a situation like this in a very dishonest way. Isn't this the same thing we see with the Obama administration?\"  Dr. Ben Carson slammed Ted Cruz's campaign over allegations they told Iowa caucus-goers Carson was planning to leave the race."},{"comment_id":"10156246277170725","commenter_b":"But I don't support Trump's fantasy plan about deporting 11 million people illegals with criminal records should be deported immediately!!!...we should build a wall too....and we should give work permits, make them pay fines, and adopt an E-verify system. ....that's more realistic and rational. Switzerland has a population of 8 million people, according to Trump's plan, he would deport the equivalent of every single person living in Switzerland and then SOME not only it is CRAZY, it's impossible. ..for the sake of argument let's say it was possible, it would cost billions and billions of dollars and take decades to accomplish that.","commenter_a":"I think people are going to vote donald trump for president","post_message":"Saying goodbye to some of my great workers at Trump National Doral Miami."}]
