[{"comment_id":"1309116862459880","commenter_b":"Now if they can do something about her mouth....","commenter_a":"Seeing as she is costing taxpayers tons of $$$ for her moronish actions maybe a class action suit should be filed against her for $100M","post_message":"Just in!!"},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."},{"comment_id":"10154826896060530","commenter_b":"One more time","commenter_a":"Trump won! Get over it! Hillary lost 2 elections and she accepted the loss once she called trump and congratulated him on his win before all the votes were in!","post_message":"#BREAKING: Michigan's Board of Canvassers deadlocked 2-2 on President-elect Donald Trump's objection to a recount of all presidential ballots cast in Michigan."},{"comment_id":"401636356691325","commenter_b":"The rule applies to everyone. She needs to \"DEAL WITH IT!\" End of story!","commenter_a":"All should live by the laws!","post_message":"\"I don't want to take off my Muslim Head Covering in Court\"..."},{"comment_id":"1665697853729274","commenter_b":"@username How do you know Obama didn't do half the stuff he's accused of? I say he did and another half we haven't heard of yet! There isn't going to be a recount of every state, but if there was Trump probably would win by a landslide. Hillary has done nothing but lose ground!","commenter_a":"I think you guys are forgetting this is a FREE country and people don't have to perform for someone they don't respect. He hasn't earned any respect and indeed, he has done quite the opposite. Insulting people left and right and you guys just cheered. Trump believes people should bow to him and perform for him. He is NOT a king. It is his own people that were crying that no one wanted to come and all of a sudden he wants \"just the people\" Please...don't make me laugh! He is already claiming he helped keep jobs here and claiming success for Obama's successes. He has already been caught in outright lies about it. Oh I saved Sprint, they are coming back...no, that deal had nothing to do with Trump. It's laughable! Why do you ignore it? Is it too uncomfortable for you people to acknowledge he has lied to ...","post_message":"They turned up their nose at our future president."}]
