[{"comment_id":"539522582917416","commenter_b":"Well screw the NBA Players . . . pansy ass bitches!","commenter_a":"WHO GIVES A BIG RATS ASS WHEN YOU BACK A LOSER !!!!!","post_message":""},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"10153496475494575","commenter_b":"\"She has since filed an appeal.\" Wow! She has some f***ing nerve!","commenter_a":"Horrible, horrible person.","post_message":"An 8-month-old baby girl died after an EMT refused to respond to the call.  The EMT told her boss, “I'm not about to be on no scene 10 minutes doing CPR, you know how these families get.\""},{"comment_id":"1379025478784145","commenter_b":"These r not protest they r riots","commenter_a":"They need to throe away the flash bang and prepped spray and use real ammo","post_message":"Seattle May Day protesters threw flares, bricks and Molotov cocktails, while police returned fire with flash bangs and pepper spray.  More here: @webpagelink"},{"comment_id":"1239208946099133","commenter_b":"Both moms need to get sterilized","commenter_a":"First it said she wasn't charged then it said she was charged with manslaughter and she has been released on 15,000 dollar bond. They should take all her children away from her. These children are her responsibility not the 8 yr old boy. If she would rather be in a bar then put her behind them for the rest of her life.","post_message":"A boy is being charged with beating a 1-year-old girl to death while they were left home alone as their mothers went to a nightclub, police said"},{"comment_id":"376942655827362","commenter_b":"Go Back To your frickin homeland!! We did not invite you here!!","commenter_a":"Deport them","post_message":"The want to change Easter in \"Spring Break\"..."},{"comment_id":"10153759399624228","commenter_b":"Her point, Chad, is that it's not just Muslims who are terrorist. I'm not a supporter of Muslims and have my own views but you can't just pick and choose. If you're going to list terrorists, list them all. Not just a specific religious/culture type","commenter_a":"It's not just ISIS.","post_message":"They want all of us to become hostile"}]
