[{"comment_id":"10154062439342541","commenter_b":"Too much fat around the waist can't grab that skank","commenter_a":"Big deal. There's a position waiting for her in the White House after January, 2017. She seems to have the required credentials/ideology that would qualify her for employment under that administration.","post_message":"The non-profit director who called First Lady Michelle Obama an \"ape in heels\" has been fired for good."},{"comment_id":"1296455407059683","commenter_b":"No they should be given sentences building the wall then deported for ever","commenter_a":"Agree","post_message":""},{"comment_id":"1589013221321122","commenter_b":"Bring back War Crimes Donald! #MakeDonaldDrumpfAgain","commenter_a":"Mitt Romney was and still is a total lightweight! Time for a candidate who's the real deal! Time for Americans to play the TRUMP card!! Adios illegals!! #MakeAmericaGreatAgain #TrumpTrain","post_message":"WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"955678404472632","commenter_b":"Hey Christie, are your kids vaccinated? FOOL!","commenter_a":"Sooo, Chris believes that parents should have a Choice...wonder how far that goes beyond vaccination...","post_message":"Gov. Christie: “Not every vaccine is created equal, and not every disease type is as great a public health threat as others.”"},{"comment_id":"10154255735864411","commenter_b":"It doesn't hurt to have sense of humour :)","commenter_a":"It's pretty stupid how media outlets are sharing such pathetic content. It's Obviously and clearly not a frikin time traveller. What's even more pathetic, is how the public seem so hooked onto such rubbish.","post_message":"'Time travel is real?'"},{"comment_id":"1834572823431236","commenter_b":"\"Sick\" being the operative word in this article, I and the whole world are Im sure sick of these people and their outwardly show of solidarity to the outside world to get what they want, they will never integrate, that's a fool's paradise, so all those do gooders, I hope you are happy with what you have welcomed into Christian Countries. Im off to celebrate CHRISTMAS and Happy Christmas a million times over to these sick perpetrators of evil, may our God show no mercy on you.","commenter_a":"Insane, on the highest level. How dare they exploit children like this.","post_message":"Sick parents say goodbye to their children before one of them blows themselves up in suicide attack."},{"comment_id":"946547988774787","commenter_b":"Theresa, get a job, I'm retired! Baaaaaaaa, sheep!","commenter_a":"I don't care what Stewart thinks; I'm not one of his unemployed sheep!","post_message":"\"I honestly have nothing other than just sadness, once again, that we have to peer into the abyss of the depraved violence that we do to each other, and the nexus of a just gaping racial wound that will not heal, yet we pretend doesn’t exist.”  -Jon Stewart"}]
