[{"comment_id":"1093117534044369","commenter_b":"He should be slut shamed with a fire ant bath!!","commenter_a":"The term \"slut shame\" is fucking ridiculous in and of itself, but saying that the judge was \"slut shaming\" a rape victim is fucking horrendously disgusting. This judge should be suspended, and whoever made the title for this article should be fired.","post_message":"Holy sh*t."},{"comment_id":"494909614001888","commenter_b":"That's it Chris we're all fucked - fucking wall climbing alligators!!!!!!!","commenter_a":"Abraham Guimaraes","post_message":"Nope. Not photoshopped."},{"comment_id":"10153059352079342","commenter_b":"Sick sick person, wonder how she would like that done to her. She looks mean! Glad she is not my grandmother.","commenter_a":"guela knows","post_message":"A grandmother from southwest Houston is accused of burning her 12-year-old granddaughter with a hot tortilla pan after the girl got in trouble at school for writing on the chalkboard.  FULL STORY---> @webpagelink"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10154852299903690","commenter_b":"Women are slave under islam","commenter_a":"Let him grab those who voted for him by the p*ssy...","post_message":"53% of white women cast their ballot for Trump."},{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."},{"comment_id":"760057160777731","commenter_b":"Kick her off the force","commenter_a":"She should be sacked for that .How are Americans letting there country , that there relatives fought for .Letting this happen . You are been invaded ,don't you see this . They are Attacking you on your land ,they burn your flag and disrespect your ways ,I never thought Americans would stand for this .Has Obama destroyed America .","post_message":"Here's Islam in action, again. @webpagelink"}]
