[{"comment_id":"1064458436973745","commenter_b":"FIRE HIS ASS !","commenter_a":"Fox should remove shep ,,,,he was absolutely rude because he only wanted his views to be discussed, Time to go,,,,","post_message":"Many are Calling for Shepard Smith to be FIRED After What he Just did ON AIR... @webpagelink"},{"comment_id":"10154099091164203","commenter_b":"No BITCH, .it's a blog like TRUMP my mind works faster than my finger on a kindle and this blogging is not the most important issue in my life, now run along I graduated HS over 40 years ago, so you grading me is MEANINGLESS......specially since your from Canada.......","commenter_a":"Really? Bull SHIT BLACK LIVES MATTER have been showing up to all the rallies. Only TRUMP supporters are standing up to the fucking ghetto rat's. Go ahead talk OUT both sides of your MOUTH, you just keep confirming the NEED FOR THE TRUMP MOVEMENT.","post_message":"\"My own personal observation is that there is a cycle of behavior that is escalating and it's happening exclusively at Donald Trump events.\""},{"comment_id":"486046958252551","commenter_b":"What gets me though is why are these atheist bitches so offended by something they don't even believe exists Just proving their true ignorance I guess...!","commenter_a":"GOD BLESS AMERICA!!!!!!!(keep it going!)","post_message":"This student was told not say 'God bless America', but he's not backing down.  Amen. We stand strong with this student and his flag.  Do you support 'God bless America' staying in schools?"},{"comment_id":"10156126266600615","commenter_b":"Make her pay for all the time she has wasted with her stupidity.","commenter_a":"Yes and he should block her from further action, and find her and her attorney's for wasting the court's time and money.","post_message":"What do you think? Will Judge Bunning dismiss Kim Davis' lawsuit against the governor?"},{"comment_id":"10154774250570575","commenter_b":"He is the ugliest woman I have EVER seen!","commenter_a":"He is a women himself","post_message":"LOL..."},{"comment_id":"10154973446391509","commenter_b":"Shuttt up!!","commenter_a":"This is not fair because Turkey had an explosion in the airport today with few deaths and few injured. But yesterday in my country Lebanon had 6 to 7 suicide bombings through out the day in less than 24 hours in one village called Kaa which is a Christian village with 5 deaths and 28 injured some are deadly injuries. And there was not one news coverage of that.","post_message":"BREAKING: Explosions and gunfire reported at Istanbul’s Ataturk Airport, the Turkish interior ministry said @webpagelink"},{"comment_id":"942676889125393","commenter_b":"Is she ROYALTY ?","commenter_a":"How much did the vet charge?","post_message":"60-stone woman lifted out of her home by a crane in a SEVEN-HOUR emergency operation"}]
