[{"comment_id":"10153805945213908","commenter_b":"@username While I agree you should be happy with your body, I suggest that this woman is also happy. Some tall women are naturally thin thighed.","commenter_a":"again...give this skinny woman some food...why do all naked women have to be super skinny ???","post_message":"A very powerful message here."},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"10153516000908984","commenter_b":"If they want want to stay in America, they should have to obey our laws","commenter_a":"Give them all a one way ticket to Iraq. Let them embrace their Shariah Law and the ISIS.","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing...  Is Sharia law in America a major concern of yours?"},{"comment_id":"1705584226349949","commenter_b":"IF HITLER TRUMP GETS IN WE THE LITTLE PEOPLE CAN KISS OUR ASSSSSSSETS GOOD BY CAUSE HE WILL BE FOR THE RICH AND MAILNLY HIMSELF WAKE UP AMERICA BEFORE WE HAVE ANOTHER MAD MAN IN CHARGE","commenter_a":"What an Idiot..mathsssssssss you cant","post_message":""},{"comment_id":"10156396288885354","commenter_b":"If you want refugees you can have them but please build a containment wall around your state!","commenter_a":"Yes, if it is truly about safety, then they can stay in the Middle East, and we can help provide for them, which would be the right and just thing to do. They are human and most are probably good people fleeing a civil war. No need to be sent to the United States.","post_message":"\"There is no reason America cannot create a safe zone for these refugees in the Middle East. That is the most compassionate thing to do for them. It is the safest thing to do for America. The only reason Obama is risking the safety of Americans to bring them here is to feel sanctimonious and to divide us.\""},{"comment_id":"10154029353788352","commenter_b":"dont save these hoes","commenter_a":"Wow","post_message":"17-Year Marriage Ends in Three Dead When Wife Drops Husband Off to Catch Flight, But He Follows Her Instead – Catches Her Meeting Lover at Hotel: Husband Murders Man, Wife and Self"},{"comment_id":"10152732275938645","commenter_b":"fat a** hoe.","commenter_a":"Report me all you want trick","post_message":"The victim said the attacker threatened her during the rape, saying he knew where she lived and would return to kill her if she called the police."}]
