[{"comment_id":"1349219015129494","commenter_b":"Stfu","commenter_a":"Trumpers 2 days ago: yay Castro is dead! yuge win for free speech and human rights! CheetoJesus: citizens whom use their rights of free speech and ability to protest should be jailed or deported! Trumpers today: praise our Dear Leader! deport those commies!","post_message":"A fiery debate erupted over President-elect Donald J. Trump's proposed penalty for burning the American flag"},{"comment_id":"842181922581654","commenter_b":"@username If you don't understand \"propagate\" look it up... your ignorant conservative bullshit is EXACTLY why we're debating here... you see, your \"bullshit\" has infected EVERYWHERE............. the terrorists, the refugees, the billions of dollars stripped from pensions, healthcare, education, infrastructure, to support conservative idiots and their dumb-fuckery... you ass-clowns should take ALL the fucking refugees, and house them in the districts of the same fucking idiots that voted for those wars (not the acts that empowered your fuckwit) in the first place. Comprende, dickhead?","commenter_a":"Don't worry ... Kerry is drafting an official apology to Putin right now","post_message":"This is what happens when you don't have a REAL leader in charge....Un-freaking-REAL."},{"comment_id":"566067710239006","commenter_b":"Her momma should have sucked it","commenter_a":"Jennifer who!","post_message":"Jennifer Lawrence to Donald Trump: F*** YOU!"},{"comment_id":"1717609118507402","commenter_b":"She can move her wretched ass OUT!","commenter_a":"Please","post_message":"Michelle Obama: Every single day, \"I wake up in a house that was built by slaves.\""},{"comment_id":"10152557805834071","commenter_b":"Exactly in one game... Ooooh make shift O line because no one else in the league had injuries along their oline and threw for 4000 yards right. With those 4000 passing yards how many tds did he throw???","commenter_a":"Wilson = average Qb with any other team besides the shehawk's...","post_message":"He keeps improving."},{"comment_id":"10153506495063855","commenter_b":"Stay outta Kohls then Asshole...","commenter_a":"OMG. Is kohls run by the lesbiens now? My wife told me the womens shoe section is full of work and combat boots nowadays.","post_message":"ICYMI: Kohl's melts our hearts."},{"comment_id":"10153988476564255","commenter_b":"Who is this dumb bitch this must be Stacy dash sister","commenter_a":"Unbelievable!!!","post_message":"This is how Fox News celebrates Black History Month."}]
