[{"comment_id":"10153717565963812","commenter_b":"Your stupid azz obviously don't have kids... More in like you don't need them you ignorant jerk","commenter_a":"Still a criminal","post_message":"Man accused of robbing a credit union told police he needed the money to help pay for his 1-year-old daughter's chemotherapy treatments. \"I guess it was desperation.\""},{"comment_id":"1452185328156583","commenter_b":"SLAVE OF AMERICANS","commenter_a":"Plastic materials","post_message":"Iran's Islamic Revolution Guards Corps Ground Force establishes an organization specializing in using drones in military operations."},{"comment_id":"10154740685431337","commenter_b":"Hillary is the whore of Islam.","commenter_a":"If Hillary is elected president, Putin said he will wage nuclear war against the United States, but I guess that's not a big deal...","post_message":"Barack Obama's 10 Essential Sci-Fi Movies And Shows:  The Matrix Star Wars: Episode IV Star Trek: The Original Series Cosmos (...)"},{"comment_id":"1110454952404615","commenter_b":"She is nasty and mean.","commenter_a":"Yes she has","post_message":"MULTIPLE CHOICE QUIZ time, kiddies! Which answer did YOU choose? A or B? Enjoy and SHARE with 1M peeps! @webpagelink"},{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."},{"comment_id":"470490783141502","commenter_b":"Jail her useless ass dude. Fucking A","commenter_a":"@username Ha wow.","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."}]
