[{"comment_id":"10153362031969087","commenter_b":"BAN ISLAM! BAN MUSLIMS! CLOSE THE MOSQUES NOW!!!","commenter_a":"I see we owe the NRA and Republican a big thank you for allowing another mass shooting DROP DEAD YOU MOTHER FUCKERS","post_message":"\"Upwards of 14\" people are dead and \"upwards of 14\" people are injured after \"up to three people\" opened fire at a holiday party inside the Inland Regional Center building in #SanBernardino, California. WATCH LIVE:"},{"comment_id":"10152712999477293","commenter_b":"TLDR: Feels like whites now ae getting blamed for crimes 40-50 years ago. Sins of the father...","commenter_a":"Also.... why are so many white people offended/threatened by this?","post_message":"“When I started looking at the shocking absence of white faces, I couldn’t believe it.\""},{"comment_id":"636870959836816","commenter_b":"Good for her they should all be arrested where the heck is the National Guard?","commenter_a":"Need to arrest everyone on street. Thugs have taken over again ??? Let the police do their job . If they have to shoot a few of them so be it.","post_message":"Ferguson Protesters got in the way, so this patriotic driver does this.  Race rioters are out of control. They are the true menace to our society.  Are you sick and tired of race rioters?"},{"comment_id":"1159718984066336","commenter_b":"Hang that ugly devil.","commenter_a":"go figure","post_message":"Disgusting."},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"700735873407794","commenter_b":"No you dumb whore check history That would be the other dumb whore Hillary","commenter_a":"Why don't you just sit down and be quiet, because you haven't a clue hat you are talking about. You never experienced a thing of what you suggested, and doubt you know that history!","post_message":"According to the great celebrity-turned-philosopher Cher, Trump is now a genocidal murderer..."},{"comment_id":"831862046868801","commenter_b":"You're talking about deregulation. A completely deregulated market would allow child labor and would have zero worker protections, environmental protections, etc. They'd still buy government because they don't really want a libertarian free market. They want a \"free\" market that's rigged in their favor; that's where the real money is. You can't really separate capitalism from corporations trying to exert influence over government. It's the nature of the beast. You have to find ways, instead, to make those attempts ineffectual. Starting a business always requires capital... that doesn't mean you have to be rich, per se. \"Big guys\" have economies of scale that make them hard to compete with even when the market is \"free\". It's not impossible to have a monopoly in a free market and it's not impossible (indeed, it's likely) that you'll have collusion and cartel-like behavior. I mean, the government could step in to put a ...","commenter_a":"Wealth inequality isn't a measure of economic health. Wealth inequality is merely a potential for trickle. It's nothing to be afraid of. It's something to embrace and tap into. Let's tap into that with a free market economy. What are we waiting for? @webpagelink","post_message":""}]
