[{"comment_id":"1412904655446554","commenter_b":"You know joy what goes around comes around.I think she is only on tv because she is so nasty","commenter_a":"Enough is enough! Grow up and accept your new president you whining bunch of children! It's time to take either the hosts or the hosts off the air because they are to infantile to face reality!","post_message":"The heck!"},{"comment_id":"10154757524712300","commenter_b":"booooooooooooohooooooooooooo","commenter_a":"Got eeeem","post_message":"Anti-Donald J. Trump protesters gather at Bayfront Park (may contain graphic language)"},{"comment_id":"10153318281418984","commenter_b":"Racist and Illegal!","commenter_a":"Not very inclusive.","post_message":"Imagine a \"whites only\" field trip. Al Sharpton would be licking his chops and hopping on the first plane to Indiana.  Do you think what this school did is wrong?"},{"comment_id":"10152505642191770","commenter_b":"She finally bought herself some new boobs?","commenter_a":"People dont realize that both Kim K and Paris are shrewed business women.","post_message":"Remember Paris Hilton? She's back, and she's letting it all hang out."},{"comment_id":"997885863556217","commenter_b":"LOL -like a woman has time for that","commenter_a":"That was a woman who was all masked up","post_message":"The clinic staff say they aren't going anywhere"},{"comment_id":"710250332447494","commenter_b":"She's an idiot and should get out of our country","commenter_a":"what drug is she on ?","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In...  This must be some kind of sick joke.  Do you think she has completely lost her mind?"},{"comment_id":"10152756329021615","commenter_b":"I hope she was telling him to go home!!!","commenter_a":"For sure","post_message":"This video showing a mother slapping her son during the Baltimore riots is going viral...we're hearing what the police commissioner has to say about it now on Channel 11 Morning News.  SEE FULL VIDEO: @webpagelink LATEST: @webpagelink"}]
