[{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"},{"comment_id":"1134617029988407","commenter_b":"GET HER OUT","commenter_a":"Firer her now","post_message":"The death stare comes easy for her because she can blink with all those Botox injections she has had. How many of you wish this chick was on her way out? I know I do. @webpagelink"},{"comment_id":"463669483844276","commenter_b":"OHHHH.....now I understand. We have been talking past one another for half an hour.","commenter_a":"If Cruz is not a natural born citizen, but the offspring of two illegals who came here 2 weeks ago is, there is something SERIOUSLY wrong with our system.","post_message":"Ted Cruz was born in Canada and was a Canadian citizen until 15 months ago. Lawsuits have just been filed with more to follow. I told you so!"},{"comment_id":"10155201433711320","commenter_b":"There's no Native American blacks and Latinos in Eastern Europe. The perfect place for RACIST AMERIKKKA","commenter_a":"Yeah the country is being lead by white supremacy you people find this okay?? oh wait a minute...This is RACIST AMERIKKKA. WHAT more can you expect.","post_message":"This is a live look at Washington, D.C.  Are you pleased with what our nation's leadership is doing right now?"},{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."},{"comment_id":"10153782060807235","commenter_b":"i am embarrassed that this nasty little whore is from my home town. that is NOT the values we were taught in Newton, Massachusetts","commenter_a":"Imbecile!","post_message":"This makes me want to vomit..."}]
