[{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."},{"comment_id":"10155313897730231","commenter_b":"Oprah, don't do it!","commenter_a":"He need two jobs!","post_message":"Own gives reality show to man with 34 children. ‘Fix My Life’ coach to guide him during the show."},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."},{"comment_id":"10154525745813893","commenter_b":"Your right ILLEGAL immigrants aren't eligible for benefits but the assumed identity they use is! Again seen it first hand! The children who are born here (AKA:Anchor Babies) are also eligible. With that in mind generally mom won't get deported and OUR government will assist her in getting a temp visa to stay. Then guess what she becomes eligible for the same benefits. Illegal documents are created at flea markets etc.","commenter_a":"Well.... Will the ILLEGAL immigrants also be boycotting emergency rooms, welfare, etc. today? If so we could save millions of tax payer dollars today..... I won't be holding my breath.","post_message":"\"Due to insufficient staffing levels, we will be closed today. Please come back and see us tomorrow,\" Torchy's Tacos - Houston Heights posted on Facebook."},{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":" need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."}]
