[{"comment_id":"1059208864172624","commenter_b":"Sounds just like a female lol","commenter_a":"Obviously. Ignorance is bliss? But when will they see who he really is. A narcissistic sociopath. Will to nuke anyone who hurt his little feelings","post_message":"\"People who support Donald J. Trump are people who should be respected for how they feel, but I worry that they don't understand that they're being scammed. And that they're being scammed by someone who's really good at it.\"  - Mika Brzezinski, co-host of Morning Joe"},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"},{"comment_id":"1159189937449759","commenter_b":"WHAT DOES THE OBAMAS AND CLINTONS HAVE TO HIDE FROM THE VOTERS. THEY ALL REMIND ME OF ALI BABA AND THE 40 THIEVES BUNCH OF CRIMINALS DON'T TRUST ANY OF THE CROOKS.","commenter_a":"Gee, funny they can tell who hacked emails showing Democratic corruption but, they have not had any luck finding Hillarys missing 30,000 emails.","post_message":"Whoa!"},{"comment_id":"10154431251561491","commenter_b":"Well women really do do more domestic work.","commenter_a":"\"This is especially true for women, who researchers suggest should limit their work hours to 34 hours a week; men should limit hours to 47 hours a week. That because, according to Dinh, men spend less time doing domestic work.\" I understand not overworking ourselves...but y'all could have worked a little overtime to make this article a little more fleshed out and a little less sexist.","post_message":"Listen up, workaholics."},{"comment_id":"10153561023428984","commenter_b":"Go back home you stupid little bitch!!!","commenter_a":"Twitter Bomb her page till she leaves! REMOVE ALL of the spoiled \"idols\" your kids listen too, that say they Hate the Country that gave them the Opportunities to influence them!","post_message":"Globally known, pop-star diva Ariana Grande just told the world that she hates America... so karma just got its PERFECT revenge.  Her snobbery and selfishness are famous so this is not a huge surprise... she deserves what she gets."}]
