[{"comment_id":"606800519482594","commenter_b":"HILLARY you have no CREDIBILITY ! YOU LIE SO MUCH WE CAN'T TRUST YOU EVEN WHEN YOU DO TELL THE TRUTH YOU'VE LIED SO MUCH WE CAN'T TELL! SO GO POINT YOUR FINGER FULL OF BULL SHIT IN SOME ISLAMIC WORLD THAT BOUGHT AND SOLD YOURSELF TO ! DUMB ASS LIEING BITCH!","commenter_a":"This woman is a total disgrace to America and to all human beings!","post_message":"Hillary Clinton just said Donald Trump is too dangerous to be President of the United States. This is why."},{"comment_id":"10156552625375354","commenter_b":"Let me try this again without hitting the return button prematurely. The Hijrah is mandated in the Qu'ran. It seems to be proceeding according to their plan. So long as Merkel and her other Western apologists permit unfettered entry in their respective countries, Islamic conquest via mass immigration will have been accomplished even ahead of schedule.","commenter_a":"Islam is not a religion or a race. It is an illegitimate organized group of murderous thugs and has been since it began. Their modus operandi is always the same. The videos in the links are about Islam. @webpagelink . There is more here @webpagelink . Watch the first one. The second link has many more videos by Dr. Bill Warner.","post_message":"Tensions are rising on the Mediterranean Island of Corsica, a province of France, where authorities have banned all public protest..."},{"comment_id":"10153216710121051","commenter_b":"Piss poor radical Muslim a$$holes!","commenter_a":"Piss poor life guards...","post_message":"Lifeguards desperately wanted to save this drowning woman - but her father refused to let them do it."},{"comment_id":"10153376364371770","commenter_b":"These leftist thugs should go get jobs!","commenter_a":"Look at them. You can tell they are all scholars, have jobs, homes, and a lovely life. LOL.","post_message":"Protesters disrupted several of Donald J. Trump's events over the weekend."},{"comment_id":"906697222720307","commenter_b":"Only people with integrity should be allowed to immigrate to our country! If they don't respect our immigration laws, what other laws will they break? They must be ready to work and learn English to contribute to the economy and not leach off of the welfare system. Cut welfare and close the border. Enforce a high standard for admittance for immigrants .","commenter_a":"Yes","post_message":"Click to see where most American voters stand on immigration..."},{"comment_id":"10155223291794218","commenter_b":"Hillary didn't get elected. You're a victim of liberal ideology and the dumbing down of society.","commenter_a":"Section 212(f) of the immigration and nationality act of 1952 states: whenever the president finds that the entry of any aliens or of any class of aliens into the united states would be detrimental to the interests of the united states, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Any questions?","post_message":"The Department of Homeland Security says it will comply with federal orders not to deport detained travelers"},{"comment_id":"965206956824108","commenter_b":"Heena thank you for that original post. More level headed than many on social media. Personally I think Islam and Christianity are both a blight to our species- but it is your RIGHT to believe whatever you want. I'll gladly defend your right to be or believe whatever you want. I know Islam and Christendom view me as an abomination because I am gay- I think that is incredibly stupid but I still respect their right to believe it. There is no reason a female officer could not have dealt with this lady and, after checking for contraband, allowed her to keep it on.","commenter_a":"I'm so tired of seeing this article. I wear a hijab and I've been wearing it for 10 years and it's just as much my identity. But if I'm asked to take it off, I will. There's plenty of times I've been asked to remove it for security reasons and I comply, and that's not even because I got arrested. I'm pretty sure God isn't going to smite me for showing my hair to comply with the laws of the country I was born in and choose to reside in, which ironically gives me more religious freedom than living in a Muslim country. Is it entirely fair that this happened, probably not. A female officer could have taken her picture. But that didn't happen, and unfortunately being asked to remove your headscarf in a non-Islamic county doesn't amount to a violation of rights in the same way as it would ...","post_message":"“I’ve worn my scarf for 12 years and my religion says that I can’t take it off. It’s not just a religious issue; this is a part of me. It’s my culture, my life and my identity.”"}]
