[{"comment_id":"828484970520259","commenter_b":"What a stupid cow.","commenter_a":"A new low for commiecrats? Not so! The depths of their depravity know no bounds.","post_message":"A perfect example of the difference between Democrats and Republicans.  This is how they treat allies:"},{"comment_id":"10152983731016545","commenter_b":"Like all things. Just because it can be done, doesn't mean it should.","commenter_a":"What was he expecting? That's like going topless and wonder why people stare.. lol. People ask for attention only to flip once they get it.","post_message":"A Georgia man says he was harassed by police after openly carrying an AR-15 into an airport last week. Citizens are permitted to carry weapons in the open and public areas of the airport,  provided they do not move into the TSA-controlled secure areas of the airport property."},{"comment_id":"10154341988949203","commenter_b":"Hillary can gfh, I'm writing Bernie in!","commenter_a":"If you are for Clinton then you are for more jobs moving abroad. NAFTA, TPP, etc. It might be your job or your town next that is affected.","post_message":"Hillary Clinton has long pushed to regulate access to guns."},{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"10154310886941178","commenter_b":"Spanish came from Spain which invaded south and north america long,long ago.So yes,spanish speakers invaded,killed and stole land long before white people.Feel better now?","commenter_a":"All you Mexican flag holders need to go back to the country you remain loyal to. Only legal Mexican are loyal to the USA. We welcome the ones that come in legally to assimilate and make America their country.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."},{"comment_id":"10153294058536336","commenter_b":"There was a lot of blood shed and that's why this is disrespectful to the country of the Red, white , and Blue","commenter_a":"An upside down flags indicates distress and with your country's (lack of) leadership.. You are in distress...","post_message":"Do you find PacSun's shirt that pictures an upside-down American flag disrespectful?"},{"comment_id":"1362072713808008","commenter_b":"ROTFLMFAO!!! Opine from the woman actually wearing an \"A$$\" hat! You just CAN'T make this stuff up!","commenter_a":"The Judge is a lawyer for La Raza. He is literally a La Raza Grand Dragon.. He has literally helped many illegal immigrants break the law in this country. Donald Trump could go further and he didn't but when you start doing some digging this Judge doesn't seem like a very nice man. A lawyer for a group who has said many times to \"kill all white people\".. Okay.. Donald Trump could go further.. You may very well make him show his hand and there's a lot to show on this judge and the company he keeps. The ONLY racism here is of the judge and the people he represents. Imagine if the Judge was a KKK member presiding over a case that affected black men. You'd be outraged. You know you would. How is the Donald going to get a fair shake when the judge is soooo clearly biased ...","post_message":"By refusing to denounce Donald Trump’s attack on Judge Curiel for the racism it clearly connotes, it shows Senate Republican Leader Mitch McConnell is the poster boy for the Republican spinelessness that allowed Trump to be the Republican nominee for President of the United States.   Senator McConnell has so fully embraced Donald Trump that we are all unclear as to where Trump’s platform ends and Senate Republicans’ begins."}]
