[{"comment_id":"10154969261539575","commenter_b":"That's supposed to be the case","commenter_a":"I was once told that the firechief is boss of a fire what he said goes","post_message":"The Cannelton Fire Department chief was arrested after police say he shoved an officer multiple times at the scene of a fire."},{"comment_id":"1517455414941150","commenter_b":"So what was the cause of death?!-","commenter_a":"I think they were drugged while at the hotel bar. It is becoming more and more common in foreign countries to drug and even use ether to sedate people so they can rob them. I find the guy suspicious that said when he saw in the AM that their door was as he had left it he became worried. How did he leave it...closed like every other hotel room door? It's not like housekeeping found them. This guy called mgmt and they went in. Sounds suspicious","post_message":"The autopsy for the two American sisters found dead in their luxury hotel room determined there were \"no visible signs of injuries found on the bodies.\""},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"10153781629863132","commenter_b":"stupid girl","commenter_a":"I feel so sad for Anna and their four little M's","post_message":"Anna Duggar will likely not be leaving her husband Josh despite his admitted infidelity."},{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"1095660007120418","commenter_b":"good, dumb woman","commenter_a":"The tiger is a wild animal! What did she think would happen?","post_message":"Officials believe Jacqueline Eide, 33, entered a Omaha, Nebraska,zoo and tried to pet a Malayan tiger, which bit her hand. >>kiro.tv/TigerBite"},{"comment_id":"10152776744107217","commenter_b":"Vicki Wray better start thinking of other names 😂😂😂😂","commenter_a":"Beautiful names xxx","post_message":"#RoyalBaby: Introducing Charlotte Elizabeth Diana - she'll also be known as HRH Princess Charlotte of Cambridge"}]
