[{"comment_id":"10153193077162093","commenter_b":"Women choose their boyfriends over kids all the time. Its only when something bad happens they realize how STUPID they are. If nothing wouldve happened she wouldve kept doing it. Shame it takes something like that to open up some people's eyes","commenter_a":"Skin her and drop her in a lemon juice bath 3 times a day for life.","post_message":"The mom said she desperately wants to be able to go back and make a different choice about leaving the house that fateful day.... @webpagelink"},{"comment_id":"10156214701425725","commenter_b":"Look at the mad illegal alien","commenter_a":"Look at all the brainwashed Donald Trump fans... Lol","post_message":"Who is winning the debate so far (just last name)? #DemDebate"},{"comment_id":"10156207727725354","commenter_b":"another fucking scumbag please americans this has 2 stop we need term limits or our country is going down the tubes","commenter_a":"We want Trey Gowdy","post_message":"He's the odds-on favorite, but will likely face a strong and credible challenge..."},{"comment_id":"10153821104831336","commenter_b":"@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"10153554129132452","commenter_b":"#motivation","commenter_a":"Leydy","post_message":"Congratulations, Alfonso! The 96-year-old World War II veteran graduated from USC and is the oldest graduate in the school's history."},{"comment_id":"10153774397117098","commenter_b":"No!!!! SHE IS A LYING SKANK!!!!","commenter_a":"What the hell? So these dudes were sleeping with their coworker's underage daughter? That is disgusting.","post_message":"#BREAKING...  What we're just learning on KRON News at 5 p.m."},{"comment_id":"10152746460981636","commenter_b":"Feminists are heavily invested in the rape culture narrative, the fact that they always attack rape prevention shows this","commenter_a":"Did you dare to suggest that the onus should be on the perpetrators of rape instead of the victims? Prepare for a tirade of comments accusing you of 'calling all men rapists'...","post_message":"Perhaps the focus should be on the perpetrators of rape, rather than potential victims?"}]
