[{"comment_id":"504839586342663","commenter_b":"You slimy cocksucker","commenter_a":"The poor need to try harder","post_message":"\"We are the first generation in human history that can end extreme poverty.\""},{"comment_id":"10153469800395671","commenter_b":"The fact she had felony DUI charges in the waiting... leads one to think she has done this more than once. \"...facing felony drunken driving charges and cruelty to a child stemming from a previous incident.\" I doubt that she was so unlucky that the one time she went drinking then driving, she got into an accident and was arrested for DUI. This is usually a pattern behavior.","commenter_a":"Your not innocent when you drive drunk, multiple times. Your a murderous person that cares less about others even your own children! Wake up !","post_message":"The woman who was driving a car that crashed and killed five people this past weekend was facing felony DUI charges and cruelty to a child stemming from a previous incident."},{"comment_id":"1514259995548132","commenter_b":"... People do realize the article isn't about humans right? None among us can store the seminal fluid of various males and asses it for quality before choosing our baby daddy's, just FYI. ;)","commenter_a":"Rachel Pratt :)","post_message":"There's more to semen than just sperm."},{"comment_id":"10153337726654726","commenter_b":"IF she had ANY self respect, she would NOT be making a fool of herself and making up LIES for obaloser and the rest of the liars!!!","commenter_a":"It disappeared. Hmmm...","post_message":"WATCH: State Department spokeswoman is laughed at while trying to give Obama credit!"},{"comment_id":"1279992562041213","commenter_b":"Notice how he always gets phone calls telling him he's doing great...","commenter_a":"Your headlines are as misleading as the mainstream media...","post_message":"After how much Trump has frustrated America these last few months, it’s great to see the tables turned."},{"comment_id":"1042018525819158","commenter_b":"This ladies dumb AF","commenter_a":"It should have been there when it could have helped my husband before he died. It doesn't matter much now whether they develop it or not. It can't help him now.","post_message":"A breath test for lung cancer could be on the horizon."},{"comment_id":"10153876614269024","commenter_b":"Kick this fucker right in the mouth","commenter_a":"What a poor excuse for a Mayor.","post_message":"@conservativebyt"}]
