[{"comment_id":"988047007995144","commenter_b":"She's just womansplaining to him","commenter_a":"That stupid bitch next to him needs to respect other people's turn to speak. How are you going to disrespect another adult like that on national tv? Shushing him?? What a fucking cunt","post_message":"I've literally watched this about a dozen times now (and it gets better every single time)..."},{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"1297864100266083","commenter_b":"She is yuck. Big mistake!","commenter_a":"Lmao!!","post_message":"Well.   OK."},{"comment_id":"10154302113081509","commenter_b":"She had them surgically removed. She also doesn't have a brain or even a modicum of decency. And THAT is why she's running for office! Hellary 2016!","commenter_a":"Hillary would you like to have your husband also in prison ? Or else a dildo is enough ?","post_message":"Hillary Clinton had a message for a supporter's father who is backing Donald J. Trump"},{"comment_id":"10153219885266636","commenter_b":"Vicki Horn Bet she'll complain if her wages go down. But thats not her problem until its her problem.","commenter_a":"Don't really think the 'how quickly would we get free tampons if everyone stopped wearing them?' Is a very appropriate question. If you want to walk round with blood all over your trousers knock yourself out - think it's you that would look abit mental but it won't affect the government","post_message":"'How quickly would we get free tampons if everyone stopped wearing them?'"},{"comment_id":"1171664359552992","commenter_b":"Idiots...they should be training Americans how to protect themselves from Muslims","commenter_a":"Hahahahahahahah very funny","post_message":"@webpagelink"},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."}]
