[{"comment_id":"1873334889566400","commenter_b":"I'm thinking entertainment value. After he leaves office, it will be obvious what a loser he is.","commenter_a":"Idiot","post_message":"President Barack Obama plans to speak out when he believes he needs to during the presidency of Donald Trump."},{"comment_id":"10153994527466509","commenter_b":"Cnn is getting paid big time to support him.","commenter_a":"@username, is Trump paying you to write about him, not an hour passes by without you guys writing about Trump. Looks likes he is the only one running for presidency, can't even remember last time I saw a story about Obama. Please give everyone a fair playing field.","post_message":"Donald J. Trump is going to make a decision \"very soon\" regarding a third-party run, he says. @webpagelink"},{"comment_id":"1745739655705616","commenter_b":"The university should be pledging NOTHING for illegals! They are criminals. The university should be prosecuted for aiding and abetting crime!","commenter_a":"If anything, this should all be used for American students. They should be the first to receive help not illegals. This is wrong.","post_message":"University of California students criticised a university pledge of $25 million over 3 years to assisting illegal immigrant students as “not enough.”"},{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"1103535999742651","commenter_b":"she is at best...an annoyance...go home and look for russia...","commenter_a":"I spent ten years in the military just got home three years ago been through all sorts of problems and have been diagnosed for ptsd and through everything that's been going wrong since I've been back I still never not once didn't have control of myself even when I caught my ex-girlfriend of six years sleeping with a coworker of hers she started seeing when I was on duty.I just asked her to I'll say made her move out. And every brother from the core I was at salute President Obama and there were over hundred of thousands of us there so don't believe what people are saying here about the military disliking President Obama we salute you sir.","post_message":"“What did I say that’s offensive? I don’t regret any comment I made, because I didn’t lay PTSD at the foot of the president.\"  - Sarah Palin"},{"comment_id":"10154655715146037","commenter_b":"@username many!!! What parents dress their little girls like a sex queen? Um, JonBenet's and other child beauty pageant moms- $$$, attention, fame....","commenter_a":"I am inclined to believe the story to be true. There are just too many claims against Michael not to take them seriously. Not to undermine the victims, but the thing that I really can't grasp my head around is why the parents of all of these children that Michael victimized allowed their kids not only to sleep over at a grown man's home, but also to sleep in bed with that grown man?! This makes no sense to me and the parents of these kids should be held accountable for their actions.","post_message":"When he \"began showing signs of puberty,\" Jackson was allegedly \"no longer as interested in him sexually.\""}]
