[{"comment_id":"10152906216427522","commenter_b":"Freddi Birkhder you are too stupid to pour piss out of a boot even if the instructions are on the heel. The Cheney/bush thugs negotiated the withdrawal from Iraq you mindless twit. GFY","commenter_a":"Not surprised!!! Christians are being blown up!by Isis,and Obama is smiling!evil man.","post_message":"Yes, he too is reading Ta-Nehisi Coates' new book:"},{"comment_id":"10154069186973967","commenter_b":"Yeah how dare she have an opinion, why didn't your whore mother have that coat hanger abortion she wanted?","commenter_a":"Check your shit together before basing bias yo..she was more concerned about her own BS and not about Nintendo. Also you have to be THIS goddamn retarded to lose an awesome job at Nintendo","post_message":"Nintendo watched her become the center of a witch hunt and did nothing publicly to defend her."},{"comment_id":"10153414168399024","commenter_b":"it's a big city...Houston may have enough fag votes for that bitch, but Texas does not! The voters of Houston will wake up and dump the fag...","commenter_a":"My question is, how did a liberal get elected in....Texas.","post_message":"Of course, Annise Parker doesn't care what the voters think. Typical liberal. @webpagelink #tcot #ccot"},{"comment_id":"10154105809967908","commenter_b":"Feel the Bern! Gonna be the first time I vote thanks to this man Bernie2016","commenter_a":"Yes, it is appalling.","post_message":""},{"comment_id":"10152898604455927","commenter_b":"She will get away with her lawlessness","commenter_a":"As soon as you hold the Bush administration responsible for the millions of emails that disappeared in thin air.","post_message":"Hypocrisy abounds!"},{"comment_id":"907517025969130","commenter_b":"May she be he first to suffer any repercussions from this decision.","commenter_a":"I'd like to know what her retirement package is!","post_message":"UNREAL! RETIRING SENATOR IS 34TH VOTE TO CLINCH OBAMA WIN ON IRAN DEAL   Obama puppet..."},{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"}]
