[{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump.   Just who are these hooligans?  Lee Stranahan investigates..."},{"comment_id":"10153953305054170","commenter_b":"It's really too bad the 'Pinoccio' factor isn't for real, Hillary would have four foot nose by now to go with her bulging eyes! Having made statements in front of people and then denying it, shows that she that she thinks we're all stupid! Well the jokes on you Hillary 'Rotten' Clinton, you're the 'Poster Child' for stupid! Careful what you say 'Hill' people around you do have a memory!","commenter_a":"Nothing has \"doomed\" her yet, doubt this will...","post_message":"Hillary definitively busted in another lie, by the father of one of the Benghazi victims. The media will try their best to ignore this so we're going to have to do their jobs for them."},{"comment_id":"1806403532965541","commenter_b":"She's a hawk. And trump's an isolationist. So who's weak?","commenter_a":"Hillary Clinton must be stopped at all costs. Or watch more and more Americans Die under her weak administration","post_message":"Live: Donald J. Trump gives a speech on veterans' issues in Virginia Beach, VA."},{"comment_id":"1345080275507252","commenter_b":"I cannot believe how many selfish bastard whites live in this country that they stole from Mexico with a trumped up phony war. These selfish bastards all belong to the Repubtard party. which we need to destroy.","commenter_a":"Why do we have to pay for every disgruntled citizen from every country in the world.....you politicians have us deep in debt but want more from us....All you are doing is enabling irresponsible government around the world.....everyone sees the US as the international welfare program....we have too many of our own citizens who need to be cared for....and their violence is no worse than our own....","post_message":"I hope the administration reconsiders these raids. These children and their families are fleeing extreme violence in Central America and they should have a chance to seek relief, which is why I introduced the “Fair Day in Court for Kids Act” — a bill that mandates counsel for these vulnerable individuals. Instead of separating children from their parents, the administration should continue to address the violence and instability in the region that is forcing these families to leave."}]
