[{"comment_id":"10155015963219199","commenter_b":"Always use condoms jeez you never know who has it.","commenter_a":"This senseless act could have been avoided if we would have banned all Mustangs after the first Mustang ran into a crowd.","post_message":"Surveillance video shows a man on a bicycle in the Phoenix area being run down by a Ford Mustang."},{"comment_id":"1548076978821767","commenter_b":"@username Illegals are already criminals by definition.","commenter_a":"These liberal are making more and more people want to vote for Trump.","post_message":"Top progressives are terrified the Democrat mob attacks on Americans will send millions of voters running to Trump."},{"comment_id":"10153055610099877","commenter_b":"Do you see the sick people that are holding office? Beautiful child; disgusting/sick thought pattern to justify abuse.","commenter_a":"The mind can be a wicked thing!!!","post_message":"Republican lawmaker: Rape can be ‘beautiful’ if it produces a child.    Grio fam, do you think anti-abortion laws should make exceptions for victims of sexual assault?"},{"comment_id":"1349866401695684","commenter_b":"Ember Kellough When the left wants to bring in millions of illegals and Syrian's it isn't from having a heart but instead to eventually expand their voter base, all about power and control with the left. When they do gain that we can kiss our Country goodbye or stand up and fight them in another civil war. When over 60% of births are coming from liberals it's difficult to not see it coming. The commie left will turn America into another Detroit and Baltimore.","commenter_a":"Obama is: 1st.muslim 2.gay 3.communist Don't be surprised, he's doing exactly what he said, fundamentally transforming the country. America \"voted\" for this.","post_message":""},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"959095867528667","commenter_b":"I want to hear the story too","commenter_a":"Trump fix SS","post_message":"DML discusses the best way to fund Social Security, and how the media disrespects veterans.  Please watch and share."},{"comment_id":"10153863416478812","commenter_b":"Lmaooo @username","commenter_a":"@username @username @username Abbas Maki @username @username the title and the caption are hilarious! I feel bad laughing lmao","post_message":"UNEXPECTED VISITOR: An 83-year-old thought the loud noise she heard was just the weather. When she looked outside, she found a Ford Mustang parked…on her roof. @webpagelink"}]
