[{"comment_id":"10152785064574753","commenter_b":"Still, those girls can probably sue state of Montana.","commenter_a":"So when he was a sex offender where was social services to take the girls away! Now look at how he has damaged his grand children. He should be hung!","post_message":"A Montana man was sentenced to 200 years in prison for impregnating his 11-year-old granddaughter and sexually abusing her little sister. Although he was a previously convicted sex offender, authorities confirmed 55-year-old Makeal Shane Pruett was the legal guardian of both girls."},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"630659240427363","commenter_b":"See. Look at this fucking cunt here. ^","commenter_a":"As much as I don't understand the obsession with Pokemon Go, it's done more good than any public health initiative that that any state or federal government has spent millions.","post_message":"The health consequences of sedentary lifestyles are costing the US $27.8 billion a year."},{"comment_id":"10153180223152522","commenter_b":"Really? F... off! I rather vote for Clinton. (As much as I despise her)","commenter_a":"Hell no!","post_message":"Ryan was the man to unite the party in Congress. Could he do it again for the White House?"},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"10155089338768984","commenter_b":"AND WHY SHE NOT IN JAIL.","commenter_a":"Seat her in the last row.","post_message":"The Clintons' plan for President-elect Donald Trump's inauguration were just revealed, and it's leaving everyone speechless."},{"comment_id":"10155215673171337","commenter_b":"He better quit smoking crack with lamar odem","commenter_a":"Someone summon Bill Nye to drop knowledge on him.","post_message":"Um... what?"}]
