[{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog \"red alert\" in Beijing"},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"10154563996420575","commenter_b":"Obama had better shut and realize all America wants his ass fried!","commenter_a":"Oh, like he did?","post_message":"WOW! Obama says he hope TRUMP will be able to stand up to PUTIN. ---After getting steamrolled by Vlad for eight years!"},{"comment_id":"665938460232774","commenter_b":"heard it thinking it wouldn't be thattttt bad, me after: ok he's officially a pig","commenter_a":"Jasmine","post_message":"\"When you're a star they let you do it.\" -Donald J. Trump"},{"comment_id":"10153212648798690","commenter_b":"West & their illegal wars do. Racist Christine","commenter_a":"Dont go to Australia and the likes. There are a lot of other muslim friendly countries.","post_message":"\"The prime minister of Australia acted to firmly entrench in the national psyche not only that Australian Muslims are not to be trusted, but that Islam and Muslims are complicit in the 'death-cult' ISIL.\"  @webpagelink"},{"comment_id":"10152847429722623","commenter_b":"Yeah because throwing fish chunks attracts puppies","commenter_a":"Jessica Kennedy South","post_message":"Check out this photo:"}]
