[{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"10152884101260950","commenter_b":"Day. I love all animals.....and the nice part is.....nobody can stop me.","commenter_a":"Burn her ass. Grrrrrr. My compassion for animals is soooo much stronger than it is for humans.....karmas a bitch","post_message":"The woman allegedly set a terrier mix named Brownie on fire; the dog's burns were so bad, he had to be euthanized."},{"comment_id":"968715303188218","commenter_b":"There's a problem with this ???? Just a couplah boyz havin' some fun !!!","commenter_a":"Now thats how you settle a score without using violence. !","post_message":"This is NOT what fireworks are for"},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10153364439113010","commenter_b":"Marie, I know. That's what the vaccines are for - preventing hepatitis. I'm saying 1,000,000 people could've potentially lived if they'd had access to a vaccine, and a million is definitely more than two.","commenter_a":"Well done to the Senators who care about the health of California children!","post_message":"The California Senate passed a controversial bill that would require children to be vaccinated by eliminating the ability of parents to opt out of the mandate based on personal beliefs."},{"comment_id":"872258432910129","commenter_b":"Really Kathy? I can't believe any woman would ever even think of voting for the dumpster","commenter_a":"If you vote Hillary, you're voting for babies to be murdered, etc. She needs to stay home and clean house. She can't even do anything with her husband. How can she run a country.","post_message":"WATCH LIVE: Former NYPD commissioner talks about election day security  — who will win, Donald J. Trump or Hillary Clinton?"},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas.  @webpagelink"}]
