[{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":""},{"comment_id":"1108181272536216","commenter_b":"thats how i hid my virginity, yeah do that","commenter_a":"Cilian they're coming for reggie","post_message":"This is awesome."},{"comment_id":"10154462042369062","commenter_b":"Lmao... Con el nopal en la frente y encontra de illegales.... Everyone with a hispanic latino last names shall research theyre ancestry our families come from illegal immigrants","commenter_a":"We are not \"united\" and Trump is not racist. I am against illegal immigration and support Trump!","post_message":"It translates to, \"United Latinos: Don't vote for racists.\""},{"comment_id":"1756356877909889","commenter_b":"Go Trump!!","commenter_a":"Trump winns","post_message":""},{"comment_id":"10154466806054087","commenter_b":"Never heard of the cunt, what's his legacy (kissin obamas arse for the last 8 yrs","commenter_a":"That stupid ass gave one to Helen Degenerious ,she does help poor,but I think Hillary paid her millions to be on her show.","post_message":"President Obama awards VP Joe Biden the Presidential Medial of Freedom. (Photo: NICHOLAS KAMM/AFP/Getty Images). READ MORE: @webpagelink"},{"comment_id":"10154024404718352","commenter_b":"Does that look like a white family bitch???? Go fuck your self","commenter_a":"Truth is that Mom's don't know, my stepfather abused me from 4-12 and I never said a word till I was 19 although my mom asked us many of times had anyone ever touched us we always said No because not only was their sexual abuse there was physical abuse, we we're scared he was going to kill us or or mom would kill him we were worried we'd have no one... 10 is so young if she did have a stomach her mother didn't notice nor did her teachers until the birth.... All I can say is he'd be dead once I found out","post_message":"10-YEAR OLD GIRL BIRTHS BABY AT SCHOOL AFTER THINKING IT WAS JUST A TUMMY ACHE"},{"comment_id":"1168807776489304","commenter_b":"Mexico has a closed southern border. I'm sick of all those Mexican bigots! I love their food though.","commenter_a":"They learned it from their Parents. They're in middle school, they learned this hatred and bigotry long before Trump. The floodgates are just opening more now. 😑","post_message":"Middle school students in suburban Detroit chanted \"build the wall\" during lunch on Wednesday, hours after Donald J. Trump became president-elect, according to school officials."}]
