[{"comment_id":"10152870861243837","commenter_b":"You guys are brainwashed.","commenter_a":"Shows were priorities are. You guys should some great stories about our fallen heroes soldiers and what the community is doing to help but let's trade BBQ ideas. But that's Florida for ya. I'm sooo happy I moved to TX were we are actually having memorials ,recreations, events, to show the generations what our soldiers went thru. Houses here show proudly displayed flags. Remember the fallen for if it wasn't for their sacrifice we wouldn't be the land of free.","post_message":"Tips for people looking to fire up the grill on Memorial Day @webpagelink"},{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."},{"comment_id":"10152999953419205","commenter_b":"....They are racist too is hardly an argument. Plus copy and paste from KKK websites ain't the best source. Still laughing","commenter_a":"You mean whitewashed like how the democrat party did about their racist history? The party you blindly support like Pavlov dogs?","post_message":"Texas textbook publishers caught whitewashing American history"},{"comment_id":"10154726138223812","commenter_b":"Fact for cowards. Unlike political girly men now. ENFORCE LAW and ORDER--GO TRUMP. Law and order will be immediately restored. Immediately Trump start Rounding up, deporting illegal swine criminals, illegal swine drug dealers, illegal swine drug cartel members. This will solve a lot of the problems.","commenter_a":"How many clowns can you fit in your trunk Mr, King?","post_message":"Rep. Steve King, a conservative immigration hawk who has expressed skepticism about Donald J. Trump's shifting tone on immigration, says at Joni Ernst's Roast & Ride: \"I'm not only going to go into the polls and vote for Donald Trump in November, but I'm going to bring everybody I can with me.\" @webpagelink"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"800883556714802","commenter_b":"Rheemyck Contreras","commenter_a":"Lexx Kennedy can we get one","post_message":"WATCH: Black panther creeps up on a man not paying attention? Wait for it... wait for it..."},{"comment_id":"10154568274058690","commenter_b":"@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."}]
