[{"comment_id":"1104176122983583","commenter_b":"Fire her sorry Ass!","commenter_a":"traitor, as a senator you have more of a way of fighting for what you believe in than 99.9% of us ....Do what you were elected to do and stand up for flag and country, or get the h out of the goverment","post_message":"What?! Man!!!"},{"comment_id":"661111504079428","commenter_b":"They are eat up with the dumb ass !!!","commenter_a":"Whats amazing is that I know a lot of people that just love obama. What's the matter with peoples these days ???","post_message":"This group of police officers destroyed Obama, this is hilarious.  Great. We completely support these officers.  Do you support their stand against Obama?"},{"comment_id":"10153725058711178","commenter_b":"The tea party is NOT a criminal organization. Black lives matter IS a hate groups.","commenter_a":"There wouldn't be a black lives matter movement, if police brutality didn't exist.","post_message":"Is there a double standard in the media for the Tea Party and Black Lives Matter?"},{"comment_id":"10153080996873717","commenter_b":"Although I could actually care less about this flag, to call her a hero is a complete joke.","commenter_a":"I love how wmur calls the person who stole the flag an \"activist\" but not an extremist","post_message":"An activist removes the Confederate battle flag from the grounds of the state Capitol in South Carolina early Saturday morning. @webpagelink"},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"798433503628356","commenter_b":"What the hell is wrong with women???","commenter_a":"Well said Kimberly!","post_message":"Hundreds of thousands of Americans are marching on the streets of the nation's biggest cities for the Women's March"},{"comment_id":"10153973841258598","commenter_b":"She is a liar , a cheat, a murderer, and a disgrace to womanhood!!!","commenter_a":"FIRST WOMAN MURDERER!!! If she would kill innocent little American babies, what would she do to the rest of us?? Don't vote gender, vote for a great leader, vote TRUMP!!!","post_message":"Pro-Life Women Leaders: “We Can’t Celebrate Pro-Abortion Hillary Clinton as First Woman President”"}]
