[{"comment_id":"10153304939531350","commenter_b":"He's a combo look of Chandler from \"Friends\" and her ex-husband","commenter_a":"Courtney Cox marrying band member Johnny McDaid from Snow Patrol. My favorite \"Friends\" and my favorite band!","post_message":"\"She wants to be the flower girl, all the bridesmaids. She's very excited about it.\"  CC: The Ellen DeGeneres Show"},{"comment_id":"10154798309806002","commenter_b":"Women do it too!","commenter_a":"Why would u allow a man to babysit your kids hell no only man I'd allow is my father and my husband","post_message":"A 30-year-old man allegedly molested toddler-age children he was babysitting while living in Michigan."},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."},{"comment_id":"10154144883178984","commenter_b":"I liked Cruz before he started his dirty campaign, now I have no respect for him","commenter_a":"Trump gets more coverage than anyone especially at Fox. People should take a look at Ted Cruzs resume and determine who is the presidential one. It is the most Impressive I hAve ever seen. He is a man of integrity with a brilliant mind. No skeletons in his closet. He is a true conservative who lives by the constitution. That is why he battles in Washington because he lives by what is correct. Look at all the cases he has won. He doesn't fit the mold of Harry Reid and company. He bucks them all the time. America needs him now and if we let him Slip by it will be our loss. There is absolutely no one running that can fill his shoes plus he is a born again Christian and he will restore our religious beliefs back to the country and constitutional rights","post_message":"Bill O'Reilly met with candidates right after last night's debate, and there was one thing Trump said to him that immediately caught people's attention...  Do you think Donald J. Trump has been treated unfairly by the media?"},{"comment_id":"527181674109539","commenter_b":"Illegal immigration","commenter_a":"I wanna kick all of them out.. 100% every single one out. .","post_message":"A Pew Poll shows that 83% of the public believes the annual baseline level of legal immigration (1 million per year) should either be frozen or reduced."},{"comment_id":"458794547627679","commenter_b":"Hillary is not worthy of being president. Why would a progressive vote for her?","commenter_a":"These Sanders supporters that would rather see a Trump presidency were never Bernie supporters, they were Hillary haters. Any progressive ideas or policies would be set back decades with a Trump presidency. Not to mention how far back we would be set back with a conservative tilted SCOTUS. It is a sad day for this country. Donald Trump is going to be the next president. God help us all.","post_message":"Trump is in the lead? This is terrifying."},{"comment_id":"1022408774478552","commenter_b":"Why is she walking free?","commenter_a":"since when can a low life irs agent speak with the doj,fbi to cause harm to a tax payer","post_message":"Jaw-dropping abuse of power:"}]
