[{"comment_id":"906562849439968","commenter_b":"Can't wait for more racial division from this fraud. She's Holder with a dress on. Worst choice ever.","commenter_a":"Wonderful","post_message":"BREAKING"},{"comment_id":"1133136583393865","commenter_b":"what an ass!!!","commenter_a":"Pussy","post_message":"Dwayne The Rock Johnson just got candid about his struggles with depression. - Robbie Couch"},{"comment_id":"10156573724785294","commenter_b":"This sickens me! There are so many people in this world that would love to have a child and would never do this to one, why do these type of people exist???i think they should have the same thing done to them!","commenter_a":"Makes me sick!","post_message":"'This is just one of those cases that just shocks the soul...'  A babysitter accused of horrific abuse after a 3-year-old is found bound and gagged in his closet for \"being too loud.\" The girl's head was also shaved as part of a plot by her mother to make some money, police say."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"10153063599505950","commenter_b":"Hope they change the entire show. Take both women off tv and replace with meaningful entertainment.","commenter_a":"So nice","post_message":"Kathie Lee Gifford returned to TV for the first time since Frank Gifford's death: \"He passed away instantly that morning, all dressed in what he knew was my favorite outfit -- white shirt, very tight black jeans -- having his coffee, watching his TV, getting ready to go, ready for church, and excited about what we were gonna have for lunch.\""},{"comment_id":"10152865341779342","commenter_b":"Mexicans do deserve some credit so here it is. Murder up 67%- committed by illegal aliens Child molestation up 97%- committed by illegal aliens Rape up 53%- committed by illegal aliens Gang violence up 78%- illegal aliens Robbery up 62%-committed by illegal aliens aliens Car thieft up72% - committed by illegal aliens Economy down - contributed by illegal aliens Jobs down - contribution illegal aliens aliens Welfare abuse up 98% - fraudulent claims filed by illegal aliens aliens I could keep going but I think you get the picture.","commenter_a":"Want Mexican music go to Mexico. Pretty simple don't you think?????","post_message":""},{"comment_id":"10153236165233984","commenter_b":"Someone needs to sew a ZIPPER in her face!","commenter_a":"please STOPP","post_message":"Are you kidding me lady? Stop, just stop, please.  Do you think this new mandate is completely over the line?"}]
