[{"comment_id":"838126822975658","commenter_b":"I think it is very interesting when you look closely at all the photos of the refugees....you men, military age. ISIS? Muslim Extremists? Frightening to say the least.","commenter_a":"It is with glee and satisfaction i'm watching Europe's descent ito Islamic morass.They want to replace 6 million killed Jews with 40 million Arabs. Europe's punishment is Islam.","post_message":"\"Generous welcome by Germany created a strong magnet to bring millions of migrants from Asia and Africa to Europe.  This is sheer madness and it is dangerous,\" says Daniel Grynglas."},{"comment_id":"10153866679791002","commenter_b":"This is what happens when the majority of nursing moms thinks it's ok to expose their breasts while nursing. No, use a cover please. Yes, it's natural and better for your baby, but that's still a nipple being shown to the public...","commenter_a":"I don't think John was saying that children should be denied a family fun day. But, he is right, when the children are hot and fussy, they are no longer enjoying the event. They are miserable and they are making the person next to them miserable and you too. That's not fair to your child or the patron sitting next to you. I know parents want to see the rest of the game but, that's one of the sacrifices we make for our young children. Changing a soiled diaper in such close proximity is rude and plain nasty!","post_message":"The Cincinnati Reds are opening a nursing suite at their stadium for nursing moms who want to feed their little ones during the game.  Do you think the Detroit Tigers should have something like this?"},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"389899691198325","commenter_b":"No comment !!! But she better Pray that Her President doesn\"t get away with his Immigration Laws ??","commenter_a":"Get a JOB!!!!","post_message":"Another welfare queen...:/"},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"10153865270269749","commenter_b":"Gillian..you too are vermin! We must make sure that you do not breed indiscriminately!","commenter_a":"Foxes are vermin and very distructive for farmers, not the cuddly toys as always portrayed by the media. However what is the most humane way to cull them.. A bullet is best but only if you are a very good shot as a wounded fox can take days to die. Poisoning is also a slow death. Trapping is just as bad as they can take days to die or try and chew off their own paws. So it looks like there is no easy answer, and no we cannot just let them breed indiscriminately without some control as you would understand if you saw the havoc they can cause especially in the lambing season.","post_message":"\"Fox hunting is a pursuit from the past and like the overwhelming majority of the population I believe that is where it should stay, consigned to history.\""},{"comment_id":"1248799051839522","commenter_b":"Sue her!!!!!","commenter_a":"I didn't even read it","post_message":"You've got to be kidding!"}]
