[{"comment_id":"10156715676250725","commenter_b":"Reilly Steidle they're calling for you","commenter_a":"Lauren Lynn","post_message":"MTV is on the search for the next reality stars of the “Real World,” and fans living in the Chicago area have a chance to be a part of the show this weekend. How to apply ----->   @webpagelink"},{"comment_id":"10153653057081438","commenter_b":"Used to be, \"This may be upsetting to you.\" Then I would close my eyes. Yes, I get triggered, but it's not neuroscience to accommodate folks.","commenter_a":"Ovid yes and no. EVERY single one of the stories includes silencing of one kind or another-- often violent, often sexual violence. But it is a political poem by an exiled poet who was being silenced. HE tells a story about a bad (silencing) king and then says something directly to the emperor-- \" And you oh Augustus...\" Zeus was a rapist but he does not get praise for his philandering; his wife punishes the victim (the mother of nearly every demigod) since her husband is in power, but some god or goddess usually intervenes. Those rapes or dalliances are metaphorical for deeper political angst in Rome.","post_message":"Some professors believe trigger warnings build trust. Others think they stifle free discourse."},{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"928001893961910","commenter_b":"Thank you Rubio for all your hard work. God bless you and your family.","commenter_a":"NO RUBIO ND NO CRUZ.","post_message":"Marco Rubio is a friend and a colleague who ran an optimistic campaign focused on the future of our party, conservative principles, and uplifting the American people. The Republican primary was stronger because of the ideas he brought forth.   Marco’s story embodies the promise of our great nation. I know he will continue to be a champion for limitless opportunity in America, and I wish Marco, Jeanette, and their four kids the very best."},{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"10153143510309575","commenter_b":"That's a woman?","commenter_a":"Good","post_message":"An Indianapolis mother was sentenced to 60 years Friday in connection with the death of her 2-year-old daughter.  In January, she was found guilty of murder, battery and neglect of a dependent."},{"comment_id":"1445788068782419","commenter_b":"If that bitch wins it will not be USA any more cause she will screw it over and over. Immigrants will take over.","commenter_a":"Never Hillary","post_message":"ELECTION POLL! Who should win the 2016 Presidential election?  LIKE Qpolitical for the results."}]
