[{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"1705131916440587","commenter_b":"Hillary has a mouth just like her, ask Hillary sec service or help!! She is no lady","commenter_a":"Dr. Ben Carson is a class act, the women of the view are an embarrassment to women everywhere & the show should be taken off the air!!!","post_message":"Whoopi Goldberg is just plain GROSS...   I hope this means the end of The View!"},{"comment_id":"10153904523824705","commenter_b":"ask your \"celebrity\" wife to hand over some cash","commenter_a":"Boohoo rich boy! Would he have helped me out of my problems?","post_message":"#SaveKanye"},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"},{"comment_id":"500607250129855","commenter_b":"Smoke them if you got them, probably can get the best shit.","commenter_a":"This right wing crap. I am right of the right and this is crap","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10154691366756130","commenter_b":"She should be ashamed of herself!","commenter_a":"Funny and sadly accurate","post_message":"She got answers all right."},{"comment_id":"10153741874696037","commenter_b":"For the girl on the left id dress however the hell she wants.","commenter_a":"\"Let's have a Hawaiian theme party but please don't dress like these guys. We don't wanna offend the Hawaiians. That's not nice\"","post_message":"The UCLA student newspaper, The Daily Bruin, reported that guests came dressed in baggy clothes and gold chains for a \"Kanye Western\" party."}]
