[{"comment_id":"1092002180891914","commenter_b":"Tiny little penis","commenter_a":"Piece of shit","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154341383138067","commenter_b":"yeah,I think it is a great idea because Arnold make America ruined again and Donald make Apprentice again","commenter_a":"Publicity stunt. Stay tuned America","post_message":""},{"comment_id":"550023351824286","commenter_b":"Funny Denis.","commenter_a":"Good for North Korea, we have missiles why can't they","post_message":"The rocket was launched on a southward trajectory, as planned, passing over Japan's southern Okinawa islands."},{"comment_id":"352745464928968","commenter_b":"Her lips weigh more than my kids\"!!!!","commenter_a":"Who cares what she wants. She needs to minf her own business.","post_message":"Michelle Obama Wants to Weigh Your Fat Kids"},{"comment_id":"1346176708775407","commenter_b":"Tell that to the two","commenter_a":"God had promised us He will not wipe out humans on the face of the earth any longer therefore the doomsday theory can NEVER happen. It is just a figment of imagination in the mind of the writer of this article. I will rather suggest he asks 'what would happen if Rapture takes place now?","post_message":"What the world would look like if doomsday struck and humans were wiped out"},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"1424339400924900","commenter_b":"Why would she want to debate that arrogant old man?","commenter_a":"I heard that it is against DNC rules for this type of debate. Sanders has become irrelevant and desperate - so sad - he could have created a legacy instead of angry tantrums","post_message":"He just called Donald Trump's bluff."}]
