[{"comment_id":"1026880740704736","commenter_b":"Crazy runs deep in that family","commenter_a":"Still 'illegal' still a liar and still not eligible for being in Congress or running for president...","post_message":"Da'fuq?"},{"comment_id":"10153706069823717","commenter_b":"Best part about this is her age, she's not an 18 or 20 year old like most ad models.","commenter_a":"Oh thank heavens. The world is a safer place.","post_message":"People magazine has named Jennifer Aniston the \"World's Most Beautiful Woman\" for 2016."},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."},{"comment_id":"1360485817324205","commenter_b":"She is so stuck on herself. She thinks she's some sex goddess that's all she talks about. Blaaaaa get her gone I say!!!","commenter_a":"Dennis, please read the below with your comments","post_message":"SEAN STRIKES BACK AT MEGYN.  Good.  Now she's at odds with Hannity & O'Reilly.  See what Hannity wrote to her:  @webpagelink"},{"comment_id":"10152573206214071","commenter_b":"You are correct @username people like Sarah Palin and her lambs cannot be fixed.","commenter_a":"Go a way!!! Don't want a dumb president like that!!","post_message":"'Murica is hyped!"},{"comment_id":"1678495722420749","commenter_b":"She's a POS!","commenter_a":"Um Killery! Benghazi is in Libya!!! You are responsible (Culpable) for 4 Americans dying needlessly over there on September 11 2012! You are a Lying POS!","post_message":"Hillary Clinton did not mention the four Americans who were killed in the Sept. 11, 2012 terror attack in Benghazi."}]
