[{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."},{"comment_id":"1424826404224494","commenter_b":"Evil creeps just like their daddy.","commenter_a":"Assholes someone needs to hunt them down !!","post_message":"Madonna just called out Donald Trump’s privileged sons and it’s EPIC."},{"comment_id":"10153573077978352","commenter_b":"Christina you're dumb","commenter_a":"Te'ron Walker because most black people blame whites for everything. When no white people alive today had a damn thing to do with the past. Not all white people are racist. There are plenty of black racist people though because all whites \"owe\" blacks every damn thing when we're not the ones that had anything to do with anything that happened before. Y'all need to take that shit up with all the dead white people. Oh, and the blacks too since whites weren't even the ones to START damn racism. Ignorance is bliss people.","post_message":"High school principal fired after racist outburst at ‘all the black people’ leaving Georgia graduation ceremony early"},{"comment_id":"475003736018845","commenter_b":"He SHOULD WORRY ABOUT DOING HIS JOB! ALSO, STOP BEING A RACIST @webpagelink","commenter_a":"Thank you Mr President for being the last President w class and dignity. Im very pleased w what youve done thats affected my life these past 7 years. Too bad Congress coukdnt back you more.","post_message":"Extreme voices in the Senate shouldn't stand in the way of a fair hearing for the next Supreme Court nominee. @webpagelink"},{"comment_id":"426004474226175","commenter_b":"Oh, and fuck Conservatives. They're the ones who started anti-gun laws. Reagan and the NRA (racist hypocrites) got restrictions for firearms in California in response to the Black Panthers having a PEACEFUL open-carry demonstration. If Obama did the same thing to OPEN CARRY California, you'd probably be screaming for his head on a pike.","commenter_a":"Killing people sanctioned murder to satisfy blood lust and a wanting for revenge. Sounds pretty medieval and 3rd world to me.","post_message":"We traveled the world to ask people about the the death penalty."},{"comment_id":"10154542806314497","commenter_b":"Andrew Wright","commenter_a":"This title Matt Strzalkowski","post_message":"Via ClickHole:"},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"}]
