[{"comment_id":"10154789649578256","commenter_b":"@username. Does a strong woman and her opinions scare you?","commenter_a":"This just makes me laugh at how low the democrat communists have slunk.","post_message":"Donald Trump knots his ties so that they hang well below his belt buckle — often several inches, a fashion-don't so egregious that GQ recently used it as the subject of a photo spread titled, \"The one style lesson you can actually learn from Donald Trump,\" columnist Eric Zorn writes."},{"comment_id":"969391529750304","commenter_b":"Even a whore has the right to decide when she has sex!","commenter_a":"Following a celebrity back to their hotel room doesn't make you ambitious. It makes you a whore.","post_message":"This is the side of the Bill Cosby rape scandal that hardly anyone is talking about  but everyone should."},{"comment_id":"10152764552031491","commenter_b":"Yes. A woman can be a missionary or a nun. But why not be a priest too? Why is this off limits? What is it about women that make them unacceptable?","commenter_a":"Ponder on Mary's llife. have a virtue of humility. For the women, if you have calling to the religious life, you can be a missionary or contemplative nun. Be prayerful anyway, the right of women is not violated instead it is transcen! Pray for the gift of wisdom and understanding. Long live Pope Francis!","post_message":"Pope Francis gave a firm no to female clergy, while saying he wants to see a “greater role” for women in Catholicism."},{"comment_id":"10153171021535950","commenter_b":"she gave him head while the lieing bitch watched and then joined in!","commenter_a":"From many people that know them personally, he has a few girlfriends. One in Canada. It's a marriage for show only.","post_message":"The United States' ultimate political power couple, Bill and Hillary Clinton, celebrate 40 years of marriage today. Their marriage certainly hasn't been all smooth sailing..."},{"comment_id":"509597579189019","commenter_b":"Her Christ has lice...","commenter_a":"good, hope they all empty their bank accounts and go belly up","post_message":"Hate can make people do stupid things... - Andrew"},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"1817582348453684","commenter_b":"Fuck me there is a lot of racist humans on this tread","commenter_a":"He should get custody","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"}]
