[{"comment_id":"1176638305726030","commenter_b":"My mother told me to never argue with the peasants. I am sure that is what most liberal mothers told their children while most conservative mothers were too busy cleaning their guns in hopes of putting another possum on the table for their snaggled toothed brood.","commenter_a":"I love that all of Killarys posts are getting roasted! Even the left can no longer argue for this traitor! #HILLARY4GITMO2016","post_message":""},{"comment_id":"1216368028409389","commenter_b":"Allyson the bitch","commenter_a":"Donald the Clown and his Republican surrogates will lose big time !! Only imbeciles will believe he stand by working class Americans","post_message":"I stand for ALL AMERICANS! Deplorables, basement dwellers, I stand for ALL of YOU!"},{"comment_id":"10156219984965725","commenter_b":"Go home. You're drunk.","commenter_a":"WE NEED TRUMP!!! #Trump2016","post_message":"Signing my tax return...."},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is \"seriously interested\" in running for president in 2016."},{"comment_id":"463711880486059","commenter_b":"Not in my world, just send them all anywhere else but America. Muslims Need To Go. .....Get Them Gone.","commenter_a":"NO !","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10153091761007016","commenter_b":"Please take me off Your facebook","commenter_a":"Obama: Pardon Chelsea Manning","post_message":"\"The U.S. intelligence community is in a very poor position to be trusted with protecting civil liberties while engaging in intelligence work,\" writes Manning. \"When you’re a hammer, everything looks like a nail; when you’re a skilled intelligence professional, everything looks like a vital source for collection.\""},{"comment_id":"10153193077162093","commenter_b":"Women choose their boyfriends over kids all the time. Its only when something bad happens they realize how STUPID they are. If nothing wouldve happened she wouldve kept doing it. Shame it takes something like that to open up some people's eyes","commenter_a":"Skin her and drop her in a lemon juice bath 3 times a day for life.","post_message":"The mom said she desperately wants to be able to go back and make a different choice about leaving the house that fateful day.... @webpagelink"}]
