[{"comment_id":"10154228719381545","commenter_b":"I, personally, am quite capable of disliking people of ANY color, @username, if the person deserves it. Stop with the cries of racism because somebody doesn't like a person born with more melanin. I would despise that woman if she'd been born gold-leafed. You're a relic. 'Cut it out.'","commenter_a":"I for one can't wait till they are gone. The money she spent from our taxes is overwhelming. And her lavish vacations are a discrase. I could go on bit I will stop there. Good bye get out!","post_message":"There are certain words that have been used to describe Michelle Obama: Open. Authentic. Unapologetic. It’s that last one that Oprah Winfrey zeroed in on."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be \"rebooted,\" in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"1240022466017781","commenter_b":"@username Yes, but less human.","commenter_a":"The correct term is undocumented immigrants. It is not right to say illegals. We are all part of the human race. As an American born citizen I say that Trump is wrong. Undocumented immigrants are very important to our work force. They work very hard. Some work harder than those born here. If we send all undocumented immigrants back it would put this nation under. Yes we have a immigration problem. But fix it the right way. Undocumented immigrants deserve a chance as we all do to live in a country like ours.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10158374011905206","commenter_b":"Sucks to suck Donald Duck","commenter_a":"Trump has created more jobs in New York than any politician, yet they screw with him because..... You know ..... Politics.","post_message":"The Attorney General ruled that the Donald J. Trump Foundation had been raising cash in the state this year when it wasn’t registered to do so — a violation of state law."},{"comment_id":"731399806958628","commenter_b":"SUSIE ROTTEN CROTCH...and NASTY ASS LITTLE BILLY...Mommy needs a ass beating by daddy. Because you know it is the nutty woman who thought up the bullshit.","commenter_a":"IF LITTLE SUSIE ROTTEN CROTCH AND NASTY ASS LITTLE BILLY DOES NOT HAVE THEIR SHOTS...DO NOT TREAT THEM OR LET THEM IN PUBLIC SCHOOLS....PERIOD.","post_message":"More docs are refusing to see families that don't vaccinate."},{"comment_id":"10154200313034411","commenter_b":"@username do explain which nation was exterminated, and you're a unwelcome imigrant in south africa, you will also get what you sow, dickhead","commenter_a":"England never apologized for any war crimes during Imperialism era ...bcoz they are too fucking arrogant and Egoistic goons !!!","post_message":"During the Second World War, Ireland remained neutral and successive Irish governments were openly belligerent to British interests (Op-Edge by Bryan MacDonald)"}]
