[{"comment_id":"10154462849065695","commenter_b":"True and at the end of the day she going to be black im going to be white and nothing can be done about it. Oh and what the crap about drunk like most white girls? Yes that is a stupid remark","commenter_a":"Wow Sabrina why even make it a race thing.","post_message":"Police are asking anyone with information about what happened to Brenda Arreguin to come forward."},{"comment_id":"10154496192470329","commenter_b":"Jools pls","commenter_a":"@username u at ginger boy","post_message":"Are hand jobs back and better than butt stuff? Is this 9th grade? LET THESE TWEETS DECIDE."},{"comment_id":"10153024604841037","commenter_b":"Black people should pay more TAX","commenter_a":"Poor Bill, women coming from everywhere trying to get a payout. I believe you Bill.","post_message":"A model who claims #BillCosby assaulted her at the Playboy Mansion met to pursue criminal charges"},{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."},{"comment_id":"10153350973886051","commenter_b":"She lost !!","commenter_a":"that Aunt is a brain dead moron. She doesn't deserve to have any family members.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"10153519151958984","commenter_b":"Leave the park alone, it should be a safe haven for enjoyment; TAKE THE BLACK BITCH DOWN, she has no business being there with that attitude.","commenter_a":"There is so much STUPIDITY in the world anymore. I don't think we should discriminate by race or religion but could we just get rid of the stupid people!","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful.  The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"10153735112473984","commenter_b":"No joke you heathen bitch.","commenter_a":"Let's make an example of liberals and nonChristians by getting rid of them permanently. Bullets are cheap.","post_message":"For Kim Davis, this is Day 5 of her incarceration - but her lawyers just made an announcement that could turn things around.  Do you support Kim Davis?"}]
