[{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"453510694837224","commenter_b":"I love it! muslims do not belong within our borders!","commenter_a":"Arkansas get on the ball, and do the same.","post_message":"If you don't like our laws and constitution...we can help you pack and leave!!!"},{"comment_id":"10155813559759778","commenter_b":"Very heartbreaking and moving commercial...but unfortunately there still has to be something done about ILLEGAL immigrants coming into America. The Mexican President Enrique Pe Nieto could do something to help make their country better so the Mexican people would want to stay in their own country. I am sure he doesn't mind allowing the criminals to come here and apparently he doesn't care about the poor either, but something has to be done to protect our America.","commenter_a":"I loved it. Saw the ending...Touching.","post_message":"Budweiser isn't the only company to tackle the politically heavy topic of immigration in their Super Bowl commercial this year."},{"comment_id":"446887825521787","commenter_b":"Brake down that Wall Pope. Take some muslim refugees in. Oh that's right, Vatican wall built in the 800 century to keep muslims from killing you. Now it's ok if muslims kill Americans.","commenter_a":"a huge wall around the Vatican, not to mention armed guards. Donald Trump is the only one who wants to protect Americans. The Democrats would let this country run wild. Turn it into a third world country. Pope Francis is not sounding very Christian to me.","post_message":"Thank you Franklin Graham."},{"comment_id":"10153122540893984","commenter_b":"This lady need to go and get a life !!!","commenter_a":"She hit the old nail right on the head! Hopefully, this congress will \"grow a pair\" and knock him right off his \"High Horse\"!","post_message":"This lady's fightin' words will get your blood flowing on a Monday.  Do you support this kind of boldness on Fox News?"},{"comment_id":"10153763916386320","commenter_b":"Who cares? All cops should spend one day arresting all the illegals in NJ and we wouldn't have this problem. All illegals should be made uncomfortable by cops and regular citizens alike.","commenter_a":"and again until you've walked in a cops shoes you don't know what it's like! They deal with scum of the earth a lot and there hands are basically tied. It's a shame and it's frustrating. I did not watch the video and I don't plan too. I'm Sick and tired of orople picking on the cops. Yes I'm sure there are some that aren't the best but most of the cops are good. Start celebrating the good cops for a change!! But sadly no one seems to be recording when they are doing something good","post_message":"A New Jersey cop goes off and is caught on video saying racial comments to three Latinos. Watch here: @webpagelink"},{"comment_id":"10153002903836323","commenter_b":"Aaaw u want him to suck your lil prick?","commenter_a":"Fuckin Jew cock sucker","post_message":"Rupert Murdoch has been strongly criticised after tweeting that “most Muslims” – even if peaceful – must be held responsible for the religion’s “growing jihadist cancer” in the wake of the terror attacks in France."}]
