[{"comment_id":"10152512377042377","commenter_b":"RINO !","commenter_a":"He'd be bad for the workingman","post_message":"Romney 2016???"},{"comment_id":"389873387803923","commenter_b":"Really professional. I do (NOT) want her in the White House.","commenter_a":"I think she committed political suicide.","post_message":"Did you find this picture offensive or irresponsible for someone in her position?"},{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"},{"comment_id":"966056150146121","commenter_b":"Slow learners. Blacks keep voting Democratic even though Dems have done nothing but baby them and keep them down.","commenter_a":"They STILL haven't learned about the democrats !!!!!!!!!!!!!!!!!","post_message":"LANDSLIDE"},{"comment_id":"10153340551136336","commenter_b":"I don't believed this syory","commenter_a":"If this is true, Airlines are about as out of control as the cops and tsa themselves are.","post_message":"“You wouldn’t want to watch your family member crawl onto a plane, I mean come on, this is America.”  Theresa Purcell said the American Airlines gate agent made her crawl because it was too late to set up a ramp for her to board."},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"}]
