[{"comment_id":"1802927083306226","commenter_b":"Well you got what you wanted...he called Illegal Aliens, \"Guests\" Now wallow in it.","commenter_a":"Only people glad he's gone are the criminals and illegals","post_message":"LIVE VIDEO: There's a new sheriff in town as Paul Penzone is sworn-in as Maricopa County's 37th sheriff after defeating Joe Arpaio in November's election. Arpaio served as sheriff for the last 24 years."},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."},{"comment_id":"10153815392947293","commenter_b":"She have bipolar disorder.","commenter_a":"Please be kind when commenting. Even if you don't like her, she is a real human being, who has had significant struggles with mental illness. She has family and friends who are worried and scared.","post_message":"Sinead O'Connor has been found."},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims.  Norway made a brave move, now the rest of the world needs to follow their example.  Do You Support Muslim Deportation In The United States?"},{"comment_id":"1279009012178004","commenter_b":"Fuck that girlfriend","commenter_a":"I woulda just gave her the pipe since the gf it a dumb bitch anyways","post_message":"Dude passed the test!  #WSHH"},{"comment_id":"10153350460578690","commenter_b":"Haha innocent people. You're funny Ceyda. A Muslim living in Germany saying hitler, who is dead by the way, should finish all the Jews. I hope the west wakes up to the problem of you disgusting vermin and destroys you. You have been sent by the devil through your peodo prophet.","commenter_a":"This stupid Israelis how long would they continue harming innocent people Israel is behaving as if even that land is there's forgetting then were also refugees I wish Hitler could finish all jews","post_message":"Anyone who's received a letter has 30 days to leave Israel. If they refuse to leave they will face a hearing to determine their indefinite imprisonment. @webpagelink"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""}]
