[{"comment_id":"1110152195742243","commenter_b":"IF Hillary does get in I cannot wait to see people like YOU have to bend over and grab their ankles because of all the Radical Muslims and Syrians she plans to bring into the USA. Within her first 100 days she wants totally open borders and wants to bring in a minimum of 65,000 more Syrians. And within her time as president she plans to bring in a minimum of 1 MILLION Muslims! ....IF Trump does not get in, you can kiss your azz goodby and say hello to ILLEGALS, MUSLIMS, THUGS, and SYRIANS who will rape (you and your family), rob, and want everything you have worked for...........and they will get it! .The USA will go into total bankruptcy, and become a totally socialist nation!............IF this happens, Just Remember: \"I Told You So\"....AND YOU DESERVE IT!","commenter_a":"Republican nominee Donald Trump disdain for the American worker is legendary at this point. He been caught refusing to pay people for doing their jobs, told them that they don deserve a minimum wage, and offers benefit plans that actually won help working families, and scammed thousands of Americans out of their hard-earned money with his fraudulent . He doubled down on insulting the American working class in a truly insulting fashion earlier today when speaking about how too many Americans are working two jobs just to make ends meet, but told the crowd that , I working harder also, so I don feel sorry for any of you. It true. You think this is easy? Mr. Trump has never truly done a day of in his life. After graduating from his high-priced university, he was given a loan of a million dollars from his father, with which he began ...","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"10155076639181337","commenter_b":"@username Delete yours Racist POS","commenter_a":"How many time during his presidency was Obummer on Fox? So I don't blame trump for not wanting to deal with CNN and their fake reporting.","post_message":"Fox News defending CNN?? Donald J. Trump has inspired the impossible."},{"comment_id":"10154355156798812","commenter_b":"Yea these are the very perverted people that will claim to be transgender to gain access into bathrooms...","commenter_a":"The list of perverts who video people in bathrooms is long and does not just stop at Target! My local Old Navy had a perv filming a young girl while she was in a dressing room--her mother caught him in the act. These are not transgenders. These are simply perverted people! I am safer in a restroom with a transgender than I am with \"straight\" people! Transgenders are NOT peeping toms! If men dressing as women and claiming they are transgendered to assault little girls in bathrooms, then maybe there needs to be an anti-creepy men bill, not anti-LGBT bills, targeting Transgenders.","post_message":"Protesters inside North Carolina's statehouse staged symbolic sit-ins outside the offices of top legislative leaders."},{"comment_id":"10153103195541491","commenter_b":"Clearly a publicity stunt again, the shark is obviously a mate of his","commenter_a":"fake shark..","post_message":"Mick Fanning had another close encounter with a shark."},{"comment_id":"10153797001880329","commenter_b":"This bitch you can order your kid what you want ...she's ignorant as hell I would have whooped her ass","commenter_a":"It was called marcy's diner in maine and this is what the owner posted. Threatening to get physical. She is a dumb cunt. And this is someone from maine.","post_message":"Neugebauer's diner has recently become the center of a massive controversy after she yelled at a screaming child."},{"comment_id":"10153280384163812","commenter_b":"Stfu bitchass","commenter_a":"Time to eliminate this threat to life.","post_message":"He's back, but this time, instead of just going for a leisurely stroll, Goliath the massive alligator is spotted trying to eat an entire turtle on his Florida golf course: @webpagelink"},{"comment_id":"532019336988646","commenter_b":"I'm not catching that disease from her","commenter_a":"Fuck that bitch","post_message":"Michelle Obama thinks you should do this instead of going to church.  She is a disgrace. Get her out of the White House please.  Do you agree Michelle is an embarrassment?"}]
