[{"comment_id":"10153361671334032","commenter_b":"There's a huge difference between hearing loss and deafness. Its nothing at all like your eyes that are fixed with glasses. Patti. There are resources. Tomorrow if I can remember and find this again I'll list them or PM you. I don't know what the current name for the former Self Help for the Hard of Hearing. I'm not sure if you still have hearing aids. If you do find a good audiologist ASAP and don't stop until you find someone who treats you like you are their only client and their business dependent on your satisfaction. Anything less you shouldn't accept. If you can ever afford new hearing aids you MUST get digital. They don't know how long the current ones last. They haven't been out long enough to start failing. 10+ years for the current Gen. The biggest and very common thing people with hearing loss do is ...","commenter_a":"I just want to interject that driving while hearing impaired is not any more dangerous than while hearing. Your freaking out while driving is only in your head.","post_message":"What could just one day with a slight hearing loss teach a woman about what it's like to live every day without one of her five senses?"},{"comment_id":"10152963225776135","commenter_b":"I don't have daughters. I have sons. I teach them to keep their hands to themselves. When they're old enough to date, they'll be taught not to touch a woman unless invited. We shouldn't have to tell girls how to not get raped. We should be teaching our boys to not rape.","commenter_a":"When I was becoming old enough to go to parties as a teenager my mother started giving me the heads up about how to act when I went to out. One of the things she taught me was never drink so much that you lose control of yourself, watch who you accept drinks from, don't go to rooms with beds with men, etcetera. I'm curious as to what other mothers tell their daughters? And as a mother of sons around this age I wonder why the guy gets charged with rape if they're both drunk? Doesn't seem quite right to me.","post_message":"Former Tigers pitcher Evan Reed has been sentenced to probation after accepting a plea in his assault case. The victim strongly objected to that plea in court. VIDEO here: @webpagelink"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."},{"comment_id":"603295489861030","commenter_b":"Willie is anti-gun. Doesn't really matter what else he says, Willie can go to hell.","commenter_a":"Go getem Willie.....","post_message":"Willie Nelson just made this huge stand against Obama.  We stand behind him 100%. Let's show him our support.  Can we get 10,000 'LIKES' for Willie Nelson?"},{"comment_id":"1379025478784145","commenter_b":"These r not protest they r riots","commenter_a":"They need to throe away the flash bang and prepped spray and use real ammo","post_message":"Seattle May Day protesters threw flares, bricks and Molotov cocktails, while police returned fire with flash bangs and pepper spray.  More here: @webpagelink"}]
