[{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"10152561774511813","commenter_b":"Gigantic assholes.They should both be ass-raped, and have the first miracle ass-babies. See how they feel about the issue then.","commenter_a":"ACLU Are you helping folks like this from gov't overreach? @webpagelink","post_message":"Are these people who we want to make decisions about a woman’s reproductive care? Tell politicians: don’t turn back the clock on women’s healthcare. @webpagelink"},{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"1258337087519652","commenter_b":"Found the domestic enemy of our Constitution. As a soldier, I vowed to defend against you.","commenter_a":"Time to disband the Supreme Court. Time to hold all these people who violate our Constitutional rights accountable.","post_message":"The U.S. Supreme Court Monday handed a legal victory to advocates of banning firearms commonly known as assault weapons."},{"comment_id":"10152784038336491","commenter_b":"Preaching to the choir, sister! One of many reasons I'm now divorced.","commenter_a":"Now if only science could find a man worth having......","post_message":"Science shows that there are quite a few health benefits of getting intimate."},{"comment_id":"563277980487645","commenter_b":"What's the difference between Trumps wife's and illegal immigrants? Trumps wife's applied to become citizens through the legal process of American citizenship and now their AMERICANS. Women like u are uneducated.","commenter_a":"Look up the definition of legal immigrants and illegal immigrants... Idiots.","post_message":"Yes, Donald, have you made their travel arrangements yet?"},{"comment_id":"801271216730122","commenter_b":"This piece of garbage needs to go ahead and leave our country and take Kanye with her far far away","commenter_a":"Your the problem,and your friend obummmmer pos.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. She's lost it. What a hypocrite. Do you think Oprah is the racist?"}]
