[{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"908173805909035","commenter_b":"Absolutely. Although I do remember getting erections as a child when I saw the vaginas of changing women","commenter_a":"If a woman has a problem with a little boy sharing the facilities, she needs to rethink her attitude. No harm done. Children's safety should always be the #1 priority.","post_message":"When SHOULD a child start going into public toilets on their own?"},{"comment_id":"10152955984226130","commenter_b":"Lesbians STINK","commenter_a":"The image of God is both male and female and is reflected in a godly union between male and female where the creative power of God, His life-giving, His self-giving and His moral nature are perfectly expressed. This is only possible in a heterosexual union. When God created a partner for Adam He created Eve—not another Adam. This means that perfect partnership requires some level of difference as well as a level of similarity so great that Adam could cry out loudly, ”This is now bone of my bones and flesh of my flesh”. Sexual intimacy between a man and a woman is the normal method of male/female bonding (emotionally and physically) because it corresponds to the design of our bodies and because it is the normal means by which offspring are created. If God had intended the human race to be fulfilled through both heterosexual and homosexual marriage, He ...","post_message":"“As long as anti-gay legislation exists in any state, I strongly believe big events such as the Final Four and Super Bowl should not be held in those states’ cities.”"},{"comment_id":"1333345700010236","commenter_b":"get over it Bitch","commenter_a":"Of course his idiotic supporters fall for it. He's giving himself a massive tax cut which pales in comparison to his pittance of a presidential salary. He forgos the salary and looks like hero as he robs us blind. It's not even a good con but his supporters are great marks","post_message":"Trump says he already has enough money, so he's going to work free of charge as president. Do you admire his decision?"},{"comment_id":"436426606545633","commenter_b":"Women are too smart for an old fish tale lol","commenter_a":"Good job, Mrs. Wifey","post_message":"This is great..."},{"comment_id":"10152989497399099","commenter_b":"Impatient mother f'r, bc that's y those light and sign is there for, so they can cross safe.","commenter_a":"Smh","post_message":"A driver is accused of hitting a 6-year-old boy as he was getting off the bus and walking toward his mother @webpagelink"}]
