[{"comment_id":"10154302631811234","commenter_b":"Wife ?.. haha I hope a woman or anybody would be smart enough to let u suffer in your own hate alone ... jump off","commenter_a":"There's plenty of jobs in colorodo also I haven't seen under $12 jobs even fast food starts at 10$ .. this one place said they would pay me $15 n up to start .. a pizza place .. but I have a degree .. I just like cooking but ever I need I kno where to go ..","post_message":"These employers left and took their jobs with them."},{"comment_id":"1034829756528494","commenter_b":"Yeah women!!!","commenter_a":"What about the father that wants to keep the baby? He has no rights...","post_message":"A win for choice"},{"comment_id":"10154370353509714","commenter_b":"She must be a psycho...","commenter_a":"I sense a new song coming","post_message":"Taylor Swift and Calvin Harris have called it quits."},{"comment_id":"1001470336557869","commenter_b":"HaHaHa ROFL at her.","commenter_a":"And she is the Dean at a University? Sad state of mind and then you combine that with putting her in the role of teaching! Are we the people paying for that woman's salary?","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"},{"comment_id":"10154382177016756","commenter_b":"Kyle, bad news for you. I'm a Bernie supporter. I'm just not up my own ass about it like so many of the rest","commenter_a":"Thank you for stating the obvious @username. This isn't about winning anymore. It's about spreading the message. This movement isn't going away. And we'll keep donating to see him through, because the message is important. Bernie Sanders, the nobody socialist senator from the boonies, almost took down the strongest possible candidate the establishment could put forward. He did it against rigged elections, big money, money laundering, and voter suppression. Him and our 27 dollar donations.","post_message":"As of March 31, there were 896 people on the Sanders payroll. The campaign says it will retain more than 300 staff."},{"comment_id":"10153987502144087","commenter_b":"Hillary is by no means a \"girl\". She's an old mentally disturbed hag.","commenter_a":"Wait, Hillary's a girl?","post_message":"Elizabeth Warren: \"[Donald Trump] makes death threats because he's a pathetic coward who can’t handle the fact that he’s losing to a girl.\""}]
