[{"comment_id":"1529798700659483","commenter_b":"Compensate us all for the injuries we suffered because of what our ancestors did. We had no part I f it. Then compensate the Irish remember, \"Irish and dogs, need not apply\" Chinese, italians, \"WOPS\". And then we women, are expecting big checks for years of abuse. Finally, when you finish paying everyone off, well all go to work to pay the huge federal debt you ran up, and will have reached \"slave\"status. I want my check too, otherwise I'm going on wekfare. Get over it. Get real.","commenter_a":"I'm excited. I had an ancestor who fought with Sherman's army....so I certainly will not be required to contribute, and maybe even receive compensation for the hardship he endured.","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery.  The slave trade was hundreds of years ago, get over it.  Will you pay up?"},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"10155173773771320","commenter_b":"Barbie has Ken what's the difference....","commenter_a":"Good grief!! My oldest granddaughter collected them, but this is plain stupid! Why don't you make an American Boy series???","post_message":"Big news in the world of toys. One of the newest American Girl dolls is... A BOY! It is the brand's first boy character. He is a drummer in a Nashville band. Thoughts? @webpagelink"},{"comment_id":"1311800738876452","commenter_b":"IN YOUR DREAMS !!! #DontBoo #VoteHillary #NastyWomenVote","commenter_a":"Trump will become the next President. I'm saying this because I analysed their horoscope from an astrological point of view.","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"10155303562011756","commenter_b":"@username stfu and gtfo. Now.","commenter_a":"I get where the author is coming from and she makes a valid point. In this case though I think the mommy comments were engendered by Beyonce's show stopping 10 minute celebration of being black, being a woman, and being pregnant. Her presentation as an Isis figure/fertility goddess all flowed into the dynamic she created, so it's understandable that Adele and Faith related to her that way. Beyoncé was the mother of the night and that's how she planned it. If she performed formation and wasn't pregnant for example, this article would be more warranted. I think the whole mammy/mommy comparison arises because it's impossible to escape the history and application of white supremacy whenever colored people deal with Western institutions like the Grammy's. The concept of disposable black women, which Beyoncé essentially demolished in her performance, is baked into our society and forms a large part of the reason ...","post_message":"On the Grammy stage, both Adele and Faith Hill commented that they wanted Beyonce to be their . Those comments came across as absolutely bizarre for Denene Millner, writing for NPR's Code Switch:"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"}]
