[{"comment_id":"10153712175233352","commenter_b":"So it would be ok to throw down in front of a toddler is that what you are saying? She should have put her down for what huh, for what? Get some sense in your head !! The only guilty party is the lil bitch who hit the girl holding a child she is a straight up coward and thats probably the only reason she hit her cause her hands were full!","commenter_a":"I think all parties are guilty the ones egging it on the mother of the child and her friend. Her friend seen what was going on so she should have taken the baby and the mother... Should have put the baby down as she see the girl kept saying put the baby down and appeared not to give a dam. Believe me all parties played their part in the hatred or what ever that got them to this point. In reality the mother used her child as a pawn thinking it would have saved her from a ass whooping putting her child in danger. Thank God the female was caught and the baby is ok. They all need to get it together... Because believe they all full of shit and played a roll in this fight...","post_message":"Texas girl, 13, who was caught on camera as she launched brutal assault on rival teen holding a toddler is now in police custody"},{"comment_id":"733056316849024","commenter_b":"Bitch has a nasty vagina","commenter_a":"They're wondering how to explain to their daughter that Trump won. How do you explain an adult woman wearing a vaginal out in public? What the heck is wrong with these people?","post_message":"ClashDaily.com"},{"comment_id":"1147885218663043","commenter_b":"@username , no wall is going up! 😂","commenter_a":"His supporters don't care having an asshole for president , they just wanted a white man .","post_message":"Trump's supporters are not going to be happy about this."},{"comment_id":"1267255170019683","commenter_b":"Trump never said that - the Media always twist his words. Evil Hillary, said that no one needed guns - Trump said, OK - start with dis-arming your security guards. What does she do? Tripled her armed guards. Queen Liar Hillary / that Muslim Traitor Obama / & Soros are the U.S. worst 3 enemies that we have ever had. Because of all the evil Muslims that they have flooded our country with - we will probably be in a Civil War here on our soil - before the election - since they are losing really bad - they will not wait to try a Complete Muslim Take Over. Obama's ISIS has already stated -- We will Kill 90% of all Americans before 2017. Of course, that will be All White & Christians. Can not people see how EVIL those 3 Muslims are - 2 countries have promised a N. ...","commenter_a":"Are you judging this , like when Trump asked them to take the guns from her secrect service men , so she could be assassinated. Trump said the same thing ,but you just look over it.","post_message":"Watch for yourself and you be the judge. Hillary was asked about wanting to assassinate WikiLeaks founder, Julian Assange, using a drone. Assange has been a thorn in her side throughout her campaign.  When she finally answered, I've gotta say, I was more uneasy than when the reporter asked the question. This is NOT someone I would want in the White House under any circumstances.  Do you find her answer as disturbing as I do?"},{"comment_id":"1102153109844436","commenter_b":"Women need sex","commenter_a":"She should be locked up! She's sick! And just to say a massive thankyou to this brave soldier for looking after us and our country x","post_message":"How can a wife be so heartless?"},{"comment_id":"10153246182423188","commenter_b":"She allowed her cheeks to hang out. This woman POSTED this video to YouTube. They clearly received the attention that they were seeking.","commenter_a":"Michael shouldn't have posted a pic that shows a woman's butt cheeks hanging out, @username. I'm surprised as a Christian you condone this.","post_message":"My wife and I are laying in bed talking about this non sense with Michael Bublé and she pulled up something a girlfriend sent to her.  Holy cow!  Some people are just Shoot milk through your nose funny without trying.  Look out.  What follows makes Michael's butt cheek photo look like a bible pic.  Excuse the title on youtube.  No profanity on vid.  @webpagelink"},{"comment_id":"10152795603885950","commenter_b":"if i turned into a woman id still want a woman so id be a lesbian, lets all turn to woman","commenter_a":"thats right, if i want to be a woman, ill be a woman, but i kind of like my dick so ill keep it","post_message":"\"If he says he's a woman, then he's a woman.\""}]
