[{"comment_id":"1695518967374741","commenter_b":"NOW do you understand why Ross Perot ran as an Independent in 1992? The parties are both corrupt and they control who gets elected, no matter how many citizen vote.","commenter_a":"All I'm hearing is boohoo I lost so now I have to blame it on something else. If your as smart as you claim you would have known the rules, moron! And look at all your inbred supporters, they have no idea how the laws or rules work either! Go Cruz!!!","post_message":"At least in Colorado they didn’t even pretend to care about what the voters think!"},{"comment_id":"10152977557517217","commenter_b":"Lady*","commenter_a":"Beautiful England Rose, Princess Diana.....","post_message":"Princess Diana, lion cubs & space safety fears - This Week in History: @webpagelink #bbcrewind"},{"comment_id":"967905263263639","commenter_b":"She needs to be in jail!","commenter_a":"No just you","post_message":"EPA Chief Reveals Her 'Trashy' Upbringing And What She's Sure All Families Did Pre-EPA [Video]"},{"comment_id":"832521843510736","commenter_b":"All of them boobs!","commenter_a":"\"Mess NBC\" IS A JOKE! Less than 150,000 viewers. Now, compare this with FOX - with 2.7 Million each each NIGHT!","post_message":"Bouncing back?"},{"comment_id":"10153962435457235","commenter_b":"ive got a few vulgar words for this trump ish.... can not stand her face, her voice, or any damned thing that comes out of her mouth. this woman is a vile creature that needs to crawl back under whatever rock she slithered out from.","commenter_a":"Founding father of porn.","post_message":"It's hard to imagine the GOP getting more juvenile than this -- but let's see what happens tomorrow!"},{"comment_id":"1321278027895520","commenter_b":"@username The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service","commenter_a":"The only thing she can do is race bait and pay for play. Everyone sees it now. Clinton lies like a RUG .She tries to make everything a race issue it is Economic issues. All Americans , she is the one race baiting .How can she and her friends think they can run the Country when they can`t even control their Husbands ? She didn`t take long to throw a well respected Black General ,Colin Powell under the Bus to cover more of her lies ? She also says Trump supports KKK views ? His grandchildren are Jewish for crying out loud. When will liberals wake up ? How do ya get Rich working in the Public Service ?","post_message":"Thank you for the great feedback on my Immigration Speech last night in Phoenix, Arizona. I am grateful for everyones support. I want to thank the ANGEL MOMS - who I met last year when I began campaigning. I am truly humbled by their courage and bravery - they are truly INSPIRATIONAL to me. I love the United States of America - and it has been so good to me. I want to MAKE AMERICA SAFE AND GREAT AGAIN - with you, the American people. -DJT"},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"}]
