[{"comment_id":"554818391394376","commenter_b":"@username you said it. Now it's trumps turn. AND HES GOING TO HEAR it... Loud and clear.","commenter_a":"@username TRUMP IS OUR PRESIDENT, Have some respect, stop showing our kids it's ok to disrespect our President, our country. Can't wait for the day, your boat sinks, and you hate mongering reporters drown.","post_message":"He wrote a book alleging corruption between the Clintons and their philanthropy. Now he says he sees similar conflicts of interest between Donald Trump and his business."},{"comment_id":"706537696174664","commenter_b":"White trash! Take a bath!","commenter_a":"Omg. Thought we only had one clown in the white house then she showed up. Glad its only for a few days left thank god","post_message":"Happy 53rd birthday to First Lady Michelle Obama! Join us in wishing her well!"},{"comment_id":"10153314247693812","commenter_b":"She beautiful","commenter_a":"Amaxing love the smiles love technolgy","post_message":"Girl all smiles 6 months after major surgery to reshape her face with help of 3D printing: @webpagelink"},{"comment_id":"10153576413974087","commenter_b":"She is a joke","commenter_a":"Says someone who championed NAFTA and called the TPP the gold standard of trade agreements. #whichhillary","post_message":"“Hillary says you walk out on America, you pay an exit tax. And if you got tax dollars or a tax deal, you’ve got to give the money back. She’s with us,” the Hillary Clinton ad says. WATCH:"},{"comment_id":"1056445444376466","commenter_b":"Happy International Women's day.","commenter_a":"A woman got recognition in the late 1800s? Wasn't the womans rights movement kind of non existent at that point? Wouldn't she have just been laughed out by any male doctor of the era without a chance to prove herself","post_message":"#womenyoushouldhaveheardof"},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"},{"comment_id":"943485965686825","commenter_b":"Hillary wants to have DNA test to see if Chelsea is hers!!! DUH!!!","commenter_a":"Lol..she looks like Bill.","post_message":"Incredible!"}]
