[{"comment_id":"10152659082871717","commenter_b":"And don't forget daughters who talk back to their fathers. They get stoned to death too.","commenter_a":"Here's an idea: since many want gays executed according to biblical law, how about following biblical law to execute adulterers, pedophiles, fornicators, tattoos, and et al?","post_message":""},{"comment_id":"10155261002826509","commenter_b":"I can tell you as a white American that she's not going to help me or my family either.","commenter_a":"I love how all you white Trump supporters are trying to convince African Americans how Donald Trump can help them and Hillary Clinton can't when you probably have no freaking idea what the African American Community needs. Hysterical. I know you don't like the analogy, but it would be like Adolf Hitler's supporters trying to convince Jews that the Nazi party is better for them.","post_message":"Senator Jeff Flake says, \"I simply can't\" support Donald J. Trump. cnnpolitics.com"},{"comment_id":"537404189787632","commenter_b":"YOU HAVE FORGOTTEN THAT YOU ARE NOTHING MORE THAN AN ACTOR WITH AN OPINION--AND NOT A VERY INTELLIGENT ONE-MAYBE YOU WOULD LIKE TO JUMP ON THAT PLANE THAT SO MANY OF YOU ACTORS ARE GOING TO BE ON IF TRUMP WINS???!!!!NANCY","commenter_a":"He's a self important cunt, that's what he is. Like his opinion matters. I like his acting, but when it comes to a political opinion, I'll form my own and he can fuck off with his.","post_message":"Robert DeNiro is a ________________."},{"comment_id":"807543922769518","commenter_b":"SHOWS HOW GHETTO AND STUPID SHE IS","commenter_a":"Uneducated today's schooling.","post_message":"Racist Black Girl Assaults White Students For Enslaving Her Ancestors [VIDEO].  This is unbelievable. Where's the media outrage?  Do you think this is a hate crime?"},{"comment_id":"1425549500793527","commenter_b":"I hope Ellen tells them all to eff-off. America needs to take a stand against these whiney brats.","commenter_a":"It's hilarious not racist!!!! Come on!!!!","post_message":"People are not happy with Ellen DeGeneres' Usain Bolt photo."},{"comment_id":"1151797721550248","commenter_b":"@username \"All people of Muslim faith need to be monitored ,suspend any and all travel for them born here or not .\" \" All Mexicans not here legally will be deported and any child born here who's parents are illegal will be deported \" Mexico doesn't send their best,just drug dealers and thieves. \" Maybe because I don't lick windex off of the windows of the Trumpian short bus but sounds racist to me.","commenter_a":"Good bye all the never trumps see you after you realize that not voting for trump is just another vote for hillary who no one wants. Sorry that people didn't vote for your candidate probably because they are tired of politicians saying what you want to hear and not doing any of it.","post_message":"Republican National Committee Chairman Reince Priebus says the meeting with Donald J. Trump was great."},{"comment_id":"1537745596485739","commenter_b":"Got it STOCKINGS !!!!!!","commenter_a":"salt","post_message":"Riddle of the day! What is it?   Quiznatic Media"}]
