[{"comment_id":"10153811785661486","commenter_b":"Aamen","commenter_a":"Wow","post_message":"A relative of Princess Diana, Prince William and Prince Harry has moved one step closer to sainthood."},{"comment_id":"252211541884990","commenter_b":"Not worry about it.. woman should be seen, not heard","commenter_a":"Why don't you just take your ball and go home","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law.   Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning.   If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department will hear from all of us, too.   Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist."},{"comment_id":"725563637631927","commenter_b":"The wall around the vatican was bild to keep the muslums out.","commenter_a":"I am not Catholic,He is not my pope. We do not have an established religion in the USA. Which was the whole reason for the whole revolutionary war, pilgrims, etc. He is welcome to his opinion, that's all it is....move on Pope....btw, why do you have a wall around the Vatican, just curious","post_message":"The Pope got TAKEN TO SCHOOL by Trump supporters!"},{"comment_id":"10153391824149205","commenter_b":"Was your mom a thing female voice hater .","commenter_a":"Who in their right mind, even if they don't like Trump, would even care what this thing says. My opinion is just as good as hers, or even more informed. Just because someone is a hollywood star does not make them knowledgable one way or the other.","post_message":"TYT Reporter Jordan Chariton caught up with Oscar-winning actress Susan Sarandon in Mason City, IA after a rally in which she introduced presidential candidate Senator Bernie Sanders (D-VT)."},{"comment_id":"1585095868182585","commenter_b":"Just go away!","commenter_a":"Isn't mental illness a sad thing?","post_message":"Oh dear god."},{"comment_id":"10154773746046350","commenter_b":"That is so awesome-we need more of this-people helping other people-","commenter_a":"I was in an abusive relationship with an alcoholic constantly trying to keep him out of jail, take care of our 2 young children and working as a bartender. I lost a job due to not having a sitter while their father was in jail. Little did I know, 2 people who used to come into my old employment owned a small family bar and needed help. They contacted me and offered me a job. I had only been there for a short time and my boss lent me money to get my boyfriend out of jail. After a month when I reached the end of this relationship my boss lent me his car and more money to get a place and get on my feet. He never took the money I owed him out of my check. He told me to pay when I could. Every year for 3 ...","post_message":"What's the kindest thing that someone has ever done for you? Tell us in the comments below.    TODAY is kicking off our second annual #ShareKindness campaign with a goal of inspiring 1 million acts of kindness by the new year. @webpagelink    Our sponsor The Y is helping us out by committing to the first 10,000 acts."},{"comment_id":"10153693549314087","commenter_b":"Well Donald was a life long Republican","commenter_a":"Why are the rules in a way that you have to register so long before the actual vote? Isn't this a form of voter suppression? Ps. I'm not a trump supporter.","post_message":"\"They were unaware of the rules, and they didn't register in time,” Donald Trump said of his kids, Ivanka and Eric. \"So they feel very, very guilty.”"}]
