[{"comment_id":"10153328047582217","commenter_b":"I think it was just you and me. I don't even remember the boys being there?? I can't really remember the play either, just waiting at the stage door after!! I think your right about Minnie driver too.","commenter_a":"@username :-)","post_message":"🎶 So no one told you life was gonna be this way...🎶 😃"},{"comment_id":"890384730998868","commenter_b":"They need to be sterilized so they can't reproduce themselves!","commenter_a":"Obama and Sharpton seeing this would say \" these fine young gentlemen were just defending themselves from her whiteness. She was in the wrong place at the wrong time and they have a right to do this. They were the victims here for the media was recording them acting like a bunch of crazy violent animals. So, in self defense, they mugged her and her cameraman. It's only fair after all since the white man has being doing this forever. Isn't that right Mr President, the most powerful man in the world elected by these white oppressors to be so? At any rate we believe these fine young gentlemen, who could after all be our sons, all deserve scholarships for 4 free years of college, extra food stamps, and free cases of colt .45 malt liquor each.\"","post_message":"\"Stop!\""},{"comment_id":"1705584226349949","commenter_b":"IF HITLER TRUMP GETS IN WE THE LITTLE PEOPLE CAN KISS OUR ASSSSSSSETS GOOD BY CAUSE HE WILL BE FOR THE RICH AND MAILNLY HIMSELF WAKE UP AMERICA BEFORE WE HAVE ANOTHER MAD MAN IN CHARGE","commenter_a":"What an Idiot..mathsssssssss you cant","post_message":""},{"comment_id":"10152878332246130","commenter_b":"It's always the ugly women throwing shade. This chick has a light-bulb-shaped alien head. #haveseveralseats","commenter_a":"She should never have apologized for anything.","post_message":"We're still cringing."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"10153342820917098","commenter_b":"I am on her side, women now a days are almost naked just to prove that they are sexy.","commenter_a":"Im on her side. Hoes are in their feelings because she feels beautiful and sexy with clothes ON. She clearly didnt have to be half naked to get her man and that should tell you hoes something. Lol Dont be mad, learn something. Know your worth. Get it together.","post_message":"TWITTER DEBATE: Ayesha Curry, wife of Warriors basketball star Steph Curry, found herself in a social media firestorm after tweeting about today's fashion  Many people criticized her for body shaming while others praised her for her modest views. Which side are YOU on??   FIND OUT what she said: kron4.com/2015/12/07/twitter-explodes-after-ayesha-curry-tweets-about-modesty/"},{"comment_id":"10153580518686749","commenter_b":"@username The narrative BARACK HUSSEIN OBAMA has been pursuing is based on twisted facts and a long standard hatred against liberty and against our Republic', which he calls it America. HILLARY CLINTON being in lockstep with him, and just like him, she also felt the need to go around the world and apologize for all the things we supposedly did in the past. Never mind of all the aid and the freedom many Democracies are enjoying because of us and the blood we shed for them. We helped them and still helping them not because we but because is our duty to all the Millions of American citizens who came from those places and all their loved ones who are still living there! So, instead of leading from behind, when will our Nation have a pious and righteous President, a Constantine, a Theodosius, a Justinian, who will not be afraid, ...","commenter_a":"You're the best president, I'm from England but thanks for everything you have done Obama, especially for the LGBTQ+ community.","post_message":"President Obama's final State of the Union is on January 12. Say you'll be watching—and join the conversation. @webpagelink"}]
