[{"comment_id":"1683593111700811","commenter_b":"That's why they have a little pill now called Plan B...take that the day after you're raped if you can't stand to carry the baby and put it up for adoption to a family who doesn't care how the child was conceived! Abortions, especially late term abortions are cruel and inhumane!","commenter_a":"It's planned parent hood they do a lot more then abortions. And @username women chose well some prolly forced so @username women got knocked up because they didn't practice safe sex. I thought women wanted the right to chose what they do with there bodies planned parent hood also helps with women's health who can't afford insurance or hospitals the government cut there funding right? So how can they help these people and if they closed right now you don't think @username people won't find someone else to do abortions. I promise if there not smart enough to use protection and pph closed you would see a lot of dumb young women ending up in ER with a coat hanger hanging out of them. Americans are such pussies anymore of it is not your baby or body and you don't know the person making there chose mind your fucking business","post_message":"Ugh why?!"},{"comment_id":"506778712863385","commenter_b":"Hillary up to her old tricks #NeverHillary","commenter_a":"It should be a mural of Obunghole screwing a goat.","post_message":"The artist included the phrase: \"Make Everything Great Again.\""},{"comment_id":"10155464827050354","commenter_b":"Crazy ass bitch.","commenter_a":"Ms. Warren needs to look into the eyes of the youngest victim and then advocate against the death penalty. And then go to the other families that lost loved ones or lost limbs and time. That dear little boy didn't have the chance to live and she wants that piece of sh*t to live a long life.","post_message":"Liberal values..."},{"comment_id":"10153244569769087","commenter_b":"Youare a fucking ignorant whore.","commenter_a":"Benjamin Netanyahu - is protecting the Free World while Hussein Obama wants the Deadly Suicide Pact with Iran. Wait until Iran hits America with their ICBM's, Iran can already Hit Israel.","post_message":"Israeli Prime Minister Benjamin Netanyahu - בנימין נתניהו delivered an intense silent protest of the Iran nuclear deal by staring down members of the United Nations General Assembly for nearly a minute without saying a word. WATCH:"},{"comment_id":"918090094974937","commenter_b":"Unless you make over 12 million dollars a year then you'll probably get a big tax break and a yearly stimulus for being a small business","commenter_a":"I'm a proud Tennessee woman, I've never been disappointed in my beautiful state, today is the first. Trump is not for the people. #FeelTheBern","post_message":"Thank you Tennessee! #Trump2016 #SuperTuesday"},{"comment_id":"1371582852881168","commenter_b":"She's definitely a weird bitch !","commenter_a":"Stein you lost by zillions go home and get a job","post_message":"JILL is just fishing for money is all...?  @webpagelink"},{"comment_id":"882724591787290","commenter_b":"Battered but still a warrior, great courage.","commenter_a":"This kid needed a gun and a CCL. So as to defend himself!....oh wait he lives in Newtongrange, Midlothian. Is that in....the UK? They not allowed to defend themselves with lethal force, from Thugs! Thanks to people that think like Piers Morgan.","post_message":"Left for dead with a battered face and multiple fractures by man he stopped to help"}]
