[{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"10154755493169138","commenter_b":"Trump wont go after Hillary! His people will definitely do that! Trey goudy wants her head!","commenter_a":"I hope she gets bit in the butt and now I hope Trump will investigate her once he is in office","post_message":"Stein, the Green Party candidate who got roughly 1 percent of the national vote, wants a recount in Michigan, Pennsylvania and Wisconsin."},{"comment_id":"10153550945636943","commenter_b":"No Syrian refugees....NONE!...call the Capitol...1-202-224-3121...follow instructions...Let them know you oppose Syrian refugees entering the U.S.. Took me 2 minutes...EASY!","commenter_a":"No","post_message":"Tom Fitton joins Fox News to discuss the danger Syrian refugees pose to the United States. Do you think Obama should allow thousands of Syrian refugees into our country?"},{"comment_id":"1723943734489970","commenter_b":"Not only ridiculous, but stupid. What did Muslims have to do with the Holocaust? There far more people that are not offended by things that offend the Muslims. It is still our country, who make only one race happy all the time. Leave this alone and it may just prevent the horrible era from ever happening again. God please help us.","commenter_a":"WRONG!!!","post_message":"Schools Are Dropping The Holocaust From History Lessons To Avoid Offending Muslims. Things are getting ridiculous. Do you think this is wrong?"},{"comment_id":"1074056242615386","commenter_b":"Because people destroy their habitat and poach them for money.","commenter_a":"Wild animals shouldn't be kept captive! They should be in the wild if people want to see them why don't they go to there homelands instead of leaving them kept in cages!","post_message":"This gorgeous little jaguar cub made his public debut this week at the San Diego Zoo."},{"comment_id":"10152797657587144","commenter_b":"Those \"additives\" include vitamins and minerals. I'll take it.","commenter_a":"Oh yeah, I just remembered why I unliked @username in the first place.","post_message":"\"A jug of almond milk containing roughly 39 cents worth of almonds, plus filtered water and additives, retails for $3.99.\""},{"comment_id":"1052974981463934","commenter_b":"Where is our government's back bone they should have someone down there telling them that we have our own laws. Instead they act they have a yellow streak down their backs this is the USA if they don't like it leave","commenter_a":"Go back to your shit hole in the sand\"","post_message":"Muslims OUTRAGED After Texas Major After She Bans Shariah Court... [VIDEO]  She's taking heat.  Do you support this Texas mayor?"}]
