[{"comment_id":"1478041665558122","commenter_b":"@username - very serious! Just wait and you will see!! Thanks for allowing Clinton to be our next president!!","commenter_a":"Sorry- false!! Most military is for Trump!! Voting for Johnson is a vote for Clinton!! Why would the military want a person who believes in open borders!!","post_message":"These pushups are more than Trump has done."},{"comment_id":"1267255170019683","commenter_b":"Trump never said that - the Media always twist his words. Evil Hillary, said that no one needed guns - Trump said, OK - start with dis-arming your security guards. What does she do? Tripled her armed guards. Queen Liar Hillary / that Muslim Traitor Obama / & Soros are the U.S. worst 3 enemies that we have ever had. Because of all the evil Muslims that they have flooded our country with - we will probably be in a Civil War here on our soil - before the election - since they are losing really bad - they will not wait to try a Complete Muslim Take Over. Obama's ISIS has already stated -- We will Kill 90% of all Americans before 2017. Of course, that will be All White & Christians. Can not people see how EVIL those 3 Muslims are - 2 countries have promised a N. ...","commenter_a":"Are you judging this , like when Trump asked them to take the guns from her secrect service men , so she could be assassinated. Trump said the same thing ,but you just look over it.","post_message":"Watch for yourself and you be the judge. Hillary was asked about wanting to assassinate WikiLeaks founder, Julian Assange, using a drone. Assange has been a thorn in her side throughout her campaign.  When she finally answered, I've gotta say, I was more uneasy than when the reporter asked the question. This is NOT someone I would want in the White House under any circumstances.  Do you find her answer as disturbing as I do?"},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"976040162431405","commenter_b":"I haven't watched this show in years and don't see how it's still on the air! These women are so \"out of touch\" with the real world, they're clueless!","commenter_a":"These women on the view must b a special kind of stupid","post_message":"Thank you, Dr. Ben Carson!"},{"comment_id":"1051072661621517","commenter_b":"Get them the hell out of America!","commenter_a":"Sadly delusional.","post_message":"THIS IS ISLAM: Typical Muslim Cockroach  And Tortures Co-Worker For 5 Days To Make Her Convert  @webpagelink"},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"1517317031907717","commenter_b":"Lol! I know right! Hate that woman! This,Chicana is for #trump2016 !!","commenter_a":"The most satisfying thing in the world to see, EVER, is watching Megyn Kelly say Trump wins!!!!!!!","post_message":"BREAKING: Initial reports indicate Donald Trump has won the Republican primary in South Carolina. Let's take a poll of our own...would you like to see Trump as the next US president?"}]
