[{"comment_id":"10153978622861438","commenter_b":"Of course she is. I could see through that bubbly bs","commenter_a":"Shocker....not.","post_message":"Kelly Ripa’s morning talk-show drama might force us to acknowledge all the work that goes into her cheery persona."},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"1252562101428763","commenter_b":"Pathetic. She should be charged like a criminal .","commenter_a":"Illegaly gotten fees and she gets a bonus?","post_message":"It's a disgrace that while millions of Americans were defrauded by Wells Fargo, the executive in charge of running a scam received a $124 million bonus."},{"comment_id":"1242850115735016","commenter_b":"Please don't put us in danger Mr. President. It doesn't matter where you put these refugees in the US. They can still be a threat. I still can't get over 9/11","commenter_a":"How about taking care of the homeless in the country before letting refugees in? I know it might sound crazy, but give it a shot.","post_message":"After the terror attacks in Paris that killed at least 129 people, the placement of refugees fleeing Syria has come under scrutiny as more than a dozen governors - mostly Republicans - have said the do not want the refugees in their state."},{"comment_id":"1859284991009604","commenter_b":"Niggaz and whites","commenter_a":"I tell you man niggas now a days are dumb ass fuck they don't think","post_message":"Mannequin Challenge got them busted! #WSHH #Alabama #MannequinChallenge"},{"comment_id":"10153235422567994","commenter_b":"Hahahaha mathieu blocked me awe","commenter_a":"Who are these people with nothing better to do than just constantly complain about everything being racist? My God shut up.","post_message":"It's a bank robbery for Skittles. Is it a student video gone wrong?"},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"}]
