[{"comment_id":"1167345089975985","commenter_b":"The real unemployment rate is 14% and the only people seeing their wages go up are professionals. So the middle class is not seeing any sort of economic relief.","commenter_a":"the new way the jobs report is calculated was a bi-partisan effort to lower the number of unemployed statistically (94 million americans are not participating in the job market) The GDP number is now a much better statistic about the economy. That number is LOW. way to low.","post_message":"Trump says the economy is in a deep hole. The latest jobs data suggests otherwise."},{"comment_id":"10152765458922452","commenter_b":"What a beautiful woman!","commenter_a":"NoooooooooooH! Whhhhhhyyyyyyyyyyy!! 😢😣😧😩","post_message":"This is the last year that the original version of Kraft Mac & Cheese sold in the U.S. will contain artificial preservatives or synthetic colors. @webpagelink  In January, Kraft says its macaroni and cheese will be colored using paprika, annatto and turmeric."},{"comment_id":"10154911255250530","commenter_b":"@username you. The Asian carp are not bottom feeders, their meat is high in protein. Watch some YouTube videos on them....you'll learn a thing or two.","commenter_a":"I've read that they are good to eat and high in protein. But, man has wiped out many species of plants & animals, don't know why this should be so difficult.","post_message":"Here come the carp."},{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"899517350083687","commenter_b":"GOD BLESS AMERICA ! We really need His Help !!","commenter_a":"Screw the Muslims and the Camels they rode in on!!!","post_message":"Pathetic! (MUST READ)"}]
