[{"comment_id":"10154088875521717","commenter_b":"Omg what a pig","commenter_a":"@username read this, what an arsehole","post_message":"The student said she has never been more terrified of being outed than when Milo Yiannopoulos berated her on stage at a college event."},{"comment_id":"10153093946344205","commenter_b":"Illegals idiot","commenter_a":"He realizes that Mexicans aren't the only immigrants in America, right? Over half of Americas population would be kicked out if he tried to do that, and that's only recent immigrants. If you wanna get technical, the only people that aren't immigrants are Mexicans and Native 741915279236631s. They were here first.","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"1187762051262009","commenter_b":"Build a defense wall also protects from evil ducks.","commenter_a":"President Trump will think of something.","post_message":"China have finally confirmed that they have lost control of their space station."},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"},{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"10154129008215329","commenter_b":"Sharon lol i couldnt find the woooorrddd","commenter_a":"I'm 15... i mean, i know how to use a CD player, and i know how to listen to a CD. i also know how to use a cassette and all but now a days, most computers don't even have a slot... we also got rid of our CD player ages ago... i haven't bought a movie on DVD in soooo long because everything is digital now","post_message":"So you've purchased Adele's \"compact disc\"..."},{"comment_id":"10153230104286051","commenter_b":"I agree with that woman keep your garbage with you","commenter_a":"Just a ? For all who are being so harsh. Witch one of you would want that sign by the grave of your loved one. I sure wouldn't want it by my nephews grave. He died from a drug over dose. Oh yes I fully understand and can see both sides.","post_message":"These grieving parents went to visit their teenage son's grave one day when they noticed something on a tree behind his headstone."}]
