[{"comment_id":"1857318871171795","commenter_b":"DRAIN THE SWAMP!! TRUMP/ PENCE 2016","commenter_a":"Thank you for making this so much easier to understand and for opening eyes as to what is really at stake!","post_message":"Clinton pay for play speeches. Understanding how it all works, and who gets paid for what -- all the favors --- and why she wants so many refugees.  Please watch and share.  If you are new to DML please give him a LIKE.  You won't regret it."},{"comment_id":"10153184020474726","commenter_b":"What a disgusting a hole.","commenter_a":"what a piece of dog feces","post_message":"\"He didn't win, did he?\"    Harry Reid confronted on his lies, with no regrets."},{"comment_id":"1295164193914868","commenter_b":"Then her skin is too thin. I'm sure she's seen and heard much worse. Does she know what Muslims do to women?! And she wants them here sooooo bad.","commenter_a":"She is selling her soul to the devil. She can push the likes of Clinton on us. You can't be gone soon enough!","post_message":"First Lady Michelle Obama says the revelations about Donald J. Trump's treatment of women have “shaken me to my core.”"},{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"10153891687451782","commenter_b":"And what of Betty Shelby??? When will they lock that monster up? When will her day come?","commenter_a":"It is not over he may not but I saw a tweet today by a new elect and NY police are ready for several charges including the spirit dinners were those poor children are molested and then killed!! It may take time but all of them will be charged! Trump will be too busy to do it but their day will come!!","post_message":"President-elect Donald Trump's aide is suggesting that he will not pursue a probe of Hillary Clinton private email server in an effort to help her ;  @webpagelink"},{"comment_id":"10153637330793271","commenter_b":"Good, throw them both in jail and throw the key away!","commenter_a":"I am happy to hear this. I pray that it will bring even a little comfort to the family and friends who are grieving.","post_message":"#BREAKING: Ignacio Paul Daigle, the second suspected car thief involved in a crash that killed a young Thornton mother, has been arrested.  Good job, Westminster PD!"},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."}]
