[{"comment_id":"10152763206590950","commenter_b":"I guess she thinks shes all that.....but no!!!!!","commenter_a":"I do not care that the towing company is predatory, this cashier just works there and does not own the company. Try yelling at the cashier at Walmart or some other heinous company because you hate the company or corporation, same thing. Misplaced and misdirected hate is never productive and just shows your true character :(","post_message":"A pretty television personality opened up her mouth and showed a lot of ugliness in a video that went viral this week. Washington D.C. reporter Britt McHenry was caught on camera giving the business to an impound clerk while retrieving her towed car. Now the people on the other end of her tirade are responding."},{"comment_id":"1677003925887340","commenter_b":"@username, why do many Americans believe that Obama isn't concerned about protecting America? He has given no indication whatsoever that this is the case. As a matter of fact, he does just the opposite. Do you seriously believe that building a wall at the Mexican border and not accepting any refugees will do anything to stop terrorism? The roots of terrorism are not illegal immigrants or refugees. The roots of terrorism are Americas interferences in the middle east. The roots of terrorism are people who say \"bomb them and take their oil\". How would you feel if someone would say this about the USA? Terrorists can be fought with weapons but terrorism can only be fought with education. And this is exactly what Obama does. Educating people...by talking about Islam, by visiting a mosque, by saying he will stand with the Muslim Americans. That doesn't mean he hates Christians or ...","commenter_a":"Congratulations Mr. TRUMP. We look forward to seeing you here in SC. Our country needs a strong leader that's going to make this country great again. We need someone in the white house that actually is a christian, strengthens our military and will secure our borders. Take care of our people first, the great people of the United States.","post_message":"Good morning America! THANK YOU for your vote, New Hampshire! We will MAKE AMERICA GREAT AGAIN! Off to South Carolina today. Everyone have a GREAT DAY, and again- thank you!"},{"comment_id":"10153181017133690","commenter_b":"Okay white terrorist","commenter_a":"Christian Terrorist","post_message":"\"This was not a dispute over a parking space, this was a hate crime,\" Mohammad Abu-Salha, the father of the two slain women, said. \"This man had picked on my daughter and her husband a couple of times before, and he talked with them with his gun in his belt. And they were uncomfortable with him, but they did not know he would go this far.\" @webpagelink"},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling \"long-held fantasy\" of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  \"It was a bloodbath,\" prosecutor John McKinney said. \"They took this man apart.\"  Read KTLA's story here: @webpagelink"},{"comment_id":"1731050200496998","commenter_b":"Some mothers eat their young!","commenter_a":"Typical!","post_message":""}]
