[{"comment_id":"1075829105767772","commenter_b":"They blame it on Obama....for \"existing\".","commenter_a":"I swear, in some ways things are worse now than they were 50 years ago. Some try to say that it's just among old white people. . . well those folk seem to have done a pretty good job of passing it down.\\b\\b\\b\\b","post_message":""},{"comment_id":"1202659629774507","commenter_b":"He should be impeached. If this neighborhood was all white they would have had clean water on day one","commenter_a":"Mr. Snyder you have not done your job so you must go. You looked pathetic.","post_message":"Why hasn't he been arrested?"},{"comment_id":"10154507187503690","commenter_b":"By expressing these words u r only humiliating blacks,u r suitable pig to work as the puppet of western world to defeat the black pride.how unfortunate u r","commenter_a":"imagine arabs without islam, great scientist, musicians, world class pretty models, sport heroes, legendary actors both male n female but islam brought d vice. without oil plus islam saudi and d rest would have been worst than somalia. I cause the day that rapist dirty war mongering piglet (mohhamed) was born","post_message":"\"Some people skydive, some people race cars, and some people like to fight.\""},{"comment_id":"1825547344399892","commenter_b":"Guess what? They don't want her in their sh*thole!","commenter_a":"Please stop telling them any different! We don't want them coming here!!","post_message":"More liberal condescension and arrogance."},{"comment_id":"1696261590644336","commenter_b":"Why don't you take down your wall and move the migrants in... Such hypocracy!!!!!","commenter_a":"Despicable imposter of the Catholic faith.","post_message":"POPE PUSHING OPEN BORDERS, AGAIN  details @webpagelink"},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"10153309249299740","commenter_b":"Send her the bill...stupid","commenter_a":"Well played Baltimore...... @webpagelink","post_message":"200 rioters arrested, 144 vehicle fires, 15 officers recovering from injuries, and one big mess to clean up."}]
