[{"comment_id":"1079981378728005","commenter_b":"Sick Bitch","commenter_a":"She's an immigrant through and through!","post_message":"WOW. Just...Wow."},{"comment_id":"10153129217297377","commenter_b":"There are a couple of million people in prisons and jail right now (Google it). I'm pretty sure they were taken there and didn't voluntarily have themselves incarcerated. Don't say it's impossible. That said, I think it's improbable and impractical to plan on finding 12 million illegal immigrants as a whole and deport them. Just let them remain illegal and deport them as you find them. Let them stand in line with everybody else who is attempting to immigrate LEGALLY.","commenter_a":"I think lots of them will self deport. Especially those who are gang members and have been deported and came back illegally. Cut off benefits and the free loaders will leave. States can deport.","post_message":"\"You're going to have a deportation force, and you're going to do it humanely,\" Trump says."},{"comment_id":"10157491368855389","commenter_b":"Now she needs to seperate from our government. A few years in the slammer or off to Syria where she'll be treated like every other woman.","commenter_a":"Don't care for your relationship with the Hil, but good for you on your separation from the Weiner. Anyone deserves better than that scumbag.","post_message":""},{"comment_id":"10152885307051336","commenter_b":"Totally totalitarian and just plain wrong","commenter_a":"Start pushing back people!!! They care nothing about your kids.","post_message":"UPDATE: The Goochland County School Board has now voted down the controversial policy on religious homeschooling. @webpagelink   Virginia parents are outraged over a new policy that demands home-schooled children justify their religious beliefs to a school board within 30 days of their 14th birthday."},{"comment_id":"10153608158096336","commenter_b":"Takes all kinds of a--holes to make up this world and he/she is certainly the biggest one!!!","commenter_a":"Why is this getting news? It's not mandatory to tip. If you don't get good service you don't tip. Shut up, stop whining and do right by the next customer.","post_message":"A Rutgers University student who is waiting tables at a Jersey Shore restaurant this summer to help put herself through school was given no tip on a $112.03 bill and instead a taunting message."},{"comment_id":"1174759955897808","commenter_b":"And assholes will be assholes!","commenter_a":"They are F'n PIGS... We learned that in the sixties... How soon the ignorant forget. PIGS BE PIGS... NOTHING HAS CHANGED","post_message":"We FINALLY have the proof!"},{"comment_id":"10153042217565047","commenter_b":"JH move to Israel","commenter_a":"Because our communist muslim pig so called president is one if them. America stand for Israel Defy the leadership of this commie government and fight for what is right. Stand with Gods people.","post_message":"The terrorist-led Palestinian Authority (PA) has ended its peace with Israel.  War could be imminent, so why are we still sending millions of dollars to the PA?   We must stand with Israel.  SIGN & SHARE our petition to stand with us: @webpagelink"}]
