[{"comment_id":"10152833752231130","commenter_b":"Hell yea older woman know what's up:) Amber Gray","commenter_a":"Lol. Ian.","post_message":"Yet women prefer to be younger than their partner."},{"comment_id":"840419212729882","commenter_b":"Noone else to vote for... #Cruz #Ca #DudesDontPeeInTheGirlsRoom #NeverTrump #NeverHillary","commenter_a":"More republicans don't want Trump than support him. I will be voting Ted Cruz and will say for those who have not yet voted, especially in California, please vote Cruz (assuming he’ll still be on the ballot.) In the meantime, it’s time for the Republican Party comes to its senses and throws Trump out of its ranks and exclude him from eligibility for its presidential nomination.","post_message":"So many people are using what happens now as a springboard for the future."},{"comment_id":"1300733136636619","commenter_b":"Crooked Hilary!! She lose everything ad her life evil woman!","commenter_a":"The Clintons are Milliinaires who t.Trump values over his loser voters","post_message":"They illegally set up a charity to line their pockets for foreign influence...most countries call that treason."},{"comment_id":"642467755916056","commenter_b":"@username # F*ck Hillary","commenter_a":"Clinton the queen of Benghazi and hidden e-mails. Just look at the media. They are piling on Trump while giving Hillary a pass. The debates are still too come. There is a long way to go. Hillary is a sociopathic liar and should never be president. @username and the polls mean nothing right now.","post_message":"Hillary Clinton opened up a 15-point margin over Donald J. Trump in one of the polls."},{"comment_id":"10153171665732235","commenter_b":"LMAO!","commenter_a":"you know who else loves snow days? SATAN.","post_message":"Good grief."},{"comment_id":"10153539342225329","commenter_b":"Women should have the right to ban ear piercing among them also.","commenter_a":"This is such BS.. I had my daughter's ears pierced when she was an infant and she felt the pain for 30 seconds. She was completely calm and pain free afterwards. Her ears healed in less than a week bc of how fast her body grew at that time. She had less risk of infection then (she was too young to play w her ears) and less healing time. I, on the other hand, had mine pierced at 6 and ended up with problems bc I took them out when I shouldn't have..","post_message":"“Severe pain and fear is inflicted upon infants unnecessarily,” the petition states. (via BuzzFeed Trending)"},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"}]
