[{"comment_id":"10153241147678984","commenter_b":"They can go crawl up a hog a-- with there counter parts the muslims.","commenter_a":"All the way !!!","post_message":"The stuff liberals are already saying about Ted Cruz is just disgusting...  Do you support Ted Cruz in the face of liberal criticism?"},{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"},{"comment_id":"10155244013599384","commenter_b":"We the American people deserve to have accountability for all elected officials from all branches of Government!","commenter_a":"Thank you, @username, for doing your part in bringing this situation to light. I want nothing less than a full, thorough investigation of all possible inappropriate ties between Trump administration officials and foreign powers. Pursue this to completion, wherever that leads. Thank you again.","post_message":"Mike Flynn’s resignation was a step in the right direction – but there are many more questions that need to be answered before we can fully understand the relationship between the Trump Administration and Russia. Tune in now to watch my press conference on the topic live:"},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"10150721738224999","commenter_b":"To bad nothing could have been done to stop the shooting of the first graders. If Obama wants to stop senseless violence he should stop pursuing senseless executive orders and do something like support Kates law. Crimes that are preventable through deTerence and viligiliant police enforcement can actually stop senseless gun violence. Almost nothing at all can stop a crazy person from attacking an elementary school and killing first graders. Fortunately it is an extremely rare event. The vast majority of senseless killings are actually far more preventable. Obamas convictions are misdirected. How about deporting all the illegals from the country. That right there would prevent thousands of senseless violent crimes. Read the stats. Not all illegals are criminals but none of them have the right to be here so if one of them commits a murder its because our goverment is to spineless to enforce the law. Enforce the ...","commenter_a":"I still think about Sandy Hook so much. I can't get past it. My heart still aches for those precious little ones & I still cry. Thank you Mr. President for taking a step in gun control.","post_message":"Shedding tears over the 2012 deaths of children in a Newtown elementary school, President Barack Obama announced executive actions he will take on gun laws. @webpagelink"},{"comment_id":"10153356804576336","commenter_b":"The words that come to mind wouldnt be appropriate for FB or for a lady to say....smh.","commenter_a":"Obuttma is a hug a thug..what is wrong with his brain⁉⁉","post_message":"The number of detainees at the Guantanamo Bay detention center is now 116, compared to 242 when President Barack Obama took office."},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"\"I think this guy is somebody who might want to think twice about whether he stays in the position that he has.\" -- Bernie Sanders"}]
