[{"comment_id":"10154027986557293","commenter_b":"She might Not be a ten but she still has Some Nice tits","commenter_a":"Can i drAw your Attention to an unrelated issue though; Chelsea , Being a mildly Hot Chick, is married to a nerdy looking dude with Glasses. I absolutely hate iT when beauriful women marry or have a relationship with nerdy looking men","post_message":"Ivanka Trump says she supports working moms. The women who design her fashion line don’t get paid maternity leave."},{"comment_id":"10153510075534087","commenter_b":"So, there is no room for reasonable art of the deal on either side, now? Remember what happened in 2012, fellow Republicans. You didn't turn out because Romney wasn't \"conservative enough\" for you. Then you did nothing but whine and bitch and blame it on voter fraud and your grandmother's Impetigo. The problem is not PEOPLE a from another country, it is SUBSIDIES that politicians buy votes with and ABUSE of unskilled labor and QUOTAS set by those who use prejudice to their advantage. We cannot round up 12 million entrenched undocumenteds, nor should we- it would be political and fiscal suicide. So let's get an electable candidate, get him in the WH, and start doing what we can to enforce immigration laws that protect us from terrorists and criminals, the ones Obama and this DOJ flip the bird to the SCOTUS a about, create an environment where inclusion with ...","commenter_a":"Trump all the way to the White House.","post_message":"“Marco Rubio is the front man for the open borders syndicate,” Donald J. Trump's senior policy adviser Stephen Miller said in a radio interview. “And understand this, Marco Rubio is determined to finish what he started with the Gang of Eight bill and to be President Obama’s third term on immigration.”"},{"comment_id":"2049822328577410","commenter_b":"@username Mexican rapists.","commenter_a":"My question is, why is the inauguration not being cancelled until all of this has been investigated and charges brought together? Why is nothing being done?","post_message":"\"Either Donald J. Trump and friends have engaged in treasonous acts or America’s intelligence officials are guilty of a colossal lapse in judgment — or worse, a conspiracy against Trump. Either way — whether any of these allegations are true or false — the entire matter must be investigated thoroughly and immediately.\" - Bill Moyers and Michael Winship"},{"comment_id":"10153331361449228","commenter_b":"I give up on our government and justice system. You mess with me or my family I'll kill you! There is no more calling the cops to help. I'm done! I can't belive this. My advice to every woman is get your cc and protect yourself!","commenter_a":"Police were still looking for him....I believe he will now be found dead from suicide..","post_message":"She was found with her teenage son.  Police are looking for this man"},{"comment_id":"10153688042296028","commenter_b":"No way!! Frankie","commenter_a":"He not dead tf","post_message":"Update: Prince's publicist confirms that the pop superstar has died.  A death is being investigated at the Minnesota property of singer Prince. The identity of the person has not been released. @webpagelink"},{"comment_id":"10155940183045354","commenter_b":"Does she have an extra kidney. You really only need one. Never mind it comes from her scummy body. Monster","commenter_a":"You go Hollywood stars. I wouldn't put anything past you stupid people. If you agree to selling aborted baby parts, I can only imagine how many times you all have done it. It is no wonder I can't stand almost all Hollywood stars.","post_message":"Check out the Instagram video Scar Jo appeared in for Planned Parenthood"},{"comment_id":"10154803405263128","commenter_b":"@username - worked at Her campaign she is the most corrupt person with Her $150 million from countries w Sharia Law - Killary wants globalization. Google Bilderberg Group","commenter_a":"I've lived in Utah for almost 3 decades. The state's Mormon mouthpiece, The Deseret News, has already denounced Cinnamon Hitler as \"evil\" and a wannabe dictator. That should be a warning to all you Republican conservatives out there of the quality of your candidate.","post_message":"While most political prognosticators are closely tracking a familiar group of about 10 presidential battleground states, Utah is emerging as one of the most surprising wild cards in the 2016 race."}]
