[{"comment_id":"992170134153660","commenter_b":"She is a nasty, vile woman...","commenter_a":"What about the part where it was not illegal to have that information on a private server you could have debunked it as well","post_message":"\"Ahead of the #DemDebate, this is the video Hillary doesn't want you to see.\" - Reince Priebus."},{"comment_id":"1209775645709130","commenter_b":"I vote they electrify the fences and start allowing the military to shoot them. Let those ragheads stay in their sandboxes.","commenter_a":"It is an invasion!","post_message":"\"This is not a refugee crisis or a migrant crisis, it's a mass popular movement with an unlimited supply of people.\""},{"comment_id":"10154319378806337","commenter_b":"Mfs are crazy someone please give this puppy mf a show so i can laugh everyday as he humps his wifes leg and smell her butt. Wait i do all those things. This guy is normal","commenter_a":"Oh what the fuck happened to this world..lol","post_message":"UHHHH..."},{"comment_id":"10153338017932411","commenter_b":"So the nets they snag your tuna in make those fisher people littler dicks?","commenter_a":"All the idiots who says no different then fishing. Big men that kill nature as sport. Little dicks!","post_message":"The Facebook video of the incident quickly went viral, attracting comments like, “Someone should drag that guy around in the water just for pictures.”"},{"comment_id":"1525021640848139","commenter_b":"Connie your argument makes no logical sense. You can't have it both ways. There are no voter suppression laws. Requiring an id is not voter suppression.","commenter_a":"Where was all your outrage over the treasonous Clinton pay for play entanglements? This page is so ridiculous","post_message":"Trump's not going to like this one bit!"},{"comment_id":"1246176155450245","commenter_b":"And don't come to Canada go back home we don't have any room for you either","commenter_a":"That's so true","post_message":""},{"comment_id":"884398511671457","commenter_b":"This woman is an absolute idiot","commenter_a":"Love to see you going to jail have a nice day by by.","post_message":"The message of Hillary Clinton's victory speech last night could not have been more different than Donald Trump's. Whose message is better for the country?"}]
