[{"comment_id":"802250076569145","commenter_b":"You two should be sterilized","commenter_a":"Here comes the next Republican Party split. The birth of idocracy, with trump being the first idiocrat. All right America... Goodbye.","post_message":"On the morning after #SuperTuesday, one thing is clear: the GOP is at a crossroads."},{"comment_id":"774995235932418","commenter_b":"^Oh Lord, the grammar/spelling in that last response. Anyway,saw photos, she's white but husband and kids arent, for those who care one way or another.","commenter_a":"Why doesn't the headline read white officer killed by a person of color?","post_message":"A very sad story."},{"comment_id":"10153857549396157","commenter_b":"Illegals? All I see are people trying to make a living to feed their families.","commenter_a":"Funny just realizing that? Been happening since for ever. What's worse is our own Mexican Americans doing that to them. No shame.","post_message":"'ve realized that [employers] prefer us for being undocumented because we just keep our heads down to get jobs. [We] can't afford to complain. They take advantage of us being undocumented."},{"comment_id":"1101655299855480","commenter_b":"Can't be bothered. This isn't science its novelty","commenter_a":"I'm skeptical. Tree rings are concentric not spiral. How would the needle track?","post_message":"Find out what tree rings sound like:"},{"comment_id":"10153819979530950","commenter_b":"Hillary has kept blacks where she thinks they belong. I am sick of her lies! Trump!","commenter_a":"What in the FACK is he talking abt? That an that has embraced white nationalism is calling Hillary a bigot.. Hillary has been to many black churches over the years and has many ppl of color as friends. Trump??? Never mind.. What a buffoon!!! Unfit....","post_message":"“We reject the bigotry of Hillary Clinton, which panders to and talks down to communities of color and sees them only as votes,” Donald J. Trump said."},{"comment_id":"10154087462891813","commenter_b":"Maybe after they have this 200,000 woman march on Washington Saturday for women's rights then maybe we'll finally get a female: Ambassador to the United Nations, Secretary of Education, Secretary of Transportation, Senior adviser to the President and first female to successfully run and win a Presidential campaign, female Director of small business affairs..preferential hiring for females and federal laws mandating all government workers and state workers and military personnel get the same pay for the same rank and experience? Oh and abortion on demand.....wait...","commenter_a":"powerful and mighty statement","post_message":"Today and every day, dissent is patriotic. #WomensMarchonWashington"},{"comment_id":"1088726504494434","commenter_b":"Ni en los concursos de pueblo se ve algo tan bochornoso!","commenter_a":"omg I am huge HARVEY FAN this was a horrible mistake i cant imagine how awful he must feel but thats live TV ...","post_message":"Something very unusual happened at the #MissUniverse pageant tonight...  #MissColombia was incorrectly crowned and she had to relinquish her crown to #MissPhilippines.  Social media has exploded from the result of this: @webpagelink"}]
