[{"comment_id":"10154983391004138","commenter_b":"@username so all white men are evil? Racist!!","commenter_a":"Being US citizen, I was planning to leave the US for the first time ever to visit Africa and Dubia. Now I can't even leave and visit my love ones that I haven't seen them since 1996. I am Somali American who is proud to be Muslim but also love this country just like many Muslims. . We're all the children of Adam and Eve, one nation under God, we're all immigrants. Ban Donald trump not Muslims.","post_message":"Approximately 500 to 700 people gathered at Terminal 1 to protest President Donald Trump's ban on immigrants from seven Muslim-majority countries entering the U.S."},{"comment_id":"974409115948951","commenter_b":"Yes I have! She'll make an excellent prison wife. So biblically submissive.","commenter_a":"Have you seen this yet, Guy?","post_message":"Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story."},{"comment_id":"10154635792157599","commenter_b":"The GOP is better than this. The USA is far better than this. Be bold, represent your district, and stand against the unconstitutional, corrupt administration that has taken office. The administration's actions should be leading Republicans and Democrats in Congress to work closely together and assert power as the legislative branch, rather than acting as an extension of the executive branch. #NoBanNoWall","commenter_a":"Congressman Reichert, I believe it is important to remember that the United States of America is a REPRESENTATIVE republic. As our elected REPRESENTATIVE, please REPRESENT the people of your District. You were elected to REPRESENT the people of the 8th Congressional District of the State of Washington (NOT Donald Trump).","post_message":"Careful vetting to ensure the safety of the American people is the responsibility of the federal government and one I take very seriously. Unfortunately what we saw this past weekend was mass confusion and miscommunication between government agencies and the improper apprehension of people legally allowed to be in the US. I urge the administration to work with Congress on solutions that protect our borders while maintaining our nation's dedication to compassion and religious freedom."},{"comment_id":"1246991831993261","commenter_b":"goodbye both...","commenter_a":"thats \"goodbye America\"...","post_message":""},{"comment_id":"10154474961664062","commenter_b":"And please don't be a coward and read my msg and don't reply...I wanna know your comeback and actually be real about it...","commenter_a":"I'm sure it was taken out of context by the biased media","post_message":"\"You've got to see this guy.\" He then ridiculed Kovaleski's appearance by bending his wrists and jerking his arms around."},{"comment_id":"909598592517510","commenter_b":"what a load of crap get off facebook,snapchat,instagram, pintrest,tumbler and go to sleep before 1am then see what happens and u are up at 630 because it u move so slowwwwwww be organized :) and btw u start at 9am","commenter_a":"@username Dannii Leask","post_message":"We might as well be sending teens to school in the middle of the night."},{"comment_id":"10154254253351336","commenter_b":"She's Nasty !","commenter_a":"White guilt is a real thing. Sad but true.","post_message":"“I’m a white lady. I’m an easy target,” Melissa Click said in an article."}]
