[{"comment_id":"1067523319975236","commenter_b":"That must be beacause he dosent want to give his money away....she must have hit her face he self lol","commenter_a":"His family knew she was only with him for the money. She was a lesbian when they got married. I highly doubt he would be dumb enough to hit her where he left a mark. His other wife never accused him of this. How convenient he just did it when she is wanting a pay day to go back to get female lover","post_message":"Amber Heard kept her head high after filing a domestic violence restraining order against Johnny Depp."},{"comment_id":"10153551321648984","commenter_b":"A coal burning slut","commenter_a":"Kardashian is nothing more than a SLUT! Don't watch anything to do with her, PERIOD!","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with...  Do you side with Megyn Kelly on this one?"},{"comment_id":"748895108560603","commenter_b":"Wonder where she got those mouth sores?","commenter_a":"from people that scream to be treated fairly the gay community and its supporters sure spew a drastic amount of hate.","post_message":"It's good for thee but not for me. -1000pts. @webpagelink"},{"comment_id":"10153621551297377","commenter_b":"Crazy ancient old woman.","commenter_a":"ABSOLUTELY SHE WAS OUT OF LINE. Unbecoming and in appropriate from a person in her position.","post_message":"Some are questioning whether Supreme Court Justice Ruth Bader Ginsburg was out of line for criticizing Donald Trump in two recent interviews."},{"comment_id":"10154608447428690","commenter_b":"@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"\"I am innocent, I am an honest person and I have never committed a crime.\" @webpagelink"},{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"1460895663923103","commenter_b":"😂😂😂😂😂😂😂😂😂 anit about that choking life not catching a M charge for no girl 😂 lool","commenter_a":"@username 😂😂😂","post_message":"It really be like that  #WSHH"}]
