[{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"10156326796940725","commenter_b":"Alexander Gregoire Well? Let's help the guy out and get that wall built! #MakeAmericaGreatAgain","commenter_a":"Soon, please.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"993534210682000","commenter_b":"These illiterate students should be in class learning something !!!","commenter_a":"I agree with every post here! They should have forfeited the game and then raised the tuition to cover what loss incurred that reduces tuition. End of story. But know we have encouraged the sports programs to make policy and remove employees at their will. Just crazy.","post_message":"Literally no understanding of 1st amendment rights whatsoever!  Behold your \"tolerant\", liberal colleges..."},{"comment_id":"10154335593072293","commenter_b":"Doesn't it amaze everyone how trump gets away with not being transparent at all with his tax returns, his business ventures, etc, etc, etc...but if Hillary Clinton spits on the sidewalk, the world comes crashing down on her! #DOUBLESTANDARD","commenter_a":"With most of the criticism coming from left wing gossip rags like WaPo! Lmao at the yellow journalism!","post_message":"On Monday, criticism of Comey continued to mount, notably from prominent former law enforcement officials."},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""},{"comment_id":"595624923955506","commenter_b":"yesssss bitch","commenter_a":"@username thought of you bb","post_message":"♫ I'm dreaming of a cheesy Christmas.... ♫"},{"comment_id":"10150922009204999","commenter_b":"Oh shut up!","commenter_a":"Let us have a rich street thug unfit to be a watchman of your house as Pres and ruin US. Anything that goes up should be his argument after 5 years. Pathetic","post_message":"Donald J. Trump talked to Billy Bush about women in vulgar terms, in a 2005 video obtained by The Washington Post."}]
