[{"comment_id":"1055345397919589","commenter_b":"Natural selection for the girl that's in the bikini","commenter_a":"Wow","post_message":"LIVE FROM HOLLYWOOD BEACH - Take a look at LIVE video from our Hollywood Beach Cam where the outer bands of Hurricane Matthew are making their presence felt."},{"comment_id":"10152601048042061","commenter_b":"till she open`s her stupid mouth.......again !!!!","commenter_a":"I love this photo. Most models would be posing and trying to be the focal point. I just adore the fact that stunningly gorgeous Giselle has her hat pulled down and is pointing at Tom, and not stealing a bit of his thunder. What a great couple they make!","post_message":"Coming in at number 3 in the  News midday buzz  see how Gisele Bundchen and Tom Brady and their kids celebrated the Patriots AFC Championship win: @webpagelink"},{"comment_id":"1155787421127301","commenter_b":"lmao ...#NeverCrookedHillary #JillnotHill","commenter_a":"Hillary for the love of God stop drinking!!! Your pandering is psychotic, you're losing touch with reality and becoming paranoid!!! You look old and tired!!! Put the vodka bottle down and go to bed!!! VOTE TRUMP MAKE AMERICA GREAT AGAIN !!! '","post_message":"A young girl asked Hillary, \"Do you think when you're president, you'll be paid as much as a man?\""},{"comment_id":"10155845816789778","commenter_b":"Idiots...its about illegal immigrants and nothing more....drama is what they thrive on","commenter_a":"stupid is as stupid does. these people are here legally and commit no crimes, yet they do not want the president to deport those who would cause harm or come in illegally.","post_message":"Delia Goncalves was live with Jose Andres about #ADayWithoutImmigrants.   Several DC-area restaurants will be closing as a part of the movement."},{"comment_id":"10154273295026051","commenter_b":"Illegals cant vote genius, doesnt Trumps morin base know 95% of his workers are illegals working on HB2 visas ? He games the laws to get illegals to work for less money because he says he cant find experienced US workers, he thinks Americans are fucking idiots and lazy and Boy did he get that right !!","commenter_a":"Once you take all the illegals out, she will have lost the popular vote too. The electoral college was created for a reason. Should not be changed!","post_message":"Hillary Clinton continues to increase her lead in votes over Trump despite losing the election. Do you think the electoral college should stay?"},{"comment_id":"10153954150653606","commenter_b":"actually I love me some Tom Collins","commenter_a":"Love me some Pat Collins","post_message":"FUNNY MOMENT OF THE MORNING: \"I have more layers than a Smith Island Cake\"- Pat Collins"},{"comment_id":"10153891729051680","commenter_b":"While Melania was pregnant.","commenter_a":"Right, because he was just a young, naïve, 59-year-old predator.","post_message":"Donald Trump released a video statement apologizing for his sexually aggressive comments about women, saying the words caught on tape in 2005 do not regret who he is."}]
