[{"comment_id":"10153559794027464","commenter_b":"Specifically,she wouldn't let others issue them -- it must be HER Signature on the license.","commenter_a":"She should be granted conscientious objector status. Others were willing to issue the licenses.","post_message":"Today, judicial lawlessness crossed into judicial tyranny. Today, for the first time ever, the government arrested a Christian woman for living according to her faith. This is wrong. This is not America.  I stand with Kim Davis. Unequivocally. I stand with every American that the Obama Administration is trying to force to choose between honoring his or her faith or complying with a lawless court decision.  In dissent, Chief Justice Roberts rightly observed that the Court’s marriage decision has nothing to do with the Constitution. Justice Scalia observed that the Court’s decision was so contrary to law that state and local officials would choose to defy it.  For every politician — Democrat and Republican — who is tut-tutting that Davis must resign, they are defending a hypocritical standard. Where is the call for the mayor of San Francisco to resign for creating a sanctuary city — resulting in the murder of American citizens by criminal illegal aliens welcomed by his lawlessness?  Where is the call for President Obama to resign for ignoring and defying our immigration laws, our welfare reform laws, and even his own Obamacare?  When the mayor of San Francisco and President Obama resign, then we can talk about Kim Davis.  Those who are persecuting Kim Davis believe that Christians should not serve in public office. That is the consequence of their position. Or, if Christians do serve in public office, they must disregard their religious faith–or be sent to jail.  Kim Davis should not be in jail. We are a country founded on Judeo-Christian values, founded by those fleeing religious oppression and seeking a land where we could worship God and live according to our faith, without being imprisoned for doing so.  I call upon every Believer, every Constitutionalist, every lover of liberty to stand with Kim Davis. Stop the persecution now."},{"comment_id":"1077284305661431","commenter_b":"Hillary for POTUS! Hillary 2016! THE MOST QUALIFIED CANDIDATE! #imwithher","commenter_a":"You will never be our president, and I cannot wait to see what you do when the FBI files against you! I think your failing political career is dead!","post_message":"“To me, that’s the best of America and it keeps me going. That sense we are all in this together. We all have vital contributions to make. And that when come together, all of us, with a sense of shared purpose and shared humanity, we can solve any problem we face. We can heal any divide. We can build a future that is far, far better than our past.” –Hillary during her speech on breaking down barriers in the African American community"},{"comment_id":"378908105805941","commenter_b":"These people are demon possessed. They need to be stopped.","commenter_a":"Trumps fault","post_message":"MUSLIM MEN WHO RAPED 11-YEAR OLD Shout \"Allahu Akbar\" At Sentencing...The Girl Had A Baby At 12   No remorse whatsoever..."},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."},{"comment_id":"904971426268782","commenter_b":"If they are illegels they can't vote cause they,are not citizens","commenter_a":"They most definitely, without a shadow of a doubt should not now or ever be able to vote! ONLY citizens of these great United States of America have the honor and privilege to vote in elections! Period! End of story!","post_message":"Last I checked illegal means illegal and you have no rights in America!"},{"comment_id":"10153573127079268","commenter_b":"then get up lock n load and go fight..i dint want my kid dying for your stupid ass. Wordy @username","commenter_a":"\"Republicans trying to find a way to go to war and make their sugar daddies happy.\"","post_message":"The House is looking for a loophole."}]
