[{"comment_id":"10154465918697235","commenter_b":"She might have been taken off because she is a hateful bitch. I cannot imagine someone would want to have sex with her.","commenter_a":"He should have taken you off the air YEARS AGO, Andrea Tantaros for being a LIAR and ILL-INFORMED. Good Luck with your impending lawsuit. Hope to never see you on the air ever again.","post_message":"WHOA"},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"},{"comment_id":"10156336306105354","commenter_b":"She has pretty skin like a white woman, she talks like a low- information angry blue-gum.","commenter_a":"Melissa Harris Perry should be worried about her ideology. She's in the minority.","post_message":"Melissa Harris-Perry: You know what Americans worry about? They worry about their kids and families being terrorized, raped, robbed, and murdered by criminal illegal aliens--people who should have never been in our country in the first place. THAT is what Americans worry about."},{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"1297208260357707","commenter_b":"How can she do that from behind bars","commenter_a":"Only three more days of this fake bullshit, then Hillary will shut your lying asses up.","post_message":"The Associated Press may be the most venerable wire service in the world. However, they're now under massive fire after the sickening offer they made to the Clinton camp was just discovered...  The press is willing to do anything to stop Donald J. Trump, and this is yet more proof."},{"comment_id":"10154100383542452","commenter_b":"Possibly the saddest thing I've ever heard... so sorry for your loss","commenter_a":"That is so heartbreaking @username","post_message":"BREAKING NEWS: A woman who was killed when a tree fell on a wedding party at a Whittier park has been identified as the mother of the bride."},{"comment_id":"868334796545922","commenter_b":"Heather go live in that cave","commenter_a":"If the public would STOP using Craigslist, it would shut down...as long as people continue using it they will stay open.","post_message":"Georgia police have confirmed that two bodies found Monday were identified as Elrey and June Runion. The elderly couple vanished last Thursday after they went to meet someone who had responded to a Craigslist ad they posted: @webpagelink"}]
