[{"comment_id":"10153467199834255","commenter_b":"Look bitch, I'm done with you. FACTS seem to hurt your little righty brain.","commenter_a":"I've been hearing these stupid comparisons for days now. How friggin ignorant can some people be? A racist flag flying over a state building and rap music?? Such utter fools.","post_message":"The stupid. It burns."},{"comment_id":"10154034711816770","commenter_b":"You know damn well its the ladies who wizz all over the seat when they do their \"hover\"","commenter_a":"Tired of people thinking they can change the law because they are a part of a small percent of people married to same sex. It's bad enough we have men in a dress pissing all over the toilets in the ladies room.. Being gay shouldn't give you special entitlement.","post_message":"The Supreme Court of Arkansas ruled late this week that LGBT persons who are married to a child’s birth parent but not biologically related to the child do not have a constitutional right to be listed on the child’s birth certificate."},{"comment_id":"10153082765311955","commenter_b":"Are you bitches inbred or just drank the kool-aid? ?","commenter_a":"Fucking baphomet bullshit EVERYWHERE 😡","post_message":"MADONNA FALLS HARD"},{"comment_id":"950390221741940","commenter_b":"here comes people saying. \"no deport them all\" and stuff. and yet they forget who really made America. found by immigrants. the Irish had a very hard life back then, the hate saying this word, African Americans had a harsh life, people whats the difference between illegal immigrants and legal immigrants. a legal immigrant can be much more dangerous than an illegal. look what happen in 9/11. Boston bombing. ect. and how is it that an illegal can have a job, without knowing the English language. no American education?? the come here, and still believe that the American dream is still alivem but we Americans are the ones that destroyed it.","commenter_a":"THAT'S the way! No one is \"illegal\". We are ALL human beings and should treat one another accordingly.","post_message":"\"We need to take 11 million undocumented people out of the shadows, out of fear, and we need to provide them with legal protection,\" Sanders said."},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"10152942942461130","commenter_b":"You'd call them \"girls with their vaginas hanging out, ass showing and everything else.\" Cool ?","commenter_a":"Good. This needed to happen.","post_message":"Um..."},{"comment_id":"10154018390388984","commenter_b":"they need to stop her for good","commenter_a":"YES","post_message":"Wow, things just keep getting worse and worse for Hillary Clinton. I wonder if she saw this one coming...  Do you hope Hillary gets defeated?"}]
