[{"comment_id":"1178538995510357","commenter_b":"I would have moved too.","commenter_a":"Ungrateful people if they really look at the whole picture officers are out there protecting us,don't judge the rest because of the other bad apples.Now they got to deal with criminals and the society plus news reporters.Too bad the officers can't close their eyes and walk away and say I don't want to help you guys!!!!!! But they swore under oath they will serve and protect you!!!!!!!","post_message":"The officers even covered the couple's tip."},{"comment_id":"10152804178333445","commenter_b":"I am too good for Reggie foo. Keep that shit.","commenter_a":"Ya dumbasses the shit from cali been growing by the mountains .and guess who growing that the mexicans .indica or sativa its the same shit. Stop acting like you are too good for Reggie. Spoiled ass dudes.","post_message":"Legal Marijuana Screwing the Mexican Cartels  @webpagelink"},{"comment_id":"10153373472869411","commenter_b":"Bugger off Rosa!","commenter_a":"Will sodomite marriage replace traditional marriage in Ireland?","post_message":"Check out our interactive map of the #hometovote trending worldwide  inside this article"},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"10153002783667522","commenter_b":"She will come back with stilettos and her boobs hanging out.","commenter_a":"Oh Rodney I thought this was one of your favorite shows?","post_message":"It looks like Nancy Drew may be getting the Grey's Anatomy treatment:"},{"comment_id":"10154453372292149","commenter_b":"She, Bill are too quiet. Beware: they are coming back.","commenter_a":"Go to Jail........","post_message":""},{"comment_id":"1215097765244658","commenter_b":"To announce that there must be no criticism of the President, or that we are to stand by the President, right or wrong, is not only unpatriotic and servile, but is morally treasonable to the American public. Theodore Roosevelt","commenter_a":"Obama top 5 worst presidents ever.","post_message":"President Obama delivers his first news conference since meeting with President-elect Donald Trump."}]
