[{"comment_id":"1322741314433625","commenter_b":"MORE POWER TO THE AMERICAN PEOPLE AND GO SUCK AN EGG TO U DAM MUSLUMS.","commenter_a":"If that's what they want, let them start their own school, with their own money.","post_message":"JUST IN..."},{"comment_id":"10153541764830779","commenter_b":"Lmao ugly her ugly ass","commenter_a":"Of course she feeling lemonade considering how many times Bill cheated lol @username","post_message":"Hillary Clinton visited 'The Ellen DeGeneres Show' for an interview that airs today, with the Democratic candidate discussing a variety of topics from potential vice president picks to her admiration for Beyoncés 'Lemonade.' Watch her play \"Who'd You Rather: VP Edition\" below, and see who she would choose as her running mate."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10154184530456167","commenter_b":"And before anyone gets on me for it, personhood is moot and an unsupportable argument because of bodily sovereignty. Nobody, adult or child or fetus, is entitled to use someone else's body parts without their permission, EVER. If you have kidney disease you don't get to take someone else's kidney by force - not even if your life depends on it and you'll die painfully if you don't get it. If you have leukemia and need bone marrow, you cannot take it from someone else without their consent - even though marrow is fully replaceable by a healthy adult and it'd only be a temporary inconvenience to them. Men can't use a woman's genitals for their own pleasure unless she consents - that's why rape is (supposedly) a crime (even though punishment for it has been tragically lax these days). A woman's uterus is HER body part, she has it ...","commenter_a":"It's just a political witch hunt, like usual. It's not about women's safety or anything like that - it's about earning points with their base on the backs of Texas' poor women.","post_message":"**Fourteen** investigations have cleared Planned Parenthood of all wrongdoing, for starters."},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think  or hope  that once the primary wraps up, tensions will subside."},{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"10153738179686037","commenter_b":"She is looking for $$$. Obamacare is expensive","commenter_a":"Good for her! Everyone else is expected to do their job the way it's suppose to be done..why shouldn't this doctor? Most doctors don't like to be questioned or for you to have an opinion. She ruined this wonderful experience for these parents. Birth is a day to day normal thing for her but for the parents it's something they will never forget. Some docs need to get off their high horse and realize they're not always right!","post_message":"“I can’t be the only person out there this is happening to,” Lindsay Scarborough Switzer tells Yahoo Parenting."}]
