[{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"711540485694496","commenter_b":"The noose tightens.","commenter_a":"Deport him to Russia","post_message":"Dems bringing pressure."},{"comment_id":"963078257120853","commenter_b":"She's an ass","commenter_a":"Idiotic.","post_message":"Hillary Clinton says allowing 10,000 Syrian refugees is a \"good start\", but she wants to bring in 6 TIMES that number."},{"comment_id":"10153171709824456","commenter_b":"HISTORY","commenter_a":"I am so glad I took part in history glad to be a Masonic brother","post_message":"The march to Montgomery is underway...  @webpagelink"},{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10153497102100163","commenter_b":"His wife","commenter_a":"I don't believe this..","post_message":"Waka Flocka Flame's longtime girlfriend explains why the couple decided to part ways"},{"comment_id":"730431657058963","commenter_b":"Stupid ass talk to text I sent hats off to Mr Gilbert who donated 10.5 million to Toys for Tots you can say what you want about these new country singers but I like mr. Gilbert's music and a bunch of the other ones and if you don't like that you kiss my ass","commenter_a":"You can say what you want but these new country singers other not countries in a sucker most of butter how many people you know to get stoned.5 million for toys for tots hats off to mister yogurt hold a good man and a good singer and if you don't like it like that you kiss my ass","post_message":"“Whether a kid is into Barbie or Star Wars, I hope we’ve given a bit of fun and inspiration.”"}]
