[{"comment_id":"10154092848234087","commenter_b":"A special letter to Republican nominee Donald J. Trump: Dear Sir, In a way, you are no better than your narcissistic alter ego. When told what you say is considered sexist, racist, classless, hurtful, and you say it more, you are a self-centered narcissist. Speaking off the top of your head, yelling hurtful insults, slinging mud, your unsophisticated intellect comes as somewhat surprising. It is apparent there is no limit to what you will say. For starters you are unapologetically low class: women ooze blood Hillary cofounded ISIS \"Hillary Clinton is a bigot!\" punish women for abortions kill terrorists and their families proposed mass deportation force African Americans use food stamps extreme vetting of Muslim immigrants if Ivanka wasn't daughter, he'd date her Mexican immigrant murderer rapists cancel Obamacare (offers no alternative) \"you have to be wealthy in order to be great\" \"putting a wife to work is a dangerous ...","commenter_a":"WE ARE CONCERNED ABOUT YOUR QUESTIONABLE BUSINESS DEALINGS OVERSEAS AND YOUR FINANCIAL TIES TO THE MOB AND OTHER COUNTRIES 1.\\tWill you sever ties with your company linked to foreign leaders, questionable organizations, and criminals if you become president? 2.\\tHow will you handle non-cancelable contractual obligations with parties whose interests conflict with those of the United States? 3.\\tWhile refusing to release your tax returns, how will you confirm that you do not have dangerous financial ties to bad actors abroad? 4.\\tIf you were willing to work with Qaddafi known terrorist and dictator there anyone you aren't willing to make a deal with? Who? 5.\\tHow can you be tough on Iran, given your business partnership with someone connected to Iranian money laundering? 6.\\tGiven that you've already questioned our commitments to NATO allies, what is your answer to this? For example, how would you handle the millions of dollars flowing into your organization ...","post_message":"Bernie Sanders ripped the media for letting itself be manipulated so easily by Trump."},{"comment_id":"637619693095276","commenter_b":"Lock her up","commenter_a":"ITS FUCKTARDS LIKE YOU THATS FUCKED THIS COUNTRY UP ,, AND THE LIVES OF YOUR KIDS !! G E T T O T R A S H. !!","post_message":"This woman is bragging about stealing your tax dollars.  Disgraceful. She should be kicked off welfare and be forced to pay us back immediately.  Do you agree we should kick her out of the country?"},{"comment_id":"842181922581654","commenter_b":"@username If you don't understand \"propagate\" look it up... your ignorant conservative bullshit is EXACTLY why we're debating here... you see, your \"bullshit\" has infected EVERYWHERE............. the terrorists, the refugees, the billions of dollars stripped from pensions, healthcare, education, infrastructure, to support conservative idiots and their dumb-fuckery... you ass-clowns should take ALL the fucking refugees, and house them in the districts of the same fucking idiots that voted for those wars (not the acts that empowered your fuckwit) in the first place. Comprende, dickhead?","commenter_a":"Don't worry ... Kerry is drafting an official apology to Putin right now","post_message":"This is what happens when you don't have a REAL leader in charge....Un-freaking-REAL."},{"comment_id":"717976815002166","commenter_b":"Did you read what I said? Or did I lose you after ESPN? By law, you cannot force someone to give up their body, body parts, body tissue to ANYONE, regardless of their life being in danger. So you can't force a woman to give up her body and blood and essence to someone who you've notably identified as a completely other person. And ps, bananas also have their own DNA. Oh shit looks like we can't eat fruit.","commenter_a":"I read Planned Parenthood does 30% of all abortions. Who is doing the rest of them?","post_message":"Appalling on every level. THEY MUST BE STOPPED!"},{"comment_id":"10157698667015354","commenter_b":"Oh dam black bonnet girls make the rocking world go round!!","commenter_a":"Rumspringa. @webpagelink","post_message":"Here's a headline you don't see every day..."},{"comment_id":"10153494400717093","commenter_b":"They some hoes","commenter_a":"@username Mayra Castaneda","post_message":"Instead of going into a legal battle, the Dallas owners want the public's help picking a new name for the restaurant. @webpagelink"},{"comment_id":"723136044452880","commenter_b":"We've had enough of these bull Shite DEBATE CRAP!! Stop this insanity, who agreed to this shite?","commenter_a":"wont be watching","post_message":"The debate you can't miss.  Watch Thursday, March 3rd at 9p ET on Fox News Channel and stream live on foxnews.com."}]
