[{"comment_id":"10154319507055329","commenter_b":"Haha complete and utter shit show Xxx","commenter_a":"Charlotte, number 4 and not number 5 lol!","post_message":"Here's to the tea addicts!"},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"},{"comment_id":"10153639008667098","commenter_b":"Down the street prima","commenter_a":"@username @username not near you guys?","post_message":"WOAH, that's a big sinkhole. It's over in Madera near Fresno and it's almost 20 feet deep.   Read more: kron4.com/2016/04/12/video-giants-sinkhole-swallows-street-in-madera/"},{"comment_id":"1846250902324669","commenter_b":"Don't pay pajama boy any mind! He'll be out of office in 30 days. Thank God! Then a real alpha male will show him how to run a country. Can't wait until the wuss is out of our White House and Trumps takes over.","commenter_a":"\"They don't produce anything that anybody wants to buy\", well, dear Americans, you are using Russian Soyuz space rocket to go into space, cause you just can't anymore.","post_message":"President Obama on Russia: \"They're a smaller country, they're a weaker country, they don't produce anything that anybody wants to buy.\""},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"644515682393824","commenter_b":"Hi liar y!! Tear down that wall. Let all illegals in that wish to come in and take stuff for free!!!","commenter_a":"I love that Trump is not afraid to call bs when he sees it!!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"}]
