[{"comment_id":"881902208536195","commenter_b":"At least he is not a puppet, says the supporter of Marxist-Leninism.","commenter_a":"Funny how the enemy jumps straight to laugh..at what seems to be normal..we love you BOB born to be stronger, born to live longer...91years of age...and still fit ...let them laugh...You are the GREAT ZIMBABWE WALL..you don't need to go to care home...unlikely some white folks at your age will die alone in their care home...without grand kids....","post_message":"Robert Mugabe orders the internet to delete images of him falling over at event... and this is how it responds."},{"comment_id":"10153636980216135","commenter_b":"I can't believe an older women like your self could be so ignorant. I've always been taught if you don't have anything nice to say DON'T SAY NOTHING AT ALL! How can those words even come from your mouth. Where is your morals?","commenter_a":"I'm so sorry for his family and friends, but what can you say about someone that stupid...?","post_message":"Police say the man was driving his car in reverse with the door open when he fell out."},{"comment_id":"545764515614128","commenter_b":"Is she that dense ??","commenter_a":"If she was subjected to shariah law, she sold wished it never happen. Major mistreatment of women","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"10150659306454999","commenter_b":"@username ..her lips not legs","commenter_a":"She is right, raising your arms doesn't mean a lot. Her getting multiple corporate donations to sway the way she passes bills does. U.S. Senator Bernie Sanders pointing out that every other politician does the same thing, and he is attempting to change the precedent does. What a lame attack from Clinton. This just made my opinion of her lower, not raise.","post_message":"Hillary Clinton also said that the candidacy of Donald J. Trump was a \"bad development for our American political system.\""},{"comment_id":"10158316523410578","commenter_b":"Lock up homegrown terrorists!","commenter_a":"OUT OF HERE ILLEGALS.","post_message":"Do you support the Immigration Crackdown? \"As we speak, immigration officers are finding the gang members, the drug dealers, and the criminal aliens and throwing them the hell out of our country. And we will not let them back in. They not coming back in, folks. They do, they going to have bigger problems than they ever dreamed of.\" - President Trump @webpagelink"},{"comment_id":"10156147874195725","commenter_b":"YES AND TAKE GLENN BECK WITH HER.......","commenter_a":"Agreed.","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10153320570936509","commenter_b":"The $2.1 billion isn't what I'm talking about...., keep reading.","commenter_a":"Tax break? He promised not to raise taxes on anyone making less than $250,000 then slams Obamacare down the throats of every American which is one of the largest tax increases in the history of our country aimed directly on the shoulders of the \"middleclass\".","post_message":"Many in the middle class, particularly the single and the elderly, won't see any tax breaks under Barack Obama's Middle Class Economics plan: @webpagelink"}]
