[{"comment_id":"10152955099256336","commenter_b":"They sound like a bunch of babies saying the same thing over and over again. Do it don\"t just say words.that mean nothing. You are not scaring these animals do something.","commenter_a":"Lt. Col. Peters ,just another fool on FOX, Susan Rice.... heads the NSA.","post_message":"“Secure, expand, defend, leverage – her four points. Bill, that’s not a strategy, that’s a bumper sticker. The yogurt I had for breakfast had more intellectual structure.\"   Lt. Col. Ralph Peters slammed National Security Advisor Susan Rice’s speech on the United States’ national security agenda."},{"comment_id":"10153898357108984","commenter_b":"@username - there is a huge difference between then and now regarding \"camps\" and rounding up people; if the refugees were peaceful, they have proven otherwise, but if they were- they would not be in \"camps'- we didn't round up the illegals and place them in camps- the only reason they would be in camps now: time to be thoroughly vetted before allowing them among the citizens in America. Reasonable- yes.","commenter_a":"It seems as though the Founding Fathers knew something like this could happen, and in the Constitution under the 9th, and 10th Amendments gave each State the right to Sovereignty. State's that \"believe\" in the Constitution should be able to break away from those that want excessive government control, and socialism! the de-centralization of power is essential to the preservation of \"Freedom\", Washington has no more right to control us than London does. There is a reason we are defined as \"States\", and not Provinces. we are sovereign state with our own constitutions. Our union was formed as an agreement between the States. Texas itself made it part of the agreement to join the union that they could leave at anytime. America was founded as a Confederation. Abraham Lincoln destroyed our states rights. I can assure you that Washington will not hold us together by force should we choose to ...","post_message":"One state is taking the refugee crisis seriously, and they're now making a huge move to send in the National Guard.  Obama may be able to bully other states, but this one's not having any of it.  Time for the rest of the states to follow their lead!"},{"comment_id":"10153100644667431","commenter_b":"This girl knows nothing she is just as dumb as her ancestors, she is going to tell us that everything our ancestors fought for was a lie, no way our ancestors fought to keep our history alive and white people just want to erase us from history, don't let her finish her ancestors mission because she knows nothing she is a sheep, she doesn't even know about the underwater city they just found off the east coast of america a city that is older then her,,,,IM a descendant of a monkey theory, We know our history and can prove it with artifacts SHE CANT","commenter_a":"@username that's not true. The Bearing Strait Theory has been disproven by DNA and language development experts. Turtle Island is our original home given by the Creator","post_message":"Native American at Anti-Immigration Protest: 'You're All Illegal'  @webpagelink"},{"comment_id":"10154551399261178","commenter_b":"Ummmmm I don't think so","commenter_a":"The roaches got away...Cleveland turned on the lights , Philadelphia turned out the lights...the roaches got away","post_message":""},{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"10154133413586350","commenter_b":"Not cow milk. We are the only species who drinks another animals milk. You've been sold to drink milk because it gives you calcium but it does the complete opposite. It's all about $$$ Do your research, people! Cow's milk is not good for us.","commenter_a":"My siblings and I were fed carnation milk from a can and then whole raw milk from the bulk tank in the barn We're are all healthy and allergic to nothing.","post_message":"Is nonfat, low-fat, reduced-fat or whole milk best for your children?"},{"comment_id":"10156595781460192","commenter_b":"Not Christian not even NICE!","commenter_a":"Lets just all work to eliminate race ...that so hard","post_message":"What are your thoughts on this sign?"}]
