[{"comment_id":"946663845429868","commenter_b":"One thing that is jumping out at me about this shooting in South Carolina is the way the community has come together, whites and blacks as ONE community. I look at this and than think back to Ferguson and Baltimore, what a difference. And yet so many times I have listened to liberals post on @username about the hateful, bigoted small minded people of the south. God Bless the people of Charleston and the families of the victims of this hateful crime.","commenter_a":"Hold on, those who love God will see you through, especially, those from that Church and all Churches that love the Lord Jesus Christ.","post_message":"“Oh my lord, he’s done made our life a living hell. What he did was unspeakable.”   -Carson Cowles, Dylan Roof's uncle"},{"comment_id":"10153115054444091","commenter_b":"You are 100% right about Starbucks.","commenter_a":"I blame Dunkin' Donuts....if they had a drive thru, this wouldn't have happened. If he drove through a Starbucks, I would have bought him coffee!","post_message":"A 16-year-old who was practicing driving for his learner's permit with his mother, crashed into a Dunkin' Donuts in Glen Rock Sunday morning. MORE: @webpagelink"},{"comment_id":"1033897839973602","commenter_b":"God bless you and your mommy","commenter_a":"Welcome little one","post_message":"Do you remember our story of the pregnant woman who was carjacked on the way to the hospital?  Story --> @webpagelink Well, she had her baby yesterday. Help us in welcoming the adorable Malcolm."},{"comment_id":"10154177400546756","commenter_b":"I do not intend to vote for her in Any case. Her shady politics, her Attitude, the skewed way this contest has been run, and my basic gut reaction of Strong Dislike for her are nearly overwhelming enough but... This recent tack she has made Insisting that the Democratic party MUST Permanently Give Up on things like Universal Health Care, drug reform, campaign reform, college access, and essentially Everything that Really Matters to ME as a voter has Convinced me that I CANNOT - under Any Circumstances pledge My Vote for her. To do so would be to Agree with her disgusting defeatist position. The truth is, this is the Same reason I will not vote repugnican. And, while you may say my actions make it more likely a Rep. will win, I see no Real hope in a Hillary win Worth Voting FOR. Deal with it.","commenter_a":"So, for those who will not vote for Hillary Clinton if she becomes the democratic nominee, do you think it is possible that this will result in a GOP victory? Would that actually be better for the country?","post_message":"Hillary Clinton is projected as the winner of the Nevada Democratic caucus, according to AP. #NVcaucus"},{"comment_id":"10153180567873690","commenter_b":"its for this reason lisa muslims want to have it all they fight amongst each other blame the west and on top of it want sympathy from westerners as you said americans fought to be where america is today we still struggle with our own issues but theres a constant progression all be it slow .. why is it that muslims are dying to come here ? why cant they look around at the state of their people and see its something wrong with their way of life ? why is the rest of the world capable of governing their own but arab leaders oppress and steal from their citizens speak to arabs off record they all say they hate arabs and wish they werent arab .. very telling .","commenter_a":"my favorite is when muslims say 1400 years ago christians did this or that f off! the world has moved on everyone except muslims. ha and ohh in the time of muhammed this or that again f off that was 3500 years ago not relevant .","post_message":"Opinion: The religious identity of violent perpetrators is only highlighted when they're Muslim. @webpagelink"},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""},{"comment_id":"966617630016374","commenter_b":"When a Women is \"with child\" she is eating for Two.Respect starts with self-respect.","commenter_a":"53 million abortion deaths since 1973.","post_message":"Truly frightening"}]
