[{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"1765146687072705","commenter_b":"Do it dools ya pussy","commenter_a":"Dooley Whitton","post_message":"What you need to know about Flakkathe alleged drug used by an FSU student who fatally stabbed a couple."},{"comment_id":"1678080125806065","commenter_b":"THE ONLY GOOD FILTHY MUSLIM IS A DEAD ONE.........KILL ALL THE BARBARIC BASTARDS........KEEP THEM OUT OF THE UNITED STATES....THERE IS NO PLACE IN THE WESTERN WORLD FOR SUCH 3RD. WORLD SCUMBAG BASTARDS LIKE THEY ARE.......GOD BLESS HIM AND HER FAMILIES......ODUMMER IS TO BLAME FOR THE RAPES AND KILLINGS HIS BARBARIC BROTHERS ARE DOING.....HE HAS COMMENTED MURDER FROM LETTING THOSE BASTARDS INTO \"OUR\" COUNTRY.....ODUMMER IS TO BLAME FOR ALL THE RAPES AND KILLINGS THOSE MUSLIMS ARE DOING............HE SHOULD BE BROUGHT UP FOR TREASON AND MURDER JUST LIKE KILLARY.........","commenter_a":"Oh yeah, we need to b ring them all here with their religion of love!!!!When is our government going to wake up and smell the coffee????","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack  This is tragic. His died with honor, let's send our prayers for his family.  Can we get 100,000 'LIKES' for him and his family?"},{"comment_id":"288699034881182","commenter_b":"Now, have you been able to fill these jobs with non immigrants?","commenter_a":"What were they expecting to happen...","post_message":"From Oklahoma to New York, bosses fired groups of workers after they didn't show up at their jobs in order to protest at last week's \"Day Without Immigrants\" demonstrations."},{"comment_id":"911159142284175","commenter_b":"Wtf! Lmao dumb bitch","commenter_a":"@username @username 😂","post_message":"SMH"},{"comment_id":"1077236902352732","commenter_b":"Ya \" maybe in Florida . You know were the Zika mosquitos were found!!!","commenter_a":"Yeah...but nevermind when democrats block Zika funding. @webpagelink","post_message":"How do they sleep at night?  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."}]
