[{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""},{"comment_id":"10153461070784614","commenter_b":"Yup they should FRY !!! Not next week not next year but NOW !! Those are extremely sick people who can do that and don't deserve to breathe air .","commenter_a":"Sick. There are really some evil people in this world. God rest his soul","post_message":"A good Samaritan who offered his help as an AA sponsor was lured to a downtown L.A. hotel by a couple for the purpose of fulfilling \"long-held fantasy\" of dismembering a body, prosecutors say.  Edward Garcia was convicted of murder Tuesday in the torture and dismemberment death of Herbert Tracy White.  Prosecutors say Garcia carved up White's body with a 3 1/2-inch blade and dissected and sliced a piece of leg muscle from the bone.  Hotel employees found White's severed arms and a backpack full of flesh in the room. Under the blood-soaked bed was White's torso riddled with scratches and small punctures.  \"It was a bloodbath,\" prosecutor John McKinney said. \"They took this man apart.\"  Read KTLA's story here: @webpagelink"},{"comment_id":"10153520854786519","commenter_b":"Religious fanatics are scarier than loudmouths like Trump . We don't need evangelical bigoted haters running our country.","commenter_a":"His campaign is using some of the same consultants for foreign policy as Hillary Clinton's campaign- now that is scary","post_message":"Ted Cruz never misses an opportunity to remind us it can always be worse..."},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"10153743310093606","commenter_b":"Sad, if she didnt want the child I would have taken her no questions asked","commenter_a":"She needs shoot","post_message":"HORRIFIC: A 6-month-old baby girl died Thursday afternoon after police and witnesses say her naked mother dangled her from the window of an apartment building in the Bronx before throwing her to the pavement six stories below. @webpagelink"},{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":" have only been two black winners in the last 20 years for album of the year.\""},{"comment_id":"10156133513175389","commenter_b":"No!!!!! They want to change our culture to theirs, we shouldn't allow that!","commenter_a":"We should allow Christians in.","post_message":"Question of the Day: Do you think America should be taking in refugees from the Middle East?"}]
