[{"comment_id":"10153968954135695","commenter_b":"Read article it happened in Pittsburg","commenter_a":"Way to go ga.","post_message":"“They told me I was OK to park where I was, as long as I was not on the curb… then I come out and I'm being towed,\" one parent said."},{"comment_id":"10155004670634203","commenter_b":"I can't stand the smug bitch. Liberal fake news network is perfect for her.","commenter_a":"She's got 11.5 months to decide whether Santa is still white.","post_message":"Note Megyn Kelly's use of the word \"journalists\" here..."},{"comment_id":"963433877025367","commenter_b":"DICKHEAD","commenter_a":"Do not support his movies. He will have to stop acting. Rotten person","post_message":"Shocking!"},{"comment_id":"543511749143213","commenter_b":"@username hell don't exist kid you will rot just like eveyone else when you die and are burried","commenter_a":"we aren't animals anymore we used our intelligence to go beyond that, why would we want to back track? I wouldn't want my kids seeing them sexual or not. Or my husband sexual or not. No matter how much we try to \"not sexualize\" them, they always will be and there will be women and men who will sexualize them. It's not hard to leave a fucking shirt on","post_message":"Women everywhere are freeing the nipple  but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."},{"comment_id":"10153416828258525","commenter_b":"Sure hope he's single so girlfriend or wife don't wipe him out and leave him with nothing JS","commenter_a":"Paige Zirkle Calhoun","post_message":"$2 MILLION FLORIDA WINNER: Not only did the Sanford teenager match all five numbers, it was his first time playing and he used a play slip that he found that was already filled out!  STORY: @webpagelink"},{"comment_id":"10153095892296955","commenter_b":"How childish","commenter_a":"You gotta realize Nancy Pelosi, he's a better man than you'll ever be.","post_message":"White House warns Netanyahu not to reveal Iran details...   'Days when Jewish people remain passive in face of genocidal aggression are over'...   Broadcast Networks Refuse to Carry...   'Enraged' Pelosi freaks on floor...  Dems LASH OUT at Netanyahu, Tell Him to Go Home, Call Him 'a Child'..."}]
