[{"comment_id":"10156205227255354","commenter_b":"ALL yes ALL of them...with the illegals! !!!!!!","commenter_a":"I would support someone who wants to deport all Muslims.","post_message":"Guess what percentage said they would..."},{"comment_id":"1818799778404105","commenter_b":"It is time for a woman president peeps..........this is not the woman.","commenter_a":"She may have one the debate, but America lost in this Presidential election","post_message":"Join Hillary live in North Carolina for her first rally since winning last night's debate → IWillVote.com"},{"comment_id":"10153656346543352","commenter_b":"I could careless about all that bullshit it's a proven fact your ugly ass hell & I damn sure look better than you on my bad day, you look old & wash up do your hair & get some better make up stop acting like your a model , you don't have ninjas checking for you mines face looks. Better than yours hoe","commenter_a":"Remove this dumb bitches ovaries make sure she doesn't get the chance to even enjoy a child if she ever wanted one after you take her shit out throw her away in jail","post_message":"Woman Hit With Murder Charges For Aborting Her Own 5-Month-Old Fetus In Her Car With Illegal Abortion Pill, Causing Baby To Die 30 Minutes After Abortion"},{"comment_id":"817910918313603","commenter_b":"there in panic mode now. they will say any thing in hoping it will stick. Trump 2016!","commenter_a":"We been speaking out against racist police since 1776.......","post_message":"\"For the past 7 years the folks have been witness to ... intense verbal attacks on police officers, labeling them racists ... a culture that now demands political correctness, even if it goes against sincerely held religious beliefs.\"  In his \"Talking Points\" tonight, Bill O'Reilly explained why he believes Donald J. Trump is appealing to voters. Do you agree? bit.ly/1TuevKb"},{"comment_id":"10154058784600044","commenter_b":"Classy fucking skank whore right there. Haha","commenter_a":"Kick her in the pussy","post_message":"Feminist Protestor Assaults Infowars Reporter Owen Shroyer"},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"988968067881864","commenter_b":"Wake up woman","commenter_a":"I am not an HRC supporter, but folks, please don't start reposting these kinds of photos. This could have been taken hours before the event. If you can show me this size crowd with HRC on the stage, then I would repost. If you repost and it's false, the left will attack you and We all lose credibility","post_message":"SHOCK PHOTOS:"}]
