[{"comment_id":"10155425708285354","commenter_b":"this.mother.fucker.die.when.does.it.end.helloooooo","commenter_a":"Clearly seeking a larger selection pool for White House jobs.","post_message":"Take a look at the rap sheets of the 22 convicted criminals Obama just pardoned..."},{"comment_id":"943876645729114","commenter_b":"Put her as a no fly list and jail","commenter_a":"🖕🏿","post_message":"When this Black Lives Matter entitled brat threw a fit on an American Airlines flight after not getting her way she started up the accusations of racism immediately.   'LIKE' if you think this race-baiting BLM supporter got what she deserved."},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"1692664807687298","commenter_b":"She is evil...completely stupid","commenter_a":"She needs help that was sick","post_message":"This is SICK!   End the Cop-Hate NOW. #AllLivesMatter"},{"comment_id":"10152608166460667","commenter_b":"This is about as bad as actresses who make 10 million a film talking about income inequality","commenter_a":"American Sniper sucked! It was full of conservative propaganda. I'm shocked it was even nominated.","post_message":"Oscars count: Grand Budapest Hotel: 4 Birdman: 4 Whiplash: 3 Boyhood: 1 The Imitation Game: 1 Selma: 1 The Theory of Everything: 1"},{"comment_id":"10155157643776162","commenter_b":"Someone needs to go in there and knock her in the head about 50 times","commenter_a":"OMG!!!","post_message":"HEARTBREAKING ABUSE! \"I told you to stop feeding the dog human food!\" Please share to help find the caregiver who was caught on video repeatedly hitting and swearing at a 94-year-old woman suffering from dementia. The victim son set up the surveillance camera after noticing bruises on his mom. @webpagelink"},{"comment_id":"10154311715577293","commenter_b":"DUMP IS A BULLY BUT ONCE HE IS CHALLENGED, HE CAVES. REMEMBER HOW MEXICO WAS GOING TO PAY FOR THE WALL?","commenter_a":"I worry about it probably in a southern state. sTrump supporters have suspended all logic and common sense. I am sure that professionals in the mental health field can talk about group hysteria. sTrump is already stirring the pot in an effort to incite his supporters. They've already suspended logic so I expect that some will act. Look at sTrump rallies...","post_message":"Half of likely voters fear violence either on Election Day or after."}]
