[{"comment_id":"1825166017710828","commenter_b":"BUILD THE WALL!!! Go Trump","commenter_a":"Trump now has my vote. This lawlessness has to stop. There is nothing racist about wanting to enforce laws that apply to everyone. I do hope he can be talked out of the wall though. We need improved cooperation and relations with Mexico. Not a big wall dividing us. Both countries need to crack down on crime and make sure people moving between the two countries do it legally. Only way to have a civilized society is to enforce the laws. If laws are unfair, let's change them. But let's do it legally and civilly. Trump is not the racist monster that the liberal propaganda machine makes him out to be.","post_message":"\"Hundreds of cars were forced to make a U-turn less than three miles from a Donald Trump rally today after protesters parked in the highway to block Trump supporters from reaching the event.\""},{"comment_id":"10153492592416336","commenter_b":"Lol, I guess I won't state the obvious...","commenter_a":"No that's not okay, nor professional. What is okay is to speak to the parents and ask them to remove the child until he or she is calmer.","post_message":"Darla Neugebauer, owner of Marcy's Diner, said she’s not sorry for yelling at a 21-month-old for crying in her restaurant because it got the girl to be quiet.  Is it okay for a restaurant employee to yell at a child?"},{"comment_id":"10154653727828812","commenter_b":"Don't Feed the Trolls","commenter_a":"Oblunder doesn't have a problem spending other people's money. A true Saul Alinsky Elitist.","post_message":"Ellen DeGeneres, Magic Johnson, NBA star Grant Hill, and Hollywood heavyweight George Lucas were among the party-goers at President Obama's blowout birthday bash at the White House Friday."},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"853673114823265","commenter_b":"Hilderbeast is a lesbian. She don't want no pecker...just power.","commenter_a":"Bill said he couldn't father a child because he contracted mumps as a teenager that made him sterile. Hillary had an affair with Webb Hubbell who is the father of Chelsea. How could he then be this girl's father? A paternity test will answer the question.","post_message":"Teen girl comes forward at worst possible time. She just dropped a bombshell right in the Clinton's lap. Do you think Hillary has no chance at winning?"},{"comment_id":"10153676490604071","commenter_b":"GEE HIS WIFE DIDN'T TELL ANYONE DID SHE What Crap","commenter_a":"This is coming from the Obama administration not the FBI. This guy works for the president, he will say and do anything Obama wants him to","post_message":"\"Some of our most productive relationships are with people who see things and tell us things who happen to be Muslim.\""},{"comment_id":"10155940729650354","commenter_b":"Sick disgusting bitch","commenter_a":"hahahaha yes she was tim...","post_message":"Unbelievable...."}]
