[{"comment_id":"967666993287466","commenter_b":"Lying sack of s@&$. Only pigs do that.","commenter_a":"These Muslims make up the most unbelievable lie's .","post_message":"46 Yr Old Millionaire Muslim In Court For Raping Teen: “I fell on her and penetrated her by accident’"},{"comment_id":"10153278392893352","commenter_b":"Bitch,just ruined my happy day.","commenter_a":"She neither loved her children or deserve to be called their mother. Her hatred for her husband superseded the lives of her children.","post_message":"Mother ‘burned her three children to death and rang their father so she could tell him “Listen to their screams – they won’t survive” after he demanded custody in Belgium’"},{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"494202484098498","commenter_b":"Do they want her cause America doesn't want or her trashy ole man and her entire trashy family oh and take Bruce with them too","commenter_a":"If you vote for Hilary , I'd be scared as much as she travels.","post_message":"Is Kim Kardashian West a secret agent? @webpagelink"},{"comment_id":"1357316664288360","commenter_b":"You have got to be kidding. These people are making bad decisions how long are we going to baby adults too stupid not to do drugs? Why can't our country figure out what ILLEGAL means? How about illegal immigrants and illegal heroin.","commenter_a":"its better then clinton","post_message":"Ithaca's mayor wants to open safe injection rooms for heroin users."},{"comment_id":"782076235316287","commenter_b":"Go now obama!","commenter_a":"Yes please leave if you are offended by our flag or if you disrespect it. LEAVE","post_message":"SHARE if you agree!"},{"comment_id":"1214061615292067","commenter_b":"@username Just WHAT is racist about wanting to put up a wall to help keep illegals out of our country? What is racists about wanting to deport those illegals who are here? Since when did ILLEGAL become a race?","commenter_a":"I got my country back and I'm not giving it up to some drunk retarded ignorant fool like Palin","post_message":"Sarah Palin says it's time for everyday citizens to take our government back. Do you feel the same way?"}]
