[{"comment_id":"252211541884990","commenter_b":"Not worry about it.. woman should be seen, not heard","commenter_a":"Why don't you just take your ball and go home","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law.   Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning.   If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department will hear from all of us, too.   Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist."},{"comment_id":"10156286873240389","commenter_b":"As Hillary Clinton would say \"What difference does it make\".....NONE!!! #DefundTheGOP!","commenter_a":"Welcome back John Boehner!","post_message":""},{"comment_id":"10153355238128984","commenter_b":"They love talking about themselves. Bunch of dumb thugs. God make them go back under the rocks they crawled out of.","commenter_a":"A is A. (Aristotle)","post_message":"Both Obama and Baltimore's mayor have called the rioters by a one-word name that has generated controversy..."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"10153728493184203","commenter_b":"No average, healthy adult woman should really be under 100 pounds!!","commenter_a":"What is their definition of fat?","post_message":"Body-shaming."},{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"\"We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,\" said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"10153798375353984","commenter_b":"She looks like saying anything about anything .she's a criminal herself.","commenter_a":"She has been untruthful about alot. Wonder about the taxes for them. Why is the government supporting their foundation. Need to separate them from government.","post_message":"Hillary just got caught admitting she would do something BIG to guns in America and the NRA if elected, and it's going to have conservative's heads spin.  Do you think a Hillary Clinton presidency would be one of the worst things that could happen to America?"}]
