[{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."},{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"1385834498103243","commenter_b":"Lmao!!!! BUSTED!!!","commenter_a":"TRUMP 2016. Only liberals make excuses for crime. You do the crime you do the time cause its that simple. Trumps the man thats gonna bring back real punishments for all these thugs than thinks they can mess with other folks belongings. Trumps the man thats gonna bring back real law n order and get our country built back up.","post_message":"The West, Texas, fertilizer plant blast killed 15 people and injured 160 others."},{"comment_id":"637619203037928","commenter_b":"Screw you DOUCHE BAG!","commenter_a":"Death penalty on her to just for giving birth to him and the other syco!","post_message":"This is upsetting."},{"comment_id":"649308955259683","commenter_b":"Stfu you stupid bitch.","commenter_a":"Gifts from the illegals","post_message":"A new disease is spreading like wildfire, doctors calling it the new aids.  Share this with your friends and family.  Have you seen these symptoms?"},{"comment_id":"611669965660278","commenter_b":"Hillary shouldn't be the Democratic nominee for the Presidential Election. She should be an inmate in a maximum security prison!!!","commenter_a":"well that would include her also wouldnt it, you know, being funded by the saudi's and all !","post_message":"FUNDING TERRORISM --- AND THE CLINTONS."},{"comment_id":"10155292793551509","commenter_b":"Look at all the zombies/paid trolls. #imwithher at the hospital HitLIARy will never be president.","commenter_a":"Hillary can't attend a simple ceremony without collapsing, can't lead a nation and not fit to be president! One more reason to vote Donald J. Trump 2016! Those who plant injustice will harvest disaster, and their reign of terror will come to an end. Proverbs 22:8. Hey liberals?? Look what has happened to your Hillary Clinton!! Karma is real!! And justice is being served!!","post_message":"Hillary Clinton's exit from Sunday's September 11 commemoration set off a flurry of questions and concerns about her health.  For the reporters who cover her, there was also frustration."}]
