[{"comment_id":"906009439519420","commenter_b":"Sure, give 'em free food, free healthcare, free education, a driver's license, free housing -- am I missing anything. We can take in millions of refugees. Why not? Just because we're broke and have to borrow the money from China means nothing. Just cut the military and give the savings to the refugees. Bring in more and more. So what if some of them are terrorists who will kill and blow us up. Obama says they are like the Mayflower Pilgrims. Afterall, we're transforming America, right?","commenter_a":"fight it as long as possible, they don't deserve food stamps.","post_message":"Here it comes, gang..."},{"comment_id":"10153146887251955","commenter_b":"She is ugly like hell!!","commenter_a":"Hair fell out because nothing in her head to attach to","post_message":"Bald first lady?   'Jeopardy!' appearance raises questions"},{"comment_id":"899588953421066","commenter_b":"Even Satan and the demons in Hell believe God exists. They know He does. Why aren't they in Heaven?","commenter_a":"There Will Never Be An Excuse Big Enough To Convince Our GOD That Killing Innocent Babies Is Okay! :(","post_message":"Do you agree?"},{"comment_id":"10152630103907894","commenter_b":"Ladies love you to death but clearly you are being unfair in this matter 70 to 80 percent of custody battles in this country land in your favor whether the father is fit or not whether he is financially stable or not so for you guys to be sitting here some type of quote unquote outraged about this is ridiculous. knock it off.","commenter_a":"Some women needs to be careful who they sleep with","post_message":"Ludacris Wins Primary Custody of His Daughter"},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says \"keen\" anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"1100002276704629","commenter_b":"Whats more important to the RNC? Having Hilary as President or winnning the Presidency with. Trump, a Republican. They need to listen to the people .","commenter_a":"This would most certainly put Hillary Clinton in as first female pres.","post_message":"Should Romney run as an Independent against Trump and Clinton?"},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"}]
