[{"comment_id":"10154099546462377","commenter_b":"How about all of us that approve? No one asked me if I approve the transition? Comon, same old story as we heard during the lection!!!","commenter_a":"Awe !! Get used to it .","post_message":"More than of half of Americans disapprove of how Donald Trump is handling his presidential transition, a new Gallup poll reveals."},{"comment_id":"10158076017090577","commenter_b":"It is the Muslims that enslave women to the day!!!!","commenter_a":"Really? Muslims want to bring up slavery? It was Muslims that SOLD the slaves to the US. It is Muslims that perpetuate slavery in Africa and the Middle East today! Where is the outrage for THAT?","post_message":"What this guy said about America won't sit well with Donald J. Trump voters..."},{"comment_id":"10153554179988984","commenter_b":"This twat is too dumb to breathe on her own","commenter_a":"Ignorant. I wonder what rock they found her under.","post_message":"I've heard a lot of crazy things from liberals, but this has to be right up there at the top of the list...  Has this woman's PC \"outrage\" gone too far?"},{"comment_id":"10153247983639411","commenter_b":"Why so you can kill some hardworking people going to work or school children. Blow yourself bitch and take some jihadists pigs back with you you prostitute. Hope you fry in hell you piece of shit.","commenter_a":"She shouldn't be allowed back into the UK","post_message":""},{"comment_id":"1236747943048399","commenter_b":"#NeverEverHillary #CrookedHillary #LockHerUp","commenter_a":"I can't believe the uneven coverage you get. Trump lies daily and people don't care. You don't even have to do anything wrong and the republicans and media blow it out of proportion.","post_message":""},{"comment_id":"980308098739718","commenter_b":"Who in the hell watches Cnn anyways. Tell that bitch to go to there country and try an speak her mind they will cut her head off. Hopefully.","commenter_a":"More Leftist Fuckers !","post_message":"Alisyn Camerota is the CNN hack who cross-examined me after the jihad attack on our Garland free speech event, as if it had been my fault that we were fired upon by Muslims. So it is no surprise that she is calling on Americans to be sharia-compliant."},{"comment_id":"1033160160077065","commenter_b":"And why don't you keep your fat mouth shut?","commenter_a":"Divorce the fat pig and get Urself a nice slim lady!","post_message":"Wife won’t ler husband see her naked after pilling on 140lb"}]
