[{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""},{"comment_id":"1033603779993966","commenter_b":"Please guys, read it again. \"The VIRUS'agrees that vaccines cause autism. Maybe vaccines cause stupism?","commenter_a":"Viruses are not to be trusted.","post_message":""},{"comment_id":"10155066370401509","commenter_b":"So trump does something good and the left will still whine like stuck pigs and try to spin it.","commenter_a":"Sadam Hussein was Trumps mentor.","post_message":"Donald J. Trump  last month forgave more than $47 million in loans he made to his own campaign committee"},{"comment_id":"10154036425721336","commenter_b":"Mary yes they will be out, and then be invited right back in as legals. We call that boomerang amnesty.","commenter_a":"Trump belongs in prison along with Hillary and Obama.","post_message":"TONIGHT: GOP presidential candidate Donald J. Trump like you’ve never seen him before – Don't miss 'Watters' World' at 5p and 8p ET."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you.   Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"},{"comment_id":"528408970683016","commenter_b":"ghetto skank bitch","commenter_a":"They have,gotten away with it for six years and will keep doing it tell they leave the white house","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"}]
