[{"comment_id":"1022105807844423","commenter_b":"@username Mexico can barely afford to do anything for it self what makes you think it's going to pay for a damn wall? Because let's think about this..America is scared you are living in fear. Last time I checked Toddlers kill more people with guns per year in the USA than Terrorists do.","commenter_a":"As soon as #DonaldTrump builds the wall, Hillary needs to be tossed up and over the wall into Mexico!! #Trump","post_message":"Making public colleges and universities tuition-free is not unrealistic. It's necessary. — Sara Goldrick-Rab"},{"comment_id":"907462056016714","commenter_b":"Terry, but the illegals are taking away jobs from the blacks. WAKE UP. Joes trying to help you.","commenter_a":"GO JOE!! ..........someone needs to investigate these corrupt Liberal Judges","post_message":"And it gets worse ..."},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"10155085398339726","commenter_b":"I believe the term is illegal aliens... They are not immigrants. Immigrants come here legally.","commenter_a":"They spent billions of dollars on illegal immigrants every year and little to nothing on infrastructure.","post_message":"This is why you should care:"},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"1761764947438429","commenter_b":"@username you do realize Hilary wants to deport illegal immigrants too right? She announced it this last week.","commenter_a":"Women should feel insulted that the first female ever to be nominated also happens to be a corrupt, cold, calculating, ruthless, lying crook. If we're going to give the distinction of 'first woman nominee' or, God forbid, 'first woman president' to anyone, she is, quite literally, the last woman in the country who deserves the honor.","post_message":""},{"comment_id":"10153487799954087","commenter_b":"This was Trumps plan the hole time.... They followed like a bitch in heat... And she did.... Trump just out smarted them again... We will see him on TV along with the debate","commenter_a":"Little baby Trump can't handle having Megyn as a moderator. What a sorry excuse for a presidential candidate.","post_message":"#BREAKING: Donald J. Trump accused Fox News of \"playing games\" and said he would skip Thursday's Republican debate in favor of an event to raise money for Wounded Warriors."}]
