[{"comment_id":"1729114903976145","commenter_b":"Every country in the world should sink down these illegal Chinese fishing vessels wherever they are out of their rightful jurisdiction or territorial waters.They are becoming nuisance to every country's territorial water.","commenter_a":"GOOD, THEY ABUSING ALL THE COUNTRIES TERRITORY AND NOT RESPECTING THEM, THEY THINK THEY CAN JUST COME AND TAKE ANYTHING, LIKE WHAT THEY ARE DOING IN THE PHILIPPINES AND NEIGHBORING COUNTRIES.","post_message":"The Argentine coast guard says it chased, opened fire on and eventually sank the Chinese vessel."},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"1196992380374839","commenter_b":"Too bad all his accusers wernt nasty enough!!! .lmao...","commenter_a":"Not going to happen!","post_message":"We're in Raleigh, North Carolina where Elizabeth Warren is campaigning for Hillary Clinton. @webpagelink"},{"comment_id":"10153334990238132","commenter_b":"There will always be someone looking for the controversy in something as simple as a picture is a baby in a flag. Move on! Be proud of our flag and the POSITIVE way is being displayed. AMERICANS have done worse to our flag!!!","commenter_a":"Any true American can not dislike this photo. This photo is what patriotism is all about! Anyone that has an issue with this photo must not have been born here, because this is what patriotism is all about. Thank you sir for fighting for our freedom.","post_message":"What do you think of the controversy that this photo is creating?"},{"comment_id":"10154210673661509","commenter_b":"Sean Small look up The Southern Poverty Law Center. Look at how many WHITE HATE GROUPS that exist. A lot of them have the word AMERICAN in their names. Some of them you probably don't even know they are considered HATE GROUPS. Only 2 black hate groups are listed and BLM is not one of them. The fact that you harp on on BLM just shows you are ignorant. Why don't you focus on the NUMEROUS WHITE HATE GROUPS??? Why don't you focus on getting rid of these people in white hate groups who continue to infect this country with a disease she doesn't seem to be able to cure \"RACISM\"?? Maybe if you and people like you concentrated on fixing your HATEFUL and RACIST THINKING then racism and discrimination wouldn't exist and the BLM would have no reason to be. I don't condone violence at ALL. Violence again police ...","commenter_a":"Strange that this makes news, but when the Black Supremacist from the BlackLivesMatter hate group sends out hits on cops... they are called freedom fighters and said to be striking out against oppression. They are either both evil or both good. You cannot have it both ways.","post_message":"Two Virginia men were arrested on accusations of being white supremacists plotting to bomb black churches and synagogues as part of a race and hate war, federal authorities said."},{"comment_id":"10154237264628908","commenter_b":"Safe from all the predators but not from mosquitos.","commenter_a":"I like the idea of being up off the ground. I wonder if you could feel the bear or tigers fur under your back? The option of over the water is very appealing when it comes to lions, tigers, and bears oh my! Army Ant territory too. I think I would feel safer over a calm river, not up too high, but out of reach of most animals, than on the bank. Also, I imagine up in the air, not as much heat is extracted from your body as when you are on the ground.","post_message":"These tents suspend from trees! Get the experience of a hammock and a tent all in one. Thanks Tentsile!"},{"comment_id":"575394812634636","commenter_b":"Thanks for the giggles","commenter_a":"i know i'm not the only one who thinks dwayne johnson looks like the rock","post_message":"The brawl occurred after Cage reportedly pulled Vince Neil off of a woman at the ARIA Resort & Casino."}]
