[{"comment_id":"10156351998640354","commenter_b":"NO HE IS NEVER GOING TO BE A WOMAN. BORN MALE ALWAYS MALE JUST A TWISTED FRANKENSTEIN MONSTER THAT OUGHT TO BE SHOT. @username","commenter_a":"NO MEN IN DRESSES IN ANY LADIES ROOMS ANYWHERE IN AMERICA. EVEN IF HE HAD HIS GENITALS REMOVED.","post_message":"How upside down is the world when this even had to be voted on in the first place?  That said, LOOK at the percentage of Houston voters who voted for and against this..."},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."},{"comment_id":"10153487298809877","commenter_b":"This is a very fine line that people are walking, it's offensive because if you think about it you are saying a woman is a ho and you don't even know why she is dressed how she is dressed. Women are the worst....if you want to wear a form fitting dress...go for it.....if not....that is good for you. Please stop.","commenter_a":"I don't understand where the problem is. That is her choice and I commend her.","post_message":"Ayesha Curry Says She's Not Into 'Barely Wearing Clothes,' Prefers to Keep it Covered Up for Husband Steph. Twitter had plenty to say about that! Read more below.  Grio fam, we say 'do you' when it comes to fashion. What's your reaction?"},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"689912921147432","commenter_b":"The left is aligned with the most pathetic in society!","commenter_a":"Very bad Photoshop ! Are you serious?","post_message":"This is really creepy. Look how close he is?"},{"comment_id":"495965727273607","commenter_b":"we don't want that pussy here anyway","commenter_a":"Whatever","post_message":"Bruce Springsteen and Bryan Adams are HUGE Hypocrites!!!  They play their \"music\" in countries that throw gay people off buildings, but ban perverts from going into a little girls room and all of a sudden they got a problem???P"},{"comment_id":"10153009688681051","commenter_b":"Of course hollis god says if you're not with me your against me.. you send yourself to hell .. Muslims will enjoy and do enjoy rape murder and torturing you then sending you to hell.","commenter_a":"How disgusting and disgraceful. Christians are always like keep Christ in christmas, being back the pledge and the nativity scene and I love rebel flags, but the moment another person who doesn't believe their same beliefs is shamed, they point fingers and laugh. all of these people that think deeply offending someone's religion is a joke don't deserve to bear the name of christian. Have some discipline...","post_message":"The Muslims who thought they were buying halal products at this store just found out they had been eating pork the whole time."}]
