[{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"\"How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.\"  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"901969823182419","commenter_b":"Girls like my weiner better.","commenter_a":"Nassssty fat pill..... puke","post_message":"A hot dog on a donut packed with bacon and jam... Here's where you can get it: @webpagelink"},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"395052417343306","commenter_b":"We aren't screwed...again, RESEARCH MELLIE! See how much illegal immigrants attribute to the economy, then come back.","commenter_a":"Yay for Texas on this. But too bad Abbott was able to get Obama's immigration reform halted by a federal judge.","post_message":"Did you ever think you'd see this happen? Congrats Texas!!!"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."},{"comment_id":"1420936454624649","commenter_b":"I hope that this administration will figure out how to keep us safe without becoming totally isolationist. Not all immigrants or Muslims are terrorists. Weed out the bad but don't turn away those who honestly need our help and who only want to make this counrty a better place.","commenter_a":"Do you know you have done more than every other country to help?","post_message":"Senior Politics Writer John Haltiwanger is at JFK International Airport where there's a massive protest against President Donald Trump's refugee and Muslim traveler ban."},{"comment_id":"1248101021932790","commenter_b":"ALL CiTIZENS in this country have ID, ALL of them. so STFU about ID laws, only the corrupt want them","commenter_a":"Only clueless and the corrupt don't want voter id laws, REAL citizens WANT them as they stop the DEAD, non citizens and people voting multiple times. All of which are the exclusive territory of the left and the Dems.","post_message":"Dem Strategist Blames Hillary's Wisconsin Loss on Voter ID Laws [VIDEO]"}]
