[{"comment_id":"10153206668181162","commenter_b":"I'm understand u Julie I feel the same sometimes I hate my own race the Humans!! I gonna try to adopt him.","commenter_a":"Are you kidding me??? I. HATE.HUMANS!!! Find the SOB who did this and shoot them! Disgusting! People make me sick. Praying for this poor dog <3","post_message":"\"SWEET SURVIVOR\": After being was shot twice, this dog will still survive. Police found her tied to railroad tracks and rushed her to the vet.   Once she is healthy, she will be up for adoption @webpagelink  Officers have named the dog R&R. (Photo via Twitter @TampaPD)"},{"comment_id":"10153185005136323","commenter_b":"@username how can you possibly call immigration colonisation? I am an immigrant to this country and I have no intention of imposing my way of life on every person living here or subjugating the \"indigenous\" people of this land. I think I can speak for the vast majority of immigrants in saying that they also do not intend to do so. Most immigrants integrate into society. Perhaps you just don't like the way they look like. As was stated before, Britain is 85% white. All these people fearing that this country is swamped by brown and black people, Eastern Europeans and other pesky foreigners need to get their facts together. Moreover, study after study has proven that immigration is indeed beneficial to the British economy. We may also not forget that Britons emigrate to other countries in large numbers. This is not a one way street. Immigration is part of ...","commenter_a":"For a country whose language is a mix of old german, latin and celtic language, i'm laughing. In the past, Brits never had any issue with colonizing Australia our the US and imposing their culture (or \"civilization\") to the native populations. That's so ironic !","post_message":"A quarter of Britons think the government should encourage immigrants and their families to leave. That's people like Mehdi Hasan. He argues that while hostility to outsiders may not be a new phenomenon, the so-called immigration debate is now toxically out of control. Anti-immigration sentiment isn't a result of increased immigration, but fear and prejudice  Meera Syal: Growing up between cultures is tough – until you realise it’s a creative blessing: @webpagelink"},{"comment_id":"1332532336775650","commenter_b":"Trump \"Hillary is a Bigot\" there you go! This is exactly where this phrase came from~ the Pot Calling the Kettle Black. Okay you Mexicans can stay in the US , But must pay, I will Not build the Wall, Mexico will not have to pay for it , I Love the Mexicans, my African Americans, Muslims and attractive women... I was only Joking, being sarcastic, just a suggestion. I love Rachel Maddow! ha","commenter_a":"I think it is hilarious the Trump supporters come to a Hillary site and post their idiotic remarks. Like their posts have any meaning or validity. It's not like they are going to have any affect on changing Hillary supporters minds.,","post_message":"8 things you can do *today* to help elect Hillary: hrc.io/2bQizDc"},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":""},{"comment_id":"10154420350898797","commenter_b":"She dont need those racist mother f**ckers","commenter_a":"Beyoncé has a concert coming up in Florida. Guess what? I read not enough off duty Police want to work it. Karma be a beeoch.","post_message":"BEYONCE BOYCOTT: The police union deemed her performance - which included allusions to the Black Panthers, Black Lives Matter, and Malcolm X - \"antipolice.\""},{"comment_id":"10153550520716336","commenter_b":"Hillary might be in jail.","commenter_a":"It's obvious that @username wants Jeb Bush to be the Republican nominee. On the Debate last night, NO ONE received harder questions than Donald Trump. NO ONE! I don't want Jeb Bush or Donald Trump to be the nominee. @username you're NOT being Fair and Balanced.","post_message":"Which GOP presidential candidate do you think gave the most impressive performance during the Fox News-Facebook prime-time debate?"},{"comment_id":"718993818288909","commenter_b":"They're here illegally they don't get rights moron!","commenter_a":"No one is saying we cant police our borders...but we must do so with Constitutionally appropriate actions. After all isnt it our CONSTITUTION that we are protecting, that we are asking out service member to protect with their lives. It makes no sense to me that we are willing to throw out the very basis of our great country because we are so fearful. We must be strong and remember our core values.","post_message":"Trump is keeping his promise! I don’t care how much liberals scream and protest… A NATION HAS A RIGHT TO POLICE ITS BORDERS, ESPECIALLY FROM VIOLENT CRIMINALS!   LET'S get 10,000 SHARES for our President! No Judge Can STOP His plans To Make America GREAT AGAIN!"}]
