[{"comment_id":"584218068426739","commenter_b":"For sure playing the women card. Wouldnt have 5% of the vote without a vagina. Whos voting for vagina????","commenter_a":"Are you going to play the women card for the rest of the election? it's getting really old really quick....","post_message":"Like a boss."},{"comment_id":"10153517289928352","commenter_b":"They needa kill your ignorant ass.","commenter_a":"Idk but kill it","post_message":"An alien-like creature fished out of a toxic river or a neglected bear: What IS this scary looking beast which can chew through its steel cage?"},{"comment_id":"10152956831331130","commenter_b":"Wow... talk about a student taking the teachers to school.","commenter_a":"Her parents really wrote a good speech.","post_message":"Somebody give this little girl a medal!"},{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"1240022466017781","commenter_b":"@username Yes, but less human.","commenter_a":"The correct term is undocumented immigrants. It is not right to say illegals. We are all part of the human race. As an American born citizen I say that Trump is wrong. Undocumented immigrants are very important to our work force. They work very hard. Some work harder than those born here. If we send all undocumented immigrants back it would put this nation under. Yes we have a immigration problem. But fix it the right way. Undocumented immigrants deserve a chance as we all do to live in a country like ours.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10152904733026051","commenter_b":"I would love to get my hands on the bitch who wrote that! I'm very sorry that there are people out there like that.","commenter_a":"Key their car","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"10153026446831336","commenter_b":"I know makes me wanna puke.. she'll finish off destroying what Obama didn't...","commenter_a":"The United States part , we supply job applications to ISIS fighters","post_message":"Iraqi forces backed by Shiite and Sunni fighters have begun an offensive to recapture the northern town of Tikrit from ISIS militants, state TV reported."}]
