[{"comment_id":"10153263682739342","commenter_b":"Bill I don't want white people dead I want bush dead","commenter_a":"Good now hang him","post_message":"Former President George W. Bush surprised a crowd at a Dallas courthouse Wednesday when he appeared for jury duty."},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"},{"comment_id":"10153121748346615","commenter_b":"Ok. Let them run free then","commenter_a":"Start turning in the shooters.... It's that simple","post_message":"A call for peace and justice: Coming up on Channel 11 News at 6, see how dozens of residents in Homewood held a rally to honor lives lost to violence in the city."},{"comment_id":"1199350936785736","commenter_b":"How much is she paying herself","commenter_a":"Woman has mental health issues. I believe it is called hallucinating. She also has a friend that is also dropping the same acid and she just got smashed in the presidential election!!!","post_message":"CNN HOST To Jill Stein: “Have You Seen Any Direct Evidence That Anyone Hacked The Voting Systems In MI, WI And PA?”…”Um…no” [VIDEO]"},{"comment_id":"911046885608046","commenter_b":"LIKE I SAID, SHE KILLED THOSE KIDS. A BEE?! Get out of here with that mess. Throw the book at her. @username,","commenter_a":"Whatever!! She killed those kids.","post_message":"Two 18-month-old twins drowned in an Arizona canal Friday after their mom briefly let go of their stroller to fend off a bee: @webpagelink"}]
