[{"comment_id":"1193495714026101","commenter_b":"If they can live by our laws get out of our country","commenter_a":"Amen !!!!!!!!!! They must be stopped from take over and destruction. All states please follow. Help us keep our great nation. !!!!!!!!!!","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"10152934995226680","commenter_b":"Seems you want to engage in gossip. I got better things to do with my time. Scoot along Andrew.","commenter_a":"Bernie's right. The biggest mistake of the Clinton administration was dismantling Glass-Steagall.","post_message":"Bernie Sanders: \"Allowing commercial banks to merge with investment banks and insurance companies in 1999 was a huge mistake.\""},{"comment_id":"10155021026963984","commenter_b":"You are so full of life, Tom, your birds, your cats, your home, Butch, your family, your love of antiques and craftsmanship, your sense of fun, on and on. Just don't want you to let what is beyond any our control override the richness of all you have in your life. Isn't it amazing how much we reveal about ourselves in little vignettes of our lives. Called sharing, and all of us as your Facebook friends enjoy your posts very much.","commenter_a":"Judge Pirro comments were so articulate, to the point, and crystal clear honest evaluation of exactly what has happened to our wonderful country in the last eight years. I remember so clearly Michelle's remarks at 44 years of age saying it was the first time she had been proud to be an American, I was shocked beyond words! To accept so much as we are given as Americans and not to be thankful and proud of our country and our fellow everyday wonderful citizens, Americans! Color or religion are immaterial, Americans and I for one am so thankful for being one and never fail to appreciate what it is to be American. Thank you Judge Pirro for your concise evaluation of Michelle Obama.","post_message":"In the final days before the Obamas leave the White House, Fox News' Judge Jeanine Pirro just gave Michelle a parting gift she'll NEVER forget."},{"comment_id":"1193282647400517","commenter_b":"If she was White n this said about Hillary she then would be in jail!!!' Evil","commenter_a":"Then arrest her!","post_message":"OOPS, Another BLM moron gets what they deserve for making violent threats, this time against The Donald. [READ BELOW]  Can we get 5,000 'LIKES' to support classifying BLM as a hate group?"},{"comment_id":"1657934121091027","commenter_b":"What did they expect???? Idiot Merkel....","commenter_a":"A bunch of neanderthals","post_message":"The reports of assaults have added fuel to Germany's migration debate."}]
