[{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10154505390413037","commenter_b":"Well most of those benefits we pay go to lazy white people. Look up the facts lol","commenter_a":"So people who have been here 20 plus years....working, shopping, law abiding and not on welfare.....being healthy, productive members of society should be forced to leave.....i don't agree with that nor do I think that is fair! So called Christian people! Our country is not right......","post_message":" now because a lot of people came in illegally there no way we can even apply for papers.   Lara graduated in 2016, was her high school valedictorian and received a full scholarship to UT."},{"comment_id":"10153779129081336","commenter_b":"If she took responsibility where is the jail time?","commenter_a":"The fact that she is actually running in 2016 with all this going on shows me that there major sociopath here... MAJOR!! At least wait till the Bengazi investigation is over and maybe not in the front of our minds.. Can't believe she is running.. I don't get how people could vote for someone who lied straight face to the country ,,,","post_message":"\"I took responsibility, and as part of that, before I left office, I launched reforms to better protect our people in the field and help reduce the chance of another tragedy happening in the future,”  Hillary Clinton said a short time ago at today's Benghazi hearing."},{"comment_id":"10156410898495725","commenter_b":"@username he does not have to insult Hillary's looks. She does a good job of insulting herself.","commenter_a":"I would love to watch Donald Trump debate Hillary Clinton! He will tear her a new one!","post_message":"The last person Hillary Clinton wants to run against - is Trump! I will be her worst nightmare! #Trump2016"},{"comment_id":"10157076549400354","commenter_b":"Does the rules say you can steal another candidates votes like he did with Ben Carson?","commenter_a":"Cruz is playing by the rules...PERIOD. Elections have been done this way your entire life. There is nothing different from other elections, with the exception of a whiny, sniveling, jealous loudmouth. Too bad Trump hasn't been paying attention to the rules.","post_message":"\"Ted Cruz has no chance of winning this without bribing the delegates. That’s his game at this point. He’s mathematically eliminated....\"  WATCH:"},{"comment_id":"10153090646372411","commenter_b":"omg it's getting old","commenter_a":"Madisen AndCody LMFAO! I'm not surprised are you?!?","post_message":"BREAKING NEWS: Chicago Bulls Derrick Rose was injured in practice today after taking an elbow to the face.  He will undergo surgery tomorrow. \"After the procedure, a timetable for return to play will be determined,\" the team said."},{"comment_id":"994048267321588","commenter_b":"Yes. And paid for by private donations","commenter_a":"Gorgeous yet not gaudy. Most important: Everything was Made in the USA . Wasn't it?","post_message":"Michelle Obama blows $600k on ‘modest’ dining room makeover"}]
