[{"comment_id":"10153183466936336","commenter_b":"It's an escort. Nothing will be done to prevent arms to Syria. Another red line crossed. He is an embarrassment and puts us all in danger from terror.","commenter_a":"Iran knows we have a coward President. Even these ships are like a lion without teeth because Obama is Commander in Coward!!","post_message":"U.S. Navy warships are shadowing an Iranian convoy approaching Yemen as the U.S. beefs up its presence in the region. Tune in to 'Special Report with Bret Baier,' tonight at 6p ET for the latest."},{"comment_id":"10152993022307217","commenter_b":"We really don't like immigrants here. Go back to your country, HitchBOT! Stop stealing American jobs that nobody wants.","commenter_a":"I'm very sorry it happened. I wish we could have done a well as everyone else. It would have been awesome if we could have sent to Australia.","post_message":"HitchBOT crosses Europe and Canada but is smashed to pieces in the US"},{"comment_id":"10156246277170725","commenter_b":"But I don't support Trump's fantasy plan about deporting 11 million people illegals with criminal records should be deported immediately!!!...we should build a wall too....and we should give work permits, make them pay fines, and adopt an E-verify system. ....that's more realistic and rational. Switzerland has a population of 8 million people, according to Trump's plan, he would deport the equivalent of every single person living in Switzerland and then SOME not only it is CRAZY, it's impossible. ..for the sake of argument let's say it was possible, it would cost billions and billions of dollars and take decades to accomplish that.","commenter_a":"I think people are going to vote donald trump for president","post_message":"Saying goodbye to some of my great workers at Trump National Doral Miami."},{"comment_id":"10155013986101162","commenter_b":"Lmfao!!","commenter_a":"@username just because I saw your shopaholic post lol","post_message":"LATE PACKAGES: Amazon may experience some holiday turbulence in its shipping due to a contract dispute with pilots..: @webpagelink"},{"comment_id":"786188861571691","commenter_b":"That is stupid why can't the welfare people get a job and beside who going to pay for their car insurance and car payment get real","commenter_a":"This is not true.if so think about the timing of it Killary is losing against Donald Trump and she is going to try and bye your votes but we are all to smart for that","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"932284180186448","commenter_b":"illegals has no rights go back home and come back legally.","commenter_a":"This is DO or DIE, America!!! We need Trump in the Oval immediately! He will fix this mess Obama has put us all in and we so desperately need him! I'm voting Trump 2016!!! Who's with me?!?!","post_message":"\"We have to stop with political correctness! We have to create a country that won’t have people flying planes into the World Trade Center and stop the shooting in California. If you can’t use the terms “Islamic terrorism” you can’t solve the problem.\"  #TrumpTrain #GOPDebate"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"}]
