[{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"},{"comment_id":"703909133102373","commenter_b":"Keep it going and that shithole country might be cleaned up someday👍","commenter_a":"the result is the same be it honor killing (Indian way) or random shooting of school kids (US way)","post_message":"India reports a spike in “honor killings” — but the numbers are probably even higher."},{"comment_id":"10153373131878352","commenter_b":"How about us mothers teach our daughters how to take care of themselves and to love their own skin. A little girl will look to her mother for what a woman is and how to act. When you are body obsessed, your daughter will pick up on it. If you're working out, eating decent, and taking care of yourself, she'll pick up on that also.","commenter_a":"The stretch marks are redic. She looks like a Plane Jane. I'll go ahead and keep buying Barbies for my little girl if this is the only other option. Healthy self image starts at home, not the toy store. A for effort, C- for the execution. Please go back to the drawing board.","post_message":"She’s got stretch marks, brown hair and a fuller figure… now Anti-Barbie fashion doll Lammily stars in ad tackling women’s obsession with the perfect bikini body"},{"comment_id":"10152782186121130","commenter_b":"I can't even blame her decision(which I do feel is extreme) but seriously what's with these whacky doctors who are willing to do these surgeries, where's THEIR head? Enormous breasts, huge ridiculous lips, \"body fillers\" etc it's disgusting.","commenter_a":"Miss dumbdumb. Shame ppl just can't accept what nature gave them. Or at least find safer ways to enhance/change.","post_message":"\"I'm paying now for my vanity.\""},{"comment_id":"10157696214715603","commenter_b":"Lol @username not gonna happen","commenter_a":"Don't believe the media...Hillary's poll numbers are falling faster than Bill Clinton's pants in an Arkansas trailer park...","post_message":"Hillary Clinton forcefully challenged the FBI's new email inquiry Monday, declaring during a campaign rally in battleground Ohio, \"There's no case here.\""},{"comment_id":"870170056373024","commenter_b":"Illegal aliens yes. Immigrants that come in legally and get properly documented should be allowed work as long as they don't have a disease or criminal record.","commenter_a":"Me too","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."}]
