[{"comment_id":"970899619630870","commenter_b":"Deport ALL MUSLIMS everywhere!!!!!!!","commenter_a":"FULL CASTRATION!!!!!!!!","post_message":"Top Muslim Imam: \"We shall breed with Europeans to conquer their countries!\" (Video)"},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"1054816387945602","commenter_b":"Watching these comments I can't help but notice that Obama is almost as popular as burlap toilet paper....","commenter_a":"Will he be pausing to pray to the east immediately following this speech?","post_message":"President Barack Obama comments on #Brexit at the 2016 Global Entrepreneurship Summit."},{"comment_id":"10153741874696037","commenter_b":"For the girl on the left id dress however the hell she wants.","commenter_a":"\"Let's have a Hawaiian theme party but please don't dress like these guys. We don't wanna offend the Hawaiians. That's not nice\"","post_message":"The UCLA student newspaper, The Daily Bruin, reported that guests came dressed in baggy clothes and gold chains for a \"Kanye Western\" party."},{"comment_id":"1875772702705471","commenter_b":"These hoes aint loyal","commenter_a":"@username 😴","post_message":"So messed up  #WSHH"},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"},{"comment_id":"10152954231420399","commenter_b":"Paybacks are a bitch!","commenter_a":"Karma isn't it great","post_message":"An extraordinary act of trolling:"}]
