[{"comment_id":"1738525546372400","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"1325297067482547","commenter_b":"Means nothing! That's why it took him so long to release it. It had to be all set up. Duh!","commenter_a":"Unfortunately not true. The BC was a. Latent forgery and Trump said before there were serious questions about it. He should have sidestepped the issue. Hillary always does.","post_message":"Trump senior communications adviser, Jason Miller, had said the issue already was closed, as far as Trump was concerned.   2011, Mr. Trump was finally able to bring this ugly incident to its conclusion by successfully compelling President Obama to release his birth certificate.  Miller statement continued,  successfully obtained President Obama birth certificate when others could not, Mr. Trump believes that President Obama was born in the United States.  He added, . Trump did a great service to the president and the country by bringing closure to the issue that Hillary Clinton and her team first raised."},{"comment_id":"10153088404166770","commenter_b":"Yeah really. She's more worried about herself than anyone. More lies from Billary!!!!","commenter_a":"They only lose sleep about how to deal with Clinton when she is elected President!!!","post_message":"\"I would imagine that I’ve thought about what happened more than all of you put together. I’ve lost more sleep than all of you put together. I have been wracking my brain about what more could have been done or what should have been done.\""},{"comment_id":"1267255170019683","commenter_b":"Trump never said that - the Media always twist his words. Evil Hillary, said that no one needed guns - Trump said, OK - start with dis-arming your security guards. What does she do? Tripled her armed guards. Queen Liar Hillary / that Muslim Traitor Obama / & Soros are the U.S. worst 3 enemies that we have ever had. Because of all the evil Muslims that they have flooded our country with - we will probably be in a Civil War here on our soil - before the election - since they are losing really bad - they will not wait to try a Complete Muslim Take Over. Obama's ISIS has already stated -- We will Kill 90% of all Americans before 2017. Of course, that will be All White & Christians. Can not people see how EVIL those 3 Muslims are - 2 countries have promised a N. ...","commenter_a":"Are you judging this , like when Trump asked them to take the guns from her secrect service men , so she could be assassinated. Trump said the same thing ,but you just look over it.","post_message":"Watch for yourself and you be the judge. Hillary was asked about wanting to assassinate WikiLeaks founder, Julian Assange, using a drone. Assange has been a thorn in her side throughout her campaign.  When she finally answered, I've gotta say, I was more uneasy than when the reporter asked the question. This is NOT someone I would want in the White House under any circumstances.  Do you find her answer as disturbing as I do?"},{"comment_id":"857055204364524","commenter_b":"Just proves that he's good at beating up women too. And it's probably more fun since the women can't punch.","commenter_a":"Manny is no angel","post_message":"Floyd Mayweather has been charged with domestic violence on six separate occasions, convicted on five of those charges and has only served two months in prison, never receiving any penalties from the Nevada Athletic Commission regarding his professional boxing career."},{"comment_id":"745794202277824","commenter_b":"She a fat hoe nuttin moe","commenter_a":"Dumb song.","post_message":"Something DISTURBING Was Just Exposed About Beyonce's Halftime Song  This is sickening. She should be banned from performing at any sports events for this.  Do you Beyonce needs to learn some respect?"},{"comment_id":"10153061361762235","commenter_b":"Actually, she's not a Texan... she's a writer from Michigan... and she can take I-35 North and get her ass outta my state!","commenter_a":"Think this is the Wicked Witch of Texas!!!! She is mean and crazy!!!!!","post_message":"American Taliban."}]
