[{"comment_id":"478375502350743","commenter_b":"Ridiculous. Stop this nonsense","commenter_a":"Pay the fine..it's a small price to pay for all God has given us.","post_message":"Obama's America hating Christianity..."},{"comment_id":"502346796622132","commenter_b":"Of course she had to remove that ugly mask - if you don't like it go home!","commenter_a":"Most states have laws that read, paraphrasing now, that it unlawful to conceal your identity when entering a place of business. Maybe someone out there with more interest in law or has more time than I do can clarify? But yeah, the owner can refuse service to anyone they choose!","post_message":"She wouldn't unmask herself, so the store owner demanded this.  Do you think the store owner did the right thing?"},{"comment_id":"10153592234263132","commenter_b":"She got dem dreads doh!","commenter_a":"SHE DOESNT EVEN LOOK BLACK!","post_message":"\"We are her birth parents. We do not understand why she feels it's necessary to misrepresent her ethnicity.\""},{"comment_id":"10153540502734411","commenter_b":"Wow--look at that face. That woman needs to smile more.","commenter_a":"Links of blood and marriage tied Battenbergs/Mountbattens to Germany/or.also Saxe-Coburg-Gotha into \"Windsor\" didn't transform Edward..","post_message":"'She was a child when this film was shot, long before the atrocities of the Nazis became widely known. But Edward was already welcoming the regime as Prince of Wales in 1933 and remained pro-Nazi after war broke out in 1939. He could well be teaching the Queen and Princess Margaret how to do the salute.'"},{"comment_id":"10154467991806162","commenter_b":"Put down the pipe lady.","commenter_a":"And I am so tired of the argument that white America doesn't understand the history of slavery, or they are so \"ignorant\" about the contemporary machinations of racism. The claim of ignorance is part of the diabolical ruse but this mess is all cooly calculated and designed to preserve the racial hierarchy, which these days is often called \"racial disparities.\" Which I say is a bureaucratic term used to obscure the genocidal potential of white supremacy. How could a culture of people who have so meticulously sought to prove their superiority in all things, be so intellectually dense about how racism works? Slavery is well understood by white America because for the past 150 years it has ingeniously recreated it over and over again and called it by another name while playing dumb. FOH!","post_message":"The store owner, Abdullah Muflahi, released a video that he said he shot from a slightly different angle. He said Sterling was not holding a gun during the shooting but that he saw officers remove one from his pocket afterward. His video shows an officer reaching into Sterling's pocket to grab an object."},{"comment_id":"1743445975938698","commenter_b":"Devil at work.","commenter_a":"we should not remove any thing if they don't want to come to come our churches let them go back to there country where they can do as they please..","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’.  America was founded on Christianity!  Do you think this is ridiculous?"},{"comment_id":"10153315672229091","commenter_b":"It's not cheap, it's very expensive. the apartments on either side, below and floors above have to be treated to truly eradicate the pest from the building. All that cost big $$$$ It's not funny. I don't blame her for looking for an inexpensive way to kill them. She should have done more research tho","commenter_a":"Theres people laughing and then I'm reading \"Stop being cheap and call an exterminator...... Who knows if this woman call an exterminator for an estimate and it was way above her budget none of us know that everyone go through different things I wouldn't recommend dousing yourself in rubbing alcohol but I'm sure if she would have looked on line she could have found a more better way. I don't understand how people can sit here and judge the next person like as if their better than the next. At least she apologized if that's the case and if thats how you feel then you should reach out and help her afford an exterminator","post_message":"The woman said doused herself with rubbing alcohol before it was ignited by a stove and oven. She said she had turned on the stove and oven the previous day to heat up her apartment, on advice from a neighbor, as part of the effort to kill the bedbugs."}]
