[{"comment_id":"10154667232099270","commenter_b":"But lord lord that wall has to go up!","commenter_a":"Axe the F35 and you got your new engines","post_message":"The Air Force wants new engines for its venerable B-52 Stratofortress bomber fleet, but there’s no money in the budget to pay for them."},{"comment_id":"933295990044593","commenter_b":"Most reusable bags are made from thick plastic. It makes me wonder how many thin bags it takes to make up one of those. Then how many if those are just thrown out because they become dirty or torn. Plus, as it was stated, the carbon footprint of these bags isn't helping anything. I think the best solution might be bags made biodegradable from corn or potato. I've seen some restaurants begin using those.","commenter_a":"when you walk a beach every day, as i do in seattle, it is clear that limiting the use of plastic bags is completely reasonable.","post_message":"Ah, the infamous \"paper or plastic\" question. It's way more complicated than we thought, and now scientists are throwing their hats into the ring to solve this environmental quandary."},{"comment_id":"10154056014236336","commenter_b":"I've heard liberals say that the Constitution is a living,breathing thing so many times! This is because they want to change America's FIRM laws to fit their Anti American agenda! Obama and the Anti American socialist judges do not have the right to make law! Thats how Obama's illegal Obama care was approved! I fear that our once free country is in grave jeopardy of being overrun by these evil Marxist! I think it will get so bad that people will be forced into defending their family s, themselves,their neighbors, their freedom,the Constitution and their Country in what ever means necessary! My God protect us!","commenter_a":"Guns and ammo.... Buy them now while you still can. God Bless America (what's left of her)","post_message":"U.S. Supreme Court Justice Antonin Scalia defended interpreting the Constitution as it was originally written and intended.  Scalia passed today after serving on the nation's highest court for 30 years. fxn.ws/1obcGnN"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"804306716336257","commenter_b":"I have no problem with that bitch being on Air Force one. If they are traveling for her campaign then she should be flipping the bill for the personnel onboard, food consumed and fuel. I would much rather see her ass sitting in a jail cell though.","commenter_a":"SCREW THEM BOTH","post_message":"Donald J. Trump's wondering why President Obama's allowed to hit the campaign trail with Hillary Clinton on Air Force One: \"Who pays?\""},{"comment_id":"10153421158184726","commenter_b":"The Confederates nearly destroyed the United States!! They were slave owners and rouges! You lost the war now get over it and burn the damn flag!!!!","commenter_a":"The subject of slavery needs to be relegated to history books and musems right along with the battle flag of the Confederacy. I sick of hearing in about slavery, let's talk about dinosaurs -they don't exist either.!!!","post_message":"WATCH: Rand Paul: It's Time to Put the Confederate Flag in a Museum... Do you agree with Paul?"},{"comment_id":"10154487307161336","commenter_b":"Unfortunately, Hillary and company think they are above reproach. She is doing the \"granny good witch\" routine for awhile and the cutesy lovers are falling for it. Did they honestly forget that Bill is a womanizer and she has ruined the lives of the women he was involved with? Barbra Streisand made a comment, \"We didn't elect the Pope\" and that tone of morality has taken its toll,","commenter_a":"Amen to that!","post_message":"\"If they can't control their own email maybe they shouldn't be controlling the state secrets of the United States.\"  Today on \"FOX & Friends Weekend,\" Mike Huckabee talked about how the hacking of Democrats calls into question national security. @webpagelink"}]
