[{"comment_id":"10152619091801636","commenter_b":"Read, stupid cow, before you open mouth: @webpagelink","commenter_a":"Smart people. Never vaccinate your baby!","post_message":"'The UK's anti-vaccination movement is alive and well, and we can't ignore it'"},{"comment_id":"1136767329692020","commenter_b":"Poor Bill has to wake up next to this. OMG no wonder he did Monica.","commenter_a":"Sorry had to leave, Now back To the Butcher of Benghazi Karma Hillary Clinton","post_message":"Hillary, EXPOSED!!"},{"comment_id":"765874163568797","commenter_b":"Unfortunately, so true.","commenter_a":"How are you guys able to post, I thought the Obama phones were shut off already?","post_message":"We have nobody to blame but ourselves..."},{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"934978476568908","commenter_b":"Hahahahaha","commenter_a":"@username Jeff Smolen @username lmao","post_message":""},{"comment_id":"996990363669718","commenter_b":"@username, if those that come from Mexico are such a hard working people like liberals claim, then they should use all the energy to fix their own place. Mexico required voter ID which in turn gives them capabilities of voting people into office. Fast forward to illegals here from Mexico claiming that is racist to require voter ID, while their own place mandate that they have one. Is all about getting free stuff without any output. For that reason I say screw everyone of them that break the law and move here.","commenter_a":"I live in a Muslim country here is like a hell because of being Muslims. Killing, kidnaping and beheading is an usuall action. If you want to be safe, don't let any Muslim live in America.","post_message":"NOT IN OUR COUNTRY."},{"comment_id":"10153389617181509","commenter_b":"Tell the pigs this same info.....they dont seem to remember the law and if they need it,give them your info and have them subpoena it...like theyre legally required to do","commenter_a":"No Law or Rule against. As some police assume?","post_message":"A growing number of people are turning their cameras on cops. You can learn more via CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat"}]
