[{"comment_id":"10152853251337217","commenter_b":"No one is trying to say being plus size is a standard but there are plus size women who love their body and would not like to be ostracized for loving themselves the way they are. But these underweight model can start a trend of anorexia because girls WILL starve themselves to be like that","commenter_a":"They don't do that with the obese women... ¬¬","post_message":"Ad featuring \"unhealthily underweight\" model is deemed \"irresponsible\""},{"comment_id":"10152917140236051","commenter_b":"Go to jail bitch","commenter_a":"I did that once,you could be messing with the wrong person... Call police!","post_message":"When a man saw how this woman was treating a 3-year-old, he knew he had to intervene."},{"comment_id":"10154263730768271","commenter_b":"Perhaps MaryAnn Kosimko would like to be grabbed by the pussy too and go to war while she's at it... what ever you're smoking STOP...","commenter_a":"Yes! We need him for president! Strong! Cares for this Counrty. He's not doing this for the money- he has Money. He can't be bought!! ( not like some one) He is doing this because he wants to make American strong. We have been brow beaten for 8 years. I'm tired of that, aren't you? We need to be Strong and Proud of who we are: Citizens one a great country. We need Trump as our Leader. We don't won't a dictator.","post_message":"JUST IN: Donald Trump will hold a campaign rally in Denver Saturday night as the cherry on top of a busy week in Colorado politics, filled with visits from both major campaigns."},{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"10152609996648663","commenter_b":"Do you think, if things progress in the next 10 years as they have, the next generation will have our privileges and freedom? Look at the debt. Look how the 2nd amendment has been attacked. And our religious freedoms. What about the Isis.....we are walking away from the America I have known, and I am 78 yrs old,","commenter_a":"My husband and I are fine, but woe to my grand and great grandchildren in the years to come. They will never understand how truly great Ametica was, they will never know what freedom was...","post_message":"In November, Americans sent a clear message to Washington that they were tired of political gridlock and want solutions and real results to the problems facing our country. Both President Bush and President Clinton used their State of the Union address following difficult midterm elections to acknowledge that they no longer have control of both chambers and that it was time for them to work with Congress. Unfortunately, tonight was another missed opportunity for President Obama and his legacy.    President Obama used this evening to appease his political base and focused on dividing our Nation and using bureaucratic control to run our country with top-down Washington-centered solutions. I believe the key to growing a healthy economy begins by strengthening the paycheck of hard working Americans, putting more money into Kansans pockets, and growing our economy from the bottom-up.     While I was disappointed in many of the President's remarks, I remain hopeful there will be opportunities in the near future to work together to expand trade and fix our broken tax code. I remain hopeful that this President will seize those opportunities just as those who preceded him did."},{"comment_id":"920667494692972","commenter_b":"What a piece of shit","commenter_a":"PIG!!!!!!! If his wife had any sense of self worth and wasn't so bullied she would leave his sorry ass!","post_message":"And the saga continues..."}]
