[{"comment_id":"10154883181056509","commenter_b":"Please be honest... Why are 37% of Federal prison sentences illegal immigrants? Tell American's the $100 Billion illegal immigration cost in tax dollars each year, this would pay the college for American citizens. The $12 Billion per year Illegal immigrants cost California taxpayers. The $Trillions Immigration Reform will cost taxpayer's in benefits due to the average 10th grade or less education level of illegal immigrants who will be on additional welfare for the next 50 years, will be receiving more free or low cost healthcare, which is breaking the bank of middle income families now. Tell them that 5,000 come in on a daily basis. Tell them about the identity theft of illegal immigrants who use stolen Social Security numbers to take American jobs and the IRS admitted to Congress that they did not notify the person or business that the illegal alien was again breaking laws and ruining American ...","commenter_a":"Speaking of an etiquette guide to Muslims, what does this particular group of 1.6 billion people believe about homosexuality?","post_message":"There are 7 billion people in the world. And a full 22% of them -- 1.6 billion -- are fasting from sunup to sundown. Every day. For an entire month."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"10154284968796336","commenter_b":"Because an orange narcissistic with a fake wig is better","commenter_a":"Because he promises free stuff, and doesn't say he's gonna take your jobs, but you'll lose your wealth if you try and make something of yourself! Both democrats running are a joke!","post_message":"BREAKING NEWS: Fox News projects Bernie Sanders as the winner of the West Virginia Democratic primary."},{"comment_id":"10153523927041162","commenter_b":"Go marry him.","commenter_a":"I need the money to get out of debt Lord help me omg","post_message":"BIG WIN! A suburban man who likes to play the newest games bought a Golden Casino instant ticket and won $4 million. @webpagelink"},{"comment_id":"10154103585977015","commenter_b":"They have ruined these children's life....they should be deported and banned from returning!!! If they return, they should be executed.","commenter_a":"LEAD POISONING BETWEEN THEIR EYES IS THE ONLY SOLUTION ! !","post_message":"Members of a Muslim rape gang shouted  akbar in court yesterday as they were jailed for raping girls aged 11 and 13..."},{"comment_id":"10153184060913690","commenter_b":"If God wanted women to get around he would have given them legs....","commenter_a":"The intension is not to drive a car but to goo free life against the social and religious norms.","post_message":"Maysaa al-Amoudi Loujain al-Hathloul were freed after spending more then two months behind bars. Hathloul had tried to drive into Saudi Arabia from neighbouring United Arab Emirates in defiance of the Saudi female driving ban. @webpagelink"},{"comment_id":"10155259941361756","commenter_b":"Yep Aussie too. All true above. Totally embarrassed and ashamed ourselves and our political leaders also often call them illegal immigrants not refugees 😢","commenter_a":"Australia, please know that he does not speak for us. Thank you for your humanitarian efforts.","post_message":"The deal concerns refugees -- not \"illegal immigrants\" -- who have been housed in offshore detention centers on Nauru and other islands."}]
