[{"comment_id":"10153127374764753","commenter_b":"Pig drug whore doesnt deserve kids","commenter_a":"And I feel like a bad parent because of my mountain of dirty laundry... some people don't deserve children!","post_message":"Kodi Faircloth, though she may look quit a bit older, is only 38 and already the mom of 12 kids with another on the way. But it’s a safe bet that this Tulsa, Oklahoma, woman won’t be winning any Mom Of The Year awards anytime soon — not after what police report that they found in her home last Thursday."},{"comment_id":"463096490547598","commenter_b":"Yes","commenter_a":"yes, yes","post_message":"Should This Family Be Taken Off Welfare?  Comment 'yes' or 'no'."},{"comment_id":"1099239800197691","commenter_b":"Brave Women! I hope they don't beat you with a shoe!","commenter_a":"Yet, elsewhere they are romanticizing misogyny.","post_message":"Women in Iran risk prosecution if caught contravening the ban, which was issued by Supreme leader Ayatollah Ali Khamenei."},{"comment_id":"941945919231796","commenter_b":"Lol. They immigrated too #landbridge","commenter_a":"Should learn wut? Now listen here sis... You are just brainles jerky What the hell is American? You mean English????","post_message":"She fits right in with Donald Trump."},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10154476200391037","commenter_b":"Experts still deny Free trade causing poverty joblessness....they still maintain America cant make its own goods that we must import or fall into some economic abyss! At the same time they back Hillarys claim that she can create some kind of new jobs that doesnt involve manufacturing?? Lets speculatefor a moment that 25 years ago our govt agreed to stabilize China by implementing Free trade...it created a middle class helped create a market for us to trade with down the road... they have enough money to buy from us but 25 years ago the large population was mainly poor. and it made Chinese govt more stable...Govts make these kinds of trade offs everyday...greater good it will pay dividends we have to think of the future all of that kind of nonsense while sentencing 3 generations of American workers to a deadend future.","commenter_a":"obama has done a great job dividing people...Time to fix that!!..TRUMP 2016!!","post_message":"\"We need more love and kindness in this country,” Hillary Clinton said. \"The last thing we need are leaders who try to divide us even more than we are.\""},{"comment_id":"969780003138778","commenter_b":"Bye, bye illegal aliens and their bastard American children.","commenter_a":"Love it, ... and Muslims too !","post_message":"Ay, caramba! #BuildTheWall @webpagelink"}]
