[{"comment_id":"1586246148346927","commenter_b":"It looks like the hind end of A stripe ass baboon !","commenter_a":"Not just no but hell no I will burn any I find","post_message":"Michelle Obama does not deserve to have her face on anything. Will you buy these stamps?"},{"comment_id":"10154614899766729","commenter_b":"The woman is already bought and paid for, she is an insult to any decent woman!","commenter_a":"Bitch please!!!!!!!","post_message":"Where is the mainstream media on this? Complete silence..."},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"1069254933097554","commenter_b":"So who fixed the boat?","commenter_a":"I don't like this picture","post_message":"That's a heck of a thing to say!  Especially with servicemen captured."},{"comment_id":"10155084473033984","commenter_b":"@username yes you are.... it's never enough for you people never enough","commenter_a":"Okay, this is absolutely disgusting and I am appalled by the behavior of these CRIMINALS, but I did not see this much coverage or outrage when those WHITE teen males abused then raped the black handicapped teen with a metal hanger, causing permanent damage to him internally... they were let off the hook by the way. Charges dropped... media barely covered it and there were even people who made jokes about it or defended the white teens... so next time one of you white people wants to cry how white privilege is not real or how the media ignores black on white crimes, think again. These black teens are getting the punishment they deserve while the white teens (that did worse as they caused physically permanent damage) are out and about, as if nothing happened. DISGUSTING","post_message":"This is just sickening and heartbreaking at the same time. We just found out 1 key fact about the relationship between the disabled teen and one of his torturers... and it's absolutely shocking.  Who could be this EVIL?"},{"comment_id":"777311705792740","commenter_b":"FUCK YOU BITCH!!!!","commenter_a":"What a tool.","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"}]
