[{"comment_id":"10154040256123132","commenter_b":"Take her AWAY","commenter_a":"She probably asked for an extension so she could take off far away....","post_message":"The Dance Moms star faces up to 5 years in prison if convicted."},{"comment_id":"1002700983109302","commenter_b":"Someone should ducktape her mouth","commenter_a":"Somehow, that doesn't look \"allegedly\".","post_message":"Woman facing animal cruelty charges after allegedly duct taping her dog’s mouth shut, then posting photos on Facebook: @webpagelink"},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"1061814317192373","commenter_b":"Also...let's not forget...Obama is to blame for your mama giving birth to a shit head like you....you should have been aborted","commenter_a":"Another Jack A**** heard from","post_message":"Frequent Fox News guest Jesse Lee Peterson says that Obama is to blame for the South Carolina mass shooting at a black church because he insists on pointing out that racism is a problem in America."},{"comment_id":"10153717076186680","commenter_b":"Hillary Clinton is unfit!","commenter_a":"Odummy you aren't fit to tie Trumps shoe laces sorry doesn't even begin to describe you.You are just a halfbreed SOB that got elected for your skin color nothing more.","post_message":"President Obama on Donald J. Trump : \"The Republican nominee is unfit to serve as president.\""},{"comment_id":"1243855252377391","commenter_b":"Jennifer, Donald trump doesn't care who you sleep with. Yes, it's better to vote GOP than to vote to import non assimilating Muslims who will cost a fortune and harm our citizens.","commenter_a":"I'm a Bernie supporter who's voting for Hillary whom I think is going to lose to Trump","post_message":"These names would be a huge draw in any feature film, but on Tuesday they lent their star power to another production -- the Democratic National Convention."},{"comment_id":"1735699086698296","commenter_b":"HOW - F_N confused is she ---OMG.....totally the opposite.......","commenter_a":"\"Yes We Can\" :)","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"}]
