[{"comment_id":"450075515174329","commenter_b":"Jamal Mercer you realize that Plymouth Rock was landed in 1620 and that formal America wasn't til 1776. So your way off on \"over 500 years\" more like 200 years. And the majority of this country was built by Irish and Chinese labor not black. How come for hundreds of years Irish were slaves, yet Irish people don't use it as a crutch and a complaint of why they can't do something. 6 million Jews killed in the holocaust, that was from 1933-1945 that was roughly 1350 a day for 12 years. Yet Jewish people don't use it as a crutch and a complaint why they can't do something. Neither one of these groups were given nearly as much entitlement as the black community.... Yet the black community still complains that it's not enough that they can't get ahead. And yes most people look at black on black crime and ...","commenter_a":"What pisses me off is people that deflect this issue with Black on Black violence. Like y'all don't know that we just got rights in this country 50 years ago and the subsequent aftermath of white supremacy for over 500 years is the reason we live in impoverished areas with the shittiest schools. Y'all DO know that those circumstances breed violence right? Don't act like White men have not committed the most violent atrocities in this country since it's inception. Don't act like your \"discovery\" of America wasn't simply genocide. Don't act like multiple billion dollar industries that people still reap the benefits of today and in the future weren't built on free labor that black people don't see a penny of. Read sometimes. You will know why the black community has violence. Still to this day the most heinous crimes and serial murders are committed by white men. Sandy ...","post_message":"This story keeps evolving."},{"comment_id":"10153721482309641","commenter_b":"Rap Artists RToy : Here it is the good part of Qur'an 5: 32 Qur: Whoever kills an innocent person it is as if he has killed all of humanity","commenter_a":"Quran (5:33) - \"The punishment of those who wage war against Allah and His messenger and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be imprisoned; this shall be as a disgrace for them in this world, and in the hereafter they shall have a grievous chastisement\" Quran (8:12) - \"I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them\" No reasonable person would interpret this to mean a spiritual struggle. Quran (8:15) - \"O ye who believe! When ye meet those who disbelieve in battle, turn not your backs to them. (16)Whoso on that day turneth his back to them, unless maneuvering for battle or intent to join a company, he ...","post_message":"\"I think he damaged all his brands in all Muslim countries.\""},{"comment_id":"10155111807156162","commenter_b":"It's her white male privilege.","commenter_a":"Wtf probation !","post_message":"The 46-year-old mother avoided jail after pleading guilty to raping her daughter's 13-year-old boyfriend."},{"comment_id":"1461455587203411","commenter_b":"Some aren't. I guess this is part of \"Make America Great Again\". I'm confused. I'm mad. I'd laugh, but I laughed that Trump was running for President and laughed at the circus the ensued. Now look where he is!!!!","commenter_a":"Seriously? This has gotten completely out of control. We are better than this.","post_message":"After national polling indicated an extreme gender gap among presidential support, some Trump supporters took to Twitter to demand a repeal of the 19th amendment — which in 1920 gave U.S. women the right to vote."},{"comment_id":"10152827185410047","commenter_b":"Welfare mothers should not get any money either","commenter_a":"like","post_message":"Planned Parenthood is the leading abortion provider in the United States while continuing to receive millions of dollars in federal government funding each year.   Our tax dollars shouldn't be funding the slaughter of innocent unborn babies. SIGN & SHARE to defend life and defund abortion: @webpagelink"},{"comment_id":"10154144883178984","commenter_b":"I liked Cruz before he started his dirty campaign, now I have no respect for him","commenter_a":"Trump gets more coverage than anyone especially at Fox. People should take a look at Ted Cruzs resume and determine who is the presidential one. It is the most Impressive I hAve ever seen. He is a man of integrity with a brilliant mind. No skeletons in his closet. He is a true conservative who lives by the constitution. That is why he battles in Washington because he lives by what is correct. Look at all the cases he has won. He doesn't fit the mold of Harry Reid and company. He bucks them all the time. America needs him now and if we let him Slip by it will be our loss. There is absolutely no one running that can fill his shoes plus he is a born again Christian and he will restore our religious beliefs back to the country and constitutional rights","post_message":"Bill O'Reilly met with candidates right after last night's debate, and there was one thing Trump said to him that immediately caught people's attention...  Do you think Donald J. Trump has been treated unfairly by the media?"},{"comment_id":"1350622528302641","commenter_b":"Lady you're an idiot","commenter_a":"Nobody cares","post_message":"Islamic leaders respond to OSU attack today."}]
