[{"comment_id":"10153716806409749","commenter_b":"What's wrong with a black lady ?","commenter_a":"Wasn't the judge a black lady???!!!","post_message":"\"There will probably be a book. It will talk of his love for Reeva. And the awful feelings of loss and guilt, that will stay with him forever.\""},{"comment_id":"10154071850239456","commenter_b":"Look for Huckabee at VP","commenter_a":"He will make a great VP","post_message":"Do you think he made the right decision?"},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."},{"comment_id":"1022251871143567","commenter_b":"Trump card xxx you trump is good for God's love you trump","commenter_a":"clinton, liar, e-mails, white water, rose wood , scandals.... what's with webb hubell? is he chelsea's dad??..Vince foster?? tell America the truth...corruption with clinton foundation, schlonged by obama, OWES favors, soros, lobbyists, muslims leaders..her illict affairs with, yoko ono, vince foster etc....covering up billie's affairs..stole thousands from W H..when clintons left...benghazi, terrible lies...she let those heroes die...yeah, poooooor victim.. killary will do, or say... any thing to get elected....","post_message":"Trump Issues A Major Threat To Hillary!"},{"comment_id":"10154179126579411","commenter_b":"Gotta love the \"former\" officers or agents say the truth once they've retired.","commenter_a":"Shut-up CIA!!!! You funded and gave birth to ISIS !!!!!!","post_message":""},{"comment_id":"10153235865056680","commenter_b":"Ha ha ha!!! HEY, EVE, IF YOU WANNA WALK LIKE STEVE, YOU GOTTA TALK LIKE STEVE!!! WOMEN, STOP WHINING LIKE GIRLIEMEN. Stupid biatch.,😂😃😆😅😲😱😨","commenter_a":"TRUMP WINS ALL","post_message":"“She’s playing that woman’s card left and right.\""},{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"}]
