[{"comment_id":"10154355731201051","commenter_b":"stupid bitch.","commenter_a":"it doesn't matter what trumpie ever says His repugnant followers don't care about anything even if it affects them They lost out on the education they sorely needed..and they will never complain because they are too dumb to know it","post_message":"Actor Tom Arnold says he has secret recordings of Donald Trump doing something so bad that it could change everything."},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."},{"comment_id":"944224732371213","commenter_b":"Yeah, she didn't want to have sex with an Orange baboon.","commenter_a":"I guess Trump would know a lot about attitude. He has a very bad attitude and has the emotional age of three!","post_message":"\"She gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude,\" Trump said Tuesday morning."},{"comment_id":"1126925213993897","commenter_b":"Woman*","commenter_a":"Women?","post_message":"This woman was found dead in a shopping cart -- and police have started a murder investigation. >> kiro.tv/BodyInvestigation"},{"comment_id":"10153411890906167","commenter_b":"Nah. Satan and the Mrs, would have had an abortion before bringing this creep into the world. ;)","commenter_a":"the son of satan.","post_message":"Troy Newman's views are so extreme that, as The New York Times reported in 2015, Australia cancelled Newman's visa over \"concerns that he might encourage violence against abortion providers or women seeking the procedures.\""},{"comment_id":"10153694851768352","commenter_b":"A black woman wouldn't marry him because she doesn't want ugly kids! With his Ugly self....","commenter_a":"Trust me we won't! LOL ha ha ha #ugly","post_message":"‘I’m not a racist – but I wouldn’t marry a black woman, I want my children to look like me,’ says ‘white supremacist’ accused of inspiring Dylann Roof’s murder spree"},{"comment_id":"10154658986437034","commenter_b":"Stop illegal immigration!!!!!!!","commenter_a":"Is it too early to begin impeachment proceedings???","post_message":"THE WHITE HOUSE. We are now exactly 3 weeks into the Trump presidency. Thoughts?"}]
