[{"comment_id":"1729274910624261","commenter_b":"@username well then","commenter_a":"Donate this to where the world needs 😩","post_message":"Science at work - The LifeStraw.  The LifeStraw removes at least of 99.99999% of waterborne bacteria and 99.9% of waterborne protozoan parasites. It can filter up to 1000L of water.   Throughout the world, an estimated 884 million people still do not have access to clean sources of water. This device contains no chemicals or batteries and makes it possible to drink safely from any river, lake or puddle.  Buy them here: bit.ly/1YbTja9  For every unit sold, two children in the developing world will be supplied with clean drinking water for a year."},{"comment_id":"991088854247496","commenter_b":"It's about time we had somebody who will stand up and speak the truth!","commenter_a":"Who determines what is Polically Correct? The liberals trying to manage free speech.","post_message":"WATCH: The Donald gets into a heated exchanged with a member of the PC police at press conference."},{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"10153213932211051","commenter_b":"Dumb fucking bitch","commenter_a":"Tabby Witt This lion was in a protected park and was lured out by a dead animal carcus on a stic. Then shot by the dentist with a bow and arrow and after 2 days went by the dentist finally caught up with the lion and then shot him. If you can't see the problem here then you are part of the problem.","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"10154320609521636","commenter_b":"SohailAnwer wow what an example.. pakistan ha?? Wow","commenter_a":"Islam gives rights to many and that can be seen if we open our eyes. In all Muslim countries that have stable governments, even minorities enjoy their rights. Look at Pakistan, its having a Santa Themed train that is traveling nationwide for Christmas. How many western governments give so much to their minorities?","post_message":"Fantastic"},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."},{"comment_id":"10154601974052690","commenter_b":"Could it be that she is still here illegally","commenter_a":"The other problem people need to understand is everyone that is Spanish is not from Mexico. This woman is from San Salvadora. Everyone automatically thinks Mexico. I wonder why? Could it be ignorance taught to them by ignorant people. There are so many \"illegal immigrants\" here that people assume are from Mexico when in fact they are not. Stop stereo typing and get educated.","post_message":"An undocumented woman in need of surgery to remove a brain tumor is being held at a North Texas Immigration and Customs Enforcement detention center, her attorney says."}]
