[{"comment_id":"10154235562969456","commenter_b":"Who's going to put the food on your table ? This country needs illegal immigrants who work for low wedges and keep the prices down .. trump and the gop knows that but keep believing this idiot","commenter_a":"The man never said he was against the Mexican people or their country, traditions, etc. ! JUST those entering our country illegally! Even Hispanics that came to the United States and became citizens LEGALLY, support his platform on this subject. Why would anyone think it’s okay to go to a foreign country, have anything and everything that country has to offer and get it for nothing! I don’t believe any other countries in the world would allow that…why should we?! My husband and children are of Hispanic decent and their relatives came to this country, did what was expected and became citizens legally. It can be done! So, go ahead Donald..build that wal!","post_message":"Despite promises to build a wall along the Mexican border, Donald Trump is still a fan of Cinco de Mayo. >>> @webpagelink"},{"comment_id":"10152895696909342","commenter_b":"shoot her in the face..","commenter_a":"Smh","post_message":"Police: Woman tosses baby out of car window during traffic stop. abc13.com/@username/"},{"comment_id":"1113233595363485","commenter_b":"She articulated well as an advocate of the legal justice system.","commenter_a":"Yes, the role of the defence attorney is to defend and protect the client at all costs. She did. He won. It wasn't right, but she did her job.","post_message":"\"I know my role in the justice system.\""},{"comment_id":"10153265527170950","commenter_b":"Oh stfu","commenter_a":"The blood is on their hands. This is a typical reaction from a Liberal Democrat.. Like a small child they point the blame on some one or something else.. The Democrats have made California a safe haven for Illegals, Criminals and Terrorist with their Sanctuary and open border polices.. The Blood is on your hands Moon-beam.. You and your Lawless Democrats. @webpagelink","post_message":"\"Increased surveillance, creating relationships with mosques in the Muslim American community across the country. We did that after 9/11 and prevented attacks in New Jersey and all across the country.\""},{"comment_id":"10153640663754205","commenter_b":"#LetThemEatTrump #FuckTheDNC","commenter_a":"Hillary will have us in a war with Iran. We need to avoid Hillary at all cost.","post_message":""},{"comment_id":"10150911052459999","commenter_b":"She ain't gonna be there folks - Someone on the DT team has a modicum of intelligence - Trump had an affair with his 2nd wife while still married to the first -inviting Flowers would Gain Hillary a Lot of Sympathy - guess what, it isn't the woman's fault when her husband cheats -Trump is Stupid & his handlers have to keep reining him in - Pitiful","commenter_a":"THE BLACK NARRATIVE IS TO COMMIT \"CIVIL DISOBEDIENCE\" PROVOKE THE POLICE INTO INJURING OR KILLING THEM, THAN SUE TO GET A $$$ SETTLEMENT. MOST ALL BLACKS INVOLVED IN THIS SCHEME HAVE A BLACK LAWYER'S NUMBER ON THEIR SPEED DIAL.","post_message":"Donald J. Trump's team flatly denied that Gennifer Flowers would attend Trump's first debate with Hillary Clinton. Flowers's claims of an affair with Bill Clinton imperiled his 1992 presidential campaign."},{"comment_id":"1175029912517037","commenter_b":"Hal the point is we do need to tighten our borders, there are too many illegals here that get a free ride from the tax payers, and as much as people are going to hate this, if you came here illegally the children you have here are illegal. So, I do agree with you just never heard of known a Canadian to come here just to have a baby.","commenter_a":"look people. If you come to this country legally, doing all the appropriate paerwork and forms, any kids you have that are born here will be American Citizens. That won't change. What we want to change is the Anchor Baby tourism that flourishes on the West Coast, with the Asian women travelling here on 'vacation' to have their babaies in specially marketed motels just for them, so that their children, and them by association many times, would be American Citizens. And those illegal immigrants who cross our northern and southern border, from a multitude of countries, who break the law by sneaking in like a thief in the night, who have their babies here hoping for the chance to stay with them. People should not be rewarded fro breaking a law.","post_message":"With a renewed conversation challenging birthright citizenship, a look back at the 1898 case that first established the legal precedent in the U.S."}]
