[{"comment_id":"10153829312141162","commenter_b":"Yes. Don't trust females","commenter_a":"I hope he learned a valuable lesson from this experience.","post_message":"BREAKING: Patrick Kane will likely NOT face charges for an alleged rape this past summer, according to the Buffalo News: @webpagelink"},{"comment_id":"1793346000922790","commenter_b":"The only women that believe that they shouldn't be checked out are the ones that don't have to worry about it anyways.","commenter_a":"I got dress coded while still in school for my skirt being to short when i argued this saying that it was well pass my finger tips she agreed but since i had long legs the skirt looked short so i would have to change","post_message":"Portland just completely flipped the script on sexist school dress codes."},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."},{"comment_id":"10158911278605206","commenter_b":"@username, would you feel that way too if you were on an airplane and didn't like the pilot? According to you lilies Trump will destroy America. You might want to hold off on purchasing any party supplies. According to you dandelion's Putin will take over America because of Trump. You daffodils won't be allowed to throw any party's if that's true...","commenter_a":"The world deserves Donald Trump. No doubt about it.","post_message":""},{"comment_id":"1088341921206279","commenter_b":"She is smart ! He is Dumber than a door knob !","commenter_a":"THE WHOLE WORLD condemns this moron. He's out of his fucking mind.","post_message":"As far as Mika Brzezinski is concerned, Mike Huckabee is repulsive and has no business being a candidate for president."},{"comment_id":"10154459002469714","commenter_b":"Heaven forbid, but you are right. She has bought and paid for this election, horrible, corrupt hag that she is.","commenter_a":"Hillary Clinton is going to be our first woman President.","post_message":"ICYMI: FBI director James Comey said Hillary Clinton was \"extremely careless\" in handling classified information, but recommends to the Department of Justice that Clinton not face criminal charges."},{"comment_id":"10157919704880354","commenter_b":"Any woman is capable of cheating","commenter_a":"Deplorable in State Of Jefferson!","post_message":"LIVE: Behind-the-Scenes Look of the New Store with Breitbart's Alex Swoyer,  Sonnie Johnson and Charlie Spiering"}]
