[{"comment_id":"1267659423273512","commenter_b":"JUST SHOOT THIS BITCH==PLEASE.","commenter_a":"SOMETHING TO THINK ABOUT -- do you know that Hillary will be bringing into the USA thousand of Refugees and Illegals just within the first year. ISIS has told the US that they will be sending in ISIS men and Rascal Islamic's in with them. Do you want to keep your family safe from the Radical Islamic's and the Illegals along with the threat of Sharia Law . Also the threats that the BLM has made to all Americans and Hillary is behind them also. Then you need to put your family first and vote for TRUMP . Because if you vote for Hillary you might just as well kiss your ass and the USA goodbye. We need to take our Country back Hillary has already proven that she is trying to destroy us. Don't forget our men in Benghazi and all the Email scandal and the Clinton Foundation . ...","post_message":"It's even WORSE than you thought!! @webpagelink"},{"comment_id":"10154692738382235","commenter_b":"Continue to do what she's done for 20 years, try and destroy the Clintons. Keith Olbermann lays that out bare @webpagelink","commenter_a":"It will be interesting to see what Kellyanne Conway will be doing once Donald is finally embarrassed by getting wiped out in the election, and not only dumps her but blames her for his loss.","post_message":"Kellyanne Conway got A LOT more than she bargained for ..."},{"comment_id":"1007311229351882","commenter_b":"@username more people die every year in DWI accidents than in 10yrs of the war..stop whinning it will be on our soil soon.thank obama for that.","commenter_a":"Good because theyve destroyed the republican party and turned it into a warmongering party filled with neocons. Trumpism will come in to replace them and become a patriotic party for the first time in 40 years. We live in exciting times and I am honored to witness it.","post_message":"\"They are as dead as emperor-worship in Japan.\""},{"comment_id":"10154364961931320","commenter_b":"I don't like seeing fat chicks in spandex but yet I'm made to tolerate it.","commenter_a":"Was she covered up or like in the article picture? I am a mother and have no desire to see someone breastfeeding. Cover it up. That experience is between you and your baby and no one else.","post_message":"The sight of a woman breastfeeding her baby was enough to cause a male Target shopper to go off in a series of verbal assaults. @webpagelink"},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."},{"comment_id":"10154428184215695","commenter_b":"Marely Hernandez leaving a baby alone in an apartment is neglect. I may tell my next door neighbor to watch my dogs while I am gone but if I leave a child I will have someone in the residence with that child. You will see what the definition is when she goes before the judge and faces charges. No one should ever drive without a license regardless of why they are doing it. Breaking the law is breaking the law. A criminal is a criminal! You leave a child alone and all children should be removed from the home until you can prove you are capable of providing a safe environment. It seems that many people need to take parenting classes!","commenter_a":"Just wondering , why did the officers randomly walk into her place ? .. Or should I read the article ? Lol","post_message":"Officers say they found the door unlocked and the child sleeping alone on a bed surrounded by pillows."}]
