[{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"},{"comment_id":"10153055647952235","commenter_b":"oh shut up Sarah !","commenter_a":"I'm more left leaning and I know she's a joke.","post_message":"Pass the popcorn!"},{"comment_id":"885477798171651","commenter_b":"Get out of here","commenter_a":"The Senate intends to rid this man from his job.","post_message":"(Video) The U.S. Muslim population has vastly increased under the Obama administration and set to continue to do so on an ever increasing scale.  What generally happens to societies as the Muslim population increases?   A work by Dr. Peter Hammond provides some insight...  Read More:  @webpagelink"},{"comment_id":"10154284155303908","commenter_b":"Alexandria Lindquist Larry bought the lease for 14 million, Bumped up his policies just prior and netted a 4.5 bn dollar payout. Funny that!","commenter_a":"Tallest structure in the world. Located in the middle of one of the largest and most populated cities. And you're telling me that the developers didn't take into account the possibility of the structures collapsing? I think they did. And in the midst of a terrorist attack, the split second decision had to be made; whether or not to take down the Structures in a controlled explosion ( which was probably designed during conception ) How would they have known whether or not any more explosives were going to go off? Tough call","post_message":"Were the twin towers, and more specifically, building 7 blown up by bombs on 9/11? Researchers at the University of Alaska are about to find out."},{"comment_id":"925751947552361","commenter_b":"oul don","commenter_a":"303253143368344u after kellys when kfc was still open","post_message":"Great afternoon in Ohio & a great evening in Pennsylvania - departing now. See you tomorrow Virginia! #MakeAmericaGreatAgain"},{"comment_id":"10153091761007016","commenter_b":"Please take me off Your facebook","commenter_a":"Obama: Pardon Chelsea Manning","post_message":"\"The U.S. intelligence community is in a very poor position to be trusted with protecting civil liberties while engaging in intelligence work,\" writes Manning. \"When you’re a hammer, everything looks like a nail; when you’re a skilled intelligence professional, everything looks like a vital source for collection.\""},{"comment_id":"10153776818934255","commenter_b":"eliminate money...take their power...then its not \"too costly\" to protect the planet...and the creatures that inhabit it...its up to the people","commenter_a":"They were also in with Gov. Jeb Bush pushing education vouchers in Fl. that took money from public education.","post_message":"Unreal.  #DailyKosClassics"}]
