[{"comment_id":"527974647394206","commenter_b":"It is not the gun! It is the government's purposeful lack of enforcing the gun laws that we already have, allowing criminals and drugs to pour into this country, no border protection, telling people to rise up and kill cops, stop that, then you will see these horrific murders stop. Wake the frig up.","commenter_a":"They are banned and have been for many years","post_message":"The shooter in Orlando used an AR-15, the same semi-automatic assault rifle used in Newtown and Aurora. There is no constitutional right to easily slaughter 50 people. End of discussion.  Image by Occupy Democrats, like our page for more."},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"},{"comment_id":"1260373737389011","commenter_b":"The Cocaine Carrot.","commenter_a":"Hahaha","post_message":"Nailed it."},{"comment_id":"1067472230049155","commenter_b":"fuck your wall. period wall wont do shit. 2nd those thousands of lives were addicts, as if you care.","commenter_a":"I am not sure why a man who is responsible for the deaths of thousands through violence and drug overdoses is considered a cult hero by some people. However I think we should consider parole if he will pay for the wall!","post_message":"El Chapo not happy with the prison conditions. #ElChapo #WSHH"},{"comment_id":"443593739098554","commenter_b":"Trump is just what the republican party needs, not a bunch of politians who won't stand up and not do anything but run up the debit and let all these illegals in. Everything he said was right. He did not say all Mexicans are bad. Ya'll need to get your facts straight. I think you jealous because Trump is get more respect and he is leading over ya'll. Trump is a smart man and he wants to make the country better, what are ya'll doing to improve things so far!!!","commenter_a":"Well, so far, Trump is the only one to actually stand up on his hind legs and tell the absolute truth about the ongoing invasion of our homeland. All the others mealy-mouth around and mince words, afraid to offend the \"Latino\" voters, the cheap-liberal-votes lobby, or the cheap-labor lobby. Word mincing won't get it done.","post_message":"Rick Perry had these harsh words for fellow presidential candidate Donald Trump. Do you agree with him?"},{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10156923997390354","commenter_b":"She is a hoe so how do you defend that!","commenter_a":"Gee, imagine Trump doing the same to Cruz and his wife. If you don't want bullets shot at you don't start the war. So low class on Cruz's part to attack Trump's wife. She isn't running for president.","post_message":"Legit?   Here's the side-by-side comparison of the 2 lines..."}]
