[{"comment_id":"10154734525598812","commenter_b":"@T Elliot Cato. The Trump clan is made up of deluded folks. Please let them be...case is chronic!","commenter_a":"Why do Trump supporters keep believing the lies and conspiracy theories?","post_message":"NEW: The FBI expected to release Hillary Clinton interview notes and case documents in the coming days."},{"comment_id":"1114818335281084","commenter_b":"Go, Hillary! #I'mWithHer","commenter_a":"Democrats who support Hillary have the same mental disconnect as Republicans who deny climate change","post_message":"Sanders was shelling out more than Clinton on Nevada airwaves just a week ago."},{"comment_id":"1089895574436829","commenter_b":"Instead of running for president she should be running from prison","commenter_a":"If you're under 50 you really need to read this. If you’re over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, ...","post_message":"The numbers don't lie... but Republicans definitely do.  Thanks to Armed Democrats."},{"comment_id":"10153163075739091","commenter_b":"Resorting to name calling shows the classless women you are! Good job!","commenter_a":"What? Do you want him to ride public transport?! He's the NEXT PRESIDENT OF THE UNITED STATES!!!! #TRUMPTASTIC Man!!! @webpagelink","post_message":"How Donald Trump does jury duty... here's his arrival at a NYC courthouse. STORY HERE: @webpagelink"},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."},{"comment_id":"10153625690231130","commenter_b":"typical black racist asshole!!","commenter_a":"This whole comment thread is a perfect example of what white privilege looks like. If you're white, you have no idea what its like to live in a world where people like you are marginalized. To white people, no nominations must mean that there are no great black movie directors this year. No great black actors this year. No great black actresses this year. In the whole world. But Tom Hanks gets nominated for a movie in which he didn't even talk? GTFOH.","post_message":"Zero actors of color are included in the The Academy's best actor or actress categories for the second consecutive year."},{"comment_id":"10153335788334714","commenter_b":"Still a bitchh","commenter_a":"They named it the failed \"parenting\" tree in honor of welfare checks, EBT cards, and Section 8 vouchers.","post_message":"The trees were chopped off at the trunk"}]
