[{"comment_id":"10153813009729497","commenter_b":"Birth order matters: by the third kid he or she can tell through the uterine lining how lame life is going to get","commenter_a":"Most of us are now. Thanks to big business. Bought politicians","post_message":""},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"10153587241381051","commenter_b":"This bitch","commenter_a":"That is totally untrue. Several people received transplants from my daughter and nothing happened to their skin. We are all the same inside and the only difference outside is that African American people have MORE pigment genes than white people. You did get their genes transplanted into you you got their organs which are exactly like yours that obviously failed. So what difference does it make where they came from. BE GRATEFUL YOU ARE ALIVE. And since you have to take medicine for the rest of your life so your body won't reject your transplants use your pee brain which you obviously have and think about the medicine that's affecting your skin color and NOT the fact that an African American gave you his/her parts to keep your sorry butt alive.","post_message":"This man says that receiving a transplant from an African-American has turned his skin black. Here's what he looks like now. Decide for yourselves."},{"comment_id":"1576593039311229","commenter_b":"Can't stand this stupid bitch!!!","commenter_a":"The stupidity abounds in liberal media and mind.","post_message":"\"Liberal logic\" -- an oxymoron with the emphasis on moron"},{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"1151260644926345","commenter_b":"she is pathetic","commenter_a":"Jenner and malania do look a lot alike .","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"10155797026705354","commenter_b":"To someone above, I wash my own car. More Americans are growing their own gardens. I rarely go to hotels. Their whole argument is false though because we have had immigrant worker programs for decades. Obama is intentionally flooding the country with illegals. Read about George Soros and his open border group. The man is evil.","commenter_a":"We are the force that keeps the country afloat.\" is she for reals? we were floating right along wa before illegals came along.","post_message":"\"Mexicans, like all Latinos, contribute positively to this great nation. We are the force that keeps the country afloat.\""}]
