[{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10153415193876833","commenter_b":"I no Right, They Don't Want The Public Safe!!!!!! Then the Rioters and Looters would be Looting and Rioting even More and getting away with it as always!!!!","commenter_a":"Does this mean our murder rate will plummet because the gang members won't have guns?","post_message":"The U.S. Seventh Circuit Court of Appeals issued a decision on Monday allowing a Chicago-area gun and magazine ban to stand. Such bans are justifiable, according to the court, merely on the basis that they \"may increase the public's sense of safety.\""},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":""},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"1372477109489879","commenter_b":"She can take a shower and be clean afterward! Lol","commenter_a":"If the girl wanna be clean.. Let her be in peace...","post_message":"'Alaikum salam'"},{"comment_id":"998546203523695","commenter_b":"when i ask, it's bengazi","commenter_a":"No president has ever endured the disrespect that President Obama, has. If there are people out there, that say that race has nothing to do with it. then they are the ones that are doing it.","post_message":"Sign your name if you're still standing with President Obama → @webpagelink"},{"comment_id":"917056878424478","commenter_b":"#fuckhillary she and the DNC planted this upon us","commenter_a":"#fucktrump","post_message":"Friday, January 20, 2017: Presidential Inauguration of Donald Trump & Mike Pence - LIVE on C-SPAN, C-SPAN Radio & @webpagelink"}]
