[{"comment_id":"10153247148866130","commenter_b":"I am educated and that's my opinion and I stand by it !!!!","commenter_a":"I don't believe in post pardum depression !!! I believe it's women loosing their precious freedom and freaking out about it !!! That's why there are a limited amount of cases!!!!!!","post_message":"New research could allow women to get help before they even give birth"},{"comment_id":"10152742631486680","commenter_b":"Go Hillary ! Fun to watch these morons head explode!!","commenter_a":"Although I'd love to see a woman president, the very last thing we need is a career criminal like Hillary Clinton (who's currently in violation of Article VI of the Constitution) . She's proven herself time and again to be both incompetent and dishonest. She has no new ideas, and will continue to push Obama's tired old routine of increasing taxes, not for the domestic good, but so that we can send billions to Iran, Iraq, Pakistan, Afghanistan, Egypt and Israel. I would like a President who puts America first, for a change. The only candidate I've seen who shares these sentiments is Rand Paul, and he deserves my vote. By the way, many people are unaware that Obama's Democratic administration added $1.3 trillion in new taxes to small businesses, which lowers both wages and job creation. If you love America, vote Republican.","post_message":"Opinion: When Ayatollah Khamenei speaks, it pays to listen."},{"comment_id":"10153970480428734","commenter_b":"support the blue, let her pay for her own security!","commenter_a":"Too bad for Miami, they will just lose all of the tax revenue they would gain by Beyonce performing in their city. She doesn't need them they need her and the police want the overtime pay. All talk.","post_message":"Law enforcement around the country have been critical of the singer since her Super Bowl half-time performance, which referenced the Black Lives Matter movement, Malcolm X and the Black Panthers."},{"comment_id":"10155007132753431","commenter_b":"Wicked Witch of the East.","commenter_a":"It's not about popularity. It's about decency and common sense!","post_message":"DeVos gave no sign that she had reservations about withdrawing key guidance for transgender students."},{"comment_id":"10153571607004411","commenter_b":"Fuck you Kike hook nosed cunt","commenter_a":"Just a usual palestine jewhating fascist lmao, good way of solving the problem Canaan belongs to nobody, especially not to muslims","post_message":"'My hope is that at some time, [Israel] is no longer there, but only Palestine'"},{"comment_id":"1309116862459880","commenter_b":"Now if they can do something about her mouth....","commenter_a":"Seeing as she is costing taxpayers tons of $$$ for her moronish actions maybe a class action suit should be filed against her for $100M","post_message":"Just in!!"},{"comment_id":"1485178544875222","commenter_b":"Of course we had an impact in the region through corruption but Saudi armed Sunni rebels in Syria to overthrow Assad which formed ISIS, the US is supporting groups against Assad so that Saudi can build a pipeline to Europe and destroy Russia's main source of income","commenter_a":"It does make sense though, when you think about it. Would you just accept thousands of people without carrying out appropriate checks (ie checking if they have criminal record, etc)? You wouldn't. Seeing what has happened in Europe in the last year or so is all the more reason for countries to tighten their borders. Also, people have been spreading this meme for ages so it's nothing new.","post_message":"So crass"}]
