[{"comment_id":"494820657375181","commenter_b":"She needs to shut that big mouth","commenter_a":"She need s to keep her friggin mouth shut","post_message":"Michelle Obama's tries to enforce this on her hometown, but they aren't backing down.  If they can stand up to her, so should the rest of the country.  Do agree Michelle needs to be silenced?"},{"comment_id":"10154521229303318","commenter_b":"Start building the wall","commenter_a":"The idiot has border fences all along southern Mexico whats that for. They think they can just come to America an send the money back.","post_message":"Mexico's president just cancelled his meeting with President Trump.  He told Trump Mexico \"does not believe in walls\" and \"demands respect.\"  Do you support or oppose Trump's dedication to the wall?"},{"comment_id":"10153218789208132","commenter_b":"What about women who cheat?","commenter_a":"If my husband cheated on me I'd do a lot more then throw a shoe at his face. This man should consider him lucky. Its SAS that people stick up for men when they cheat. And people wonder why women get upset in relationships.","post_message":"\"Wouldn't you be this upset if you came home to this?\" she said when asked if she had thrown the shoe."},{"comment_id":"10153228177684411","commenter_b":"Yes, and Russia is one of them, no?","commenter_a":"The only reason that Putin has troubles on his borders is that he steadfastly refuses to keep his troops within them. Russians need to elect a leader committed to managing their economy effectively instead of pursuing fantasies of reconstituting the old USSR.","post_message":""},{"comment_id":"10152800967581545","commenter_b":"I'm with you on that","commenter_a":"Thats why i don't let my kids go to other peoples houses. I know im responsible but are they?","post_message":"Police investigated the death of a 13-year-old Garland boy as a possible suicide but later determined his friend likely shot him while the pair were playing with a gun they thought wasn't loaded."},{"comment_id":"1129640290462357","commenter_b":"My absolute joy will be when (not IF) Madame President is officially elected and we can all look back and say, once upon a time, Trump took out 15 Republican men, but 1 Democratic woman is the one who took HIM out. Music to my ears!!! I can't wait!!! All the haters NEED to get used to hearing Madame President. PERIOD, END OF DISCUSSION.","commenter_a":"I don't know what I'm more excited for- that Hillary is practically a guaranteed win or that I get to watch Trump fail miserably in front of the entire country.","post_message":"The Republican end times are here."},{"comment_id":"1235851089812062","commenter_b":"You're as ghetto as this chick","commenter_a":"I had my daughter at 16. I hid my pregnancy til the day i had her. My family just thought I was getting real heavy. Yes it was scary I was way too young and I knew my life would change. I had to grow up and do things most 16 yr olds don't have to. But i loved my daughter and can't imagine a life without her. I will never understand this! At 16 you know better!!! Give that child to a hospital, family someone!","post_message":"A infant girl died after being thrown from a second-floor window, allegedly by her 16-year-old mother after the teen gave birth. The child's grandmother was administering CPR when paramedics arrived."}]
