[{"comment_id":"10153434512226749","commenter_b":"Oh we WILL get your guns. We will save this country from the terrorist gun owners","commenter_a":"Give it up Obama....you're not getting our guns! Stricter gun laws will only make more people buy them illegally!","post_message":"It's time to do something. @webpagelink"},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"10153715291715950","commenter_b":"Sorry Sara Sterling you wouldn't know the NRA from a CPA. Guns were here before you and they'll be here long after you. They can pass all the unconstitutional laws they want the gun owners will not comply. If you don't like it well then your free to pack your sh*t and leave there isn't anybody forcing you to stay here. The earth is huge...","commenter_a":"CBS once again reaching with their BS agenda! Why don't you report how gun sales are at a record high? Obama is the best gun salesmen ever. If a government ever tells you to disarm yourself you need to arm yourself!","post_message":"This brother shares the story of his family's tragic trip to a gun range."},{"comment_id":"728966150600250","commenter_b":"FEMALE ON THE NEST","commenter_a":"Where is the first baby ?","post_message":"WATCH LIVE: We're ringing in the new year with Harriet, M15 and their new eaglet!  We're still waiting for the second egg to hatch!  Where are you joining us from tonight?  WATCH the video of the hatching- @webpagelink Pix provided by Southwest Florida Eagle Cam"},{"comment_id":"389873387803923","commenter_b":"Really professional. I do (NOT) want her in the White House.","commenter_a":"I think she committed political suicide.","post_message":"Did you find this picture offensive or irresponsible for someone in her position?"},{"comment_id":"10154895009386337","commenter_b":"A pussy with a ring...yah right!","commenter_a":"Jefferson has always been a pussy!","post_message":"LOL. Joel Embiid cares not for your veteran status, Richard Jefferson..."},{"comment_id":"10155107547054258","commenter_b":"Crooked Donald! Lock him up!","commenter_a":"CNN stopped covering the rally and MSNBC with Greta from FOX ran the picture only but had a white House speaking on behalf of Trump. So, on TV we missed Warren , Bernie and others, Corporate controlled media. again ! Thank goodness for social media !","post_message":"WATCH LIVE: Democrats in Congress hold a protest at the Supreme Court against President Trump's immigration executive order."}]
