[{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"910630875626359","commenter_b":"They need to be shot!","commenter_a":"These people just need a hug.....around the neck.....with a rope.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"},{"comment_id":"510973722424254","commenter_b":"Let's elect him and the boos will disappear, right along with all those illegals that are making the noise.","commenter_a":"Don't join conservative Tribune news bad to read","post_message":"Donald Trump handles this opposition like a CHAMP!!!"},{"comment_id":"1369042613147367","commenter_b":"@username and us tax payers get to pay for double security bc the poor widdle brat can't move and change schools like every other American kid has to do when they move🙄🙄","commenter_a":"I mean Donald did say if she wasn't his daughter he would marry her so essentially it's what he wanted.... still Creepy AF!!! 😷😷😷","post_message":"Did you see this coming?"},{"comment_id":"450075515174329","commenter_b":"Jamal Mercer you realize that Plymouth Rock was landed in 1620 and that formal America wasn't til 1776. So your way off on \"over 500 years\" more like 200 years. And the majority of this country was built by Irish and Chinese labor not black. How come for hundreds of years Irish were slaves, yet Irish people don't use it as a crutch and a complaint of why they can't do something. 6 million Jews killed in the holocaust, that was from 1933-1945 that was roughly 1350 a day for 12 years. Yet Jewish people don't use it as a crutch and a complaint why they can't do something. Neither one of these groups were given nearly as much entitlement as the black community.... Yet the black community still complains that it's not enough that they can't get ahead. And yes most people look at black on black crime and ...","commenter_a":"What pisses me off is people that deflect this issue with Black on Black violence. Like y'all don't know that we just got rights in this country 50 years ago and the subsequent aftermath of white supremacy for over 500 years is the reason we live in impoverished areas with the shittiest schools. Y'all DO know that those circumstances breed violence right? Don't act like White men have not committed the most violent atrocities in this country since it's inception. Don't act like your \"discovery\" of America wasn't simply genocide. Don't act like multiple billion dollar industries that people still reap the benefits of today and in the future weren't built on free labor that black people don't see a penny of. Read sometimes. You will know why the black community has violence. Still to this day the most heinous crimes and serial murders are committed by white men. Sandy ...","post_message":"This story keeps evolving."},{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"901951363197946","commenter_b":"Does this Kate Hopkins woman realize how ugly she is?","commenter_a":"i think thie so called woman shoudl keep her many nasty comments too her self ,she must have a very unfilled life ,becuase she comments and has ago at everybody ,stut up Katy Hopkins .","post_message":"Kelly Clarkson admits she didn't even know who Katie Hopkins was  (Daily Mail Celebrity)"}]
