[{"comment_id":"1676793319209552","commenter_b":"Yes Obummer did start all of this. And he has not came out publicly and stood up for the Cops Or American Christians. But he sure as hell has Stood up for the Dammed Muslim's. When are the People going to stop his ass","commenter_a":"I stand with local, county, and state law enforcement I have zero faith in federal law enforcement.","post_message":"At least there are a few people out there with the guts to say what needs to be said.  @webpagelink"},{"comment_id":"424685420989386","commenter_b":"Not the smartest gal around","commenter_a":"It's a tough way to learn a had lesson. I pray she did and will soon have another job that she will probably appreciate.","post_message":"Was this lady unfairly dismissed?"},{"comment_id":"10154656959438132","commenter_b":"She should never get out!","commenter_a":"I wish this country had \"an eye for an eye\" law. She should be put into 600 degrees of heat. That poor poor child. This sickens me.","post_message":"The daughter, now 15, has undergone 28 surgeries since the incident. (via People True Crime)"},{"comment_id":"10156418546700354","commenter_b":"Obama would leave the citizens help to protect their selves just like what happen to Paris.","commenter_a":"Isn't that what Carson said and he got chastised","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about.  But no Democrat's ever admitted it."},{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"\"Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.\"  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"}]
