[{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":""},{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"10153410521706336","commenter_b":"She is so dirty.","commenter_a":"Wonder why .. lol","post_message":"New documents released by a federal court show President Barack Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack – but the contents are being withheld by the U.S. Department of State."},{"comment_id":"10158601678305354","commenter_b":"And don't forget while wearing a vagina costume ......","commenter_a":"it'd be cheaper just to say \"get the fu_k out!\" stupid leftists just cant bring themselves to be rude or nasty ... unless they are being rude & nasty to conservatives.","post_message":"Desperate."},{"comment_id":"10154635406324726","commenter_b":"@username Cowardly weasel!","commenter_a":"I keep reading all these allegations of her but nothing happens. Apparently a revolution against the government is inevitable?","post_message":"Emails suggest Clinton removed diplomatic security officers so private-charity aides could hitch a ride."},{"comment_id":"10153247400764614","commenter_b":"It's everyone's BUSINESS to make sure people like this Dispicable mother is prosecuted to the MAX extent.","commenter_a":"Mind your own god dam business people","post_message":"Disturbing video captures a woman hitting a crying 3-year-old in the face with what appears to be a tablet in a Victorville parking lot.  A man decided to film the woman, identified by police as 39-year-old Yvonne Camargo, after allegedly seeing her pull the child out of a Khol store by his hair.  The boy was examined for injuries by a sheriff deputy and officials plan to submit the case to the DA office.  Read KTLA story here: @webpagelink"},{"comment_id":"10152958455739071","commenter_b":"If all the Europe will have lider like her then for sure we would have less problems!","commenter_a":"Made in Germany","post_message":"Angela Merkel is a rarity — she's excelled her entire life."}]
