[{"comment_id":"10153589357933984","commenter_b":"Just WHAT THE HE#% IS WRONG WITH AMERICANS, just like the poor Jews in Germany, we just sit back and let all this crap happen!!!","commenter_a":"Screw you","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move.  Nobody thought they would go this far...  What do you think about the NAACP's demand?"},{"comment_id":"939447022776130","commenter_b":"1 Muslim + 4 wives = 32 children!!","commenter_a":"Our country has so many homeless families and so of these people would be so grateful to be able to benefit from a number of these programs, and not not offered to them. If we have the housing and benefits for foreign refugees than we have the resources to help our own citizens first. And the positive side to this, we won't have to worry about any of these people killing other Americans","post_message":"Michigan Gov Snyder, Senator Peters And CAIR Pushing For Huge Influx Of Muslim Migrants...Don't The People Have A Choice?"},{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"},{"comment_id":"1087153308047587","commenter_b":"I'll vote for a female for our President, but Hillary is not one that I want to vote for for President. I also think that if your spouse, or former spouse was already President, then you should not be allowed to run/be President; I also think that it should at least skip one generation for sons/daughters.","commenter_a":"Voted for President Obama because he is Black. Voting for Hilary because she's a woman. Why did anyone vote for the last 40 white male Presidents?","post_message":"\"Nothing gets me angrier than when someone implies that I'm voting for Hillary Clinton because she's a woman.\"  - Lena Dunham"},{"comment_id":"10154672765359760","commenter_b":"Why? Ugly horse face bitch!","commenter_a":"Hell No! She didn't belong there in the first place. Garbage.","post_message":"Michelle Obama was loved by millions of people around the world as First Lady. Do you miss seeing her in the White House?"},{"comment_id":"10153904904228812","commenter_b":"Yes Danold deport all the white supremacist, terrorising the USA. Too.","commenter_a":"this is not even our country lol. Native Americans were here first. If Trump says he will deport all immigrants, he should deport himself first.","post_message":"\"Anybody that's brought into this country from the migration is going to be out,” Trump said at a rally in Knoxville, Tenn., Monday night. “We’re not gonna do it. We’re gonna have a country again, we’re gonna have borders, we’re gonna have a country again, right now we don't have a country.\""},{"comment_id":"1018807534853645","commenter_b":"RIP what a good man","commenter_a":"Inspiration for more acts of random kindness towards strangers. What an amazing guy. So sad :(","post_message":"\"I still cannot believe it. I thought for sure I would get the chance to see him again, give him a hug and thank him at least once more in person.\""}]
