[{"comment_id":"1153858647985703","commenter_b":"It's the \"Chicago way\".... the end justifies the means.","commenter_a":"And all his ISIS appointees and advisors!","post_message":"Does this about sum it up?"},{"comment_id":"10153809354827169","commenter_b":"Let's make a new list and start it with Tamir Rice.","commenter_a":"White people in America don't have Race Hustlers disguised as Christian Reverends telling the young men that they can't win in life because they're a victim, nor have Whites exalted bards who glorify violence against sex objects that once were loved as women, violence to police, and street crime. In short, White people are starved for heroes, but Black people have chosen villains for their heroes, and feed their souls on poison. And what people of any age can rise above their heroes?","post_message":"Four out of 10 African-Americans said they doubt the nation will ever achieve racial equality, but as many white Americans believe racial equality has been achieved, according to a national study released by the Pew Research Center (From PBS NewsHour)"},{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"10154065307955329","commenter_b":"I leave my sweat for the next guy/gal so they can draw strength from my juices. Welcome.","commenter_a":"And how long are you supposed to wait before you wipe it down after you use it? Dear people that leave sweat stains on the machines and don't wipe it down after they're done, screw you.","post_message":"Pump some iron or nap? Nap."},{"comment_id":"10153722774708984","commenter_b":"God's Son, Jesus, was sent to Earth as a baby. Grew to be a man, ministered to people healing the sick, performing miracles, teaching about God's Kingdom. Was rejected by His own Jewish people, suffered and died on a cross. Arose from the grave the 3rd day, talked and ate with His disciples, talked to 500 people before ascending into Heaven to sit at the right hand of God, and to prepare a place for us. If we accept Jesus as the Son of God, repent of our sins, God is gracious to forgive us and save us from eternal death. We will live in peace and love and joy in our eternal life. Jesus said \" I am the Way, the Truth, and the Life, and no one comes to the Father God but by Me.\" As for me, David, I KNOW He lives in my soul. Also, I ...","commenter_a":"There is a little truth in all religion so who is to say what is right or wrong but no one's have any biasness at work or in or government god is only a word that represents all religion. Leave it in your heart's and at home or where ever it is that you warship. We are all equal no matter what I don't want any of them I have my own. No one or nothing can take that from me. Try believing in that.","post_message":"Boom! Mike Huckabee just dropped one EPIC line about Hillary Clinton and Kim Davis that will have liberals absolutely livid. He is putting himself on the line big time for this county clerk, and many are joining him in it.  Do you support what Mike Huckabee is doing?"}]
