[{"comment_id":"1571937346447279","commenter_b":"Get a new woman then!","commenter_a":"In the singing voice of Brad Paisley: Im gonna miss her.... I love my husband AND my guns!","post_message":"\"Sex strike\"  WATCH:"},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"530005010538423","commenter_b":"Hey @username! U must identify yourself the opposite of what you were born as!?!?!?","commenter_a":"There are SO many other REAL issues the VA should be working on, and this is NOT one of them.","post_message":"A proposed rule would end the U.S. Department of Veterans Affairs' longstanding ban on gender reassignment surgery."},{"comment_id":"10155014119221178","commenter_b":"Democrats have always gotten away with MURDER!!","commenter_a":"Accountability was not a word he knew--or enjoyed.","post_message":"Talk about a major understatement from The Daily Beast."},{"comment_id":"10153375560764087","commenter_b":"\"We should let all the Muslims in or they'll kill us.\" -What Liberals actually believe","commenter_a":"Is rep McCaul suggesting that a large percentage of otherwise peaceful and law-abiding Muslims are ready to put that to one side and become violently active simply because someone like Trump says something outrageous? Why does McCaul place such low faith in the Muslim community? And if he is right then isn't he proving Trumps point?","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"1037202013040797","commenter_b":"@username oh go screw yourself you ignorant idiot i could care less about what you think ....arrogant pig","commenter_a":"Just goes to show what kind of trash is on trumps payroll he is nothing but a pig and so are his delegates OPEN YOUR EYES PEOPLE he is nothing but a piece of crap","post_message":"The Trump campaign said the man will be replaced immediately."},{"comment_id":"10153480904281162","commenter_b":"I just would like to know, how much money has she spent in tanning salons...","commenter_a":"i've been black since I was 5 yrs. old. look at my pic.","post_message":"BREAKING: Did Rachel Dolezal lie about her race? Dolezal, the woman at the center of the race controversy, has resigned as the president of the Spokane NAACP @webpagelink"}]
