[{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"497892010370754","commenter_b":"I should be arrested for the nuclear bomb I just dropped in the women's bathroom at my work. You'll never take me alive!","commenter_a":"I hope his family sues the shit outta that school so his entire future is paid for, Racists fucks","post_message":"\"Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great.\"  - President Barack Obama"},{"comment_id":"362582817419205","commenter_b":"They are terrified because of the media's misinformation. They blow the slightest remark out of proportion. He wants to expand on a wall that's already there. And the country has been deporting illegals the whole damn time. LGBT will continue to have their rights. And the so called race war is fueled by the media. Look at a person's character not at their skin.","commenter_a":"He should quit whining and moaning. I can assist him get residency in Madagascar within 15 minutes.","post_message":"Van Jones responds to the anti-Donald J. Trump protests: “We have to hear the pain.”"},{"comment_id":"10154882133170329","commenter_b":"Really people! No arguments please","commenter_a":"The correct term is Native American.","post_message":"\"I realized that half the world made such an effort to get what I am naturally blessed with.”"},{"comment_id":"1160971703940168","commenter_b":"BULL$H!T","commenter_a":"Then the black community should stop committing more than half of the crime in this country and start acting like civilized human being.","post_message":"\"Would this have happened if those passengers would have been white? I don’t think it would have.\""},{"comment_id":"10154398090436523","commenter_b":"She loves abortions. Of course her mother chose life for her. Lol","commenter_a":"Just look who they are and what their purpose is. This is just Evil and Horrendous!","post_message":"WATCH: Women's March on Washington, D.C."}]
