[{"comment_id":"1246779605377041","commenter_b":"this is the first smart commnet I read on here","commenter_a":"People just need to work harder and not be lazy is all.","post_message":"To bring back the so-called  dream, we desperately need to address the massive inequality that exists in America today."},{"comment_id":"10153594366538352","commenter_b":"Kiss my black ass old lady!","commenter_a":" Wait let me get this straight well never mind because I know if he was black it would've been reported when he took a crayon from school because that's how deep they dig! #BlackManCantFartWithoutBeingCalledAnAnimal","post_message":"Biker killed in Waco shoot-out was a law-abiding decorated Vietnam veteran with Purple Heart, records reveal – despite police claims that all 9 dead were criminals"},{"comment_id":"872258432910129","commenter_b":"Really Kathy? I can't believe any woman would ever even think of voting for the dumpster","commenter_a":"If you vote Hillary, you're voting for babies to be murdered, etc. She needs to stay home and clean house. She can't even do anything with her husband. How can she run a country.","post_message":"WATCH LIVE: Former NYPD commissioner talks about election day security  — who will win, Donald J. Trump or Hillary Clinton?"},{"comment_id":"10152771532479342","commenter_b":"His other girlfriend","commenter_a":"Who do you think he's talking to on the phone.... his wife....","post_message":"The game is tied in the fourth quarter and you're not even paying enough attention to realize you and your girlfriend are on the kiss cam?   There are many things wrong with this sports \"fan,\" and he gets what's coming to him.    SEE VIDEO --> @webpagelink/  What do you think -- real or staged?"},{"comment_id":"1795134364108592","commenter_b":"Lock them up! Bunch of crybabies","commenter_a":"Pull out a bull whip and whip these bitches","post_message":"FOX 12's Mega Sugianto is live as protesters march for a fifth night in downtown Portland."},{"comment_id":"10153475900679705","commenter_b":"Excuse me, but what kind of a MOTHER leaves her DAUGHTER behind because there's no seat for her?!","commenter_a":"There's very easy way to avoid these things. Don't piss about at the last minute and end up being the last person to check in. Guaranteed a seat on the plane.","post_message":"Unbelievable."},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"}]
