[{"comment_id":"10153981335574060","commenter_b":"While we're at it, how bout you just shut your sass mouth, too.","commenter_a":"I love you, Economist. I do. And I'm no Trump supporter. But my reaction to this is the same as any time you tell America how to run itself: Mind your own damned business.","post_message":"The Economist cover story in the Americas and Asia Pacific  Donald Trump is unfit to lead a great political party, let alone America. It's time to fire him.   February 27th - March 4th  Read free via @webpagelink"},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"},{"comment_id":"10153447455781051","commenter_b":"Trash get class Ur pregnant!","commenter_a":"Well if there married its her car too sucks to be him hopefully the baby in her tummy is ok","post_message":"When passersby saw this pregnant woman smashing a car in the parking lot, they ran outside to stop her. As soon as they learned why she was doing it, they let her continue"},{"comment_id":"10154033103686065","commenter_b":"he is just telling it like it is....and i am him now","commenter_a":"On point and going after the media . Media is so bias and they are being called out for what they are.","post_message":"What do you think?"},{"comment_id":"894715537301698","commenter_b":"The best thing you are doing, Mr. Trump, is weeding the un-Americans out from our society. You are already making the change for America being great.","commenter_a":"@username how was your preteen sexparty with you friend Epstein. It sound s you got a problem dude. Defloration of a 12 year old girl is not ok, if you know what I mean","post_message":"The \"protesters\" in California were thugs and criminals. Many are professionals. They should be dealt with strongly by law enforcement!"},{"comment_id":"10153560917566615","commenter_b":"Get off of here Martha","commenter_a":"Who cares he got away with rape.","post_message":"WELCOME TO STEELERS NATION, BABY BODIE!  The newest addition to the family of The Pittsburgh Steelers QB Ben Roethlisberger is right along side the rest of the City of Champions tonight, cheering on the Pittsburgh Penguins to a Game 7 win! LET'S GO PENS!  (Photos courtesy of Ben Roethlisberger - BigBen7.com)"},{"comment_id":"678004185692498","commenter_b":"What self respecting woman wouldn't lash out at a woman trying to seduce her husband?","commenter_a":"“Bimbo eruptions.” “I would crucify her.” “We have to destroy her story.” These are just some of the things said and done by @username to undermine women who accused her husband, Bill Clinton, of infidelity and even assault. Hypocrites!","post_message":"\"This is not something that we can ignore. It's not something we can just sweep under the rug as just another disturbing footnote...this was not just a lewd conversation, this was not just locker room banter. This was a powerful individual, speaking freely and openly about sexually predatory behavior.\" —First Lady Michelle Obama on Trump"}]
