[{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""},{"comment_id":"10153919372908352","commenter_b":"A REAL MESS..WOW","commenter_a":"Macho","post_message":"‘I feel like a princess!': Transgender teen crowned homecoming queen at Missouri high school"},{"comment_id":"10153304270661051","commenter_b":"(Sigh) Non sequiturs everywhere.","commenter_a":"So. Arrested him for killing a lion and thugs that kill cops are going free what's wrong with picture so animals are more important than people's lives","post_message":"Cecil the Lion's hunter has been arrested."},{"comment_id":"1082383445115167","commenter_b":"Looks like a Transvestite Alien. Brucelyn Jenner looks better","commenter_a":"A new level of trashy. Way to be a good role model (insert slow clap)","post_message":"DAMN, TAYTAY!"},{"comment_id":"678882268945673","commenter_b":"Rosie has the mental disorder! She is a raving maniac!","commenter_a":"I thought she was moving....","post_message":"WOW! Leftist Bully ROSIE O'DONNELL Pushes Horrible Rumor On Social Media...Suggests Barron Trump Has Mental Disorder [VIDEO]"},{"comment_id":"337708566573297","commenter_b":"Trimp for president......HOW SCARY IS THST IDEA !!","commenter_a":"Vi a una persona que se preparo para el debate asi como se ha preparado para ser presidenta del pais. Por otro lado vi a un empresario que oculta sus deudas, que ha hecho su fortuna estafando a mucha gente.","post_message":"Donald J. Trump says he did President Obama a favor by being racist."},{"comment_id":"10153061445106167","commenter_b":"Kirsten Miller - ironic that you have a rainbow avatar while desperately trying to appease muslim terrorists. now go put on your burka and be quiet.","commenter_a":"Oh so now it's America's fault a Muslim shot and killed our members of our military. And liberals are once again showing there true colors. Anyone who buys this garbage is the problem.","post_message":"Why does the media ignore how violence is now a part of American culture?"}]
