[{"comment_id":"10153638805358598","commenter_b":"Abortion is NOT legal!","commenter_a":"just go above the supreme court and ban all abortions.","post_message":"BREAKING NEWS: Supreme Court Won’t Let North Dakota Ban Abortions on Unborn Babies After 6 Weeks"},{"comment_id":"10153702004727464","commenter_b":"He is my Prince.","commenter_a":"Conservative....I don't think that word means what you think it means.","post_message":"Act out a scene from The Princess Bride?  As you wish..."},{"comment_id":"10153113933254071","commenter_b":"Anders Rojas","commenter_a":"Jeyhun OrujovMalek MasAdil Mirzayev","post_message":"$10 million over the already insane $50 million asking price."},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"10153255421196028","commenter_b":"AMERICA IS MY COUNTRY AND I SPEAK ENGLISH!!!!! ENGLISH ONLY IN AMERICA. NOT SPANISH. I have nothing against latinos BUT come here and get legal.. speak English.. STOP HAVING BAMBINOS IN AMERICA SO WE PAY FOR IT.","commenter_a":"@username, I hope one day you decide to go home as well. Maybe to your own country? Thank you.","post_message":"\"I feel hope again.\" Lorenza Cardenas and her two daughters were living in a small storage unit in a San Diego junkyard -- until things finally turned around for the family: @webpagelink"},{"comment_id":"10157270600175389","commenter_b":"Wow... she sure lost her dreadlocks for her 10 minutes on Hannity didn't she!","commenter_a":"Love how she went from braids to foxy diva afro overnight. That's all I got from her. Yawn.","post_message":"\"I don't believe in any cause that takes innocent lives, regardless of what that cause is.\"  Former Miss Alabama Kalyn Chapman James, who referred to the Dallas shooter as a \"martyr\" in a now-viral video, said she believes Micah Johnson thought he was dying for a cause, but was \"evil.\""},{"comment_id":"10154151244455579","commenter_b":"A fool and her money are soon parted.","commenter_a":"Just now donated $20 for Hillary Clinton and committed to caucus in my state hope you do the same right now:) I am voting for Hillary because I fell she is the best qualified person. Three Supreme Court Justices will mostly likely be appointed and I want a democrat to be the one to select the appointees. She can do it better than Bernie plus backwards and in High Heels. We have made such progress under President Obama I would like to see how much more we can continue to do and I trust her and honestly know she will be the best Person and successor to Barack Obama additionally she has devoted her \"entire life\" to bettering the lives of the American People.","post_message":"Hillary Clinton: \"We are going to fight for every vote in every state.\" Full video here: @webpagelink #CSPANfan"}]
