[{"comment_id":"10154730385206341","commenter_b":"Understand. Thank you.","commenter_a":"Hmmm, an army that establishes a state based on a single religious identity through violence and ethnic cleansing. Why does that sound familiar? Oh yah! Ding Ding Ding Ding! Is the big chief still living in the nineties? They already look like ISIS to most of the world, just a little less sloppy.","post_message":"\"The commanders are the ones who should set the rules of engagement, not politicians\""},{"comment_id":"10154482424522144","commenter_b":"White, \"christian\" males should be put in concentration camps as they have killed more Americans than muslims","commenter_a":"They don't fit his fantasy of a dystopian world???","post_message":"Actually, it's Trumpnot the mediawho's ignoring certain terror attacks. Guess why."},{"comment_id":"773846622745734","commenter_b":"@username Hillary is For everyone . Remember being rich does not make for a bad American. Honesty and integrity and caring about each other is what matters . Turn on ur heart lite ( just like Hillary said ) Everyone matters and together we can be a united people .","commenter_a":"Well, now I feel guilty! Before her uplifting victory speech about sticking together and lifting each other up, I was on another site smacking Bernie Brats upside the head. I'm gonna work a little harder on that \" love each other \" thing! Sorry, Bernie folk! So, gently, respectfully, and with loving patience in my heart: Go Hillary, go!","post_message":"It may seem odd to hear someone running for president say we need more love and kindness in America—but we do."},{"comment_id":"10155461378486509","commenter_b":"trump Come clean , admit your a Rapist and we will feel sorry for you and vote for Hillary ,","commenter_a":"I'd love to see Trump supporters try to deny he said the things he was filmed saying.","post_message":"Watch Anderson Cooper repeatedly ask Donald J. Trump about sexual assault at the last debate. @webpagelink"},{"comment_id":"1302858003140584","commenter_b":"Hillary is a war monger. You think There would be peace if she was elected?","commenter_a":"He will destroy this country parents get ready to send your children to war","post_message":"Nailed it."},{"comment_id":"1379025478784145","commenter_b":"These r not protest they r riots","commenter_a":"They need to throe away the flash bang and prepped spray and use real ammo","post_message":"Seattle May Day protesters threw flares, bricks and Molotov cocktails, while police returned fire with flash bangs and pepper spray.  More here: @webpagelink"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."}]
