[{"comment_id":"10154330799961756","commenter_b":"Not true she's probably going to make more blackmailing than having sex eventually","commenter_a":"Why do you do this, it will never go away, it is a fact of our lives. Make it legal, tax it and provide health regulations~","post_message":"Clients will be fined about $1,700 for the first offense."},{"comment_id":"1338478099545268","commenter_b":"I really hate that women","commenter_a":"Like that's a surprise. ..Not at all..","post_message":"Is this how Casey Anthony paid for her defence?"},{"comment_id":"10153655296938854","commenter_b":"Kerry is no better than anyone else, if he was involved...Then buddyboy...fess up. This whole situation is starting to smell like Watergate. Where's Woodward and Bernstein...Let them have a crack at it!!! Somebody needs to tell Trey Howdy you have full reign, do whatever you need to do, just get to the bottom of this!! And I'll bet you BARACK OBAMA'S NAME is all over it, just like Richard Nixon's was in Watergate. The major difference between the two is that PEOPLE DIED IN BENGHAZI. And just to show the impertinence of Hillary when she said, \"What difference does it make now?!!\" The difference is you Communist is that AMERICANS DIED YOU HEARTLESS WITCH!!","commenter_a":"Elijah Cummings is one of the dumbest mf'rs on this planet....voted for by a large number of even dumber mf'rs in his illegally gerrymandered district. He is so stupid, that he has no business in congress, and along with the rest of the liberals in Congress and the white house, he should be swinging at the end of a rope. He knows what he's done....we know what he's done.....","post_message":"Elijah Cummings: “Shockingly Disrespectful” To Subpoena John Kerry About Benghazi…"},{"comment_id":"10155513356146350","commenter_b":"We need a Boog!","commenter_a":"@username Hannah Prior Joel","post_message":"WATCH: A baby bear named Boog meet his new fawn friend. HIS NAME IS BOOG. @webpagelink"},{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"463711880486059","commenter_b":"Not in my world, just send them all anywhere else but America. Muslims Need To Go. .....Get Them Gone.","commenter_a":"NO !","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10153524909826130","commenter_b":"If Trump had his way Muslims wouldn't be aloud to return if they left the states either.","commenter_a":"Muslim terrorist kills Americans again and liberals continue to make excuses for Muslim terrorist. Over 3,000 killed on 9/11, more than at Pearl Harbor , Fort Hood Muslim terrorist killed many, Muslim Boston pressure cooker bomber mangled several, Muslim husband and wife kills several in Ca. Liberals seems to love Muslim terrorist. Muslim terrorist cuts heads off reporters and airs the videos, Muslim terrorist throws homosexuals off roof tops, Muslim terrorist drown people in a cage, Muslim terrorist burns people alive.","post_message":"Donald J. Trump says he doesn't know any Muslim athletes, but these photos say otherwise."}]
