[{"comment_id":"707783986078846","commenter_b":"Ugly bitch man!!!!","commenter_a":"Just plain stupoid","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"479371038920143","commenter_b":"Put that stupid bitch in a uniform and make her serve!","commenter_a":"no wonder look who shes married to","post_message":"Michelle Obama just made an outrageous claim...  Our soldiers fight and die for our country, Michelle takes lavish vacations.  Do you respect our veterans over Michelle?"},{"comment_id":"539890196201560","commenter_b":"She's a douche bag!!!","commenter_a":"They both should do jail time.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"1705936436359891","commenter_b":"Oh shut up! The murdering, lynching KKK will be around to continue their hate. It would be great for you all to go back where you came from. The Indians would love it!","commenter_a":"so Black lives matter can protest anywhere and everywhere, but no other group can.hum? not that i agree with the kkk but they do have the same rights as Black lives matter.","post_message":"By the time this KKK rally was over, blood was on the sidewalks and ambulances were on the way:"},{"comment_id":"936551829771205","commenter_b":"The United States is a weapon of mass destruction. NO MORE WAR.","commenter_a":"So you can wittness more families lose their love ones and get richer doung so. How many of your children will you send.","post_message":"The war criminal has emerged from the shadows once again."},{"comment_id":"975510729232372","commenter_b":"Those animals have to be destroyed and kept out of America","commenter_a":"TIME TO GET RIGHT","post_message":"What radical muslims are allowed to do to their own families is absolutely horrifying. We cannot let this ever happen in America no matter how hard these radicals try to impose their ideologies on our great nation.   SHARE if you agree that this disgusting practice needs to be wiped off the face of the earth!"},{"comment_id":"10155098907990329","commenter_b":"I'm always grateful to be corrected, especially when someone is able to be patient with me even though I'm not owed it :)","commenter_a":"My family has been calling this season's theme \"A Haunting\" because of the reenactments and stuff. I like the season so far but guys, what happened to the people of Roanoke really isn't that big of a mystery. Most likely after part of the group left to get supplies more colonist died from a mix of starvation and attacks. They then most likely moved to settle with the Croatoan tribe for both help feeding themselves and protection. It also helps explain the upsurge in Croatoan children with blonde hair or other features that are rare, though not unheard of, in their genetic pool. Basically, your elementary school teacher lied to you. Other lies you learned in history class: the Mayans didn't just mysteriously disappear. They over farmed the valleys they lived in and could no longer continue to occupy large cities and began living in smaller groups. They're are still ...","post_message":"Mind blown. // American Horror Story"}]
