[{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat?   Hillary: Sure! 👻"},{"comment_id":"10153592600809607","commenter_b":"@username Many Americans want the wall. Unless they are not here legal ofc....","commenter_a":"#Trump2016 Trumping along and Making America Safe and Great Again #VoteTrump and vote often #Winning #WinningTeam #2A #Gunrights #Love #GOD #Family #TrumpTrain #FreeMarket #Religion #Veterans #Freedoms #BillIOfRights #Constitution #Liberty #FencePaidByMexico #TruthHurts #FreeSpeech and #RealJobs for Americans with a sweep in all 5 states!","post_message":"\"As far as I'm concerned, it's over,\" said GOP front runner Donald Trump. \"I consider myself the presumptive nominee.\""},{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"10154775729248812","commenter_b":"Not to mention she has dyed her eyebrows to try to look younger. Won't work. She still looks like she needs a nap.","commenter_a":"They both disgust me","post_message":"Hillary Clinton: “Last night I was ‘grossly generalistic,’ and that's never a good idea.\""},{"comment_id":"10152778117529117","commenter_b":"Don't bother putting on those slippers, Princess. Instead, let's get men to carpet the whole fucking world for you.","commenter_a":"Let's stop men's definition of consent, because all rape laws were designed to help men get away with the crime. Electronic devices on the male penis, if he gets out of control ZAP--- might be effective. Hey if women controlled technology what kind of world would we have?","post_message":"The reality of campus rape cases is more boring than Rolling Stone's story of ritualistic gang rape at UVA: Alcohol abuse is almost always the real culprit, and the problem for which there is an obvious solution."},{"comment_id":"514466908734354","commenter_b":"We have enough homeless, and veterans who need out support. We need to stop being 911 for the rest of the world. Deport the illegals, Some say illegals do the jobs Americans won't do, then American's better start doing them.","commenter_a":"HEY OBAMA FORGOT ABOUT THIS LAW......Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means.\" This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the ...","post_message":"ICYMI: \"A new Fox News poll shows 52 percent of the nation favors deporting the millions of illegals back to their home countries. Republicans and Democrats support Mr. Trump’s plan,\" writes Todd Starnes."},{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"}]
