[{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"1226103374093667","commenter_b":"Yeah go, go away!","commenter_a":"I assume nothing! We have a few days to get people registered! Then we have to get the early vote and day of vote out! Go Trump!","post_message":"\"For those few people knocking me ...\""},{"comment_id":"10155198682596002","commenter_b":"Sad now she is looking like a joke.","commenter_a":"I still remember Hillary as 1st lady saying stand by your man.","post_message":"What do you think of her statements?"},{"comment_id":"1374953252516136","commenter_b":"OH my goodness....Awesomem display of fireworks...:'(","commenter_a":"Happy New Year to all family and friends in London ❤❤❤❤","post_message":"We at the London Eye to welcome in the New Year."},{"comment_id":"10154140324537690","commenter_b":"Economically saying no to this is an economic disaster.","commenter_a":"I do live in Arlington. I like the ballpark we got! And really, do you believe in no new taxes?","post_message":"The debut this week of Arlington's plans for a massive entertainment complex to be built around a proposed new baseball stadium is not sitting sitting well with everyone."},{"comment_id":"642441049213821","commenter_b":"Crying over spilled milk. She should move on","commenter_a":"Our system does NOT invite tampering, if you asshats didn't decide to cheat. Pure and simple! And the fact that you and your ilk can so easily rationalize your way around the rules suggests that you're definitely part of the problem.","post_message":"Green Party presidential candidate Jill Stein says a recount is needed because the current voting system \"invites tampering\" and there have been many \"red flags\" with votes in the election. Should there be a recount?"},{"comment_id":"10153636855342426","commenter_b":"What a tragedy","commenter_a":"R.I.P. D'Marco you fought a good fight","post_message":"D'Marco Jackson passed away this morning. You may remember D'Marco from an inspirational speech he delivered last year at the Hermitage High School graduation.  “If I had to pick a singular piece of advice to give you all, I’d say this … do not let the realities of the past or the possibilities of the future negatively affect the peace, joy and happiness that the present has to offer,” he said.  Read more: @webpagelink"}]
