[{"comment_id":"10153645294706756","commenter_b":"why is it people still think illegals vote? they cannot unless they are registered, the only thing the federal gov't requires for illegals is emergency care at hospitals in case of sudden illness or accident, otherwise illegals do not get food stamps or welfare and why would they try to register to vote risking getting caught? some people need to get a new talking points, this one is old and stale","commenter_a":"The Republicans made a conscious decision to go after the angry white conservative male vote with everything they had. Now they get to live with that decision, riding into the sunset as a shrinking regional party based on anger and resentment. A modern version of the \"Know-Nothings\", if you will.","post_message":"To put it one way: \"Republicans have been arguing since 2012 about — do we need to change the pizza or do we need to change the pizza box?\" says David Frum, a former speechwriter for George W. Bush. \"And I think the correct answer is we need to change the pizza.\"  But change, however they want it delivered, has come in fits and starts for the GOP."},{"comment_id":"10156017725535405","commenter_b":"Btw, Bob, Walker has never had a surplus. He borrowed $3 billion in a series of loans, threw it in the bank and called it a \"surplus\" withput taking into account the 30 debt payments on his loans. Links to the official records are here, mostly oin the footnotes: @webpagelink","commenter_a":"Scott's ok in my book. He reduced my property tax by about $500. Better than tax and spend Doyle who raised every tax and fee he could, typical tax and spend democrat. Scott let's clean house, enough with the time for a change, it's definitely time for a change.","post_message":"Governor Walker was on \"The Kelly File\" last night, highlighting his plan to challenge big-government special interests at the national level and put the hardworking people of America back in charge."},{"comment_id":"10154362042947756","commenter_b":"I would like to point out, this is myself debating with other women, not only do they act insane, but they will hate on any woman whom has a different opinion, get rid of the illegals, they are a drain on our economy...period, if you don't like, then let them live in your home, your a bunch of rabid animals acting like crazy people...how can anyone ever take you seriously...this was an experiment for my college professor whom wanted us to learn abouy equality...lol","commenter_a":"Well once all the blood sucking illegal's are gone, we can put money towards our vet's and the wall, we all know Mexico is to cheap and lazy to pay for it.","post_message":"President Donald Trump is expected Wednesday to move forward with plans for border wall, increased deportations."},{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"10153159279537452","commenter_b":"^^ wrong house","commenter_a":"How about the government stay out of our homes.","post_message":"THIS JUST IN: The Los Angeles City Council unanimously voted to require guns that are stored at home to be kept in locked containers, disabled with a trigger lock. abc7.la/1GGHSUi"},{"comment_id":"620617391457056","commenter_b":"Cleavage queen","commenter_a":"Just once I would love to see Mariah dressed in a turtleneck !","post_message":"It really is the most wonderful time of the year!"},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"}]
