[{"comment_id":"1202133839801897","commenter_b":"Charley, you are a part of Racist America too !","commenter_a":"Republican piggish bigoted racist' hate !","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.”  Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"},{"comment_id":"1406386459390310","commenter_b":"OMG this woman is a liar and blowhard","commenter_a":"Does not matter who he picks. Cruz can not win. He will need voters in the general and he has very few of those.","post_message":"This is a big play."},{"comment_id":"10153353712173984","commenter_b":"Ugly BASTARD.","commenter_a":"Wow Al really got hammered but Al doesn't care he's laughing all the way to the bank.","post_message":"Wow! One of the top conservatives on the internet just lowered the boom on Sharpton in a big way. Many people were thinking it, but only one had the guts to say it..."},{"comment_id":"1520211998272919","commenter_b":"Amanda Murphy Maldonado they can take their kids with them. No families have to be busted up. Then when they kid is of age he can come back as a citizen. LAWS are LAWS...what laws are you CHOOSING to break?","commenter_a":"SEND THEM HOME. This isn't just \"politics\" anymore, this is the deliberate destruction of America from within. When they jumped the wall the broke the law!","post_message":"Breaking News: The Supreme Court says it will review President Barack Obama's orders to shield up to 5 million illegal immigrants from deportation. @webpagelink"},{"comment_id":"1054986811286811","commenter_b":"She is looking weak","commenter_a":"Hillary Clinton is as transparent as mud. She's so deplorable....no wait...I don't want her sharing my basket. Trump/Pence 2016","post_message":"Question of the Day: Do you think Hillary Clinton has been transparent about her health? Share your thoughts below!"},{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"}]
