[{"comment_id":"10153372817373812","commenter_b":"Sign me the ef up!","commenter_a":"@username thank gawwwwd","post_message":"FDA approves new drug that claims to eliminate double chins: @webpagelink"},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: \"Never stop believing that fighting for what is right is worth it.\""},{"comment_id":"1817386261807116","commenter_b":"I agree! She is pure evil!!","commenter_a":"Totally agree with Newt Gingrich! She has no scruples! She belongs in prison! Cannot stand this heartless woman! She just won't disappear!","post_message":"Newt Gingrich says Hillary Clinton is without a doubt one of the most corrupt politicians in American history. Do you agree or disagree?"},{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"10153230993584342","commenter_b":"No. Lol. I would have done that too.","commenter_a":"The restaurant manager obviously handled the situation poorly. She waited too long to intervene and then did it in anger. That is unprofessional. BUT.... The parent who allows their child to disturb all the people around them trying to enjoy a meal is inconsiderate and selfish! The excuse that the child is waiting too long for food is poor at best. You as a parent and should come prepared to entertain your child... That includes providing them snacks and toys. The parents should have removed that child from the table within 5 minutes of the unresolved tantrum. Yes... I am a parent and never allowed that to happen. Remember that you are not the only person in that establishment spending hard earned money to enjoy a simple meal!","post_message":"DINER OWNER YELLS AT CRYING CHILD: \"I turned around, slammed both hands on the counter and then pointed at the child and said, 'This has got to stop!'\" said Darla Neugebauer, after she says a toddler cried for more than 40 minutes. The child's mother is furious. Did the diner owner go too far?"},{"comment_id":"10152694433051045","commenter_b":"twatwaffle.","commenter_a":"Melissa YES HE DOES! Can you imagine just how i said that, YES HE DOES!!!!","post_message":"Alabama Chief Justice Roy Moore sent a letter to probate judges Sunday evening ordering them to refuse to issue same-sex marriage licenses."},{"comment_id":"1299379106804981","commenter_b":"Uh, she should be arrested!","commenter_a":"Sorry, but if didn't want anyone to see it, he should have put it in a folder, or face down, or taken it with him when he got up.","post_message":"You should be mortified - Post Updated *******************"}]
