[{"comment_id":"10153238798269255","commenter_b":"OMG! Saved from the menace of foreign wine!","commenter_a":"Hahahahahahahaha.","post_message":"Dummy."},{"comment_id":"10154085001886800","commenter_b":"Eve, the most hated woman to ever exist.","commenter_a":"More specifically, women are paying for it. Eve ate the apple, now we're cursed with periods, painful pregnancy, and really shitty mood swings.","post_message":"Connecticut lawmakers want to get rid of the statute of limitations on child sex abuse cases, but they're running into opposition from the Roman Catholic Church."},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."},{"comment_id":"10153347951697144","commenter_b":"that's most likely it - when people camp out, they live somewhere, and the fault line between public and private gets blurred.","commenter_a":"why didn't they want the press there?","post_message":"Finally."},{"comment_id":"1619461488113974","commenter_b":"Fuck Rosie!!! Stay fuck out of the U.S. no one misses u ... we promise!!!","commenter_a":"She was right about one thing. She truly is one sorry individual.","post_message":"Keep 10 year-old Barron out of politics!"},{"comment_id":"10153117500629342","commenter_b":"#seriously what woman wants to see a man in tight shorts? #smh","commenter_a":"Jenn Nunez I will be going to Dallas soon","post_message":"The restaurant says it offers something for both girls and boys."}]
