[{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"968496726540356","commenter_b":"That thinking, @username, is why so many illegals come here. They know if they have their 'anchor' baby here, they will get to stay because that baby needs parents to care for it. More illegals come, have their babies, and get to stay...it's an endless invasion!!!","commenter_a":"If you are born in the United States and not on foreign soil like an Embassy, then you are an American, but that doesn't mean your parents or the rest of your family are!","post_message":"A few of the candidates have come out against birthright citizenship so far.  Message your Rep and make your voice heard!"},{"comment_id":"10154414118997042","commenter_b":"Exactly, she's just a trophy Wife to Donald anyway.","commenter_a":"Mealania Trump's If she only had a brain","post_message":"Melania Trump is being accused of plagiarizing from Michelle Obama's 2008 Democratic National Convention speech.   Judge it for yourself:"},{"comment_id":"1095120020511481","commenter_b":"Can you imagine a women asking for that to happen What an ass","commenter_a":"rapper bitch needs to be hung .....","post_message":"BOOM."},{"comment_id":"884237154958166","commenter_b":"I would rather help pay his court fees than support all the illegals obummer opened the door for.","commenter_a":"Once Joe is gone the new one will see what it is costing the county and shut it down. The court problems Joe is going through now is just the beginning of his downfall.","post_message":"SOUND OFF: Tent City Jail turns 22 years old, and some people think it is time for Sheriff Joe to shut it down. Let us know what you think, then tune in to FOX 10 Arizona Morning and we will use some of your comments on the air."},{"comment_id":"849701391772757","commenter_b":"No more Somalis","commenter_a":"Part of barack islama's let everybody from any country come in when they want. No bg checks.","post_message":""},{"comment_id":"10154117149131491","commenter_b":"@username let me see your nudes.","commenter_a":"18 months is not enough, in my eyes what he did was a form of sexual assault","post_message":"It all comes after private photographs from celebrities like Jennifer Lawrence and Kate Upton were leaked online."}]
