[{"comment_id":"857457044291637","commenter_b":"One man will never accomplish that .That will never happen.","commenter_a":"Obama is very naive when it comes to the Arabs. Maybe he is trying to have faith in human nature.that will not work in that cesspool in the middle east.That viewpoint does not even work here in a fairly civilized country.","post_message":"“Even if Israel has to stand alone, Israel will stand.”"},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10153284807073984","commenter_b":"That thing is female !","commenter_a":"Shame on the university for hiring her and for not firing her......something is mentally wrong with her.","post_message":"Surprise, surprise, she is an extreme liberal.  Does this type of behavior from a teacher make you sick?"},{"comment_id":"10153823756905671","commenter_b":"Probably no one in particular , some clubs are natural enemies to each other","commenter_a":"Wonder who he pissed off?","post_message":"A motorcyclist was shot dead on Interstate 80 near Truckee."},{"comment_id":"760481220717153","commenter_b":"stupid bitch","commenter_a":"SICK SICK what the hell is wrong with people now days?","post_message":"Terrible."},{"comment_id":"10153415357404486","commenter_b":"Deport illegals with a QUEER under each arm","commenter_a":"QUEERS WIN !","post_message":"The Supreme Court just changed everything - what do you think?"},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"}]
