[{"comment_id":"10154339492484087","commenter_b":"@username, good luck trying to deport a Native, you racist bigoted POS.","commenter_a":"Meanwhile, Boeing stocks take a hit because of this asshole.","post_message":"Boeing released a statement saying it was under a $170 million contract with the Air Force, not $4 billion as Trump claimed."},{"comment_id":"934918126557241","commenter_b":"Why dont you vote for Hillary then? She cant say two words without lying her ass off. But I bet everyone who commented will be there to vote for her. Thats why Donald is SELF FUNDED. Doesnt take money from soros or rockefeller. Thats why the media hates him and all of you do as well. Obama has already said that muslim refugees will go in a database. But when Trump says it hes a racist bigot. Obama used different \"words\" and its totally different . When really its not. Its the same and Im not argueing . I hope you will all be happy when your next LIAR is elected. Thats why grandkids wont enjoy America as you did. Thanks dickheads.","commenter_a":"The dude tells the truth. Regardless noone else has rhe balls to speak the truth anymore","post_message":"The call took place right around the time Donald Trump announced his intention to bar Muslims immigrants from entering the U.S."},{"comment_id":"10152777705324877","commenter_b":"not true.","commenter_a":"True. And she knows and will continue to go along with... People like them are ALL ABOUT money, and will do ANYTHING to keep it coming in their accounts!","post_message":"Mike Huckabee: Jay Z Is Crossing The Line Of Husband To Pimp. Read more of the conservative's tirade on Beyonce and Jay Z.   Grio fam, read his words and sound off with your thoughts."},{"comment_id":"10153455879676350","commenter_b":"Yeah a good dad would have married her","commenter_a":"Give it up. There are lots of dads out there that do the same","post_message":"\"In my stupid and exhausted brain, I thought only mothers should be that calm with a brand new baby, but it took only minutes of watching Carson with Jack and I knew...he was meant to do this.\"  Read Siri's sweet words about Carson Daly."},{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"10156846569325354","commenter_b":"Get a life lady.","commenter_a":"Freedom of speech is the culprit! Quick! Stop that first amendment drivel!!!","post_message":"It's starting..."},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."}]
