[{"comment_id":"1725568321015816","commenter_b":"I see lots of people who are saying \"see a wall won't help..\" Well the truth is the government doesn't give a crap about drugs coming into this country. They will make their money off addicts and death and jail time. What the government won't make money off of is illegal immigrants not paying taxes. That's the only reason for the wall. The government just wants their cut.","commenter_a":"Nick Cal","post_message":"800-yard-long tunnel found between Mexico and San Diego containing 1 ton of cocaine and 7 tons of marijuana. It's believed to be the longest cross-border tunnel ever discovered. @webpagelink"},{"comment_id":"1205061579572376","commenter_b":"Christina @username you stupid c-unt you clearly can't read into my post. Go suck on Killerys nip..... Trump 2016","commenter_a":"For all of you who want to tell us it's a leased Eastern Airlines plane. Save it we got it and read it.....","post_message":"Barely 24 hours after Donald J. Trump accepted the GOP nomination for president, something incredible happened with his plane.  What Trump ordered for the plane has conservatives cheering and liberals pitching a hissy fit."},{"comment_id":"10153497102100163","commenter_b":"His wife","commenter_a":"I don't believe this..","post_message":"Waka Flocka Flame's longtime girlfriend explains why the couple decided to part ways"},{"comment_id":"630413113793105","commenter_b":"okay so heres why i still disagree, especially in regards to syrian refugees. the poison example is still not a good one, because no damage that isis can do to the country is comparable to the damage that poison will do to a persons body. it would be tragic to lose people in attacks, but it wouldnt be strictly \"devestating\" to the country. the united states stregnth and resolve would be largely unchanged. refuting refugees is stupid, and here is why i think so. for one, the refugee vetting process is the most extensive and thorough process that is in place, if any sort of check is going to detect a potential terrorist, this is the one. refugees take about two years to finish vetting and finally get relocated, and they dont even get to choose where they go! they get sent to a country that is assigned to them. ...","commenter_a":"@username thoughts","post_message":"Donald J. Trump tweeted about the case, saying Bonifacio Oseguera-Gonzalez \"should have never been here.\""},{"comment_id":"10153869731497042","commenter_b":"These animals with guns","commenter_a":"This this is an open and closed case? And the guy is just lucky that he wrestled the gun from his father, and killed him, before his father could kill him first? Or maybe, just maybe, he was the shooter, and he is just telling police a story. Just sounds a little fishy, don't you think?","post_message":"QUADRUPLE FATAL SHOOTING: Police are investigating after they received a call from a man saying he killed his father — but only after the father allegedly shot and killed his bedridden mother, girlfriend and friend at a home in Rowland Heights, California."},{"comment_id":"1022858884507686","commenter_b":"Just go away! Crawl into the hole of failed soorts stars, and never come out again, unless you grow up and apologize to America!","commenter_a":"Way to preach Professor Kap! Fool!","post_message":"Colin Kaepernick praised the dictator's commitment to education and criminal justice reform.  \"We do break up families here. That’s what mass incarceration is. That was the foundation of slavery. So our country has been based on that as well as the genocide of Native Americans,\" he added."},{"comment_id":"10153572345386955","commenter_b":"Both dopes.","commenter_a":"The Pope and the Dope!","post_message":"Influential Iowa Backers Get Invites to See Pope with VP..."}]
