[{"comment_id":"1010418702314511","commenter_b":"It nothing to do with race. She is a moron!","commenter_a":"they say everything is racist","post_message":"Is racism hampering Serena Williams' career?"},{"comment_id":"530286710492597","commenter_b":"When are we going to smarten up and deport Muslims and ban Islam once and for all.","commenter_a":"The Quran says it's ok to lie to the infidels . Can't believe anything they say","post_message":"\"How would you stand before God and answer to your crimes against… thousands of innocent people – Muslims, Christians and other minorities? You do not speak for us. You do not represent us. You are an aberration. You are an outlaw.\"  The CAIR  national director condemned ISIS and their supporters in the wake of the #OrlandoShooting."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be \"rebooted,\" in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"10153961468913132","commenter_b":"@username she better step away from my man","commenter_a":"@username @username @username I'm sure you've already heard, but it's foreal.","post_message":"So it IS true! Happy for Gwen Stefani and Blake Shelton. <3"},{"comment_id":"1390719824302205","commenter_b":"Our 4 rescue babies. We couldn't be happier, love them with all our heart.","commenter_a":"If I were granted 3 wishes it would be health and wealth for all my family and friends and that Clyde could talk. We stare into each other's eyes and I ask him about his family and living on the street and all his circumstance and history. I call him a bunch of names to see his reaction, Blackie, Shadow, Coal, Midnight. Larry hates that \"his name is Clyde, you're confusing him.\" I'm also proud to wear a tshirt that says \"all I want to do is drink wine and rescue dogs\" and it has a real red wine stain on the front!","post_message":"This comic shows a dog's heartwarming journey from the shelter to his forever home."},{"comment_id":"1560631690895039","commenter_b":"Good for his ASS. I hope they rape him in prison nite and day. Carma is a BITCH lol","commenter_a":"the sentence is more lenient than what he deserves","post_message":"There is no punishment severe enough for these heinous crimes."},{"comment_id":"977192562373798","commenter_b":"why not a woman","commenter_a":"Great news. Some disquieting news is that Hillie is considering Julian Castro for her VP. He is a good one and I guarantee he would jump. I really wish I knew who Bernie is considering. It should be a person of color imho.","post_message":"The American people are definitely feeling the Bern."}]
