[{"comment_id":"10154478152135326","commenter_b":"Lying hyena she worse than she dog","commenter_a":"We all got something to say about Donald Trump, and his supporters and helpers but he still the president and he's still putting our lives in danger.","post_message":""},{"comment_id":"10152715320866636","commenter_b":"Bc she is a twat!","commenter_a":"But how is this possible? Our esteemed governor immediately came back with, \"Nope, can't afford it,\" when the idea of building storm shelters for the schools was put before her...","post_message":"When an E-F 3 tornado passed dangerously close to El Reno Schools, the district took steps to ensure that if it ever happens again, students and staff will be safe."},{"comment_id":"10150724585954999","commenter_b":"By all means, Madame, blame \"gentification\" for this vile behavior!","commenter_a":"So glad I was fortunate enough to have been able to move out of that place. Poverty, desperation, lack of global perspective, dread and hopelessness all dim the people's hope. Terrible place to live. For an uplifting story about this neighborhood check out HONY's series on Ms Lopez and her school there. So much work to be done, sadly the people who live there are the most marginalized people in NYC. Short of starting over, not sure what will happen to the poor in that city in the way it's going. These are the extreme sides of the coin of gentrification.","post_message":"The woman, 18, was walking with her father when 5 men approached them."},{"comment_id":"10153440852086051","commenter_b":"@username If you are a woman voting Republican then your a full blown retard with helmet","commenter_a":"When major and I mean MAJOR republicans are threatening to vote democrat . Because of Trump something is wrong with the party.","post_message":"Here's how Donald Trump wants to deal with the families of terrorists."},{"comment_id":"10153231679439071","commenter_b":"But they're so nasty lol","commenter_a":"Hnsh Ltif ewwwww","post_message":"A company has created a replacement for water bottles that you can actually eat."},{"comment_id":"684986371683559","commenter_b":"Emotiotionless phony lying bitch","commenter_a":"Rich & stupid","post_message":"The Young Turks LIVE! Hosted by Cenk Uygur and Ana Kasparian"},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."}]
