[{"comment_id":"10153351172732439","commenter_b":"When will Americans recognize that these bitches in our country are breeding our enemies.","commenter_a":"Deport her ass NOW","post_message":"@webpagelink"},{"comment_id":"10153009843726378","commenter_b":"A female can't be a predator","commenter_a":"So if a forty year old woman had sex with your sons you'd cheer him on and joke? What about a forty year old man that had sex with your 15 year old daughter? Because according to these comments no one cares about female predators.","post_message":"GUILTY PLEA: A former Baltimore Ravens cheerleader pleads guilty to raping a 15-year-old boy."},{"comment_id":"10153517289928352","commenter_b":"They needa kill your ignorant ass.","commenter_a":"Idk but kill it","post_message":"An alien-like creature fished out of a toxic river or a neglected bear: What IS this scary looking beast which can chew through its steel cage?"},{"comment_id":"1662896673932550","commenter_b":"Her mom's argument is invalid, he's black, cops would have shot him anyway and by the time they got their clerk would be dead too, good job armed guy! (Y)","commenter_a":"Boo hoo my thug piece of shit waste of air got shot. She wanted him in jail so she didn't have to feed his useless ass.","post_message":"Normally, I would be on the side of the shooter in most cases, but this...?...  @webpagelink"},{"comment_id":"10153824514356336","commenter_b":"Yeah, build a wall. That'll do...uh ABSOLUTELY NOTHING.","commenter_a":"Now build a Wall and Deport the Illegals!","post_message":"BREAKING: In a 2-1 decision, the 5th U.S. Circuit Court of Appeals upheld an injunction blocking President Barack Obama's executive order to protect an estimated 5 million people living in the United States illegally from deportation."},{"comment_id":"10153349077816051","commenter_b":"I don't care if she black or white or Asian or Hispanic welfare queen trash should have her insides ripped out or kicked off the system sink or swim","commenter_a":"60 000 for 12 kids!!!! That's borderline poverty! Why are people making a big deal out of this.","post_message":"This mom of 12 gets more than $60,000 per year in benefits. And that's not the worst of it."},{"comment_id":"10152705409276051","commenter_b":"This scummy bitch deserves to die for what she did to that baby","commenter_a":"sorry sick people deserve the worse","post_message":"Officials couldn't believe that a mom would do this to her own child."}]
