[{"comment_id":"1011822325526221","commenter_b":"Iran needs to get with the times. You se to want tourism but then scare people off by arresting people for no reason. Wake up!!","commenter_a":"generally muslim men under lucifer Allah do not respect women very well, look obama does not he muslim islamic religion","post_message":"In recent years, debate in the west has largely focused on the more visible aspects of the status of Muslim women and Islam, with many claiming that women have fewer rights than men."},{"comment_id":"10153404609274170","commenter_b":"I use roaches. She is like a roach, nasty.","commenter_a":"Good news here .. 57% *of* 47% only comes to 26.69% overall. This places me among the 73.31 who think she's a lying skunk (and those are her good points).","post_message":"53% of voters say Hillary is not trustworthy. ...But 57% of Dems still support her.  Why?"},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"935883909841195","commenter_b":"Hey Bill,,, @webpagelink","commenter_a":"Batchit crazy Bachmann the 2nd....","post_message":"This is how much the Fiorinas are worth."},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"1013753742085664","commenter_b":"@username Babies suck!","commenter_a":"I used to dislike Clinton... I was uninformed and knew little about her other than what the right wanted me to believe. After some research and learning about all of her work on behalf of minorities, working families, women, and children over the course of her life and seeing her deal with adversity and downright deplorable behavior with strength, class, and grace, I am PROUD to give her my vote and my full support. I'll be voting Democrat down the ballot to ensure not only that she is elected, but that she has a Congress she can work with - not one hell-bent on obstruction. There is a reason she polls so much higher with EDUCATED people. #imwithher","post_message":"For 45 seconds, a drenched Hillary Clinton abandoned her script and let down her guard in Florida: @webpagelink"}]
