[{"comment_id":"10153762341043869","commenter_b":"look in g good.","commenter_a":"legend cinemas click the here ..... do not insult before trying X-Men: Apocalypse Full Movie @webpagelink Rangoon 2016 @webpagelink All Ladies do it (1992) @webpagelink Monella @webpagelink captain-america-civil war @webpagelink The Jungle Book Full Movie @webpagelink Batman v Superman: Dawn of Justice Full Movie @webpagelink Barbershop: The Next Cut Full Movie @webpagelink London Has Fallen Full Movie @webpagelink zootopia Full Movie @webpagelink Central Intelligence Full Movie @webpagelink deadpool movie 2016 @webpagelink ride-along @webpagelink The legend of Tarzan @webpagelink fifty shades2016 @webpagelink","post_message":"Like most of his predecessors, Barack Obama used the bombing as a generic invocation of the nuclear age—past tense, passive voice, Alex Wellerstein writes."},{"comment_id":"824468191027094","commenter_b":"she's so ignorant. Bet she doesn't even know where her clit is","commenter_a":"I Am probably going to make a lot of women mad over this. And yes. I happily voted Trump! My personal beliefs is that our home, church, and country should be the concerns of a MAN. Yes. There are not as many MEN around as there used to be. But my beliefs are that a woman is to further see that the teachings of the man, the guidance of the man, the protections of the man are done. And done correctly. I was very impressed with her work! She done exactly as she should! A very strong willed educated intelligent woman! He obviously has a lot of faith in her! Smart doing so also! Yet as we are saying, those on the left won't say a bit of praise to her. Smh","post_message":""},{"comment_id":"10153510448341130","commenter_b":"Because they turn away NO ONE. Because it cost a lot of money to give out free care. Or low income women can pay a small portion vs. going to a CLINIC where they want your soul before you get care. Many women are struggling to EAT. How long do you think they could do all that they do with out funds ?????????Gimme a break.","commenter_a":"Tell us something why a big corporation such as planned parenthood need my money?","post_message":"A big victory for Planned Parenthood."},{"comment_id":"1833528413366580","commenter_b":"I say build the wall right up to California and let them funnel in but the thousands and with this Joker figure out what to do with him he'll change his mind pretty quick","commenter_a":"They better stopp look and listen","post_message":"\"There’s something called CEQA in California...\""},{"comment_id":"1016384461715898","commenter_b":"So stop your judgemental whining bitch","commenter_a":"Sorry mice, but as someone with crohns I fully support this research.","post_message":"Researchers have engineered small intestinal tissue from human cells, and when placed in mice, the transplants were able to digest and absorb like the real thing."},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10153430601099255","commenter_b":"Proving again that ALL FOOLS AREN'T DEAD YET","commenter_a":"Evil attention seeker. Jealous of President Obama.","post_message":"This guy seems so pleasant."}]
