[{"comment_id":"10153151146755950","commenter_b":"Seriously, can this bitch go away?","commenter_a":"Nope don't believe it","post_message":"During their private meeting, Pope Francis told Kim Davis to stay strong, according to her lawyer."},{"comment_id":"587813824710682","commenter_b":"Fuck Clooney! Trump 2016!!! Build that wall!!! Go Trump!!!!","commenter_a":"The rich have no idea because they live in there own world behind gates and walls take away all that and see how they feel","post_message":"“But the problem is all these other countries hear these things, and all of a sudden you see in France that [Jean-Marie] Le Pen is going, ‘Bravo,'” Clooney added. “You get all of these nutcases on the far-right fringe saying, ‘Well, if America thinks that…’ That is the real problem with Trump—his ideas bleed into the rest of the world.”"},{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"1149825048400467","commenter_b":"Everybody is sick of her! She just needs to go away!!","commenter_a":"Fox and news should never be together! News is ok and fox is ok but fox and news makes no sense!","post_message":"Source: Fox is ‘Sick’ of Megyn Kelly; ‘Fox News Needs to Cut Her Loose’  @webpagelink"},{"comment_id":"10158325140525725","commenter_b":"Yea !! Thank god that I wouldn't waist my time on those losers !!","commenter_a":"If they gave them to me I wouldn't go !!","post_message":"Looking to get out of last-minute Christmas shopping or away from your in-laws? Then Saturday's Chicago Bears home finale could be your answer."},{"comment_id":"10154263187613984","commenter_b":"If Hillary were to win, she and Bill would never let Megan Kelly out of the White House!","commenter_a":"I think the Hildabeast has an eye for Megyn Kelly. Watch out Megyn, being too close to this one may lead to stupid. Be careful.","post_message":"During a recent interview, Hillary Clinton revealed her true thoughts about Megyn Kelly. No one expected what she was about to say..."},{"comment_id":"10153355238374411","commenter_b":"People who live in Palestine are Palestinians. People who live in Israel are Israelis. Most Israelis are immigrants.","commenter_a":"Israel may destroy the Gaza Strip but they will never destroy the Palestinian Spirt. Long Live Palestine!","post_message":"A new flotilla with humanitarian aid on board is going to help people in Gaza; the mission is beyond political polarization and in full compliance with international law, Osama Qashoo, member of the first flotilla to Gaza, told RT In The Now."}]
