[{"comment_id":"10152743176086545","commenter_b":"It actually doesn't take that long anymore for capital murder death sentences for them to be executed.","commenter_a":"To bad the state can't appeal for the death penalty versus life in prison","post_message":"\"I wasn't surprised by the verdict, just based on the overall tragedy of what happened. I was very disappointed that the jury reached a conclusion so fast. We were very kind of shocked by that,\" he said."},{"comment_id":"10153494156593352","commenter_b":"Good story. Bitch is a lying though. I don't know one woman that would've let that bullshit go down...","commenter_a":"Why was she so close to a canal going downhill with her kids? This is a sad story but seemed like she made some careless mistakes.","post_message":"Mother was fighting off a BEE when she let go of her twins’ stroller and they rolled into canal and drowned"},{"comment_id":"10153562923228132","commenter_b":"Please go up and down the beach and tell all of those women to put turtle necks on. I'm sick of seeing all of those boobs hanging out. And while we're at it, low cut shirts too. And tank tops (side boob). Stop being a hypocritical idiot.","commenter_a":"She could show a little modesty! Not everybody wants to see boobs hanging out! We used to be more modest, it's called showing a little class!","post_message":"\"I was really very hurt by this act, because I was in no way bothering him, so what gave him the right to shame me?\""},{"comment_id":"1033603779993966","commenter_b":"Please guys, read it again. \"The VIRUS'agrees that vaccines cause autism. Maybe vaccines cause stupism?","commenter_a":"Viruses are not to be trusted.","post_message":""},{"comment_id":"10152832059200927","commenter_b":"Only in PRC (People Republic of California)","commenter_a":"This guys also looking for a raise, he says he can't make it on $174,000 a year with free medical, vehicle, and perks. I think he needs to be deported.","post_message":"So the murder of an innocent woman by an illegal alien is little thing?  That's what this congressman thinks!"},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"10153475674267452","commenter_b":"Illegals for a living too.. And pay taxes and guess what they don't get a refund. Securing borders? Fix the immigration system it's hard becoming legal.. The system is he problem not the illegals..","commenter_a":"Congratulations on not being an illegal immigrant and working for a living. Trump is not against immigrants he and many other Americans are against ILLEGAL immigrants. Oh and your protest in Canada doesn't mean a thing in the USA.","post_message":"In protest of Donald Trump’s immigration policies, a construction worker hung a Mexican flag atop the Trump Tower in Vancouver, Canada. abc7.la/1W7pFVh  “While working on your tower, Mexicans didn't steal anything nor raped anyone. We just did the best work we could possibly do, for ourselves, our families and the future tenants in your building.”"}]
