[{"comment_id":"1283300368381949","commenter_b":"Sonny Omelis hmm what do you think?","commenter_a":"Jaouad Jijeli","post_message":"...leaving Paris and New York in its wake!!!"},{"comment_id":"10156504426675725","commenter_b":"Melania will be a wonderful First Lady and she'll bring class back to the White House!","commenter_a":"she'll be a 1000 time better than Michelle Antoinette Obama !!!","post_message":"My beautiful wife, Melania, shot in Trump Tower--- a great First Lady!"},{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"583963178430303","commenter_b":"Fucking slut","commenter_a":"I think it's actually kind of good. There's a silver lining in everything. She will now live in the free world and be faced with the reality that she ruined her life. Every second of every day. Being out will slap her harder than a cell ever could after being locked up for so long.","post_message":"Leslie Van Houten has been in prison for 46 years now."},{"comment_id":"10153189927841336","commenter_b":"Mike.... yes all ILLEGALS should be deported.... We have immigration laws which are not being followed... We have a system for people who want to become citizens so I do not support those who break the laws of this country and expect to reep the rewards of citizenship off the backs of the American taxpayer...","commenter_a":"ACLU is out of their minds... abortion is murder!!! illegals need to be deported PERIOD...","post_message":"“The Catholic Bishops are taking millions of dollars in federal grants and then imposing their beliefs on this vulnerable population… that raises serious concerns under the separation of church and state provision in our Constitution,” said an ACLU Nationwide attorney."},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"1144395032262257","commenter_b":"there you go with that section 8 typing again, you must have failed computer class terribly lmao","commenter_a":"All people Trippn over a nigga who didn't stand for the pledge of allegience. And y'all got Nazi's on the mo fucking police force. OPEN y'all damn eyes","post_message":"And the police union says it's no big deal 😠😠"}]
