[{"comment_id":"10153600578582042","commenter_b":"😂😂😂😂","commenter_a":"Then you need a toupee cause your hair Is hideous","post_message":"\"I don't wear a toupee. It's my hair, I swear,\" Donald J. Trump said."},{"comment_id":"1521903891446834","commenter_b":"Oei. Big mothafucka😕","commenter_a":"Oh ooh @username","post_message":"We could be about to witness something enormous."},{"comment_id":"634421746711040","commenter_b":"Yur all ignorant fucks","commenter_a":"Of course he's guilty, adults never have the right to release their anger on minors, no matter the situation!! Smh!!","post_message":"Horrifying footage shows a Texas police officer body-slamming a middle school student. #MicBrights"},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"1482883781727172","commenter_b":"Once the snowflakes find out the expense of their new revolution will cost them their Pot money....they will reconsider. But hey...the gun community is an inclusive bunch. This should be interesting to watch. They will be easy to spot wearing their skinny jeans with a big bulge printing for me to keep an eye on.","commenter_a":"These people give a new meaning to the word stupid!","post_message":"Unreal."},{"comment_id":"10156346724510725","commenter_b":"YOU ARE THE ANTI-CHRIST!!! SHAAAAAA lucifer!!!","commenter_a":"Thank you.","post_message":"THANK YOU for your support this evening Myrtle Beach, South Carolina! My family and I had a fabulous time with you this evening. Together we will #MakeAmericaGreatAgain!"},{"comment_id":"1014939015229294","commenter_b":"Then stop importing Muslims.","commenter_a":"Brought to you by liberal idiots like Billary and Obummer: @webpagelink","post_message":"All our prayers are with the people of France. We must stand side by side every step of the way with France and our allies around the world to wage and win the struggle against terrorism and violent extremism.   Even after this darkest night, Paris remains the City of Light. No terrorist attack will ever dim the spirit of the French people or our common commitment to the democratic values we share."}]
