[{"comment_id":"10153259374526350","commenter_b":"I just got off s cruise ship..I go on a cruise every year..The amount of people in and out of the water of those pools and all the adult drunks. Scares the hell out of me..I have a 7 year old granddaughter and she can swim..but it only takes 2 seconds for a drunk to jump on her w/o supervision. .Thank god my daughter watchers her like a hawk! THEY ONLY CARE ABOUT $$$ ITS TIME FOR LIFEGUARDS AND WATCH YOUR CHILD AS WELL!!!! And all Disney hotels have LIFEGUARDS! I live near them and we take our granddaughter Isabella to one every year for her Birthday!","commenter_a":"It is really no different than at a hotel. You don't have lifeguards at a hotel pool. There are signs posted that no lifeguards are on duty and parents need to watch their kids.","post_message":"There are as many as 1,000 employees aboard large cruise ships, but three major cruise lines employ no lifeguards on their ships. Why not?"},{"comment_id":"10153194384047217","commenter_b":"Helicopter looking for someone ?","commenter_a":"He's not the messiah - he's a very naughty boy.","post_message":"This mysterious bright light in the sky sent Californians into a panic 🌠"},{"comment_id":"1212505538766794","commenter_b":"Karma's a bitch.","commenter_a":"Well there goes this investigation out the window. An admitted ammosexual is heading This investigation. .","post_message":""},{"comment_id":"541791876011392","commenter_b":"Isnt it still a punishable offense in the eyes of the law if it is then the people who are doing this should be arrested and jailed and fined of course i meen after they get their ass's stomped .","commenter_a":"Needs a beating","post_message":"This liberal thought he could burn an American flag, big mistake.  That's what happens when you disrespect our flag. If you don't like it… LEAVE.  Do you support these patriotic students?"},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"\"This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!\""},{"comment_id":"10153585034949497","commenter_b":"Eh you know how the hot chicks are...","commenter_a":"Area Gisele fails to properly deflate Tom Brady's balls","post_message":"The NFL has debuted new rules pertaining to the quantity, air pressure, inspection, labeling, and monitoring of game-day balls"}]
