[{"comment_id":"881902655289442","commenter_b":"Something is wrong with this woman's reasoning. If the plumbing says you are a man, you are a man.","commenter_a":"Just more of Obummer bullshit, today I feel like woman ,today I feel boy, today I feel privilege so today ogle little girls. ,today I'm black or am I white, damn asswipe..","post_message":"According to the attorney general, laws cannot be made to define gender because individual feelings trump the law.  What if I feel like I already paid my taxes, even if I didn't. Do I still have to pay them?"},{"comment_id":"10155754872529778","commenter_b":"@username The more educated? Ooookay... Silly. Smh They're out there marching for you too. Remember that, girlfriend.","commenter_a":"@username Wow look at these comments. Even from women... Ignorant people... This country is in trouble.","post_message":"Ashley Judd says blood on your pants is a sign you're a woman. FULL SPEECH: @webpagelink MORE: @webpagelink"},{"comment_id":"873586192785317","commenter_b":"U feel sorry!!! Speak up your no better than them if u witness it and say nothing. Damn","commenter_a":"When I worked at the hospital in the lab..I can't tell you how many times I saw cops get unnecessarily rough with women ..women of any color. Not all but a lot..it actually made me start to feel sorry for their wives . If they do that on the job I hate to see what happens when they know they aren't being watched","post_message":"BRUTAL CONFRONTATION: Pennsylvania police officer charged after being caught on video appearing to punch a woman during a traffic stop: @webpagelink"},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"10156243420205389","commenter_b":"For what? So they can keep turning a blind eye to little boys & girls being raped every day over there? If we're not PROTECTING the innocent anymore, it's time to leave.","commenter_a":"I do not believe he is a Muslim, he is a puppet for the Muslim brotherhood without a doubt and he does hate America","post_message":"President Obama will extend the U.S. military’s stay in Afghanistan beyond the end of 2016, casting aside his promise to end the war on his watch."},{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""}]
