[{"comment_id":"10155604314476509","commenter_b":"I love it. Obama Obama Obama. Biden Biden Biden best Pres and Vice President ever","commenter_a":"At this point what difference does it make","post_message":"Biden: I'm not giving them the wifi password  Obama: Joe..."},{"comment_id":"10153058361321770","commenter_b":"She is a loser !","commenter_a":"I'm sorry Hillary just wasn't natural, it was forced. That being said the bill was funny.","post_message":"Hillary Clinton made a “spontaneous” campaign stop with an appearance on Saturday Night Live. She even mocks Donald J. Trump.  @webpagelink"},{"comment_id":"10154941890619705","commenter_b":"Yeesh and I feel bad for my soy chai latte. I can't drink milk so its soy but I still feel bad about a special order. Not anymore!","commenter_a":"Melissa Lane","post_message":"And you thought your Starbucks order was complicated."},{"comment_id":"10153455879676350","commenter_b":"Yeah a good dad would have married her","commenter_a":"Give it up. There are lots of dads out there that do the same","post_message":"\"In my stupid and exhausted brain, I thought only mothers should be that calm with a brand new baby, but it took only minutes of watching Carson with Jack and I knew...he was meant to do this.\"  Read Siri's sweet words about Carson Daly."},{"comment_id":"10154459292584138","commenter_b":"Right!!!","commenter_a":"What about bengizi, emails, her picks for judges, say goodbye to our Constitution, and gun rights, i could go on and on. Can anyone name 1 thing she has done positive for this country.....","post_message":"At CHS Field, people are casting their votes - with bobbleheads! People can \"vote\" and get a bobblehead of Donald Trump or Hillary Clinton at the door. The first bobblehead to run out wins the \"Bobblection.\""},{"comment_id":"10156102482195615","commenter_b":"State officials are supposed to be non-bias. If she can comply, she can find another occupation.","commenter_a":"You really don't have one KIM!!!!","post_message":"And here we finally have the truth, folks!"},{"comment_id":"10153123681123690","commenter_b":"Every hindu rapist must killed.","commenter_a":"well done israel.. every terrorist should be killed..","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"}]
