[{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"},{"comment_id":"10153221769812894","commenter_b":"Bitch u jealous","commenter_a":"I think this is wrong she was not a president she did some great things yeah but to change it from what it is is in my opinion just wrong see this is what's wrong with people they vote for stupid shit like this but don't vote for education or something we really need Gosh America where are your priorities????","post_message":"Harriet Tubman Wins Vote to Replace Andrew Jackson on the $20 Bill"},{"comment_id":"947408295386760","commenter_b":"Jill has sexy legs","commenter_a":"Commies","post_message":"\"For my brothers and sisters that supported Dear Brother Bernie Sanders - this is the next step. This is the Green step. It is the progressive step. It is to stay on the love train. Justice is what love looks like.\" -Dr. Cornel West"},{"comment_id":"10156745842795725","commenter_b":"This bitch still talking !!","commenter_a":"These rioters are obvious angry, violent, hateful, ignorant people, who can barely speak their own language. They don't like Thump. Chicago people are the Haters, who seem to hate everyone. They also don't like the 1st amendment, and think they are the only ones who have. They are in for a big surprise. Well, we don't live you either. What a bunch of lying hypocrites.","post_message":"Brawls break out at the Donald Trump rally after the Republican presidential candidate postpones his rally over safety concerns. Live coverage ----> @webpagelink"},{"comment_id":"1012961912156618","commenter_b":"I would give my share to put there asses on a boat and send the ass holes somewhere else","commenter_a":"Big mouth and no brains. This is what Obama has done for this country. What a disappointment.","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"1409042789109576","commenter_b":"@username no they didn't. Both were smart enough to use classified systems to access classified information...","commenter_a":"The problem is that his supporters are not intelligent enough to care about any of this. The one true thing he has said is that he could commit a murder in Times Square and his supporters will still support him. That's why he panders to the low intellect crowd.","post_message":"ALERT! Yet another corruption scandal threatens the whole Trump family."},{"comment_id":"10153644347998188","commenter_b":"Your opinion from your dreams Beck! It is a year before the election it is speculation at this point!","commenter_a":"I have been impressed with Carly for a few months and thought she did really well getting her points across, only wish she would be a little more warm and natural. She needs to be more likable. Rubio was outstanding with his knowledge of world affairs and ability to connect. Very presidential. Dump the Trump!","post_message":"Biggest winner: Carly Fiorina biggest Loser: Trump.  She looked presidential, serious, sharp, well informed, non establishment and tough.  Second place:  tie Rubio and Cruz  Close third: Carson (although because he is so different in volume, pace and style he may surprise me and others)  Biggest loser was so clearly Trump.  He is just not likable.  I just don't believe he is liked by tea party members.   I stood with them and looked into their eyes, is poke with them, marched with them and there is just nothing they have in common except being fed up.   If that is all he has, it is going to crater quickly.   He looked like a bully, sleazy and I just can't imagine good hearted, humble, faithful Americans falling for this arrogant anger much longer.   What average non political woman will connect with them?  Runner up for loser:  Bush.  He was rattled.  It is clear, he hates Donald trump.  While there were a couple of times I felt sorry for Bush. It didn't make me think he would be great if he were rattled by Putin or the mullahs.  This was a mortal wound for bush I think.  Also the big loser:  America.  It was so childish much of it.     #gopdebate #cnndebate"}]
