[{"comment_id":"10153018260001130","commenter_b":"Darin, what exactly, is a slut?","commenter_a":"abstinence based=teachs them nothing and then they get curious and then once curious they start having sex and when that happens boom teen pregnancies and after that begins the slut shaming when the only people who should really be blamed is the schools and parents for not being more educational","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"10154001679275927","commenter_b":"Every time she opens her mouth out comes more drivel!","commenter_a":"She owns a vineyard in California, I think she personally does all the wine tasting herself!","post_message":"WATCH-- President Clinton, as well as President Obama, we operating on a pay-as-you-go basis ...\""},{"comment_id":"10155094195189766","commenter_b":"F Germany! Let the Jihadis have that country! They deserve what they get!","commenter_a":"How pathetic.","post_message":"Here's a German parade with a float of President Trump raping a national icon then getting his head cut off by the same. Thanks, guys.  Credit: Instagram/aladine_saidi via Storyful"},{"comment_id":"10153186263669411","commenter_b":"And what happens when two monsters get together? another monster!!","commenter_a":"ha ha ha America is a father England is a mother isis is a child isreal is a nanny","post_message":""},{"comment_id":"1432409323458617","commenter_b":"@username and dodging sex with Trump is her game.","commenter_a":"So when the conservatives were freaking out about Michelle Obamas bare arms I don't recall them freaking out about Malaria laying naked on a fur or in bed with another woman. Were is your outrage now hypocrites. This woman doesn't have an ounce of class compared to the classy Michelle Obama.","post_message":"There's secret meaning in Melania Trump's style."},{"comment_id":"2180920135465808","commenter_b":"@username Where did you get that nonsense? She doesn't get a pension.","commenter_a":"Imagine if Michelle did this. They would say she doesn't love her country and she's disrespecting the The White House (as if that were a thing). Repugs are the biggest hypocrites ever","post_message":""}]
