[{"comment_id":"1616887248533493","commenter_b":"Give them what they want. Disband the police dept, transfer those officers to other agencies. Let the animals kill each other off. Problem solved.","commenter_a":"Bullshit","post_message":""},{"comment_id":"10152826928132061","commenter_b":"Happy Mother's day!!!! Smart women.","commenter_a":"I'm so glad that the person taking the order was ALERT!","post_message":"Woman held hostage with her children alerts police of hostage situation through Pizza Hut app. abcn.ws/1F5PzSV"},{"comment_id":"10154939556251320","commenter_b":"WE DON'T NEED, YET, ANOTHER ROSIE O'DONELL barking her bossy pants ignorance our way!!","commenter_a":"All the comments below ring as TRUTH, but tolerance and inclusion goes a LONG LONG way. Whether OR not you agree with ANYONE's lifestyle choices!","post_message":"Susan Olsen, who played Cindy Brady on  Brady Bunch has been fired from her job as a Los Angeles-based radio DJ after she posted a homophobic rant on Facebook."},{"comment_id":"10155199620894411","commenter_b":"Unlike in shithole Islamic countries pedophiles actually go to jail here, instead of marry them. Get dunked on bitch.","commenter_a":"Ah yes, Islam propaganda to tell women to embrace their own slavery & destruction.","post_message":"Protesters claim that the full-face veil is an instrument of women 'self-empowerment'"},{"comment_id":"10152755752215950","commenter_b":"White kids who grow in the same exact environment would most likely participate in these activities, just like black kids who grow up in the same environment as snotty white kids will most likely also be snotty kids. We're all a reflection of our environments, we do as we see we do as we are taught!","commenter_a":"This is a social problem not a race issue..","post_message":"Police say a large group of high school students swarmed a gas station and beat a man who was reportedly helping an older woman to her car."},{"comment_id":"10153058052287452","commenter_b":"Scum bags","commenter_a":"Trump be like \" bet they were Mexicans \"","post_message":"Gone in 90 seconds!   A burglary crew crashes an SUV right into a clothing store and dashes off with thousands of dollars in merchandise.  Not even steel security gates could stop this crew. Tonight, the hunt to catch the cunning crooks who knew exactly which designer threads to grab. Tonight at 11 from ABC7 Eyewitness News. abc7.la/1FenO5y"},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"}]
