[{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"},{"comment_id":"1303084943055048","commenter_b":"And I would make the vandal pay for it too!","commenter_a":"Looks better like this.","post_message":"Donald J. Trump just got hacked."},{"comment_id":"10154394005871337","commenter_b":"I love Salma Hayek's ass.","commenter_a":"i like the scene in wild wild west, where salma hayek shows her naked behind. nice butt.","post_message":"Will Smith is really, really sorry about Wild Wild West..."},{"comment_id":"10154628102671800","commenter_b":"@username You're saying bullying didn't work in 3rd grade so it won't work now, but most of Trump's campaign IS based on bullying and it's gotten him pretty far. And Trump has had multiple scandals of his own, including email scandals. It's also a known fact that every politician in history has had some sort of scandal in the course of their career.","commenter_a":"And according to James comey if you do what Hillary Clinton did you would be reprimanded, probably fired and have your clearance pulled if not have criminal charges like in the military, but you can still run for president. Oh the hypocrisy. Say bad things, shouldn't be able to be president, compromise national security and the lives of Americans, no problem.","post_message":"Billy Bush was suspended indefinitely from NBC following the leaked Trump tapes.  ►Full video: @webpagelink"},{"comment_id":"416369798522976","commenter_b":"Cheeko you ignorant slut. Stop acting like you know anything.","commenter_a":"Russia, get your shit together.","post_message":"Last year, fans of the Moscow CSKA team chanted racist slurs during a match against Manchester City. A year earlier, fans of Torpedo Moscow threw bananas at player Christopher Samba, who is from Congo, during a game against another rival Moscow team."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"610314089143994","commenter_b":"How embarrassing for all women! Their class level is as low as Trump's. Is there an emoji of a puking face?!","commenter_a":"LOL. I wouldn't count on them voting for Trump. I doubt they've ever been in a voting booth.","post_message":"People started freaking out when the hashtag #TrumpGirlsBreakTheInternet started trending Sunday night."}]
