[{"comment_id":"10154342648916509","commenter_b":"Shut up","commenter_a":"The decision to continue with fireworks in spite of huge fire at hotel nearby shows the sadist attitude of Arub nation.","post_message":"#NewYearsEve fireworks display continues in #Dubai as nearby hotel is engulfed in flames @webpagelink"},{"comment_id":"824116754360678","commenter_b":"Not one of them will be caught, and not one of them feels guilty.","commenter_a":"My gosh, where did these barbarians come from ??","post_message":"“When my son left, he had a broken basket and was hysterically crying,” one mom said."},{"comment_id":"483414185182495","commenter_b":"She has NO AUTHORITY!!!","commenter_a":"Who is she- he","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"950390221741940","commenter_b":"here comes people saying. \"no deport them all\" and stuff. and yet they forget who really made America. found by immigrants. the Irish had a very hard life back then, the hate saying this word, African Americans had a harsh life, people whats the difference between illegal immigrants and legal immigrants. a legal immigrant can be much more dangerous than an illegal. look what happen in 9/11. Boston bombing. ect. and how is it that an illegal can have a job, without knowing the English language. no American education?? the come here, and still believe that the American dream is still alivem but we Americans are the ones that destroyed it.","commenter_a":"THAT'S the way! No one is \"illegal\". We are ALL human beings and should treat one another accordingly.","post_message":"\"We need to take 11 million undocumented people out of the shadows, out of fear, and we need to provide them with legal protection,\" Sanders said."},{"comment_id":"496097670580813","commenter_b":"better yet, remove them from the planet","commenter_a":"Damn muslims.","post_message":"This Fox News reporter was absolutely disrespected by these Muslims.  They are out of control. If Muslims are going to live in our country they need to learn some manners.  Do you agree Muslims have to assimilate or get out?"},{"comment_id":"937660539681364","commenter_b":"He did not say the wall was to keep you or anybody else in...but to keep out Drug Dealers...I agree !!!","commenter_a":"What the hell? Now Trump want to build a wall both Mexico and Canada boarders. So the Americans are going to be imprisoned in his Presidency?? Dump Trump","post_message":"Drug dealers are pouring in from the southern border. We will build a wall on time and on budget. #GOPDebate"},{"comment_id":"10152888898915496","commenter_b":"But... But... Gay marriage is destroying straight marriage! @webpagelink","commenter_a":"Brenda. I believe that you are right in some of your thoughts. I don't delieve we should judge people. However we are definitely called to judge actions. In the case of same-sex marriage to support same-sex marraige is to supoort something that goes against the Bible's definition of marraige. Same-sex marraige is social, cultural, and traditional. Social, cultural and traditional acceptance will change with time but Biblical truth does not. Therefore I believe that we are to love everyone but support what is right in the eyes of the Lord.","post_message":"Brenda Wood 11Alive looks back at the fast-moving and historic events of last week in Monday's Last Word -- \"Same-sex marriage: Judgement Day.\"  More Last Words: @webpagelink"}]
