[{"comment_id":"10153821104831336","commenter_b":"@username sad indeed. Alana should shut her nasty mouth.","commenter_a":"I wish Obama would show the same respect for our troops. Oh my bad he puts illegal immigrants first before the fine men and women Who served our country.","post_message":"Today, Britain observed the annual Remembrance Day, a Commonwealth of Nations memorial day honoring armed forces who have died in the line of duty."},{"comment_id":"10154314323247174","commenter_b":"Lets don't and say we did.","commenter_a":"I wonder how their wives think about all this press about women in armor , arty, and infantry?","post_message":"Meet the Marine Corps' first-ever female field artillery officers."},{"comment_id":"10154427050921037","commenter_b":"Illegals do jobs that the \"Americans\" won't do!!! Besides I have never seen any white person working in the field picking your precious organic fruit and vegetables","commenter_a":"no not working and supporting their families in the states and the ones back home. here I thought they just come over and sit around doing nothing but taking naps and drinking beer. lmao this is a joke.","post_message":"The ~11 million unauthorized immigrants in America are not “taking” jobs from US citizens, either."},{"comment_id":"1062072083905575","commenter_b":"@username this is the saddest thing I have ever seen","commenter_a":"AND SOME OF TH AUDIENCE LAUGHED? Grrrrrrr!","post_message":"UPDATE: See the response from Caleb's dad and school, plus CALEB GIVES HIS LAST LINE! WATCH: @webpagelink  PREVIOUS: A 6-year-old boy with autism was brought to tears on stage when a teacher grabbed the microphone away from him when he was about to speak during his school's Thanksgiving play. Caleb was dressed as a turkey, and just wanted to say, \"gobble, gobble.\" STORY: @webpagelink"},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"10153531144626350","commenter_b":"I agree. God bless you Lil child.","commenter_a":"This is courage","post_message":"Looking good, Leah!"},{"comment_id":"1728663384083911","commenter_b":"They can stick it!!","commenter_a":"No, no, hell no! If if offends them, just stay away!!","post_message":"Liberals Want To Ban The Most Iconic 9/11 Picture From Museum.  There is no reason on earth why it should be banned.  Can we get 30,000 'LIKES' to keep this picture in the Museum?"}]
