[{"comment_id":"10154130394501545","commenter_b":"@username I think CNN is giving you false hopes. You might want to turn off the biased media.","commenter_a":"I love how \"news\" organizations report this as news. Headline should read \"Professor got lucky with one correct prediction, and hopes another will come true.\"","post_message":"A professor who has correctly predicted the outcome of every presidential election since 1984 has a new prediction..."},{"comment_id":"10153482997507550","commenter_b":"All illegals go back to where you came from. You are breaking the law. Get out.","commenter_a":"Arrest. Deport. Go back to Mexico and protest.","post_message":"View from #Chopper11HD of the #HB318 (immigration bill) protest in Raleigh abc11.tv/20e0DVL"},{"comment_id":"1208908179197618","commenter_b":"Who do any of these \"woman\" think they are? The show SUX Whoopie go eat another side of beef!!!!","commenter_a":"They are both empty headed idiots!","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down.  Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\"  @webpagelink"},{"comment_id":"10154374417982894","commenter_b":"Bitch u real life bitter","commenter_a":"Lol I hope someone run on stage and snatch that prosthetic belly off and expose her lying ass!!!!","post_message":"The Show Must Go On: Pregnant Beyoncé WILL Perform at Coachella...As of Now"},{"comment_id":"395322620592333","commenter_b":"People with food stamps eat better than average people. Not that junk food is better for you, but they get it all.","commenter_a":"thats the best to ever happen . but, it should include junk foods and sodas at the grocery store","post_message":"Could this Senator's proposal help bring an end to food stamp abuse?"},{"comment_id":"10153839661300950","commenter_b":"Hell NO! I won't vote for that woman!! She needs to be in prison!","commenter_a":"Don't believe Trump - don't believe Trump Campaign VOTE HILLARY VOTE TIM KAINE VOTE DEMOCRAT","post_message":"The Democratic nominee will tie Trump to the \"alt-right\" in a speech on Thursday."},{"comment_id":"424515887751925","commenter_b":"Kick her out if she won't wear the uniform","commenter_a":"Sorry sweetheart, you cannot honestly believe we who are proud of our Marines are going to consider your sensibilities against our men. Grow up.","post_message":"Liberal Chick has really lost it. Marines in uniform are now offensive? This is cuckoo for cocoa puffs."}]
