[{"comment_id":"10153548972367093","commenter_b":"LOL. Go back to California.","commenter_a":"This Texan will be voting ALL BLUE in November! Bigotry and hatred has to end! #voteTxBlue - you #GOP small minded idiots don't remember that Texas WAS a blue state for a long time! LBJ was a Democrat from Texas, and TX was a Blue state until 1994!","post_message":"With Trump as the Republican nominee, Clinton thinks a large turnout of minority voters could put Texas in play... @webpagelink"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"1846250902324669","commenter_b":"Don't pay pajama boy any mind! He'll be out of office in 30 days. Thank God! Then a real alpha male will show him how to run a country. Can't wait until the wuss is out of our White House and Trumps takes over.","commenter_a":"\"They don't produce anything that anybody wants to buy\", well, dear Americans, you are using Russian Soyuz space rocket to go into space, cause you just can't anymore.","post_message":"President Obama on Russia: \"They're a smaller country, they're a weaker country, they don't produce anything that anybody wants to buy.\""},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"10157089622540206","commenter_b":"White woman","commenter_a":"@username racism at it's finest","post_message":"“Because we aren’t whitewashed enough in Hollywood, apparently,” BET tweeted."},{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"}]
