[{"comment_id":"953133518031452","commenter_b":"Wow, county officials must be really threatened by gays getting married. We should tie them to chairs, and make them watch gay marriage ceremonies for weeks on end, to desensitize them.","commenter_a":"Go to the gulf and marry on a ship!","post_message":"They just cannot deal"},{"comment_id":"10154253853418967","commenter_b":"The only reason I stay on with these garbage gawker pages is to see the awesome Hogan memes.","commenter_a":"One Hulkamania isn't enough, Gawk ?","post_message":"The absurdity of Charles Harder threats should not distract from the underlying mission of the man who pays him: To intimidate Gawker and its reporters from publishing true things about public figures."},{"comment_id":"562653790568588","commenter_b":"That's bad...right :-) Bernie is a moron, a pandering moron.","commenter_a":"idiots topped with lie pudding","post_message":"No, this wasn't Saturday Night Live. Bernie Sanders actually said this in a real debate..."},{"comment_id":"10152956045287093","commenter_b":"Don't leave the drawers open","commenter_a":"@username pretty sure this is my dresser lol","post_message":"RECALL ~ IKEA is recalling 27 million adult & children’s dressers because of a tipping hazard…2 toddlers were killed when their dressers tipped over on them… @webpagelink"},{"comment_id":"1210989268913328","commenter_b":"Impeach this !!!!!!! Donkey Dicks ! Vote Trump","commenter_a":"How can you Impeach Trump??? He's not even President!!! Impeach the one in there now!! What the heck is the matter with people now a days??!! No common sense, want everything free, think they are entitled, scream racism at everything, destroy property with no remorse, get mad and just shoot people, not responsible for anything they do wrong, always due to their past or otherwise, no morals................ect..........And now talk of impeaching someone who isn't even President!!! America stand up and be counted for what is real, true, moral and right!! All Whiners can leave!!! Of course just my opinion! I know all will not agree, but \"Freedom of Speech!! My country, my Right!!","post_message":"Donald Trump doesn't have the GOP nomination and he hasn't been elected yet. But that is not stopping the effort to have him impeached the moment he might be sworn in as president"},{"comment_id":"1066337003492628","commenter_b":"The woman is delusional.","commenter_a":"That is exactly what they are afraid of, that he will do something that never could do or would do. They just want to keep the people dependent on the government and not be able to stand on there own two feet?","post_message":"Hypocrisy, thy name is \"Democrat.\""},{"comment_id":"1367266676644002","commenter_b":"Why do you think we have any right to tell another country anything?","commenter_a":"Why afford them any opportunity to keep growing their attempts for long range missiles?","post_message":"North Korea continues their aggression."}]
