[{"comment_id":"10153479859171337","commenter_b":"Shut up hoe","commenter_a":"Love him. And you know what HE DONT GIVE A SHIT!!!! He tells it like it is. Everybody put your big boy or girl pants on and DEAL WITH IT!","post_message":"WHOOPS: Donald J. Trump made some inflammatory comments about Mexican-Americans, and they're coming back to haunt him..."},{"comment_id":"10153563067675667","commenter_b":"@username Americans are seeing the true colors of Democrats. Most are trash that don't pay taxes. They live off the taxpayers!! They riot. They block traffic. They destroy property. They commit the majority of crimes.","commenter_a":"Democratic TRASH. The party of thugs, Illegals and criminals. The trash of America. The more you riot. The more we want Trump 2016!!!","post_message":"At least 35 Trump protesters were arrested in San Diego. @webpagelink"},{"comment_id":"10153513195292439","commenter_b":"Too bad for the Muslims that look at a natural act of breast feeding as obscene. They can cut off heads and introduce their babies to horrific killings and slaughter and raise their kids as killers. That is what is obscene.","commenter_a":"Muslim women do NOT have tits.","post_message":"@webpagelink"},{"comment_id":"899714753418554","commenter_b":"If we sent the illegals home wages would go up. It is called supply and demand. What are our collages and universities teaching these days?","commenter_a":"That's about half a million jobs for our citizens if we sent them home.","post_message":"Wow."},{"comment_id":"588768351310241","commenter_b":"Put her in Jail !! I didn't ok that she can walk","commenter_a":"This is all Barry!","post_message":"Judicial Watch President Tom Fitton is LIVE discussing major court developments in our Clinton email case and Obama travel uses.  Tune in for the Weekly Update below."},{"comment_id":"955678404472632","commenter_b":"Hey Christie, are your kids vaccinated? FOOL!","commenter_a":"Sooo, Chris believes that parents should have a Choice...wonder how far that goes beyond vaccination...","post_message":"Gov. Christie: “Not every vaccine is created equal, and not every disease type is as great a public health threat as others.”"},{"comment_id":"1021161244667320","commenter_b":"Thank you Sir for your service. You inspire - Me - to be a better person.","commenter_a":"How very inspiring to Americans!","post_message":"'God Kept Me Alive for a Reason'  Can we get 5,000 'LIKES' and 'SHARES' for this HERO?'  @webpagelink"}]
