[{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"1104014366324977","commenter_b":"How is that racist lol Muslims are a ravery of people haha and no makes them follow a old book written by a peodphie that married a 9 year old girl","commenter_a":"Hey! Don't forget that ISIS are not \"real\" muslims. And it is just a coincidence that 100% of those who join or support are muslims. This has NOTHING to do with islam. And it is only 8% of the entire population of Turkey who supports ISIS. (according to a recent Pew Research poll) But don't worry about it, they are not \"real\" muslims either. Anyone who says that the world has a problem with islam is just a racist. We all know that islam is a religion of peace. Case closed.","post_message":"EXCLUSIVE"},{"comment_id":"540250699432857","commenter_b":"Really? ?? So does that go both ways, women cant be trusted watching kids that arent theirs I? ?? Your blanket statement, is kinda bullshit","commenter_a":"Some people treat their animals better than they treat their children. Why not take the baby with you? Never trust boyfriends with your kids.","post_message":"A woman and her friend wanted to run to the store, so she asked her boyfriend to watch her friend's kids for a little while. The women returned about a half hour later to find the man had done something horrific."},{"comment_id":"1388872451170702","commenter_b":"And, non-public schools do not have to allow a student to attend their school so not everyone will the right to 'opt out' .","commenter_a":"Deeply qualified, unlike the Secretary of Education you are choosing to support despite the strong opposition from your constituents.","post_message":"Yesterday, I spoke on the Senate floor to support Judge Neil Gorsuch’s nomination to serve as an Associate Justice on the U.S. Supreme Court. Judge Gorsuch is deeply qualified and consistently demonstrates his commitment to upholding the rule of law and interpreting the Constitution as its authors intended."},{"comment_id":"10153551927158352","commenter_b":"Kill this bitch","commenter_a":"An eye for an eye!!! Babies are innocent little gifts from God!!!!! There are no excuses!! I have no pity for her!!! She will answer for it!!!!","post_message":"Woman, 22, gave birth in tub in secret then dumped her baby in trash compactor – and was only caught because nosy janitor opened suspicious box"},{"comment_id":"1243385125672214","commenter_b":"@username ill kill you","commenter_a":"@username @username Jane Ní Chonchubhair Gala Ní Mhuireagáin boop","post_message":"BOOP"},{"comment_id":"863004940415197","commenter_b":"Throw her in jail","commenter_a":"Take her down!","post_message":"\"Perfect\" was the response Lerner used about the non-archived messaging system."}]
