[{"comment_id":"10156419008515725","commenter_b":"#VoteTrump #TheDonald #ArrestObama #TrumpTrueAmerican #TheTrumpArmy #TrumpNow #MakeAmericaGreatAgain #TrumpFan #TrumpTrainSNL #TrumpForPresident #CompetentTrump #ItsGonnaBeYuge #NoRefugees #GetOnBoardTheTrumpTrain #BuildTheWall #TakeAmericaBack #Trump #OurVeteransMatter #WomenForTrump #TrumpNation #GeorgiaForTrump #CitizensForTrump #TrumpBreathOfFreshAir #MerryChristmasPresidentTrump #LoveTheDonaldsTone #BalancedBudget #TermLimitsForCongressAndSenators #GodBlessDonaldJTrump #GodBlessAmerica","commenter_a":"Americans are sick and tired of being on the back burner . We are the American people who work and should have a voice . We need a President whos gonna have our backs and Trump your it .","post_message":"People like what I say, people respect what I say. I started a discussion that needed to happen. #GOPDebate"},{"comment_id":"10153762472156337","commenter_b":"Id smash her tuppence!!!","commenter_a":"Whatev","post_message":"HOW MUCH???"},{"comment_id":"10153531348054740","commenter_b":"I agree you shouldnt have to justify.","commenter_a":"It is sad that so many don't know the difference between real life and tv.....","post_message":"Here's why cops don't 'shoot to injure':"},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"539331949590718","commenter_b":"Amen @username! That's right, get out of our Country!","commenter_a":"No","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10154397725896509","commenter_b":"She should teach her son how to respect women","commenter_a":"Cold Autumnbreeze","post_message":"Sarah Palin speaking at a Donald J. Trump event: \"We need to elect a commander in chief who will respect our troops... you realize that our vets deserve a commander in chief who will let them do their job and go kick ISIS ass.\" @webpagelink"},{"comment_id":"1863352450575527","commenter_b":"She's a nasty which!!! I really felt sorry for Joy she was totally rude to her and had the look of revenge in her eyes toward Joy she should be ashame!!!!=","commenter_a":"Omarosa achieved \"fame\" by being nasty. She is perfect for Trump. She was a disgrace with her last comment to Joy. She literally gave me the chills. I was concerned about Joy's health (and mine) - Omarosa was so vile and consistently lied. She (along with Trump and his Trumpettes) could give good, caring people a stroke!","post_message":"It wasn't pretty."}]
