[{"comment_id":"937882449580510","commenter_b":"Can't stand her","commenter_a":"No no! Remember the first amendment? She was and is free to ask anything of anybody. Man up everyone. Hopefully this will stay a free country.","post_message":"Uh oh..."},{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"10153545151956336","commenter_b":"Megyn deserved the beating from Trump. She's an uppity bleach blonde.","commenter_a":"Tonight Fox sucks","post_message":"“I think the big problem this country has is being politically correct. I don’t, frankly, have time for total political correctness.”    Donald J. Trump responds to Megyn Kelly after she asked him, “How will you answer the charge from Hillary Clinton…that you are part of the war on women?”"},{"comment_id":"1781647542076913","commenter_b":"I know that's Ivanka on the right, who's that chick on the left side?","commenter_a":"We need a food addict intervention for Mr. Moore. A good barber, too.","post_message":"Michael Moore is a ____________."},{"comment_id":"10153680783882439","commenter_b":"AMERICA NEEDS TO DEPORT \"EACH AND EVERY MUSLIM\" THAT IS HERE TO HARM ANY PERSON!! AMERICANS DON\"T WANT THEM HERE!!","commenter_a":"Obama thinks a job will stop these brutes from their evil ways.","post_message":"The devout Muslim began making threats praying to Allah and saying he was going to set off a bomb — “he’s still threatening to kill anyone who isn’t a member of Islam or Muslim.” He’s an Iranian national here on a work visa. Deport him  – now."},{"comment_id":"10153717683207894","commenter_b":"@username Nobody's voting for Hillary? Why does she have 3 million more votes than Bernie??? I'll wait","commenter_a":"I don't know why people spew unnecessary hate for this woman, She has millions more votes than Bernie and is the better between her and Trump. What did she do so bad to you all? Bernie Sanders got yall head messed up. And that whole Bernie or bust thing is IGNORANT as hell. Writing in Bernie Sanders name is basically a vote for trump, smh","post_message":"Hillary Clinton Reaches Delegate Count, IS the Presumptive Democractic Nominee for President"},{"comment_id":"913019148787853","commenter_b":"She's literally the dumbest woman on earth.","commenter_a":"@username @username is there anything in this world that doesn't offend people? Lol good lord","post_message":"\"Star Wars\" fact-checkers quickly took to social media to point out several holes in Harris-Perry's theory."}]
