[{"comment_id":"838447029619520","commenter_b":"Why is that ugly cat so moist.","commenter_a":"Brittany Gallo","post_message":"WATCH: Obi the baby pygmy hippo has splashed into the water with his mother for the first time in front of viewers at the Melbourne Zoo in Australia."},{"comment_id":"1741880082723097","commenter_b":"If you have any red blood running through your veins,If you LOVE THE USA BOYCOTT ALL,I MEAN ALL DISNEY PRODUCTS,PROPERTIES,MOVIES,ALL!! LET THEM SEE WHAT 'WE THE PEOPLE' ARE CAPABLE OF DOING!!!","commenter_a":"Are you kidding me? Trump Hires illegals. He was fined for doing so. Check your facts people.","post_message":"A Disney IT worker who was laid off and replaced by foreign H-1b workers along with hundreds of his colleagues broke down in tears before a Senate panel Thursday while telling his story."},{"comment_id":"10154136814559411","commenter_b":"@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"},{"comment_id":"10152759564322217","commenter_b":"Poor People :(","commenter_a":"May the victims be comforted by those of all faiths and races. A rare opportunity to share love","post_message":"More than 1,000 people have been killed in the Nepal earthquake. @webpagelink   * Deaths in Nepal, India, Bangladesh & Tibet  * Avalanche in Everest kills 8 * Centuries-old temples flattened"},{"comment_id":"997888900251582","commenter_b":"this lady is crazzy.","commenter_a":"The Amerikan Taliban.","post_message":"Hey you! You should go to church every Sunday! And the government should require it. Because America and morals and stuff."},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"793441997371016","commenter_b":"If they don't want to be detained. The scum should not steal. We pay for that! We need to get tougher on criminals","commenter_a":"Don't break the LAW!!! Then resist as well! Quit sticking up for criminals. This lady is an idiot to begin with don't do the crime. Choices... Make the right ones or like anyone else suffer the consequences from your choices. Maybe crime will go down if we actually don't try to protect the criminals and support our police forces. Remember enforcing the Law is for our safety. So for all you law breakers don't break the law if you don't want to take the risk of suffering the consequences.","post_message":"RAW VIDEO: A shopper claims she caught security guards at a Chandler Walmart putting a suspected shoplifter in a chokehold.  She took the video below on her cell phone. You can hear the woman shouting \"I can't breathe. I can't breathe.\" She then appears to be passed out on the ground.   Do you think security was too rough, or just doing their job?  FULL STORY: @webpagelink"}]
