[{"comment_id":"1207325982676961","commenter_b":"Epic smackdown","commenter_a":"Loved it. She asked for it.","post_message":"WHOA!!!!! Gingrich went nuclear on the Kelly File and sends social media into a frenzy!"},{"comment_id":"1069254933097554","commenter_b":"So who fixed the boat?","commenter_a":"I don't like this picture","post_message":"That's a heck of a thing to say!  Especially with servicemen captured."},{"comment_id":"10155064838244497","commenter_b":"Cankles, in Hillary's case","commenter_a":"Mike Pence is worried that those shameless hussies will show a flash of their ankles during the march.","post_message":"\"I can tell you how let down I feel by the heads of these households who did not simply give their wives and daughters a firm, decisive  when they asked to participate in today demonstration.\""},{"comment_id":"10152869817141130","commenter_b":"Sounds like you're a bitch who can't take a compliment.","commenter_a":"Maybe because when men try to pick me up it goes like this: Them: \"Hi, gorgeous.\" Me: \"F*ck off.\"","post_message":"\"It's not that I'm opposed to meeting someone. I just don't feel it's necessary.\""},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"10155094370524329","commenter_b":"That is why we need physical borders to cut down on illegals crossing the borders.","commenter_a":"I waited in line for 2 years in South Africa to immigrate legally to join my husband. Why is it acceptable for anyone to enter the US illegally just because they have a geographical advantage?","post_message":"Dr. Sebastian Gorka: “When you go to bed at night do you lock the front door?”  Sean Hannity: “Yeah, and then I put my gun next to my bed and I go to sleep.”  Dr. Gorka: “If you do that, then surely the border is our front door. Surely we should have a control as to who enters our house. This is the House of America.”"},{"comment_id":"924673837566701","commenter_b":"I meant divided we fall","commenter_a":"At least learn how to spell 'Missile' Then you can be an educated bigot!","post_message":"I have joined with a bipartisan group of 16 senators to introduce legislation that would impose economic pressure on Iran if international negotiations do not yield a final nuclear deal by June 30, 2015. This is the most important foreign policy issue facing our country. A nuclear Iran will threaten the security and safety of the United States and send a message of weakness to our allies and partners in the Middle East. This legislation is an important signal to Iran and the entire international community that the current negotiations are not endless and the Iranians cannot continue their dangerous nuclear activities."}]
