[{"comment_id":"10155153286483258","commenter_b":"But it's nothing like taking public funds for your business, and then having offshore tax havens, while your skimming operations know no bounds.","commenter_a":"No. It's not at all like taking a great Chagall or Picasso or anything remotely close #boybye","post_message":"“It’s like taking a great Chagall or Picasso or something,” New England Patriots owner Robert Kraft said. “You can never display it.”"},{"comment_id":"10153266860506167","commenter_b":"No, there is something very seriously wrong with the people who think he could run the country and vote for him","commenter_a":"There is something seriously wrong with Carson.","post_message":"A CNN host shuts down Ben Carson's complaints about the media: \"Journalists ask questions. That's the process. And if you don't like journalism, we should talk about that with presidential candidates.\""},{"comment_id":"891291447630577","commenter_b":"Turn the channel from Fox and get educated","commenter_a":"How anyone can back him after everything going on is beyond ignorant!!!! There r reasons he's the worst president ever!!!","post_message":"This one is HILARIOUS.   Thanks to Being Liberal."},{"comment_id":"10154492398684199","commenter_b":"Wolves are not endangered.They kill livestock.","commenter_a":"Holly","post_message":"A federal judge in Tacoma has rejected plans to increase the killing of wolves in Washington state by a federal agency."},{"comment_id":"1193499157336779","commenter_b":"Poor people. Blessed to live but with these memories. Prayers","commenter_a":"Very sad! I can't imagine the horror! God bless you always!","post_message":"\"We were just about to say the prayer to be released,\" said Felecia Sanders, one of three people who survived when a gunman opened fire during Bible study at her Charleston church on June 17."},{"comment_id":"10158609012850725","commenter_b":"What an ignorant old hag smfh","commenter_a":"Time to round up all the black scum and jail them all. If found having done a crime they get death. The faster we get rid if those in jail too by death the better it is. They all are scum and should all be destroyed.","post_message":"A suspect has been charged with the murder of Karina Vetrano, whose gruesome death shocked the community and set off a six month search for her killer."},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."}]
