[{"comment_id":"10153767217919497","commenter_b":"Let's really make a team effort to versnitchinize the fizemignots.","commenter_a":"Area intern tells employer \"I'm more into first person shooters, than platforming\" is fired on the spot","post_message":"The buzzword has yet to be expounded on or put in context by anyone at the company."},{"comment_id":"10154310515973822","commenter_b":"she clearly states on her wbsite that money not used will go o her pay for future campaign #JillSteinScam","commenter_a":"What's Jill gonna do with all that cash? No refunds, no exchanges, all donations final.","post_message":"JUST IN: The Green Party is dropping its court case seeking a recount of Pennsylvania's Nov. 8 presidential election."},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"864444063671976","commenter_b":"Super gross. I can't stand that feeling how some women think it's sexy is beyond me.","commenter_a":"Gross","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10156057396095551","commenter_b":"Everybody knew that! No way does a great 5 yr old know anything about imigration. This was a liberal setup!","commenter_a":"The Mexicans played a dirty trick on On the Pope. Perhaps they will be rewarded in hell.","post_message":"I KNEW there was something fishy about this..."},{"comment_id":"704776766379568","commenter_b":"Yes deport them","commenter_a":"Only if it's to hell. I would never let her lose on another","post_message":"Controversial photo of Michelle Obama has many calling for deportation.  She doesn't deserve to be our First lady.  Would you vote to have Michelle Obama deported?"},{"comment_id":"10154058218236770","commenter_b":"Procecute this women she just as dishonest as Hillary","commenter_a":"Obama tossed her under the bus. So much for loyalty.","post_message":"Attorney General Loretta Lynch is defending the FBI against allegations that the bureau mishandled investigations of email hacks of Democrats and focused too much attention on Hillary Clinton’s private email server."}]
