[{"comment_id":"1037048666341760","commenter_b":"Cherokee Hinrichs quickly and painlessly?? Maybe for the one having the abortion, but the living baby that's being killed feels it!! Your another disqusing excuse for a woman!! Be ready for your judgement day, God will sent you straight to hell along with all the other disgusting women who kill babies!!","commenter_a":"Stop the madness. Repeal Roe v Wade. It is a choice. Choose life.","post_message":"Real doctors protect the Sanctity of Human Life!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb179"},{"comment_id":"1250738951649087","commenter_b":"Only women to ever get you to take your bandana off","commenter_a":"@username when meg would come help you","post_message":"Oh boy!  #WSHH"},{"comment_id":"902522343195539","commenter_b":"Smart pooch 😂😂😂","commenter_a":"Krissy Maree","post_message":"This Great Dane's having a Great Time on a trampoline.  Video: Jukin Media"},{"comment_id":"10152581007932894","commenter_b":"She too old to want that hoe bag to be her damn role model.. Smh lol","commenter_a":"^^^^ Shes your Role Model???? Sis....","post_message":"Mag Swag: Kim Kardashian & Her Bleached Eyebrows Cover LOVE Magazine [Photo]"},{"comment_id":"10154013859753812","commenter_b":"Well let's work and try to keep dump people from getting guns.","commenter_a":"you would be smart Mr President to work on peoples parenting NOT GUN CONTROL, guns dont kill dumb people do","post_message":"President Obama plans to sit down with Attorney General Loretta Lynch after returning from his Hawaiian vacation to discuss gun control options. @webpagelink"},{"comment_id":"10153366543351051","commenter_b":"why not Thugs Lives matter ... break the law assult others and what happens ??? Blacks Kill more of themselfs than any other ...... My mother taught me to dress for success not emulate Prison population booty call ...","commenter_a":"Racist idiot","post_message":"Here's why President Obama says many people misunderstand what the #BlackLivesMatter movement is truly about. Do you agree or disagree with the president's message?"},{"comment_id":"10154991280103812","commenter_b":"Make America Hate Again","commenter_a":"Hopefully trumps followers do not take this the wrong way and try to overturn the world if he looses.... smh","post_message":"In final campaign stop before Election Day, Donald J. Trump calls on working class to 'strike back.' \"Today is our Independence Day.\" @webpagelink"}]
