[{"comment_id":"362582817419205","commenter_b":"They are terrified because of the media's misinformation. They blow the slightest remark out of proportion. He wants to expand on a wall that's already there. And the country has been deporting illegals the whole damn time. LGBT will continue to have their rights. And the so called race war is fueled by the media. Look at a person's character not at their skin.","commenter_a":"He should quit whining and moaning. I can assist him get residency in Madagascar within 15 minutes.","post_message":"Van Jones responds to the anti-Donald J. Trump protests: “We have to hear the pain.”"},{"comment_id":"10153613146758812","commenter_b":"I am Latino and I vote.....however I am against these liberals and the way they are destroying this country I am against illegal immigration it hurts this country especially on the local level these people get benefits like food stamps welfare....this is not acceptable for you to come into the country illegally and ride tax payers backs....","commenter_a":"Trump all the way..pitbull","post_message":"The rapper called Donald Trump out at Premios Juventad, the Spanish-language awards show that aired Thursday on Univision: abcn.ws/1KcBbra"},{"comment_id":"1613037799000233","commenter_b":"Thanks to Trump! He has successfully stirred up America. I'm still with Hillary Clinton!","commenter_a":"Ever since the election, the real closet racists have come out..","post_message":"A teacher shouted the N-word in the middle of class, stunning her eighth grade students. The video has millions of views and the teacher has since been fired. @webpagelink"},{"comment_id":"847928802003105","commenter_b":"I am not Impressed with a government that steals elections so they can choose the president.","commenter_a":"This will give Rise to the Libertarian party who is right now starting to gain traction The GOP thought they had issues with @username...they wont be able to control a Libertarian Party candidate The establishment is destroying their 1 party 2 party system .... Thank you @username even if you get screwed out of the nomination you have accelerated the cause of freedom and liberty","post_message":"This is happening all over our country—great people being disenfranchised by politicians. Republican party is in trouble!"},{"comment_id":"449908955134145","commenter_b":"Can't answer the question, Joey?","commenter_a":"This is absolute overkill. I get we should police the police but come on. You're going out of your way to stop an officer from doing his job","post_message":"This baby faced cop looks fresh out of the academy and willing to follow any order he is given. Luckily this veteran government accountability activist planted some seeds in his mind about who he is actually working for and how liberty is a better solution.  Watch the epic schooling RANT: @webpagelink"},{"comment_id":"511047909019803","commenter_b":"Throw that racist bitch out the door!","commenter_a":"BLM, Black Panthers, Farrakhan -- any of those available? Why would you not use them since you hold them in high esteem?","post_message":"Beyonce bashed cops at the Super Bowl but is now asking for their help. They want her to find a way to protect herself."},{"comment_id":"10153826127084024","commenter_b":"funny how she started all of it and then plays the victim","commenter_a":"With a native name like NO ONE WANTS TO POKE HER TUNA.","post_message":"It’s the latest in a series of Internet “tweetstorms” calling Trump on the carpet for his treatment of women and his insults toward her."}]
