[{"comment_id":"10153208792316336","commenter_b":"Fire her immediately!!! Quit pussy footing around with her!!!!","commenter_a":"And if you believe her I imagine you will be voting for Hillary too. Corruption is alive and well.","post_message":"\"You have to understand, it's not holding back. It's responding appropriately.\"  Baltimore Mayor Stephanie Rawlings-Blake told Fox News' Bill Hemmer she did not give an order for police to hold back as riots broke out Monday night. @webpagelink"},{"comment_id":"458714004327362","commenter_b":"Whinny assed little bitch is what he is","commenter_a":"Lies or on all sides. It is politics and hard to see who really is lying. Media is a manipulator.","post_message":"These are some heavy-duty tweets..."},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: \"This is a bunch of scumbags. That's what they are, who are all organized around making money.\" @webpagelink"},{"comment_id":"445168402354286","commenter_b":"Folks are worried about our second ammendment. How about change and uphold immigration laws. For starters vette K1 Visas correctly. Frankly, the current laws aren't upheld now by the lawless folks in our country and government.","commenter_a":"I believe K-1 is a Fiance Visa, wherein the couple must marry within 3 months.","post_message":"***BREAKING***  Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport.  DEVELOPING..."},{"comment_id":"10153759258966694","commenter_b":"Do not compare this to GOT...or dr who....or any other shit please...","commenter_a":"Oh, gee, you don't really mean it's going to make my brain explode, do you? Like The Walking Dead was supposed to make my BRAIN EXPLODE, and Game of Thrones was supposed to make my BRAIN EXPLODE, and Dr. Who was supposed to make my BRAIN EXPLODE...Seriously, how much did Raimi and Co. pay you guys to headline Ash vs. Evil Dead as an exploding-brain event? Because, you know what? Every time @username claims some stupid TV show will \"explode your brain,\" viewers barely end up with a BRAIN TWINGE. So instead of over-hyped praise, why don't you guys try something different? Something along the lines of: \"WE SAT THROUGH THE FIRST EPISODE OF ASH VS. EVIL DEAD AND WE DIDN'T GET CRAMPS IN OUR ASS.\" In short, Lower Expectations = More Pleasurable Viewing Experience. You're welcome!","post_message":"Ash vs Evil Dead is going to make your brain explode in the best way"}]
