[{"comment_id":"971423549572732","commenter_b":"Girl, is there any other?","commenter_a":"Dukes!!","post_message":"FOLLOW UP: We asked this morning about whether you like banana and mayonnaise sandwiches….if you say YUM, what mayo are you using?"},{"comment_id":"1323559051002906","commenter_b":"YOU CAN'T TAKE OUR RELIGION AWAY FROM US.","commenter_a":"Keep it. Just don't use it when class is in session.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"1184451798317737","commenter_b":"Foolish, foolish woman.","commenter_a":"SHE IS INSANE TO WANT DONALD TRUMP! I HOPE SHE KNOWS THAT SHE AND ALL THE REST WILL BE THROWN OUT ON THEIR HEADS!!! CAN NOT BELIEVE THIS!!!","post_message":"Saba Ahmed is trying to convince other Muslims to support Donald J. Trump."},{"comment_id":"10155405289876729","commenter_b":"@username I can respect that and pretty much agree.","commenter_a":"Anyone that takes the time to read this case will side with Ventura. Kyle bandwagon jumpers will say Chris Kyle was incapable of any wrong like Jesus. He made a mistake and his insurance was there for this very reason. In short, Chris Kyle should of never made up that story in the first place. I am disappointed with you @username.","post_message":"Finally."},{"comment_id":"389899691198325","commenter_b":"No comment !!! But she better Pray that Her President doesn\"t get away with his Immigration Laws ??","commenter_a":"Get a JOB!!!!","post_message":"Another welfare queen...:/"},{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"1729831163913652","commenter_b":"According to her, if you don't vote for her, your a Sexist.","commenter_a":"If youre thinking of voting because shes a woman Please dont vote at all This is about the future of the U.S And this *woman* Cares nothing for equality women Nor blacks... Nor anyone but her corporate buddies","post_message":"Hillary Clinton told a colorful story in Reno that ended with the former secretary of state barking like a dog to slam Republicans ... @webpagelink"}]
