[{"comment_id":"1361247917304790","commenter_b":"She is a criminal","commenter_a":"His decision to not pursue this is a good thing in my opinion. He won the presidency, why continue to invest energy in Hillary Clinton? She should be irrelevant to him now.","post_message":"Donald J. Trump promised to prosecute Hillary Clinton for her use of a private server if he won the presidency. Now that he has been elected, it seems he has changed his mind."},{"comment_id":"868568856511870","commenter_b":"Chuck is right!","commenter_a":"You go Chuck.","post_message":"Chuck Norris puts Hillary to shame!  His liberal fans will hate what he said about her candidacy! But you'll love it!"},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"10154266616104714","commenter_b":"@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"\"Inclusivity is a core belief at Target\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"10152781653123717","commenter_b":"That girl needs some help!","commenter_a":"wtf is that on the bottom left?","post_message":"Manchester police say an investigation into prostitution in the Queen City led to the arrest of six people. @webpagelink"},{"comment_id":"10153498985924032","commenter_b":"Did these girls post this photo, or did it get posted by the prankster that took the photo?","commenter_a":"Expelled? Yeah, because interrupting what is obviously NEEDED education is the answer here... Maybe they should sue Snapchat as well, because this wouldn't have gotten the attention it did if they hadn't posted it on the app. *insert eye roll here*","post_message":"The petition was started by change.org and already has more than 39,000 signatures."}]
