[{"comment_id":"10152946649009641","commenter_b":"While I despise Islam I don't hate Muslims.. At all! It's not their fault if they're born in it. But I agree with letting no more immigrants into west! None!!","commenter_a":"allTerrorists should be killed to make the world better","post_message":"Gunfire echoes from two police raids ending terror sieges around Paris. One witness says: \"It's like a war.\" Another describes how a suspect told him: \"Go, we don't kill civilians.\" @webpagelink"},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"10154311715577293","commenter_b":"DUMP IS A BULLY BUT ONCE HE IS CHALLENGED, HE CAVES. REMEMBER HOW MEXICO WAS GOING TO PAY FOR THE WALL?","commenter_a":"I worry about it probably in a southern state. sTrump supporters have suspended all logic and common sense. I am sure that professionals in the mental health field can talk about group hysteria. sTrump is already stirring the pot in an effort to incite his supporters. They've already suspended logic so I expect that some will act. Look at sTrump rallies...","post_message":"Half of likely voters fear violence either on Election Day or after."},{"comment_id":"889054771211302","commenter_b":"It doesn't happen to muslim women because they are all fugly uckers..","commenter_a":"Go fuck yourselves, dune coon","post_message":"ClashDaily.com"},{"comment_id":"1006176036165841","commenter_b":"Just why is this bitch here ??","commenter_a":"You're right. I didn't see anything about this on the news networks.","post_message":"You will DEFINITELY not see THIS on CNN. Nor, will you hear BHO condemn her violent, F-bomb laden, BS. @webpagelink"},{"comment_id":"10154402963106729","commenter_b":"and..... Beyonce needs to get the hell out of the United States of America!...","commenter_a":"Our police are just doing their job and taking out the trash.","post_message":"Everyone needs to see what he sent Obama...POWERFUL."}]
