[{"comment_id":"10155157892736729","commenter_b":"HILLARY LIED UNDER OATH SEVERAL TIMES- SHE TOOK FOREIGN BRIBES FOR CONTROL OVER OUR SOVEREIGN NATION- SHE DESTROYED EVIDENCE AFTER CONGRESS DEMANDED IT WITH A SUBPOENA- THOSE ARE REAL CRIMES- WE WOULD BE IN JAIL FOR- THE DEMOCRAT'S SAY COMEY IS SIDING WITH ONE SIDE OVER THE OTHER-FOR POLITICAL REASONS- BUT NOT THE FIRST TIME - WHEN HE WOULD NOT PROSECUTE CRIMINAL HILLARYS-BLATANT INTENTIONAL-CRIME SPREE- NO- ONLY NOW -THEY SAY IT- WHEN IT'S NOT GOOD FOR THEM- THIS NEW FBI INVESTIGATION- IS A JOKE- THEY WOULD HAVE ALREADY PUT HILLARY IN JAIL!!!! **WIKI LEAKS AND THE FBI-ALREADY HAVE ENOUGH EVIDENCE TO PUT HILLARY IN JAIL- THIS IS A SCAM- THIS IS JUST A DISTRACTION- SO HILLARY CAN SAY- SEE- THIS IS NONSENSE- THERE IS NOTHING THERE--CRIMINAL HILLARY HID EVERYTHING BUT NOW WANT'S IT OUT- I CALL BULLCRAP","commenter_a":"Kill yourself you fucking pig","post_message":"Amazing."},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"},{"comment_id":"10153922572740950","commenter_b":"No she was saying don't do it Keith.","commenter_a":"Dummies... she was telling the cops, \"Don't do it\". Did you not hear her NUMEROUS TIMES say, you better not shoot him. Don't do it. HE DOESN'T HAVE A GUN. I suppose she changed her mind halfway through. Smh","post_message":"Warning - Graphic Content: The Charlotte-Mecklenburg police department just released the officers' body cam footage taken during the shooting of Keith Scott: @webpagelink"},{"comment_id":"415728535218854","commenter_b":"David, you're the world's largest pussy","commenter_a":"the FACT that America is the worlds largest and foremost terrorist breaks my heart because most of the people in this country are better than that but our government sucks shit and has brainwashed them.","post_message":""},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"},{"comment_id":"1044965742191103","commenter_b":"So lern ich ja vielleicht doch noch was Mathe 😂","commenter_a":"@username :D","post_message":"Original image by Cath Ennis"}]
