[{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."},{"comment_id":"10154447143119087","commenter_b":"Katherine, I hope someone, someday, grabs you by the pussy, you uneducated white trash bitch","commenter_a":"lol he's a hot headed LOSER.... This asshole called his own daughter a Pig And somehow we care what he thinks about Donald Trump","post_message":"Alec Baldwin posted a photo on Instagram in a Russian \"Make America Great Again\" Hat."},{"comment_id":"726868034170441","commenter_b":"It's our Flag. If it offends someone they need to look the other way until they LEAVE OUR COUNTRY!!!","commenter_a":"Fly high Old Glory!","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10154252352423984","commenter_b":"Megyn is a bitch-not interested in anything she says.","commenter_a":"WHAT?????? Megan Kelly reported something bad about Trump - I am in shock -","post_message":"Trump's not going to want to hear it..."},{"comment_id":"1066627293358281","commenter_b":"You killed a clumsy one. No more clumsy spiders","commenter_a":"How is that possible? The spider isn't going to breed after it gets killed. Shouldn't TRYING to kill spiders have that effect?","post_message":"Just sayin."},{"comment_id":"10154897891195530","commenter_b":"@username you kiss your mama with that nasty mouth?","commenter_a":"Trump is frightening for everyone. Period.","post_message":"There are up to 127,000 undocumented immigrants in Michigan, many of them anxious about Donald J. Trump."},{"comment_id":"1662251920662029","commenter_b":"White thugs!!","commenter_a":"Love the broncos, but just for this I would have they're title taken from them and given to the panthers","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"}]
