[{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."},{"comment_id":"1833117833414623","commenter_b":"Migrants coming in to work for the NHS?","commenter_a":"its only going to get worse with all the immigrants coming in","post_message":"Worst NHS week in 15 years"},{"comment_id":"10155894107865389","commenter_b":"I suggested the other day that we send them ours. We send two criminals for every illegal that comes to the U.S.","commenter_a":"We need leaders with strong convictions for the right thing","post_message":"ICYMI: Last night on 'Hannity,' Donald J. Trump doubled down on his stance on illegal immigration, telling Sean that the country of Mexico is “sending us their criminals.”"},{"comment_id":"10153309825421770","commenter_b":"Her vagina card won't work!!","commenter_a":"The fix is in. Sorry Sanders supporters. That's bullshit that's the system is rigged against y'all. Don't worry, Trump will smash her dreams in the general election. This will come back to haunt her.","post_message":"BREAKING: Hillary Clinton wins the Nevada caucus over Bernie Sanders."},{"comment_id":"10153233939551130","commenter_b":"Shame on you, damned sexist!","commenter_a":"\"Just to hold it in your hand\"... Yeah, that's not how tampons work >;)","post_message":"The best way to bring a tampon to the bathroom is just to hold it in your hand."},{"comment_id":"600606456772491","commenter_b":"Takeaways from the Texas GOP Debate *Donald Trump looked like an absolute buffoon in a nice suit. It was also clear that he has talked out of both sides of his mouth so much, that he cannot even remember what he has said in the past. We heard all the same old talking points and we heard more insults and name calling designed to shame his opponents; and Trump even classless attacked the moderators for asking reasonable questions. The Trump diehards will rush to the Internet to vote for him as the winner. People who were actually listening to him, will change their vote if they thought about supporting him, or be happy with their decision to vote for someone else. * Ted Cruz was once again the most substantive and clear debater. He was unfairly treated by Wolf Blitzer by Blitzer inability to control Trumps interruptions. Ted Cruz was ...","commenter_a":"Good job tonight I wish we could of heard more","post_message":"Real compassion is providing people a ladder of opportunity to climb up from a state of dependency. #GOPDebate   Visit bencarson.com/issues to learn more."},{"comment_id":"10155971884414062","commenter_b":"You wouldn't even bow down to GOD himself but to some woman who \"claims\" African goddess with Indian woman hair.. okaaayyyyy","commenter_a":"I take this performance highly offensive! There is Only One King and that is Jesus Christ! #Stepdown!","post_message":"This was the first glimpse of Beyoncé since her pregnancy announcement hit Instagram at the beginning of February.  Winners' list: @webpagelink Photos: @webpagelink Full GRAMMY coverage: @webpagelink"}]
