[{"comment_id":"895664467159698","commenter_b":"Elinor, cite your source. As recently as 2010, the Democrats made a former member of the KKK President pro Tempore of the Senate. Shawn, who these people may have voted for is irrelevant. A lot of Obama supporters are criminals. Does that mean they all are? Do you judge an entire group by the behavior of a few?","commenter_a":"I can explain it easily. THEY'RE NOT CONSERVATIVES!!! Liberals and conservatives aren't the only labels that exist to identify people. If you're claiming that they represent conservatives, you are at best, a cherry picker. But liar is the more appropriate label.","post_message":"Conservatives welcomed President Obama to Twitter in the only way they know how: By calling him a \"n*gger.\""},{"comment_id":"10154422434652490","commenter_b":"All \"journalists\"","commenter_a":"Military Times journalists are all DEMOCRATS. They lean left. I stopped subscribing to their rag years ago- I got nauseous every time I read it. Here's to hoping they file for bankruptcy during the Trump administration.","post_message":""},{"comment_id":"460098450844429","commenter_b":"Idiot, cite a source.","commenter_a":"Homicide and violent crime rates are down, twats. They're lower than they've been since the early 90's-you focus on \"gun murders\" instead of all murders because the facts don't back up your propaganda.","post_message":"America's big problem is lethal violence  and that's driven in large part by guns."},{"comment_id":"1079564272093616","commenter_b":"Keep the Government off our backs and away from our wallets President Trump, and put up that Wall, enforce The US Constitution, and Bill Of Rights and that should help Us all to have a Better 2016 !","commenter_a":"Happy New Year Mr. Trump! My son loves the Christmas card you sent him.. God bless you.. We love you! Trump 2016!!!!!!","post_message":"I would like to wish everyone A HAPPY AND HEALTHY NEW YEAR. WE MUST ALL WORK TOGETHER TO, FINALLY, MAKE AMERICA SAFE AGAIN AND GREAT AGAIN!"},{"comment_id":"10154983391004138","commenter_b":"@username so all white men are evil? Racist!!","commenter_a":"Being US citizen, I was planning to leave the US for the first time ever to visit Africa and Dubia. Now I can't even leave and visit my love ones that I haven't seen them since 1996. I am Somali American who is proud to be Muslim but also love this country just like many Muslims. . We're all the children of Adam and Eve, one nation under God, we're all immigrants. Ban Donald trump not Muslims.","post_message":"Approximately 500 to 700 people gathered at Terminal 1 to protest President Donald Trump's ban on immigrants from seven Muslim-majority countries entering the U.S."},{"comment_id":"1083743574979986","commenter_b":"nah, bitch. not now.. just getting going :)","commenter_a":"forced depopulation by way of financial and imprisonment threats.. sad..","post_message":"The Australian government will tighten the rules requiring children to be vaccinated in order for parents to receive welfare payments and childcare subsidies."},{"comment_id":"1048601445225209","commenter_b":"I know... she has effectively modeled pant suits for old bags of dirt","commenter_a":"So tell me and please be honest what has Hillary done for America like a policy or a law or something that has benefited us you know she's been in politics for over 25 years been the first lady and a senator and Secretary of State what actually has she done for us and don't use her as an example.","post_message":"What our president says matters. We can't let Donald J. Trump's hateful words speak for us."}]
