[{"comment_id":"1001040969952432","commenter_b":"Hillary says she landed under sniper fire and had to put her head down and run for cover? Hillary says she and slick Willie were broke when they left the white house? INTELLIGENT PEOPLE DO NOT SUPPORT A proven documented habitual liar for the highest office in the country TRUTH MATTERS","commenter_a":"Hillary 2016! Got my vote!","post_message":"\"I want you to remember: when you vote, when anyone votes, your vote matters as much as anybody else’s. Now, we may be up against super PACs and billionaires, but when the election comes around, Donald Trump and the Koch brothers with all their money, they only get one vote each. One person, one vote. That’s what we believe.  No one should be able to take that vote away. That’s why we cannot turn away and close our eyes from all of the attacks on voting rights that are happening right now. They don’t just threaten the integrity of our elections, although they do. They threaten what it means to be a citizen—indeed, what it means to be an American.\" —Hillary yesterday in Birmingham, Alabama"},{"comment_id":"10153406625761130","commenter_b":"What sport are the males allowed in the female locker rooms?","commenter_a":"\"Male journalist arrested for trespassing in women's locker room. Charged with trespassing, unlawful entry and sexual harassment\"","post_message":"\"It's still 2015, right?”"},{"comment_id":"1250137068360096","commenter_b":"@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"},{"comment_id":"10155491748590354","commenter_b":"Karma catching up with this Idiot, good !!!!!!!!!!!!!!","commenter_a":"she must be taking lessons from sharpton","post_message":"Pro tip: when bashing others to pay their \"fair share\" in taxes, it might be wise to do so yourself."},{"comment_id":"10156778240410354","commenter_b":"If he can't handle her, Hillary will make him her bitch. The bitch Trump. Has a ring to it.","commenter_a":"Enough of FOX NEWS \"debates\", Time to vote, enough of Rubios super pac trying to make him look good","post_message":"But the campaign's stated reason for the decision may be different than one might expect..."},{"comment_id":"10153238831311051","commenter_b":"Typical Americans always thinking they are better than everyone. Have you simpletons ever stopped think why these immigrants come to America? A lot of these Hispanics come to this country for better lives and find work, work that half these lazy ass welfare sucking Americans won't do.","commenter_a":"We need to deport Trump","post_message":"Do you agree or disagree with Donald Trump?"},{"comment_id":"952385434796916","commenter_b":"You are the disease you inbred fuck","commenter_a":"Abortion is a personal choice, you can't ban it from everyone just because your shitty religion doesn't like it","post_message":"You'll want to pay attention to this one."}]
