[{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"10156504426675725","commenter_b":"Melania will be a wonderful First Lady and she'll bring class back to the White House!","commenter_a":"she'll be a 1000 time better than Michelle Antoinette Obama !!!","post_message":"My beautiful wife, Melania, shot in Trump Tower--- a great First Lady!"},{"comment_id":"1239107352812458","commenter_b":"And you sir are an idiot","commenter_a":"There is a way to stop and fire Donald Trump is vote against him Donald Trump you are fired ========= Vote blue up and down the ticket==================== ==========hillaryclinton.com for more information, let's unite our voices and vote blue up and down the ticket. I'm an official member volunteer online for @username.","post_message":"Our planet's future depends on the decisions we make now."},{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10153638763994342","commenter_b":"@username he's not interested in your girlfriend","commenter_a":"Breaking: Lavoy Finicum, Marine, Rancher, father, and grandfather will be laid to rest today. He loved God, the constitution, The United States of America, and his family.","post_message":"Police say the local rapper was shot four times. He is expected to survive. #abc13"},{"comment_id":"10154364606704445","commenter_b":"Guns didn't kill these poor girls their mother murdered them!!! That was her intent!","commenter_a":"Glad she was able to protect....oops, kill her family with her guns. Just another \"legal good gurl\" gun owner turned murderer after her latest hissy fit.","post_message":"Two sisters shot and killed by their mother in Texas are being remembered by friends and neighbors."},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":""}]
