[{"comment_id":"10155024301581600","commenter_b":"Yeah, what's a whinner?","commenter_a":"Proof we have become a nation of whiners.","post_message":"Tens of thousands packed into downtown."},{"comment_id":"981651015256776","commenter_b":"Lol because people and companies don't donate cars and trucks for tax write offs","commenter_a":"God forbid American tax payer money goes towards improving lower and middle class families or stuff that actually benefits us, but check out the sweet new cars dps get to drive!","post_message":"Next time you pass a red Dodge Challenge or Yellow Ford Mustang GT, you might want to check your speed. DPS troopers now have two new unmarked vehicles for traffic enforcement."},{"comment_id":"1711755495764368","commenter_b":"Where all her pussy friends at doeeeee 🤔😂😂","commenter_a":"@username 😂","post_message":""},{"comment_id":"10154172496221717","commenter_b":"Indiana needs to leave the transgenders alone!!!","commenter_a":"They refused to hear the bill and it's officially dead.","post_message":"Freedom Indiana warns that the the proposed legislation \"could be used to target transgender individuals for discrimination and harassment.”"},{"comment_id":"10153251176006509","commenter_b":"Ignore luci. She is a troll.","commenter_a":"White supremacy tip of the day: If a black person commits a crime, blame him and every black person via Al. If a black person is the victim of a crime against them by a white person, blame him and every black person for bringing the violence upon them.","post_message":"A device had detonated, but failed to ignite a gasoline can placed alongside it. The incident left some shaken in Colorado Springs. @webpagelink"},{"comment_id":"10153146604638690","commenter_b":"the terrorist girl.","commenter_a":"There is no age for crimes, a criminal is a criminal. You use children to score PR points in the media. These rocks can kill the passenger inside the car.","post_message":""},{"comment_id":"10154129058346509","commenter_b":"Please stay the f**k in Africa!","commenter_a":"With 18 proven ways on overcoming Homosexuality, George's Diary presents to you words of life relevant to this present generation. Homosexuality is not the worst and unbeatable lifestyle, God doesn't hate gays and lesbians. That understanding alone brings hope of overcoming it! You may not be a lesbian or gay but so many people around you are homosexuals, some are secretive about it while some are not! Some wants to change their lifestyle while some doesn't. Your next of kin or even close friend may be a victim of Homosexual without you realising it. Read this article and learn to overcome or help others overcome homosexuality. You can as well do your neighbour good by passing on this article to him or her...... OVERCOMING HOMOSEXUALITY.... Read now!!!!! @webpagelink Or download George's Diary on your Android device @webpagelink","post_message":"Like it wasn't scary enough already. This glass walkway hangs more than a half-mile up a mountain and the glass panel cracked, sending visitors fleeing and screaming. @webpagelink"}]
