[{"comment_id":"467807840076463","commenter_b":"IDIOT ! LEAVE !!","commenter_a":"Yes, DEFINITELY","post_message":"Should Muslims Who Don't Like Christian Holidays Leave America?  Comment 'yes' or 'no'."},{"comment_id":"10153844548482894","commenter_b":"Girls dem suga 😁 get well mi fellow Jamaican .","commenter_a":"Aww cmon now not Beenie Man","post_message":"Beenie Man Contracts Zika Virus, Forced to Miss OVO Fest Performance"},{"comment_id":"439880426200251","commenter_b":"Awesome we need more women like her.","commenter_a":"I would done same","post_message":"Don't mess with this mom..."},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"1187241994648589","commenter_b":"Clinton is dangerous to kids and adults! Lots of her associates end up dead. And she is still married to a pervert! I'm voting for Trump!","commenter_a":"Hillary could care less.","post_message":"CLINTON claims TRUMP PRESIDENCY puts KIDS in DANGER  @webpagelink"},{"comment_id":"10154215455576770","commenter_b":"Lock her up","commenter_a":"As a retired military wife she Makes me sick!!! Like she ever cared about America!! She cares only for herself and if you support her I feel sorry for you!!!","post_message":"Hillary Clinton responded within minutes."},{"comment_id":"931627590204327","commenter_b":"From Shyann Malone - This is the coldness I experienced when getting into the car this morning! 40 In St. Pete at 3am. Heat on Full Blast!","commenter_a":"Mulberry","post_message":"Brrrrrrrrrrr! This was St. Pete at around 3a.m. this morning.  Who's the coldest in the Bay area? Show us how frigid it is at your location. Snap a pic and post it in the comments below."}]
