[{"comment_id":"10152966596170399","commenter_b":"And all these illegal f$^%ers are going to Disneyland!","commenter_a":"Hire a illegal alien get a $5000 fine! A New Border Surge Opens Us To Surge Of Epidemics Border Surge: Secretary of State John Kerry warns of a new surge of illegals, just as Central America is being hit by a new wave of epidemics. No doubt about it: President Obama's open-borders policy is exposing us to disease, too. It's plain what's bringing up this great wave of diseases: immigration politics. President Obama is so obsessed with winning Latino votes for Democrats by neglecting border laws that he's unwittingly opened the U.S. up to a variety of third-world diseases. He's released tens of thousands of medically unscreened illegal immigrants into the U.S., supposedly to prepare for their immigration hearings, which 70% never show up for. The epidemics are small now, but the risk is rising. And with a new wave of illegals in the pipeline, where's the will to stop ...","post_message":"\"Anti-vaccination is tailormade for deeply selfish people, because it gives them a chance to show off how superior they think they are while shifting the cost of their choice on other people.\""},{"comment_id":"1117614688258709","commenter_b":"@username I bet you believe the liar Lucy.","commenter_a":"Apparently the alleged (by police) victim in this case, is saying \"there was no assault\"..... Of course if the Gian Gomeshi/Lucy DeLiar case has taught us nothing if not \"We must believe in the guilt of every man accused, even if he is not guilty... even if the accuser admits to lying about it... and even if the alleged victim says \"he didn't do anything\".... if you have a penis, you are, by default, guilty, even if you're not guilty :( Sad world when having a dick is more of a crime than being a dick :(","post_message":"\"If I find out that somebody is abusive, I cut them out of my life. It's very easy,\" wrote Lucy DeCoutere after the actor who plays Bubbles in the Trailer Park Boys was charged in a domestic dispute."},{"comment_id":"1456373527716006","commenter_b":"secede already and take your cousin wife with you and all the other uneducated ignorant trash with you. Republican policies fail every time and only uneducated idiots do not see the truth that is why your state doesn't believe in education","commenter_a":"Once again......Trump was right!!! And that kills the over sensitive lefties.....","post_message":"Trump once remarked to a \"Celebrity Apprentice\" contestant that it \"must be a pretty picture, you dropping to your knees.\""},{"comment_id":"1125221904203952","commenter_b":"Wow...you can't judge an entire religion by the actions of a few?!!! wow...where have we heard that before? yet...it goes ignored, until that line of thinking works for the christian cult members....then its supposed to be real........nice one cindy! this is just more proof that there is no such thing as \"GOD\"....or if one is up there, he is a mean spirited, vindictive SOB and i want nothing to do with him","commenter_a":"I hope all these co called Christians that praise what has happen have something awful happen to them Human beings were killed it does not matter who or what they were. You poeple should be ashamed","post_message":"This is not how decent people react to tragedy."},{"comment_id":"747243702046419","commenter_b":"Women hate mothers. Go figure.","commenter_a":"@username same story but the comments...","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"},{"comment_id":"10155458393115389","commenter_b":"No, she sucks!","commenter_a":"This is a Tempest in a tea pot. Hillary Clinton will be the next president.","post_message":"Another bad week is shaping up for Hillary Clinton."}]
