[{"comment_id":"1081156815254321","commenter_b":"DEPORT ALL MUSLIMS FROM AMERICA IMMEDIATELY : DESTROY EVERY MOSQUE ASAP !","commenter_a":"Back to disliking France again","post_message":"Establishing 'good relations' before Trump takes office..."},{"comment_id":"10153911608872577","commenter_b":"The definition of terrorist declares them terrorists.","commenter_a":"No, a Heavily armed group of people using fear and power to push their beliefs on a government is what makes them Domestic Terrorists.....","post_message":"Non-violent occupation now considered domestic terror. #CNN #Bundy #Oregon @webpagelink"},{"comment_id":"955814454527001","commenter_b":"He involves himself into everything other than the priests who get their heads c*** off so called refugees .","commenter_a":"lmao the fact that this is an actual problem and a topic taken up by the pope, speaks volumes about the state of the humans! arent we suppose to be the most intelligent species...i mean we aren't animals that can change genders at will or to reproduce...","post_message":"\"Today, in schools they are teaching this to children -- to children! -- that everyone can choose their gender.\""},{"comment_id":"587883731397342","commenter_b":"Takes one to know one Babs!","commenter_a":"Who cares","post_message":"Barbra Streisand blasted “narcissist” Donald Trump in a 1,228-word Huffington Post op-ed."},{"comment_id":"10154878892083812","commenter_b":"GregOwens, @webpagelink","commenter_a":"That was just a typo. He didn't mean POTUS. He meant P.O.S.!","post_message":"Pres. Barack Obama in response to last night's presidential debate: \"Hillary Clinton went high and showed why she'll be a POTUS for all Americans.\" @webpagelink"},{"comment_id":"902219749819813","commenter_b":"Mad gangs are those who want to draw another map. If a woman doesn't want you will you force matters. Ukrainians and other countries don't want Russian. For then to survive they want a friend indeed to protect them to the aggressor. PUTIN","commenter_a":"NATO is the biggest ever gangster-organ./ bunch of WARCRIMINALs.. existed on earth.. and as such.. the biggest threat to world-peace of our time..","post_message":"A top Russian military commander says Moscow considers NATO missile installations in Eastern Europe “priority targets.”"},{"comment_id":"10153675906043132","commenter_b":"Ben's is too good for her He's lucky she sent him home He had too much class for her","commenter_a":"Shawn wins - there.","post_message":"Last night's The Bachelorette: Let's discuss."}]
