[{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."},{"comment_id":"10153304856351350","commenter_b":"Lol!! Someone stop these people from reproducing!! It's not attractive lol","commenter_a":"@username Katie Pollard","post_message":"Congratulations are in order (again) for the Duggar family!"},{"comment_id":"10153364439113010","commenter_b":"Marie, I know. That's what the vaccines are for - preventing hepatitis. I'm saying 1,000,000 people could've potentially lived if they'd had access to a vaccine, and a million is definitely more than two.","commenter_a":"Well done to the Senators who care about the health of California children!","post_message":"The California Senate passed a controversial bill that would require children to be vaccinated by eliminating the ability of parents to opt out of the mandate based on personal beliefs."},{"comment_id":"10154292047384877","commenter_b":"She out here looking like Nick now","commenter_a":"Wait so you can demand money for a breakup now?? I must have missed that memo, lol","post_message":"Mariah Carey also took to Instagram to confirm the split and her break-up hashtag game is brutal."},{"comment_id":"1119027841463579","commenter_b":"Julie, if you want perky get a coffee maker. Geez.","commenter_a":"Wouldnt Dr Carson be a more appropriate choice for Dr Jeffers to endorse? Dr Carson doesnt bash anyone like Trump does. Trump is so rude. Im embarrassed for First Baptist Church.","post_message":"\"It's not that Evangelicals have given up on their values, but they no longer believe that government can uphold those values.\"  Today on \"FOX & Friends Weekend,\" Dr. Robert Jeffress explained the \"huge paradigm shift\" in what Evangelical Christians are looking for in a candidate."},{"comment_id":"1841606822750087","commenter_b":"KORDSTAN","commenter_a":"So glad he is gone!","post_message":"President Obama delivered his final address to the American public in Chicago. How will you remember Obama's legacy? #ObamaFarewell"}]
