[{"comment_id":"10153364439113010","commenter_b":"Marie, I know. That's what the vaccines are for - preventing hepatitis. I'm saying 1,000,000 people could've potentially lived if they'd had access to a vaccine, and a million is definitely more than two.","commenter_a":"Well done to the Senators who care about the health of California children!","post_message":"The California Senate passed a controversial bill that would require children to be vaccinated by eliminating the ability of parents to opt out of the mandate based on personal beliefs."},{"comment_id":"10153110276422550","commenter_b":"No she has make up in the first picture","commenter_a":"Two different people...","post_message":"\"If anyone needs a little motivation to not lay in the tanning bed and sun here ya go!\" A 27-year-old mother hopes her graphic selfies of painful skin cancer will serve as a warning for others. Her story --> @webpagelink"},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"10154604674038690","commenter_b":"#Bilal_yema we terribly hate the western hypocrites who have kept Muslim lands occupied in Afghanistan!!! tell them to leave Afghanistan we Muslims will solve our own problems!!!!!","commenter_a":"Taliban means terrorist and terrorist means Pakistan Pakistan is cancer for the world","post_message":"Based on reports gathered by Al Jazeera from local police, security forces and the Taliban, here is a conservative estimate of the areas in Afghanistan that are contested, under the Taliban, and under government forces."},{"comment_id":"10153766225688132","commenter_b":"the laws about women showing constant pictures of themselves naked have to change, really sick of seeing all her plastic body parts.","commenter_a":"Please change yourself first phony woman","post_message":"\"These gun safety laws have to change!\" - Kim Kardashian"},{"comment_id":"10154345885036051","commenter_b":"No second chances for this crazy woman!! That poor girl going thru all those surgerys...","commenter_a":"The sister is right she is not a monster!! She is a crazy bitch! And to me the sister is as bad, would she want the mom released if it had been her that had been put in an oven!! I mean seriously what the hell is wrong with people?? And myself i have a hard time buying the insane bit anymore, to many times it is used to try to get away with doing wrong!","post_message":"When she was only 14 months old, Ashley's mother put her in the oven and turned it up. Her father was able to save her. She spent the next 10 years in and out of surgeries. Now she is 15 and ready to start high school - and she just got some unexpected news about her mother."},{"comment_id":"10154494540149586","commenter_b":"T p dig n jag s denna Jenny!","commenter_a":"Giulia","post_message":"\"I resist the systems that oppress people & animals alike.\" #WomensEqualityDay"}]
