[{"comment_id":"10153326828766350","commenter_b":"Why would you call her a whore?","commenter_a":"Nobody cares!!!! Kardashians are talent less media whores!","post_message":"Kourtney Kardashian's response to critics? To just keep posting those pics!"},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."},{"comment_id":"10152760994092144","commenter_b":"That first comment wins stupid comment of the month on the internet. But you will call a cop who has a gun to save your sorry ass. You won't take any responsible actions to save yourself or family, but you will pay someone ELSE to put their life on the line to do it for you.","commenter_a":"Screw the nra.MELT THE GUNS!!!","post_message":"\"We're basically being forced to repeal these laws at gunpoint… Every local gun law must go!\""},{"comment_id":"1718806018406509","commenter_b":"Illegals!!! Bahaha","commenter_a":"Chicago doesn't want trump, we aren't gonna deal with his jokes","post_message":"Protests continue after Donald Trump's UIC rally is canceled for security concerns: @webpagelink"},{"comment_id":"10153128310892452","commenter_b":"Go get it. Keep pushing 👍🙏🙏","commenter_a":"People that don't know,.... one word,......Research!!!!! Google it up!","post_message":"Selena Gomez has revealed that she's receiving chemotherapy after being diagnosed with lupus. abc7.la/1P0VU5F"},{"comment_id":"1131104760243867","commenter_b":"Because no feminist says that.","commenter_a":"So when feminists say, genders should be separated in school, it's just a valid opinion. But if a straight white male says the same thing about science labs, it's sexist? How does this logic work? Oh, sorry, I forgot it isn't logic, it's stupidity. ;)","post_message":"I'm crying with laughter over some of these."},{"comment_id":"910655875703037","commenter_b":"That is one UGLY Hillary","commenter_a":"@username @username Mac Barricini","post_message":"It's called \"Orgy Island,\" and there was already evidence linking Bill Clinton to it. Now, though, the FBI just dropped a bombshell involving Hillary Clinton and the sick island... and what agents are saying could turn the entire election in a VERY ugly way."}]
