[{"comment_id":"692144217642823","commenter_b":"A lesbian trap in a mans body...say what.","commenter_a":"How can Caitlyn get the award for woman of the year if she still has a dick ????","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award.  This is what our world has come to. It doesn't get more absurd than this.  Do you think this is wrong?"},{"comment_id":"10153112038031770","commenter_b":"We need TRUMP we need the wall 11 mil illegals today 25 mil tomorrow when will it stop !!!!! North Carolina here voting TRUMP 2016","commenter_a":"And just another reason NOT to have this trash in our country!!!","post_message":"The District of Columbia started issuing drivers licenses to illegal immigrants in 2014, and now some are complaining because the process takes longer than they would like."},{"comment_id":"10153090646372411","commenter_b":"omg it's getting old","commenter_a":"Madisen AndCody LMFAO! I'm not surprised are you?!?","post_message":"BREAKING NEWS: Chicago Bulls Derrick Rose was injured in practice today after taking an elbow to the face.  He will undergo surgery tomorrow. \"After the procedure, a timetable for return to play will be determined,\" the team said."},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"\"Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."},{"comment_id":"1300466673353815","commenter_b":"If they all count, then re count where Hillary won by small margins...","commenter_a":"Jill stein sucks proletarian donkey dick","post_message":"We're at Trump Tower in NYC standing up for voting justice."}]
