[{"comment_id":"10153966537634714","commenter_b":"yeah i shut the bathoom door is consdered polite","commenter_a":"He said disgusting then you have no heart. You are not a lovable person.","post_message":"The quote has not been disputed by Donald J. Trump’s camp."},{"comment_id":"10154009209659087","commenter_b":"@username if they were legal the kids would be citizens","commenter_a":"I don't know how much credence we can give any of the polls after they caught Reuters \"cooking\" that poll a few weeks ago. It goes without saying the media bias has never been this strong ever.","post_message":"CNN anchor Brianna Keilar is challenged by Donald Trump's lawyer Michael Cohen to identify which polls show his campaign losing. Her response stuns him."},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it.  Do you agree with the decision these school officials made?"},{"comment_id":"950226215018237","commenter_b":"Or a little pussy like @username","commenter_a":"Conor Lopez Micky Mac","post_message":"The first left me drooling, and the last left me shaking my head. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153718263126028","commenter_b":"So they take a class to prove they're old enough to safely operate a vehicle that had the potential to kill themselves and other and its ok. But they also learn about the dangers of smoking and drinking at age 13 (give or take a year) in mandatory health class yet can't smoke or drink till 18(now 21) and 21? The logic is just weird.","commenter_a":"Why is it that we don't let people smoke till 18 and drink till 21(both of which mainly affect their own health) yet we trust teenagers as young as 15 and a half to drive a vehicle with the potential to kill others? Seems a little backwards doesn't it? Saving people from themselves but not saving them from others.","post_message":"The smoking age in California is now 21. @webpagelink"},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"},{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"}]
