[{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"},{"comment_id":"10154202111261037","commenter_b":"The real question is why she felt it necessary to do it!!","commenter_a":"Here you go: These are not my words. This was a comment from a woman named Laura Johnson who posted on TYT thread, and I thought it was worth the share. When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, Texas resulting ...","post_message":"In a wide-ranging interview with FoxNews, President Obama says he failed to adequately plan for the day after the U.S. helped toppled Libya's dictator in 2011."},{"comment_id":"1716657778577521","commenter_b":"no not true.I have seen proof LOL","commenter_a":"When faced with criticism of their candidate, Trump fans are quick to argue that Trump is better suited to be president than Obama or Hillary. The choice is NOT between Trump and Obama or Trump and Hillary. The GOP is choosing THEIR standard-bearer. The choice before us AT THIS CRITICAL MOMENT is between Trump and anyone of three other Republican contenders. Who will have the moral character to stand up against Hillary or Bernie? I choose CRUZ!","post_message":"Is there a real connection between hand size and penis size? We decided to investigate what the science says on the matter..."},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"10153325885524087","commenter_b":"Such an ignorant cow!","commenter_a":"Hideous hag.","post_message":"“They can wait if they like until next November for the actual balloting, but Donald J. Trump   was elected president tonight.” Ann Coulter tweeted."},{"comment_id":"901805833201774","commenter_b":"Clown in a wig . She makes me sick","commenter_a":"Better to resign before the s--- hits the fan.","post_message":"Why did Democrat Congresswoman Corrine Brown pay the Chinese embassy?"},{"comment_id":"10154945545241002","commenter_b":"Let them fight \" Darwin \" will take over !","commenter_a":"Terrible!","post_message":" loved everyone, said Robert Ybarra daughter. \"He was one of those neighborhood dads that people could count on.\""}]
