[{"comment_id":"922573247835730","commenter_b":"Two women had enough of him, despite his wealth, and headed for the hills.","commenter_a":"I dont understand how a man with everything can be filled with so much hatred","post_message":"Yep, that just about sums up Donald Trump's campaign.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153239066656491","commenter_b":"No he wouldn't lol. Hagrid wouldnt be close to slytherin","commenter_a":"All muggles should be sorted to Hufflepuff.","post_message":"J.K. Rowling isn't afraid to tell Harry Potter fans when they're wrong."},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10154556187833089","commenter_b":"Be remember all of you the one who said refugees should be banned because one tree make million of million matchbox and matchbox born millions trees","commenter_a":"How sweet of him but he just had musks blown up!!!","post_message":"Trudeau says refugees are welcome in Canada"},{"comment_id":"10153277341923188","commenter_b":"I do believe the \"offended\" have been organized by an outsider to bombard anyone helping to stabilize the area. It is not Whole Foods, The National Guard or the Police who need scrutinized! It's the Promoters who keep unrest in the media way beyond the time it is newsworthy! Always seems to be when there is a \"Political\" issue, Ferguson-illegal aliens, Baltimore- Clinton Foundation and the very questionable donations. Of course the nuke treaty with Iran, etc.! Protesters in both cities started out fairly calm. Then hordes of people started pouring out of the woodwork, looting, burning, destroying, many were not even from that area! How did they get organized so quick? I agree that All Lives Matter in every community. I also believe a huge % of our Police Departments are doing what they have to do with the Thugs who lack any respect for our laws! Rap sheets ...","commenter_a":"So sad they were doing the right thing.","post_message":""},{"comment_id":"10154933688831037","commenter_b":"She's a snake!!!","commenter_a":"This girl looks horrible, think she needs some rest.","post_message":"Trump will \"be the president of all Americans, including those that did not vote for him.\""},{"comment_id":"10153652043082452","commenter_b":"Ok....we'll make the insect kingdom pay for it.","commenter_a":"We must build a wall to keep them out!","post_message":"Southern California's iconic palm-tree landscape could be threatened by a new invasive pest migrating north from Mexico.  The South American weevil kills palm trees by eating their leaves and spreading disease. It's already made its way to San Diego after devastating palm trees in Tijuana."}]
