[{"comment_id":"1038035722930072","commenter_b":"For all you little girls out there here is your biology 101","commenter_a":"Al u people that stand with planned parenthood are just as disgusting as they are., hope your babies don't get ripped apart limb from limb you sick bastards","post_message":"#BREAKING: \"Planned Parenthood & our CA affiliates today filed a lawsuit against the people behind [the] widely discredited video smear campaign,\" tweeted Planned Parenthood president Cecile Richards."},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."},{"comment_id":"604853703036255","commenter_b":"HOW she could stand there and openly lie to those families is just beyond me!! That is one dangerous woman!!","commenter_a":"People will still vote for her. Don't they know what a evil heartless lying phony she is. Here we have a vet who knows the truth she left those men to die despite numerous calls for help none came under her watch. She lied about the video not only to Americans but she lied straight to the faces of the victims families. She knew it was a planned attack that night but no she went to bed and I'm sure she slept peacefully. But as she yelled at the hearings \"What difference does it make.\" Her supporters should watch this over and over this will show her true colors.","post_message":"He exposed Hillary!!!"},{"comment_id":"10154742011562908","commenter_b":"Stfu","commenter_a":"Raise taxes on corporations they either go overseas or pass the expense on to the consumer. Bernie can't tax enough to pay for free everything.","post_message":""},{"comment_id":"989615211072231","commenter_b":"Awesome","commenter_a":"WTG BOLTS! :-) :-)","post_message":"GO BOLTS! Tampa Bay Lightning wins Game 2 of the #StanleyCupFinal, ties series 1-1!   WOOOOOOO HOOOOO! Missed a moment? Check out the game details: @webpagelink"},{"comment_id":"10157577335255389","commenter_b":"Gonna rain in wall street. The same ones you took millions from you pathetic lying hag","commenter_a":"its hard to listen to her speaks! the first thing came out of her mouth was Trump says did and Trump says that and what Trump did! nothing change she offer nothing! she looks doll up but still a liar!!","post_message":"Journalism. Is. Dead."}]
