[{"comment_id":"1787231111544405","commenter_b":"She was sucking the hell out that dick! Stephanie Nicole Goad lmfao","commenter_a":"Macie Knisley @username lol ummmm #Merica lol","post_message":"This Veterans Day party gives free tattoos, haircuts and blowjobs to veterans..."},{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."},{"comment_id":"464935007030413","commenter_b":"Best place in the world for a daily Pork roast.","commenter_a":"Deport their @&$)(;:/,?))&@@&))","post_message":"Should Islamberg Be Shut Down?  Comment 'yes' or 'no'."},{"comment_id":"1548781162079004","commenter_b":"Found the stupid feminist.","commenter_a":"if U want to End ALL Abortions, eliminate the NEED for abortions!! STOP RAPE First!!!","post_message":"Flip the Script is back!  We asked pro-lifers why they think abortion is murder  and then they sorta threatened to kill us."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."},{"comment_id":"10153427592702377","commenter_b":"WE NEED TO TAKE THE WHITE HOUSE BACK!!!","commenter_a":"Carefull what you wish for... then stack the $15 minimum wage movement on top of that! :-(","post_message":"April 15 just got a lot worse."}]
