[{"comment_id":"10152885727286336","commenter_b":"All women are trained assassins HAH","commenter_a":"If it's true, hopefully he isn't that stupid to actually claim that","post_message":"NASCAR driver Kurt Busch claims his ex-girlfriend, who accused him of assault, is a trained assassin."},{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"10153985264843984","commenter_b":"She is hot","commenter_a":"You go girl","post_message":"Fox News superstar Andrea Tantaros just hit Instagram with an awesome selfie.  She's pretty, but it's the t-shirt that makes the pic amazing."},{"comment_id":"1142380192485341","commenter_b":"Wow are you serious they are trying to take out the Americans 1 job at a time and all the free handouts our government will give them. While our own government let's the Americans suffer by allowing them to free load off our system. Really they get social security for what . Americans get denied SSI while the immigrants step right up and no problem. really ?? Go Trump","commenter_a":"Welcome to the future!!!","post_message":"Nearly 40% of less-educated, working-age Millennials ages 18-29 don’t have a job.  That’s more than 15 million young-adult high school grads and high school dropouts who aren’t working."},{"comment_id":"1160001747368578","commenter_b":"@username What Does Hillary Clinton Really Want? WARNING: up America As you may know, Hillary Clinton mentor was Saul Alinsky. She wrote her thesis based on his writings. Saul Alinsky died 44 years ago and was the author of a piece called for Radicals. He wrote about how to create a State. President Obama prescribe to this philosophy as well as Elizabeth Warren and Bernie Sanders. Don fool yourselves, this is their mission and their purpose! There are eight levels of that must be obtained before you are able to create a social state: 1. Healthcare Control Healthcare and you control the people 2. Poverty Increase the poverty level as high as possible; poor people are easier to control and will not fight back if you are providing them everything to live. 3. Debt Increase the Debt to an unsustainable level. That way you are able to increase taxes which ...","commenter_a":"This information has all been checked, then double checked... It is 100% Correct. Maybe Trump knows something we should That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! Until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government! John Brennan, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her parents still live. Hillary Clinton's top adviser, Huma Abedin is a Muslim, whose mother and brother are still involved in the ...","post_message":"Hillary Clinton belongs in prison!"},{"comment_id":"1170571449649992","commenter_b":"A lot of dumb chicks out there..","commenter_a":"Love it!!!","post_message":""},{"comment_id":"1031074676904002","commenter_b":"girls get u a 357 they will stop","commenter_a":"just waiting for the ruling that guns are people too","post_message":"This is gross -->"}]
