[{"comment_id":"10153506659437964","commenter_b":"There are those who useabortion as a contraceptive. I know a young lady who had so many that when she got married & wanted a baby, she couldn't have one. Turned into an alcoholic.","commenter_a":"I thought Obamacare was going to take care of the poor...the ones who couldn't afford health insurance...so why do they need planned parenthood?","post_message":"On Monday, we'll be voting to eliminate federal tax dollars going to Planned Parenthood. I can assure you I'll be voting 'yea.' #preauxlife"},{"comment_id":"1477131165645723","commenter_b":"She is a phony douche like her old man.","commenter_a":"Lying runs in the family!!!!","post_message":"Of course it is..."},{"comment_id":"902172716496023","commenter_b":"I stand corrected. It is Planned parenthood that started with the concept to murder black babies before they were born.","commenter_a":"Aren't the Democrats responsible for the initial abortion idea and practice? Also, the plan was to abort unborn black babies. Who's the racist? Hint...DEMOCRATS!","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period.  Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1059208864172624","commenter_b":"Sounds just like a female lol","commenter_a":"Obviously. Ignorance is bliss? But when will they see who he really is. A narcissistic sociopath. Will to nuke anyone who hurt his little feelings","post_message":"\"People who support Donald J. Trump are people who should be respected for how they feel, but I worry that they don't understand that they're being scammed. And that they're being scammed by someone who's really good at it.\"  - Mika Brzezinski, co-host of Morning Joe"},{"comment_id":"10154328122239641","commenter_b":"Right after you @username..... she will right after you.","commenter_a":"I hope Hillary drops dead before November.","post_message":"BREAKING NEWS: Donald J. Trump comes out of the Republican convention ahead of Hillary Clinton in the polls."},{"comment_id":"929408747192304","commenter_b":"As stupid and ugly as her mom!!","commenter_a":"She can't help it...look who her parents are!","post_message":"Chelsea Clinton....you are an IDIOT."},{"comment_id":"1108272855874801","commenter_b":"she has a penis","commenter_a":"She looks like a man..","post_message":"Terrible!"}]
