[{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."},{"comment_id":"909734362398134","commenter_b":"Their already lawless. Nothing but thugs in many of the public schools, who by the way are running the schools. The kids tell the adults what to do!","commenter_a":"Sounds like she wants to give \"minority students and other risk youth, including migrants and LGBT students.\" a free pass whenever they get into trouble. How about teaching them to OBEY the law?","post_message":"Things go from bad to worse..."},{"comment_id":"1390703587614315","commenter_b":"We have no way of knowing how Bernie Sanders would have weathered the inevitably nasty storm against him if he had been the nominee.","commenter_a":"I'm really angry at Democrats sending the candidate least capable of defeating Trump into the general. What morons. They saw polling showing that Sanders would trounce Trump by double digits and yet decided that Clinton was the \"safe\" bet??? Effing morons.","post_message":"Donald J. Trump's campaign tells us a lot about what kind of Commander-in-Chief he would be."},{"comment_id":"10153107012089474","commenter_b":"By opening her mouth, we can generate all the revenue we need from the gas coming out of her.","commenter_a":"Hey, you nut job, take Sen, Boxer's lead and just retire.","post_message":"Right when Americans are finally feeling some relief at the pump, Nancy Pelosi wants to take it away with higher gas taxes!"},{"comment_id":"997230403648529","commenter_b":"Let the mf die","commenter_a":"NOT refugees","post_message":"What ungrateful, low life people. Should be a real asset to the country..."},{"comment_id":"988494927933952","commenter_b":"SEND THE MUTHA-FUKA BACK TO SYRIA WITH ALL OF HIS WIVES AND A FEW WELFARE WOMEN AND THEIR CHILDREN.","commenter_a":"Hell no tell him to get a job","post_message":"How do you say, 'Kiss my ass' in Farsi? Check this crap out. @webpagelink"},{"comment_id":"1676347295991211","commenter_b":"Of course she would praise him. He is a lying louse like her husband.","commenter_a":"Libtard !!","post_message":"Michelle Obama is sending a message to Donald Trump."}]
