[{"comment_id":"10153203713812894","commenter_b":"She's a damn lie! Ain't nobody stupid! That's what's wrong with her lying ass all them babies and surgeries!","commenter_a":"What did she do to her face? She looks weird","post_message":"Kim Zolciak Reveals Doctors Discovered a Hole in Her Heart While She Was Hospitalized After Her Stroke"},{"comment_id":"1041402059258074","commenter_b":"But Brandon. . .who do you think PAYS for their jail time? You do and are you willing to pay for all illegal's jail time along with all the criminals we already have in our prisons?","commenter_a":"Why we would give anything to a illgale alien is news to me.don't get me wrong immergration is great if done legaly. All illeagle aliens need is about 5 years in prison then immeaditly deported.","post_message":"Ready for Americans to put American priorities first!? It's that easy!  FOLLOW US!----> Freedom Daily"},{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"},{"comment_id":"709650085834839","commenter_b":"Exactly why I pointed it. Most like her, only dodge and deflect.","commenter_a":"This is not even true and amounts to propaganda plain and simple. And of course this is coming from Florida where an election was rigged. Why don't you educate your fellow man instead of scaring them and filling their tiny little minds with this ignorance; there are so many untruths in this article, number one being the use of the term \"body parts\". Since the majority of abortions are performed at the 12 week mark, these are embryos with no body parts to speak of. There are no videos that show any of this yet that is the main point of your argument. Second, fetal tissue is donated to medical research which is legal and most republicans voted it in (look up fetal tissue for medical research law) and had been, most recently, used very successfully in the treatment of Parkinson's disease. Since most conservatives don't believe in welfare, Planned ...","post_message":"I Freaking KNEW it."},{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"1713379888949123","commenter_b":"Then resign and get her out of the White House!","commenter_a":"I would like to know why people push like on these kind of post? I don't get it! Are you stupid??","post_message":"Are you... KIDDING ME!?   So sick of Barack Obama & Michelle Obama..."}]
