[{"comment_id":"1212113488867185","commenter_b":"Why is it that the LIBERALS are the one who ALWAYS scream the loudest whenever Voter I.D. is even mentioned let along being considered?","commenter_a":"DESPERATE DEMOCRATS KNOW THEY CANNOT WIN FAIR AND SQUARE, THEY RESORT TO UNDERHANDED AND DEMORALIZING TACTICS!!","post_message":"Libs everywhere were thrilled when Texas' voter ID law was struck down by the courts, which ruled it it was too restrictive. That's when they read the fine print, though...  All of a sudden, liberal jubilation turned to rage and tears."},{"comment_id":"10154303589011051","commenter_b":"Immigrants are always welcome, if they come legally and come to be A PART OF AMERICA. If they come to just spread their own countries ideals that conflict with the ideals of the USA, then why come at all? As for who said anything about Sharia Law...that is one of the biggest current issues with immigrants going to the US. They believe in it. They shouldn't be in our country if they do.","commenter_a":"What a wonderful way to make immigrants feel welcome (ps: that's sarcasm) or perhaps immigrants aren't really welcome? In your hearts do you hate people who haven't been born here or speak with an accent or celebrate holidays differently than you do? Whatever happened to \"We hold these truthes to be self-evident- that ALL men are created equal.\"? Or do we really mean all white northern European men are created equal?","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"10153474426766350","commenter_b":"u don't have 2 worry then bitch. your pathetic.","commenter_a":"sad and pathetic. marriage between homosexuals is wrong on any level and again the moral majority is forced to put up with this BS. i for one will give no male or female homosexual the time of day much less respect they don't deserve. it is wrong on any count for male and female homosexuals to marry.","post_message":"\"Today is beautiful,\" said Anna Kendrick."},{"comment_id":"10152679214316545","commenter_b":"I don't understand why it's called The Miss Universe pageant when our planet is the only one competing?","commenter_a":"I thought it was very rude for the audience to boo, I felt bad for Miss USA.","post_message":"Miss USA was SO close to taking home the crown, but many thought Miss Jamaica was the biggest snub!  Thoughts on Miss Universe?"},{"comment_id":"10153459531098855","commenter_b":"Attention whore","commenter_a":"Even her wig looks sad to be there","post_message":"Not another one!"},{"comment_id":"794348560669685","commenter_b":"I learned all this in Men in Black 1 to be honest, and all we need is a Tri-Barrel Plasma Gun. Roaches are obviously Aliens, so in order to truly rid this planet of them, one simply needs 'the jackhammer'.","commenter_a":"Jacqueline and Chris eww! but so cool!!","post_message":"Cockroaches are the worst, but scientists have figured out how to replicate what makes them indestructible."},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."}]
