[{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"10153157126101051","commenter_b":"I doubt she was a gangbanger","commenter_a":"It isn't unusual at all for a \"routine\" traffic stop to result in an arrest There are often some underlying cause to make an arrest. Outstanding warrants for priors. (Maybe that's why she was trying to make a new start in an other state) Drugs in the car, intoxication? Then resisting. There's more here. But it all hardly seems like reason enough to commit suicide. But one never knows all the reason(s) some people take their own lives. Maybe she was facing far more serious charges or problems if returned to her home state? Maybe she was trying to flee gang affiliations. Or gang threats. None of that is even given. Just the same old blame the cops and here we go again B/S story from the press.","post_message":"This woman was arrested during a routine traffic stop. Three days later they found her dead in her jail cell. Officials say it was a suicide - but there's one problem with that theory."},{"comment_id":"10154398939341523","commenter_b":"There are TONS of awesome, respectful, wonderful men; just as there are TONS of nasty, evil, sexual predator females.","commenter_a":"I would still like to know which of my rights are being violated.","post_message":"Milwaukee County Sheriff David Clarke reacts to the Women's March in Washington to protest Donald J. Trump's presidency -- calling it \"an absolutely freak show.\" @webpagelink"},{"comment_id":"550965321772492","commenter_b":"@username I think there's more chance of a war with Clinton. She's voted for a couple already and seems intent on aggregating Russia with unfounded accusations.","commenter_a":"The Clintons always try to \"cover their tracks\" because their corruption is so deep. And they make sure they have info on others who can be manipulated via blackmail at a later date to further the Clinton agenda. PRISON is where they deserve to be!!","post_message":"This is worrisome..."},{"comment_id":"1017702978286400","commenter_b":"It's a true testament to J.K. Rowling's writing that I can read that passage, and, nearly 9 years later, still feel the same goosebumps I felt the first time I read the book in July 2007. Very sad day today.","commenter_a":"\"Look... At... Me...\" He whispered. The green eyes found the black, but after a second, something in the depths of the dark pair seemed to vanish, leaving them fixed, blank and empty. The hand holding Harry thudded to the floor, and Snape moved no more. \"","post_message":"\"It is an ancient need to be told in stories.\""},{"comment_id":"10154635398261037","commenter_b":"To impregnate your mom? Yes.","commenter_a":"And she'll be knocked up again within the month","post_message":"Panna Krom, now 26, was convicted at 17 of killing her newborn in a toilet to hide the pregnancy from her parents."},{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"}]
