[{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"},{"comment_id":"838486396292823","commenter_b":"I know how is she sleeping with the light on it should be a heat lamp!!!","commenter_a":"drink :D","post_message":"Late night eaglet stream!  Thankfully baby E9, Harriet and M15 will be warmer tomorrow!  Where are you joining us from this evening? @webpagelink  Pix courtesy Southwest Florida Eagle Cam"},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"10153919396826509","commenter_b":"White people have killed 300 million people","commenter_a":"Agree...Tony..history...no human life should died..in wars...but happens.","post_message":"The world still struggles to fully understand the events on August 6, 1945. Hiroshima survivors and artifacts link us to the past: @webpagelink"},{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10153295318271130","commenter_b":"Then those girls who don't know how to do that stuff better learn. Especially the condoms. That's both partners responsibility.","commenter_a":"And I am sure girls do not know how to buy their guys condoms, strap-ons and penis rings. So what???","post_message":"They didn't have a chance."}]
