[{"comment_id":"1236561799702931","commenter_b":"No Samantha J Clifford The WAR has already been won. Satan and his followers those that follow unknowingly and those that follow blatantly have lost and satan God and us Christians KNOW this. There is NO HOPE without Christ.","commenter_a":"GOD is making gay marriage licenses invalid.","post_message":""},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10152722810447014","commenter_b":"Go back to your country, boy! \"We don't like yo kind around here!\" WHITE POWER!!! Lol","commenter_a":"Her come the racist white people...","post_message":"Do you agree with President Obama's executive action on immigration, which shields millions of undocumented immigrants from deportation?"},{"comment_id":"10153595852746336","commenter_b":"Which one is the women??","commenter_a":"Girl power!!!!","post_message":"26-year-old Capt. Kristen Griest and 25-year-old 1st Lt. Shaye Haver will become the first women to wear the U.S. Army's coveted Ranger tab when they graduate alongside 94 male soldiers Friday at Fort Benning."},{"comment_id":"10154600253629170","commenter_b":"All the hildebeast fears is losing the election and facing her well deserved comeuppance .","commenter_a":"The FBI said that she had no intent when she broke the law, but Trey Gowdy said in the documents they received from the FBI, that there were no questions to probe if there was any intent. No questions of why, she had a private server. No questions at all, to prove intent. Sounds very fishy. They ( the FBI) just threw that in, ( No intent ) to get her off , from all the crimes that she committed","post_message":"The one thing she fears the most."},{"comment_id":"1075829105767772","commenter_b":"They blame it on Obama....for \"existing\".","commenter_a":"I swear, in some ways things are worse now than they were 50 years ago. Some try to say that it's just among old white people. . . well those folk seem to have done a pretty good job of passing it down.\\b\\b\\b\\b","post_message":""},{"comment_id":"1351641891520492","commenter_b":"YOUR SENILE. SHE SMEARS HERSELF.","commenter_a":"You have my total support Hillary! Every time I come to your Facebook page and see all the horrible Trump trolls posting lies and rumors about you, it makes me even more committed to support your campaign! They are proof that what you said about the deplorables basket was not a gaffe but an unfortunate reflection of reality. I am so happy to see you looking so healthy and recovered today. Next stop the White House!","post_message":"This team is the only thing left that can stop Donald Trump.  We’ve got to leave it all on the field here, and we need contributions from Facebook to reach our goal of 100,000 by midnight. Will you chip in? hrc.io/2d4999O"}]
