[{"comment_id":"10153604514287293","commenter_b":"@username Deport the illegal immigrants in Palestine, back to Minsk, Krakov, Vilnius and Brooklyn, where they were BORN.","commenter_a":"Stop all to the Israeli Colony.","post_message":"“Even the United States doesn’t have anything as complex, as sophisticated.”"},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: \"Islam is Not a Religion of Peace!\" www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"454038491472779","commenter_b":"What the Hell is wrong with this chick...one week she poses nude and another week she posts pic of her child, are we suppose to say which one we like better....you are a sad piece of work, girl","commenter_a":"Who cares????? Guess she wants him to be seen naked also. So popular for being nothings.","post_message":"Kim Kardashian West's newest snapshot of little Saint is a burst of son-shine!  (via Celebrity Baby Blog)"},{"comment_id":"528596753997571","commenter_b":"Yes the airline acted as they should have! If these people don't want to be put into ituations like this they should dress in such a way as not to bring question upon themselves. They should also understand the airlines concern where muslims are involved from prior experience. Personally, I think all illegals should be deported along with Obama!","commenter_a":"Yes. They've already proven they cannot b trusted","post_message":"These Muslims were thrown off the plane for this frightening reason.  It is always better to take necessary safety precautions.  Would you want them off your plane too?"},{"comment_id":"10153619308152235","commenter_b":"@username a racist comment about baking!?? Okay, surely you jest. You don't know what you're talking about so you're automatically excluded. @username I agree it could be seen as sexist except I am a female and bake all the time, but MORE IMPORTANTLY Men are known to be the best chefs😉. @username she didn't make any valid point when she stated \"nothing new, threats made against students daily\" She's out of touch with the article and with reality if she is trying to compare unspecified kids being threatened to a RACIST threatening to kill only BLACK KIDS posing with ak47 on the school grounds!! ARE YOU FREAKING KIDDING ME!??? The generalization she attached to this comment is uncanny, disturbing, and I'm sorry RACIST in an of itself. Because the DENIAL of racism IS racism also.","commenter_a":"This is nothing new. Threats are made against students daily! We went through this last year and most kids were kept at home until the instagram poster was identified.","post_message":"Another effing beautiful day in post-racial America."},{"comment_id":"1531352266898026","commenter_b":"\"She\" don't have dicks, its a he","commenter_a":"Can we please stop misgendering her?","post_message":"\"I had tits and a dick and was tattooed and alternative, and I could come over and over again on camera.\""},{"comment_id":"10153460771654575","commenter_b":"Ian Gibson watch the video. Youre screwed.","commenter_a":"Lol this is news?","post_message":"What does your birth month reveal about your health?  Researchers who compiled the birthdays and medical records of patients found that people born in May are the healthiest. People born in October might be at the highest risk for contracting diseases."}]
