[{"comment_id":"10153286048671717","commenter_b":"Hideous bitch","commenter_a":"If u don't like the laws, move No one is keeping u here.","post_message":"Indiana legislative proposals: Washington florist to testify against LGBTQ protection bills"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"1357661384272094","commenter_b":"Good, go ahead and secede, build another wall.","commenter_a":"Who the hell cares?Let them go.","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump  Here's EXACTLY what would happen if they got their way!"},{"comment_id":"10152797676794753","commenter_b":"Typical female.","commenter_a":"He replies.. \" sorry Hun I forgot u said light toast not dark. My bad not happen again\" lol","post_message":"A solider at Fort Bragg in Fayetteville, North Carolina, tried to bring his wife a surprise breakfast in bed Friday morning, but things went terribly wrong."},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of  of the Caribbean, called  Men Tell No Tales.\""},{"comment_id":"10155567292775294","commenter_b":"She was making over $20 an hour..... This has nothing to do with wages","commenter_a":"If Walmart would pay decent wages this would not have happened","post_message":"The woman is accused of stealing from the Decatur, Texas store for more than a year, sometimes stealing thousands of dollars a day:"},{"comment_id":"10154346663693734","commenter_b":"Send this post to the wife's Lawyer. I'm sure the husband wouldn't put up with that if the rolls were reversed.","commenter_a":"This dude can't be serious😕😐😕.","post_message":"\"They need to learn to get along. If they love me the way they say they do, they will learn how to coexist in peace. That's not asking much.\""}]
