[{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10155464827050354","commenter_b":"Crazy ass bitch.","commenter_a":"Ms. Warren needs to look into the eyes of the youngest victim and then advocate against the death penalty. And then go to the other families that lost loved ones or lost limbs and time. That dear little boy didn't have the chance to live and she wants that piece of sh*t to live a long life.","post_message":"Liberal values..."},{"comment_id":"10153940708678690","commenter_b":"@haider ali what if bangalese ask the same about our PM or army chief then will you welcome their comment ? mind your own business,they are still better than us,we destroy our country on Islam but they dont want wahabi islam in Bangladesh....if our ISI stop exporting terrorism & wahabism to other countries,no one will blame us.","commenter_a":"Bangladash should change their pm. Hassena is worse lady i ever seen.","post_message":"Police said the seven men are linked with the banned armed group Jamaat-ul-Mujahideen Bangladesh.  The JMB members fought back as police raided the building, tossing a grenade at the security forces, but there were no reports of any injuries."},{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"1676343909290795","commenter_b":"I wish these other stories would come out! I read another one about a guy she accused of hacking her account and he said he would pass on all his emails etc to Trumps campaign guys lawyer. I think this chick is unbalanced and has issues","commenter_a":"You idjits are just gonna love the hell out of it when we burn this BS Republican party to the ground if a hijacking takes place at the convention in Cleveland. Tired of this party bending over and letting Obama drive deep, then talk about conservative values during the election. If Hillary wins this, look in the mirror. #TRUMP2016.","post_message":"\"We saw libel, defamation, slander, smearing of her reputation, simply for trying to do her job,\" Katie Pavlich said. \"This isn't just about simply one reporter. It's a bigger issue of the role of the press in America.\""},{"comment_id":"10152457331185736","commenter_b":"@username try FUCKING OFF!","commenter_a":"143 year old coins and documents where buried in 1795? Something doesn't smell right.","post_message":"The time capsule buried by Paul Revere in 1795 has finally been opened and the contents date back to 1652.  Mobile: @webpagelink"}]
