[{"comment_id":"10152853316636051","commenter_b":"i am with william ship all the illegal immigrants back were they belong and out of here let them do it legally then the trash want make it \\\\","commenter_a":"Deport them all. No hearing, no delay! They broke the law, boot their butts out. Seal the boarders, with deadly force authorized.","post_message":"ICE just rounded up and arrested more than 2,000 immigrants over the course of a five-day operation."},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."},{"comment_id":"10154278341944062","commenter_b":"Personally, I believe the game should have been forfeited. Cheaters should not be the champs.","commenter_a":"Cheating is cheating. Get him out.","post_message":"A federal judge erased Tom Brady's four-game suspension - do you agree or disagree with his decision? Vote now..."},{"comment_id":"1361368557222876","commenter_b":"Toni, I never commented previously so I don't know what your delusion of reality is. Trump never banned all Muslims. My buddy Wayne Allen is very capable of comprehending what the fuck Trump said. He isn't an intellectually lacking derelict who has lost his way and found himself sucking Democratic titty. What Trump stated is that he would implement a vetting procedure to insure ISIS doesn't send men in with the hundred thousand other young refugees this piece of shit Democratic government is wanting to allow in. I fight for the people, brotha. Not the government. I protect this land we walk on from those who wish to impose radicalism here. Those people are our government. I am the mother fucker that will bleed on my home soil, for the real interest of our nation, not individual interests. As far as Native Americans suffering from our conquering; yeah, well, that's ...","commenter_a":"You people are the most ignorant people around. Your even more so then the Trump idiots. Leave these people alone. You should be more afraid of your neighbors. More Americans kill Americans then Muslims do. Watch the news.","post_message":"More than 20 people were stung by a swarm of bees outside a mosque in Phoenix, Arizona."},{"comment_id":"704711463000234","commenter_b":"Time to take her out of her tower.","commenter_a":"Nice job with Bill","post_message":"“I have a lot of experience dealing with men who sometimes get off the reservation in the way they behave and how they speak,” Hillary Clinton said."},{"comment_id":"10152950210572169","commenter_b":"Clearly this woman lost her remote control long ago","commenter_a":"I will be glad when he is gone","post_message":"Saying goodnight to stupid pet tricks, top 10 lists and David Letterman (From PBS NewsHour)"},{"comment_id":"10152715652847293","commenter_b":"Way to bury your head in the sand. Typical liberal","commenter_a":"we have chosen not to see the film because we don't support war/killing...either way, the good thing is it got people thinking/talking...or, at least, trying to talk/think...","post_message":"Regardless of what Bradley Cooper wants, his movie American Sniper has become political."}]
