[{"comment_id":"10154394102516336","commenter_b":"So true having spent tons of time over there for many years it has changed to be almost unrecognizable sad that my grandkids will never know how wonderful London and England was","commenter_a":"We are next. TRUMP will win.","post_message":"“I think that the British people have had it. They fear terrorism just as the American people fear terrorism.”   Bill O'Reilly breaks down #Brexit, saying it’s not about economics but rather immigration. @webpagelink"},{"comment_id":"10153709063006350","commenter_b":"I can't stand Matt Lauer -- he's too much of a liberal for me.","commenter_a":"Hope not trump !!!","post_message":"\"If I think for some reason it's not going to work, then I go back to my business,\" Donald J. Trump told Matt Lauer about whether he would drop out of the presidential race. \"There's no question about that.\""},{"comment_id":"862806877145701","commenter_b":"Well said @username well said. America was built on the backs of immigrants, the indigenous people were treated and still to this day treated worst than the Buffalo. I hear them cry about migrants coming across the border, when they themselves have no right to the land they call home.","commenter_a":"History will judge him to be one of the best presidents we have had. I hope in the near future we will be able to have another such president.","post_message":"We DEFINITELY have Pres. Obama's back. Do YOU?  Thanks to Roy Mark Ramdas and Being Liberal."},{"comment_id":"1033963386626709","commenter_b":"Please Kathy. Just run the Pap strip over your big mouth. Infected!!!","commenter_a":"Trust me Kathy........Nobody want to see your Ugly......Except maybe KILLARY!!!!","post_message":"Another classy remark from Kathy Griffin."},{"comment_id":"10156449945205354","commenter_b":"NOOOOOO! Stay there!","commenter_a":"Haha nah Texas is is good on that","post_message":"Obama's Hero, Ahmed \"Clock Boy\" Mohamed, Now Misses Texas!  “I want to go back to a place where everyone knows me.”"},{"comment_id":"676035105920401","commenter_b":"they wouldn't be happy with anything they are a bunch of animals and don't want peace all they care about is destruction send them back where they came from give them nothing","commenter_a":"Don't like it go home!","post_message":"Muslim refugees are refusing to go into the shelter, demand they be given apartments. If they are seeking safety from a war zone, they should be happy with a shelter. Do you think this demand is ridiculous?"},{"comment_id":"836801636436616","commenter_b":"Any one doing this should be around up put in jail and when it is time to get out they should be deported","commenter_a":"And those BASTARDS in DC want to bring in over @username in the next two years. HELL NO","post_message":"Broad daylight in Germany. Watch Muslim 'refugees' beat the crap out of this mom and daughter. Can you say, 'extended magazines?' @webpagelink"}]
