[{"comment_id":"1293729747316737","commenter_b":"God she's a rotten pos","commenter_a":"Oh stop the whining! Grow up. The people have spoken so move on!!","post_message":"Chelsea Handler and Sen. Barbara Boxer didn't hesitate to shed tears at the \"sexism\" of Trump's victory."},{"comment_id":"10155084835104203","commenter_b":"Has she tried cbd oil?","commenter_a":"My mom who has stage 4 cancer... Tried juicing for almost a year, cutting out eating \"real\" food almost all together... Ended up doing more damage to her gut than good. Bodies are made to eat food and not meant to get over loaded with vitamins and nuetrints from juicing 40 carrots. I think in small doses it can be beneficial but not as a replacement","post_message":"Even in Trump's America, juicing is still awful."},{"comment_id":"1263988416963489","commenter_b":"@username yes it means no crime was committed. It means she's innocent of any wrongdoing. This is America.","commenter_a":"Did they fit her for her orange jumpsuit yet? A woman in the White House is just a novelty. Wake up America! She is a criminal!!","post_message":"“The other day, Mr. Trump accused me of playing the ‘woman card’…”  WATCH: During her victory speech tonight, Hillary Clinton turned her attention to Donald J. Trump and Republican talking points."},{"comment_id":"10153448946523984","commenter_b":"We have a process for people to come this country and become citizens. These illegals should should not be put ahead of the people who are doing it the legal way.","commenter_a":"I'm not a crook","post_message":"Barack Obama’s bad week just got even worse...  Are you glad to see this happen?"},{"comment_id":"1238637239481907","commenter_b":"ugly ungrateful woman -","commenter_a":"He better say that. Else Lady Chewbacca would beat his ass.","post_message":"Michelle Obama just brought down the house with a passionate speech at the Democratic convention. It's safe to say President Obama was a fan of it:"},{"comment_id":"2049944575230110","commenter_b":"Should have Shot those idiots","commenter_a":"Awwww poor police. .. terrible. . They r great people who never ever do any wrong. . I wish I could be sad for that mf... but I'm not","post_message":"OFFICER ASSAULT: A crowd watched as 2 people became entangled with an officer. Those 2 face charges after this video surfaced.   STORY: @webpagelink"},{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"}]
