[{"comment_id":"10157371541105231","commenter_b":"But they pay for it smh","commenter_a":"Sorry but if she was white I would still find this inappropriate. For me it has absolutely nothing to do with the color of her skin or the shape of her body as a human resources manager I have had to have many a talk with white, brown, and black women regarding their inappropriate attire. That's what dress codes in the workplace are for. FYI men also come to work in inappropriate attire. They tend to dress sloppy, they don't bath, and when they think they're sexy they tend to show us way more than we want to see. So it works both ways.","post_message":"It isn't the clothes they have an issue with."},{"comment_id":"10154766887574199","commenter_b":"What's his out of state criminal history? 50k for even felony Malicious Mischief is absurd. He's got no in state history.","commenter_a":"they got me y'all i should have never came down","post_message":"Prosecution had asked for court to set $100,000 bail; judge set it at $50,000"},{"comment_id":"10153155195841323","commenter_b":"It's dangerous to be right when the government is wrong. -Voltaire","commenter_a":"reminds me of the USA..","post_message":"Inside B’Tselem, the Israeli human rights group accused of treason for documenting the violations of its own government."},{"comment_id":"10156096512215725","commenter_b":"NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN","commenter_a":"NNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN","post_message":"Thank you New Hampshire! Together we will #MakeAmericaGreatAgain !"},{"comment_id":"10156418277360354","commenter_b":"Hey Rhonda! Cool last name!","commenter_a":"Which is exactly why Obama wants our guns...So we CAN'T take them out.","post_message":"This is slated to air tonight on \"60 Minutes,\" and it's going to INFURIATE liberals..."},{"comment_id":"10154840376458812","commenter_b":"Yes sir he is.... Charmayne E bradley it saddens me so much to see baby's getting killed for nothing...i will continue to pray for them u and I . I often wonder what this world would be if everybody get together and love one another and stop with all the violence n hate","commenter_a":"Lord Jesus Christ our world is in dire need of ur help Jesus Christ plz help us all this world is beginning to all apart we don't know who to trust people are turning on each other and lord we don't know why r where all this hatred is coming from plz lord take care of all of us show us to love n trust n help one another the world is big enough for us all.respect love n in god we trust.....","post_message":"Video shows Syrian girl rescued from rubble after airstrike on east Aleppo neighborhood that killed at least 23 people, including 16 members of the girl’s family, activists say. @webpagelink"},{"comment_id":"10154365677768008","commenter_b":"I just hope she don't hide when she delivers.","commenter_a":"Your Holiness, thank you for all you do for the world if you are watching!","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"}]
