[{"comment_id":"1018456324917286","commenter_b":"It's not Trumps place to judge. Isn't that what the gays and muslims are always complaining about?","commenter_a":"I can hardly believe that I even watched that whole segment on The Last Word With Lawrence O'Donnell.","post_message":"Donald Trump lets a supporter calling President Obama a Muslim slide."},{"comment_id":"1189675974461986","commenter_b":"@username she will not loose","commenter_a":"The real problem is Bernie Sanders is NOT a democrat! No wonder he and democrats are having a problem. He should have run on his own party-- as the socialist he is.","post_message":"It's not just the Republican Party that seems to be having a problem uniting..."},{"comment_id":"10153183200188812","commenter_b":"They want marijuana sellers to be kept on jail for the lesson to make sure that they won't save lives of people who needs it, so more people can rely on prescription pills... There are cruel rich doctors out there who would pay the cops for good amount of money to keep their business running. Money ruins everything.. 55 years is too much. Child rapist should spend 55 years, not marijuana sellers. People sell drugs to provide for their families. Not everyone do it to get rich for themselves. Low income families has it harder when providing family because of health issues.. Some marijuana sellers could be good people too, it is just unfair to put them in jail for 55 years. How ironic that McDonald and other fast food chain restaurants sells junk food that can harm a lot of people while marijuana harms less people... But they can ...","commenter_a":"Those that advocate for and enforce these cruelties are the real criminals.","post_message":"“We have escalated punishments to the point that it’s crazy…\" -- The cost of a 55-year sentence for marijuana: @webpagelink - Tonight on Nightline"},{"comment_id":"10154566492298812","commenter_b":"@username you keep drinking the kool-aid","commenter_a":"If you can't emotionally tolerate a black man reaching for his ID and you pee your pants like a 9 year old girl scout, and you shoot him without ever seeing a gun, it's time for you to take off the police uniform and get a job where you will not be harmful to human beings and to society.","post_message":"Pres. Barack Obama: Attacking police officers, even rhetorically, does \"disservice to the cause\" of criminal justice reform. @webpagelink"},{"comment_id":"10154156199607235","commenter_b":"Seriously? WTF?","commenter_a":"William Kenneth Dockery","post_message":"WHAT."},{"comment_id":"1754592891449959","commenter_b":"@username totally 💞","commenter_a":"@username 💖👻💖","post_message":"It's literally the most magical thing of all time, Harry Potter fans."},{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"}]
