[{"comment_id":"10153492553852869","commenter_b":"Nope!","commenter_a":"Amen thanks to Obama. He rewarded themg for 9 11","post_message":""},{"comment_id":"1281953805157000","commenter_b":"Fuck Obama and his white trash skank bitch Hillary","commenter_a":"Our wonderful President, sorry to see you and your family go.","post_message":"President Obama has been known to break into song from time to time..."},{"comment_id":"10153233251546350","commenter_b":"No she don't she is a young hoe. Celine is why better the Ariana Grande","commenter_a":"I don't think so! Her voice lacks the richness of Celine's.","post_message":"Ariana Grande's impression of Celine Dion is spot on!"},{"comment_id":"439739816151059","commenter_b":"Last election, I voted democrat, for the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the election before that one, though, I voted republican, for the democrats had pissed me off. In the election before that one, though, I voted democrat, because the republicans had pissed me off. In the ...","commenter_a":"Why the fuck is UW Cali giving her money? Naughty naughty.","post_message":"Three of her top political donors are Goldman Sachs, Citigroup and JP Morgan. Is there anyone left that still believes the shit politicians say?"},{"comment_id":"10153248545727217","commenter_b":"The smog isn't real. It's just a liberal conspiracy. Keep on polluting.","commenter_a":"And yet wherever they go they reply their failure productive system: massive production and consumption with no protection of the environment....","post_message":"Smog \"red alert\" in Beijing"},{"comment_id":"10153240911786491","commenter_b":"Women spend 25 percent of their lives menstruating. That is the biggest reason we spend more time in the bathroom.","commenter_a":"The only way to have bathroom equality is for women's toilets to have the same turnover rate of women coming out of the bathroom as men. Just because it's the same physical size restroom doesn't mean it's an equal situation.","post_message":"\"Many public restrooms continue to be facilities that are equal in physical space, while favoring men’s bodies, experiences, and needs.\""},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now.  ~tiff  via Occupy Democrats"}]
