[{"comment_id":"10155026545836337","commenter_b":"Not the worse but close.","commenter_a":"Chuck is on point","post_message":"WOW. Charles Barkley torched the entire NBA..."},{"comment_id":"10153181342983812","commenter_b":"I do agree not to go looking for trouble. Often times, ya get more than ya bargained for ;)","commenter_a":"You can not go looking for trouble, find it, then decide you don't want said trouble. Its already too late!","post_message":"Relatives held a candlelight vigil to honor the life of Tammy Meyers. @webpagelink"},{"comment_id":"10156071527715354","commenter_b":"@username... we are talking about illegal aliens. Not the Mexican race. You should set yourself on fire -","commenter_a":"then you go ahead Ricky and pay for all the welfare benefits, health insur, food stamps, free college tuition (Dream Act) for ALLLLL the illegals pouring into the country. Cause we cannot keep paying for all this under the radical liberal orders--the pot has run out--this is why we SCREAM and beg for a man like Donald J. Trump to stop all this madness.","post_message":"BEHOLD, America!   One of liberalism's finest minds--a political Zeus!--hath spoken!   #Livin’LaVidaLoca"},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"554155158094381","commenter_b":"Christie is killing ittonote! I'mactually a Cruz supporter. Sorry Ms. Pendleton but u cant have 15 people on the stage and get anything worthwhile discussed. I like Mrs. Fiorina,I think she is brilliant, but she didnt get enough supporters. Sorry for that cause I think she would be a great first woman president. However, we have to end with an electable candidate that will beat the demo candidate, cause we dont need another Obama presidency. Electing Clinton would be electing another Obama.","commenter_a":"ABC is doing a horrible job of not including Ben Carson in any of the debate questions since the question of Senator Cruz cheating him out of votes in Iowa.","post_message":"WATCH LIVE: Republican presidential candidates face off in the ABC News #GOPDebate in New Hampshire. Watch all of our debate coverage right here! @webpagelink"},{"comment_id":"1100002276704629","commenter_b":"Whats more important to the RNC? Having Hilary as President or winnning the Presidency with. Trump, a Republican. They need to listen to the people .","commenter_a":"This would most certainly put Hillary Clinton in as first female pres.","post_message":"Should Romney run as an Independent against Trump and Clinton?"},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."}]
