[{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood?   Check out what he told supporters...."},{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"1096976973728618","commenter_b":"No! You think this is a country of racism then take your black brethren with you and YOU all move out. You own colour sold and brought you here, stop acting like everyone else owes you something.","commenter_a":"Why?? Why would you tarnish your gold!! The first black woman and you trash your chance to be a roll model and a proud American! Wtf is wrong with you! You just ruined your chance at becoming everything I wished for you! You Dumb bitch!!!","post_message":"I can't even anymore with this garbage..."},{"comment_id":"10153203365116615","commenter_b":"your right she shouldn't be. she should be just shot!","commenter_a":"Good. She shouldn't be.","post_message":"Her baby was just hours old and still had his umbilical cord when he was found by a church custodian who heard him crying."},{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be \"rebooted,\" in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"1281596298596888","commenter_b":"I physically couldn't go eaither. But we can still stand in solidarity on social media. #IBiteGrabbers #MyVaginaMyRules #NastyWomenUnite","commenter_a":"Not starting a fight here, you right I'm old the same age as Madonna but just never followed her. I wish I had gone. What a great way for women to express themselves. Sorry no harm intended","post_message":"LIVE VIDEO: More than 500K are downtown at a rally for the Women's March on Washington MORE: @webpagelink"}]
