[{"comment_id":"607266949431150","commenter_b":"You are So Right. Walter Biscardi Jr","commenter_a":"Wow, that is a match made in heaven. Just when you thought it couldn't get any worse than McCain / Palin, the Republican Party proves us all wrong again......","post_message":"Just in: Ted Cruz will name Carly Fiorina as his vice presidential running mate, according to two sources."},{"comment_id":"951265721580953","commenter_b":"She's is a fat suit. Skinny is the new fat","commenter_a":"The air brusher worked overtime on these pics.","post_message":"Model Ashley Graham has been incredibly vocal about seeing more diverse body types in the media, and she's made huge strides with this Sports Illustrated ad."},{"comment_id":"1384915431551722","commenter_b":"Sorry dear i said this woman is really DISGUSTING ohh","commenter_a":"is she speaking from experience?","post_message":""},{"comment_id":"1021313581261452","commenter_b":"Nasty bitch","commenter_a":"I hate to admit it but Fiorina is right, maybe the first time in her life, but........","post_message":"Haha, it's true though"},{"comment_id":"10154548445633854","commenter_b":"OMG when will the lame lies end???? I'm highly offended that she thinks that we're ALL that stupid!!!!","commenter_a":"If she didn't remember taking required security training, how in the heck would she be able to know what (c) stood for? and how can she be qualified to be POTUS?","post_message":"She thought it had to do with alphabetizing emails. And she thinks she is fit to lead?! 😂"},{"comment_id":"583491245168645","commenter_b":"Yup @username, same old Hillary, will say Anything. Flippity Flopping as usual.","commenter_a":"Well Hillary Wallstreet Clinton, your group phot does Not contain any Important popular opinions!! Now on to a question for you. If Nothing to hide regarding your emails, why would you destroy evidence after a Subpoena? Why did You lie to Congress and the FBI? Why did your aides plead the 5th? Why did some of your aides receive Immunity? Why did you recently Under Oath answer 21 questions with,(I Don't Recall ), and other questions with,( I Object) ? These Issues are VERY CONCERNING, and you're Ignoring these!!","post_message":"Nobody knows better than these five people what it means to be president—and not a single one of them believes Donald Trump has what it takes to do the job."},{"comment_id":"10154803767550579","commenter_b":"Gary Johnson is scary and just as much a risk as any of them.","commenter_a":"Protect your Rights and Freedom, vote Libertarian Party, Gary Johnson and Bill Weld. 🔔 Give Freedom, Liberty and Justice a chance for a change! 🔔 Visit the FEELING THE JOHNSON Facebook page and give them a LIKE. Break the corrupt two-party system we're trapped in.","post_message":"CLIP: Donald J. Trump and Hillary Clinton debate the economy during the first presidential debate. Watch full video here: @webpagelink"}]
