[{"comment_id":"1823601691207734","commenter_b":"Share it with everyone, we must insure Hillary is not elected!","commenter_a":"\"BILL CLINTON'S LOVING WIFE --- by DICK MORRIS If you happen to see the Bill Clinton five minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware as I was there for most of their presidency and know them better than just about anyone. I offer a few corrections: Bill says: \"In law school Hillary worked on legal services for the poor.\" Facts are: Hillary's main extra-curricular activity in 'Law School' was helping the Black Panthers, on trial in Connecticut for torturing and killing a 'Federal Agent.' She went to Court every day as part of a Law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a Children's rights project for poor kids.\" Facts are: Hillary interned ...","post_message":"He actually said it."},{"comment_id":"544743005709397","commenter_b":"@username go play in you sand box.","commenter_a":"You Trumpeters are rotten to the core to attack a decent man like @username like this. For shame. I supposed flies are attracted to stinking matter, so what else would we expect.","post_message":"Republicans, this is your party. You have to decide who you are. Are you a collection of principles, or are you about a man?"},{"comment_id":"10153785606781636","commenter_b":"@username it is illegal for a felon to be around a gun. Which means a felon shouldn't ever enter a gun range or be able to rent a gun!!!","commenter_a":"So wait?? You can just walk into a gun range and with no background check just \"rent\" a gun? How does the gun range owner know that a person is legally able to possess a gun? How do they know the person isn't a felon or barred from possessing a gun??? Wth?","post_message":"Authorities say the gun range owner had no indication the man was suicidal."},{"comment_id":"10153147185484342","commenter_b":"Bruce Jenner is a woman, this lady is black, and I'm a billionaire.","commenter_a":"Since she was 5? Then this just didn't happen since she entered into adulthood. She had a identity problem since she was a kid and I blame her parents on that because they should've noticed it way back then. To all you parents out there who have little kids, pay more attention to your kids.","post_message":"\"I was drawing self-portraits with the brown crayon instead of the peach crayon.\"  #RachelDolezal has broken her silence, saying she started identifying herself as black around the age of 5."},{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"10153003498236051","commenter_b":"He can be somebodys bitch in jail!","commenter_a":"Hang the SOB!","post_message":"This guy picked up a big concrete block and threw it. It landed right on a 7-month-old girl's head."},{"comment_id":"1131610686905195","commenter_b":"@username back your claims up with citations and credible sources! @webpagelink","commenter_a":"Bernie says it best, \"You've got some middle class people working longer hours for lower wages -- they pay their taxes, they support their schools, they support their infrastructure, they support the military. But the billionaires? No, they don't have to do that, because they have their friends on Capitol Hill. They pay zero in taxes. So Trump goes around and says, 'Hey, I'm worth billions, I'm a successful businessman. But I don't pay any taxes. But you, you make $15 an hour? You pay the taxes, not me,'\" he said. \"That is why people are angry and want real change in this country.\"","post_message":"Millions of Americans work hard and pay their taxes. So why doesn't Donald Trump pay his?"}]
