[{"comment_id":"1708394149424069","commenter_b":"@username these people spoke in opposition to Trump's Muslim ban by indicating that Muslims are not all terrorists just like all Republicans are not all terrorists. By the way you know the US will never enforce a religious test for immigration NOR will be build a big beautiful wall....that Mexico will pay for :)","commenter_a":"What a wonderfully empathetic understanding and patriotic party the GOP followers now seem to be..to actually disparage this woman is one of the worst things ever...what in the hell is the matter with ALL of these inhuman people?","post_message":"The mother of a service member asked Mike Pence why he continues to stand by Donald J. Trump after his comments about the Khan family.   Many Trump supporters at the rally did not take kindly to her question.  Coverage: @webpagelink"},{"comment_id":"911159142284175","commenter_b":"Wtf! Lmao dumb bitch","commenter_a":"@username @username 😂","post_message":"SMH"},{"comment_id":"10154362826911323","commenter_b":"In Bulgaria women sunbathe topless. Older women, too. At first it seemed a bit strange to me, then I thought \"Oh well, if a 60 year old can do that, I can, too\". That was when I stopped caring. As for underpants, not enough fabric, so I'll pass.","commenter_a":"Stupid debate. Why should it bother me how people sunbathe? I don't care if they are dressed, half naked or naked. Let everyone do what they are comfortable doing, it's not like you have to look.","post_message":"“It all depends on what type of underwear it is. If they had an Ann Summers crotchless type affair then that would be a touch odd.\""},{"comment_id":"516357545155952","commenter_b":"I'd be pissed,then sue everybody.Which I'm sure she'll do.","commenter_a":"How did they get the right to determine her mental state?","post_message":"Via Filming Cops -- How would you feel if within 24 hours you go from being a successful corporate executive to being forced to become a patient at a mental ward, stripped naked, where no one believes you? It feels straight out of a psycho thriller, but this is what cops did to her."},{"comment_id":"10157736489990603","commenter_b":"Omg I think it's funny that 12 year olds got onto their parent's Facebook and are saying things like lick my butthole. Classy.","commenter_a":"Wow I knew the average Missourian was dumb but I didn't realize they had a fetish for shooting themselves in both feet.","post_message":"JUST IN: CBS News projects Donald J. Trump will win #Missouri."},{"comment_id":"10154623133343812","commenter_b":"maybe you cheat a wife","commenter_a":"Bill stated how wonderful a wife Hillary is...question...why did you have all those affairs then Bill???","post_message":"JUST IN: Tim Kaine officially wins the Democratic vice presidential nomination. @webpagelink"},{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."}]
