[{"comment_id":"994271287356316","commenter_b":"Hell no our government is so jacked in the head they need a 50 caliber hole there to straighten them out","commenter_a":"🖕🏿off your selfs in silence. how ignorant","post_message":"Would it be unchristian if I said in a Texas accent ... 'Eff them?' Help me. Your friend, Doug in Texas. @webpagelink"},{"comment_id":"10150870773554999","commenter_b":"@username. And you vote for a killer and a rapist!","commenter_a":"It's become pure entertainment. At this point he's a side show. His numbers are falling. His lies are outright ridiculous. Enjoy that long, long vacation.","post_message":"Donald J. Trump is sticking to his style, even if it meant taking \"a very, very nice long vacation\" after Nov. 8."},{"comment_id":"541211179416415","commenter_b":"hey Trump when you talk about the refugees, can you name every refugee groups that lives in the United States and what kind of jobs they have to work to feed their family and children? BTW, every refugees family's that moved to United States are helping out U.S. economy by working at those places where no white man can stand to work there, also they are paid with minimum wage without complaining. so be grateful and welcome them to come and live in the United States, especially the Karen refugee.","commenter_a":"Mr Trump the solution of the conflict between Israel and Palestinians can be very simple America and Europe should stop sending billions of dollars to Palestinians so the Palestinians know that when they get up in the morning if they want to eat they have to work and not killing the Jews!!","post_message":"We’re going to come together and come up with solutions- and so far I cannot believe how civil it’s been up here! #GOPDebate"},{"comment_id":"10154595808829445","commenter_b":"Pot head moms, guiding their children. What a joke ........","commenter_a":"Craig Roberts Me as a parent.","post_message":"This mom clearly thought it was high time for the kids to go back to school @webpagelink"},{"comment_id":"10155548661776509","commenter_b":"You are right, it isn't Trump supporters, this latest hidden Veritas video will give you a hint: @webpagelink","commenter_a":"I don't think it was Trump supporters who did this, everything is spelled correctly.","post_message":"Vandals set this black church ablaze and scrawled the words \"Vote Trump\" in crude, white spray paint. @webpagelink"},{"comment_id":"1056498011103708","commenter_b":"Build a wall and if they want to come into England charge them 1000 pound per day to enter","commenter_a":"If Westminster ? allows a second Scottish referendum then fine but along with there departure goes the and our submarine base etc you can't have your cake and eat it. ?","post_message":"The UK is crumbling"},{"comment_id":"10153480105418132","commenter_b":"Who gives a crap about her boobs. Let em hang out if she wants, or cover em up. They aren't your tits.","commenter_a":"Too much boobs","post_message":"What do you think of JWOWW's wedding gown?"}]
