[{"comment_id":"10154310787426130","commenter_b":"I'm very disappointed with Meg Ryan. She must be in the pocket.","commenter_a":"Actual, I think Richard Dreyfus won that one (see his tweet at the end of the article).","post_message":"Megyn Kelly set him straight."},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"1069898906439694","commenter_b":"Trump’s running out of nonwhite ethnics to demonize. And since he needs to keep interest piqued for his free media advertising to continue, I’ve thought of a few white demographics which would work for him: LGBT people are prime. Recently an evangelist speaker at a Ted Cruz related event called for the death penalty for them because the bible has passages calling for that. And there have been comments such as the one claiming that gays are responsible for most urban violent crime. Another is that they are trying to turn us all gay. So Trump could call for making anything but heterosex illegal. That should excite his base and get hyuge media coverage. Planned parenthood employees and doctors would be favorite victims. Trump could call for imprisonment of all PP employees and the death penalty for any doctor who has any abortions already on their record. They are totally ...","commenter_a":"\"He has not proven to be somebody that has a firm grasp of policy.\" Let alone reality.","post_message":"\"He has not proven to be somebody that has a firm grasp of policy.\"  - Jeremy Peters"},{"comment_id":"871781506248238","commenter_b":"one of the dumbest bitchs on TV","commenter_a":"VERY SIMPLE : The Nazi Swastika, was not invented by Hitler or the Germans. It was a Pre Egyptian and Egyptian emblem...It can also be found in Native American symbols. But Hitler and Nazi horror's exploited The Symbol ! The Confederate Flag, has much History and status. But, The KKK in the early 20 th century, hijacked this Flag, (Symbol) and carried out Murder, Lynching and Devastation to many in the South, and all over America ! Unfortunately, but accurately, these two SYMBOLS represent, Horror & Evil beyond most comprehension. Many perceive the Swastika as Evil, (When related to The Nazi Party, they're correct) & Many perceive the Confederate Flag as Evil, (When related to Racism, they're correct). What you perceive is how you believe.... Perception is Reality. Removal is just...Now what will Mississippi do ?","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10155007854069170","commenter_b":"Suck it up and move on lady","commenter_a":"this occurs when they go off their medication","post_message":"Enjoy this video. Watch it repeatedly. Savor it like a fine wine..."},{"comment_id":"1815605405326385","commenter_b":"CSI!!! That bitch bit me... great episode.","commenter_a":"Is no one concerned that she is really a giant lizard? #reptilian","post_message":"Is this an indicator that we really should be concerned with her health?"},{"comment_id":"1029959687044503","commenter_b":"But we DONT need Hillary Clinton.","commenter_a":"If republicans don't come around on immigration they are through.","post_message":"Hillary Clinton's aggressive and boldly progressive stance on immigration just wiped the floor with Republicans and their obstruction and xenophobia. This is..."}]
