[{"comment_id":"10157552769965725","commenter_b":"IF YOU SAW HANNITY'S TOWNHALL WITH MR. TRUMP TONIGHT- NO PARENT WOULD VOTE FOR KILLARY!! #BUILDTHATWALL!","commenter_a":"I mean that's true, but what are you going to do about that? I guess grow a garden, but then you can only harvest every year, maybe twice a year if you plant early","post_message":"Thank you TEXAS!  We are going to declare our independence from failures of the past and create a New American Future.   Once again, we will have a government of, by, and for the people. Americanism, not globalism, will be our credo."},{"comment_id":"659791487492443","commenter_b":"yes but he is treating America Badly, Screw him,","commenter_a":"Stop talking about obama, you shoul start building for the vets they deserve it, and you can do it Mr, Donny","post_message":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"comment_id":"10153770178735736","commenter_b":"Hillary is Hillary, not Bill. Duh!","commenter_a":"She should resign.","post_message":" Trump comments in 2005  11 years ago were made when he was a Democrat. The hypocrisy of Hillary Clinton to say Trump does not belong in the White House when her husband defined this behavior."},{"comment_id":"1113541475361229","commenter_b":"Killary is a delusional lying bitch","commenter_a":"No Trump was right on","post_message":"Clinton: \"Donald Trump spent his time attacking when he should have been apologizing\" at the debate. Agree or disagree?"},{"comment_id":"10154506345988188","commenter_b":"1) Trump and Soros spent Christmas together in 2009 2) Soros funded Trump Towers, using a mezzanine loan 3) Soros and Trump were co-defenders in the same lawsuit. @webpagelink Trump Pals Around with George Soros The similarities between two billionaires from (allegedly) different sides of the aisle. conservativereview.com","commenter_a":"So why are you saying a Soros backed candidate is better and safer then Trump?","post_message":"We dissected this story on radio today. Listen here: @webpagelink"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"10154862137916756","commenter_b":"Yes, It's sad to see our Democracy gone to Totalitarianism. We're ruled by the subversive evil Corperations who War on terror was a scam. More honestly put it was WAR to produce terrorist so Corperations could exploit, kill and take down America itself by stripping freedoms as the Patriot act does and by spending the majority of monies on WAR. Now the Red Scare if being probigated by the Democreeps","commenter_a":"I'm stressed about the ugliness that this election has revealed in my fellow Americans. It is disgusting and frightening.","post_message":"Are you?"}]
