[{"comment_id":"630472157108961","commenter_b":"@username you too bitch","commenter_a":"This is not a man.........he's a crazy kid........wanting notarization. Why not go after Obama who continues to destroy our country and it's citizens!","post_message":"Here is the man who tried to kill Donald Trump yesterday:"},{"comment_id":"10153523927041162","commenter_b":"Go marry him.","commenter_a":"I need the money to get out of debt Lord help me omg","post_message":"BIG WIN! A suburban man who likes to play the newest games bought a Golden Casino instant ticket and won $4 million. @webpagelink"},{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"967270790032642","commenter_b":"You plutocratic blithering batch of flabbergasted infidels have the combined iq of less than one dead skin cell from the shmuck of @username's majestic penis post-circumcision and he in his infinite wisdom has confirmed that over 50% of all American penises have regressed so far due to their sheeple tendencies that they are considered vaginas by anatomists everywhere","commenter_a":"According to experts in the field of computer science the most logical, and therefore most correct, outcome would be for us to all vote Republican in the next election, the obvious pattern must be continued. Humans are not capable of conscious thought (especially not Americans) and must therefore follow trends like the herd animals they are.","post_message":"The jobs numbers say it ALL.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153150337159607","commenter_b":"He didn't live there 6 years. Stop believing everything you read, or make up in your head. Respect his family and friends right now and stop thinking this was a conspiracy","commenter_a":"Police did it he was going to expose the police for the dirty","post_message":"A Baltimore City police officer was found facedown in the water in South Baltimore Tuesday night. Officer Prashanth Davis, 34, was pronounced deceased at the scene."},{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"}]
