[{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"10153246182423188","commenter_b":"She allowed her cheeks to hang out. This woman POSTED this video to YouTube. They clearly received the attention that they were seeking.","commenter_a":"Michael shouldn't have posted a pic that shows a woman's butt cheeks hanging out, @username. I'm surprised as a Christian you condone this.","post_message":"My wife and I are laying in bed talking about this non sense with Michael Bublé and she pulled up something a girlfriend sent to her.  Holy cow!  Some people are just Shoot milk through your nose funny without trying.  Look out.  What follows makes Michael's butt cheek photo look like a bible pic.  Excuse the title on youtube.  No profanity on vid.  @webpagelink"},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."},{"comment_id":"698051370361332","commenter_b":"13th amendment, 14th amendment , 15th amendment. How many democrats wanted to abolish slaves, give citizenship to freed slaves ,and allow black to votes. And how many republicans wanted that. We can start there.","commenter_a":"@username @username learn from this man. Love you ladies","post_message":"Standing up for his beliefs!"},{"comment_id":"910223922377697","commenter_b":"She a hoe messing with all them porch monkeys","commenter_a":"Narsha Gafar HAHAHAHHAHAHAHAH","post_message":"Before & After"},{"comment_id":"10153357415706782","commenter_b":"They should all be illegal They cause cancer.","commenter_a":"Waste of time and money","post_message":"Lawmakers passed a tanning bed bill through a committee Monday. The bill would make it against the law for anyone under 18 to use a tanning bed.  What do you think of the bill?"},{"comment_id":"702885809874123","commenter_b":"Just as ugly as she is!","commenter_a":"Very ugly dress looks likes she's wearing a curtains.","post_message":"It caught everyone's attention because..."}]
