[{"comment_id":"1750245355240943","commenter_b":"While the twins are cute. How's this building the black community? She is in dishonor. She dishonors her ancestors.","commenter_a":"See what happens when we come together as a people? We produce beauty!","post_message":"These cuties went viral after their emotional discovery of their age difference. Now, we get to meet the adorable #McClureTwins & their parents!"},{"comment_id":"1651334078420186","commenter_b":"Disgusting Banker Thugs.","commenter_a":"cowards shouldn't be cops","post_message":"The woman's vehicle was clearly functionally disabled, but that didn't stop these cops from \"fearing for their lives\". The most disturbing part about it; the cops seemed to enjoy executing her.  Story/Video here: bit.ly/1HARM4N"},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"10154258847492014","commenter_b":"Go ahead and lose money for a day. It don't prove we need illegal's coming here, not when Americans of all colors need a job and are living on the street. Before some moron says something stupid, yes there is Americans that will do the jobs illegals are doing for les money.","commenter_a":"Isn't it illegal to employ illegal immigrants? You are not paying taxes for those employees right? The people Trump wants deported are Criminals! Are those the employees you have working for you? Why don't we work together to find a way to get the immigrants who want to become American citizens and follow our laws a way to do that, like most of our grand and great grand parents did.","post_message":"\"It's snowballing into something huge and is sending a message about the importance of immigrants to the economy\""},{"comment_id":"10153080456176051","commenter_b":"Feral pigs are a huge problem in this country.","commenter_a":"I am NOT a liberal, and do not believe in hunting for sport! Why do people who hunt, feel the need to post morbid pictures of \"their kill\" Is it to prove something?! Not many people want to see that!!","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10153542134849753","commenter_b":"She needs to get away from his crazy abusive ass!","commenter_a":"Lmfao fuck her and he a dick for doing it","post_message":"A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"},{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"}]
