[{"comment_id":"10153395061888690","commenter_b":"Saudi is bad for woman, Iran is worst. Pakistan is the best Muslim country for Muslim woman.","commenter_a":"Iranian cancerous mullah regime needs to be removed surgically.they are biggest violators of human rights.","post_message":"Prominent Iranian activist \"forcibly arrested\" by security forces in Tehran @webpagelink"},{"comment_id":"10153953664426509","commenter_b":"They will invade us with mountain goats!","commenter_a":"@username so scared ..lmao","post_message":"North Korea threatened the U.S. with attack if military exercises are conducted as planned. Get details here: @webpagelink"},{"comment_id":"10153236648136167","commenter_b":"Pretty sure that Mika just","commenter_a":"MSNBC is such an embarrassment to itself.","post_message":"Hours after MSNBC itself reported that this lie was debunked, Joe Scarborough was still pushing it."},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem  and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic  by going straight to the source.  Get the full experience at mic.com/enough"},{"comment_id":"10152921412801051","commenter_b":"You go girl.only someone with a shallow mind and no heart would think such sick thoughts.fckn perverts.","commenter_a":"This woman is awesome! ^_^ <3","post_message":"When this woman saw a hungry baby animal, she decided there was only one thing to do: breastfeed it."},{"comment_id":"611608348972347","commenter_b":"You just broke the Internet with that post!!!! Lmao! I DESPISE HER! And her INNER GODDESS! Freakin lunatic!","commenter_a":"Just seeing Oprah made me want to take a dump.","post_message":"Absolutely brilliant write up."},{"comment_id":"1051602538269331","commenter_b":"STFU!","commenter_a":"Obama is one of them! The blood of those in Paris rests on him. \"The greatest threat is global warming....\" Obama caused those deaths in Paris.","post_message":"UPDATE"}]
