[{"comment_id":"10153377279001756","commenter_b":"It's not just women. I had to go to the ER with a legit panic attack and they accused me of being on cocaine.","commenter_a":"A medical professional assuming that a woman is having a panic attack instead of a real problem? Shocking!","post_message":"Often, doctors reinforced women's fears of pulling a false alarm, automatically assuming that those with heart attack symptoms were suffering from indigestion, or maybe a panic attack."},{"comment_id":"665987530270126","commenter_b":"Don't forget though we will have to build an impervious penetrating wall around California to keep them there!","commenter_a":"So how about where ever the idiot pelosi lives at, lets make the area around her house and city a sanctuary city and move the unvetted refuges there. Put your monry where your mouth is wacko!","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"10153871783832232","commenter_b":"Stop being such a witch","commenter_a":"Why would a news encourage this stupid behavior there has to be more important news for them to be reporting on","post_message":"We don't recommend this, but the boys swim team from Hatboro Horsham found a new way to practice. Thanks to NBC10 viewer Kimberly McPoyle for sharing! Stay with NBC10 for full coverage of #Blizzard2016. --> @webpagelink"},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for \"wanting to take her guns away\":  \"A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"10154728095336336","commenter_b":"If it was a girl ,she may have gone home with a hook up","commenter_a":"This is awesome! I would eat at Original Joes if they had one in my town! Kudos to the woman who chose to get a ride home instead of driving!","post_message":"After deciding to take an Uber home, she returned to her car the next morning and found quite the surprise."},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""}]
