[{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153684998979228","commenter_b":"Crime has gotten out of hand?? Thank you Captain Obvious.","commenter_a":"Should have been in Chicago to make St. Louis feel safe.","post_message":"St. Louis Mayor Francis Slay says crime in the City of St. Louis has gotten out of hand."},{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"\"[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,\" said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"1063632813696466","commenter_b":"Lol its the food colouring haha I wana try one of those, they're in Japan aren't they? X","commenter_a":"@username fancy a green poo? x","post_message":"This is gross Burger King"},{"comment_id":"10155084473033984","commenter_b":"@username yes you are.... it's never enough for you people never enough","commenter_a":"Okay, this is absolutely disgusting and I am appalled by the behavior of these CRIMINALS, but I did not see this much coverage or outrage when those WHITE teen males abused then raped the black handicapped teen with a metal hanger, causing permanent damage to him internally... they were let off the hook by the way. Charges dropped... media barely covered it and there were even people who made jokes about it or defended the white teens... so next time one of you white people wants to cry how white privilege is not real or how the media ignores black on white crimes, think again. These black teens are getting the punishment they deserve while the white teens (that did worse as they caused physically permanent damage) are out and about, as if nothing happened. DISGUSTING","post_message":"This is just sickening and heartbreaking at the same time. We just found out 1 key fact about the relationship between the disabled teen and one of his torturers... and it's absolutely shocking.  Who could be this EVIL?"},{"comment_id":"10155312985958132","commenter_b":"They are at 20.. they adopted a relatives child.","commenter_a":"@username are they your Laredo neighbors lol","post_message":"Jinger is the first member of the Duggar family to permanently relocate."},{"comment_id":"10153349077816051","commenter_b":"I don't care if she black or white or Asian or Hispanic welfare queen trash should have her insides ripped out or kicked off the system sink or swim","commenter_a":"60 000 for 12 kids!!!! That's borderline poverty! Why are people making a big deal out of this.","post_message":"This mom of 12 gets more than $60,000 per year in benefits. And that's not the worst of it."}]
