[{"comment_id":"895076240539004","commenter_b":"Angela and Sheira close your fucking legs, Whores!!!!!!!!","commenter_a":"Unborn Baby's are Human at the time of conception.....Duh.....that's not hard to figure out. When you abort AKA MURDER a Baby at any time after conception it is very simple.....IT'S MURDER.....just watch our Court system when a drunk kills a pregnant woman they will be charged with the MURDER of the child as well. There are just some people that will argue against the facts to try to justify MURDER but make NO MISTAKE it's MURDER. Just because you get pregnant and it's inconvenient and you call it abortion, does not change the fact everyone knows in their heart IT'S MURDER.","post_message":"How cool is this?"},{"comment_id":"10152676040812293","commenter_b":"Really beautiful","commenter_a":"What ever you do . don't feed your mule a carrot ...He or she won't leave you alone. We had BLAST.","post_message":"The full, panoramic view is breathtaking."},{"comment_id":"458794547627679","commenter_b":"Hillary is not worthy of being president. Why would a progressive vote for her?","commenter_a":"These Sanders supporters that would rather see a Trump presidency were never Bernie supporters, they were Hillary haters. Any progressive ideas or policies would be set back decades with a Trump presidency. Not to mention how far back we would be set back with a conservative tilted SCOTUS. It is a sad day for this country. Donald Trump is going to be the next president. God help us all.","post_message":"Trump is in the lead? This is terrifying."},{"comment_id":"1111727715607435","commenter_b":"sick woman in many ways and not to be respected!!","commenter_a":"Clinton stood tall and showed she was someone to be respected, unlike the baby bully who consistently showed his ignorance and called name likes like a third grader.","post_message":"The final presidential debate is in the books. Which candidate made the best case for themselves: Trump or Clinton?"},{"comment_id":"10154423071206336","commenter_b":"Was she deserves to do is pull her name off the ballot and put yourself in Sing Sing for 25 years","commenter_a":"I wouldn't want it anyway. It would not be sincere.","post_message":"Question Of The Day: Does Hillary Clinton owe the American people an apology for lying about her server scandal? #Hannity"},{"comment_id":"1119954238024715","commenter_b":"I'm for Trump! Politicians are afraid they will not get to keep lining their pockets if we vote OUT the good for nothing's. All they seem to do while in office is keep running for office. Raising taxes. They have good insurance. Do most of the people??They don't care about the American people! Let's get rid of them. Let's break up the good ol boys club!","commenter_a":"Trump Trump Trump! All the way!!!!!","post_message":""},{"comment_id":"493705967486650","commenter_b":"She should be in prison anyway!","commenter_a":"Finally justice might be done!","post_message":"Hillary's career could be over after she was exposed doing this.  Good. Let's end it right here, right now, once and for all.  Do you agree Hillary Clinton should be relieved of her duties?"}]
