[{"comment_id":"10153405102629255","commenter_b":"Josh Duggar,Dennis Hastert,who's next.. Gawd let it be Ted Cruz!","commenter_a":"I think he's another Sandusky","post_message":"This scandal is getting dark—fast."},{"comment_id":"10152774422166051","commenter_b":"Why are some people allowed to have kids??","commenter_a":"Please, can we eliminate these sh*tbags from the gene pool?","post_message":"Police found this 3-year-old boy sitting in the backseat of a car in freezing cold temperatures. His dad and babysitter had something more important to worry about."},{"comment_id":"274535909638816","commenter_b":"You are a sick women!","commenter_a":"What's even scarier is Californians that elect her again and again. I was having a discussion with a gent on fb he stated he moved out of the northeast because we were stupid. He stated he moved to the 2nd most intelligent county in the country.I took a wild guess and asked if the state would be California? Bingo! See how these people think. Scary","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video]  This is embarrassing! She scolds the audience!"},{"comment_id":"10152918122661336","commenter_b":"we cant have a female for president ever, do u know wtf is gonna happen when they hit there monthly period, there gonna be droppping bombs everywhere for no reason","commenter_a":"Omg pls no","post_message":"Former Alaska Gov. Sarah Palin says she is \"seriously interested\" in running for president in 2016."},{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"10158125601040615","commenter_b":"America could only be so lucky.","commenter_a":"I think Trump is now afraid somebody just may be planning to 'take him out'. He should have thought of that before.Oh, yes, I forgot, he doesn't have a working brain!","post_message":"But..."},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"}]
