[{"comment_id":"10153031093836037","commenter_b":"Whore....","commenter_a":"Heck, sue playboy, or your parents. smh She should have been in school...","post_message":"Lawyer says he has evidence @BillCosby wasn't at the Playboy Mansion at time of model's alleged abuse: @webpagelink"},{"comment_id":"10154285238753984","commenter_b":"Dumb fucks.","commenter_a":"Yeah your baby sixteen not thirty???? but with a gun???? l bet he said before l'm a man a man he probably never said l'm a baby!!!! He pointed a gun at some cops you don't do that.If you point a weapon at someone it's to use it.And a good baby doesn't run from cops!!!! A gang member thug??? a baby???pleaseeeeee!!!! Over all it's sad when a young teen dies in this awful way. But you!!!! the parents of this teen is to be blame even charge with child cruelty for not teaching your baby respect since the beginning!!!! again it angry's me the ending of this young man!!!!","post_message":"A police officer chased the 16-year-old after he says the teen fled on foot from a car and then pointed a gun at him, which resulted in the shooting. Protests immediate erupt after eyewitnesses make this huge claim about the incident..."},{"comment_id":"10153130896422293","commenter_b":"Mosquitoes might be to blame if a bat runs afoul of someone's head: @webpagelink","commenter_a":"soooo why was the bat euthanized?","post_message":"Terrifying."},{"comment_id":"10153244539676756","commenter_b":"And women like @username have no problem eating corn on the cob with those buck teeth!!","commenter_a":"Glad I live in the U.S.!!","post_message":"In Russia, women are prohibited from doing 456 types of work.   In Nigeria, it's not a crime to hit your wife for the purpose of \"correcting\" her.   In Iran, a woman can be jailed for not following the Islamic dress code, which includes wearing a hijab."},{"comment_id":"10153240747000326","commenter_b":"anything to keep a woman from being elected President!","commenter_a":"#feelthebern !!","post_message":""},{"comment_id":"445168402354286","commenter_b":"Folks are worried about our second ammendment. How about change and uphold immigration laws. For starters vette K1 Visas correctly. Frankly, the current laws aren't upheld now by the lawless folks in our country and government.","commenter_a":"I believe K-1 is a Fiance Visa, wherein the couple must marry within 3 months.","post_message":"***BREAKING***  Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport.  DEVELOPING..."},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it \"crazy\" to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living \"off the grid.\" THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."}]
