[{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van.  This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"10157758385010725","commenter_b":"Hillary is a crimnal so are the Radical Muslims and the Fence jumpers deport them all Wait for it","commenter_a":"aye lmao","post_message":"Thank you for the great 'TRUMP' welcoming, Virginia! I realize that takes a lot of time & coordination - and I am grateful to you all, for your support! -DJT"},{"comment_id":"1422840444402648","commenter_b":"0 for 3 definitely a malicious prosecution not based on facts evidence or law. they need to sue her and the city of Baltimore.","commenter_a":"I think that this prosecutor did this solely on political reasoning and her office needs investigated","post_message":"Caesar Goodson, one of the Baltimore police officers tried in the death of Freddie Gray, has been found not guilty on all charges."},{"comment_id":"1061679133872558","commenter_b":" The US has the highest gun ownership rate in the world - an average of 88 per 100 people. That puts it first in the world for gun ownership - and even the number two country, Yemen, has significantly fewer - 54.8 per 100 people But the US does not have the worst firearm murder rate - that prize belongs to Honduras, El Salvador and Jamaica. In fact, the US is number 28, with a rate of 2.97 per 100,000 people Puerto Rico tops the world's table for firearms murders as a percentage of all homicides - 94.8%. It's followed by Sierra Leone in Africa and Saint Kitts and Nevis in the Caribbean","commenter_a":"Stephen king stick to writing shitty movies. You have no clue. How else can you explain to morons that criminals and crazies don't care about gun restrictions. Guns help protect... There are numerous countries that have worse records for mass shootings than us, that have more gun laws than we ever have had.","post_message":"Stephen King, like most reasonable people, is fed up. His message to fellow gun owners is AWESOME!"},{"comment_id":"935042419864513","commenter_b":"Our borders have never been as bad as they are now. Obama is to blame for that! You never hear about it on the news either. I have family in the South and they say it's scary whst is coming into our country right now illegally.","commenter_a":"Good going trump lets get started right now throw Obama in jail and you can take over tonight","post_message":"Donald Trump's announcement is something we've never seen in history!  This is HUGE!"},{"comment_id":"10153437815231680","commenter_b":"She is worthless!!","commenter_a":"Hillary... Who DA feck Cares!!!","post_message":"Hillary Clinton: \"Well, as one of the more than 65 million Americans who voted to reelect Barack Obama, I’d say my voice is being ignored right now because of their obstructionism.\""},{"comment_id":"765775893538794","commenter_b":"What about women that do?","commenter_a":"Wonder what this means for me","post_message":"Research Says Men Who Take Selfies Have More Psychopathic Tendencies"}]
