[{"comment_id":"1144427122283701","commenter_b":"Seriously this woman obviously needs help.","commenter_a":"My cat thinks she's a human","post_message":"She hisses at dogs and often crawls on all fours"},{"comment_id":"898264413641666","commenter_b":"He shortchanged everybody Diddy! Everyone who isn't a 1%-er.","commenter_a":"Sometimes silence is golden. Our President has done an Excellent Job! Take the Plank out of your own EYE!!","post_message":"Sean 'Diddy' Combs Says President Obama 'Shortchanged' Black People"},{"comment_id":"545668025630703","commenter_b":"Lock her up...","commenter_a":"Mrs @username President 2016 Women had no rights to vote. Just see how far women has come. Pervert Donald Trump discriminate women and abuse them sexually and when they dont give in. he trash talk them what sick beast he is. If this pervert wins you women becomes his slaves Vote for Freedom Mrs @username President 2016","post_message":"A note on Director Comey's letter, from Hillary for America Chair John Podesta. Chip in now to say you're standing with Hillary: hrc.io/donatenow  \"By now, you've probably heard some news about a bewildering letter sent to Congressional leaders by the Director of the FBI. This is all a bit confusing, and much of the reporting has been misleading or downright inaccurate, so I want to take a minute to walk through this.   Here's the quick backstory: In July, FBI Director Jim Comey concluded a year-long investigation by deciding not to go forward with any case about Hillary's emails. It wasn't even a close call, he said. In his words, 'no reasonable prosecutor' would have brought charges.  Yesterday, in a surprise to us all, Comey wrote a very strange letter to Congress that was long on innuendo and short on facts. He said that in a completely separate investigation, the FBI had found some emails that may or may not be related to Hillary, and indeed may or may not be significant at all.  It's being reported that Comey sent this letter over the objections of Department of Justice officials who told him that it was inconsistent with longstanding policy of both Democratic and Republican administrations not to take action that might impact an election. It's an unprecedented intrusion into a close presidential election with less than 11 days until Election Day.   Voters deserve answers.  Comey needs to come clean with the American people about what he found and answer all the questions about why he took this unprecedented step less than weeks before the election.  Here's what this changes for you and this campaign: Absolutely nothing.  The facts be damned—Trump's always shown a complete disregard for the truth. In spite of there being no new information, he's already raising money off the bizarre letter (he literally sent a text message asking for money within an hour of the story breaking!) and he's more fired up than ever on the trail today.  These are the actions of a desperate man. Trump knows he can't win on his character, temperament, or his policies. He's behind, so he'll cling to whatever he can. We can't let him get away with this.  Our organizers and volunteers on the ground are rallying behind Hillary in what will be the biggest volunteer weekend of the campaign so far. You need to have her back, too. You need to say you're not willing to let Trump bully or buy his way into the presidency, and you're not going to let anything stop us from making history.  There are ten days to go. Let's buckle down, stay focused, and win this. Chip in here: hrc.io/donatenow\""},{"comment_id":"910297725696643","commenter_b":"Girls can be just as bad","commenter_a":"Could have been worse","post_message":"'I cleaned my son's room and found... a Pringles  tube full of URINE'"},{"comment_id":"866625743399544","commenter_b":"Shut up you dumb f*** spread your poison somewhere else","commenter_a":"Ever wonder why it is that for two millenia Christians and then Moslems have pillaged, raped and murdered millions of people in the name of God? Ever wondered why Christians and Moslems, both claiming to own the truth, have no qualms about trying to force others to believe as they do? Holiness is not spread by force, and people that attempt to do so are not holy. Jesus was not a prophet. He was a religious Jew and political activist who was against Roman rule and the political establishment that existed in Judea. Years later his followers rewrote history and invented a religion. Christianity is not divine and it is therefore falsehood. Mohammed was not a prophet. He attempted to gain a following among the Jews, but when he failed he became violent. Mohammed, like his followers, was a murderer, a thief and apparently psycholigically impaired. Islam is not divine ...","post_message":"ISLAMO-REALISM: ISIS Defends Burning Jordanian Pilot: Mohammed Burned People Alive, We  The Footsteps Of Allah Messenger  @webpagelink"},{"comment_id":"1795750557330111","commenter_b":"Couldn't agree more!! Set up! All the drama, theatrics all made for Reality TV!! Kardashian styling! #Whinylittlebitch","commenter_a":"I believe THAT was completely stage set up!!!!! How can possibly someone can get through with a gun if someone did try to do something.... Complete set up","post_message":"The Secret Service rushed Donald J. Trump off the stage at a rally on Nov. 5 in Reno, Nev.: @webpagelink"},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen \"absolutely false,\" joining Donald Trump in questioning whether Cruz can legally run for president."}]
