[{"comment_id":"1056498011103708","commenter_b":"Build a wall and if they want to come into England charge them 1000 pound per day to enter","commenter_a":"If Westminster ? allows a second Scottish referendum then fine but along with there departure goes the and our submarine base etc you can't have your cake and eat it. ?","post_message":"The UK is crumbling"},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"},{"comment_id":"10153315672229091","commenter_b":"It's not cheap, it's very expensive. the apartments on either side, below and floors above have to be treated to truly eradicate the pest from the building. All that cost big $$$$ It's not funny. I don't blame her for looking for an inexpensive way to kill them. She should have done more research tho","commenter_a":"Theres people laughing and then I'm reading \"Stop being cheap and call an exterminator...... Who knows if this woman call an exterminator for an estimate and it was way above her budget none of us know that everyone go through different things I wouldn't recommend dousing yourself in rubbing alcohol but I'm sure if she would have looked on line she could have found a more better way. I don't understand how people can sit here and judge the next person like as if their better than the next. At least she apologized if that's the case and if thats how you feel then you should reach out and help her afford an exterminator","post_message":"The woman said doused herself with rubbing alcohol before it was ignited by a stove and oven. She said she had turned on the stove and oven the previous day to heat up her apartment, on advice from a neighbor, as part of the effort to kill the bedbugs."},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153033146442439","commenter_b":"Sorry Drew but I've no interest in that racist bitch & her rantings! regardless of any 'truths' in there! She's fookin rancid and oozes hypocrisy!","commenter_a":"More hot action from pallywood Glen","post_message":"This is rich. You must watch this -- although we have seen it over and over and over again. Every Islamic attack has two prongs. The first is the violence and slaughter, the second is the propaganda of victimhood and chares of 'islamophobia', …"},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the \"sociopath\" Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"1105360966151580","commenter_b":"this is some amazballs shit man!!!","commenter_a":"Heh. I know the guy getting his arm controlled. Had some classes with him in high school. Punniest guy I've ever met.","post_message":"Control someone else's arm with your brain, with relatively little equipment."}]
