[{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"10152606261785950","commenter_b":"Yea I agree,why would any woman want to marry Ol Charlie.Just Crazy.She must have some serious issues.","commenter_a":"Quit promoting this human excrement CBS \"News\"... (\"fuck the victims\") ...UNSUBSCRIBE","post_message":"It looks like the 80-year-old serial killer will stay single."},{"comment_id":"10153347951697144","commenter_b":"that's most likely it - when people camp out, they live somewhere, and the fault line between public and private gets blurred.","commenter_a":"why didn't they want the press there?","post_message":"Finally."},{"comment_id":"1272259289466246","commenter_b":"@username, go ride your tricycle on the freeway!","commenter_a":"Funny you take this seriously. Simultaneously dismissing ISIS. REALLY shows your common sense level.","post_message":"Thank you, sir."},{"comment_id":"10154302766323543","commenter_b":"@username The problem in California is that now illegals have driver's licenses and with that, they were simultaneously, automatically REGISTERED to VOTE as well. Thank to Jerry Brown. We in California are also overrun with Sanctuary Cities and BROKE due to these idiotic, liberal politicians!","commenter_a":"Regardless of the number, I am strongly in favor of requiring IDs for voting. NO ONE should be allowed to vote if they don't have the legal right to do so.","post_message":"Hillary Clinton garnered more than 800,000 votes from noncitizens on Nov. 8, an approximation far short of Donald J. Trump estimate of up to 5 million illegal voters but supportive of his charges of fraud. - via The Washington Times"},{"comment_id":"10153672286196336","commenter_b":"Round em up and send them back to where they come from all illegals","commenter_a":"we are fed up with you're racist personality and we are fed up with you're disrespecting toward women","post_message":"\"People are fed up. They're fed up with incompetence and they're fed up with stupidity.\"  This morning, Donald J. Trump called in to \"FOX & Friends Weekend,\" and shared his take on the national mood and the Iran deal."},{"comment_id":"10154214106757411","commenter_b":"Girls like this get bigger diamonds","commenter_a":"Kathleen O'Connor ~ too bad they didn't have the first look when we all got married.","post_message":"A bride from Chicago wanted to make sure to give her groom a \"first look\" he would never forget... 😂"}]
