[{"comment_id":"1763955337222403","commenter_b":"Women over 65 don't have to wear them...lol","commenter_a":"If there was a young Muslim man in America...and Donald Trump was elected by popular vote to pass hateful laws against Muslims...How easy would it be to radicalize them against a nation that has rejected them? Trump is exactly what ISIS wants.","post_message":"Donald J. Trump campaign chair Paul Manafort fired back after President Obama said the New York billionaire's comments about Islam are \"ultimately helping do ISIL's work.\"  @webpagelink"},{"comment_id":"10153137548926051","commenter_b":"Obviously had to have his eyes closed, or blind to begin with!!! Maybe blind and she had a sexy voice!!! NAH.... Couldn't see something this ugly having anything sexy!!!!","commenter_a":"This unfortunate woman needs anger management & some AA meetings. A bit of dental work and make-up wouldn't hurt either--She was probably brought up in poverty. sandi","post_message":"When this woman's boyfriend refused to get intimate with her, she snapped."},{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"1172990589388617","commenter_b":"Bitch","commenter_a":"Marjolaine Morin","post_message":"Shouldn't their legs relax? Why do they curl up?"},{"comment_id":"10152606261785950","commenter_b":"Yea I agree,why would any woman want to marry Ol Charlie.Just Crazy.She must have some serious issues.","commenter_a":"Quit promoting this human excrement CBS \"News\"... (\"fuck the victims\") ...UNSUBSCRIBE","post_message":"It looks like the 80-year-old serial killer will stay single."},{"comment_id":"10153245198116323","commenter_b":"The women has no idea , if you want to walk in the shoes of a low income American, dont play at it go and talk to one and find out how they really live from day today ,week to week,then come back and try and put your self in there shoes see then how hard it is","commenter_a":"\"watching roaches climb the wall, if you called your dad he could stop it all \"","post_message":"As Gwyneth Paltrow put it, she is walking in a low-income American’s shoes. But is she really?   The reality is more complicated."},{"comment_id":"10153369236751051","commenter_b":"Bitch got what she deserved..","commenter_a":"I am happy for the boy to let his real self show that bully get what she needed..","post_message":"This boy tried to stay calm in the face of relentless bullying from a girl on his bus. Finally, he just couldn't take it anymore."}]
