[{"comment_id":"10154408157211926","commenter_b":"You too, think of humanity stupid or hang yourself with him!","commenter_a":"This liar again! So he's preparing another false flag?","post_message":"Israeli Prime Minister Benjamin #Netanyahu yesterday accused #France of supporting groups that reject #Israel’s right to exist and call to #boycott it."},{"comment_id":"10154278341944062","commenter_b":"Personally, I believe the game should have been forfeited. Cheaters should not be the champs.","commenter_a":"Cheating is cheating. Get him out.","post_message":"A federal judge erased Tom Brady's four-game suspension - do you agree or disagree with his decision? Vote now..."},{"comment_id":"10152720000536051","commenter_b":"I've always been told a white woman will do things that will make a black woman puke they were right.","commenter_a":"Yuk!","post_message":"Officials took one look at this couple’s video and arrested them immediately."},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"10153255561596350","commenter_b":"She did do it her way.....special lady","commenter_a":"Tomi McCutchen Parrish should write her own obit, one day.","post_message":" pains me to admit it, but apparently, I have passed away. Everyone told me it would happen one day but that's simply not something I wanted to hear, much less experience. Once again I didn't get things my way!"},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."}]
