[{"comment_id":"10156385306200231","commenter_b":"She nonce play a white girl maybe she believe she one of them","commenter_a":"Can she be traded in???","post_message":"Why Stacey Dash? Why?"},{"comment_id":"10154007115431770","commenter_b":"IDIOT","commenter_a":"Another side affect of using baby powder........ugh","post_message":"When Tucker Carlson got the best of this anti-American-Flag student, it reminded us of the old Thug Life meme. Welcome to the Tuck Life."},{"comment_id":"1014939015229294","commenter_b":"Then stop importing Muslims.","commenter_a":"Brought to you by liberal idiots like Billary and Obummer: @webpagelink","post_message":"All our prayers are with the people of France. We must stand side by side every step of the way with France and our allies around the world to wage and win the struggle against terrorism and violent extremism.   Even after this darkest night, Paris remains the City of Light. No terrorist attack will ever dim the spirit of the French people or our common commitment to the democratic values we share."},{"comment_id":"10155327246350354","commenter_b":"Why in the hell would we care if illegals' feelings are hurt by AMERICANS FLYING OUR AMERICAN FLAG. IF THIS HURTS YOU, GET THE HELL OUT OF MY COUNTRY. YOU ARE ILLEGAL !!! That means you don't belong here !!!!!","commenter_a":"If these Students get public support it needs to be rescinded.","post_message":"Just when you thought this story couldn't get any more infuriating..."},{"comment_id":"10154221052787869","commenter_b":"Immigrants aren't spending money with local businesses, if they aren't getting paid welfare checks. You're idea would only hurt the citizens of those cities. I agree that the federal funding needs to get cut for processing illegals, but lack of tourism would be cutting jobs, and hours for legal, working citizens that have nothing to do with it. Trust me, the working people in \"sanctuary cities\" want them gone, too.","commenter_a":"Not only should these cities lose their federal dollars, but people should not visit these cities and they will also lose their tourism dollars. Maybe they will cooperate then!","post_message":"One of Donald Trump’s most popular campaign promises was to end “sanctuary cities,” where local officials refuse to cooperate with federal immigration agencies on deportations.  This refusal to enforce the law makes these cities magnets for criminal illegal immigrants seeking to evade arrest and deportation and puts their citizens at grave risk (like Kate Steinle, the young woman allegedly shot to death in front of her family in San Francisco by an illegal immigrant who would have been in custody if local authorities hadn’t released him from jail instead of turning him over to the feds as the law required.)    Trump isn’t even in office, and already, some city leaders are having the same kind of tantrum we’re seeing from protesters in their streets.  The Democratic mayors of Chicago, New York and Los Angeles all defiantly declared that they’ll never give up their “sanctuary” policies and cooperate with federal immigration authorities.  L.A. police chief Charlie Beck also announced that his force will never work with Homeland Security to deport criminal illegal immigrants.  He said, “That is not our job, nor will I make it our job.”   Memo to these mayors and to the L.A. police chief:  As law enforcement officers, your job is enforcing laws, not protecting criminals.  If it takes cutting off your federal funds to force you to do your jobs and put your citizens’ safety first, then maybe that should be the very first cost-cutting measure President Trump takes to reduce the deficit."},{"comment_id":"1813062615599826","commenter_b":"She was good at taking separate vacations and other unnecessary trips at taxpayer expense!","commenter_a":"Yes","post_message":"Yes or no: Was Michelle Obama a good First Lady?"},{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."}]
