[{"comment_id":"10153055939596051","commenter_b":"Prayers for the puppy and the staff taking care of her.","commenter_a":"Jail the creep, with his mouth treated the same.","post_message":"Remember the dog they found with her mouth taped shut? Well, good news."},{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job.  Full video: @webpagelink"},{"comment_id":"1681790358712525","commenter_b":"what a liar.....she is so happy to have a plane....go away","commenter_a":"Clinton=","post_message":"Hillary Clinton traveled with the press for the very first time today in her new campaign plane. Critics are still pressuring Clinton to hold a press conference, which she has not done in 275 days. @webpagelink"},{"comment_id":"10156714822180354","commenter_b":"I'm with you Francesca ! Beyonce is just trash !","commenter_a":"That was beautiful and classy from Lady Gaga. I will NOT be watching trashy Beyonce.","post_message":"Lady Gaga's performance of the National Anthem at the #SuperBowl lights up social media.  WATCH:"},{"comment_id":"10153908601902629","commenter_b":"Bye bye, bitch!","commenter_a":"Hope Cliven doesn't have any horse shit on those fancy kickers","post_message":"Cliven Bundy, the Nevada cattle rancher who birthed the Oregon militia movement in more ways than one, was arrested last night on felony conspiracy charges after he tried to join the standoff."},{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"},{"comment_id":"1067105896689813","commenter_b":"She's a bitch !!!!","commenter_a":"I've always believed we get what we've paid for .","post_message":"Do you support or oppose the stand these officers are taking?  LIKE Opposing Views for more breaking news and anaylsis"}]
