[{"comment_id":"10156463430895354","commenter_b":"Look another bitch working for Obama","commenter_a":"What about anti american hate speech from scuzzy muslims ? Real americans dont like having to suck up to people who want to kill real americans !A plot by our government to change America into a third world craphole !","post_message":"Obama prepares the muzzle to silence Americans who are FED UP with his coddling of terrorists."},{"comment_id":"10155846311480405","commenter_b":"God tell you to eat there!! Moron!!","commenter_a":"Just had some Chick-fil-A minutes ago at the Atlanta Airport !!! @username and Susana Martinez !","post_message":"Ate at the original Chick-fil-A in Georgia. -SW #Walker16"},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."},{"comment_id":"10154593126179614","commenter_b":"Kassandra Alvarez","commenter_a":"Women beater no mercy for him","post_message":"Update: Chris Brown has been transported to downtown Los Angeles where he is expected to be arrested on suspicion of assault with a deadly weapon.   The singer initially refused to come outside and was not allowing police into his home, an LAPD official said."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"1011840532205809","commenter_b":"She's always been a corrupt liar","commenter_a":"One thing I know, Hillary has always been involved in community service. Go Hillary! ; .)","post_message":"A young man met Hillary at the NewsOne town hall and asked: What did you learn from the Girl Scouts that you would use to be a successful president?"},{"comment_id":"10153553698421323","commenter_b":"I'd rather be surrounded by happy refugees , than miserable right wing morons.","commenter_a":"Have you seen most of these refugees? Not the kind of people you want living near you. They've already turned many areas into hellholes for the residents.","post_message":"\"Anyone who tells me Germany is full up, or that we can’t afford them, I say think of our past, and of the future. Of course we can afford them – we’re a rich country, and we have a duty to help those in need.”  The German mayor desperate to welcome immigrants to his town."}]
