[{"comment_id":"10156195234480093","commenter_b":"Guns are not only made here...","commenter_a":"People said America is full of nuts but before reading these comments i did not believe it. Take all the guns and destroy all the gun factories and find out what living in peace means","post_message":"Let's have an HONEST conversation about it."},{"comment_id":"1726142824304062","commenter_b":"These are \"outrageous\"? Come on! Blacks, African-American, People of Color, or whatever is the nonoffensive way they are referred to these days, often get a pass for calling each other the \"N-word\". What the hell is going on here! Odd double standard. Remember \"Colored People\", bad!!!, \"People of Color\", GOOD!!! Wow, what crap!!!","commenter_a":"She thought she had a friend","post_message":"Fox News chief allegedly referred to Stacey Dash as ‘the black girl’, called another anchor an \"angry black woman\"  Grio fam, are you surprised by any of this? Check out the other outrageous things coming out in this new lawsuit!"},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""},{"comment_id":"10150526412169999","commenter_b":"Fact","commenter_a":"Davey","post_message":"Exercise — and, in particular, weight training — after weight loss could stop unwanted pounds from creeping back on."},{"comment_id":"10153366804443635","commenter_b":"Old testament commands to kill is now invalid. You are beyond ignorant Kyle. You'll do anything to defend any religion except Christianity. Did i say you should be killed, you nut? I'm not talking to you anyways. Get your nose out of my conversation with him.","commenter_a":"Kill the unbelievers wherever you find them.\" Koran 2:191 \"Make war on the infidels living in your neighborhood.\" Koran 9:123 \"When opportunity arises, kill the infidels wherever you catch them.\" Koran 9:5 \"Any religion other than Islam is not acceptable.\" Koran 3:85 \"The Jews and the Christians are perverts fight them.\"... Koran 9:30 \"Maim and crucify the infidels if they criticize Islam\" Koran 5:33 \"Punish the unbelievers with garments of fire, hooked iron rods, boiling water melt their skin and bellies.\" Koran 22:19 \"The unbelievers are silly urge the Muslims to fight them.\" Koran 8:65 \"Muslims must not take the infidels as friends.\" Koran 3:28 \"Terrorize and behead those who believe in scriptures other than the Qur'an.\" Koran 8:12 \"Muslims must muster all weapons to terrorize the infidels.\" Koran 8:60. That seems pretty pure to me, purely evil!","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"998546203523695","commenter_b":"when i ask, it's bengazi","commenter_a":"No president has ever endured the disrespect that President Obama, has. If there are people out there, that say that race has nothing to do with it. then they are the ones that are doing it.","post_message":"Sign your name if you're still standing with President Obama → @webpagelink"},{"comment_id":"1906450522914712","commenter_b":"Also, men have their own issues. To claim that MRAs are bad people is simply a generic shaming tactic often employed by feminists. Reminds me of the White feather movement...","commenter_a":"Pretty discouraged reading many of the comments to this post. Fellow Bernie supporters, it would be great if you stopped living up to the misogynist label Clinton supporters have put on us as a group. Piling on here to deny that the wage gap exists is not helping.","post_message":""}]
