[{"comment_id":"1624197824544119","commenter_b":"During the debate season, Hillary Clinton will mop Donald Trump off of the floor and dump him into the sewer with the mop water because she is 20x smarter than he is. She went thru 12 hours of gruesome testimonies with congressional republicans and didn't even break a sweat and was able to squash all of them like cockroaches. On the other hand, Donald Trump choked during a 1 hour meeting with the Mexican President and he choked and sweated bullets while being interviewed by Faux News Megan Kelly.","commenter_a":"Jordan Elum","post_message":"#Repost Ivanka Trump #Instagram ••••••••••••••••••••••••• Smooches from baby Theodore. 😘 #Latergram"},{"comment_id":"522395871281301","commenter_b":"@username then tear it down and build bridges smh","commenter_a":"The wall was already built before he ever thought about becoming pope. Trump is a moron and needs to have people tell him how it is.","post_message":"@webpagelink"},{"comment_id":"578168169046751","commenter_b":"We do still have freedom of religion but I think these women would be so much better off just being free of wearing a hijab. Their so oppressed by men. Dumb the religion and live your life without restraint","commenter_a":"Let's say wear whatever you want in public, but when you go into a store, gas station, etc., EVERYTHING comes off from the neck up. Sunglasses included. And how about we lower the surveillance cameras to head height so we can get a decent face picture instead of a grainy aerial shot. Why are we continually so bad at surveillance? Be whatever religion you want, but for everyone's public safety, we deserve to get a good look at you so we can quickly identify you later on. Nuf sed.","post_message":"Pretty soon it may be illegal to wear a hijab in public in Georgia. Do you think the ban would be a good thing?"},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"1569451360020943","commenter_b":"It's called treason, hang her.","commenter_a":"ABSOLUTELY NOT!!!!! We need to MOVE ON!!!!!!! Stop beating this DEAD horse and help the people, NOT YOURSELF INTERESTS!!!!!","post_message":"“I talk about the emails all the time and what can you say, does it get anymore corrupt or crooked than that?”  Donald J. Trump argued that Hillary Clinton is being protected from prosecution relating to her private email server. Do you agree with him?"},{"comment_id":"685166964976590","commenter_b":"Donald Trump is what the definition of corrupt is. She won popular votes. He wont build a wall! He wont deport all illegals and he wont make america great by killing obamacare for millions of people. Your beyond stupid if you think you'll get anything from selfish republicans.","commenter_a":"Should have seen this coming since the day she barley beat Bernie even with all her corruption and everything in her favor😭😂","post_message":"Hillary Clinton's advice to young people: \"Never stop believing that fighting for what is right is worth it.\""},{"comment_id":"913240742032115","commenter_b":"this is not true...try 99999999x","commenter_a":"When you stand 10 x","post_message":"You Know You’re In A Black Church When…"}]
