[{"comment_id":"885881534804929","commenter_b":"That what she said.","commenter_a":"Her neck looks like huge lips.","post_message":"She shared explicit messages and pictures with pupil after the schoolgirl came out to her"},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."},{"comment_id":"456287754495819","commenter_b":"She wil not get my vote, Trumps mine.","commenter_a":"I do not agree with old horse face at all.","post_message":"Carly Fiorina has vowed not to send 'boots on the ground' into the Middle East. Do you agree with this strategy?"},{"comment_id":"10154082148493797","commenter_b":"Who cares. If they are here illegally they need to be gone!","commenter_a":"Tell them to show how they got the money to open their busines....... See fox should search before they put these articles. They did not pay taxes on one penny also they were on welfare so hmmmm think it through collecting welfare and saved a lot of money to open a business . That is fraud.......","post_message":"THE AMERICAN DREAM: Donald Trump's plan to end birthright citizenship is drawing fire from Republican challengers. In particular, one successful family from Little Village that would be torn apart if Trump got his way. That couple owns Los Mangos, which has been open since 2012 and is growing."},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"1771730343061531","commenter_b":"@username, no too bad YOUR MOTHER DIDN'T HAVE ONE!","commenter_a":"If anyone is out of touch with mainstream America it's conservatives. What this really should is how liberals are against bigoted, hateful, judgmental, narrow minded christian WHITE CONSERVATIVE IDIOTS.","post_message":"Democrats' threats of violence are intensifying, showing voters  how radical and out of touch Hillary Clinton and Leftist radicals truly are with mainstream America..."}]
