[{"comment_id":"912633472136742","commenter_b":"She probley doing wat she was raised watching het monster mother do... it's disgusting how she was beating het child like she was beating a street bitch... she ain't shit,!!!","commenter_a":"Alan Connell","post_message":"Mom Beats Her Daughter In Broad Daylight For Sucking D!"},{"comment_id":"10153933617414411","commenter_b":"Go fuck a pig!","commenter_a":"This is what happens when Islam gets a hold of a country. Back to the dark ages we go","post_message":"BREAKING: 8 coalition troops killed across Afghanistan"},{"comment_id":"10155827348030603","commenter_b":"Well if the driver is 18 then maby she should be brought up on man slaughter .","commenter_a":"I know this is a hit and run.. but why was this man in the street?","post_message":"#BREAKING: One of the suspects is also facing involuntary manslaughter and leaving the scene of an accident charges related to the hit-and-run that killed Bapi Gupta."},{"comment_id":"1391871914162547","commenter_b":"U r an Angela,go take every Muslims come back ur home","commenter_a":"You guys are all so worried about making jokes about Obama. How about we worry about the children who lost their lives and the parents that have to adjust to a life without their babies? My goodness!!!","post_message":"Witness describes seeing the gunman at Munich, Germany, McDonald's, killing children. @webpagelink"},{"comment_id":"10153331361449228","commenter_b":"I give up on our government and justice system. You mess with me or my family I'll kill you! There is no more calling the cops to help. I'm done! I can't belive this. My advice to every woman is get your cc and protect yourself!","commenter_a":"Police were still looking for him....I believe he will now be found dead from suicide..","post_message":"She was found with her teenage son.  Police are looking for this man"},{"comment_id":"10153197145938721","commenter_b":"My Eulogy: @webpagelink","commenter_a":"Welcome HTML5 banners.","post_message":"With Google putting the brakes on Flash in Chromethe world most popular web browseradvertisers will need to seek other ways to get their messages out."},{"comment_id":"10153184382439255","commenter_b":"History has lots of examples of jobs we don't want. Thank of all those guys running the gas chambers who were out of work when the Nazi Death camps closed. You are truly pathetic.","commenter_a":"Stunning. You're actually in favor of businesses shutting their doors, laying off people and possibly going under all in your vendetta against one man? You are truly pathetic","post_message":"A sign of victory."}]
