[{"comment_id":"976666089019811","commenter_b":"You're all correct....but the easiest clue is the shadows on the stairs. Show the cat is clearly going down.","commenter_a":"down, the trim and the lip on the edge of the stair confirms that.","post_message":"No dress or Llamas in this morning's big Internet debate ..."},{"comment_id":"10154141552967426","commenter_b":"Those who are always accusing others of hate don't seem to have enough self awareness,intelligence or what ever to know how obvious it is who they hate.","commenter_a":"Welcome to Hillary's America RVA.....","post_message":"\"Your vote was a hate crime,\" was sprayed painted on statues that honor Civil War icons along Monument Avenue in Richmond.  The graffiti was discovered as hundreds protested the election of  Donald Trump as president.  Updates: @webpagelink"},{"comment_id":"1131999030168888","commenter_b":"Heroin is effecting all colors all races from all backgrounds!!!","commenter_a":"I like how heroin is effecting white people the way crack effected the black community but the way the media and police are dealing with it is completely different. Instead of calling them junkies or addicts it's an epidemic and now it's a family issue. Just lock them up like you did to black people in the 80's.","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"10154132565089087","commenter_b":"Thats it?? Popping a bottle of champagne??? He wasn't fucking any one...SHE WAS....GIVE ME A BREAK!!!","commenter_a":"Treasonous Clinton is going to be burned on Bills rapping of women when he was the AG of Arkansas that right Clinton you covered it up","post_message":"\"There’s been a lot of talk about sex tapes today and in a strange turn of events, only one adult film has emerged today and its star is Donald Trump,\" said the Hillary Clinton campaign in a statement."},{"comment_id":"480443122154949","commenter_b":"INDEPENDENT WOMEN FOR TRUMP!!","commenter_a":"Saw the Town Hall meeting with you tonight, very on point. I hope people get their heads on straight and vote for you Mr.Trump. Go Trump Go","post_message":"WOW! What an evening in West Allis, Wisconsin! THANK YOU for the incredible amount of support tonight. Everyone get out and VOTE TRUMP on Tuesday, April 5th! We will MAKE AMERICA GREAT AGAIN!"},{"comment_id":"980020968705428","commenter_b":"It's been a long time coming. Let's make this happen so our daughters and granddaughters are free from the harassment that we were told to \"just deal with it\".","commenter_a":"We need something like this! Jasmyne","post_message":"The video is intense, but its message is so needed. - Parker Marie Molloy"},{"comment_id":"1706384232981728","commenter_b":"5his woman is so evil ,.","commenter_a":"Explain that one...Obama, State Dept, FBI DOJ. If something isn't done to Hillary, than Eric Snowden should be allowed back in the US and not charged.","post_message":"#Petraeus was ruined for one leaked email. #Hillary deleted thousands of emails and sent multiple classified ones—indictment time!"}]
