[{"comment_id":"10152892067227144","commenter_b":"Far more competent and capable than anyone out there on either side!","commenter_a":"If she is the best we dems can do, we are in bad shape.","post_message":"The time has come."},{"comment_id":"10153158036376756","commenter_b":"Haha or they're super annoying beats made on a computer by another artist.. Then they take that same beat again change a few things and bam another two chains song!","commenter_a":"Modern day hip hop is way worse! All the beats are the same n the lyrics are garbage!","post_message":"Maybe you've noticed that many hit country songs sound the same. Now you have proof."},{"comment_id":"10154048392259087","commenter_b":"Mexicans might cross a border but not a fucking ocean.","commenter_a":"\"The Wall\" is just what he said to get racist white votes. You're a fucking moron if you think a wall would be built. Let alone be efficient. There's OTHER ways in!","post_message":"\"We didn't discuss who will pay for the wall,\" Trump admitted."},{"comment_id":"1286274651384789","commenter_b":"Go home.","commenter_a":"Why is this degenerate getting so much coverage....He's Disgraced HIS SON who died in 2004!!","post_message":"Khizr M. Khan has published papers supporting the supremacy of Islamic law over -made Western law  including the very Constitution he championed in his Democratic National Convention speech attacking GOP presidential nod Donald Trump."},{"comment_id":"616279121877054","commenter_b":"@username not all people who are unemployed are \"deadbeats\".","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."},{"comment_id":"10153631429237098","commenter_b":"Get your mind out of the gutter ladies.","commenter_a":"What a pig, No little girl's first introduction to sex should be with some slime like this.","post_message":"#BREAKING - The dental assistant was arrested over the weekend for allegedly molesting a sedated 8-year-old girl  Police say there may be more potential victims"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays.  America is under attack, this is treasonous.  'LIKE' if banning Easter is WRONG!"}]
