[{"comment_id":"10154027159919087","commenter_b":"And I don't care if the illegals are brown, Yellow, red, black or white. They are here illegally and illegal is illegal PERIOD!","commenter_a":"Can he protect my children from crazy white dudes shooting up schools or movie theatres? Or other domestic terrorist that are US citizens? Get out of here with that bullshit! Our own people kill us!","post_message":"\"[Donald J. Trump] is the only one who can protect your children from being slaughtered like my son was,\" said one mother, who said her son was killed by an undocumented immigrant."},{"comment_id":"10152755752215950","commenter_b":"White kids who grow in the same exact environment would most likely participate in these activities, just like black kids who grow up in the same environment as snotty white kids will most likely also be snotty kids. We're all a reflection of our environments, we do as we see we do as we are taught!","commenter_a":"This is a social problem not a race issue..","post_message":"Police say a large group of high school students swarmed a gas station and beat a man who was reportedly helping an older woman to her car."},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."},{"comment_id":"1004633596257472","commenter_b":"I would do the same only faster. Highways are for vehicles not pedestrians. Soooo expect to get run down of you are blocking traffic on a tiadwa","commenter_a":"Finished my run thru Arizona, didn't see no protesters ;)","post_message":"WATCH: DRIVER FED UP WITH ANTI-TRUMP Terrorists Blocking Road Drives Through Crowd…Reaction Of AZ Police Officer…Priceless"},{"comment_id":"10153867338207212","commenter_b":"And she's voting for Hillary. Smh","commenter_a":"She's such a cute lady- I wanted to hug her!!","post_message":"Thousands of Oklahomans are voting early, including a 100-year-old woman who has a message for young voters. #News9"},{"comment_id":"525788244278422","commenter_b":"Look at her eyes, do you really want this ugly, selfish and stupid woman as your president,,,?","commenter_a":"She won`t be done until she takes her last breath. Shes to damn dumb to quit.","post_message":"Hillary tried to hide the truth, but Gowdy refused to give up until justice was served.  This is amazing. Hillary is finally going to pay for her crimes.  Do you agree Hillary Clinton should be arrested for treason?"},{"comment_id":"1352047571524023","commenter_b":"Lock her up","commenter_a":"Merry Christmas from Michigan","post_message":"Pat Dollard LIVE! The secret Truth of Obama"}]
