[{"comment_id":"10153256940195736","commenter_b":"God forbid we put them in shelters and feed them.","commenter_a":"I have advocated for helping the homeless for a decade but it has gotten out of hand over the last couple years...which is to be expected, given we've mostly ignored the problem. These folks belong in Wapato and Wapato needs to be converted into a mental health care site.. They commit crimes against society -- leaving garbage around is just a visible symptom but when folks aren't looking, they misbehave in more destructive ways. They need to be \"rebooted,\" in the computer sense, not the kick-in-the-pants sense. Though some of them need that as well...","post_message":"Mayor Hales said today was the first of several in which the homeless will be moved out of city parks."},{"comment_id":"10154985176733690","commenter_b":"He talk easily bcoz he live well but Philippine's nation will suffer .China will dominate Philippine.","commenter_a":"G","post_message":"Duterte said the Philippines could do without US aid, called Americans \"sons of bitches\" and \"hypocrites,\" and praised China for offering what he said was huge financial assistance."},{"comment_id":"10152883949732507","commenter_b":"John, it's entirely secret to protect children and families. Social workers are ethically obligated to not share more than they have to, and why should they when sharing information can often cause more harm than good?","commenter_a":"Home schooling wasn't the reason. You can home school, live in a tent, even be homeless. There were other reasons. Living in filth, broken glass, all stated in a copy of the letter the mom posted to her Facebook. I read it earlier in another article. I work for children's services, nothing is as clear as it seems.","post_message":"This should spark a lot of debate."},{"comment_id":"10153871273143984","commenter_b":"go home and take obama with you !","commenter_a":"OMG. They need to take this list to Iraq and make their demands. Not here.","post_message":"Illegals just issued their new 'Bill of Rights' to the American people, and I definitely don't see many being too happy about it...  Do you think the U.S. needs a president who has a tough immigration stance?"},{"comment_id":"1030700923658691","commenter_b":"Muslim invaders go back to your own country your not wanted here !!!!","commenter_a":"And just what the hell have you Muslims done to get rid of Isis who hijacked your religion?","post_message":"UNREAL: Dearborn Muslims Protest In Support Of Syrian  And Against  In America  @webpagelink"},{"comment_id":"10153548977449607","commenter_b":"she wants to get out before all hell brakes loose LMAO","commenter_a":"let her travel who cares","post_message":"Some local activists are shaking their heads over the Mayor's plans to travel out of the country next week, on the one year anniversary of Freddie Gray's arrest."},{"comment_id":"10153387915812756","commenter_b":"I guess there's no zoning regulations ?","commenter_a":"Sad","post_message":"We learned on Monday that it was not the first time the owners of a home in Carbon County had animals removed from their property."}]
