[{"comment_id":"1203191243053664","commenter_b":"Fry the bitch!!!!","commenter_a":"She's as much of a terrorist as he is because she knew and said nothing!!! Life in prison or deport and never allow her back in our country.","post_message":"WIFE PLAYED A ROLE:  @webpagelink"},{"comment_id":"10153743310093606","commenter_b":"Sad, if she didnt want the child I would have taken her no questions asked","commenter_a":"She needs shoot","post_message":"HORRIFIC: A 6-month-old baby girl died Thursday afternoon after police and witnesses say her naked mother dangled her from the window of an apartment building in the Bronx before throwing her to the pavement six stories below. @webpagelink"},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"600892556733313","commenter_b":"She should put in jail with all Males and stay with them 24/7/365","commenter_a":"So not only he is a kid, he is also special needs. And on top of all of this, she is 71 among kids ????! The school should re think abt the age of teachers dealing with kids. In late 30s and a woman can hardly handle her own kids !!!! Shame","post_message":"71-year-old teacher Amelia Stripling was arrested and charged with 2nd degree cruelty to a child after knocking over a pre-K special needs student in Georgia.  @webpagelink"},{"comment_id":"10153523843241323","commenter_b":"Get a gf!","commenter_a":"In good times and bad times ........dick head there is prob shit about you but she's doesn't tell you ! She just except the idiot you are !","post_message":"How do I tell her how I feel without hurting her feelings?"},{"comment_id":"583909811799598","commenter_b":"Go away ugly rumors nasty gossip ho away","commenter_a":"So do it already and quit saying you're going to.","post_message":"Obama was just caught red handed in a massive act of treason.  Throw him out of the white house already. He is a criminal?\\t  Would you be happy if Obama was impeached immediately?"},{"comment_id":"1160164500670245","commenter_b":"@username did you forget to take your happy pills? LOL","commenter_a":"I am so over this. We need to worry about the homeless and disabled right in front of us, not hunting regulations in another country over one dead lion. Take the money you spent getting to this guys house and buying paint and feed someone today.","post_message":"Raw meat, animal crackers and spray paint were used to vandalize the Florida vacation home of lion-hunting dentist Walter Palmer."}]
