[{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153806862081167","commenter_b":"Maybe the whole NRA could be recalled.","commenter_a":"The Cash Box Rules! \" Let's Make America Great Again\" yeah right!","post_message":"After we called them out yesterday, Bud Light seems to realize that Ted Nugent's hate is bad for business."},{"comment_id":"1565559713753745","commenter_b":"Boy are you missing it!!!! Blacks kill each other 1000% more!!!!","commenter_a":"Wow. I didn't really support this dudes agenda before but after this, I can get down with him somewhat. It's a shame a man from another country has to speak on behalf of black Americans.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10154140324537690","commenter_b":"Economically saying no to this is an economic disaster.","commenter_a":"I do live in Arlington. I like the ballpark we got! And really, do you believe in no new taxes?","post_message":"The debut this week of Arlington's plans for a massive entertainment complex to be built around a proposed new baseball stadium is not sitting sitting well with everyone."},{"comment_id":"10155483281175231","commenter_b":"They tried to walk out and no is her business she can't just do whatever she want she pulled a gun on to people what was right about that. Just suppose they had weapons you do know the 2nd amendment applies to all citizens and they feared for their lives and shot the stupid white bicth. How ignorant","commenter_a":"her joint she can say and do what she likes......whatever...I would have just walked out..who cares","post_message":"Things reportedly turned into a scene out of Pulp Fiction."},{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"}]
