[{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"10153474525188812","commenter_b":"Is she a Mormon? Cause those kinds believe differently.","commenter_a":"This is not ok!! he has said God made him wrong, God is NOT a liar and He makes no mistakes....repent cause looking like you made a true blasphemy against God, please don't comment ignorance, if you have an issue take it to God.....","post_message":"NEW: Meet Caitlyn Jenner -- formerly known as Bruce Jenner: @webpagelink"},{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"10155909073040354","commenter_b":"Yea I've been seeing her dumb ass everywhere lately","commenter_a":"Mike Romano this woman is crazy.","post_message":"SHOCK! Nancy Pelosi backs Planned Parenthood."},{"comment_id":"908720232539273","commenter_b":"Oh Mr Trump , I personally can not wait for you to be our New PRESIDENT! All these people saying they are going to leave, I sure hope they do , to bad you can not make it a law that they have to, American might just be s better place without these people. You raised 6 million for the vets what did these people do ??? Besides complain they need to put their energy towards something positive instead of trying to find negativity. Great Job Mr further PRESIDENT TRUMP","commenter_a":"idiot,trump cant do any worse than dumb obama n our stiupid ripoff goverment'get real","post_message":"A majority of people said they would go to Mexico."},{"comment_id":"10154801850791509","commenter_b":"Probably all the women appearing on TV to tout his brilliance.","commenter_a":"If relationships toward women was a deciding factor than Bill Clinton never would have been president. Bill had several women accused Bill Clinton of sexual attacks. How many women have accused Trump?","post_message":"Republican National Committee Chairman Reince Priebus says Donald J. Trump \"is going to have to answer for\" his behavior around women — but also says Trump's presidential campaign isn't being judged based on his personal life."},{"comment_id":"760686517397260","commenter_b":"Stephanie Hathcox","commenter_a":"John Rivera","post_message":"In case training your dog to shake hands weren't impressive enough."}]
