[{"comment_id":"685418174982094","commenter_b":"Why don't they take those liberal bitches off the air","commenter_a":"These women need to think before they speak","post_message":"The View is going to be taken off the air after host says this about candidate on live TV. This show is disgusting liberal trash. Put an end to the show already. Can we get 100,000 'LIKES' to have The View cancelled?"},{"comment_id":"1535105376549586","commenter_b":"We need to deport her ass","commenter_a":"Yes","post_message":"Do you think she deserved 7 months in jail for urinating on a war memorial?"},{"comment_id":"430432623811698","commenter_b":"Soon Obama can seal the new border and Mexico can deal with these ingrates..LOL","commenter_a":"more obama (gov't) bullshit!","post_message":"BREAKING..."},{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."},{"comment_id":"10154710318354062","commenter_b":"GTFOH... U don't own this planet girl!! GOD knows no borders right Angie? Get off ur high horse! Stop looking down n help another up!!","commenter_a":"what part of ILLEGAL do people NOT get??? GO HOME!","post_message":"Dozens of protesters have gathered on the University of Houston campus in advance of tonight's debate. Live team coverage coming up at 6."},{"comment_id":"10154940269859614","commenter_b":"Sorry @username but there is no place for white gangs here in California . Many Latino gangs are backed by dangerous cartels. White racist trailer trash should lay low or move to another state and spread their hate. If they try to Lynch a Mexican or African American, they will get decapitated.","commenter_a":"I know I may sound vulgar for saying this but they better not pick fights with the wrong people here they will get shot at lol","post_message":"A white supremacist gang known as the SFV Peckerwoods, which authorities say has operated at three homes close to schools and a library, is the target of L.A. city prosecutors and LAPD.  \"We're now fighting to prevent white supremacist gangs from infesting neighborhoods. They bring with them  this toxic mix of violence and crime and hate,\" the L.A. city attorney said."},{"comment_id":"10154165020726943","commenter_b":"Hillary, you look really tired. Even with all that makeup on. Just think how tired and hot you'd be if you were in Louisiana now like Donald Trump. Think how tired you would be if you had his schedule. Think how exhausted you would be trying to be President every single day. Please just give up now. With all your money, wouldn't it be nice to just stay home and spend time with your grandchildren?","commenter_a":"keep up the good work","post_message":"A federal judge in Washington, D.C. ruled Friday that Hillary Clinton must answer written questions from a group that filed a lawsuit over her private email server.  Lawyers for Judicial Watch, a conservative government watchdog organization, asked to interview her under oath as part of their Freedom of Information Act lawsuit against the State Department. - via NBC News"}]
