[{"comment_id":"10153923340133635","commenter_b":"Vicki C: So true re immigrants across the border. They caused more than half our hospitals and emergency rooms to close in Los Angeles years ago!!! Now, it's difficult for REAL Americans to get care when they require it. Just disgusting! Add to that, the planeloads of moozies Ovomit has been bringing in for years and I'm surprised any healthcare is available at all! Even our Vets can't get care and they should be first!","commenter_a":"Border Patrol Agent Defies “Gag Order” to Expose Obama The massive exodus of illegals crossing over into Texas and other border states is becoming more than local communities can handle. This influx of illegal immigration is causing emergency shelters, areas typically designated for use during catastrophes, to overflow, leaving local government scratching their heads as to what to do with immigrants who have no place to go and can’t be deported back to their home country.... Border Patrol agent Hector Garcia accused the Obama administration of “aiding, abetting and facilitating the smuggling of illegal aliens across the border.” In an interview with CNN, Garza said the current influx of illegal immigrants is “organized” and “orchestrated” by the drug cartels. Additionally, he said the federal government is giving illegal immigrants a “free pass.” He said the feds are using the equivalent of the honor system in asking illegal immigrants to later ...","post_message":"#1 Republican President Teddy Roosevelt was also a proponent of eugenics theories by Planned Parenthood founder Margaret Sanger"},{"comment_id":"10154167828886077","commenter_b":"Oh whoopee!! It will soon b n Indiana! 🙀 Where did June go??","commenter_a":"Kill it with fire!","post_message":"❄️☃"},{"comment_id":"335857396538054","commenter_b":"There is no climate change that is your agenda","commenter_a":"Does this arrogant, smug, condescending community organizer and failed President REALLY want to compare resumes with the Donald? More evidence of how delusional he is and how stupid he thinks we all are.","post_message":"“I think foreign observers are troubled by some of the rhetoric that’s been taking place in these Republican primaries and Republican debates. I don’t think it’s restricted, by the way, to Mr. Trump.”  During a press conference earlier today, President Barack Obama slammed Donald J. Trump and other GOP presidential candidates while continuing to tout climate change. @webpagelink"},{"comment_id":"10153204502459087","commenter_b":"Mar G Her go back to mexico. this country is for LEGAL immigrants who want to be Americans.","commenter_a":"Trump is for all Americans, whether you're democrat or republican. Go Trump 2016!","post_message":"GOP front-runner Donald J. Trump continues to pull away from the rest of the Republican pack, drawing 33 percent support in the latest Washington Post/ABC News poll."},{"comment_id":"1712281645723927","commenter_b":"Ash Jesus another self righteous know it all illegal immigrant go back to your country bitch this is my country not yours","commenter_a":"Makes me laugh that those who are here \"legally\" think they are any better than those who cross the border. Yes deport those with criminal record, but why throw out hard working folks like my parents who come here for a better life and contribute to this country. They also pay their taxes. People screaming out CRIMINALS to immigrants as if US citizens weren't criminals. Instead of complaining about immigration, perhaps you should demand the government to stop exploiting other countries' resources and their people. Bring down your ignorance and arrogance down a notch. Seriously, who do you all think you are? When you die and rot in your tomb, you won't be needing your \"citizenship\".","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10157307268915354","commenter_b":"Definitely yes. We do not want them here. Security risks.","commenter_a":"Go back to your shithole of a country and wear your burqas there.","post_message":"WOW.  Can you name the other 2 countries?"},{"comment_id":"1695743490702170","commenter_b":"@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"}]
