[{"comment_id":"10153797602872060","commenter_b":"Bless you Chase!","commenter_a":"Thanks Chase!","post_message":"Chase Landry of The History Channel's \"Swamp People\" hitched his 20-foot aluminum flat-bottom boat and has rescued more people than he can count."},{"comment_id":"875360339257302","commenter_b":"God did not allow it but there is also an evil force in this world called Satan. Satan was at work in the guy trying to take the child but God was working when he was stopped. Give evil the name that it has and that is Satan.","commenter_a":"All the comments are giving credit to the determination and strength of the mother and the officer for being on site at the right time. Why is it so difficult for everyone to see it is the hand of God that gave the mother strength and put the officer exactly where he needed to be. We are not victims we are conquerors. We can do all things through Christ Jesus.","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"10153486843809091","commenter_b":"I hope his whole family is murdered in front of him","commenter_a":"Good!!!!","post_message":"JUST IN: A teen  from Paterson who was involved in a 'knockout game' attack posted to social media has turned himself into police. --> @webpagelink"},{"comment_id":"10153021059601051","commenter_b":"What a cruel woman","commenter_a":"All I can say, is he is better off without her for a mother.","post_message":"This baby's mom decided she didn't want him anymore and had him deported."},{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"},{"comment_id":"10153987601378908","commenter_b":"And another commenter who didn't read the article.","commenter_a":"And this is the article that should prove to all of you that collective evolution spreads bullshit ... Yellowstone has a big herd over 4000 bison .... And they are to slaughter 4-600 of them to prevent spread of disease !!!!!","post_message":"Park rangers have begun capturing wild bison in the Stephens Creek trap within Yellowstone National Park. Since Feb. 20, approximately 150 of America last wild buffalo have been trapped. According to park officials, all are destined for slaughter."},{"comment_id":"10153506761069091","commenter_b":"Imagine if nothing was found like the weapons of mass destruction....mmmmm and you are right @username","commenter_a":"Yes","post_message":"Should Apple be required to help police unlock the San Bernardino gunman's phone? @webpagelink"}]
