[{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"886538858047877","commenter_b":"My corner gay bakery wouldn't bake me a vagina cake......... The USA is goin to shit","commenter_a":"Most of the people commenting here have no concept of freedom. The beauty of America is if you don't like the way one busines does thongs, you can go to another. Using government to force people to comply is not Freedom. Should a gay baker be forced to make a cake for an anti gay group? This is a continuing attack on the rights of American's in general, just like telling businesses the can't smoke in them anymore. Just because a business is open to the public does not mean every person has a right to frequent there no matter what.","post_message":"How do YOU feel about this case? Should government be able to force businesses to do things against their will by writing legislation? What do YOU think?"},{"comment_id":"1649214788452320","commenter_b":"She is one ugly mofo ..lol","commenter_a":"So true -- just the respect HE deserves, not his (temporary) office.","post_message":"No problem, Crazy Lady."},{"comment_id":"1911468415618542","commenter_b":"Buy yo mama some food","commenter_a":"All doped up","post_message":""},{"comment_id":"1266839853337023","commenter_b":"Hey Mario, stfu !","commenter_a":"You're an idiot if you think you can light a fire in the airless vacuum of space","post_message":"That classic \"teardrop\" shape only forms because of gravity. So what happens when there's no gravity?"},{"comment_id":"1213204015381722","commenter_b":"Trash talk was and currently still is part LJ personality. Nice try though . Gotcha bitch","commenter_a":"STICK TO BASKETBALL.","post_message":"LeBron is leaving no room for interpretation here."},{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"}]
