[{"comment_id":"10153900410909753","commenter_b":"She seriously thinks you meant the kids! Wow","commenter_a":"how is a fence gonna help if they can just climb up it just as well... they need electric fence for them... its really sad that they r doing sumthing about it after a lil boy lost his life....","post_message":"The Disney World alligator attack that killed 2-year-old Lane Graves in Orlando, Florida devastated the nation. Nearly a week after the tragedy, authorities have just released the chilling 911 call made after the toddler was dragged into the water by an alligator. Calls were made Tuesday evening alerting EMS officials that a little boy was attacked and dragged into a lake by an alligator at the Seven Seas Lagoon resort at Disney World. One of the calls was from a woman presumed to be a... @webpagelink"},{"comment_id":"662046983985880","commenter_b":"She's not worth the used toilet paper in my toilet","commenter_a":"isnt she the wench thast triex to be a whore on every show, even the disney channel?? shes a meaningless tramp with no talent. her father is a meaningless douche with no talent. who cares whqat the slut thinks? shed vote for anyone who could give her a good orgasm","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"475516605979471","commenter_b":"Getting a little tired of the, \"MUSLIMS\" trying to change our great country of AMERICA!!! If you infidels don't like our country, please feel free to go back to where you came from or if you're an American muslim, get used to our way of life or ship out & go to a muslim country from which they came. I'm sure they need you in those countries since so many have migrated here.","commenter_a":"So then go eat at Camel humps grill","post_message":"McDonalds, KFC, And Pizza Hut Say No To Halal Meat And Muslims Are OUTRAGED  There is no reason why they should have to change their business for them.  Do you support these food chains?"},{"comment_id":"1026504997444125","commenter_b":"God Bless this good hearted little boy. May he heal fast. 🙏❤️","commenter_a":"in my prayers...","post_message":"So sad.  A 7-year-old boy who spent 2 years growing his hair out to make wigs for cancer victims has found out he has cancer too.  Prayers for little Vinny. Details:  @webpagelink"},{"comment_id":"10157235838770231","commenter_b":"Because they are white? And black thugs will get arrested because they are black very simple?","commenter_a":"Privileged, yes. I'm not convinced about the White part. Jameis Winston was accused of a much more serious crime but because he is an athlete he was shielded from those repercussions. And let's not even get into Bill Cosby.","post_message":"It must be nice to be white and entitled."},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"\"Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."},{"comment_id":"1260088087350033","commenter_b":"Do not tell her to shut her mouth! That will change the odds of her getting pregnant from 1 outta 3, to 50-50!!!!!","commenter_a":"Her parenting advise is about as competent as her \"abstinence\" advise. Practice what you preach, or better yet, shut your mouth and fade away to oblivion.","post_message":"Pathetic."}]
