[{"comment_id":"10153487799954087","commenter_b":"This was Trumps plan the hole time.... They followed like a bitch in heat... And she did.... Trump just out smarted them again... We will see him on TV along with the debate","commenter_a":"Little baby Trump can't handle having Megyn as a moderator. What a sorry excuse for a presidential candidate.","post_message":"#BREAKING: Donald J. Trump accused Fox News of \"playing games\" and said he would skip Thursday's Republican debate in favor of an event to raise money for Wounded Warriors."},{"comment_id":"1204381342954945","commenter_b":"something wrong","commenter_a":"What the hell???????????????????","post_message":"The UK government buildings put in hock to Muslims"},{"comment_id":"10152602775901636","commenter_b":"She could have kept going, but she also could have allowed the crazy lady to get a great distance away from her. She had a kid in the car. Why engage someone and put yourself and your child in danger? I do not blame the victim, however, she could have made the decision to pull over for 3 minutes or so to put some distance between them.","commenter_a":"Maybe that was the road she needed to take? So it's her fault for continuing to drive like she's supposed to??? Geeze","post_message":"Things take a scary turn when the woman stops her vehicle, gets out and walks up to the car."},{"comment_id":"10153137248455329","commenter_b":"Marc Benedict Meine Lieblingsgeburtstags-Torte :)","commenter_a":"Niall Cooke your birthday cake sorted.... :-)","post_message":"The only kind of birthday cake worth having  via @webpagelink"},{"comment_id":"10153846038466336","commenter_b":"Smug calculated shrew. She's nothing short of evil. WHY ISN'T SHE IN PRISON?","commenter_a":"She is a lying self serving witch and she has a list of dead people that believed in her and knew to much that could destroy her and Bill.","post_message":"WATCH: Rep. Jim Jordan questioned Hillary Clinton on emails she sent regarding the motive for the #Benghazi attack.   “You tell the American people one thing. You tell your family an entirely different story,” he said."},{"comment_id":"1147885218663043","commenter_b":"@username , no wall is going up! 😂","commenter_a":"His supporters don't care having an asshole for president , they just wanted a white man .","post_message":"Trump's supporters are not going to be happy about this."},{"comment_id":"10152987583472014","commenter_b":"If you don't want the responsibility of a baby, get yourself fixed or some type of contraceptive","commenter_a":"Punch her in the face","post_message":"A teen mother says she didn't know she was pregnant before delivering a baby girl, but court documents detail chilling details of her searching the Internet for ways to induce a miscarriage while 38 weeks pregnant."}]
