[{"comment_id":"10154789574398132","commenter_b":"Sick people. Why do they need a child when they are idiots","commenter_a":"This is disgusting!!! Hope they rot!! That poor baby. I'm sure he has seen this many times in his short life. I'm sad for him.","post_message":"Ohio police have posted shocking photos of unconscious adults  who they believe overdosed on heroin."},{"comment_id":"905881252841461","commenter_b":"Frigging Brainless Teabaggers!","commenter_a":"Wait, he's flying to Florida with all that has to travel with the president to give a speech about Earth Day? Wouldn't it be better to do it from Washington via satellite and NOT burn all that fuel getting there?","post_message":"With special guest Bill Nye the Science Guy! #EarthDay"},{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"10154308989386028","commenter_b":"Haha no way","commenter_a":"Screw San Diego all the tight pants wearing hipsters they can keep their f****** team","post_message":"A plan to move the San Diego Chargers to Los Angeles is almost a done deal, multiple sources tell NBC4's FredNBCLA. @webpagelink"},{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"},{"comment_id":"956845991041816","commenter_b":"Leave her alone she's a special breed of stupid.","commenter_a":"It looks like a bloody mosque take your baby piglets with you ,oh are animals allowed","post_message":"Mecca unveils world’s biggest hotel with 10,000 rooms."},{"comment_id":"10153917559886770","commenter_b":"Nah, her girl fans drink boiler-makers.","commenter_a":"Amy Schumer fans do not drink beer. They drink fruity drinks with umbrellas in them. And her female fans drink those, too.","post_message":"This doesn't sound good...."}]
