[{"comment_id":"959701630828566","commenter_b":"Joel Mata 😂","commenter_a":"Jasmine Lopez","post_message":"Smh! #WSHH"},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"},{"comment_id":"10152900574094071","commenter_b":"I wonder if after building the wall, he will revoke all immigration permits to Scots and Germans and send his relatives back to Europe ... all expenses paid of course! ;)","commenter_a":"I believe that Jeb Bush will become the next president of the United States.","post_message":"Here are all the best moments from Donald J. Trump's presidential announcement."},{"comment_id":"751484411652421","commenter_b":"It's designed to expand and contract no matter what the fuck it is you do. Stop acting like Waist Training is associated with organ ruptures because it isn't. No woman has ever died from using a waist trainer in our society because we have made vast improvements in it's design. You can't be like \"WELL WHEN YOU'RE PREGNANT YOUR BODY NATURALLY CONTORTS\" It contorts either way. The organ placement isn't even permanent when using a waist trainer it is almost the same exact process except rather than an expand you are placing the pressure in other areas making it look evenly distributed. The entire point is that nobody drinking, smoking or who is Obese (Yes we can tell when someone is obese) should be complaining and bitching at women who are using waist trainers periodically to go out, or to exercise about \"health\" without sounding like an absolute hypocrite. We ...","commenter_a":"So...insanely tight corsets are coming back into style? Didn't we learn anything from the history of these awful garments?","post_message":"Waist trainers are terrible for you, but the media keeps pushing them on women.   To learn more about the health risks associated with waist trainers, follow this link: attn.link/1T22tWr."},{"comment_id":"764404957026018","commenter_b":"I support 100 percent bitch!","commenter_a":"I mean seriously if you support trump you're probably as stupid as a Clinton supporter","post_message":"Geez...what caused this?"},{"comment_id":"10152911718959342","commenter_b":"Start lining up Muslims and illegals until they leave!","commenter_a":"Amen and Amen!!!","post_message":"FIRING SQUADS MAKING A COMEBACK? Utah -- the only state in the past 40 years to carry out a death sentence by firing squad -- is poised to bring back the Old West-style executions if the state cannot track down drugs used in lethal injections."},{"comment_id":"10153991285739091","commenter_b":"How is he disrespecting the vets? I'm confused","commenter_a":"Think of all the people fighting for our country show a little respect 🇺🇸","post_message":"San Francisco 49ers quarterback Colin Kaepernick plans to take his peaceful protest against racial injustice and police brutality \"a step further.\" He says he will donate $1 million to help in the effort."}]
