[{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"10153676490604071","commenter_b":"GEE HIS WIFE DIDN'T TELL ANYONE DID SHE What Crap","commenter_a":"This is coming from the Obama administration not the FBI. This guy works for the president, he will say and do anything Obama wants him to","post_message":"\"Some of our most productive relationships are with people who see things and tell us things who happen to be Muslim.\""},{"comment_id":"1652238444998373","commenter_b":"White girl runs around in black face and its fine, yet if I were to do it the liberals would lynch my saltine american hindquarters.","commenter_a":"She went full retard","post_message":"Wait,... what?  @webpagelink"},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"10152854045581749","commenter_b":"Yeah. ..not so much","commenter_a":"Dear President Mr. Obama May God Bless you And your family.","post_message":"\"I believe Americans are tired of the political back and forth. People want to see an agenda that moves us all forward.\" —President Obama  Read the President's latest message to OFA supporters: @webpagelink"},{"comment_id":"10153727550292300","commenter_b":"Go naked girl! Again and again!","commenter_a":"South beach is super ghetto now.","post_message":"In video taken by witnesses and posted on a website where it went viral, Angelic Valle is completely naked when she “placed a steel chair leg into her buttocks,” according to the police report."},{"comment_id":"10154201657127541","commenter_b":"White terrorists","commenter_a":"When we figure out that words isn't going to change minds of white people best believe if they knew there would be retaliation then they will think twice.","post_message":"Because federal terrorism statutes almost exclusively focus on foreign extremists, he won't face terrorism charges, but he could face 10 years in prison."}]
