[{"comment_id":"10153449417193984","commenter_b":"She is a loser!!!!","commenter_a":"Her Poor daughter .. I bet she was totally humiliated .. and then to have mom remove her from her class mates .. Brutal :(","post_message":"I would have done the same thing.  What do you think?"},{"comment_id":"492044497655936","commenter_b":"Is she for real? Did someone really vote her stupid ass into office?","commenter_a":"Elizabeth Warren is a Douchebag","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153628863174575","commenter_b":"She's just a troll, Crystal. Ignore her.","commenter_a":"I stand with Kim Davis","post_message":"Rowan County Clerk Kim Davis is under fire for defying a judge’s order to issue same-sex marriage licenses.  \"This is how gay people are treated in this country.If nothing comes of this, at least I hope that other people understand that this is wrong. It's just wrong,” said David Ermold who was denied a marriage license."},{"comment_id":"494457030748305","commenter_b":"Bitch u should forgive me","commenter_a":"@username hope u forgive me","post_message":""},{"comment_id":"10153800001886336","commenter_b":"OK all immigrants should loose there language and culture. Derp","commenter_a":"Gop crybabys don't ask me questions the Fox news debate asked basically the same questions does Reince Priebus realize that was the only gop debate to be simulcast on a Spanish network effectively telling Spanish Americans we don't care about you","post_message":"Reince Priebus  told Fox News that aside from making sure “CNBC isn’t hosting and moderating another debate with our candidates,” the Republican Party is going to review “everything” about the debates. @webpagelink"},{"comment_id":"1297507013642106","commenter_b":"STFU dumb bitch","commenter_a":"That bitch & her sleazy family need to STFU","post_message":"Palin should leave President Obama and his family alone."},{"comment_id":"466533816861832","commenter_b":"I don't know why this is article has been shared today, because it will just upset people on a Holiday and just continues to widen the divide between the people. Because we are celebrating our country, our history, and the couragous people who protect our freedom, it seems a little rude and inconsiderate to share this message. And furthermore, I do not believe the data report anymore than I can throw a cow. I believe most of us are equal in how patriotic we are or not.","commenter_a":"Conservatives only THINK they are more patriotic. Why? God, guns and gays......","post_message":"Is this poll right?"}]
