[{"comment_id":"10153301251374087","commenter_b":"Jesse anderson, another perfect example of a bootlicking crypto fascist","commenter_a":"If police are doing nothing wrong they should have no problem being videotaped.","post_message":"The question of whether police are reluctant to enforce the law because they are afraid of being videotaped has become the subject of fierce debate, as experts struggle to explain an uptick in violent crime in some U.S. cities."},{"comment_id":"10155240461128984","commenter_b":"Wow Jim what a brilliant comeback. You most assuredly are a Democrat.","commenter_a":"Another average comment from your average Democrat. Together they all three have a collective I.Q. Of less than 70","post_message":"This is so sad. Our thoughts and prayers are with the family."},{"comment_id":"687362974730217","commenter_b":"It is spelled you're... You are. Your denotes ownership","commenter_a":"What! Let's see Hilary was a lawyer, First Lady, senator, Secretary of State, married to the president of the world and your comparing homes? YUP comical","post_message":"LOVE THIS!!!!"},{"comment_id":"1256931770993517","commenter_b":"Shut-up... and please die!....","commenter_a":"No laws we have on the books would have prevented what happened.","post_message":"\"People on the No-Fly list can walk into a store and buy a gun. That is insane,\" the president said."},{"comment_id":"460068644183716","commenter_b":"Illegals breed for welfare-their U.S. born-anchor babies support them!!!","commenter_a":"how did they get them to start with.","post_message":"Should All Illegals Collecting Welfare Be Deported?  Comment 'yes' or 'no'."},{"comment_id":"544743005709397","commenter_b":"@username go play in you sand box.","commenter_a":"You Trumpeters are rotten to the core to attack a decent man like @username like this. For shame. I supposed flies are attracted to stinking matter, so what else would we expect.","post_message":"Republicans, this is your party. You have to decide who you are. Are you a collection of principles, or are you about a man?"},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""}]
