[{"comment_id":"791848880944157","commenter_b":"The entire so called debate is a joke as always .FEAR CARD PLAYING BIG TIME .....VOTE BERNIE VOTE BLUE GIVE YOURSELF A CHANCE","commenter_a":"I feel like they act like they want to think of us but yet foot in mouth with trump!!","post_message":"Donald J. Trump is a chaos candidate, and he'd be a chaos president. #chaospresident"},{"comment_id":"1144395032262257","commenter_b":"there you go with that section 8 typing again, you must have failed computer class terribly lmao","commenter_a":"All people Trippn over a nigga who didn't stand for the pledge of allegience. And y'all got Nazi's on the mo fucking police force. OPEN y'all damn eyes","post_message":"And the police union says it's no big deal 😠😠"},{"comment_id":"10154437809561491","commenter_b":"Sorry, no. She is front and centre in this kangaroo court of #45. She cannot have it both ways.","commenter_a":"Let the woman live her life. Sure, I cannot stand Donald Trump to save my life. But what is going to set us apart him? We do not judge people based off of the behavior of someone else. That's what being a liberal is all about. Acceptance of each and every person on the basis of their individual character.","post_message":"The Internet is not happy with the latest post by Ivanka Trump's brand."},{"comment_id":"1588802614746840","commenter_b":"You said all the things Hillary and Democrats did, what is Trump's contribution to the development of America? And all you said are lies. Get your facts right! Compare the economy of the country before Obama era and Obama's era. You talk about the Islamic terrorist but you failed to make mention of the domestic terrorism in the country.","commenter_a":"In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","post_message":"Father of Muslim U.S. soldier killed in Iraq: \"Donald J. Trump, have you even read the United States Constitution? I will lend you my copy...You have sacrificed nothing, and no one!\" @webpagelink"},{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."},{"comment_id":"1012656692115433","commenter_b":"Is it a female? Lord have mercy she's dog ugly","commenter_a":"Racist woman","post_message":"Apparently Whoopi doesn't care if the DNC rigged the system.  Why? Because it's against a white guy. #DNC2016"},{"comment_id":"10150671719984999","commenter_b":"Any idea the amount of time it takes to pluck the gorilla hairs off her body and face?","commenter_a":"Exquisite and Gorgeous..","post_message":"Michelle Obama has often made a point of wearing gowns by designers whose backgrounds and cultures reflect the countries being honored at state dinners.  Friday night was no exception. @webpagelink  Photos, clockwise from top: Jim Watson/AFP — Getty Images; Mark Wilson/Getty Images; Luke Sharrett for NYT"}]
