[{"comment_id":"10153334889369369","commenter_b":"Crazy btch","commenter_a":"@username Olivia Salvatore","post_message":"At 3 stories high and 3,000 square feet, this might be America's largest closet.  [\"Secret Lives of the Super Rich\" airs tonight at 10p ET/PT.]"},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."},{"comment_id":"10153490575133854","commenter_b":"Can some one just shut her up for a year or two ? Talk about a bullshiter.","commenter_a":"Take the guns from her handlers!","post_message":"Hillary Clinton Denounces White Privilege, Calls for Taking Guns From ‘Those Whose Hearts Are Filled With Hate’"},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"},{"comment_id":"10153484016796519","commenter_b":"Illegal aliens... is not racist. No mention of race... just ILLEGAL.","commenter_a":"Funny but kind of hypocritical on SNL's part since they gave him legitimacy not that long ago even after he had said racist things.","post_message":"SNL hilariously scorched Donald Trump's supporters last night...."},{"comment_id":"1115505231842557","commenter_b":"Because there are so many foreigners in London working illegally, they can't keep up!!","commenter_a":"They shouldn't be allowed to operate, they're all rip off merchants on benefits, why does tfl turn a blind eye.","post_message":"'How do you charge £600 for half-an-hour?'"},{"comment_id":"1105849479462885","commenter_b":"She kills people and babies why would she care about a beautiful animal she has more money in her family clinton foundation to buy the farmer a new farm. Shes a disgrace .how can people turn a blind eye to what she has been doing to our country.Theres PROOF.SHE HATES AMERICA. SHE LIKES OUR MONEY ..THATS IT","commenter_a":"Love it!","post_message":"I can't believe THIS!"}]
