[{"comment_id":"936212533138468","commenter_b":"Stupid bastards, Mexicans are not the only illegals in this country, canadians, europeans and some Asians... Also blacks are not leading the welfare race, more whites are on welfare than the rest of the races! Let that marinate..... Get your assets out there and pick strawberries if you support trump so readily","commenter_a":"Americans will be lining up - lining up - I tell you - for those lucrative strawberry picking jobs.","post_message":"Turns out America's food production relies heavily on immigrant labor, and our farmers are NOT pleased."},{"comment_id":"1150215321713025","commenter_b":"Yes and I only saw a women that look drugged","commenter_a":"YES YES YES! Are you guys blind. I only saw a pathetic man sniffing,drinking water, making faces. acting like the idiot he is. Never answered a question. Talked about himself. Never said what he would do as president. Next to him stood a confident women who answered questions, with plans for our country future.","post_message":"Would you like to see Hillary Clinton win big this November?"},{"comment_id":"608123169320865","commenter_b":"F**K Oprah .......she's a Racist Bitch.","commenter_a":"Hey. Heads up. Being gay is no more of sin than lying. Stop being so judgmental. Leave that to God. He says to love one another; guess what, a lot of you are clearly struggling with that.","post_message":".............................yikes"},{"comment_id":"257235498048585","commenter_b":"BYE BITCH!","commenter_a":"When we get to the \"Stupid\" ones...your name will be among the first !!","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"1755937964626463","commenter_b":"Then. Fuck u bitch","commenter_a":"He also said white people are the Devil, that Jews and whites are evil and he proposed racial segregation in his speeches to the Ku Klux Klan. Be like him? No thatnks","post_message":"He was truly the greatest, and not just because of his accomplishments inside the ring.  The Free Thought Project  #RIP #MuhammadAli"},{"comment_id":"10152864481646336","commenter_b":"Zeke...you're the kind of kid that gave the bully in school your lunch money every day thinking it would make him like you. Never worked did it. This is a religious war. It's in their unholy book and no amount of appeasement will fix them. Their founders motto was \"CONVERT or DIE\". This is simple stuff. Read it. Understand it and don't give in to it. I admire the cartoonists for their bravery. That COEXIST bumper sticker should be pulled off every car on every liberal college campus and off every Subaru in liberal Minnesota and sent to some Islamist nation. We coexist VERY well. Our early settlers didn't kill the Indians who didn't convert. Our Founders didn't work that way either. We are not the ones who need the lecture. We wrote the book on getting along. They don't care to read it.","commenter_a":"Dear Muslims....COEXIST.... Or get out... or else.","post_message":"They were four of France’s most fearless and best known political cartoonists – all sought out and summarily executed by gunmen in Wednesday's massacre inside the offices of #CharlieHebdo: Stephane Charbonnier, Georges Wolinski, Jean Cabut and Bernard Verlhac."},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."}]
