[{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"1785088471737718","commenter_b":"LOCK HER UP!","commenter_a":"TRUMP NUMBER ONE ALWAYS PRESIDENT TRUMP 2016","post_message":"Thank you OHIO! I am in this to win it - we are going to MAKE AMERICA SAFE AND GREAT AGAIN! Off to Ohio now! -DJT"},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"10154383170579877","commenter_b":"Right","commenter_a":"He didn't become \"more racist\", he already was. Trump just brought out their TRUE COLORS throughout his campaign. Big difference.","post_message":"This woman claims her ex became a \"monster\" during Trump's campaign."},{"comment_id":"1762909607309407","commenter_b":"Hey Trump you going to build a wall for these people.","commenter_a":"Idiot","post_message":"During a Colorado rally on Sunday, Trump unfurled an upside-down rainbow flag with the words \"LGBTs for Trump\" written on it."},{"comment_id":"10152589675067623","commenter_b":"Im on reserve Obama","commenter_a":"And I asked the cable co. to lower its rates!!","post_message":"#BREAKING President Barack Obama sends letter to Congress requesting authorization for the use of military force."},{"comment_id":"1106451702729020","commenter_b":"Go girls. Rape is never justified!","commenter_a":"It's sick that they were still trying to give excuses even though there is never an excuse for rape. Once that girl brought up raping 6 year olds they shut right up! They know it's not right but they're still trying to make up ways to say it's the women/girls' fault. This is so unacceptable and disheartening. 😔","post_message":"These teenage girls are confronting rape culture in India. This is what bravery looks like. (via AJ+)"}]
