[{"comment_id":"10154543040158812","commenter_b":"Not this woman!!","commenter_a":"Hillary and her husband are as dirty as dirty can be! Can't believe this lying, two faced, arrogant broad is the Democratic nominee for President! Thank you women voters for voting for gender instead of what was best for this Country!","post_message":"An impromptu meeting between President Bill Clinton and the nation's top cop could further undermine Hillary Clinton's efforts to convince voters to place their trust in her, highlighting perhaps her biggest vulnerability. @webpagelink"},{"comment_id":"850216208416603","commenter_b":"More BS coming out of this corrupted Liar.","commenter_a":"\"Crooked' Hillary will say anything and do nothing, she is an establishment politician, just like Obama, and will continue down the same path as Obama has taken America for eight years now. Don't be fooled by this fool, America has been fooled enough with these lying politicians. Vote Donald Trump For President, for real change in America.","post_message":"Hillary Clinton responds to the #Istanbul attack."},{"comment_id":"1107986062575198","commenter_b":"Transgendered women do not want to look up your dress or steal your kids. They want to use the facilities.","commenter_a":"When will they wake up?","post_message":"The people that this ad is about aren't disgusting, but the ad is."},{"comment_id":"1493733267320483","commenter_b":"Please go to Danney Williams-Clinton FB page he posted a video called Banished. We need to help this young man by spreading his message far and wide. He may or may not be Bill's son.","commenter_a":"Donald Trump continually tries to deflect his inappropriate behavior towards women by turning it back onto Bill's indiscretions. One issue that everyone seems to be missing is that Bill is NOT running for President. Donald is.","post_message":"Thank you, Michelle Obama."},{"comment_id":"827359944060385","commenter_b":"Hillary is truly a liar.","commenter_a":"Hillary, always evolving while taking corporate money for corporate favors. Show me the speeches from Goldman Sachs so I can see exactly how much of my back you really have... #FeelTheBern","post_message":"Too many trans Americans still face violence and discrimination, just for being who they are. Together we'll fight for safety, respect, and full equality for the trans community."},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"},{"comment_id":"10153641823407217","commenter_b":"Inbreeding for centuries and lack of education. Most Middle Eastern People are genetically incapable of being anything more than what you are seeing. TRUTH. Which is why we MUST contain them. Putin knows....it's why he is working to get them back home to their litter box...I mean sand box Islam is a political movement designed to install Sharia Law...He doesn't want the creatures No-one does. There is NO such thing as a Moderate Muslim- And BTW Zionist Jews are JUST as Bad.","commenter_a":"That's a stupid question! It got that way because Dick Cheney ordered George Bush to depose Saddam Hussein. All HELL broke loose after that.","post_message":"BBC Middle East Correspondent Jim Muir explores the state of the region he's covered for decades."}]
