[{"comment_id":"10154075062351037","commenter_b":"And she banged Frank enough to make Dutch jealous, and to tell him to eff off. 😘","commenter_a":"one classy Lady that loved her husband and her country","post_message":"“She totally saw her role as supporting and defending her husband.”"},{"comment_id":"10154692738382235","commenter_b":"Continue to do what she's done for 20 years, try and destroy the Clintons. Keith Olbermann lays that out bare @webpagelink","commenter_a":"It will be interesting to see what Kellyanne Conway will be doing once Donald is finally embarrassed by getting wiped out in the election, and not only dumps her but blames her for his loss.","post_message":"Kellyanne Conway got A LOT more than she bargained for ..."},{"comment_id":"10154125168701770","commenter_b":"Oh I see how he filled the room he was in Chicago hahaha the city of thugs","commenter_a":"Can't wait for him to be gone!!!!!!!!","post_message":"Democrats really don't want Obama to leave the White House..."},{"comment_id":"10154944041488700","commenter_b":"They are ALL criminals!! It's why they are called ILLEGAL aliens!! All must go!","commenter_a":"If your illegal you will be going ...remove all the illegals criminals and violent sex offenders welcome to the deplorable nation of deportation to keep America safe","post_message":"\"Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave,\" said Jorge Ramos to the Spanish-speaking audience."},{"comment_id":"755872544562858","commenter_b":"Hes a special kind of stupid isn't he!!!","commenter_a":"I think I read Obama sent his people to Israel to interfear in their election. This is like the pot calling the kettle black. Put that is what Bullies do.","post_message":"President Barack Obama says the U.S. must and will take action against Russia in response to cyber interference with the election."},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"10155932451330206","commenter_b":"Don't you think it's time for a woman President!","commenter_a":"Did you catch her phony southern accent from that speech she gave? Just more proof that nothing about her is real.","post_message":"Are you ready to beat Hillary? Join the team that can win in 2016."}]
