[{"comment_id":"485248075011731","commenter_b":"thats one ugly he bitch","commenter_a":"To damn bad","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10152653302261167","commenter_b":"Females can't pass Marine tests. In other words, they can't get out of a foxhole with loaded backpack on. What harm could that cause?","commenter_a":"Those women go through the same training as the men, do they not? Are you going to insult all of our enlisted women by telling them they aren't combat capable?","post_message":"The man who the U.S. military kicked out of Iraq for divulging  sensitive information about troop locations has some thoughts on women in combat."},{"comment_id":"577516445785152","commenter_b":"Sarasota canceled the witch!","commenter_a":"The pumkins look just like trumps he ad. Lol","post_message":"WATCH LIVE: Hillary Clinton continues to campaign in Florida, where she leads Donald Trump 45% to 44%, according to an NBC/WSJ/Marist poll reported by FOX News.  This morning, she's at the New Mt. Olive Baptist Church in Ft. Lauderdale."},{"comment_id":"10153032834297452","commenter_b":"I was waiting for Hillary Clintons campaign team to do this, desperate move. The army rangers officially lead the way of u know what. Ooooo rah to the hoooo ya","commenter_a":"Well done!!","post_message":"U.S. Army Capt. Kristen Griest (left) and U.S. Army 1st Lt. Shaye Haver (right) will graduate Friday at Fort Benning, Georgia along with 94 men. They will be the first women to graduate from the Army's notoriously grueling Ranger School. @webpagelink  Griest said her successful completion of the two-month program shows that women \"can deal with the same stresses and training that men can.\""},{"comment_id":"1581842645443556","commenter_b":"@username We saw that guy with the brains.Did you?","commenter_a":"\"i need all the white people to move to the back\" that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"},{"comment_id":"10152457331185736","commenter_b":"@username try FUCKING OFF!","commenter_a":"143 year old coins and documents where buried in 1795? Something doesn't smell right.","post_message":"The time capsule buried by Paul Revere in 1795 has finally been opened and the contents date back to 1652.  Mobile: @webpagelink"},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."}]
