[{"comment_id":"458392787682348","commenter_b":"I dont think they have been treated bad enough...kick em out of the White House and Ill be happy!","commenter_a":"POS","post_message":"Seriously..."},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate.  Police are the people that keep her safe.  Do you think Beyonce needs to learn some respect?"},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, \"single payer will never ever come to pass\"? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10153850699096955","commenter_b":"She got too big for her britches!!","commenter_a":"All of you hating on Kelly now, probably liked her before she decided she doesn't like trump.","post_message":"SCALIA'S SON BREAKS SILENCE"},{"comment_id":"10153943709566509","commenter_b":"Humans ruin everything they touch.","commenter_a":"why kill the bear!!!!!! humans were encroaching on it's territory! makes me ill","post_message":"Fatal human-bear encounters in Yellowstone National Park are rare, a spokeswoman said. @webpagelink"},{"comment_id":"1151823781577341","commenter_b":"He claims he knows more about Isis than any one else","commenter_a":"As a Vietnam vet I may be able assist in the area of adjectives for Trump. I prefer using the term chicken-hawk. It pairs well with draft doger.","post_message":"This one is PERFECT."}]
