[{"comment_id":"1411157285603697","commenter_b":"Californians will get tired of being victims eventually and deal with these guys.. meantime lets send liberals refuges and illegals to them","commenter_a":"Brown is a two-time failure as governor.","post_message":"More are coming..."},{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."},{"comment_id":"1411832842165706","commenter_b":"No sympathy here...he's a paid hack for Hillary...and so he just lost all credibility..He supports sharia law,with connections to her foundation and Saudi's...he has worked on policies for moohslim immigration into this country..He's dangerous and a radical.....Of course we find this out after the fact...which were lie perpetrated by the left..progressive librals..with an agenda....always a strategy and agenda..!!!!!!!!!!!!","commenter_a":"You are correct Rush, he needs to move away from attacking the attacker (old Scientology technique) and focus on his message.","post_message":"If Trump does not start seeing things through an ideological prism, he will never understand the method, the motive, and the how and why these attacks against him happen."},{"comment_id":"10153664039221350","commenter_b":"Liz.....STFU!","commenter_a":"I am seriously sick of the name Caitlyn Jenner and anything with a Kardashian in it. How about reporting on something worthy or being considered interesting.. or a news story.","post_message":"\"I think about my life  and where I'm at in my life right now,\" Caitlyn Jenner told Matt Lauer. \"What a tremendous experience this is.\""},{"comment_id":"10154034099273855","commenter_b":"I can't say anything to them they haven't already been told. I simply want to send them all a HUGE middle finger and kick in the ass!","commenter_a":"The sad face of intersectionality.","post_message":"Yes, Virginia, there ARE out Republicans."},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"10153286048671717","commenter_b":"Hideous bitch","commenter_a":"If u don't like the laws, move No one is keeping u here.","post_message":"Indiana legislative proposals: Washington florist to testify against LGBTQ protection bills"}]
