[{"comment_id":"10154332643707686","commenter_b":"According to a new Congressional Research Service report entitled Executive Authority to Exclude Aliens, the last 5 presidents have used executive authority to limit or restrict the entry of immigrants and non-immigrants into the U.S. a total of 43 times. Ironically, it appears that President Barack Obama used this authority more frequently than any of his predecessors, exercising it a total of 19 times during his two terms in office. Here's the breakdown of how many times each of the past five presidents issued such orders: Ronald Reagan - Five times George H. W Bush - One time Bill Clinton - 12 times George W. Bush - Six times Barack Obama - 19 times","commenter_a":"Waters, Polosi, Shummer, Warren and a whole bunch of other libtards need to be slapped up side thier heads.","post_message":"Rep. Maxine Waters:  \"I have not called for the impeachment (of President Donald Trump) yet. ...\""},{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"1096918067034607","commenter_b":"It's up to a woman if she wants to wear both rings or just 1 of the rings. She is married now so she has the choice","commenter_a":"I thought it was the plain gold wedding band that was important, not the engagement ring. That's why it's called an engagement ring. You don't have to wear it once you're married.","post_message":"Amal Clooney wants a smaller engagement ring"},{"comment_id":"10154704981818812","commenter_b":"Shut up Ayesha","commenter_a":"NBA is rigged!","post_message":"U.S. men's basketball team earns gold for third consecutive Olympic Games and the sixth time in seven tries with NBA players."},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10152608268042452","commenter_b":"I know right she's thick not plus size","commenter_a":"She doesn't look so plus to some of us who are","post_message":"There's a big change coming to Sports Illustrated's swimsuit edition. For the first time, the magazine will feature a plus-sized model on its pages.  Model Ashley Graham will appear in a campaign for \"Swimsuits For All\", heralding a new chapter in the magazine's famous swimsuit issue.  So what do you think about a plus-sized model gracing the pages of SI? A sneak peek tonight at 11 from ABC7 Eyewitness News. abc7.la/1zifFNK"},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"}]
