[{"comment_id":"1406366476070873","commenter_b":"not a terrorist...a beautiful goddess.","commenter_a":"Isis Murda Spence :)","post_message":"\"Love your name. Cherish your name.\" Words of wisdom from a girl named Isis to others who share her moniker."},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1546155322346073","commenter_b":"A Butt Ugly Bitch!","commenter_a":"How sad he is But...wait pediphiles will be the next protected people","post_message":"This is the crux of the problem"},{"comment_id":"10154550859487464","commenter_b":"There are much better health coverage alternatives out there. Feel free to private message me for details.","commenter_a":"We tax payers all got fleeced big time.","post_message":"“The reality is the Affordable Care Act is no longer affordable for increasing numbers of people.”  #FullRepeal: @webpagelink"},{"comment_id":"10153147899391636","commenter_b":"the womans a simpleton","commenter_a":"And MPs should be treated like....... ?","post_message":"What do you think of Kerry McCarthy's comments?"},{"comment_id":"10152816476327093","commenter_b":"Learn to speak english, illegals","commenter_a":"The only crime committed by police was that they did not deport him previously when he committed prior offenses","post_message":"Even though a grand jury didn’t charge a Grapevine officer for a deadly police shooting, the family of the man killed says the case is not over…  WATCH: @webpagelink  READ: @webpagelink"}]
