[{"comment_id":"10154617717319255","commenter_b":"\"...ignorant and moronic assumption...\" \"...liberal mindset of free everything...\" I'll just leave that there where it belongs.","commenter_a":"I am a conservative who volunteers for children's charities, doesn't care if same sex couples marry, is pro-choice, owns a hand gun but doesn't believe any private citizen needs an Uzi, am a military spouse so obviously vehemently support our military (active and retired) and work in the public school system and believe those who work hard and succeed in high school deserve a break in college tuition. I'm sorry I don't fit in to your ignorant and moronic assumption that all conservatives are alike.","post_message":"Pretty much.   Thanks to Northern Michigan Progressives for sharing."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy.  READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10153584880961336","commenter_b":"@username , IT should be ALL who are here illegally as they ALL have committted a crime by INVADING this country","commenter_a":"So, let me get this strait... Trump is going to deport all immigrants, and take away citizenship from persons naturalized in the United States....That is going to be a lot of deportation since we all have immigrant backgrounds so who is going to check the Family Trees to see how far it goes back..... and who's going to be the \"Gate Keeper\".... I wonder if Trump will also deport himself and his family as well or he planning on being the only person left in America....","post_message":"Donald J. Trump pledges to eliminate the \"biggest magnet\" for illegal immigration by ending birthright citizenship for the children of illegal immigrants. @webpagelink"},{"comment_id":"480665305471830","commenter_b":"Dumb, ignorant witch","commenter_a":"Speaking of frauds!! Having a convicted felon as your top surrogate makes me wanna puke. She is spewing lies on every network, when is this P.O.S. going to be held accountable?#KatrinaPierson","post_message":"YES!"},{"comment_id":"10152591855036636","commenter_b":"An attractive white girl dies. Everyone loses their minds.","commenter_a":"Oh dear . Was going to say . Oh my God . Hmmm. There are many people out there that need help . Just look around and you will be amazed . Some think that is the only way out . Look deep before before you criticise .","post_message":"Tragic."},{"comment_id":"10155458466225354","commenter_b":"Just a bunch of average women.","commenter_a":"I still cannot wrap my head around the positive reinforcement people give instead of being honest and constructive. Don't take her to dinner, take her to the gym.","post_message":"\"They’re no angels—and they own it\""},{"comment_id":"10153943108472042","commenter_b":"Break that glass ceiling girls!","commenter_a":"Media prepping questions for war lmao","post_message":"Do you think women should be required to register for the draft?"}]
