[{"comment_id":"10153161344347507","commenter_b":"with balls like that, she is a man","commenter_a":"Maybe she'll find same sex love in jail and change her tune","post_message":"If she didn't want to do the job she was elected to do, why is she still there?"},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"1247325575291461","commenter_b":"Third *","commenter_a":"That's a fair shout but we killed them all off and interbred with them now we have evolved and are the last stage you see before your eyes, religion is cool except for when it blinds you and # Christianity is young as fuck compared to other religions fam","post_message":""},{"comment_id":"1382199778464035","commenter_b":"Your a bitch","commenter_a":"I'm sure the First Sasquatch offered so much advice, what did she do...come to the defense of her brother Harambe?","post_message":"First Lady Obama took apart Trump, and just gave Republicans even more to worry about."},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"},{"comment_id":"1377436272296841","commenter_b":"Go girl.","commenter_a":"Iowa thanks you Hillary! God, what an embarrassment King is to our great state.","post_message":"Clinton isn’t letting this bigotry go unnoticed."}]
