[{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below.   Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"10153760564233812","commenter_b":"Douche","commenter_a":"Well, they did turn off the steelers radio headsets, but hey it is the cheating Pats!","post_message":"With \"Deflategate\" behind him, Tom Brady was back to his unstoppable self: @webpagelink"},{"comment_id":"10155183488410725","commenter_b":"He's an idiot and so is she. Standing there looking at him talk his crap. It's ridiculous.","commenter_a":"He's a freaking moron","post_message":"Kanye West's rushing the stage at last night's Grammys wasn't a joke after all, it seems----> @webpagelink"},{"comment_id":"10152906075606336","commenter_b":"@webpagelink In case you wanted to read the rest of what Seth Rogen had to say, not just the original tweet that was blown WAY bigger than it needed to be.","commenter_a":"Well said craig","post_message":"Country music singer and military veteran Craig Morgan fired back at Seth Rogen for his American Sniper comments. @webpagelink"},{"comment_id":"10157022006200725","commenter_b":"Crooked she is in everything!","commenter_a":"anything related to Hillary would Just get worse if she is in office","post_message":"Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"},{"comment_id":"10154381959259062","commenter_b":"The woman is rubbing oil on her breasts and her baby and going viral with it. Who is the pervert? It's obvious she is!","commenter_a":"I think woman should also think about how easy it is for these pervs to get these pics for free off of your social media while exercising your right to expose your self feeding your child in public. Or even a perv sneaking a pic of you breastfeeding in public. While your child and your breast may end up on one of the sickening child molester sites.","post_message":"Officers found out about Felten when a Wisconsin man downloaded several videos and paid for them using a PayPal account."},{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."}]
