[{"comment_id":"1031885216864241","commenter_b":"no kidding wow","commenter_a":"Kerry is a moron!","post_message":"If only he could've predicted their reaction..."},{"comment_id":"10152640565354135","commenter_b":"BOOO ! Fix our roads , decriminalize drug use ( since our prisons are flooded with NON violent offenders wasting everyones tax dollars on free room and board), allow Tesla Motors to do business in our state, handle the heroin epidemic going on in our cities and sub-urbs , preserve more forrest and farm land ............. He's not doing his job , he's pressed for his future candidacy for the white house , neglecting the nuances in his community.","commenter_a":"Go @username 2016","post_message":"America has been a nation that has always controlled events and yet today events control us. Why? Because leadership matters. It matters if we want to restore America's role in the world, find the political will to take on the entrenched special interests that continually stand in the way of fundamental change, reform entitlement spending at every level of government, and ensure that every child, no matter their zip code, has access to a quality education. So, today I am announcing the launch of the Leadership Matters for America PAC. The PAC's goal to get real leadership back in our country starts today. So, let's get to work! Join us at: @webpagelink"},{"comment_id":"10153523927041162","commenter_b":"Go marry him.","commenter_a":"I need the money to get out of debt Lord help me omg","post_message":"BIG WIN! A suburban man who likes to play the newest games bought a Golden Casino instant ticket and won $4 million. @webpagelink"},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."},{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"655930237930888","commenter_b":"Shut up fat ass racist bitch","commenter_a":"Yes","post_message":"Oprah goes on a ridiculous rant about why Americans 'disrespect' Obama.  Get this liberal trash of the air already.  Do you think Oprah is the racist?"},{"comment_id":"10153738267915575","commenter_b":"Who cares about Christians,the Muslims are under stress .fix it now","commenter_a":"Same rules should apply to all. It's a work place. Screw their constant demands. Suck it up.","post_message":"Sharia Fail"}]
