[{"comment_id":"10156794675835389","commenter_b":"That's what happens when you allow undocumented immigrants flood into your country, Duh....","commenter_a":"So where is the UN? What is the purpose of th UN? How much money does the UN get to do nothing to help","post_message":""},{"comment_id":"892830167500429","commenter_b":"Well when you're being raped - tell me about that theory again or in a 'dickless' gun free zone. (Hahha)","commenter_a":"Tell them if you knew you had to play inthe park, you would have brought a bigger bat.","post_message":"They have hunting... And dicks on their brain! @webpagelink"},{"comment_id":"10153752724022016","commenter_b":"In her ear? Why the hell would she listen after she is elected, considering she's not even listening now, when she needs our vote? I doubt she'll hear a damn thing, once she swears that oath. The revolution isn't dead, but its not gonna happen through or in the DNC.","commenter_a":"SOCIALLY THERE IS NO OTHER CHOICE, ITS HILLARY WITH SANDERS AND WARREN IN HER EAR! THE REVOLUTION IS NOT DEAD! -?","post_message":"\"Emphasizing the negatives of Donald Trump, while certainly easy to do, will not be enough to get millennials to support Hillary Clinton. The Clinton campaign needs to unapologetically embrace issues that will inspire this critical millennial voting bloc to come her support.\"  Otherwise...."},{"comment_id":"1256816384396895","commenter_b":"Then those women will one day regret their stupidity!!","commenter_a":"The Clinton's know there in trouble with the common voter. So now they are trying to go woman power... so tragic.... but a lot of women will vote just cause she is a woman...","post_message":"Chelsea Clinton recently tried to stump for her mom on local TV at a rally in Michigan. Later on, she wore a shirt that had a LOT of people talking.  What do you think about what was on Chelsea Clinton's shirt?"},{"comment_id":"10153448230456680","commenter_b":"@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"10153067391792217","commenter_b":"One day all Europeans will see how big mistake s to accept those who come as victims and in the future their children will try to impose sharia law","commenter_a":"It's a big mistake Europe is doing. They will regret in 10 yrs time. Why can't the arabs countries take them. Sorry for the Europeans. They will lose their freedom for sure.","post_message":"The plight of people trying to reach Europe is moving many to declare \"Refugees Welcome\"."},{"comment_id":"10150614186964999","commenter_b":"Amen. However they are supposedly there to educate humans. In some cases it is educating them. Unfortunately not in all.","commenter_a":"Happy would be happier with other elephants. However (if you read the article), her buddy Grumpy was killed by the other two elephants when they charged him. The Bronx Zoo is not bringing in any more elephants and would put Happy at risk with the two they have. She does need to be moved to another zoo. Maybe they all do, but there is no guarantee she will be accepted with other elephants. Sad, but maybe it's time to focus on getting rid of zoo's altogether and leave these animals in their natural habitat where they belong.","post_message":"For close to a decade Happy has lived alone, separated from the zoo’s 2 other elephants. Her solitary existence is quite unlike the life of a wild elephant."}]
