[{"comment_id":"452057048331142","commenter_b":"I'm in love I think! She hit the nail on the head.","commenter_a":"You tell'em Grans....","post_message":"Race-Baiting CNN Host Is Shocked At Grandma Answers To His Questions:  is no such thing as  privilege' [VIDEO]"},{"comment_id":"10153311119075329","commenter_b":"I want to know how many of the women that are saying \"I use soap to clean my vag !\" Are really only using soap on their vulva and are NOT actually sticking soap in their vagina.","commenter_a":"Jonathan Perez hahahzha jk","post_message":"FYI"},{"comment_id":"10152850363352217","commenter_b":"Women should be allowed to wear what they want to. It should be a free world for men and WOMEN","commenter_a":"This is the silliest thing ever!","post_message":"Why two opposing campaigns about what women wear are spreading across the Arab world bbc.in/1LU4ka8"},{"comment_id":"1695225903839696","commenter_b":"Oh that won't be left leaning or anything....","commenter_a":"Didn't know 60 minutes was still on","post_message":"You get a story. And you get a story."},{"comment_id":"713646192159292","commenter_b":"Illegals wait in line like the rest.My dad came from Mexico when he was 5 years old the right way.He fight in WW2 in the Philippines.When we grew up we only spoke English.My dad said we are Americans.Every nationality has to wait in line.We can say this and that about are country but,this is the greatest country to live in.Citizens have to get off welfare get get a job.Stop being lazy,so illegals won't find work he.Government has to do there job.Find company's that higher illegals.God bless America land of the free.","commenter_a":"Seems simple enough- whatever happened to common sense?","post_message":"Share if you agree."},{"comment_id":"1742724086013339","commenter_b":"Go Girl!","commenter_a":"So good","post_message":"Live from San Diego: Watch as Hillary speaks on smart foreign policy, keeping our country safe, and why we can't afford Trump as Commander-in-Chief."},{"comment_id":"1198334626915656","commenter_b":"Bitch","commenter_a":"@username u need this","post_message":"'Bout time."}]
