[{"comment_id":"10153918946326162","commenter_b":"Calling a 15 year old young lady a hoe Definitely shows your maturity level.","commenter_a":"Dear 15yr old girl, you put yourself in that position. Those are the risks of taking nude pics. SUCK IT UP, HOE.","post_message":"EXCLUSIVE: A Bolingbrook High School student says nude pics of her were posted online as retaliation for fight. @webpagelink"},{"comment_id":"10152820448531051","commenter_b":"John Jo, you say, don't fight the battle until they come knocking on your door, well how many Americans have been killed, beheaded, this isn't knocking on our door ,than what is. He's the BIGGEST POS TRAITOR WE HAVE EVER HAD, HE WILL GO DOWN AS THE WORST PRESIDENT IN HISTORY. HIS ONLY CLAIM TO FAME, HE TRIED TO DESTROY THE UNITED STATES. HIS ASD SHOULD BE IN PRISON.","commenter_a":"Thanks to Obama!!!","post_message":"As if ISIS didn’t have enough weapons at their disposal – now they have chemical weapons."},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"2049944575230110","commenter_b":"Should have Shot those idiots","commenter_a":"Awwww poor police. .. terrible. . They r great people who never ever do any wrong. . I wish I could be sad for that mf... but I'm not","post_message":"OFFICER ASSAULT: A crowd watched as 2 people became entangled with an officer. Those 2 face charges after this video surfaced.   STORY: @webpagelink"},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"920378308055224","commenter_b":"Chris, stupid bitch, For Real, and there's the hate card you stupid impotent motherfucker.","commenter_a":"Hey it could have been done sooner. White priveledged males prevented it.","post_message":"EXCELLENT news!"},{"comment_id":"996483170392155","commenter_b":"She needs to go sit in the snow for a few decades..","commenter_a":"She is a regular stand up comic! Keep it coming Sarah...we all need a good laugh.","post_message":"If her goal was to make sure people still know she's an idiot, she succeeded."}]
