[{"comment_id":"10155813559759778","commenter_b":"Very heartbreaking and moving commercial...but unfortunately there still has to be something done about ILLEGAL immigrants coming into America. The Mexican President Enrique Pe Nieto could do something to help make their country better so the Mexican people would want to stay in their own country. I am sure he doesn't mind allowing the criminals to come here and apparently he doesn't care about the poor either, but something has to be done to protect our America.","commenter_a":"I loved it. Saw the ending...Touching.","post_message":"Budweiser isn't the only company to tackle the politically heavy topic of immigration in their Super Bowl commercial this year."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10156320084670354","commenter_b":"The most disgusting women on this planet !!!!","commenter_a":"why are these women so adamant on murdering of innocents?","post_message":"WATCH Whoopi Goldberg and Joy Behar unload on Dr. Ben Carson..."},{"comment_id":"10153572355174575","commenter_b":"Look people I'm not trying to insult anyone but we have the most advanced technology in the world and your telling me that there is no way the government can find out 9f she sent classified e-mails or not? Who the f#### are we kidding. The truth is she did not and they want to put that thought in people's minds. Those that believe it must be stupid (no insult intended). They just do not want her to be president. Hillary Clinton out of all the candidates is qualified to run this country. I don't care what anyone says.. every one has a right to an opinion and this is mine. HILLARY CLINTON 2016","commenter_a":"Clear she is nothing but a lying scum bag","post_message":"“I am confident that I never sent nor received any information that was classified at the time it was sent and received.”   Democratic presidential candidate Hillary Clinton addressed media in Iowa on Saturday, adding that the latest controversy is an example of disagreement among various parts of the government about what should or should not be publicly released.  Her remarks come after The New York Times reported Thursday night that inspectors general for the intelligence community and the State Department had asked the Justice Department to launch a criminal investigation into Clinton’s possible mishandling of classified email."},{"comment_id":"10156404407160354","commenter_b":"You dumb bitch","commenter_a":"what an idiot!","post_message":"Terrorists just need a hug and a lollipop...."},{"comment_id":"553000848198682","commenter_b":"More illegals are prosecuted in the state of Florida than any other state for voter fraud. It goes on everywhere though. I agree, there should be further evidence required to prove you are a citizen. Maybe a place on your driver's license should be reserved for this information. Not only are these illegals breaking the law to come here, they are electing people like Marco \"The Chihuahua\" Rubio to be their senator. Oh, and Google: \"Rubio Gay Arrest\" to see what Rubio likes to do in his spare time.","commenter_a":"Voter fraud has been proven in tx. People voting for trump are seeing their computer vote switched to Rubio, and cruz. And let's not forget, that the kkk is backed by the democratic party.","post_message":"We are #WINNING - #TrumpTrain! Thank you for your support. Lets keep this going! WE WILL MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1318079928223893","commenter_b":"Get out of White House. NOT MY PRESIDENT.","commenter_a":"still trying to convince America that he wasn't the worse president ever","post_message":"President Obama holds a press conference with Greek Prime Minister Alexis Tsipras. It is the final overseas trip of his presidency."}]
