[{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"10154082437051051","commenter_b":"As usual she is lying.","commenter_a":"Wrongagain.","post_message":"Hillary Clinton says there's no question Obama will go down in history as a successful president. Is she right?"},{"comment_id":"10154005509605575","commenter_b":"Go back to Canada you slimy rat","commenter_a":"THIS IS THE MAN THAT HELPED DEVELOPE NAFTA FOR THE BUSH'S IN ORDER THAT WE WILL HAVE OPEN BORDERS","post_message":"Trump blasts Natural born Canadian Ted Cruz..."},{"comment_id":"10153395040141336","commenter_b":"Because she and her mother are bible thumping morality pushing hypocrites. That's why.","commenter_a":"Why is it Bristol Palin gets pregnant and the liberals trash her, YET are proud of all the welfare momma's who have a half dozen kids, with several different donor dads, at the taxpayers expense? Bristol supports herself.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"1436165433143173","commenter_b":"We non-native people are all illegal immigrants. Nobody gave us permission to live here.","commenter_a":"Somebody needs to read History books this country was owned by Native American Indians (@username) we all are immigrants in this country","post_message":"This mother speaks for the millions of people who live in fear of Trump's deportation squads."},{"comment_id":"10153765573361336","commenter_b":"ISRAEL WAKE UP FOR EVER Israel must wake up, get up, 90% Arab are Terrorists !! ISRAEL Must Destroy your enemies, terrorists and traitors in your country and out, do not sleep, do not sleep !! Palestinians & Obama are the Biggest Lie in History ! Jerusalem Never mentioned in the Muslim Koran !! Jerusalem is written thousands of times in the Torah, Jewish Bible !!! No loyalty = no citizenship !!!! Israel You are Lucky !I the Arab leadership Started today to murder Jews.!! in 2020, then the Jews would have found sleeper, wake up ! Never were Palestinians ! tribals killers today call themselves Palestinians ! Different tribes of killers arrived in Israel since 85 years and they want a country !? Please Supreme Power Main, Creator of All the worlds & Souls, please GOD Bless the IDF and ISRAEL for Good. Destroy all the enemies of Israel ...","commenter_a":"It's absolutely BS that I had to go to Afghanistan twice in order to afford college. Making public higher education institutions tuition free isn't a bad idea at all. If we can pay for a war in Iraq then we can definitely pay for college. It's an investment in America. That's the first step on how you make America great again. #feelthebern #bernie2016","post_message":"President Barack Obama's message to U.S. troops in Afghanistan: \"I do not send you into harm’s way lightly… but as your commander in chief, I believe this mission is vital to our national security interests.\" @webpagelink"},{"comment_id":"10153853920168145","commenter_b":"Athena Marigold absolutely","commenter_a":"Athena Marigold it's in the paper","post_message":"#BREAKING A shot fired during a domestic dispute hit new father Brian Mortensen as he worked on a nearby fence. On Wednesday, he died."}]
