[{"comment_id":"713646192159292","commenter_b":"Illegals wait in line like the rest.My dad came from Mexico when he was 5 years old the right way.He fight in WW2 in the Philippines.When we grew up we only spoke English.My dad said we are Americans.Every nationality has to wait in line.We can say this and that about are country but,this is the greatest country to live in.Citizens have to get off welfare get get a job.Stop being lazy,so illegals won't find work he.Government has to do there job.Find company's that higher illegals.God bless America land of the free.","commenter_a":"Seems simple enough- whatever happened to common sense?","post_message":"Share if you agree."},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"1115809875115612","commenter_b":"So basically since federal funds cannot go to abortion services you are going to punish tens of thousands of citizens who rely on the other 97% of services that they offer. Nice job. I see you really are the pro life party.","commenter_a":"How can it be that after viewing the videos and seeing the sonograms that people can STILL only talk about the \"rights of the woman\"? How can that be? And the sad thing is the terrible damage abortion does to women and many men.","post_message":"BREAKING: The House has passed #HR3134, my bill to freeze all federal funding to Planned Parenthood. Grateful to every Member of Congress who stood for life and supported this compassionate measure. The fight is just beginning!  #ProLife #DefundPP"},{"comment_id":"1712814082319419","commenter_b":"Disbar her. So corrupt!!","commenter_a":"Prison for treason","post_message":"Continuing Live Coverage: Attorney General Loretta Lynch testifies before the House Judiciary Committee on the DOJ's decision not to charge Hillary Clinton over her personal email use while secretary of state."},{"comment_id":"10153757259492293","commenter_b":"It's really about saving cash if you don't need boxes remotes and other material it cheaper on your end but much cheaper for them","commenter_a":"Awesome! Tired of the wires and boxes! Yay!","post_message":"This could be a win-win."},{"comment_id":"1227830950637889","commenter_b":"What a idiot, Mexico is NOT going to pay for any wall","commenter_a":"the worst. the absolute worst.","post_message":"With the inauguration only 15 days away, how are you feeling?  Here's what Donald J. Trump says he will do during his first 100 days in office: kiro.tv/TrumpsFirstDays"},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"}]
