[{"comment_id":"10153380454004270","commenter_b":"Well lady if you want the horrors of War you go for it.","commenter_a":"Can they take the mental pressure of War. And getting raped by someone like ISIS?","post_message":"\"I think women are showing they can do the job. Physical capability is not the issue; it’s men’s acceptance of women that’s the issue.\""},{"comment_id":"10154534424443984","commenter_b":"If these Punks hates us and hates the American Flag , why ????? Do you live here I'm sure if we came over your home place we would be killed","commenter_a":"I agree. If America is so bad for these buttheads, get the heck out of our Country!!! Second, if any of these a-holes are getting assistance from our Federal Government (alias all of us), STOP THAT SUPPORT NOW AND FOREVER!!! The people who fought and died for that Flag to fly is the reason these a-holes can be protesting in the first place. I would put them on a plane like the other person said, but instead of flying to ISIS country, I would just drop them out over the middle of the Atlantic and see how well they swim. Hopefully they will swim in the other direction from our Country!","post_message":"The protesters in Cleveland thought they could get away with burning an American flag in the streets... but they never expected who was coming right for them.  This is America, punks... don't mess with Old Glory."},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"1115311211854904","commenter_b":"We don't need more people coming here from anywhere. Immigration is to benefit the country not the immigrant. We gain nothing by allowing more here when we can take care of our own","commenter_a":"North Carolina here voting TRUMP 2016","post_message":"\"I'm the only one that speaks my mind and tells the truth and everybody knows I'm right.\"  Today on \"MediaBuzz,\" Donald J. Trump discussed his proposed temporary Muslim ban. @webpagelink"},{"comment_id":"933938620044552","commenter_b":"Big money and those they have bought don't want us to know what is happening!!!!","commenter_a":"My understanding of this pipeline is that it is not considered a national pipeline, bypassing congress and the Whitehouse and following state guidelines in each state it passes through. Could this be right?","post_message":"Why theres a media blackout on the native american oil pipeline blockade"},{"comment_id":"10153720833452098","commenter_b":"@username LOL, Some women are so dumb !!!","commenter_a":"Straight men are so great.......LOL","post_message":"JUST IN... The victim was found lying outside of a vacant home with critical injuries. She later died at a nearby hospital"},{"comment_id":"10153823736048128","commenter_b":"Gee Rickie: thanks for clarifying this And, I know my geography idiot; I was referring to Europe in a cultural sense. Did you forget to take your Autism meds Rain Man? By the way, we thick Yanks haven't allowed an invasion of Muslims into our Country on a scale no where near proportional to your own Country. Your Nation is finished you morons! So, go choke on a hookah you snarly toothed Lime!","commenter_a":"Why bother at this point when they are allowing millions of Islamists to openly invade Europe?!?! Seems like an exercise in futility or just some good media PR to appease scared & irate native Europeans.","post_message":"Authorities in Italy, Germany, Switzerland, the U.K. and Scandinavia searched 26 premises and seized electronic devices and documents."}]
