[{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child.  “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10155047256148139","commenter_b":"Throw out the injunction & restore the ban","commenter_a":"this idiot can't even talk","post_message":"Listen: Oral arguments taking place regarding President Donald J. Trump's immigration executive order."},{"comment_id":"604736083067982","commenter_b":"Duuude, no he doesnt. He definitely and truly does not mean that. From the bottom of his good heart he really doesn't want people to support her fracking, wall Street, lying ass.","commenter_a":"Love ya Bernie but, not a chance in hell I will give that pos garbage my vote! Not like it matters anyway I have lost all faith in the US government and any honesty within.","post_message":""},{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"\"The Brig it is.\"","post_message":"These pirates never saw it coming..."},{"comment_id":"10153273654150329","commenter_b":"I can't stand feminists.","commenter_a":"Feminist are so fucking annoying.","post_message":"\"Meghan Trainor needs to take a women's studies class at the Taylor Swift school for pop stars who can't feminist good.\""},{"comment_id":"611157035758918","commenter_b":"Deport them","commenter_a":"I would hope the FBI is investigating this organization for violating a US law!","post_message":"The \"religion of peace\" strikes again..."},{"comment_id":"10153935063641636","commenter_b":"There is more evidence for the existence of spongebob than your nonsense.","commenter_a":"(B.A. Bible/Biology)* NOT MILLIONS OF YEARS OLD! Evolutionary dating methods are not infallible science, are based on certain built-in assumptions, and have been proven to be contradictory and inconsistent. Please read my popular Internet article, ARE FOSSILS REALLY MILLIONS OF YEARS OLD? There a lot of evidence that the fossil layers were not deposited by gradual floods, which would have required millions of years. Rather, the evidence strongly points to a one world-wide flood that fossilized species, just as the Bible teaches. The fossil layers in the real world are not even found in the sequence taught in evolutionary textbooks. There are many places where fossils of complex creatures are found beneath simpler ones, and there are fossils of mixed species existing in the same stratum which classic evolutionary textbooks teach should have been separated by millions of years. There is absolutely no proof of macro-evolution in the fossil record. ...","post_message":"BREAKING"}]
