[{"comment_id":"986494124719342","commenter_b":"Who cares! Go home where u b long","commenter_a":"They have their country they can go back home anytime. We do not need to have them visit anymore","post_message":"Donald Trump's promise could change EVERYTHING!"},{"comment_id":"879266582115130","commenter_b":"The Zionists regime knows only the language of the gun.","commenter_a":"What can they have to talk about ? I am a pacifist , but in this case i would urge Iran to start building nuclear weapons, or get someone to supply them immediately , then maybe the Zionists will finally show them some respect.","post_message":"The foreign ministers of Iran and the United states kick off a fresh round of talks in the Swiss city of Montreux."},{"comment_id":"937869812915107","commenter_b":"I hope they suspend her license and hope the liar loses her job!","commenter_a":"She should loose her job & be required to stand on corner with sign showing what she is","post_message":"Our favorite ‘just deserts’ of the week!"},{"comment_id":"10153653127786336","commenter_b":"Obama should be deported with all of the illegals...","commenter_a":"make me sick","post_message":"\"The Obama administration is very friendly to individuals who are transgendered who are illegal immigrants. They provide them taxpayer-funded hormone treatments [and] special accommodations.\" – Tom Fitton, president of Judicial Watch, Inc."},{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and \"soul mate\" even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."},{"comment_id":"1333566343323648","commenter_b":"this sow could stand to lose a few pounds.","commenter_a":"That pig in the black shirt ought to be able to hang on for quite a while...","post_message":"When it's all over and they have their ethnic studies degrees in hand, these student activists will never be hungry again."},{"comment_id":"10152987846462483","commenter_b":"Stfu fat cunt","commenter_a":"Chattanooga did lower the flags. A presidential declaration is not necessary for every death that occurs unless it is someone who has national level. A state or city can lower the flags without a presidential declaration. People need to inform themselves about the flag lowering issues. If we lowered the flag for every person that got killed, the flag would never be flown at full staff.","post_message":"Former U.S. Navy SEAL Marcus Luttrell pleads on his Facebook page, \"Think on it. RIP brothers, your families will miss you, the country will mourn you, and those still wearing the uniform will never forget you...Oh one more thing, lower the FLAG!!!!!!!! Sir.\"   The flag has been lowered at the United States Capitol in Washington, D.C., but no word yet on whether the flag will be lowered at The White House."}]
