[{"comment_id":"10152977557517217","commenter_b":"Lady*","commenter_a":"Beautiful England Rose, Princess Diana.....","post_message":"Princess Diana, lion cubs & space safety fears - This Week in History: @webpagelink #bbcrewind"},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"},{"comment_id":"1231733206844027","commenter_b":"I see nothing beautiful about her, she's hateful, that's ugly!","commenter_a":"Michelle Bachmann is a beautiful woman. Too bad....","post_message":""},{"comment_id":"10154746753444657","commenter_b":"@username, while I agree that security along our border is non existent and with the possibility of terrorist using it to their advantage it needs to be dealt with. I think it's a complete fallacy that illegal immigration should be such a focal point in this election. Its not our biggest problem. Our growing deficit and out of control federal government seem to be a bigger threat to our country!","commenter_a":"We are going to loose this election while small minded people focus on small minded things. Stock footage and former adult stars in commercials aren't going to destroy this country the people are! Because they can't seem to focus on the problems we are facing and examine the solutions of the candidates.","post_message":"Oh, the perils of stock footage."},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"1204773886285528","commenter_b":"Stridency is an anti-female word. Women are supposed to be quiet; it they are not, they are \"strident\". What you mean is they are being impolite by interrupting. I agree with that. Nicolle Wallace should think twice before she goes up against Rachel; however, that's what she is being paid to do.","commenter_a":"The stridency of the women on the panel, Rachel Maddow and Nicolle Wallace, that they use to interrupt each other and Eugene Robinson (they rarely allow him to finish a sentence) continues to be an annoying distraction to what could be a very useful and informative conversation.","post_message":"Follow our live blog for the latest updates! #Decision2016"},{"comment_id":"1104831912912258","commenter_b":"Muslims are scum!","commenter_a":"Check google about this. On site it says mother told husband to hit 10 year old if she denied her husband sex. Under Yemeni law this is not rape, wife's duty. Most sickening nationality. Her own family says face up to her duty and honour families commitment, don't shame her family. One girl 10 years old got away, went to court and filed for divorce. She won, husband was not prosecuted for raping a child, he was paid $200.00 compensation. Many of these kids die from bleeding to death from sex or during child birth.","post_message":"Why isn't Barrack Hussein Obama talking about this???!!"}]
