[{"comment_id":"1080058818698124","commenter_b":"Boycott Marco and Kasich media attention until they get out! Spread the word! They have no glide path and are trying to protect rhino control on the outcome of the nominee!","commenter_a":"Trump is winning the Blaze poll 68% at this posting. Better get some bots for Cruz going so he can cheat to win, he's good at it.","post_message":""},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"487105228080821","commenter_b":"She do it just for the publicity ..","commenter_a":"Probably already dated a few Bruce Jenner's in prison...","post_message":"Can you believe this story?"},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"579776192190480","commenter_b":"Leave now bitch","commenter_a":"Good Bye.","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"},{"comment_id":"10153956730069411","commenter_b":"You poor thing! (Jk)","commenter_a":"I know where I came from :) I am 20% from Asia, 20% from North America, 20% Pacific Islander and 40%European Meztizo. That is why I look like this. My eyes are brown and blue (blue edges, brown interior).","post_message":""},{"comment_id":"1171553619565468","commenter_b":"I can't even watch the View. Those women are bullies and *itches and make me want to slap them.","commenter_a":"Whoopie and Joy make me sick. They are so rude and disrespectful that I'm amazed they still have jobs.","post_message":"Whoopi and Her Liberal Hacks at 'The View' Tried to Bully Trumps Manager, But She Knocked Them The Hell OUT in Front of MILLIONS! (VIDEO)  Everyone's SICK of Hillary's scandals! Lets get 4000 SHARES if you are too!!!"}]
