[{"comment_id":"10154091446565736","commenter_b":"Get her butt out of there .... YOUR FIRED","commenter_a":"I'm SHOCKED that an Obama-appointed Democrat is trying to undermine the new president. Did you really expect anything less? The Democrats aren't about to let President Trump do his job without throwing up every possible roadblock. They're just sore losers.","post_message":"\"I am responsible for ensuring that the positions we take in court remain consistent with this institution solemn obligation to always seek justice and stand for what is right,\" she said."},{"comment_id":"1588802614746840","commenter_b":"You said all the things Hillary and Democrats did, what is Trump's contribution to the development of America? And all you said are lies. Get your facts right! Compare the economy of the country before Obama era and Obama's era. You talk about the Islamic terrorist but you failed to make mention of the domestic terrorism in the country.","commenter_a":"In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","post_message":"Father of Muslim U.S. soldier killed in Iraq: \"Donald J. Trump, have you even read the United States Constitution? I will lend you my copy...You have sacrificed nothing, and no one!\" @webpagelink"},{"comment_id":"1322268537812600","commenter_b":"Hillary is NOT going to like her karma.","commenter_a":"Plane will be landing in Ecuador with pallets off fresh untraceable cash very soon....","post_message":"Smells like OBAMA....!  Details:  @webpagelink"},{"comment_id":"1405534516411777","commenter_b":"Yet, @username, the GOP has declared their Cleveland Convention a Gun-Free Zone!","commenter_a":"Senator Murphy, when will you learn about guns and understand the meaning of the 2nd Amendment? When will you stop infringing on legal gun owners and take the guns away from criminals? When will you outlaw gun free zones, which are obviously attracting all these liberal lunatics wh commit these horrendous acts against innocent people? When will you and other democrats come up with common sense ideas that punish criminals and not legal law abiding citizens? I'll wait for your response!!","post_message":"Taking your questions live with Senator Cory Booker"},{"comment_id":"1030656443730298","commenter_b":"\"Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\" John Steinbeck","commenter_a":"Fight Bernie Fight for us all!!!!!! We need u!!!! The Dark Side of the Force will be strong with this administration.....","post_message":"Trump is assembling the wealthiest cabinet in history — so wealthy that its members have more money than the bottom 1/3 of American households combined. That does not sound like an \"anti-establishment\" administration to me."},{"comment_id":"10154286339391756","commenter_b":"We pay nine (right now, eight) people to say \"no\" to that type of demagogic gasbaggery.","commenter_a":"It's a consistent source of amazement to me that he does not understand that if, heaven forbid, he somehow manages to become President, he cannot just unilaterally change/enact/dismantle any law he chooses. He and his equally terrifying supporters might want to learn how this all actually works.","post_message":"\"What we don't have in this country is a tradition of punitive actions trying to silence speech,\" says one D.C.-based attorney."},{"comment_id":"10152851658596636","commenter_b":"I am Muslim..&I say Good For Them! I hope it's banned allover the world..it has nothing to do with Islam .. It only has to do with Extremism &safe wise.. It's very dangerous...in many cases it's being used by terrorists..men or women escaping the law...etc","commenter_a":"Should be banned everywhere in the civilized world, its loved by fanatics, it belongs in regressing places like the Isis caliphate only.","post_message":"The Government says the move has 'nothing to do with religion'"}]
