[{"comment_id":"10155247808221729","commenter_b":"Jill stein was just in it for the money! She pulled one over on her own people.","commenter_a":"When will these #NOTMYPRESIDENT jerks learn. Get over it. If Hillary would've won we would be over it and preparing for all the bad she'd unleash on the USA!","post_message":"EPIC FAIL."},{"comment_id":"956149327758873","commenter_b":"Hit it girl","commenter_a":"Indeed I do agree and it's another reason why I dislike them.","post_message":"Veterans have had it with Republicans using them as political props, while screwing them every chance they get. Do you agree with this veteran's take?"},{"comment_id":"10154354649676336","commenter_b":"This is exactly what you get when you allow illegals into the country!!!","commenter_a":"With all of the organic fruit, spinach, sprouts, vegetables and now vitamins being recalled I have decided to start a strict diet of twinkies and chips ahoy. They never get recalled.","post_message":"Warning: Recalled products include Nature Made gummy multivitamins and supplements containing vitamin C, B vitamins and folic acid."},{"comment_id":"10154363261003816","commenter_b":"Pack your bags libs, because the wall is going up.","commenter_a":"If you're to dumb to get an ID you don't deserve to vote","post_message":"In testimony and filings in the case, the plaintiffs said that blacks and Latinos make up 44% of those seeking a free ID to ensure they can vote but only 9% of the overall voting age population in Wisconsin."},{"comment_id":"10155409638445725","commenter_b":"I hope she goes to hell","commenter_a":"Crazy selfish bitch","post_message":"Attorneys for the woman accused of faking cancer and pocketing thousands of dollars in donations from strangers, family and friends for more than a year, spoke alongside the woman today. What they said about the incident and the woman----> @webpagelink"},{"comment_id":"1743922275826047","commenter_b":"150 million + illegal immigrants and 150+ million legal citizens out of work. Do the math its a wash get em out. Deport everyone last one of them and void any overstayed visas. Goodbye and goodluck","commenter_a":"These thugs are pay by George Soro's the Super Pac for Hillary, and the Bernie idiots that have nothing better to do.......the point is you will never see Republicans act like these IDIOTS!! This only pisses more people off to vote for Trump!! Trump for President 2016!!","post_message":"***SHOCK VIDEO***  Anti-Trump protestors in Albuquerque, New Mexico stomp on police cars, light Donald Trump signs on fire, wave Mexican flags...."},{"comment_id":"554155158094381","commenter_b":"Christie is killing ittonote! I'mactually a Cruz supporter. Sorry Ms. Pendleton but u cant have 15 people on the stage and get anything worthwhile discussed. I like Mrs. Fiorina,I think she is brilliant, but she didnt get enough supporters. Sorry for that cause I think she would be a great first woman president. However, we have to end with an electable candidate that will beat the demo candidate, cause we dont need another Obama presidency. Electing Clinton would be electing another Obama.","commenter_a":"ABC is doing a horrible job of not including Ben Carson in any of the debate questions since the question of Senator Cruz cheating him out of votes in Iowa.","post_message":"WATCH LIVE: Republican presidential candidates face off in the ABC News #GOPDebate in New Hampshire. Watch all of our debate coverage right here! @webpagelink"}]
