[{"comment_id":"10156257244825725","commenter_b":"\"Multiple woman.\"","commenter_a":"Is that dan blizerian","post_message":"A man is accused of secretly recording himself having sex with multiple woman. One who was informed that she had been recorded didn't even know a sexual encounter had occurred ----> @webpagelink"},{"comment_id":"10154073514135950","commenter_b":"Are those ACTUAL immigrants or illegal trespassing criminals?","commenter_a":"\"Anyone not willing to accept the results of an election is a danger to democracy.\" ~ Hillary Clinton","post_message":"Immigrants and their advocates take to streets in major cities from coast to coast to voice their dissent."},{"comment_id":"10154266644379087","commenter_b":"@username news flash f*ck face, when he is in office in january, he will cut off 12 billion in aid to Mexico and hence they pay for the wall, stfu and deal with you LOST, LOST,LOST","commenter_a":"Not very Presidential attacking the Press that is protected by the 1st amendment. Can you imagine the Right Wing outcry if Obama had tweeted about the negative coverage he was receiving from Foxnews?","post_message":"Trump's tweet comes just days after telling \"60 Minutes\" he would be restrained on Twitter as president."},{"comment_id":"10153322373749087","commenter_b":"Ladies, don't embarrass yourselves....you got your asses kicked in both elections. ;)","commenter_a":"Well vote for the Republicans so they can make you feel more comfortable by taking you back to that time.","post_message":"Sister Souljah on Hillary Clinton: “She reminds me too much of the slave plantation white wife of the white ‘master.’ She talks down to people [and] is condescending and pandering. She even talked down to the commander in chief, President Barack Obama, while she was under his command.\""},{"comment_id":"1310250435687007","commenter_b":"@username listen bitch you better do your research the final votes were counted today he won popular vote by 699k","commenter_a":"Wow ! Get over it ! Trump won the electoral and popular vote as of today ! If Hillary hadn't been so crooked lies and selling America out to the highest bidder she might have won, but she was caught in way to many back room deals and bad things she should be in prison for treason ! Shame on SNL. To even praise her when the people have spoken !","post_message":"Wow, SNL dropped the comedy and got real."},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"10154064678631336","commenter_b":"@username I won't vote for trump ! I will support the other republicans !","commenter_a":"Donald Trump understands better than anyone why the country is so much in decline. He understands how our politicians have sold us down the river with trade deals that benefits other countries and lines the pockets of foreign lobbyists who give away our wealth and jobs for their own gain. This is why the Establishment hates and fears Trump so much. Our country is 20 trillion dollars in debt because of all the corruption by both sides that are owned by the same people. Trump understands that if we do not get a wall on the border we will lose the country. Because all of the over 12 million illegals in this country are going to vote DEMOCRAT once some RINO or liberal gets into office and gives them Amnesty- THAT will mean the extinction of the Republican party and we will become a third world socialist nation. The Establishment ...","post_message":"“The lessons of 9/11 are being forgotten by a lot of people. And that is: A human condition elsewhere matters to our national security.”  Do you agree with former President George W. Bush? @webpagelink"}]
