[{"comment_id":"10155773912215093","commenter_b":"So republicans in the 1950's can change the national motto of our country and put it on our money but in 2015 we can't have a woman on a bill? Ok then.","commenter_a":"The government takes all our money through taxes and health care se we won't ever see it anyway. Bummer","post_message":"An absolute outrage -- and here's why."},{"comment_id":"1147885218663043","commenter_b":"@username , no wall is going up! 😂","commenter_a":"His supporters don't care having an asshole for president , they just wanted a white man .","post_message":"Trump's supporters are not going to be happy about this."},{"comment_id":"10153089034256051","commenter_b":"She should have either buckled herself then got sick or she could have knead down holding door and do it that way ( some vans have a handles)..or have a push window..or found something to vomit in","commenter_a":"There is a reason why yiu are suppose to wear a seat belt. Glad she is ok though.","post_message":"This woman began feeling sick while driving and ended up opening a car door to throw up. The problem is, the car was still moving at the time."},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."},{"comment_id":"988150574624052","commenter_b":"They are acting like school kids, so the best way to handle them is to ignore them.","commenter_a":"get off the dang eggs birdXD","post_message":"EAGLE CAM DAY 4: One egg has cracked and we spotted an eaglet. Watch it fully hatch now: @webpagelink"},{"comment_id":"1384307571620555","commenter_b":"I think this woman just swallowed her safety pin.! Lol .","commenter_a":"Grow up you he she","post_message":"Give it a rest..."},{"comment_id":"10156594295450354","commenter_b":"She is a mental pig.","commenter_a":"Because you are a dog","post_message":"Feminism 2016 Style...  “It’s policy. Teddy Kennedy, remember Chappaquiddick?… I mean, a girl drowns and he abandons her, and [s]he drowned, and women still voted for Teddy Kennedy. Why? Because he voted for women’s rights. That’s why. That’s the bottom line of it in my opinion. I mean, I don’t like either one of them, to tell you the truth, Teddy or Bill. They’re both dogs, as far as I’m concerned. But I still will vote for Bill Clinton, because he votes in my favor.”"}]
