[{"comment_id":"10155056114144749","commenter_b":"hoorah!","commenter_a":"Good review worth reading.","post_message":""},{"comment_id":"10152965639377690","commenter_b":"Evil women have already stole my soul. It's too late.","commenter_a":"Really? Really?","post_message":"Texans hold prayer vigil for Blue Bell Ice Cream after massive recall @webpagelink"},{"comment_id":"10154219562119197","commenter_b":"Germaine Riley Another imbecile spewing really nice politically correct names, hey you .... smarten up !","commenter_a":"So very sad ! Obama should be impeached because he is not keeping us safe !","post_message":"We are continuing to follow updates on the deadly mass shooting at an Orlando nightclub. Here's Kevin P. Hogan WFSB with an update on what we know now."},{"comment_id":"826951857397870","commenter_b":"Don't listen to all the crap! Half of it has been proven a lie and who knows about the rest? What kind of woman has these accomplishments? Surely not the ones they're talking about! @webpagelink","commenter_a":"too much baggage for me","post_message":"You know what to do!  Thanks to Liberal And Proud Of It."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10153328775418128","commenter_b":"I thing that puts our 18 trillion in debt in perspective...","commenter_a":"No doubt that population and geographical size - density as a dependent variable of income per-capita help construct the value perspective.","post_message":"The most valuable U.S. states by land value: 1. California 2. Texas 3. New York"},{"comment_id":"10153120617440927","commenter_b":"Yep, she's the best they got. crappy pants and all","commenter_a":"You can't help but admire a woman who stays married to a serial rapist and craps her pants during the last Democrat debate.","post_message":"59 TIMES: Billy Graham has been in Top Ten more than any other person Pope Francis and Donald Trump both got 5% this year Teddy Kennedy tied Blessed Mother Teresa with 18 years on the most-admired list"}]
