[{"comment_id":"1009572635788547","commenter_b":"That's terrible!!! I worry about my children everyday at school!!!!","commenter_a":"Really. Bullying. Is wrong","post_message":"A sixth-grader died Tuesday after a bully stomped on his chest during a P.E. class at a Colton elementary school, the boy's parents told KTLA.  \"This kid did it on purpose,\" said Jose Gallegos, whose 12-year-old son Dominick died after losing consciousness on the field.   However, detectives who went to the hospital where Dominick was taken said there was no evidence of an assault or physical injury that would have caused his death. Investigators are waiting for a report from the coroner's office.   Read KTLA's story here: @webpagelink"},{"comment_id":"537541949759320","commenter_b":"She needs to go","commenter_a":"Love you Judge!","post_message":"“As the world comes crashing down around her - Hillary Clinton in panic mode - displays what kind of president she would be. One who simply can't cope, can't take the pressure and would be a danger to this country.”  Judge Jeanine Pirro slammed Clinton for lashing out at an activist while on the campaign trail earlier this week. @webpagelink"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"1152390574850299","commenter_b":"Wish these women would press charges! That would be wonderful...","commenter_a":"This woman should bring legal charges. It is too bad she did not haul off and slug him then and there. There are too many honest credible women coming forward to ignore. Even die-hard Trump supporters should think twice about supporting such a lech. And no, the Clintons are not paying all these women to come forward. Use spell check if you want to be taken seriously Maynard.","post_message":"This makes 12 women that Trump is accused of not being able to keep his grubby, tiny hands off of."},{"comment_id":"10152984633716770","commenter_b":"ENJOY ALL YOUR WELFARE BENEFITS BECAUSE THEY WON'T BE THERE FOREVER! WAKE-UP AMERICA! WE BETTER GET OUR VOTES RIGHT THIS TIME OR WE COULD SEE ISIS TERRORISTS UNLOADING IN OUR DRIVEWAYS! LET'S ALL HELP TRUMP MAKE AMERICA GREAT AGAIN! TRUMP ALL THE WAY!","commenter_a":"Can Trump ever stop with all the \"self praise\" while belittling and insulting everyone else......well except for those Democrats who are running? Since he was a liberal long before his sudden transformation to the GOP, I gotta wonder what side he's really on. Don't trust him one bit.","post_message":"Donald J. Trump believes the moment an Iraqi reporter thew a shoe at George W. Bush and Bush didn't blink \"may have been his best moment if you want to know the truth, that is very sad to say.\""},{"comment_id":"10153803729806336","commenter_b":"Yes, and McCain and Graham were WRONG! Just like letting all these muslim immigrants into our country...we dont know WHO THEY ARE!!!","commenter_a":"Wait. You cry and cry that he has not done enough in Syria. He then sends some. And you get upset over that??? Fox / GOP supporters make zero sense.","post_message":"On \"Justice,\" Judge Jeanine Pirro slammed President Barack Obama's decision to send U.S. troops into Syria, after repeated pledges of no boots on the ground. @webpagelink"},{"comment_id":"10153128289641636","commenter_b":"You got daughters?","commenter_a":"Absolute madness.....by all means reprimand him through school procedures but don't criminalise him....it's somewhat excessive.","post_message":"She was 14"}]
