[{"comment_id":"443037622487945","commenter_b":"Lol leftist get out","commenter_a":"Wrong, it isn't the IRS it is all the rich corporate fascists. The pentagon spends how much on the military? I hardly think taxation on the regular guy is so bad, but when the rich fail to pay and the greedy steal it all well, you gotta blame somebody, right?","post_message":"The Anti-Media radio show from tonight can be heard here: @webpagelink"},{"comment_id":"1219006891496424","commenter_b":"They do not have a right to do so ILLEGALLY! God's Word says to obey the LAWS!!!! Read your Bible pope.","commenter_a":"In Syria , not here!","post_message":"Pope Francis said each refugee \"has a name, a face and a story, as well as an inalienable right to live in peace and to aspire to a better future\" for their children."},{"comment_id":"10153177942114170","commenter_b":"Once a LIAR, always a LIAR! But what difference does it make at this point! Hillary is Obama in a skirt! Another Democrat that Bows to ISLAM and leaves Americans being attacked by Muslim Terrorists, TOO DIE!","commenter_a":"She should go to jail rather than the White House. Worst Secretary of State ever along with Obama the worst President ever.","post_message":"How stupid does she think we are?"},{"comment_id":"610785519070224","commenter_b":"Check that woman's mouth for raw....","commenter_a":"Keep in mind, these people are not working real jobs.","post_message":"Has anyone seen this Fox host's soul? It appears to be missing.   -Conover"},{"comment_id":"10156568887000725","commenter_b":"@username STOP dreaming about Hillary, she's bad news, and will never get elected...thief, lier, does NOT care about the American people, WAKE UP !! TRUMP, 2016...","commenter_a":"Today - One Year from Today - Donald Trump will be in his second day in the White House as POTUS and the Obamacare bill will be burning in a barrel on the south lawn.","post_message":"Donald Trump 1st Republican Presidential Candidate to Beat the Iowa Bureaucracy and Figure Out How to Easily Access Caucus Locations. #Trump2016"},{"comment_id":"10153647642558352","commenter_b":"She's the other woman, this is why women need to stop claiming men until they put a ring on it and claim you","commenter_a":"Sad","post_message":"GIRLFRIEND FINDS OUT ON SOCIAL MEDIA HER SUPERSTAR SOCCER PLAYER BOYFRIEND MARRIED ANOTHER WOMAN RIGHT AFTER SHE DROPPED HIM OFF AT THE AIRPORT (PHOTOS)  This is real bad!"},{"comment_id":"593410574181627","commenter_b":"Ex hoe for first lady wtf","commenter_a":"I wish my middle class friends a I could afford to buy that, oh, I forgot, there is no middle class","post_message":"Melania Trump, the first-lady-to-be, wore a $4,000 Ralph Lauren silk crepe jumpsuit  made in Italy on election night. #Election2016"}]
