[{"comment_id":"10150935121129999","commenter_b":"She did say that but she said it was because of the mother's health.","commenter_a":"As an avid hater of Trump, it's hard to read this because I am so tired of Trump supports blaming all bad press about Trump on the \"liberal media\" but this is supposed to be a fact checking exercise and it is just so obviously biased and sarcastic and the tone does not come off as objective at all. It would be nice to see something written that fuels the \"evil media\" fire a little less.","post_message":"We're fact-checking the presidential debate with Hillary Clinton and Donald J. Trump: @webpagelink"},{"comment_id":"10152933531687434","commenter_b":"Sex is only for straight, married, rich people!","commenter_a":"It's like they WANT teenagers to have babies. No sex ed, no planned parenthood. Since we know abstinence only education does not work, what else can we take from this?","post_message":"“If they’re doing such a great job, why aren’t these things better?” Bobby Jindal asked of Planned Parenthood."},{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."},{"comment_id":"10154008398892093","commenter_b":"an old woman did this on her apartment and end up with this, be careful guys","commenter_a":"Well my heater doesn't work right now guess I have to dress warm going to bed. Other than that I love this weather.","post_message":"How are you preparing for the first hard freeze of the season? bit.ly/2gAPzAa"},{"comment_id":"546309585494081","commenter_b":"Another scenario: Let's raise minimum wage and keep everyone else's the same. That way their money is worthless and means less, as opposed to this minimal skill havin high school dropout with 6 kids with 4 different fathers/mothers so the price of goods will rise and you'll be in the same poverty stricken boat as you were but now you've lowered the entire middle class in it with you. And people can we get over the race thing? It's very tiresome and down right comical.","commenter_a":"This is complete and utter FAIL. If you work hard and make smart life decisions, you absolutely can succeed. What idiot came up with this B.S.?","post_message":"Seems legit."},{"comment_id":"10153932654413854","commenter_b":"He has cornered the market on STUPID...","commenter_a":"This guy is absolutely INSANE.","post_message":"Obama cites American Revolution as example of Americans being falsely paranoid about gov’t tyranny"}]
