[{"comment_id":"1087993101236110","commenter_b":"Obummer is a trader to America. He is full of lies and bullshit.","commenter_a":"He's still trying to destroy America","post_message":"**BREAKING NEWS**  What the HELL!?!?"},{"comment_id":"521579714699275","commenter_b":"She is like a pile of dung. Worthless!","commenter_a":"Yes","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"1017002171709344","commenter_b":"I would feel equally disgusted voting for either one.","commenter_a":"That's a Question ?","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B?"},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"},{"comment_id":"1001040969952432","commenter_b":"Hillary says she landed under sniper fire and had to put her head down and run for cover? Hillary says she and slick Willie were broke when they left the white house? INTELLIGENT PEOPLE DO NOT SUPPORT A proven documented habitual liar for the highest office in the country TRUTH MATTERS","commenter_a":"Hillary 2016! Got my vote!","post_message":"\"I want you to remember: when you vote, when anyone votes, your vote matters as much as anybody else’s. Now, we may be up against super PACs and billionaires, but when the election comes around, Donald Trump and the Koch brothers with all their money, they only get one vote each. One person, one vote. That’s what we believe.  No one should be able to take that vote away. That’s why we cannot turn away and close our eyes from all of the attacks on voting rights that are happening right now. They don’t just threaten the integrity of our elections, although they do. They threaten what it means to be a citizen—indeed, what it means to be an American.\" —Hillary yesterday in Birmingham, Alabama"},{"comment_id":"10152708719122217","commenter_b":"If she was prettier she wouldn't have been charged.","commenter_a":"Who is the complainant? If it was witnessed in person fine. However if the person offended viewed the image on google, surely they are to blame for publishing the image?!","post_message":"She was charged after flashing a Google Street View car"}]
