[{"comment_id":"10153968954135695","commenter_b":"Read article it happened in Pittsburg","commenter_a":"Way to go ga.","post_message":"“They told me I was OK to park where I was, as long as I was not on the curb… then I come out and I'm being towed,\" one parent said."},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"10153708814028010","commenter_b":"shut your filthy mouth","commenter_a":"Nutella is gross. Nothing is worth assaulting the elderly, especially poo-tasting Nutella.","post_message":"The 24-year-old had snagged several samples when the elderly shopper told him to take just one, police said."},{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"856127001183895","commenter_b":"Did Japan apologize for pearl Harbor, Bataan, and the rest of the atrocities committed by the Japanese military?","commenter_a":"Did Japan apologize foe pearl harbor","post_message":"Castro criticizes President Obama for not apologizing to Japan during a trip to Hiroshima in May."},{"comment_id":"10155101545959866","commenter_b":"I was in prison and the c.o.s and inmates were always like buddies","commenter_a":"Do you even know what C.O goes through everyday? Well you guys are probably working at mickey D's thinking you have a hard job","post_message":"LIVE: Delaware prison guards taken hostage by inmates a maximum security prison - live ground video. MORE at @webpagelink"},{"comment_id":"1777728085804631","commenter_b":"What she did isn't even funny. He needs to leave if she thinks that little of him. Bitch.","commenter_a":"WTF? I can't imagine getting that upset about shampoo. There has to be other problems.","post_message":"Don’t mess with a girl and her beauty products."}]
