[{"comment_id":"861748160544348","commenter_b":"No, she was a goddamned moron that left it unattended. With a toddler. Gene pool cleaned.","commenter_a":"Those women's groups are worthless. If they had any kind of gonads they'd realize that disarmed women are victims.","post_message":"BREAKING: Michigan Governor Vetoes \"Shall Issue\" Gun Bill After Criticism From Women's Groups"},{"comment_id":"10154226374872894","commenter_b":"Kim better stop bcuz money can dry up. At the rate that she is spending it.","commenter_a":"...but Andy Cohen has had work done himself so what's his point??? *sips Brandy and Eggnog*","post_message":"Andy Cohen Grills Kim Zolciak About Plastic Surgery: Sweetie, You Need to Stop (Video)"},{"comment_id":"10153312043927061","commenter_b":"I'm sure she is a smart cookie, given her education, but why can't these men date women their own age?!","commenter_a":"Such mean comment .. Wow!!! I sure she's a very nice person.","post_message":"Congratulations, Ryan Phillippe! The actor is reportedly engaged to his longtime girlfriend. @webpagelink"},{"comment_id":"10153304434981770","commenter_b":"She is gross...","commenter_a":"You don't impress me AT ALL.","post_message":"Can you believe she does this to herself?"},{"comment_id":"1588802614746840","commenter_b":"You said all the things Hillary and Democrats did, what is Trump's contribution to the development of America? And all you said are lies. Get your facts right! Compare the economy of the country before Obama era and Obama's era. You talk about the Islamic terrorist but you failed to make mention of the domestic terrorism in the country.","commenter_a":"In defense of Donald Trump : Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not starting a race war. Trump did not leave any US soldiers in Benghazi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","post_message":"Father of Muslim U.S. soldier killed in Iraq: \"Donald J. Trump, have you even read the United States Constitution? I will lend you my copy...You have sacrificed nothing, and no one!\" @webpagelink"},{"comment_id":"10155578231251509","commenter_b":"Leave then illegal.","commenter_a":"If Trump wins I'm leaving the country. If Hillary wins I'm still leaving the country. This isn't a political comment, I just want to travel.","post_message":"Watch Donald J. Trump supporters in Cincinnati, Ohio, react to the candidate's projected win in that state.  Live election results and coverage: @webpagelink"},{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"}]
