[{"comment_id":"10154280774612690","commenter_b":"Maybe you're not an American and you wouldn't understand anyway. Your fear is what leads you.","commenter_a":"After this election, the world has truly changed the way they see us. We have become a laughing stock for electing this idiot. If you can truly say you're okay, and you feel safe with Trump as president and his supporters on anew high, then I envy your privilege. Sit back and watch the fall of the American empire.","post_message":"In the largest Texas border city of El Paso, many people are reacting with fear and anger to the election of Donald Trump as president: @webpagelink"},{"comment_id":"672876839554418","commenter_b":"@username that's a stupid comment. Hillary supports killing Gods baby's.","commenter_a":"Hillary would throw her own daughter under the bus to save her own skin! America look out cause Russia is getting pissed at her and sees Hillary as Obama as a white woman.","post_message":"\"11% of the American people say that [Hillary Clinton]'s honest and trustworthy. To compare that, the same poll found that 14% of Americans believe in Bigfoot. Now that's what kind of trouble she's in.\" – Mike Huckabee"},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"\"It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.\"  Tonight on \"Special Report with Bret Baier,\" Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10153084847781350","commenter_b":"Cheaters","commenter_a":"Latest reports state balls were checked at halftime and found deflated. They were changed out for fully inflated ones. And...PATS won the game in second half! What else is there to say? Enough already!","post_message":"\"It's cheating, regardless of how you may want to spin it.\""},{"comment_id":"10155262901820231","commenter_b":"Fraud!","commenter_a":"He's just a man and not god","post_message":"Social media: 1  Ceflo Dollar fundraising for a private jet: 0"},{"comment_id":"10153359134519060","commenter_b":"Oh! You are a geographer or a history specialist Scott. Sounds good. For sure you know Europe is more than UK, Latin America is more than Mexico, and that Egypt is in Africa. Glad to know you really understand the reality and the specifics outside US. It is rare.","commenter_a":"When I read \"Latin America\" as a generalization in an article, I tend to be skeptic. You can not compare Guatemala with Chile, Argentina with Mexico. Completely different cultures, histories, corruption level, etc, although all of them are Latin American countries.","post_message":"Crisis in Guatemala: the vice-president quits, the heads of the central bank and social-security institute are arrested and three ministers sacked. Corruption scandals are two-a-penny in Latin America. Few inflict this much damage @webpagelink"},{"comment_id":"1012231985511331","commenter_b":"She has NO BRAIN CELLS!!!!!","commenter_a":"Nuts for sure","post_message":"Americas Freedom Fighters"}]
