[{"comment_id":"884237991635950","commenter_b":"It just makes me disgusted with some of the women of today,maybe like u.","commenter_a":"Woman will perish in disgust trying to do everything man does.....","post_message":"Should every woman SHAVE her face?"},{"comment_id":"10153345798428717","commenter_b":"@username Sweet cheeks maybe you should learn about history rather than remaining ignorant @webpagelink","commenter_a":"Be happy Manchester, your taxes won't get raised beyond the cap.","post_message":"#BREAKING NEWS: The unofficial final results in the Manchester mayoral race are in. Incumbent Ted Gatsas defeats challenger Joyce Craig by 75 votes. -- @webpagelink"},{"comment_id":"10153011614414586","commenter_b":"Yes!!! Yaay! Way to go Peta!!!","commenter_a":"Amen","post_message":"KORA NEEDS A HOME!  #PETA fieldworkers found Kora tied outside 24/7 with little shelter or water. Her chain was so tight that it had become partially embedded in her skin. :( She is now in foster care & looking for her FOREVER HOME.  SHARE to help her find one: @webpagelink"},{"comment_id":"1106662279389311","commenter_b":"Kick their sorry butts off the team!!","commenter_a":"They obviously don't have good leadership, good manners, honor and respect come from the top. Must be some bad coaches and school administration!!! Teaching them disrespect and telling them it is \"freedom of speech\". Just wait they will soon have wished they hadn't disrespected this country. Muslims and sharia law will be your worst nightmare!!!","post_message":"This is beginning to happen nationwide and it is a travesty!  Do you hold Barack Obama responsible for his role in the #BlackLivesMatter movement to disrespect our flag?"},{"comment_id":"10154083173838132","commenter_b":"They're usually thrown in an institution from a young age. They don't get job or skill training being they are looked at as \"useless.\"","commenter_a":"This is an awesome story and I am so thankful for the children that have found forever homes. I have one question if these children were left in China would they receive an education?? Or are they just forgotten about?","post_message":"What an incredible moment for these children. "},{"comment_id":"10152639430074071","commenter_b":"As a kid I really enjoyed the Daredevil movie. Watching it now... yeah lol. I do like the character though. I hope Netflix does it right :)","commenter_a":"Rodrigo Rubio Camara","post_message":"It's time to welcome him back."},{"comment_id":"657506131049235","commenter_b":"Hope she's being watched closely. It's a good bet she's surrounded by other like-minded people. It's women like her that become human bombs.","commenter_a":"Send her home","post_message":"What the mother of the Boston Bomber said after he got the death sentence is SICKENING!"}]
