[{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"},{"comment_id":"607613792773547","commenter_b":"If this does not touch your heart nothing will amen","commenter_a":"Get that rotten PIG .","post_message":"FALLEN - NOT FORGOTTEN: The community is gathering for a vigil honoring two fallen heroes - Master Sgt. Debra Clayton of Orlando PD and Deputy Norm Lewis of the Orange County Sheriff's Office.  Meanwhile, the search for Markeith Lloyd continues: @webpagelink"},{"comment_id":"853572084739045","commenter_b":"Lol! Wow!","commenter_a":"I agrees with the Judge! Come here by the proper channels! WTH","post_message":"Here's a breakdown of what the immigration ruling means."},{"comment_id":"10154684897643872","commenter_b":"Cow Patty is a crooked Hillary corporate baby killing whore and will lose in November!!!!","commenter_a":"Yeah, I'm voting you out for voting for TPP, freedumb act planned unparenthood and supporting crooked Hillary, enjoy unemployment Cow Patty!!!!","post_message":"Voting starts today! Got questions? Visit iwillvote.com for answers."},{"comment_id":"1582128638759914","commenter_b":"Normal people don't put bombs in dumpsters......terrorists do....","commenter_a":"Tell us again how this isn't an act of terror?","post_message":"Breaking News: FBI releases a 'Wanted' poster identifying 28-year-old Ahmad Khan Rahami, a suspect in the bomb blast in New York City Saturday night.   The FBI's wanted poster identifies Rahami as a naturalized U.S. citizen of Afghan descent. MORE DETAILS: @webpagelink"},{"comment_id":"552483671600179","commenter_b":"Hillary does all of the same things too. Get real.","commenter_a":"Its not really gender...its just more crap to throw at our future PRESIDENT Hillary Rodham Clinton..every week its some other lie or smear..you would think people would figure out what republicans have been doing for decades..!! An yawn like I do each time they raise their ugly heads. !! Tell them no an leave it at that !! Go Hillary Clinton🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","post_message":"The 'transcripts' hit on Hillary is sexism in its purist form: holding a woman to a different standard because of her gender."},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel.   (via Strange Inheritance)"}]
