[{"comment_id":"1110020542374518","commenter_b":"She makes me sick to my stomach. What a hypocritical arrogant witch.","commenter_a":"What me worry, the election is in the bag, my lemmings will vote for me regardless of what I do........","post_message":"Hillary Clinton is quickly running out of ways to make herself appealing to voters on the left increasingly turned off by her political corruption and ties to corporate cronyism. Grasping for something to counter her weaknesses, Clinton has decided to patronize black voters with talking points attacking “white privilege.” @webpagelink"},{"comment_id":"10153363571284087","commenter_b":"Gun control is always pushed by angry racist white people @webpagelink","commenter_a":"We lost the battle for gun control when Republicans refused to do anything after Sandy Hook. If over 20 dead children doesn't motivate them to do anything, nothing will.","post_message":"“When are we really going to stand up and do something? Just who has to die? Your mother, your wife, your son or just how many?” Rep. Robin Kelly asked her colleagues in Congress. “We need to stand up, speak up and take action, rather than another moment of silence. It’s deafening, and it’s killing us.\""},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1260373737389011","commenter_b":"The Cocaine Carrot.","commenter_a":"Hahaha","post_message":"Nailed it."},{"comment_id":"665938460232774","commenter_b":"heard it thinking it wouldn't be thattttt bad, me after: ok he's officially a pig","commenter_a":"Jasmine","post_message":"\"When you're a star they let you do it.\" -Donald J. Trump"},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"\"[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.\" – Sheriff David Clarke on fighting Islamic terror threat"}]
