[{"comment_id":"10156214701425725","commenter_b":"Look at the mad illegal alien","commenter_a":"Look at all the brainwashed Donald Trump fans... Lol","post_message":"Who is winning the debate so far (just last name)? #DemDebate"},{"comment_id":"1389565734436504","commenter_b":"Wow this kind of women u dot want mess with super power","commenter_a":"OMG!!!! I am bereft for words!","post_message":"He started to beat her, so she squeezed his testicles in response"},{"comment_id":"961733343862087","commenter_b":"Because she's an evil witch!","commenter_a":"She does not speak the truth !!!!","post_message":"No way, no how do I want her in the White House!"},{"comment_id":"1341790949180015","commenter_b":"There are people in the world that defend raping children and killing babies . Ignore these people .","commenter_a":"Disgusting.","post_message":""},{"comment_id":"10153717162272708","commenter_b":"No we don't have to solve the worlds problems with money we do not have. If you were a refugee from America, which countries would take you in and give you benefits FOR LIFE? Which countries would require nothing of you as a citizen of their country once they took you in??? Those refugees get better benefits than anyone who is from here would ever get......why? Because their government could care less about them so we have to save everyone from everywhere......just because. Just because they won't care about their own people.....just because we have endless tax dollars to support them all. Nope.","commenter_a":"Saying we can't take refugees is saying you don't have compassion, as humans we have to find away","post_message":"We won’t be able to take more refugees. It’s not that we aren’t compassionate. But we can’t. There’s no way to background check them. SIGN IF YOU AGREE!"},{"comment_id":"828526300671280","commenter_b":"Hillary can't control own husband......let alone our country.","commenter_a":"incompetent bitch would not have far to go thanks to obummer .","post_message":"This is the worst thing that could of possibly gotten out.  America has to do whatever it takes to keep them away from the White House.  Do you think Hillary will run our country into the ground if she gets elected?"},{"comment_id":"1783413695224482","commenter_b":"All of you illegals have no say! Trump 2016","commenter_a":"Trump wants to build a wall on the border and make Mexico pay for it, deport illegals, cut taxes on the middle class and corporations, destroy Isis, take care of our veterans, strengthen our military, build the keystone pipeline, repeal Common Core, repeal Obamacare and replace it with a market based system, stop SS and welfare fraud, fight Mexico and China unfair trade and currency practices, Have Germany, Japan, South Korea, Saudi Arabia and others pay a fair share for our military support. preserve the sanctity of the unborn life ... that's conservatism ... that's patriotism ... that's what it will take to bring America back to greatness ......","post_message":"AMAZING! THANK YOU - WASHINGTON! I am so grateful for all of your support - and I will never forget it! We are going to defeat Crooked Hillary Clinton in November! There is no question about it. The last person Crooked Hillary wants to run against -- is Trump!"}]
