[{"comment_id":"10154551617736336","commenter_b":"Voting TRUMP, you dirty COMMIE BSTD... Only people like you get filthy rich off our flesh and blood! New WORLD ORDER NUT JOB","commenter_a":"This coming from a PURE MORON.","post_message":"Speaking in Austria, European Union chief Jean Claude Juncker said, “We have to fight against nationalism, we have the duty not to follow populists but to block the avenue of populists.\""},{"comment_id":"10154314532254218","commenter_b":"Gee thank you,I haven't heard anything about Freddie Grey for at least 10 mlnutes!!","commenter_a":"She's a joke... Disgrace to Maryland","post_message":"The trials of the six Baltimore City police officers charged in the police in-custody death of Freddie Gray are still ongoing."},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."},{"comment_id":"1097246043649586","commenter_b":"@username @username - that is still land grabbing of a different sort. Basically they can't use it for their cattle if it is protected for other wildlife. And they can't shoot the wolves that might harm their cattle because it is public land. (or they should not be allowed to). The deal is - for any business (including ranching and farming) there is risk for loss. The ranchers just don't want there to be any loss for them. But that is tough. That is life and that is business.","commenter_a":"Seriously amazing. .. I don't understand why they are so hell bent on getting rid of wild horses. . They are beautiful and majestic animals ... and for this woman to try to recreate that atmosphere for these rescue horses is astounding! !","post_message":"A sanctuary in Oregon lets rescue horses live our their lives in comfort. (via Places To See Before You Die)"},{"comment_id":"1018537924833053","commenter_b":"Teenage girls are creating life inside them all the time. Seems pretty easy to me. The quote is about the creation, not the maintenence of said life, so I'll leave it at that.","commenter_a":"Creating a life is actually one of the easiest, most instinctual acts all mammals share... It's not difficult at all. Properly caring for one is something else entirely.","post_message":"Wise words from Robyn Lawley: \"You created a life inside of you, that's no easy feat.\"  (via HuffPost Canada Parents)"},{"comment_id":"644515682393824","commenter_b":"Hi liar y!! Tear down that wall. Let all illegals in that wish to come in and take stuff for free!!!","commenter_a":"I love that Trump is not afraid to call bs when he sees it!!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"390976721026923","commenter_b":"She needs a new Do!!! Lol","commenter_a":"Yep holder in a skirt","post_message":"What do you think of the White House nominee for Attorney General?"}]
