[{"comment_id":"10153262591601051","commenter_b":"Hahaha, what the hell are you? Nothing but a Hispanic niigger. But you think you're better.","commenter_a":"Fu¢k niggas","post_message":"Here's what these protesters chanted while they were being escorted by police."},{"comment_id":"10156331517060725","commenter_b":"hurry up become our president and get rid of these thugs","commenter_a":"A Muslim is one born to a Muslim father who takes on his or her parents' confessional identity without necessarily subscribing to the beliefs and practices associated with the faith. In non-Muslim societies, such Muslims may subscribe to, and be vested with, secular identities. Reminder: Obama father was a Kenyan born muslim. ----- al-Taqiyya: deception; the islamic word for concealing or disguising one beliefs, convictions, ideas, feelings, opinions, and/or strategies. Islam Permits Lying to Deceive Unbelievers and Bring World Domination! Muslims lie when it is in their interest to do so and will not hold them accountable for lying when it is beneficial to the cause of Islam. They can lie without any guilt or fear of accountability or retribution. A lie in the defense of Islam is approved even applauded in their books.","post_message":"Under our President, ISIS is gaining great strength."},{"comment_id":"904031539740409","commenter_b":"@username you are just Jealous because your fat ass cannot wear something like that. Shut the fuck up.","commenter_a":"1. Bitch you know damn well you can't wear that to school shut you're whinny ass up, talking about being oppressed. I'm offended about your damn video. 2. When the your school starts banning something you can't control like how your hair grows then your oppressed until then put a damn t-shirt on and go about your way because if you truly didn't car how you looked you wouldn't have wore a strapless dress.","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"1106022556087458","commenter_b":"Her agenda with democrat socialist is to end all jobs in America. Prove to Me they intend to increase opportunities . Jobless rate only lowering past few years due to millions that left and no longer participating in work force .. They want more of that trend for sure.","commenter_a":"This is the only truth she has told.","post_message":"Clinton promises to put people out of work."},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"1072525059447912","commenter_b":"Well actually Tara bring em all to your house ok AMERICA FOR AMERICANS !","commenter_a":"Correct me if I'm wrong but majority is suppose to rule in AMERICA and you only have 4 States that want these people and 20 that don't keep them the F out of America !!! AMERICA FOR AMERICANS !!!","post_message":"\"There is absolutely no constitutional power for a state to exclude anyone from its territories,\" said one legal scholar."}]
