[{"comment_id":"1197295057044376","commenter_b":"I see they bussed them in","commenter_a":"I get guarantee most of these people don't even know what a fascist is.","post_message":"Marching on the deploraball"},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets?  As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves.   Will Obama be able to keep his jihadists in check until he declares Caliphate?  Read More + Video:  @webpagelink"},{"comment_id":"10154229049319369","commenter_b":"Being against Christians isn't a religion.","commenter_a":"I am against Christianity so that means I can not serve Christians in Mississippi because it goes against my beliefs?? This law is stupid.","post_message":"The measure allows churches, religious charities and privately held businesses to decline services to people whose lifestyles violate their religious beliefs."},{"comment_id":"10155226705950579","commenter_b":"She is sharp","commenter_a":"Where is the voice for the white race and culture?","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\"  Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"10154360418471729","commenter_b":"...she IS A LIAR !!!...always been and always will...","commenter_a":"Now...that looks like an angry candidate!","post_message":"The truth hurts. Especially if you're Hillary Clinton."},{"comment_id":"1035959943168617","commenter_b":"@username Trumper Humpers have elected her through their ignorance.","commenter_a":"We will never forget scum like u Vote TRUMP","post_message":"Did Obamacare deliver lower premiums & more choices? No. Our office has done the research. Read our full report here: @webpagelink"},{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"}]
