[{"comment_id":"1250137068360096","commenter_b":"@username Oh no! not more people adopting, what a horrible place we live where people want children in their homes!!!","commenter_a":"You people know so little you call that a win just pitiful","post_message":"YES!"},{"comment_id":"10154319507055329","commenter_b":"Haha complete and utter shit show Xxx","commenter_a":"Charlotte, number 4 and not number 5 lol!","post_message":"Here's to the tea addicts!"},{"comment_id":"10153149110684877","commenter_b":"Yes, she should be arrested. This type of crap gets people killed.","commenter_a":"She deserves prison time.","post_message":"Woman claims she was attacked by black men, allegedly faked injuries with makeup. She TRIED it! You have to see the pics for yourself.   Grio fam, should authorities press charges if it's proven she faked her claims? Sound off below!"},{"comment_id":"10153241305633984","commenter_b":"Stupid bitch ,,,,,","commenter_a":"Shes fucking retardes","post_message":"Wow. She is NOT doing herself any favors...  Are her critics right to be outraged?"},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"10152838610772144","commenter_b":"We get it, dude. Strong, intelligent women scare you.","commenter_a":"Filing charges for social media is ridiculous, it wont stick","post_message":"\"The amount of gender violence that I experience is absolutely extraordinary. And a significant part of my day today will be spent filing police reports at home about gender violence that's directed at me in social media.\"- Ashley Judd"},{"comment_id":"914457525280663","commenter_b":"she put it there herself those i sue you i sue you money on those lazy people.","commenter_a":"So granny doesn't love metal sausage.Why?","post_message":"Definitely not lovin' it"}]
