[{"comment_id":"659550864214259","commenter_b":"#lastword","commenter_a":"@username @username This is so true!","post_message":"How true is this?  Thanks to www.republicandirtytricks.com"},{"comment_id":"10153345194546833","commenter_b":"Tell this liberal she can keep her money. I","commenter_a":"They just need to come take them","post_message":"The Hill:  Congresswoman Rosa DeLauro is expected to reintroduce the the \"Support Assault Firearm Elimination and Education of our (SAFER) Streets Act\" which would offer gun owners tax breaks for voluntarily turning in \"assault rifles\" to local police departments.    \"Assault weapons are not about hunting, or even self-defense, says Rep. Rosa DeLauro (D-Conn.).  is no reason on earth, other than to kill as many people as possible in as short a time as possible, that anyone needs a gun designed for a battlefield."},{"comment_id":"10154084384520695","commenter_b":"Good for you. My half white, have Creek. Mother - full blooded Cherokee. . . And l saw a lot of beautiful children of all colors posted here.","commenter_a":"Why does the baby have to be white","post_message":"7-month-old Isla is darn cute."},{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"1046837848719437","commenter_b":"@username You must be trying to sound smart but if you are a Trumpeter... Oh well need I say it? Trump lies every single time he opens his ignorant mouth! I will take my chances with @username! At least she has a coherent campaign beside I am uh going to uuhh build a Wall YEAH a Great big wall DUH!","commenter_a":"When voters were asked to say the first word that came to mind when they thought of @username, the most popular responses were , , and .","post_message":"The fate of immigration reform—and millions of undocumented families—is in the hands of the next president."},{"comment_id":"1769361876675571","commenter_b":"Chinguen su puta madre ,al igual sigana trump nos seguiremos pasando i cruzando la frontera ,pongan ipongan sercas siempre los burlaremos 100% mexicanos gustele aquien leguste somos los #1 .","commenter_a":"Nice honest, rich family.","post_message":"In an impassioned speech, Eric Trump called on Americans to \"vote for the candidate who can’t be bought, sold, purchased, bribed, coerced, intimidated or steered from the path that is right and just and true!\" @webpagelink"},{"comment_id":"10154001365909497","commenter_b":"There are plenty of nice average looking women that \"nice\" average looking guys ignore because they chase hot chicks. It works both ways.","commenter_a":"Local man who would be good provider for area woman`s kid friendzoned while area woman dates unemployed band members. Area woman complains about lack of good men.","post_message":"\"If they find a cure for Zika tomorrow, it not like I can afford to get pregnant under my current insurance plan.\""}]
