[{"comment_id":"10154944748138690","commenter_b":"Rohingas living there from 400 years! How much time need to be a citizens of a country? And any illegal citizens can be clear by any countrys government, Bangladesh will do that and India also can clear any illegal citizens from their country.","commenter_a":"He is a Novel laureate for peace from Bangladesh but he didn't said anything about Myanmar Muslim crisis!! Bangladesh facing huge problem for the crisis but as a novel laureate he has some responsibilities to stop violence in Myanmar but he acting like a blind coward and always making way to steal money from poor peoples. That's why Bangladeshi peoples think he is a greedy businessman and Novel price is a joke!","post_message":"\"If it is politically motivated, to victimize a person, then it is a cause of concern.\""},{"comment_id":"1276618955685054","commenter_b":"When are these yahoos going to discuss issues that are important to the American people???","commenter_a":"The funniest joke is Rubio not winning his own state. Hysterical. \"Two weeks left buddy, & counting.\"","post_message":"Spray tan? Is Marco Rubio trying to beat Donald Trump by doing his best impression of Donald Trump?"},{"comment_id":"10153173112591130","commenter_b":"Still wished the lowlife bitch had fallen and broke her neck 😁😀😀","commenter_a":"Lol what a retard she is. Her stupid tail is in jail has to pay a large fine ( I'm sure she's part of millions living off working people so it won't matter to her ) and the flag was raised again. Great to see the flag rise again","post_message":"\"We removed the flag today because we can't wait any longer.\""},{"comment_id":"10153902259248855","commenter_b":"She will","commenter_a":"Can only hope it won't look like don't ask don't tell","post_message":"Will she follow through?"},{"comment_id":"1131999030168888","commenter_b":"Heroin is effecting all colors all races from all backgrounds!!!","commenter_a":"I like how heroin is effecting white people the way crack effected the black community but the way the media and police are dealing with it is completely different. Instead of calling them junkies or addicts it's an epidemic and now it's a family issue. Just lock them up like you did to black people in the 80's.","post_message":"Police want you to see these viral images of what heroin is doing to families."},{"comment_id":"10154020579286051","commenter_b":"Old dumb bitch","commenter_a":"This is a GOP lying bash Hillary bunch of bitches","post_message":"Describe Hillary Clinton in one word."},{"comment_id":"10153680141531077","commenter_b":"Safe.","commenter_a":"So sad that we need this kinda security for the Super Bowl.","post_message":"How would all this security make YOU feel?"}]
