[{"comment_id":"10152561774511813","commenter_b":"Gigantic assholes.They should both be ass-raped, and have the first miracle ass-babies. See how they feel about the issue then.","commenter_a":"ACLU Are you helping folks like this from gov't overreach? @webpagelink","post_message":"Are these people who we want to make decisions about a woman’s reproductive care? Tell politicians: don’t turn back the clock on women’s healthcare. @webpagelink"},{"comment_id":"10154939556251320","commenter_b":"WE DON'T NEED, YET, ANOTHER ROSIE O'DONELL barking her bossy pants ignorance our way!!","commenter_a":"All the comments below ring as TRUTH, but tolerance and inclusion goes a LONG LONG way. Whether OR not you agree with ANYONE's lifestyle choices!","post_message":"Susan Olsen, who played Cindy Brady on  Brady Bunch has been fired from her job as a Los Angeles-based radio DJ after she posted a homophobic rant on Facebook."},{"comment_id":"10153310533507629","commenter_b":"Women beater","commenter_a":"He is the scumbag of the earth.","post_message":"Fox News anchor Bill O'Reilly has been accused of dragging his ex-wife by her neck down a staircase in the couple’s home."},{"comment_id":"10155873946605354","commenter_b":"Ass wipe.","commenter_a":"Because he's a Libtard","post_message":"Why would a Cuban rapper take offense at remarks against crime by Mexican illegal immigrants?"},{"comment_id":"935609056472847","commenter_b":"But they were fat girls","commenter_a":"They must not live near a Mcdonalds","post_message":"She says her two best friends turned on her and beat her for nearly two hours."},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"943090809073276","commenter_b":"Why do women need to vote anyway?","commenter_a":"I would say that's higher than 44%","post_message":"Yep..."}]
