[{"comment_id":"516205071910642","commenter_b":"The white lady isn't a part of the scam, but she made upwards of a million dollars in a year, okay ojay,we believe that the white woman's hands are clean, not!!!","commenter_a":"This a way to steal African children, a form of modern day slavery. African children was stolen from their parents over 400 years ago, and they were paid to do that then. What is wrong with you people?","post_message":"Watch How Thousands of Children Are Currently Being Stolen From Africa"},{"comment_id":"1269700346456350","commenter_b":"Too bad the women in 296047720780605s life are undeserving.","commenter_a":"I've tried to explain this to friends and family.... and that I have no problems with them being Republicans, it's their blind support of this horrible man that is problematic.","post_message":"Let's get this straight...  Thanks to CAFE."},{"comment_id":"10158132279970153","commenter_b":"Go Israel .. squatters Go home!!!!","commenter_a":"gy","post_message":"LIVE: Amona settlement evacuation underway in West Bank  READ MORE: @webpagelink"},{"comment_id":"10153076463414753","commenter_b":"If a woman in a bikini top was eating, would you also become this aggressive and immature ?doubt that very much. Grow the hell up.","commenter_a":"and why should we have to move our seat, or \"look away\"? we pay our money for a peaceful meal, not a side show!!!","post_message":"A woman in a cafe was nursing her child when she was approached by a man who asked her to cover up. That's when the cafe owner stepped in and had a few choice words to say."},{"comment_id":"10155404050665492","commenter_b":"Your entitled to carry your personal property anywhere you want . Just put it away when you spot the vermin .","commenter_a":"Having your phone in hand is tantamount to having wad of cash in hand.","post_message":"The subway rider was also punched in the face."},{"comment_id":"1724899471110412","commenter_b":"And what did she sound like a complete or just partial idiot","commenter_a":"Scared Bitch? Sure sounds like you are!!","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153854573245779","commenter_b":"Bullshit","commenter_a":"If were a boy... all feminazis here asking death penalty.... hypocrisy","post_message":"A 14-year-old girl sent suggestive pictures to a classmate and now she might have to register as a sex offender. Here's why this is absurd."}]
