[{"comment_id":"10153594324081336","commenter_b":"These animals should be disposed of! Don't waste the tax-payers money on public defenders, trials and a life in prison!","commenter_a":"This animals need to be caught and put away for life!","post_message":"The Lash family had just returned home from vacation when a group of teens came to the door and asked to borrow a jack for their car, then tried to force their way into the home."},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"10153881107946680","commenter_b":"Another Misogynist","commenter_a":"\"I'd grown up fearing the lynch mobs of the Ku Klux Klan; as an adult I was starting to wonder if I'd been afraid of the wrong white people all along - where I was being pursued not by bigots in white robes but, by left-wing zealots draped in flowing sanctimony.\" -- Clarence Thomas Vote Trump. He's easier to impeach.","post_message":"\"Long overshadowed by Scalia, the quiet radical is poised to shape his legacy.\" Via POLITICO Magazine"},{"comment_id":"688602181316881","commenter_b":"Bitch bye","commenter_a":"@username smh","post_message":"Does a White Parent of a Biracial Child Have to Accept the Child's Other Racial Identity?"},{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"10153472198206336","commenter_b":"She is sick!!","commenter_a":"I don't even know who she is; and if I was that bakery, I would sue her butt of, instead of letting her get away with that and having my rating dropped because of it!","post_message":"The California bakery was downgraded to a B rating after a video revealed that Ariana Grande had licked doughnuts in the store."}]
