[{"comment_id":"10155922805640725","commenter_b":"He will. Ana Smith . you are sick. Nasty mouth.","commenter_a":"Trump 2016 !! Make this country GREAT again!","post_message":"My #GOPDebate Facebook question for the other candidates-"},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination\""},{"comment_id":"1716977158581874","commenter_b":"You are a troll. Won't work here. Illegals will be deported en masse.","commenter_a":"@username I've been saying this for years. NOW, USE THIS INFO! If you state this info you will find more acceptance from the immigrants and especially the children who are now protesting you. For you will enlighten them and show them that they are being taken to the cleaners. The illegal immigrant is enticed to the USA. Have your people look this up.. The immigrant is being used and abused. The very children you see protesting you have no idea that the WELFARE they are receiving (and their parents are spending) is to be PAID BACK. Poof can be seen by how SSA is now taking retirement benefits from people (up to 15%) to pay back college loans. Loans that were taken out years upon years ago. Also if citizens received SNAP, TANF, Medicaid, or SSI they are paying back that money they received before retirement age by a lowering ...","post_message":"When illegal immigrant households receive far more in federal welfare benefits - than \"native American households - there is something CLEARLY WRONG with the system! Continuing this track will NOT MAKE AMERICA GREAT AGAIN! I will fix it, Crooked Hillary will not!"},{"comment_id":"1229955423699206","commenter_b":"Kick there asses and give them thirty days in jail and a ten thousand dollar fine.","commenter_a":"Dump the Trump - Really? - Obummer has divided this Country for the past 7 years.","post_message":"How would you deal with these protesters?"},{"comment_id":"10154416632443701","commenter_b":"He already said he's voting for her lol","commenter_a":"Ugh!! Until I hear it from his mouth I don't believe it. Why should we believe ANYTHING a biased news station and a corrupt politicians say? In fact, if you read the article, it specifically says Bernie has not announced he endorsed her. Coming together in issues is NOT the same. Mis-leading headline, once again!! Sanders has not yet said he will endorse Clinton but told reporters on Saturday that the two campaigns were coming together and to stay tuned.","post_message":"Former Democratic rival Bernie Sanders will join Hillary Clinton at a New Hampshire event on Tuesday where he plans to endorse her."},{"comment_id":"10153155003323812","commenter_b":"Dip out? Only women bleed.","commenter_a":"\"Hardest moment of her life\" it was pretty easy for her to dip out before this story got national attention though wasnt it?","post_message":"UPDATE: Mom calls decision to give up newborn with Down syndrome \"hardest moment\" of her life: @webpagelink"},{"comment_id":"10153909407028598","commenter_b":"Girls, start being more selective of your boyfriends. Think first and maybe you won't regret your actions later.","commenter_a":"I hope someone puts him out of commission!!!","post_message":"Boyfriend and Two Others Assault Pregnant Teen, Punch Her Stomach to Kill Her Unborn Baby"}]
