[{"comment_id":"549880968533529","commenter_b":"The ones who say they are refugees are young muslim men . I never see women or children in the pictures. This is what obummer wants to bring to America.","commenter_a":"It's funny how you people think all Muslims are bad, but I never heard you talk about all the Muslims in California who raised over 200k dollars for the victims of the San Bernardino shooting. Or what about the Muslims in Africa who protected Christians from getting shot on a bus.","post_message":"This makes me SICK!!!"},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"10154248049506337","commenter_b":"Chevy only beats up womens self esteem which is better I guess. Do your research.","commenter_a":"Chevy is awesome leave him alone. Seagal is a little bitch that beats women. He's hardly even a celebrity. Chuck Norris should round house his ass.","post_message":"WHEN THE HOT SEAT GETS TOO HOT... From Chevy Chase to Steven Seagal, these celebs just couldn't handle getting roasted. Check out 'Comedy Knockout' on truTV. @webpagelink #ad"},{"comment_id":"10156602448280725","commenter_b":"Yes I just got a form in the mail to change so I could vote for Donald Trump Thank you","commenter_a":"To all Trump voters! If you not registered as a Republican, your vote WON count in your State primary election. Your vote will Not be counted if you are not registered as a Republican. You must register as a Republican ASAP. Find out your state rules and register now. Better yet, don wait, Register Now! Make your vote count for Donald Trump 2016!!! Please share this with Donald Trump voters.","post_message":"Many people voted for Cruz over Carson because of this Cruz fraud. Also, Cruz sent out a VOTER VIOLATION certificate to thousands of voters."},{"comment_id":"778536202281765","commenter_b":"Lynette Houdek You really need to take a class in comprehension. Trump said he would renegotiate the trade deals so America gets a fair deal. You speak of the Colorado fiasco. What is crooked about it is that they locked the Trump delegates out and removed their names from the ballot. That is called rigging the election. Please take the class I suggested.","commenter_a":"Krauthammer, you think Cruz could handle China. Trump has done business with the Chinese. He know's what he is doing. The business in Colorado is a disgrace. Trump delegates were turned away and their names scratched off the ballot. Does that make you proud of our \"Banana Republic\"???","post_message":"Is Krauthammer right?  WATCH:"},{"comment_id":"1043006319050712","commenter_b":"Limit the size of corporations ! Make them pay better wages and of course pay there taxes !","commenter_a":"It is important for one of the worlds' largest companies making huge profits, paying substandard wages, few benifits, manufacturing goods in the worst labor markets, akin to slavery to also hide it's money to avoid paying taxes to the government that provides medical care and food stamps to it's employees. After all what fun would it be to make obscene profits if you actually paid your fair share of taxes.....","post_message":"You won't find a Wal-Mart store in Luxembourg, but it does help the retailer avoid major US taxes."},{"comment_id":"1755849284702183","commenter_b":"Fuck Muslims","commenter_a":"That's not how it read last year fool think we forget","post_message":"They Told Him It Was A 'Threat To Muslims'... and his response went viral.  Do you support his right to fly our flag?"}]
