[{"comment_id":"1626733787627072","commenter_b":"D'nariusLovable Lewis you ever hear this girl talk? Lol she is delusional and ignant as fuck haha","commenter_a":"Tomi Lahren. The next Ann Coulter?","post_message":"You've seen Tomi Lahren's criticism of anti-Trump protesters making the rounds. Here is our Occupy Democrats response. Share it on her wall to make sure she sees it!"},{"comment_id":"950867651635304","commenter_b":"The son of a bitch is white----that's why!!","commenter_a":"How bout this bastard coward be sentenced to 79 years, the age of the gentleman he hit, please put him with the gangs","post_message":"Texas man who filmed himself assaulting an elderly black man during what is known as the “knockout game” sentenced to 71 months in federal prison.  Conrad Alvin Barrett was charged with a hate crime for punching 79-year-old Roy Coleman, fracturing the man’s jaw in two places. Barrett said he targeted the man to see if the assault against an African-American victim would be nationally televised. MORE ----->  @webpagelink"},{"comment_id":"1440023386030632","commenter_b":"Amen","commenter_a":"It's really a fresh wind","post_message":"Find out why Judea and Samaria leaders say, 'a new wind is blowing from the US.'"},{"comment_id":"10153866102494160","commenter_b":"Guess he ought to have plenty of money to go on vacation about ten times a year.","commenter_a":"@webpagelink payments By Morgan Chalfant Published March 18, 2016 Washington Free Beacon President Obama sought to increase the amount of money available for the federal government to spend on former presidents in advance of his White House exit. In his budget requests for fiscal years 2016 and 2017, Obama proposed hikes in the appropriations for expenditures of former presidents, according to a report from the Congressional Research Service published Wednesday. The report, which discusses the pensions and other federal benefits offered to former commanders-in-chief by way of the Former Presidents Act, specifies that Obama’s 2017 budget proposes a nearly 18 percent hike in appropriations for expenditures of former presidents. He successfully requested an increase in such appropriations for fiscal year 2016. “The President’s FY2017 budget request seeks $3,865,000 in appropriations for expenditures for former Presidents, an increase of $588,000 (17.9%) from the FY2016 appropriation level. The increase in requested appropriations ...","post_message":"Barack Obama's new digs come with a huge price tag."},{"comment_id":"631003300406505","commenter_b":"She's a force to be reckoned with","commenter_a":"Bre Camp spirit animal?","post_message":"WATCH: 2-year-old Violet lives with her family in Shreveport, Louisiana, but she soon could be on Broadway as her rendition of the alphabet song is becoming a viral sensation. Jesse Tyler Ferguson, who just finished a Broadway run, shared this video on his Facebook page, writing \"I can't help but think this what Elaine Stritch was like as a child.\" @webpagelink"},{"comment_id":"10153677619074641","commenter_b":"Radicalism is one of the biggest problem for all countries and all societies. If you say radicalism or terrorism is related to a religion, it is completely wrong . You can see a lot of samples from history. The important point here is why radicalism has raised within last ten-twenty years. One of the answer of this question is imperializm. USA has raised terrorizm and radicalism on the world , africa, middeeast. ( Iraq, Libya invasion , bombing , killing more than 1 million people ) . USA has really created huge chaos in middleeast and destoyed Iraq. So ISIS has came up there . Terrorizm in middleeast is not religion issue . If USA and other countries had did same thing ( bombing , invasion, killing , creating chaos continuosly) at another part of the world during years, you would see similar terrorist groups there. So in order to ...","commenter_a":"Why ISIS hates France so much ? @webpagelink","post_message":"French President Hollande: \"We are at war -- a war against terrorism.\"   More: @webpagelink"},{"comment_id":"10154079129819091","commenter_b":"Pence CNN 9/8/16 \"I think it's inarguable that Vladimir Putin has been a stronger leader in his country than Barack Obama has been in this country.\" Pence VP Debate 10/04/16 \"That is absolutely inaccurate. I said he's been stronger on the world stage.” Like his master Trump, Pence lies about his lies. The Trump campaign hostility towards President Obama is a national disgrace. President Obama is 100 times the leader that Trump or his boy Pence will ever be.","commenter_a":"The problem with Kaine was when Kaine spoke, Pence let him speak but the minute it was Pence's turn, two seconds into his turn Kaine was interrupting him, he's such a putz.","post_message":"VP nominees Tim Kaine and Mike Pence were both on the attack Tuesday night:"}]
