[{"comment_id":"10153204026980090","commenter_b":"I will NEVER EVER forget her saying \" What Difference at this point does it make\" Americans died Hillary don't you get it?","commenter_a":"FOUR MOTHERS, that's Mothers, NOT MILLIONS, that's The Difference Hillary it's Time to get Right with God, you will be glad all through out Eternity!!!","post_message":"Hillary Clinton still owes us answers.  SHARE & SIGN to support Republicans fighting for the answers: @webpagelink"},{"comment_id":"1110364735689669","commenter_b":"I'm confident the courts will rule it unconstitutional. They better!","commenter_a":"I suggest that all intelligent, human Oklahomans leave and then we build a wall around this putrid state and let them fester in their backward, flat earth, anti evolution, bible thumping mess.","post_message":"The Republican War on Women continues as a bill making abortion a felony was passed without discussion or debate."},{"comment_id":"10154814008013797","commenter_b":"Why feed nd house this p.o.s just torture em till.hes dead","commenter_a":"Piece of 💩","post_message":"LIFE IN PRISON: In the man's car, police found children's toys, chloroform, sleeping pills, cable straps, thumb cuffs, a stun gun, latex skull masks, gags and various strangulation devices."},{"comment_id":"10154045575585575","commenter_b":"Who cares what you say ASSHOLE...............","commenter_a":"And how long would you last in a war with America fool?","post_message":"Vicente Fox jumps shark. Says Trump election will lead to war."},{"comment_id":"10153603193848132","commenter_b":"That's cause her hair isn't real. It's fake as that tan she has. Your daughters are beautiful btw!","commenter_a":"My daughters are only half African American. Just thought I would lighten this post up some! Was tired of seeing negative comments.","post_message":"The race scandal continues."},{"comment_id":"954404074652647","commenter_b":"Hey boys go check the Negro-in-Chiefs record. Highest deficit of all time Biggest deficit than last 5 presidents combined. Highest sustained unemployment in history.","commenter_a":"how true how true","post_message":"A reality check for our Republican friends...  Thanks to Roy Mark Ramdas."},{"comment_id":"598960046961241","commenter_b":"YES, fire him!!","commenter_a":"I agree he definitely needs to be fired","post_message":"Police chief announces that he going to enforce Shariah Law.  He can't get away with this. Shariah law has no place in America.  Do you think this police chief should be fired?"}]
