[{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."},{"comment_id":"10153357050192464","commenter_b":"Israel is bankrupting America, rich Jews are destroying democracy & destroying jobs here in America, Jewish love-of-money & Golden Calf worship & other anti-Christian values are totally corrupting America and infecting the world such that Talmudic-believing Jews have put us on the path to the 6th Mass Extinction of Live on earth. And for 35 years we've had Presidents who love love love Israel, to America's detriment. I believe God is punishing America for supporting Israel. It is time we have a Pres who doesn't believe the propaganda, who sees Israel for what it really is, who knows Jews are no longer the poor, hungry victims of discrimination & the Holocaust but are now the oppressors & suppressors & war-mongers, the rich, greedy & self-serving people who don't give a damn about the USofA or the American people but only care about themselves. And we need a POTUS who isn't ...","commenter_a":"Look at the country's that take money We get no TAXES and the PEOPLE get no help","post_message":"SHARE if you agree we need a President who will #StandWithIsrael!"},{"comment_id":"1244441208928501","commenter_b":"@username, women can't do anything they want to men. Are you saying that because you can't get laid, you should be allowed to kick a woman down the stairs?","commenter_a":"There's no excuse for this. No, none whatsoever. #MisogynySucks #EndViolenceTowardsWomen #TreatHerKindly #TreatHerWithDignity #TreatHerWithRespect Only a #Caveman would do that.","post_message":"A man in Berlin kicked an unsuspecting woman from behind, sending her flying down the stairs."},{"comment_id":"10154064327489575","commenter_b":"Rape him then burn his sick a$$","commenter_a":"Justice.","post_message":"A jury found William Gholston guilty of murdering 15-year-old Ben Davis High School student Dominique Allen. Allen’s burned body was found in the backyard of a near west side home in 2014. She had been strangled and her feet and hands were bound with a wire."},{"comment_id":"10153769957503984","commenter_b":"get rid of her .","commenter_a":"Couldn't have been too quiet, you know about it. She quietly sign with them because old agency smart enough to drop her?","post_message":"Megyn Kelly very quietly just made a huge move that could change everything for her and Fox News. What do you think? Should Megyn stay or go?"},{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."}]
