[{"comment_id":"1757425844524023","commenter_b":"Is not as easy as you put it my friend, illegal immigrats don't just 'apply' to get their papers...if it were that easy we woudnt have so many illegal immigrants.","commenter_a":"I am sure this girl is worried about deportation of her parent's. I am also certain that many kids of illegal immigrants living in the US are fearful.. but wouldn't parents apply for a visa and for proper citizenship? So their kids wouldn't live in fear? And set an example that this is exactly why the US is the greatest place to live!","post_message":"Young child of undocumented parents speaks at the Democratic convention about her fear of being deported: 'I’m scared that at any moment my mom and my dad will be forced to leave. And I wonder what if i come home and find it empty?' @webpagelink #DemsInPhilly"},{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"10153516568789087","commenter_b":"Muslim is not a religion it describes someone who worships Islam. Guess what ISIS stands for? Its the radical group of Muslims you understanding? Its a Muslim group of people that engages in terrorism. Trump wants to ban Muslims from coming here and he wants American Muslims to help us sort out who is good or bad.","commenter_a":"How is Trump a white supremacist? He has never said anything racist okay 'illegal' is not even a race. Trump has said millions of times he supports immigration. What he does not support are people that are dangerous getting free cards to come here. Also to those who say illegals don't use Government assistance they do. They fucking come here have an anchor baby and then use the babies citizenship to get Government assistance. We have a serious problem I have a Mexican friend who is American with perfect credit and great job. She tried to buy a house and got told no. Guess what same house and a family both illegal except their 2 girls bought the house. How is that fair to anyone? Illegal immigration impacts Mexicans who are already here legally and it's not fair to them if others cheat the system. If you are so damn ...","post_message":"“I would certainly return it if you think it is appropriate,” Donald J. Trump told a voter who asked if he would return the donation he received from noted white separatist William Daniel Johnson. “I would return it. Don’t be so angry, I don’t even know who he is.”"},{"comment_id":"480718348785412","commenter_b":"She needs to take her husband and leave go back to were ever their home is","commenter_a":"She has no right to tell anyone what they can or cannot eat. She needs to worry about herself.","post_message":"What Michelle Obama is banning now is just plain unacceptable.  The American people are tired and finally fighting back.  Do you agree Michelle Obama should mind her own business?"},{"comment_id":"1687846428128746","commenter_b":"What a nice sounding kid.","commenter_a":"Build that wall for America and make it big and strong! Trump 2016!","post_message":"I have built so many great and complicated projects – creating tens of thousands of jobs in the process. Building a wall is A LOT easier than building a 64 story building!  LET'S #MAKEAMERICAGREATAGAIN  www.DonaldJTrump.com/Nevada"},{"comment_id":"10154394358144062","commenter_b":"I don't trust these hoes","commenter_a":"'According to the police report, Crowley was intoxicated and made inconsistent statements about Manziel's actions. ' Dem hoes!","post_message":"Johnny Manziel could face NFL discipline for Ohio incident..."},{"comment_id":"10154568274058690","commenter_b":"'@username lay off the meth girl","commenter_a":"If this story was other way around everyone would have called him a terrorist and the 2 billion muslims had to apologise for his actions.","post_message":"Arab communities in the United States are in shock after a Lebanese-American man was shot and killed by a neighbour that had allegedly used violence and racial slurs against the family for years."}]
