[{"comment_id":"10152987522331336","commenter_b":"Hahaha stupid white girls","commenter_a":"Wish we could deport him..","post_message":"Moments ago, President Barack Obama vowed to appeal a federal judge’s ruling to block executive action on immigration. @webpagelink Don't miss Texas Governor Greg Abbott's response tonight at 10p ET on 'Hannity.'"},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"1212130192174477","commenter_b":"Shall I keep going?","commenter_a":"Y'all are duped!!!! This is fake news, funny how any regular news outlet is not covering it. This would be mana fro heaven for CNN. Of course you now have been clued in, it won't do any good because you drank the Kool-aid and facts don't matter anymore. The fact that the fake story exists it a testament of propagated ignorance where it OK to be lazy and not even try to find the truth.","post_message":"IRAN OPENS Military Theme Park For Kids To Fight Israel, The West: Military Checkpoints, Machine Guns, Bullets Firing At U.S. Flags, Bunkers Replace Roller Coasters [VIDEO]"},{"comment_id":"1004051086318087","commenter_b":"Hillary is a BIG LIAR","commenter_a":"HILLARY CLINTON 2016!ALL THE WAY TO THE OVAL OFFICE!!","post_message":"With just 100 days until the Iowa caucuses, James, a Hillary for Iowa organizer, is taking over @HillaryClinton on Twitter. Follow along to hear why he’s working hard to elect Hillary: @webpagelink"},{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"10153692267024087","commenter_b":"Li'l ol' ladies with landlines","commenter_a":"In New York,Hillary has a 4-point lead over Sanderss...There is no doubt that she will win N.Y thanks to black votes but by a small margin......She is so popular among African Americans despite that her husband sent 2.4 million black males in jails..It is difficult to explain or justify thier desire to vote in favor of their oppressor..She has 16 points ahead of Sanders in the city of Philadelphia (Pennsylvania) once again thanks to black voters.Hlllary clinton is unpopular among independents and blue collars .It will be impossible for her to win the general election in November without these voters.. ..Only Sanders can persuade independents,and blue collars to vote for democrats in the next election...Sanders is also the only leading candidate with positive favorability at the national level. .","post_message":"\"This is the best territory for him on the calendar,\" Hillary Clinton's campaign chairman John Podesta said of Bernie Sanders's recent wins. \"Most of those were Western caucuses. But when you look at what happened overall in this election, she's gotten 2.4 million more votes than Bernie Sanders.\""}]
