[{"comment_id":"521952154659744","commenter_b":"When pigs fly, I'll believe it when I see it!","commenter_a":"Thank you for finally thinking of Americans and our safety !","post_message":"BREAKING..."},{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"},{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"10153155824991770","commenter_b":"My all time favorite woman. Great leader, strong, respected. Leader@","commenter_a":"Certainly an Iron Lady! Lest you forget she helped cover-up atrocities committed to the Irish people in the occupied 6 counties. Allowed 10 hunger strikers to die and was forced out of office. Thatcher came under intense pressure from Ronald Reagan to avoid a military response from the Falkland Islands.","post_message":"Margaret Thatcher has been voted the most influential woman of the last 200 years in a recent poll."},{"comment_id":"10153065703956717","commenter_b":"Glad she's getting threats! Don't go to sleep, bitch!","commenter_a":"Another reason I wouldn't live down south.","post_message":""},{"comment_id":"10153058403318984","commenter_b":"Americans should shoot and kill all radical invading muslims on sight.","commenter_a":"Stop by my place I will make you a BLT with extra bacon","post_message":"Mind blown. One of the world’s biggest schoolbook publishers just ‘banned’ this to avoid offending people... There is no way they can be serious!  Do you agree that we have got to get a grip on all this nonsensical political correctness?"},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."}]
