[{"comment_id":"1387099161383134","commenter_b":"No, your mother giving birth to a bitch was","commenter_a":"Oboma is a scared ass chicken shit bitch","post_message":"CHECKMATE."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"1589904131315822","commenter_b":"That's the stupidest reason I heard from a grown ass stupid woman/mother","commenter_a":"My choice was Bernie Sanders, but now I have to vote for Hillary Clinton because I 'm a navy mom and I don't want my son to be under the regulation of Donald trump, he said that he likes war.","post_message":"Oprah BEGS America: You don't have to LIKE Hillary, but you MUST vote for her!  Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1420510454708671","commenter_b":"i wonder if there will be a point when the majority, or at least, SOME, Republicans will grow some balls, and say ENOUGH???.....and i just sent an email to both of my state's gutless excuses for elected officials and pledged my unwavering dedication to get their sorry asses whipped come next election...","commenter_a":"Lol your funny Trump you don't have all the control like u think u do lol","post_message":"Got him!"},{"comment_id":"10153582550231336","commenter_b":"Hi Donald Trump, what about putting those illegal people in the row to go fight against IS IS if they want to stay so bad. The America way!!!!just a thought.","commenter_a":"Hillary will send food stamps.","post_message":"In an interview, Donald J. Trump said that he would deploy U.S. troops to Iraq to seize ISIS-held oil fields, in order to choke the financial spigot that fuels the terror group."},{"comment_id":"10153903650539087","commenter_b":"'@username - You're behaving like a whining whore. Give it a rest.","commenter_a":"It's good that she's fielding questions about her emails? It would probably be even better if she wasn't such a unethical, lying piece of crap and didn't have to be in the position to have to answer those said questions, wouldn't it?","post_message":"Hillary Clinton showed that she's a skilled politician who understands exactly the way media works."},{"comment_id":"1384042331652908","commenter_b":"Good on ya.","commenter_a":"I stopped looking twenty years ago and saw my best friend and 'soul mate' even though I know that souls are just a fantasy, right in the mirror. So me and my self became best friends and I haven't needed anyone in my life since then. I've been happier, I bought two homes in the last twenty years, and the freedom from the male drama is the best feeling in the world!!!","post_message":"As one writer points out, we spend endless hours wishing for, praying for, begging for our soul mates – that person who will finally make all the suffering worth it. But I’m here to tell you a little secret."}]
