[{"comment_id":"1382661791756865","commenter_b":"Somebody pleass shut this fatass up.","commenter_a":"some day little fat man someone is going to shut your mouth when you talk about things u don't know anything about.u are just mouthing off cause u want to be a big ass --- hum you already have a big ass --- so get off President Trumps back. he is only do what he needs to do to keep America safe","post_message":"Michael Moore always finds a way to be even more classless than he was minutes before! That seems to be his only real talent."},{"comment_id":"10153229329259087","commenter_b":"Check out this bitch","commenter_a":"Oh, a little tidbit that maybe Trump supporters don't know: Trump's current wife is a former almost porn star and underwear model for a wife. Yep, just what we want in the FLOTUS! Someone that EVERYONE can know and see what she looks like naked, and on all fours... TRUE","post_message":"GOP presidential front-runner Donald J. Trump went on the offensive on Thursday morning, attacking cable networks for treating him unfairly, slamming several presidential rivals as \"shrill\" and inexperienced, and pushing back on Pope Francis's opinions on climate change and immigration."},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"10154449386136336","commenter_b":"Ban Muslims Now!!","commenter_a":"Open mouth insert foot.","post_message":"Last night on “Hannity,” Mike Pence echoed Donald J. Trump’s call for a temporary ban on immigration from countries where terrorists represent a threat to the United States. @webpagelink"},{"comment_id":"10153551887101130","commenter_b":"it was funny....people lighten up","commenter_a":"Be serious. Not offensive","post_message":"You be the judge."},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"}]
