[{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"936644226390980","commenter_b":"The typical holiness young woman will argue with a tree and maybe this is why they got together and removed this mother from the church the reason refused to listen to anyone else way of thinking you be bless and I hope you live as long as the 103, may the same happen to you","commenter_a":"From what the article said... she thinks he's trying to change the denomination of the church. .. this beautiful 103 mother misunderstands that Holiness is a way of life.. not a denomination.. the Pastor could have handled this better. .. there's no need to put her out of the church. . To be sanctified means to live a life separated from sin.. that's not a denomination either. .. sounds to me that teaching through love and kindness is in order.. people seem to fear what they don't understand. . To call her names and disrespect her by leaving her in a dark church is not right and does not reflect Holy living . They need to repent of that.. always respect your elders regardless. .. but also remember .. just because your old does not mean you know all the way of the Lord... no one does.. that's why we ...","post_message":"A 103-year-old Georgia woman was banned from the Elberton church she’s served for 92 years after she voiced concerns about the pastor’s sermons.  After ignoring the ban and attending church the weeks after getting the letter, the pastor dismissed the service and left her sitting in the pew with the lights off. Police were notified, but refused to throw a 103-year-old woman out of church.   She was also subjected to slurs from their former fellow churchgoers. MORE ----->  @webpagelink"},{"comment_id":"981038348622309","commenter_b":"All the prostitutes brainless Repugnicans were born from a cow. Have no brains no soul no dignity full of hate and hipocersy and a aberration against women . Why ? Their mothers are cows.","commenter_a":"Why do Ryan's wife and daughters stay with a man who has nothing but loathing for their gender? Can they not exert any influence over him? If THEY cannot, will he listen to anyone that opposes his point of view? I seriously hope his daughters are never raped, never need the assistance of Panned the Parenthood. He can evoke \"Family Leave\" and I am sure he will still receive full pay - pay that is provided by taxpayers who he wants to deny \"paid family leave\". He will also work against Social Security and Medicare, but when he retires I believe he will gladly accept it. Can his man be any further from someone we want to represent our interests in Congress? He has no interest in representing us. He has NO integrity.","post_message":"Examine his voting record and you’ll find Ryan to be anything but a representative of the American people. Especially when it comes to female Americans."},{"comment_id":"10154627500178812","commenter_b":"Wow. Ugly duckling. This is the type of woman who supports men who want to take all your rights away, ladies. Feast on that.","commenter_a":"Shut up ABC, ones a Princess, the others a ugly duckling!! One upholds her beliefs, the other goes with the flow!! Referring to # 1 for the first gal, # 2 for the second picture.. ABSOLUTELY NO COMPARISON!! ABC, this would be called gender racism!!! Un Cool!!","post_message":"When you look at how much Chelsea Clinton and Ivanka Trump have in common, their friendship isn't so unbelievable."},{"comment_id":"10153479887206037","commenter_b":"There are no grounds to deny 3 women, 4 men or any number imaginable from acquiring a marriage license. Where does the number 2 come from?","commenter_a":"Good job supreme court! Whether you agree or disagree with same sex couples it is not our right to judge them. It is nobody on this earths right to judge anyone. May all same sex couples find happiness","post_message":"Follow our live blog for all the latest updates on the U.S. Supreme Court's #MarriageEquality decision."},{"comment_id":"1334341989975359","commenter_b":"@username We should give them hard labor in the form of building the wall.","commenter_a":"This arrogant convicted criminal is an excellent example to bring up next time any leftist Democrats claim there isn't any voter fraud. Safe to say we know where she will be for about the next 3-4 years with good behavior.","post_message":"ARROGANT ILLEGAL ALIEN Who Voted 5 Times In 2016 Election Gets 8 Years…Lawyers Call Sentence “Harsh”…Blame Trump…LOL! [VIDEO]"},{"comment_id":"10153039611668984","commenter_b":"Shoot this prick and his offspring","commenter_a":"I support the 25 congressmen that voted against you! And ALL YOU DID WAS PROVE THEM RIGHT MR! JOHN HUSSEIN BOEHNER! YOUR A VINDICTIVE DISGRACEFUL representative!","post_message":"John Boehner may have just sunk to a new low with this move. This is the type of thing I would expect from a 3rd grader, not a supposed leader like Boehner.  Do you support the Republicans who stood against John Boehner?"}]
