[{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"},{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."},{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."},{"comment_id":"10153216569907550","commenter_b":"@username, lol you all claim its part of your heritage... First and foremost did you READ my post carefully? Because if you did you would know that I was referring to the past southerners who DID do all that. Your heritage is ALL THAT.... Your southern heritage is a hateful one and that's what you all are holding on too... You Keep saying that flag is our heritage. Name one good thing the south did for the slaves that wasn't hateful and name one good thing that flag represents. And FYI Lisa, you can't enlighten me because just like your counter part, you can't explain what your southern heritage is.","commenter_a":"It is not a symbol of hate, only in your dumb minds...its a symbol of our Heritage......maybe if you learned something in school you wouldnt worry about that flag........","post_message":"\"The time has come to remove this symbol of hate....\" Local religious and political leaders joined forces today to call for the South Carolina state general assembly to remove the Confederate battle flag still flying at the state capitol. More here ---> @webpagelink"},{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"},{"comment_id":"553770641467261","commenter_b":"Who even cares what that woman thinks? She's a murderer!","commenter_a":"Fricking Amazing, right!?!?! What a POS","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10155496447630603","commenter_b":"What's it going to be? Pick your switch? The belt?","commenter_a":"Did someone call scan","post_message":"This mother saw her son on TV throwing rocks at police, so she went to the rioting scene, found him and let him have it for taking part in the violence, according to local reports. @webpagelink"}]
