[{"comment_id":"10154464695802994","commenter_b":"If it is against her religion for birth control, she shouldn't be having sex out of wedlock either then","commenter_a":"Babies are blessings and I'm sure she loves them. But it's probably time for some birth control. 3 kids at 20 is quite a bit, but 6 is a lot (seeing as if they weren't twins someone would have to start around 13 and have a baby every year so I'm sure it hasn't happened much)","post_message":"\"My regrets would be timing, but I'm really happy that I can even create babies or have life because some women can't do that,\" 20-year-old Danesha Couch said."},{"comment_id":"931439316891490","commenter_b":"And the POPE lives in the woods!]","commenter_a":"It may as well be true. He always lies and is immoral and evil.","post_message":"Is this true?"},{"comment_id":"1645030555784057","commenter_b":"Every woman who wants an abortion should see this. Children are truly gifts from God!","commenter_a":"If everyone showed that much love for their mother and all their family. This world would not be in the shape its in today. Most beautiful example for everyone!, thanks","post_message":"Incredible."},{"comment_id":"952953064797748","commenter_b":"She needs to be deported to Alaska. Just like her mother, she does not know what the are talking about!","commenter_a":"Bristol Palin should keep both her ignorant mouth and her legs closed.","post_message":"Apparently, a kind gesture towards a scared teenager is grounds for a political attack these days."},{"comment_id":"1151019624929597","commenter_b":"Krissy L Gucciardo Nice mouth. Do you eat with that filthy mouth.","commenter_a":"I actually had a friend say she never sees him with his hand over his heart during the Pledge of Allegiance. I then supplied her with about 25 pics of different events, all with his hand over his heart. I told her google is her friend, and Fox news is not.","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\"  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154323426879778","commenter_b":"Sad!! Rip LP","commenter_a":"Prayers to the family.","post_message":"The 80-year-old may have been found dead, police said Monday."},{"comment_id":"10155146637143984","commenter_b":"Sad part Brenda Gantt at best they will pat him on the hand deport him without any consequence for ehat he did, he will turn around without a wall to stop them and illegally enter again.There was an incident ehere a woman lost her daughter unborn grandchild and new son in law to an illegal no consequences.She and several tried to get illegals deported what she got in my oppinion was a slap in the face, it cost too much to send them back where they came from.SERIOUSLY SHE PAID THE ULTIMATE PRICE TO BE TOLD THAT? No i say meet the authorities at the border say here are illegals we are returning.We need stricter rules if they are here they need to suffer same consequences a citizen does, whether here on a visa or illegal with no consequences for judgement given from court","commenter_a":"Ha ha Mexico will never pay for the wall and when they send the illegals back I can't wait to see all of you working in the fields","post_message":"Jaws hit the floor as soon as Trump revealed when the Mexico wall is going up. This came as a complete shock to Mexico, and is going to go a long way in shaping Trump's presidency..."}]
