[{"comment_id":"1059120344128437","commenter_b":"I have a 15 year old daughter. She is very mature and brilliant. Although, she (as well as almost all teens that age I know whose frontal lobe isn't even completely developed and whose lack of life experience just isn't there no matter how much a teen thinks it is) is not ready to consent to domestic slavery, opps I mean marriage. Many organizations are trying to stop child marriages in other countries. I am pretty sure that this is the same thing.","commenter_a":"Sick","post_message":"A debate broiling in the Christian homeschooling community asks a hard-hitting question: just what should the minimum age for marriage be?"},{"comment_id":"10156221727930389","commenter_b":"#Trump2016forPRESIDENT Build that Wall !! Make America Great Again is the only one running to can get the job done a Strong Leader ... carson is no-way President Material","commenter_a":"I am still voting for #TRUMP because he enforces the laws and is paying his own way and does not want a salary he is working for what is right for the American People","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153359756455399","commenter_b":"It's about time people started calling isreal what it is, a terrorist nation","commenter_a":"So let me get this straight, those same neocons that lied us into the Iraq war,and told us that we'd be treated as liberators dislike Obama's Iran nuclear deal? Go f##k yourselves!!!","post_message":"Netanyahu agrees."},{"comment_id":"10154308160836509","commenter_b":"Shes done far worse with all the deleted emails and benghazi blood on her hands","commenter_a":"She doesn't have room to talk","post_message":"Will Hillary Clinton give Bernie Sanders a pass on the data breach or will she tear into him during tonight’s #DemDebate? @webpagelink"},{"comment_id":"991109084315479","commenter_b":"And those politicians won't change anything until one of them gets shot","commenter_a":"By law, the police can't do much of anything until the shooter opens fire. If he verbally threatens someone, that can bring the police into it. But by that time, someone may already be dead. Don't blame the police, don't blame the dispatchers, blame US.....because we elect the politicians that pass these laws!","post_message":"Once again, the NRA has blood on its hands."},{"comment_id":"533413536846939","commenter_b":"They all need to go back to thier countries and fight thier own battles against extremist.","commenter_a":"U GO TRUMP","post_message":"Looks like Trump said what many across the world were already thinking..."},{"comment_id":"883354948459698","commenter_b":"Literally you're the only person I could think of that would find this as interesting as I did.","commenter_a":"'@username this cell has no mitochondria and is kicking, but my phone dies on 15% #whatatime","post_message":"Time to rewrite the textbooks again."}]
