[{"comment_id":"939419102765615","commenter_b":"If I was to make a point it would be that there should be an easier path to citizenship. People are coming over our boarders. Like or not, they are here. We can do three things at this point. We can continue the way we are. We can make a path to citizenship easier and less likely they're going to be expelled if they try. Or we can get all crazy and build a Great Wall around our boarders. Illegal citizenship builds poverty. Poverty creates crime. We all know this. I must remind you that precious few of us are truly Native Americans.","commenter_a":"People just don't understand how much America depends on Immigrant labor. If they were all to go on strike we'd all be paying more for things we take for granted. If they're here and not hurting anything what's so wrong with letting them stay and contribute to 'The Great American Melting Pot'? Maybe, Just Maybe, They can become more than they started out when they got here. Never hurts to give them a chance.","post_message":"What a huge mistake. Except it shouldn't be one. - Laura Willard"},{"comment_id":"1131957863541988","commenter_b":"Anti-Gun people are ALWAYS the least EDUCATED when it comes to firearms. The AR is light, easy to aim, and in a situation when multiple armed people are invading your home, it's the ideal tool of choice for protection. About 3 Million home invasions happen each year. How do you Anti-Gun sheep suggest people defend themselves from MULTIPLE ARMED criminals? A handgun with 5 or 6 round won't help much with 3 guys breaking into your house","commenter_a":"A killing machine? Some people really do think that if a person has a gun they are going to use it for killing people. That they are and the weapons are evil. Stupid and clueless","post_message":"It only took us 38 minutes to walk out of an Orlando gun shop with a killing machine. See for yourself."},{"comment_id":"10153942138341770","commenter_b":"She is disgusting!!","commenter_a":"Now we don't have to look at her on the Voice with that nasty tongue, hope she's packed","post_message":"Don't let the door hit you on the way out!"},{"comment_id":"507357776079666","commenter_b":"This bitch","commenter_a":"What a whacko...and who says 'keen' anymore?!","post_message":"Look at me! Look at meeee! I'm better than Hillary!   -Linda"},{"comment_id":"10153509889673132","commenter_b":"Is there a required dress code? Why are both women wearing the exact 2 shades of blue?","commenter_a":"I thought the Queen always wears a hat in public. I'm surprised to see her here without a hat. I love the Queen.","post_message":"Prince Harry and Queen Elizabeth II make quite the team!"},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"'You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.' #CharlestonShooting"},{"comment_id":"10152630732682061","commenter_b":"'@username. Its not like she can't afford it.","commenter_a":"One would think that she'd get those awful teeth fixed.","post_message":"UPDATE: Bobbi Kristina Brown moved from hospital: @webpagelink"}]
