[{"comment_id":"10154539572188433","commenter_b":"@username ignores taped audio/video proof if it exposes negative info about Killary!","commenter_a":"I don't understand how Drumpf can stand up in front of the American people and continue spewing his blatant lies. He should know that he can't get away with it. If he doesn't, he's no more intelligent than his dumb deplorable supporters.","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."},{"comment_id":"10153811054249749","commenter_b":"Werent immigrants. They'd flown over to do this and some other jobs then planned to go back.","commenter_a":"Citizens arrest. Very good. Nice to see some black citizens using their fitness and strength to uphold the law. A good image for black people worldwide... Estonian immigrant eh? Well, well, I would contend it's a moot point whether or not he's 'enriched' the UK. He certainly is trying very hard to 'enrich' himself, although I think he should consider another profession to be honest... ;-)","post_message":"Police release CCTV footage showing members of the public in Leeds tackling an armed jewellery thief and pinning him until police arrived."},{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."},{"comment_id":"1226169560742155","commenter_b":"In other words what you want is to shut her up like Christians have been doing for too long in order of political correctness. And accept this mockery of a gay marriage. All religions in the world are against gay marriage. Its unholy, unatural and discusting and a general majority agree with that. Look at how muslims treat them lol. You wanna be a fruitcake? Fine, but stop throwing your discusting life in normal ppl's faces with ur ridiculous parade of freaks and now want to step into normal familly life of husband and wife. Its not for you. Adam and Eve. Man and Woman. NOT adam and steve! Marriage is between a MAN and a WOMAN. Amen to the sister with enough conviction to stand her ground. This is just the beginning. Her stand has awakened MANY. Its about to get nasty for a few :)","commenter_a":"Kentucky Christians should march for her. Don't remain silent, be there for the sister. Amen","post_message":""},{"comment_id":"10153556909588132","commenter_b":"I know!!!","commenter_a":"Krystal Frederick","post_message":"Another The Bachelor couple bites the dust."},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."}]
