[{"comment_id":"10155773912215093","commenter_b":"So republicans in the 1950's can change the national motto of our country and put it on our money but in 2015 we can't have a woman on a bill? Ok then.","commenter_a":"The government takes all our money through taxes and health care se we won't ever see it anyway. Bummer","post_message":"An absolute outrage -- and here's why."},{"comment_id":"10157095473970206","commenter_b":"Because she's a lying scumbag","commenter_a":"GOP IGNORES CARLY FIORINA - WHY?","post_message":"The professional political class says whatever they need to do to win and then does whatever they please. We need to return to citizen government. Stand with me. Fight with me. Vote for me."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"1135264553151680","commenter_b":"Only you idiot liberal want these invaders here... Morons","commenter_a":"But who would want to live there? Especially a refugee, who will be treated worse than they treat their own minorities and poor (which is pretty terrible).","post_message":"Fact check."},{"comment_id":"10155045713159073","commenter_b":"Risking war lol? You do realize that we would utterly destroy Mexico in less than a few weeks. Mexico would never declare war on us.","commenter_a":"We're is your proff..........for this post","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"1755849284702183","commenter_b":"Fuck Muslims","commenter_a":"That's not how it read last year fool think we forget","post_message":"They Told Him It Was A 'Threat To Muslims'... and his response went viral.  Do you support his right to fly our flag?"}]
