[{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"\"Make dating great again!\""},{"comment_id":"10153845298899753","commenter_b":"Can 't see what any young girl would see in that creep--what do they see in those guys?","commenter_a":"Doesn't this family have any self respect? Who really gives a crap?","post_message":"Do Kylie Jenner and Tyga have a sex tape to release? Although multiple reports have claimed the former pair starred in a series of explicit films before they split weeks ago, Kylie Jenner and Tyga weren’t planning to release one of their clips last month. Following a report earlier this week, which claimed Kylie Jenner and Tyga were about to become the next celebrity sex tape stars just last month, a second report has shot the idea down. According to a May 23 report by Gossip Cop, Kylie... @webpagelink"},{"comment_id":"10153178385132061","commenter_b":"Cheesy come back. You dumb blond.","commenter_a":"She's beautiful. I hope she still likes boys. Maybe she's transgender. Not that I care lol","post_message":"\"She's not a girl playing football; she's a football player that's a girl. She plays the game hard, she plays the game tough.\" Meet the teen who was only girl, and a co-captain, on her football team: @webpagelink"},{"comment_id":"10155823067465492","commenter_b":"Oh God there she goes again someone gotta find this chick a map","commenter_a":"Thank you Di Blassio!","post_message":"\"We are currently investigating and stand ready to assist the NYPD in bringing these individuals to justice,\" an Uber spokesman said."},{"comment_id":"10153981335574060","commenter_b":"While we're at it, how bout you just shut your sass mouth, too.","commenter_a":"I love you, Economist. I do. And I'm no Trump supporter. But my reaction to this is the same as any time you tell America how to run itself: Mind your own damned business.","post_message":"The Economist cover story in the Americas and Asia Pacific  Donald Trump is unfit to lead a great political party, let alone America. It's time to fire him.   February 27th - March 4th  Read free via @webpagelink"},{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"660481514127059","commenter_b":"She paid him off!!","commenter_a":"Why is she using Mr. Kahn so much? I thought his family is still distraught about the horrific death of his son?","post_message":"Replay: Hillary Clinton was in New Hampshire."}]
