[{"comment_id":"590616211130377","commenter_b":"Let her go live in one then.","commenter_a":"Deluded to the point of madness","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"10154143941493984","commenter_b":"OF COURSE IF THEY FIND BLOOD FROM THE VICTIMS ON THE KNIFE, IT WILL BE TO LATE TO USE AGAINST OJ! BUT CAN ANYONE IMAGINE, IF THE PRISONERS FIND OUT ABOUT THAT, HE'LL NEED ALOT OF MONEY TO KEEP HIM SAFE IN PRISON!","commenter_a":"This must be the month of truth telling in EVERYTHING!","post_message":"Wow. What was found buried on O.J. Simpson's former property could change everything. This is a HUGE twist..."},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"1765102733707241","commenter_b":"What a pig","commenter_a":"Mariana Vilella","post_message":"Hillary Clinton: \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\" Donald J. Trump: \"Because you'd be in jail.\""},{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."}]
