[{"comment_id":"10154361772367061","commenter_b":"As someone who lives in Lumberton I think we need to thank a lot of people for all they did. People came from other towns and cities with food and other things that were badly needed during this time. I understand these ladies went above and beyond and for that I applaud them. But we should not forget all the other people that helped and are still here helping. While the kids are a very important part of our community there are still people working to rebuild what has taken them a lifetime to obtain. I just want to thank all the people who were here when we were at our worst.","commenter_a":"Very cool","post_message":"WATCH: Educators in Lumberton, NC, hit hard by Hurricane Matthew, get $50,000, a brand new playground and funds to rebuild 16 parks! @webpagelink"},{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"10153517171806336","commenter_b":"Shut up you stupid woman!","commenter_a":"They were only 160 ft. Away and actually they checked on the children throughout the night. It is said the mother visits the place where the child went missing to walk the streets hoping to find her. The parents are devastated over the loss. Just because you or I would not leave our children like this doesn't mean we should be so critical or unkind. They made a terrible mistake ( in this case perhaps a deadly one). We should show kindness and pray for them. I mean after all what if it were you/me. No one is beyond making mistakes. They are tortured enough. Walk a mile in their shoes.","post_message":"Based on an examination of the bones, Australian police determined the child was killed \"some time since the start of 2007\" – the same year Madeleine McCann disappeared."},{"comment_id":"1121552027901325","commenter_b":"@username What percentage of women are voting for Hillary only because she is not a man?? Works both ways ladies!","commenter_a":"@username is a disgrace and is absolutely unfit to be Commander in Chief. Period.","post_message":"We can't accept this as \"normal.\" It's time for commonsense steps to help stop gun violence: hrc.io/GunViolence"}]
