[{"comment_id":"1059297857458355","commenter_b":"bag your bags u/piece of pig shit bitch & go back or get killed soon","commenter_a":"bring this bigot home and throw her off the team.","post_message":"Seriously?"},{"comment_id":"10153095297087908","commenter_b":"What's your problem with little girls?","commenter_a":"A bunch of bitchy little girls.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153485432146323","commenter_b":"I'm coming niggas!","commenter_a":"'@username this was the place I was talking about when we were talking about the travelling think","post_message":"Surfer Mick Fanning makes a lucky escape after being attacked by a shark during the final of the J-Bay surfing competition in South Africa on Sunday. Full story: @webpagelink"},{"comment_id":"10156385367815354","commenter_b":"Stop the influx NOW!!! It's sheer INSANITY!!!","commenter_a":"how do we stop Obama from doing this?","post_message":"“President Obama and Hillary Clinton’s idea that we should bring tens of thousands of Syrian Muslim refugees to America is nothing less than lunacy...I recognize that Barack Obama does not wish to defend this country, that he may have been tired of war, but our enemies are not tired of killing us, and they’re getting stronger....'"},{"comment_id":"1177607535665632","commenter_b":"That is sickening! Who are these wild, viscious, beasts that we allow to walk our streets with a loaded weapon 'in the name of the LAW'? They are just low life sub 60 IQ, sociopaths. They are over paid and forget who signs thier paychecks. Wake up Americans!","commenter_a":"That poor soul...you can see his body struggling to stay alive. I sure hope these fuckin cops don't get away with this...disgusting!","post_message":"There was no reason to kill him."},{"comment_id":"10155049282976729","commenter_b":"She is totally delusional","commenter_a":"Anyone else notice that everything killary is guilty of, she and her supporters blame on Trump? She smashes cell phones with a hammer, but Trump has a bad temper? She will raise taxes on the middle class, but people say Trump will? He never said that, yet people say he will. You give people a video link to hear someone say what you heard him/her say, people come back saying snopes says it has been altered ... Liberalism is a disease, a mental one.","post_message":"You definitely won't see this on the mainstream media..."},{"comment_id":"10153696182197300","commenter_b":"He is absolutely correct....because the large majority of crimes are done by blacks....thus more police treatment...","commenter_a":"The numbers don't lie. He is absolutely correct.","post_message":"Democrats will reach out to black voters in the debate tonight. Bernie Sanders made a claim about African American arrest rates. See what PolitiFact found: @webpagelink"}]
