[{"comment_id":"1086205424749133","commenter_b":"where?","commenter_a":"For the most number of angry emoticons sent","post_message":"Watching the world-record-setting longest hoverboard ride."},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10154903859534586","commenter_b":"Kill the cats!","commenter_a":"Im vegan and when i go out i try to tell at least 20 people im vegan and i dont eat gluten","post_message":"This is so accurate SHARE if you can relate! #GoVegan2017"},{"comment_id":"10153043534789614","commenter_b":"Girl do your thang....U have a beautiful heart and it shows. WOOp","commenter_a":"You know wat, the only reason those guys said those thing is cause the DICKS are to small to please a big beautiful woman. If u agree give me a HELL YEAHHHH!!!!","post_message":"When Kristen Layne decided to sell her junior prom dress on Facebook, she had no idea that some people would respond by criticizing her weight and looks. \"These two men were just saying some very hateful things, just telling me I was fat and that I wasn't beautiful,\" she said. It wasn't long, however, before a number of commenters rallied to the Tennessee teenager's defense. One person posted: \"It's obvious this woman is beautiful, inside and out.\" Another wrote that the dress \"looks absolutely stunning.\" Layne had originally tried selling the gown for $350, but supporters have now raised more than $2,700 to help her buy a new dress for her senior prom. Read KTLA's story here: @webpagelink"},{"comment_id":"10156735133795354","commenter_b":"Yes, but they do not work, they are LAZY","commenter_a":"That would cost more too , plus how many on welfare due to injury taking pain medicine gonna be positive anyway ? Big mess","post_message":"***SHOULDN'T WELFARE APPLICANTS BE DRUG-TESTED LIKE EVERYONE ELSE?***"},{"comment_id":"1112699392133505","commenter_b":"Where do the vaginal secretions necessary for intercourse come from then???","commenter_a":"from a biological/anthropology standpoint, there's nowhere for it to come from besides the bladder. you're pissing on people. discussion over.","post_message":"Can women squirt, or is it just pee?"},{"comment_id":"1017722631617599","commenter_b":"@username, you and your daughters are throwing your votes in the TRASH then.......smh @username 2016","commenter_a":"I hope Bill & herself have plenty of room for the Syrian refugees, since She is so kind to the terrorist islamics. #Stupid to BRING THE ENEMY HOME!!! Utterly wrong. SHE HAS #LOST my Vote... and my two daughters Votes. #MARCORUBIO will be my choice now.","post_message":"We cannot allow terrorists to intimidate us into abandoning our values. Turning away orphans, applying a religious test, discriminating against Muslims, slamming the door on every Syrian refugee—that is just not who we are. We are better than that."}]
