[{"comment_id":"10153737877981409","commenter_b":"What a jerk!!! He thought what he did was a start for his 2020 presidential run. After tonight, he'll never be elected. He shot himself in the foot and his chances for 2020.","commenter_a":"Unfortunate choice. He committed political suicide and will take the name 'Lyin' Ted' to his grave.","post_message":"Former Trump rival Cruz met with boos during GOP convention speech."},{"comment_id":"10153334360476051","commenter_b":"Put that mother fucker in jail","commenter_a":"Now now you did it now.","post_message":"Officials took one look at what this government employee was trading food stamps for and arrested him immediately."},{"comment_id":"10154288676688445","commenter_b":"Ding Dong: who's there? Your local sheriff lol","commenter_a":"Throw them in the fireplace and share the lovely smell with the whole neighborhood!","post_message":"Grow Q&A: What Can I Do With The Pot Leaves I Trimmed Off?"},{"comment_id":"10154786755561438","commenter_b":"Fascist pigs.","commenter_a":"Just like China!","post_message":"All Interior Department Twitter accounts had been ordered shut after the inauguration."},{"comment_id":"1920123994941377","commenter_b":"Thought she was said she was leaving. Oh that's right she is an actress. Bad one at that.","commenter_a":"Hate to tell you this whippee but nobody really thinks you know anything you stupid bitch, and if you have any compassion for people at all, for God's sake cover your fugly ass face!","post_message":"Nobody saw this coming..."},{"comment_id":"10154608447428690","commenter_b":"'@username - Did I hurt your feelings? While you're defending her she's planning on how she'll enjoy all her wealth somewhere in the world while you'll be paying taxes up the wonker. It's called Sod's law.","commenter_a":"She is every color on the a--hole rainbow.","post_message":"'I am innocent, I am an honest person and I have never committed a crime.' @webpagelink"},{"comment_id":"10153259374526350","commenter_b":"I just got off s cruise ship..I go on a cruise every year..The amount of people in and out of the water of those pools and all the adult drunks. Scares the hell out of me..I have a 7 year old granddaughter and she can swim..but it only takes 2 seconds for a drunk to jump on her w/o supervision. .Thank god my daughter watchers her like a hawk! THEY ONLY CARE ABOUT $$$ ITS TIME FOR LIFEGUARDS AND WATCH YOUR CHILD AS WELL!!!! And all Disney hotels have LIFEGUARDS! I live near them and we take our granddaughter Isabella to one every year for her Birthday!","commenter_a":"It is really no different than at a hotel. You don't have lifeguards at a hotel pool. There are signs posted that no lifeguards are on duty and parents need to watch their kids.","post_message":"There are as many as 1,000 employees aboard large cruise ships, but three major cruise lines employ no lifeguards on their ships. Why not?"}]
