[{"comment_id":"10155165703940603","commenter_b":"Whites can't be thugs Danny","commenter_a":"Thug, Keep posting it even if your White or Black. For some reason White people think all Blacks feel as if every Black is innocent. I'm pretty sure Blacks feel as if all Whites think all Whites are innocent. That's not true and if having to state that we think this guy is thug helps then I'll summit to that. I don't think anyone really believes that condoning violence is OK if the person is the same color. People may be right or wrong but it's not necessary a race thing, I think they truly believe the person is innocent but are poorly informed.","post_message":"Robert Clark is wanted for murder and may be hiding in out Missouri. Clark’s accused of brutally killing a couple in Ohio and is also reportedly connected to a string of violent robberies. Please share and call 911 if you see or know anything."},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153021829314712","commenter_b":"If you thought my tone was rude then you should not have replied to me with a lecturing tone. Because clearly you thought that was productive.","commenter_a":"Lauren it isn't dumb and you are rude... I am married 17 years to a bus riding bike riding no driving city worker here in Baltimore and he has made the same observations..riders... walkers..and especially drivers need to do a better job observing traffic laws...but your tone and answer is counter productive..have a safe day and as the Irish say.... Safe home","post_message":"Commentary: Car-centric systems cost lives, and diminish quality of life."},{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"}]
