[{"comment_id":"557077507818161","commenter_b":"Take her ass down","commenter_a":"We owe Nixon an apology. Watergate was nothing compared to this.","post_message":"BREAKING..."},{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."},{"comment_id":"10153771650684415","commenter_b":"Wake up!!? Fourty years of Democrats running this country..... Democraps running our country into the ground! EVERY AMERICAN CITIZEN WORKING PAYS 12% of his income to Social Security! Social Security is broke!!! People who have never paid a dime in ..are drawing on it, but they are going to reduce the benefits of those who PAID IN!!! Hmmm.... Only democraps think like that!!! @webpagelink","commenter_a":"Congress makes laws then the Govt turns around and will not enforce them thats why we slowly are losing America to Mexico...our immigration laws are not broken the Govt that will not enforce them is","post_message":"The First Amendment states: 'Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble …' yet despite these constitutional protections, speech-restrictive policies in our nation’s public colleges and universities remain. Today, I sent a letter to 162 public colleges and universities today asking them to update their free speech codes."},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"},{"comment_id":"10153850039752452","commenter_b":"Samantha Keller me","commenter_a":"Esdras Diaz","post_message":"After being a dad for five months, this father decided to share a funny review on his “2016 model” baby. @webpagelink"}]
