[{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""},{"comment_id":"850397761665128","commenter_b":"I'm a 20 year retired air force vet and a woman and this kind of treatment is common among the other sex","commenter_a":"In fairness. I wonder if the person thought the parking space was ONLY for physically wounded vet. Just saying. I agree the person was wrong. Vets come in all sizes, shapes, colors and gender. We all served. In AL we can even get the word VET on our drivers lic now. Just new.","post_message":"WOW! What do you think about the note left for this woman?"},{"comment_id":"10157442603035389","commenter_b":"Omg not shoplifting. Oh the outrage. Shut up pussy","commenter_a":"ARE YOU SHOCKED.....this from.a guy who picks katrina (reality TV star who was shop lifting ) as his spokesman and this woman has been caught several times trying to defend and excuse the lies and bogus claims he has made. THIS IS WHAT HE DOES.....THIS IS ALL ONE REALITY T.V. SHOW and you people have so much hatred and stubbornness that you allow this without question. Care for yourself more to question this man. You can hate hilarious clinton all you want, but that doesn't mean drop your guard down on trump. He will destroy the integrity of our country 10 times more. Bring Rand Paul back!","post_message":""},{"comment_id":"931005183682927","commenter_b":"Send that black bitch back to the jungle baby.. Yeeaaahhh","commenter_a":"Fire her. if she were white, she would already be gone.","post_message":"Sam's Club CEO made some serious anit-white racist comments. She thought it would slide under the radar because it was directed at white people. She was very wrong. Payback that is happening has been brutal and swift and she deserves it. Can we get 5,000 'LIKES' to fire this CEO for racism?"},{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."},{"comment_id":"10155256275191002","commenter_b":"She's a cunt","commenter_a":"I was there! It was great! So exciting, so much energy, great speakers and it was wonderful to see our future President in person! :) She is marvelous!","post_message":"LIVE: Hillary Clinton is set to speak at a rally in Eastern Market Corporation."}]
