[{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"},{"comment_id":"1309366539106612","commenter_b":"You should be removed from this country","commenter_a":"Shariah law is NOT a law in this Christian country !!!!","post_message":"WELCOME TO THE NEW AMERICA!"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves. Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"10153764228773525","commenter_b":"GodBless","commenter_a":"Si bendiciones x todos los Dr enfermeras y personal del hospital 🙏🏻🙏🏻🙏🏻🙏🏻😘😘😘","post_message":"APPLAUSE TO ALL OF YOU! \"After a hellacious night working with all the victims this is the welcome we get coming back to work the next night! Such an honor to work with such an incredible team!\" - Vincent White, Orlando Regional Medical Center. (Courtesy: Vincent White) #OrlandoStrong FULL STORY: @webpagelink"},{"comment_id":"654574044733174","commenter_b":"Forget you Hillary!!!! REMEMBER Benghazi????????? YOU'RE NOT GETTING MY VOTE!!!!! Rot in hell you piece of shit!!!!","commenter_a":"Fuck that Bitch.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""}]
