[{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"10153918741113854","commenter_b":"@username You stupid racist the C word that women don't like! Will be glad when people like you die out!!!!!!!!!!!!!!","commenter_a":"Barack Obama has done NOTHING to improve this country....he has improved his own lifestyle at our expense!","post_message":""},{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"627774310707730","commenter_b":"Kathleen, you're an illegal alien","commenter_a":"This is very offensive. 1) I am well educated- I even completed a College degree. 2) I am not a racist or a bigot. 3) I love America Deeply and believe in her core principals. I am voting for Trump. I voted for him in the primary's and I will vote for him at the national level if he makes the ballot. I have been a registered Republican Since GW was voted in Office. Now I can agree that Mr Donald Trump can at times speak without discernment; however it is my opinion rather my belief that he is best suited for the position given the day and age we live in. You can not practice Islam without shariah law- they go hand in hand. It surprises me that persons with liberal views- LGBT- Freedom and separation of Church and state- Equality for all races- ages and gender- would open ...","post_message":"Yep."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"1736136556654311","commenter_b":"Secure our borders. ..Start deporting. AMERICA FIRST. ..GO TRUMP.","commenter_a":"This wasn't a racist comment trump was saying the judge could very well be prejudiced against trump because he wants to build a wall to keel illegals out and drugs and people who wants to do harm to our Country and judges parents are Mexican","post_message":"\"Claiming a person can't do their job because of their race is sort of like the textbook definition of a racist comment,\" Paul Ryan said of Donald J. Trump's recent comments about a judge. @webpagelink"}]
