[{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10152939538841051","commenter_b":"what a stupid bitch duh","commenter_a":"It seems to me that they have no control of their sexual needs and have to use children because they can't get anyone their age to have sex with.","post_message":"This woman thought the photos she sent via Snapchat would disappear. Well, they didn’t. Police took one look at them and had all the evidence they needed."},{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government \"feel good\" Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"10154707923201800","commenter_b":"hahahah omg yes!","commenter_a":"Now we're fucked. Like the Civil War and the Civil Rights Movement, this is yet another horrible scar on our nation. The damage was already done, and now it's just worse. I seriously hope our younger generations, myself included, can fix this within our lifetime. Shame on all of you who made this happen.","post_message":"Ready for either outcome. Tune-in to our LIVE Election Special tonight at 11/10c! #election2016"},{"comment_id":"1405973546081315","commenter_b":"Trump by a Landslide","commenter_a":"and the subsidy goes up so the real cost is less. The cost of healthcare is going up for everybody for 25 yr and every yr so whats new here","post_message":"First, we were told we could keep our doctors, but that was a lie and now we discover that premiums will rise 25%..."},{"comment_id":"1750956915163116","commenter_b":"Leave voters have woken up, it's time for these people to accept this country belong to people who have been here for centuries. The racist abuse that comes from people who have no rights to be here, is killing our country. EU is based on lies and corruption, people need to be protected from people who have no respect for the British people. Immigration need to be stamped out people who are not suppose to be here should be returned home. Enough of the rubbish people keep trying to push the boundaries of the country to an extent of hatered breeding in a peaceful country. Stay campaign maybe help all those who have no rights to be here, leave campaign had been made to rebuild their country for those who live for the moment.","commenter_a":"A \"so-called\" majority can be wrong. The referendum was a bad idea. The parliament are the elected representatives meant to lead and decide. It's a bad outcome for everyone, and is a very bad example to all in the world on how to get along in the global economy, and especially from a social perspective. We live on the same planet. We're not going anywhere else soon. We should share it. Borders are historically recent and arbitrary. Nationality is random (not a choice where you are born, just luck). It is not the most important thing. We all belong to the same human race.","post_message":"Join our live debate and tell us where you stand on a second referendum on leaving the EU."},{"comment_id":"736534466449620","commenter_b":"RADICAL ISLAMIC TERRORIST MURDERED THE 49 PEOPLE IN ORLANDO!! ...NOT GUNS!! KEEP AMERICA ARMED! OBAMA WANTS TO DISARM EVERYONE EXCEPT RADICAL ISLAM.","commenter_a":"What the heck? How ridiculous is this?!!!!! These are grown people in huge positions of leadership acting like fools. This is messed up!","post_message":"Louie Gohmert crashes the 'sit-in' and drops some truth."}]
