[{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"10153023631106770","commenter_b":"She should leave right away!","commenter_a":"OHHH so you weren't bothered by the USA Planned Parenthood baby chopping business? You weren't bothered by Hillary's stupidity with her email? You weren't bothered by Racists looting and burning Ferguson? You aren't bothered by Miley Cyrus twerking on TV for young girls? I see. You were bothered by the GOP debate... Right.....","post_message":"Emily Blunt said becoming an American was “strange and slightly disarming.”"},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."},{"comment_id":"10153831851540695","commenter_b":"There are meds for your issues.","commenter_a":"They got to make Room for these Muslims... We Americans get kicked aside or a Boot in the rear.... Getting More Crazy by the day... America has been Captured by the Islamic Nation... Muslims are taking over... Life is about to change in America... to the Worse........","post_message":"Dozens of residents are homeless after being given 60 days to leave. The city says it plans to build high-rise apartments on the land."},{"comment_id":"10153752557287093","commenter_b":"Derrick Perez","commenter_a":"You think she passed?","post_message":"OOPS ~ Police believe she was driving too fast and then hit the gas instead of the brake.... @webpagelink"},{"comment_id":"1328494547175243","commenter_b":"Join a lots of OTHERS, -- WHO could put up with that WOMAN. Send \" HER \" to JAIL.","commenter_a":"Good girl, Judge! Way to go! You are the best!","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\" Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"1089340994496293","commenter_b":"Nope ! We won't be voting for her !","commenter_a":"What is she wearing; gift Wrap? I'm glad she's encouraging people to vote. Who you vote for is your personal choice.","post_message":"Miley Cyrus goes door-to-door at George Mason University registering college students to vote for Hillary Clinton abcn.ws/2dx2OnW"}]
