[{"comment_id":"1770180839911909","commenter_b":"I will be disgusted if Hillary is the president!","commenter_a":"I'm still in disbelief! Thank you for your service to this country Hillary. I'm just disgusted that Trump will be president.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10153422236844877","commenter_b":"Darn shes not even hot. Nappy headed hoe.","commenter_a":"What's crazy is people talking about her knowing she has special needs.","post_message":"Miami woman arrested for dancing naked at Johnny Rockets - in the middle of the afternoon! Find out why her father says she did it. Grio fam, what are your thoughts on his defense?"},{"comment_id":"10152982642761336","commenter_b":"Where are the sires of these brooding mares? I know they are out making many more welfare babies! Really!","commenter_a":"Let me clear this up for y'all make it real simple. I grew up in Jackson and the school is in the heart of the ghetto. I am talking section 8 housing, five homeless shelters with in a five block radius of each other. This is the part of town most people don't like to be in after dark. Most of the children you will run into at the school will be children of welfare brood mares. Jacksonville is very lenient on getting welfare and other government assistance, so a lot of welfare babies are born and never taught respect or manners. Most of the people living in the zip codes surrounding the school have six to eight children and are on welfare and any government assistance they can be on. So schools are over crowded and under staffed. Also these parents are either not going to care or get ...","post_message":"A Florida kindergarten teacher has been suspended without pay after she videotaped a boy beating other students on three occasions."},{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"10152826905226130","commenter_b":"Lisa Longbine you are without a doubt one of the biggest tools of society. Why dont you do some research before sounding even more ignorant than you already do. Measels is on the rise mostly due to the huge amount of diseased illegals entering the country by the millions. Due some research tool...","commenter_a":"There's a reason why people don't want their kids getting vaccinated. The fact that their daughter can't get vaccinated is proof enough that they're dangerous","post_message":"My daughter has cancer. Your unvaccinated kid put her in danger. Here’s what I have to say to you."}]
