[{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."},{"comment_id":"814269158659286","commenter_b":"Oh really!","commenter_a":"My sister became an alcohol by drinking at home, the drink prepared by her husband before he went out with other women.","post_message":"Some point to our liberty in Christ, but is it wisdom to consume alcohol? One pastor sounds off."},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"},{"comment_id":"10152976505127507","commenter_b":"Kiss my ass!!! Idiot!!!","commenter_a":"NRA go to hell. Enough is enough!!","post_message":"Far too many times. Watch the video here: @webpagelink #CharlestonShooting"},{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."}]
