[{"comment_id":"1312709298805295","commenter_b":"GOD BLESS THE REAL WOMEN IN THIS COUNTRY! No vigina hats here","commenter_a":"I'm proud of them!","post_message":"HERE ARE SOME WOMEN WHO MARCH FOR OUR RIGHTS"},{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"10153221473348812","commenter_b":"What British chick?","commenter_a":"Better a bigger body than a nasty attitude. Maybe someone can help that British chick with THAT.","post_message":"Kelly Clarkson fires back at fat shaming comments: @webpagelink"},{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."},{"comment_id":"10157096795925551","commenter_b":"Go back to sleep old woman","commenter_a":"She has shown her bias...can't be trusted anymore","post_message":"Well, imagine that."}]
