[{"comment_id":"10153110921541378","commenter_b":"Very glad the child's okay and I hope that scare woke up that woman to f****** reality","commenter_a":"How do you forget your CHILD in the car.","post_message":"DRAMATIC VIDEO: After allegedly leaving her 1-year-old alone in a hot car, a woman is confronted and a bystander incorrectly tells her that the child has died. That moment was caught on video:"},{"comment_id":"564505557070656","commenter_b":"😩😩😩","commenter_a":"@username 😩😂😂😂😂","post_message":""},{"comment_id":"10153709236220927","commenter_b":"I think she was in WAY over her head. I guess she hasn't been a flaming Liberal long enough.","commenter_a":"What's new","post_message":"Moderator Elaine Quijano continually challenged Gov. Pence. #VPDebate"},{"comment_id":"10154120407252908","commenter_b":"attaboy Davies pass the buck.","commenter_a":"I've been trying to figure out why someone would be a Republican and for the life of me I just can't find an answer.","post_message":""},{"comment_id":"10153732430689117","commenter_b":"It is a completely legitimate discussion. In the 21st century private corporations have power equal to or even greater than a government's over people's platforms for speech and expression. In 10 years it is entirely possible that a single multi-national company will control all of the major social media platforms. Which means they could quite easily silence any viewpoint that they don't like. This in fact is already happening in many places around the world. Mark Zuckerberg will eagerly jump into bed with any ruthless dictator and agree to censorship on that country's population.","commenter_a":"There is no free speech war to be had. Twitter is a private entity and can ban who ever they like, for what ever reason. They do not have to abide but the first amendment, the government does.","post_message":"#FreeMilo just became a thing. Thanks, Twitter."},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."},{"comment_id":"1384025364955130","commenter_b":"Good god what a shit show........our nations democracy is at risk..ELECTORS DO YOUR JOB AND PROTECT AMERICANS FROM THEMSELVES","commenter_a":"Oh brother....","post_message":"Conway again defending one of Trump's intolerably dangerous views."}]
