[{"comment_id":"10154704030031323","commenter_b":"'@username Or you could just admit that you are fundamentally incorrect. That would be the mature thing to do here. You can't just use the serious topic of misogyny and sexism as an argument whenever you like. It plays a great disservice to the genuine areas where such a discourse is absolutely valid. This is about holding a proven heavily corrupted, belligerent war-mongerer to account, who happens to be a woman. End of story.","commenter_a":"Sorry Guardian, but no one actually buys the 'its because she's a woman' argument when it comes to Clinton. There are actually legitimate reasons why many do not like her. You're wasting your time.","post_message":"'Hillary Clinton irritates people not just because of her gender, but because we simply can’t process her narrative. There are no stories that prepare us for her trajectory through life and, therefore, we react to her as if she’s a disruption in our reality, rather than a person. We love public women best when they are losers, when they’re humiliated, defeated, or (in some instances) just plain killed. Yet Clinton, despite the disapproval that rains down on her, continues to go out there and chalk up wins.'"},{"comment_id":"10154450700759411","commenter_b":"Not Only Gay, what about all females that Catholic Church burned at dark age?.","commenter_a":"We all need to REPENT turn from our wicked ways and worship the Lord Jesus. Judgment will come to all when the lord returns... Even the Pope will be judged for his words and actions.","post_message":"'The questions is: if a person who has that condition, who has good will, and who looks for God, who are we to judge?'"},{"comment_id":"10154969127953128","commenter_b":"'@username just another feminist.","commenter_a":"when I go to a show I pay to be entertained , I don't pay to listen to the actors personal views or his GD views on politics.","post_message":"A central part of Donald Trump’s presidential campaign was his use of social media to weigh in on issues surrounding him – large and small – and he did it again on Saturday morning."},{"comment_id":"10155133952496162","commenter_b":"'@username you must be a huge pedophile with the ladies!","commenter_a":"He'll be back later to collect on that investment! We'll hear some sappy story how he's been stalking from afar, & how they got hitched! He left $1000.00 due to them knockers!","post_message":"WAITRESS $1,000 TIP: Waitress Jennifer Peitsch works two jobs a day  to get by.' Imagine her surprise when a generous diner last week left her a $1,000 tip on a $87.15 bill. Jennifer was moved to tears @webpagelink"},{"comment_id":"10152995356441130","commenter_b":"some women think they'll be liked more (by men) if they act this way!!!! cause...ain't no way a woman believes this...EVER!!!","commenter_a":"CEO of the Dumbass Corp","post_message":"What the..."},{"comment_id":"10153420202186323","commenter_b":"Why do people feel the need to insult disabled people anyway what ever word is used?","commenter_a":"You know what? Decent people will not say 'Retarded' around the mentally challenged, because those are the actual victims who have a right to be offended. I won't say retarded around retarded people. Around non-retarded people, different story. If your feelings are hurt by me stringing a couple letters together to form a word that has had not impact on your life, tii bad.","post_message":"'It’s not about policing language, but having “a call to action” that will make people think twice about using a term that can hurt and exclude so many people.'"},{"comment_id":"371470169707944","commenter_b":"This is to Hanoi Jane. Run your bathtub to lukewarm. Get into tub. Have a nice glass of red wine. Take a razor and slit both of your wrists. Go to sleep. The world will be a better place without you.","commenter_a":"She owes the Vets she causd additional harm to in Vietnam. She needs to apologize profusely to all veterans for the rest of her life.","post_message":"Fonda said she made a 'huge mistake' that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."}]
