[{"comment_id":"10153649555779705","commenter_b":"I'd be pissed off too.","commenter_a":"She's 25 and her last movie made her $20MILLION. You know what, I'd be pretty happy with that, I'd consider myself a glass-is-half-full kind of person if I was making that much at that age. This is not the way to campaign for equality.","post_message":"'I'm over trying to find the ‘adorable’ way to state my opinion and still be likable! F*ck that.'"},{"comment_id":"10153388655343812","commenter_b":"Ugly and disgusting! !!","commenter_a":"ridiculous looking","post_message":"Brazilian bodybuilder claims a synthetic material brought massive muscles -- but also medical danger: @webpagelink"},{"comment_id":"10155818852335354","commenter_b":"Fucking assholes!! The Dukes weren't racists!! God this country is full of weak kneed liberal scum!","commenter_a":"This is really getting crazy,who,s running this country anyway.We didnt used to have such nonesence.","post_message":"Absurdity..."},{"comment_id":"1516900544996637","commenter_b":"And crooked lying hellary deleted 33,000 incriminating emails. That's why 5 people were given immunity so they wouldn't be prosecuted. Now why would they need that??? Here's the definition of immunity: Law. exemption from criminal prosecution or legal liability or punishment on certain conditions. Did hellary ever find the 6 billion $$$ that has been missing while she was SOS??? It's most likely in the clintons Swiss bank account! Wake up liberals!!! @webpagelink","commenter_a":"Trump is nothing but a CRIMINAL.. A FRAUD... CON ARTIST.","post_message":"City of Phoenix to Trump: Our cops didn't endorse you."},{"comment_id":"10153520854786519","commenter_b":"Religious fanatics are scarier than loudmouths like Trump . We don't need evangelical bigoted haters running our country.","commenter_a":"His campaign is using some of the same consultants for foreign policy as Hillary Clinton's campaign- now that is scary","post_message":"Ted Cruz never misses an opportunity to remind us it can always be worse..."},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"1097247357003041","commenter_b":"Bitch please","commenter_a":"These cops did nothing wrong. They asked him why he was filming and they were trying to protect there fellow officer. Everyone needs to stop hating on the police.","post_message":"We just received this, these cops are ABSOLUTE CHILDISH BULLIES! Full details: @webpagelink They got right up in his face like they were looking for a fight, they have ZERO respect for anyone outside of their little gang."}]
