[{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"10156112188370354","commenter_b":"this woman is an idoit drinking kool aid","commenter_a":"This woman looks exactly as Bruce Jenner, do we care what she says??? Nooooo.","post_message":"Enforcing the law fairly and equally is not \"beating up\" on poor illegal aliens. Rather, it is honoring the Constitution and respecting those who have respected America enough to LEGALLY apply for citizenship and LAWFULLY wait in line. Face it, Leftists: you're losing--and you know it."},{"comment_id":"10154085649949203","commenter_b":"almost half of your stupid bitch ass country was from Mexico. We should take it back since ya'll going to hell with trump.","commenter_a":"My grandfather served in the punitive expedition. A forgotten incident in our history.","post_message":"It has been 100 years since the first act of terror on U.S. soil."},{"comment_id":"10153305796441162","commenter_b":"Hilary you go girl love you. Women, remember Jane Burn? She were a woman Mayor, lets get Mrs. Clinton for President. We made it with a black President, lets get get Mrs. Clinton in.","commenter_a":"Hillary Clinton for President 2016, all the way!!!!","post_message":"HILLARY 2016? It's officialHillary Clinton is running for President, and she's already considered a front-runner. We have the full story coming up on our 5:00 news. Tune in to ABC 7 Eyewitness News or watch LIVE at @webpagelink"},{"comment_id":"10154648260827550","commenter_b":"That's fine! Welcome to all who want to come to America LEGALLY.","commenter_a":"Grew up in a farming family. I admired and respected the migrant workers' desire to find a better life here in the United States.","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"1541922275848239","commenter_b":"What a stupid bitch. Only in Amerika can someone that vapid be taken seriously.","commenter_a":"NUT JOB ???","post_message":"Kellyanne Conway is a complete hypocrite who has no soul and CNN host Jake Tapper proved it."}]
