[{"comment_id":"635093840035049","commenter_b":"The only duty this bitch understands is money and do what frump trump Hitler wants !!","commenter_a":"Hopefully she will realize that she is in way over her head and resign.","post_message":"Betsy DeVos has demonstrated she has a rudimentary understanding of the issues facing our students, teachers, and schools, which should have disqualified her from serving as Secretary of Education. She possesses no experience with the public education system as either a student, parent of a student, educator, or professional working on education policy. Now that Ms. DeVos is confirmed, she is charged with the responsibility of advocating for and protecting ALL students regardless of their background. I hope that she will fully embrace this duty."},{"comment_id":"1080503548665334","commenter_b":"Fry that evil cow!","commenter_a":"Liar liar North Korean Pants suit is on FIRE!!!!","post_message":"“Stunning”"},{"comment_id":"972848449477340","commenter_b":"@username YOUR PARENTS MADE A BAD DECISION WHEN THEY CONCEIVED YOU...YOU ASSHOLE!!!!","commenter_a":"Does anyone really think Hillary Clinton is presidential material or qualified to be president of the United States? Think about that for a sec. She's made bad decisions and poor choices all of her life. From whitewater to Benghazi. She's incompetent to say the least and can't be trusted in her decision making abilities. She's been fired for being unethical or ethics violations and just recently had national security issues with her email. Not to mention being a lying ass crook. Presidential? Not hardly!","post_message":"Early polls show Hillary Clinton would handily beat both Trump and Cruz in a general election. Are you hoping to see Clinton become America's next president?"},{"comment_id":"10155111311329170","commenter_b":"Another Crazy Woman, she needs to go away, Far away !","commenter_a":"This woman belongs in an institution. She is delusional. Medicate her and get her out of office. My god.","post_message":"VIDEO: Somewhere in California there's an entire district of people who keep sending this woman back to Washington. Wut."},{"comment_id":"913510862078500","commenter_b":"This women is a idiot and if she thinks that these charges are going to stick she is crazier than hell.. She is a real nut job.. Glad she is in Baltimore hope the hell that is where she stayed..","commenter_a":"She's doing a great job and that's a signal for critics and whiners to just move along!","post_message":"Competing interests?"},{"comment_id":"10152526898447623","commenter_b":"No. The statue was in HONOR of our fallen heroes. You are a disgrace.","commenter_a":"King should be ashamed. ..","post_message":"The kneeling soldier statue will be removed from the King Veteran’s Memorial after Tuesday night's city council meeting."},{"comment_id":"10154681794980329","commenter_b":"@username Cringe worthy.. Sounds like a super basic bitch thing to say lol","commenter_a":"As a 6 foot tall lady who is all leg, YAAASSS, SEND THEM ALL TO ME.","post_message":"\"I might keep the jeans for fun now,\" one recipient told BuzzFeed News."}]
