[{"comment_id":"10152668576767377","commenter_b":"And Hillary is a broke down bus","commenter_a":"ted needs to take a cruise, maybe to the north pole. maybe, he and santa can go ride a reindeer, and build some toys together.","post_message":"Why Ted Cruz is the Strongest Candidate for President in 2016."},{"comment_id":"762776387211747","commenter_b":"Eu vir isso acho que quinta feira, incrível né❤","commenter_a":"Helton Carlos","post_message":"You can now turn your drawings into real clothing."},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153224960603984","commenter_b":"oh boo fuckin who leave bitch and take your husband with you","commenter_a":"She's out of touch on everything!!","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"10154323192091051","commenter_b":"Where do you people come up with this nonsense?! How is $30, for an ID, that lasts for years, beyond anyone's budget? The only people that can't get IDs, are people that are here illegally! FYI: states, and various organizations, will pay for a poor person's ID; There are no excuses!","commenter_a":"Lets get one thing straight, it isn't about the ID cards. Its about how, where ,what ,when ,and cost of those cards that determine whether they are a fraud protection, or a voter suppression! If IDs are required, it should be incumbent on the states to see that every eligible voter has one, therein lies the rub! By charging for them, even a little, it puts it out of the reach of some peoples budget. By placing the outlets for the cards away from wards and precincts with opposition voters in large numbers, such as the inner city that tends to vote Democratic, you can insure that many won't have them and therefore affect the vote. By requiring a special card and locating it well away from colleges and universities, you can limit the number of out of state students that vote, especially when the college is rural, since students ...","post_message":"Michigan legislators just passed the strictest voter ID law in the nation. Do you support voter ID laws?"},{"comment_id":"10157164250770206","commenter_b":"yeah allowing syrian refugees into your country , with no skills or money , will really bring about progress and sustained growth.","commenter_a":"nope not gripped by it.","post_message":"The Turkish Coast Guard has released a gripping video of a Syrian refugee being rescued after his boat sank – killing 27 people, including at least 11 children. @webpagelink"},{"comment_id":"10153113348589885","commenter_b":"A gun saved mine and my families life one night. Guns save more lives than you know . You disarm innocent people, murders will rise.","commenter_a":"This was a hate crime. We should also talk about gun control. This guy was a gun enthusiast. He killed them execution style. He had power over them. Gun power. Do you think he would have approached them if he didn't have a gun?","post_message":"A crowd gathered Thursday night at St. Louis University to pray for three young Muslims who were shot in the head Tuesday in Chapel Hill, N.C."}]
