[{"comment_id":"10152835596391519","commenter_b":"This woman should have her vocal chords removed!!","commenter_a":"I like to go down to the beach and write naughty words on the back of crabs.","post_message":"Repulsive..."},{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."},{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"},{"comment_id":"10153338672643721","commenter_b":"I've had a lot of experience with it An am only giving my opinion based on my experience am not trying to upset anyone am just giving u my insight","commenter_a":"So how are these people getting LSD exactly?","post_message":"How LSD microdosing became the hot new business trip. (via Rolling Stone)"},{"comment_id":"10155262254115725","commenter_b":"Well he's a she.","commenter_a":"I don't care what he does.","post_message":"Flash Survey: Does Hillary Clinton's use of a personal email account to conduct Secretary of State business hurt her potential presidential run? Vote here ---> @webpagelink"},{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"893147240733824","commenter_b":"If the women go topless I'll go lol","commenter_a":"Aida Nunez really. Kids should not see this. Go home and do that at your own home. At least! Or in your backyard lol","post_message":"Go Topless Arizona organized a protest in Central Phoenix today. The group organized a protest march this morning down Indian School protesting what they view as discrimination against women. The law allows men to go topless,they say, while women cannot. We \"cover\" the story tonight at 9 & 10."}]
