[{"comment_id":"10154550088456633","commenter_b":"I don't know HOW she got pregnant, she is such a tease!","commenter_a":"Oliver is pacing more this morning!","post_message":"Will today be the day? When will New York's April the giraffe give birth? More info >> @webpagelink Stream via Animal Adventure Park in New York."},{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"1738314809766910","commenter_b":"She should have moved here...we don't know who she is","commenter_a":"no matter what happened, she is the one who took the decision (??!) to take her own life. Unfortunately, she seemed a desperate and lost soul...","post_message":"Screenshots and soundbites from the video were mocked by Italian social media users and YouTubers."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"951958574839238","commenter_b":"These fuckin nazi like pigs make me sick my family came running from this 50 years later now look what the fuck is goin on the fourth reich vultures of america be killing our most loyal friends. Howcome We cant hurt their fukin dogs but they can jus come blast ours away word is bond kill my dogs look the fuck out","commenter_a":"Yanky fuckin cops","post_message":"This video is one of the most cowardly acts you will ever see. The poor dog was scared, ran and hid behind a table, and then was executed by a coward with a badge. The Free Thought Project.com (Y)"}]
