[{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."},{"comment_id":"10154030120894877","commenter_b":"waaaaaa look at us! we are terrible parents! we make bad decisions and get back men killed with our ignorance! yayyyyy! black men, you are lucky to escape the wombs of these criminal producing welfare brood mares!","commenter_a":"Very nice to see Americans giving these women love and support. Their bravery and commitment to honor their sons is wonderful to see.","post_message":"‘Mothers of the Movement’ deliver staggering testimony of loss, hope at DNC Grio fam, what did you think of their appearance? Watch the full clip and share your thoughts below."},{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."},{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"10154645517167599","commenter_b":"@username Trump should be in the swamp!!","commenter_a":"Everyone needs to be more like Romanians. At least they doing something about corruption in their government.","post_message":"We were live from the anti-government protests in the Romanian capital, Bucharest. The demonstrations are in response to the passing of a decree that will free dozens of officials jailed for corruption."}]
