[{"comment_id":"1009017532480603","commenter_b":"Has this vile woman ever told the truth?","commenter_a":"Hillary For Prison 2016","post_message":"\"What difference does it make?\""},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"10153495840691051","commenter_b":"Then don't post it online and she should mind her own business.","commenter_a":"People should also mind their own business","post_message":"This woman says her child *isn't* too old to be breastfed. Decide for yourselves if that's true."},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"}]
