[{"comment_id":"624034747748270","commenter_b":"GO Hillary!","commenter_a":"I'm a republican but I'm pretty sure Hillary just earned my vote on the fact that Ted dropped out. Trump is a no go for sure!","post_message":"Donald J. Trump is the presumptive Republican nominee. Chip in now if you agree we can't let him become president: hrc.io/1SL1LgJ"},{"comment_id":"1344000762286340","commenter_b":"I wonder how much Hillary paid all of these women","commenter_a":"My breast feeding children touched me inappropriately. Good Lord, People,..... Killary's Husband raped people. No comparison. Doh!","post_message":"New allegations against Donald Trump."},{"comment_id":"1170305866326090","commenter_b":"'@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"10153394285461336","commenter_b":"We love them white girls","commenter_a":"All you Mexican ' s love Mexico so much why did you leave ???","post_message":"“I’m going to have to sue Univision now.”  Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10154266616104714","commenter_b":"'@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"'Inclusivity is a core belief at Target' said the retailer in a statement. 'It's something we celebrate.'"},{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"351086708348331","commenter_b":"All about the MONEY Honey.","commenter_a":"It has profited as much as it can.","post_message":"“One source confirmed to me Caitlyn Jenner has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner.” - Ian Halperin"}]
