[{"comment_id":"917823551667757","commenter_b":"This is another stupid Question!! HILLARY SHOULD BE IN PRISON 2016.. Dumb ass thinks she can run for president She just needs to STOP INSULTING AMERICANS INTELLIGENCE!!!","commenter_a":"Yes","post_message":"Multiple Choice Quiz time, Republican kiddies! Which answer did you choose? A or B? @webpagelink"},{"comment_id":"10154091446565736","commenter_b":"Get her butt out of there .... YOUR FIRED","commenter_a":"I'm SHOCKED that an Obama-appointed Democrat is trying to undermine the new president. Did you really expect anything less? The Democrats aren't about to let President Trump do his job without throwing up every possible roadblock. They're just sore losers.","post_message":"'I am responsible for ensuring that the positions we take in court remain consistent with this institution solemn obligation to always seek justice and stand for what is right,' she said."},{"comment_id":"10153132244251037","commenter_b":"she lived until she was 86.","commenter_a":"Never smoked a day in my life and never will. I saw my great grandmother suffer for other a year from emphysema that killed her very slowly. She started smoking at age 11 and didn't stop when she was 86 and still had O2 strapped to her face. Her lungs were almost solid black due to all the years of smoking. Its heartbreaking to have to watch your loved one suffocate in their own fluids all because of cigarettes... Seeing that I promised mysf I would never smoke, and I never have. Maybe I will get sick anyway, but at least I know I have the choice whether or not to expose myself to such a horrible toxin ridden thing. I still font understand why people ever pick one up knowing the effects on the body","post_message":"America's biggest #tobacco companies say they are ready and willing to pass along factual public health information about cigarettes."},{"comment_id":"1699094263675768","commenter_b":"Let's review the facts: The shooter was a Muslim. He pledged allegiance to the Islamic State. He targeted people that patronized a gay nightclub in the U.S. Daesh executes homosexuals. Jihadis don't believe in coexistence and they don't spare pacifists. Oh, and you cannot reason with these savages. Questions?","commenter_a":"And Obama and Hillary want to disarm us and bring a hundred thousand of these kind of people over here","post_message":"Breaking News: Police say 50 people were killed and 53 were injured in the Orlando nightclub shooting and are asking the governor to issue a state of emergency.  Fox News can confirm that the gunman is Omar Mateen, 29, of Port St. Lucie County, FL, a US citizen of Afghan origin. @webpagelink"},{"comment_id":"10153721547731378","commenter_b":"Says a skinny woman","commenter_a":"Life is short. Eat the cake.","post_message":"Are 'Cheat Days' helpful or harmful to your diet? Some say giving into cravings can decrease your appetite. What do you think?"},{"comment_id":"10154812464086049","commenter_b":"Folks, it is a well known fact in the mental health community that many folks who take ' street drugs' have an underlying UNDIAGNOSED psychiatric condition , such as depression, anxiety, etc. They are 'self-medicating' themselves with street drugs. It is a shame, because many of these individuals could be helped with an early identification and treatments (therapy preferably and meds if needed).","commenter_a":"They should be charged with manslaughter if any of their 'customers' died from overdoses. Sorry. These guys knew what they were selling kills people.","post_message":"HEROIN BUST: 9 people have been arrested in connection with a heroin and oxycodone drug ring on Staten Island. Prosecutors said they've selling for several months. Names of suspects: @webpagelink"},{"comment_id":"1547989355230019","commenter_b":"'@username I hate Hillary but when you say she killed four people you sound crazy.","commenter_a":"Wow all these libtards hating on Hannity. What about all your bais media reporters? ??? They bend over and let Hilary use her strap on to them Cnnn already said Hilary won the next debate . When she didn't win the last . Is he going a little overboard yes. But let's face facts , if he was saying the same things about Hilary. He would be a genius in your eyes.","post_message":"What a week."}]
