[{"comment_id":"10154767405540575","commenter_b":"So surprised (NOT)!","commenter_a":"That has been standard operating procedure for n0bama and his corrupt administration since day one........","post_message":"BREAKING NEW REPORT FROM FEDERAL AUDIT...  Stupid Facebook pulled in the old title which has a typo!"},{"comment_id":"10153622542063188","commenter_b":"No","commenter_a":"Get serious","post_message":"Would you sign it?"},{"comment_id":"10158560874630354","commenter_b":"THOSE COW PASTURE BALL PLAYERS DO NOT MOVE ME. JUST BECAUSE THEY CAN PLAY BALL DOES NOT MEAN THEY ARE ANY MORE THAN THE COWS OR HOGS THAT LIVED ON THAT FARM. THE SAME GOES FOR ANY HALF TIME WHORE THAT TRIES TO MOVE ME. BTW, I HAVE ENOUGH COMMON SENSE TO HAVE AN OFF BUTTON ON MY TELEVISION!!!","commenter_a":"You remember when entertainment used to be all about entertaining It all changed until Democrats lost...","post_message":""},{"comment_id":"1073790629380657","commenter_b":"@username. Just fn Stop it with the Fox \"news\" total BS talking points. Insurance is about LIABILITY, not necessarily self protection..and it's Democratic Socialism at it's core such as our tax code: Put $$$ into the pot to benefit/secure your society's quality of living. The phrase \"free market capitalism\" is nothing but corporate fascist propaganda for dumb asses.","commenter_a":"I like to ask people that hate socialism why they buy insurance? You can almost see them stroke out as they start to think really hard about the question.","post_message":"Brilliantly done."},{"comment_id":"1466756690087245","commenter_b":"Flynn has resigned!!!","commenter_a":"IMPEACH TRUMP NOW","post_message":"\"I think this guy is somebody who might want to think twice about whether he stays in the position that he has.\" -- Bernie Sanders"},{"comment_id":"567943360046309","commenter_b":"How did you get where you are if that is true and by the way lady, the last time I checked the White House was occupied by a Black Family !Stop feeling sorry for yourself ! Get therapy and get over yourself !","commenter_a":"When hate is all you got to sell","post_message":"“This country was founded on racism and sexism, point blank.\""},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake?  Only if you like to have fun..."}]
