[{"comment_id":"1219218918112237","commenter_b":"This is how Clintons work! So illegal!","commenter_a":"THIS PERSON NEED'S TO RESIGN IMMEDIATELY,BILL CLINTON HIRED HER TO WORK FOR THE DOJ WHEN HE WAS PRESIDENT.DO YOU THINK THERE MIGHT BE LITTLE THANK YOU PAYBACK.","post_message":"The DOJ is still investigating Hillary Clinton for possible criminal wrongdoing regarding her private email server, so why would Attorney General Loretta Lynch meet privately with former President Bill Clinton?"},{"comment_id":"10154133286695399","commenter_b":"Oh look it's a troll","commenter_a":"The republican party is an organized seditious criminal conspiracy. There is no reasonable basis for Ryan's actions.","post_message":"'Briefings for the candidates will be provided on an even-handed non-partisan basis,' James Clapper told Ryan."},{"comment_id":"10154164610665796","commenter_b":"These people aren't here illegally...","commenter_a":"they dont need our help if there illegal except for a plane ride back to were they came from so they can do it the right way","post_message":"The state plans to end its part in the resettlement of refugees, who have fled war or persecution, on March 4.   The full responsibility for resettling refugees and overseeing federal money for refugee services is expected to shift to Catholic Charities Maine."},{"comment_id":"735467686595927","commenter_b":"Immigrants are welcome here. Illegal aliens are not.","commenter_a":"I'm very proud of my family's race. I'm white my stepfather is Mexican and he's from the states my grandparents are from Mexico so I believe that they have the right to come to the United States and make something out of yourself and y'all want to say here and criticize them being immigrants and using us for money when they're the ones that will work harder than any other people . So as I was raised this post be a free country and we supposed to love each other not hate each other and be there for each other. But with everybody with all this hate and everything yeller going to regret it because the day that you have to go and speak to the heavenly father is the date you're going to have to answer for how your reactions are everybody should be equal. So I'm very proud ...","post_message":"Live from Donald Trump protest in River Oaks: coverage all day on Eyewitness News"},{"comment_id":"10153539685509641","commenter_b":"How many ISIL recruiters are. among all these 'refugees' ..wait untill they settle.No more Europe for me..is unsafe now..","commenter_a":"Couple of years from now the refugees will try to change europe like the country they just left... they will get offended by the host country's culture and practices and might demand for sharia law in europe.. the European politicians will never learn their lessons... just take a look at UK, France and sweden .... RIP EUROPE.. well played saudi Arabia, Kuwait and other middle eastern countries who smartly looked away.. My only hope is that the refugees respect the host country's culture and laws and abide by it and never dream of changing it... but I doubt it strongly","post_message":"Today, German Chancellor Angela Merkel said her country is pledging an additional 3 billion Euros to the migrant crisis. French President Francois Hollande said France will accept 24,000 new refugees, and British Prime Minister David Cameron said the UK will take up to 20,000."},{"comment_id":"1734065923549548","commenter_b":"This is exactly why we shouldn't have zoo's . So that dumb mf could have been eaten. Probably would have fed a family of little lion cubs. Too bad it's a shame . Literally shot the lions for doing something completely natural smh","commenter_a":"I would have let him be eaten","post_message":"Poor lions :( Note: people suggesting that the keepers should have let the man be eaten will be banned. Mental illness is not a joke."},{"comment_id":"743009682482479","commenter_b":"Our military needs to follow the example of General Pershing in 1911. Soak the bullets in swing blood, kill them, pack their cavities with sausage and bury them with a pig. This would stop the rest of them from whining. This guys is a loser from the start.","commenter_a":"Don't worry ducky, soon you will join your comrades in line waiting for your non-existing virgins. Will a couple old goats do?","post_message":"Boo-Frickin'-Hoo. You think life sucks now... @webpagelink"}]
