[{"comment_id":"10153446133962550","commenter_b":"Because it's hilarious","commenter_a":"So no crime and no charges....Why is news then?","post_message":"Police found the 22-year-old man curled in a fetal position on the floor, groaning and surrounded by snacks that included Doritos, Pepperidge Farm Goldfish crackers, and Chips Ahoy cookies."},{"comment_id":"10153751332879369","commenter_b":"Ok, and most of those are probably illegal aliens .. lol","commenter_a":"Well there's tens of thousands of people for every Ex-American that leaves. So...bye.","post_message":"Americans are renouncing their citizenship over this."},{"comment_id":"985798528183066","commenter_b":"What if the Mexico government said any pregnant women being deported back to Mexico must have an abortion. Would ya let them stay or kill the baby because remember #alllivesmatter.","commenter_a":"I don't know. I still see a lot more dead baby posts than lion.","post_message":"\"This is offensive stuff, and there’s more outrage about a dead lion than there is about dead babies.\" -- Marco Rubio, on Planned Parenthood's videos"},{"comment_id":"10154321620193188","commenter_b":"When are women going to start taking responsibility for their choices?","commenter_a":"Does this mean @username is going to stop telling women what to do with their bodies?","post_message":"While we may disagree on specific issues, if we stop trying to control each others’ lives, those issues (for the most part) become irrelevant."},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"639520732905172","commenter_b":"Just the bitch she's always been","commenter_a":"Thank goodness she doesn't have her period any more at least now the women don't have to claim her gender what ever that is now. I agree with @username. I suppose when Buddy Borberly called her a bull dyke is a fair description.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces. This is absolutely ridiculous. She should be ashamed of herself. Do you think Rosie O’Donnell needs to keep her nose out of politics?"},{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."}]
