[{"comment_id":"10155159081916159","commenter_b":"And those immigrants came into are country legally . These SOB coming in now are not. Your so dumb","commenter_a":"So much hate coming from a country that was built by immigrants. You wouldn't be anything without the contributions of so many people from other nations. SAD!","post_message":"Protestors rally in NYC for Muslim and immigrant rights"},{"comment_id":"10155272434600652","commenter_b":"Testing. Testing. Forgive the interruption, but -- big surprise! -- something is all screwed up with my Facebook News Feed/Pages Feed and I read a suggestion that I should comment to get things to show up again.","commenter_a":"I can sum up the cause of China's rise in four words: \"American wants cheap crap.\"","post_message":"How to think about China's phenomenal rise:"},{"comment_id":"10152865609926336","commenter_b":"That is insane.what is wrong with her.father","commenter_a":"It's obvious the parents are watching. But, I wouldn't have chanced that. You never know when a preditor will change it's mind and attack. If it had decided to attack and start constricting around the child, they may have had trouble getting it off before it did harm, even with them watching. I don't think the child here is being abused or neglected, that obvious in the film. With all animals, things can go very wrong, very quickly.","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"10154080065336051","commenter_b":"@username you just piss yourself when you see women.","commenter_a":"The \"man\" isn't qualified to even be mentioned for the job. Donald J Trump is a complete and utter embarrassment to our already great nation","post_message":"The majority of Americans say that Trump is not qualified for the presidency. Do you agree?"},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."},{"comment_id":"10154553975279753","commenter_b":"Aaliyah Johnson","commenter_a":"Gina Anna","post_message":"uh this is amazing Foxes & Friends"},{"comment_id":"1698278530442016","commenter_b":"We need to plan a gathering this summer","commenter_a":"@username where are you?","post_message":"Your Monday just got better. Today is National Margarita Day."}]
