[{"comment_id":"10153307289837377","commenter_b":"And this Yankee Trump girl says thank you!","commenter_a":"Never doubted for a minute South Carolina wouldn't vote for Trump. Southern people aren't liars and we want a tough leader.","post_message":"Republican presidential frontrunner Donald Trump has won Saturday's primary in South Carolina, US networks projected."},{"comment_id":"10153189308491336","commenter_b":"Fuc_k the Muslim Scum Bags. If they don't like the American way of life go to the \"Big Sand Box\" to live. Then they can cook and keep warm with Camel Dung...........","commenter_a":"SHAME SHAME SHAME on these colleges and universities for the disrespect they show to our America and for the disrespect they show our military who have given their all to protect THEM.................... just hard to believe there are people in these positions who let this garbage happen. STAND UP FOIR AMERICA AND DO THE JOB","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10157820905645389","commenter_b":"She can't be trusted","commenter_a":"God bless our first responders and their loved ones during this time of unspeakable tragedy. These premeditated murders were likely politically motivated acts of terrorism. This is the same stuff we saw when the American left attempted to impose their will on peace loving citizens through bombings, political assassinations, physical attacks on returning service members, and violent protests back during the 1960s. For those of us who were children at the time, watching this stuff on the nightly news became indelibly burned into our psyche. It was a scary time for our country. Terrorist groups like the Weather Underground were one of a number of groups that committed acts of terror against some of our most honored institutions. Bill Ayers was a member of the Weather Underground. The same Bill Ayers who was recently seen in attendance at a violent anti Trump protest in Chicago.which we now know via WikiLeaks ...","post_message":"\"Hillary Clinton has changed her story about the use of a private server so many times, how can you believe any of this?\" – Sean Hannity"},{"comment_id":"979662915464481","commenter_b":"Shut up bitch","commenter_a":"there is no cure for stupid!","post_message":"Jesse Jackass rides again. Check out THIS crap. UNREAL. @webpagelink"},{"comment_id":"10154060101734087","commenter_b":"Hillary for Prison, if you vote for her you are worse then trash","commenter_a":"Suck on it Donald!!!","post_message":"Trump had choice words for a GOP senator who will not be voting for him."},{"comment_id":"1622307121406726","commenter_b":"Jeff the Killer","commenter_a":"Kevin Mccaston this is another reason I won't move to Florida lol","post_message":"\"I now have an alligator in my sewer.\" #FloridaProblems  @webpagelink"},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."}]
