[{"comment_id":"946602502043757","commenter_b":"She is not presidential material!!!","commenter_a":"This is one shady lady.","post_message":"\"But we also are extremely troubled by the events...\""},{"comment_id":"1163032473715499","commenter_b":"I hope Trump builds a wall 200 ft tall to keep these loosers out!!!!!!","commenter_a":"did the donald get him deported yet??","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\""},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"935958373261405","commenter_b":"Can she get any uglier.","commenter_a":"Trash just like her parents glad they are gone","post_message":"This speaks volumes about who they are as people. Thank the good lord we are done with them. Were the Obama's the worst first family ever?"},{"comment_id":"10153338669186323","commenter_b":"^That hyperbolic Feminazi your mother warned you about","commenter_a":"Yeah! It's Natalie PortMAN not Natalie PortWOMAN","post_message":"“It’s a very female thing of being afraid to say: ‘I’m the boss, and this is how I want it.’”"}]
