[{"comment_id":"857457044291637","commenter_b":"One man will never accomplish that .That will never happen.","commenter_a":"Obama is very naive when it comes to the Arabs. Maybe he is trying to have faith in human nature.that will not work in that cesspool in the middle east.That viewpoint does not even work here in a fairly civilized country.","post_message":"“Even if Israel has to stand alone, Israel will stand.”"},{"comment_id":"1247325575291461","commenter_b":"Third *","commenter_a":"That's a fair shout but we killed them all off and interbred with them now we have evolved and are the last stage you see before your eyes, religion is cool except for when it blinds you and # Christianity is young as fuck compared to other religions fam","post_message":""},{"comment_id":"546377932240042","commenter_b":"Wage gap seems like it is there but you femminists are being insincere about what it really means. You dont take so many factors into account. Men are more likely to work overtime. Woman take maternity. Woman should be thankful for that! How about that woman tend to get degrees that end up being useless and so they have to take lower paying jobs that arent what they studied for. There are SOOOOOOO many factors yoi ignore but without a doubt a woman WILL BE PAID THE SAME IF SHE DOES THE SAME WORK AS A MAN","commenter_a":"As a guy, I still love this. Great idea to raise awareness and galvanize support for an end to the gender gap and income inequality","post_message":"Take a deep breath, guys."},{"comment_id":"1762322484002162","commenter_b":"Criminal CUNT","commenter_a":"Absolutely NOT !!","post_message":"Is Hillary Clinton America's best choice for president?"},{"comment_id":"1192807494093054","commenter_b":"@username Refugees are not illegal. Go troll someplace elst.","commenter_a":"Children are innocent, they can't be held guilty for anything their parents say or do. And my question is how can you hate war refugees, and many of them children, and still claim you're Christian. The tenet of the religion is to care for the stranger, the wretched, and the sick. Not sure what part of that is hard to understand. Jesus was a refugee, and so were his parents, we seem to forget that. Bravo to the troops, they're doing the right thing.","post_message":"Kudos to these vets for speaking out against Trump."},{"comment_id":"635715443285701","commenter_b":"Should have knocked her out cold","commenter_a":"shoot that bitch with that soldiers gun.","post_message":"This liberal garbage spit in a soldier's face, receives instant karma.  What a pig. If you don't support our troops you can leave.  Do you agree she got exactly what she deserved?"},{"comment_id":"10154036554629411","commenter_b":"God I hope Trump gets in not Clinton , he may open his mouth and speak as he feels refreshing Realy , but I'd rather him than warmongering old B like her!","commenter_a":"yes, we can tell them apart very well :D Greetings from Czech republic BTW :D","post_message":"'Death to teetotalers and vegetarians'"}]
