[{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"766086360248608","commenter_b":"Because he hits women! He is no man!","commenter_a":"This punk need to be behind bars in jail lock him up.","post_message":"Rapper Chris Brown Blasts Trump And Police: \"F*** Trump And F*** The Pigs\" This punk needs to learn some respect. Can we get 30,000 'LIKES' to have him deported?"},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."},{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"}]
