[{"comment_id":"10153429657851323","commenter_b":"You are the ugliest woman I have ever seen","commenter_a":"My biggest headache: is being a gay a choice or disorder? Please someone help me out.","post_message":"'Marriage equality is just one front for LGBT rights: full LGBT equality, which includes economic justice, gender identity, immigration rights and racial liberation, is far from assured. [...] But today, one chapter in our fight is closed. Love has triumphed.'"},{"comment_id":"10155218043119411","commenter_b":"But I am American...maybe its not just what is in your dna but what is in your ideals and thoughts","commenter_a":"Just because he lives in one of the countries of europe does't make him a European, Europeans are people just like Asians, Africans or Indians with roots and ancestry from the said places. If I moved to Japan I wouldn't automatically become an Asian.","post_message":"'He European, just like you. [He] has a university degree, a figure that you never have, and a beautiful wife at home (who is white and blond)'"},{"comment_id":"10152586371551135","commenter_b":"This is unacceptable. We need to stand up and love one another despite differences! Isis has definitely scared a lot of people. It would be nice if the Muslim community would make a statement in response to the killings around the world. Just to declare they are different of the terrorist and that what Isis has done is wrong. Then I think there would be a better understanding of Muslims. But even still there will remain evil people , like this man at Kroger. I'm constantly praying for our world. The world needs love. The world needs God. Blacks against whites. Whites against Arabs. Muslim against christian. Oh God help us all!!!!!","commenter_a":"Kelly Sleiman!!!!!","post_message":"Dearborn Police are investigating the beating of an Arab American man inside a local grocery store.  Police have also contacted state & federal officials to help investigate the attack.  STORY: @webpagelink"},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"},{"comment_id":"10154249832173128","commenter_b":"U.S. has a mind-boggling number of minimal wage jobs that do not involve any tipping at all. When was the last time you tipped a cashier at Walmart? Why waiters or taxi drivers are any different? Sure, if they can't cover their basic costs, just raise the rates.","commenter_a":"Oh, wow! This is new. When Uber came out, there was an automatic tip in your setting that you could set for yourself.","post_message":"'I’m working at rock bottom now, and not having tips is part of the problem.'"},{"comment_id":"1289659341093811","commenter_b":"So someone stole a car that means they deserved to get raped? Sickening","commenter_a":"But you stole and you went to prison, perhaps you shouldn't steal so that you can practice your transgender in your house","post_message":"Horrifying.  (via Daily Mail Australia)"}]
