[{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."},{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."},{"comment_id":"10154170958189586","commenter_b":"Ouiii","commenter_a":"@username on dirait misha","post_message":"Wait until you see Rupert's face when he discovers #vegan nachos. All rats should be this happy! #StopAnimalTests #WW4AIL"},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."},{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."},{"comment_id":"1105325356224849","commenter_b":"Dont trust the polls It's women like Hillary that make all women look bad. Disgrace. She has not worked her way to the top, she has bought her way, lied, killed, and done corrupt things her whole life. That is not a role model. Hillary and Obama are not listening to intellegence of Isis entering the country. Same as Bill Clinton ignored the intelligence of Osama Bin Ladin. History repeats itself. 911 was 9 months into Bush's term. Clinton was the one that was warned and they had Osama located and wanted to kill him. Bill Clinton denied the order to take Osama Bin Ladin out. They lost him somewhere on the mountains after that.. Thus it was BILL CLINTON that didnt listen to intellegence and now Obama and HILLARY CLINTON are not listening to intellegence on ISIS entering our country with refugees. The seeds are already planted for the ...","commenter_a":"Trump will win this election. The crooked democrat establishment deserve to face treason, fraud, inducing panic and slander charges. WIKI LEAKS....JEFFERY O'Keeffe... YOUTUBE IT! Educate yourselves!!!!! Trump Pence 2016!","post_message":"Hillary Clinton remains ahead of Donald J. Trump with a six-point lead in a four-way race with just three weeks until Election Day, according to the latest Fox News Poll."},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."}]
