[{"comment_id":"533708806819699","commenter_b":"All ready know this she part of the problem","commenter_a":"This is no surprise. Have to be living under a rock if you don't know she's muslim. Her relatives are members of the muslim motherhood and muslim brotherhood.","post_message":"An extremely influential American political figure was just exposed to be a Muslim.  This changes everything. Obama isn't even our biggest problem.  Do you agree Islam is a dangerous religion?"},{"comment_id":"1011692715642632","commenter_b":"My family has been here for 10 generations and I voted for. Hillary. So stfu you hateful witch.","commenter_a":"I had 4 grandparents all born in America. I did NOY vote Trump!","post_message":"Fact check!  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"523635814493665","commenter_b":"Give the lady her job back, NOW!!!!!!","commenter_a":"Too bad- Boo Hoo Hoo","post_message":"A lunch lady was fired for serving pork to a Muslim student.  We are in America, give that poor lady her job back.  Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"1736517199968208","commenter_b":"go figure a REAL SHARK swimming the the ocean trying to grab a yummy meal.....SFPeopls","commenter_a":"Oh please! 1,000,000+ to 1 he'd do anything. If he wanted to harm them...he could have done it in seconds. Relax!","post_message":"Terrifying video shows a shark swimming metres away from people at Hollywood Beach in Florida, prompting people to flee to safety.   Credit: Caters TV"},{"comment_id":"497783407099419","commenter_b":"Kill the pigs.","commenter_a":"Killing of police officers is WAY UNACCEPTABLE!!!! I am sure that he didn't know if these police officers were empathizing with the protesters but was doing their sworn duty to protect and serve!","post_message":"\"Oh my god. There's people laying on the ground.\" Video from #Dallas via Twitter user @allisongriz includes audio of what sounds like multiple gunshots. @webpagelink"},{"comment_id":"952513631455776","commenter_b":"No big deal. Mrs Bush did the same thing.","commenter_a":"Why is it so outrageous that an American woman does not do unculturally American things? Why is it that anything the President and his wife do so politically charged and subject to the idle chatter of people who have no interests outside of demeaning and denigrating people who are doing their level best for this country and its citizens? When you demean the President and his wife, you make us all small, meaner people, and this country seen as acollection of barbarians and yokels.","post_message":"How do you feel about Michelle Obama not wearing a headscarf while visiting Saudi Arabia?"},{"comment_id":"1063012123817862","commenter_b":"It is under God not no damn allah you ignorant muslim cocksuckers. If you dont like our country,our anthem, our flag,and our laws then by all means get the fuck out and take the clintons and obamas with you","commenter_a":"WTF","post_message":"THIS IS THE UNITED STATES OF AMERICA! Our country was founded on Christian principles. 'LIKE' if you think this is wrong!"}]
