[{"comment_id":"1171557939550328","commenter_b":"OBAMA IS A TRAITOR. HE SHOULD LEAVE THE WHITE HOUSE ASAP.","commenter_a":"Obama just sunk lower than even I thought he could sink..as he was trying to be a comedian - he deliberately chastised Donald J. Trump over and over...he should be so embarrassed but he's an idiot so I guess we are still to assume he's above and better than the rest of us. By the way Obama - no one was laughing other than \"AT\" you for being so ignorant. That got you no leverage with anyone in that room if those people attending were normal human beings - only your planted people gave you any recognition and even they must have been devastated by your horribly degrading remarks all made in the name of humor - just as Will Farrell finds Alzheimers disease comedy - this was right up there with it...SHAME ON YOU FOR BEING SUCH AN ASS HOLE!!!","post_message":"PHOTOS and VIDEO of TRUMP RALLY IN CALIFORNIA... Arrests, Cars Smashed, Mexican Flags, Riot Cops.... Can't wait for the deportations to begin. See photos and video from event: @webpagelink"},{"comment_id":"10154120188266770","commenter_b":"She is not funny anytime","commenter_a":"It painful just to watch het","post_message":"Amy Schumer was hard to watch."},{"comment_id":"1063405993707262","commenter_b":"@username by sitting this election out, you will be voting for Hillary!","commenter_a":"The Donald has his whole family there. Oh, and his favorite adviser - himself, his biggest fan - himself, his biggest fan - himself. Who else does he need? He's been saying all along that he will win without support. The truth is that, as much as I dislike these guys, they are basing this on principles. Laura, I used to have much more trust in you, but you've gone over too the dark side it seems. Trump is the worst candidate in my lifetime. And when you consider that includes Dole, McCain, Romney and the Bushes, that's saying a lot.","post_message":"Jeb Bush, John Kasich and company reveal they value their egos more than the GOP's success."},{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"437859166374039","commenter_b":"For all the idiots out there who think its a good idea to burn people's shit FOR STARTERS BURN YOUR SHIT NOT OTHERS WHO WORK HARD FOR WHAT THEY HAVE... STOP TRYING TO SAY ITS FOR FREEDOM FOR THE BLACK RACE YOUR MAKING IT WORSE","commenter_a":"please, this country was founded because people rioted when their tea was being taxed LOL.","post_message":"\"This is not protesting, this is not first amendment rights.\""},{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"1070265606383000","commenter_b":"Love the response. Don't like dogs, don't come to the park.","commenter_a":"Yayness","post_message":"Allen West Republic"}]
