[{"comment_id":"1442259229136366","commenter_b":"tell me what he lied about?","commenter_a":"Trump has NEVER had a alcoholic drink in his life ,you idiot.","post_message":"His Fakeness speaketh."},{"comment_id":"10154496338258525","commenter_b":"Would love to see more of Bindi, Robert and Terri would love a show from the zoo. Steve will always be one of the greatest wildlife conservationist to have ever graced us with knowledge and just a fun loving man truly missed","commenter_a":"Crykie I miss him","post_message":"REMEMBERING STEVE IRWIN: His daughter, Bindi, who continues to walk in her father's footsteps, posted a touching tribute to The Crocodile Hunter on what would have been his 55th birthday. Rest in peace, Steve Irwin. 'Always in our hearts.'  STORY: @webpagelink"},{"comment_id":"10155598100226002","commenter_b":"Something white people started, after having intercourse with monkeys they would die from AIDS. Mosquitos was a bacteria form from their deceased corpes.","commenter_a":"Hmmmn,what's the next thing that will be killing us...SLEEP???????Always fear mongering and hysteria..","post_message":"Known to health experts as the most deadly animal on the planet, the minuscule mosquito, with its dreaded whine, is responsible for millions of deaths from multiple diseases each year."},{"comment_id":"10153778405133854","commenter_b":"Who cares what she told her daughter","commenter_a":"She is above the Law, Richard Nixon looks like a choir boy ' truth has no meany, Anymore'","post_message":"Hillary Told Daughter Chelsea That Terrorists Were Behind Benghazi Attack The Night It Happened [VIDEO]"},{"comment_id":"1220599301301398","commenter_b":"'@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153850884477235","commenter_b":"Only a woman who knows full well that things have changed since the days of screen time for weather 'girls' only could say something so offensive. She is not worried about being masculinized out of a job.","commenter_a":"Mentally challenged","post_message":"The stupid, it burns."},{"comment_id":"10153444962923984","commenter_b":"Yes since he is their best muslim buddy","commenter_a":"Duh Yeah","post_message":"Well, this is worrisome. It's bad news for pretty much the entire Middle East, except for ISIS.  Do you think Obama has entirely botched the ISIS situation?"}]
