[{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"1090845874295643","commenter_b":"Maybe two life sentences are appropriate for such an individual. Think of the trauma that poor child will go through all his/her life.","commenter_a":"We can only hope.","post_message":"A burglar caught on a nanny camera brutally beating a mother in front of her young child was sentenced to life in prison. @webpagelink The mother survived the onslaught and testified against her attacker."},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"},{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""},{"comment_id":"10153754034371336","commenter_b":"JJ Smith ,any investigations on Hillary Clinton she has coming,nothing more than a lier and crook. Planned parenhood should get no more money until they no longer do abortions,I do believe in some abortions but not late term or in order to butcher infants to sell body parts! Not a fan of Obamacare and the IRS is corrupt as is the Justice Dept.It seems to me that most of the politicians these days on both sides of the isle are corrupt and should be replaced!","commenter_a":"FANTASTC and appropriate response.","post_message":"\"I kind of feel sorry for people who are so consumed with hatred and intolerance that they behave in that manner. I say we should pray for them.\" Today on \"FOX & Friends Weekend,\" 2016 presidential contender Dr. Ben Carson responded to an attack he received from GQ. @webpagelink"},{"comment_id":"849416281771667","commenter_b":"Not all women are evil feminists... Only feminists are evil...","commenter_a":"Abortion was legal by common law we brought with us from England at the very beginning of this country, the 1600's, women could abort up until quickening using herbs, falls, punches to the stomach, abortion potions were big business and freely advertised. The Founders did nothing to change this either. Try Googling the history of abortion in the US.","post_message":"Pretty much."},{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."}]
