[{"comment_id":"10153204205229087","commenter_b":"Dude....please, I had a lovely friend who died recently because she was too afraid of how much it would cost to go to the doctor. So, with all due respect, I don't think you know what you're talking about.","commenter_a":"No Bernie, we shouldn't. Healthcare is not a right, it is something acquired by honest toil, and it is NOT something everyone needs, shown by the IRS' discovery that people are paying the stupid tax penalty rather than buy something the government is telling them to buy but which they DON'T need. \"People should not be dying in the US because they're sick.\" They're not, Bernie. It's a myth from the ideology of myths you refuse to see have no basis in truth. @webpagelink","post_message":"“We are the only major country on earth that does not guarantee healthcare to all people as a right, and I think we should change that,\" Bernie Sanders said."},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"988837027845081","commenter_b":"It seems to be about control imo. Religion has had so much control in history that by taking a little bit away they think the world is persecuting them. In my opinion they should let gay people do what they want just like they think Muslims should mind their own business about others eatting pork.","commenter_a":"wow - I am honestly confused as to how gay couples marrying really affects your lives? whether it be against your religious beliefs or whatever your reasons are for hating these people, does it truly affect how your life is going? There are so many other things in this world that should be worried about, like how our veterans are being treated and cops being stalked and killed, does two people being in love and wanting to be married change your life? and btw, no, I am not gay. I would just rather see more love in this world than hate and violence.","post_message":"North Carolina and Utah Laws Allow Clerks to Refuse Same-Sex Marriages  More than 30 magistrates in North Carolina have legally refused to perform weddings for gay couples.  @webpagelink"},{"comment_id":"10157272858800389","commenter_b":"This is very inappropriate. It is not the job of Ginsburg to comment on any of the political constituents, democrat or republican. Her job is to interpret the law only and she is way out of bounds in this matter. If she wants to leave the country somebody would have to nudge her and wake her up because every time she is seen on tv she is either falling asleep or looking like she just woke up. It is way past the time for her to retire.","commenter_a":"This old prune needs to retire. She can't even stay awake. She's hateful!","post_message":""},{"comment_id":"10154069512515329","commenter_b":"Georgie McCarthy","commenter_a":"That moment in \"Dilemma\" when Kelly Rowland uses excel to text Nelly.","post_message":"\"Life is one big party when you're still young, but who's gonna have your back when it's all done?\""},{"comment_id":"1106010656085353","commenter_b":"Barf.","commenter_a":"Agreed @username.","post_message":"Seattle Seahawks players kneel together after a #beautiful win at home.  >> kiro.tv/SFvsSEAPhotos // >> @webpagelink  [Photo: Associated Press.]"}]
