[{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"10154185747461717","commenter_b":"@username why don't you grow the f****** up","commenter_a":"So tired of women using their children as excuse for staying in a abusive relationship. Now that she did nothing, she will be in jail and loose her son.","post_message":"Her uncle said that Noor Salman was physically and mentally abused by Mateen and that she stayed with him for fear of losing custody of their son."},{"comment_id":"10153123967295329","commenter_b":" ! Paco nooo","commenter_a":"Caffe Con Lechee","post_message":"We all have that That One Co-worker who can't control themselves around cake."},{"comment_id":"1015232928526293","commenter_b":"will someone call the home and tell them a resident is out running loose?","commenter_a":"makes no sense, idiot","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."}]
