[{"comment_id":"1212525308785662","commenter_b":"HILLARY GOING TO PRISON. NA NA NA NA NA!","commenter_a":"Trump Pence 2016 Make America Great Again","post_message":"On Friday, FBI Director James Comey bowed to partisan pressure and released a vague and inappropriate letter to Congress that only serves to give Republicans a new line of attack against Hillary. Here's what we've learned from news reports: The emails may not have been to or from Hillary. The emails weren’t even ever on her server. The FBI case has not been re-opened. HFA Press Secretary Brian Fallon breaks it down."},{"comment_id":"10153070915541051","commenter_b":"Put her in the outhouse and lock the door.","commenter_a":"😕","post_message":"This woman's husband was buried under a particularly big pile of manure when police finally discovered him."},{"comment_id":"10153733130168855","commenter_b":"What an ugly hag.","commenter_a":"Its going to take gallons and gallons of makeup to hide her superficiality...","post_message":"\"Caitlyn Jenner wants attention, and she doesn’t especially care who’s harmed as a result.\""},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"},{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."},{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"}]
