[{"comment_id":"10153370094858010","commenter_b":"Yeah she really wants equal money lol your dumb lady","commenter_a":"It is the American nightmare regarding the death of our middle class and deeper poverty to our poor and elders. Vote the Repugs OUT!!!!","post_message":"Sen. Elizabeth Warren of Massachusetts got a standing ovation from California Democrats gathered today for the party's state convention. Warren told them: 'This country isn't working for working people. It's working only for people at the top. That's not the American dream. That's the American nightmare.'"},{"comment_id":"10154796294188256","commenter_b":"Hahaha poor Kellog was trying to introduce cereal to inbreds that eat steaks and drink Budweiser for breakfast. I bet they realized that was a wade of money!","commenter_a":"That will not bring in any more business, only lose customers..","post_message":"Kellogg is pulling its ads from the website Breitbart News, the right-wing news organization whose former chairman Steve Bannon was tapped as a top adviser to President-elect Donald Trump ."},{"comment_id":"868880693208184","commenter_b":"She is a liar","commenter_a":"You idiots have hit the bottom of your now famous SKUM barrell!!!! Cant you all find anything on the first woman president to be besides a cell phone E-MAIL really!!!!","post_message":"Blackberry-toting Clinton is now an action figure."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"10152525662890047","commenter_b":"So if God was in America, there would be no border, or ISIS problem? Just how would that happen?","commenter_a":"We need God in America!!!!!!!!!!!!","post_message":"ISIS poses a real threat to the United States, and a large weakness in our security is our porous borders.   Sign & Share our petition to protect the American people from the ISIS threat:  @webpagelink"},{"comment_id":"992964070763341","commenter_b":"well you know... some women have it...some don't... (but i agree with your message)","commenter_a":"She's got a boyfriend and I haven't","post_message":"She attacked her boyfriend in a drunken rage because he refused to have sex with her"},{"comment_id":"584420751713216","commenter_b":"STOP muslim immigration permanently !","commenter_a":"Yes!!!! And not just muslins!!!!","post_message":"Question of the Day: Should we halt Muslim immigration until the federal government can get it under control?"}]
