[{"comment_id":"934398819989704","commenter_b":"Apparently, the right-wing cannot get enough of their failed foreign policies. Now, all they need is another Bush in the White House.","commenter_a":"Derp","post_message":"He's baaaaack..."},{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"10153923917206130","commenter_b":"No this is an attention seeker.Most women don't do this,especially at someone's wedding.","commenter_a":"Nothing says lets party more than a baby on a boob. :)","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"497552493768664","commenter_b":"she can drop dead for all I care","commenter_a":"Irrelevant liberal rhetoric, out of the idiotic blathering mouth of a pitiful bitch who doesn know what damn day it is....","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"}]
