[{"comment_id":"1735235890068335","commenter_b":"Liberals are the TRUE racists......","commenter_a":"The Democratic Party should be so proud of their supporters. Trashing Police Cars, yep, you Democrats are awesome !!! And you wonder why Trump is doing so well, Idiots..","post_message":"WATCH the chaos that erupted in Southern California outside a Donald J. Trump rally where at least 20 people were arrested. @webpagelink"},{"comment_id":"1109370075781392","commenter_b":"@username, do you think the military being forced to lower their standards to allow females into front line infantry units is a good thing? The Marine Corps did numerous studies that show infantry units became much less effective when women were added. Currently, a special forces Sgt. is being court martialed and will be less than honorably discharged because he confronted an Afgan police officer and pushed him to the ground because he was ongoingly raping a little boy- that's a good thing? Our veterans are literally dying because they are having to wait for treatment from the VA - that's a good thing? A lot of great officers are being let go and forced out because they don't agree with Obama's policy's....that's a good thing? The current ROE's tie soldiers hands and put them in danger. The morale is at an all time low....things are not good. THis plus ...","commenter_a":"Our military is second to none! The only people questioning the readiness of our military forces are Republicans! There isn't one nation on the planet that wouldn't trade to have both our military personnel and equipment! So stop perpetuating a political lie in the hopes of portraying President Obama as un-supportive of our troops and military leadership!","post_message":"When President Barack Obama took office, he inherited a professional, world-class, battle-toughened military. Seven years later, many experts see the U.S. armed forces as a tattered and demoralized organization. In a special 'Fox News Reporting - Rising Threats - Shrinking Military,' Bret Baier investigates what Obama has done with – and to – the military. Don’t miss it Friday at 10p ET on Fox News Channel. @webpagelink"},{"comment_id":"10154885110756509","commenter_b":"Build a wall around Connecticut.","commenter_a":"Of course and that is why we love Trump!! He is the only one daring to say the truth!!!","post_message":"\"He's saying what a good amount of people are thinking and don't want to say,\" a Donald J. Trump adviser said."},{"comment_id":"1265082296896088","commenter_b":"Women get no opinion in Adolf Trump's amerikkka. So stfu and get back in the kitchen","commenter_a":"But not the recount in Detroit, where there r more votes than voters now. Not Russian--democratic votes.","post_message":"Trump supporters are calling the effort undemocratic. What do you think?"},{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"10153043534789614","commenter_b":"Girl do your thang....U have a beautiful heart and it shows. WOOp","commenter_a":"You know wat, the only reason those guys said those thing is cause the DICKS are to small to please a big beautiful woman. If u agree give me a HELL YEAHHHH!!!!","post_message":"When Kristen Layne decided to sell her junior prom dress on Facebook, she had no idea that some people would respond by criticizing her weight and looks. \"These two men were just saying some very hateful things, just telling me I was fat and that I wasn't beautiful,\" she said. It wasn't long, however, before a number of commenters rallied to the Tennessee teenager's defense. One person posted: \"It's obvious this woman is beautiful, inside and out.\" Another wrote that the dress \"looks absolutely stunning.\" Layne had originally tried selling the gown for $350, but supporters have now raised more than $2,700 to help her buy a new dress for her senior prom. Read KTLA's story here: @webpagelink"},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"}]
