[{"comment_id":"1179437002118415","commenter_b":"How about black miss America ,didn't see any white girls","commenter_a":"Isn't BET racist because there's no white people nominated? Why do they have the right to protest the Oscars while holding black only awards programs?","post_message":"Disgusting! Actor Spews Anti-White Racism At BET Awards CROWD GOES WILD (VIDEO) I've never seen such clear racism be allowed on TV before, wow. Lets get 1000 SHARES if you AGREE BET is a RACIST network"},{"comment_id":"10155157065294749","commenter_b":"Jade Louise Caswell can we go to chicken house again Sunday pls","commenter_a":"Jade Louise Caswell","post_message":"\"He pointed a gun at her head, demanding that she give him a nugget.\""},{"comment_id":"644944732314902","commenter_b":"Yes, she showed America just how much she loves her country, while the SLUT demonstrated her true nature as a racist!","commenter_a":"Never a real fan of Lady Gaga up until now. What a brilliant, beautiful voice. Beyonce should leave the country if she feels she must promote racism.","post_message":"Do you think Lady Gaga did a better job than Beyonce at the Super Bowl?"},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."},{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"10154530300669087","commenter_b":"I'm guessing the attorneys general in question are more aware of the law than you, random Facebook commenter.","commenter_a":"The Inadmissible Aliens Act Section 8 - 1182 allows the President to ban any group or nationality from getting Visas. The Law is Legal and on the books since 1952 and used by President Jimmy Carter to ban Iranians in 1979 and Obama in 2011.","post_message":"Virginia’s attorney general has joined other state attorneys general around the country in filing a lawsuit against President Trump over his immigration ban."},{"comment_id":"10154181766797093","commenter_b":"It's non violent offenses .","commenter_a":"What about victims? Can you erase their memory?","post_message":"If you have a criminal record, a group of Dallas county judges will help people with criminal records get their lives back on track. bit.ly/2li0sJ9"}]
