[{"comment_id":"10153543784611130","commenter_b":"Bitch where?","commenter_a":"Why are some Android users so concerned with Apple? I know as an Apple user, I could care less about what Android does. It's not really the competition some make it out to be if it's one-sided...","post_message":"Great news for Android."},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake? Only if you like to have fun..."},{"comment_id":"10153784629291323","commenter_b":"So women are overly sensitive and need to \"man up\"?","commenter_a":"Actually, men do say and do the things they say on the internet in person to women, and the reaction by society and the bosses is about the same: yawn.","post_message":"\"If the things said by men to women on the internet were said by men to their female colleagues in workplaces, they would be fired. If they were said by men to women in public spaces, they would be removed [..] The belittling and bullying, threats and harassment, cyberstalking and outright hate speech directed to women on the internet every day is real-world behaviour with real-world consequence and it should oblige real-world punishments.\""},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"10153647598586077","commenter_b":"Put her back in prison!","commenter_a":"Welcome home Mom!","post_message":"Demaryius Thomas' mom, Katina Smith, will be wearing this custom made jersey today. (photo courtesy Michelle Martinez)"},{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""}]
