[{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"1703427863256710","commenter_b":"Like Hillary thinking people should vote for her just because she's a woman.","commenter_a":"Race is not what matters. It is what is in your cranium! Dr. Ben Carson said this and he is correct. How stupid is this woman and those who think race and gender are the most important things in this life!","post_message":"Too much skin in the game?"},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"10153854981326509","commenter_b":"No mardi, flo is absolutely correct. There's no mass influx of Mexicans if that fence comes down. They can already cross the border with very little paperwork anyhow. Your fears are quite blown out of proportion.","commenter_a":"Highly dislike this man. He's everything America doesn't stand for.","post_message":"To quote the businessman himself, Donald J. Trump seems to be a \"very rich\" man. @webpagelink"},{"comment_id":"10153333676096680","commenter_b":"Yep, karma is a bit*h !!","commenter_a":"This is the best election ever! The irony of Republicans being upset about the Pope questioning the religion of a politician is absolutely overwhelming...considering the constant questioning and outright ignorance about the faith of President Obama. And do not get me started on them running a Canadian after 8 years of racist birthers.","post_message":"He's mad."},{"comment_id":"909436415764813","commenter_b":"@username is right. Our India is safe for females.","commenter_a":"India more safe than so-called muslim nations..its just that media show these news here and the other countries like pak n iran highlight such news of India.. they never show good things about India.","post_message":"The victim's mother said the men had harassed her daughter after they boarded the bus."}]
