[{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"}]
