[{"comment_id":"775703385909730","commenter_b":"Lying bitch","commenter_a":"Obama is the divider in chief.","post_message":"So, um, yeah...this went down on \"Meet the Press.\"  Here's the VIDEO if you missed it this morning..."},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"10153228975447452","commenter_b":"*facepalm* ... She is an idiot. She should have respected their religion.","commenter_a":"Charge the lady for assault","post_message":"Attacked as they prayed?  A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam  “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10154166026884342","commenter_b":"Phulleeezzzee this woman isn't going to get caught","commenter_a":"There are freaking cameras everywhere. You will get caught. Not worth it. And the problem with leaving your purse in the car is her lousy boyfriend is watching in the parking lot and waiting to break into your car as soon as you're in the store. And these are the same ones videoing as a cop takes them down and screaming police brutality. You live by the camera, you are gonna go down because of the camera. Smile!","post_message":"A California woman is drawing eyes after she appears to brazenly snatch a wallet from the purse of a fellow shopper. @webpagelink"},{"comment_id":"10153240442411336","commenter_b":"incest with goats gross","commenter_a":"Guys u don't know abt islam, islam is one of the most growing religion. Coz every is's true and stay forever. People why insult 1/3 believers' religion? If again repeat such insult of us ,next time you will get ponish bY MUSLIC ACT.","post_message":"Four Egyptian kids who dared make fun of ISIS in a harmless video are headed for trial along with their teacher on charges of \"insulting Islam.\""},{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"1175628809124795","commenter_b":"Geena -_- those jerks","commenter_a":"Leave it to the u.s to ruin this cool idea!","post_message":"Why are people such assholes?!"}]
