[{"comment_id":"10153809290224753","commenter_b":"She's a greedy mama! She's pathetic!","commenter_a":"Why do people keep making this disgusting family rich? They have no talent, nothing but yet people are infatuated with them please STOP talking about them, no one cares what they do!! And let's not start with that disgusting Jenner dude/lady wanna be","post_message":"Kris Jenner is ready to cash in on son Rob Kardashian and Blac Chyna’s surprising baby news. According to a new report by People, Jenner is reportedly looking at Kardashian and Chyna’s pregnancy from a “financial perspective” and is seeing some major dollar signs both for herself and the newly engaged couple. While some of the Kardashian and Jenner family were a little skeptical over the news that Rob and Blac are preparing to give Jenner another grandchild, People revealed that “Kris is... @webpagelink"},{"comment_id":"1250044951682199","commenter_b":"Trump Wall GET THEM OUT","commenter_a":"I think everytime racist ,stupid and fear-fueling comments this guys makes in public, a terrorist opens a bottle of champagne and cheer. I mean, this guys just really want an actual attack to occur... everyday with his stupid comments put us in a greater risk for an attack.","post_message":"Tonight, in eyebrow-raising Donald Trump claims: I predicted terrorism, because \"I can feel it.\" Full story: @webpagelink"},{"comment_id":"10153141821778352","commenter_b":"Fuck that!!! I will be in no way shape or form involved in any queer shit in my household!!!! Point blank period NO SON OF MINE WILL EVER BE A GIRL!!!","commenter_a":"I could never accept my son being A Gay!!!!! Hell naw I'm not raising no queer in my household !!! Goodbye go live ya life but not in my fuckin house!","post_message":"'We don't support that': Christian parents who were blamed in their transgender daughter's suicide note REFUSE to accept her female identity after she walked in front of truck, but insist they loved 'him'"},{"comment_id":"560508577442430","commenter_b":"No, illegal immigrants might think it's OK, like they already do from FD up thinking.. Our economy isn't built to give, give, give to u and the illegals. So yeah, they should go back to mexico, duhhh.","commenter_a":"Ur working at a fn hotel of course there's no job security. Fn fools.. smh. Don't like ur current situation? Gtf off ur ass n change it stop waiting for someone else's hands out!! That's ppls problem now days, want everything handed to u without doing a fn thing to deserve it.","post_message":"\"How do I feel working for Trump? I'm an immigrant. It's a job...We don't have security.\""},{"comment_id":"10153925535020579","commenter_b":"Oh, he is VERY Republican. Hardly just in \"name only.\"","commenter_a":"another worthless rino.","post_message":"Clip from Speaker Paul Ryan's address to Congress. Watch full speech here: @webpagelink"},{"comment_id":"529104973953410","commenter_b":"She's a scummy fat chick!","commenter_a":"MS. PIGGY.","post_message":"We can do this America. ...If we just unite, we can make this happen."},{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"}]
