[{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"},{"comment_id":"10153774465069170","commenter_b":"She is Pure Evil.........","commenter_a":"Gosh, I am so sorry that this is a waste of her time by the way she looks in this picture. This woman really believes she's above the law and she really needs to be indicted on this and her email server!!","post_message":"Forget all the analysis of this like it's a boxing match. All that matters is the facts that have been revealed, and these 10 minutes are the most important you can possibly see."},{"comment_id":"10153331203624614","commenter_b":"@username Sure, black bears are much smaller than grizzly bears, and a couple of humans could scare it away","commenter_a":"What I noticed was all the younger guys running and totally leaving the few elderly people behind...shame :/","post_message":"A Montana wildlife official captured video of an unnerving encounter between humans and bears on a bridge in Yellowstone National Park. The footage shows several apparent tourists making a dash to safety after finding themselves a little too close to a black bear sow and her three cubs. No one was injured in the incident, and the animals made their way safely back to the forest, officials said. Read KTLA's story here: @webpagelink"},{"comment_id":"509520402579803","commenter_b":"I see the women back of her. The men look like they have been photo shopped. Or they are pansies and do what their wives tell them to do. Maybe they are cardboard cut outs.","commenter_a":"Ever notice how the Dems always have people behind them when they're making speeches? They must have to promise to cheer a lot and be supportive. One boo and they're carried out by security.","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!” Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"}]
