[{"comment_id":"1439879839405093","commenter_b":"@username this the lady I was talking about","commenter_a":"So beautiful I'd do the same without a doubt","post_message":"After her daughter's battle with leukaemia left her unable to carry to full term, Theresa offered to become a surrogate and gave birth to a healthy boy ❤️"},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"10153110429289312","commenter_b":"Yes two ladies had a fight over some guy and one stabbed the other one. SMH","commenter_a":"Wasn't there another violent incident at a different CC couple weeks back?","post_message":"What we know about a shooting inside a Chuck E. Cheese's in St. Charles. We will continue to update this link with confirmed information. on.ksdk.com/1JwUWcj"},{"comment_id":"10153141650912093","commenter_b":"Look it up chick","commenter_a":"3200 people died in car accidents today in the US, everyday","post_message":"A man is in a coma after an electronic cigarette exploded in his face... @webpagelink"},{"comment_id":"10154122755384641","commenter_b":"Jajajajajajajajajajajajaja Trump for better world? ...dig a hole in your yard lady. ..","commenter_a":"Wish I could go back to 1945, find Donald Trump's father and give him a condom.","post_message":"With the growing chances of a Donald J. Trump presidency, world leaders are beginning to swallow their previous distaste."},{"comment_id":"10152614023801519","commenter_b":"Paula - The money spent by Democrats and Republicans on the Senate election was about equal - Big Corpoarate Money did not win the election for Republicans. The major reason was that 70% of Americans think the country is heading in the wrong direction under six years of the Obama administration. The WSJ Editorial Democrats vs. the Middle Class shows the devastating impact of Obama and Democratic Party progressive policies over the last five years on the middle and lower income class. Progressive Policies buy votes, but destroy prosperity. Anybody with incomes less than $70,000 has been devastated with losses of around 6% to 8% while inflation lowers buying power. @webpagelink","commenter_a":" 12-Step Program for Recovering Democrats is a WSJ Editorial to help Democrats make a recovery from the shock of the last election. Liberals call Republicans names when they have no rational argument to make. @webpagelink","post_message":"Jon Stewart lines 'em up and knocks 'em down..."},{"comment_id":"887798031255619","commenter_b":"@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"}]
