[{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."},{"comment_id":"1056816484380468","commenter_b":"Islam, by law, is prohibited from US immigration The Immigration and Nationality Act passed June 27, 1952 revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in Chapter 2 ACT 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by 'force, violence, or other unconstitutional means.' This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House.Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission ...","commenter_a":"Don't waste tax dollars with a trial, start setting an example of what happens to terrorest who murder.","post_message":"BREAKING: Muslim Teen Refugee Charged With MURDER For Beating 97-Yr-Old WWII Veteran To Death  These refugees can not be trusted with freedom... give an inch they take a mile.   Http://woundedamericanwarrior.com/breaking-muslim-teen-refugee-charged-with-murder-for-beating-97-yr-old-wwii-veteran-to-death/"},{"comment_id":"1687537648127046","commenter_b":"Allison Henn","commenter_a":"I had to solve this once lol","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1512686248764628","commenter_b":"Oranges are offensive, they resembles balls, likes men's balls! such a coincidence that white males eat oranges?! patriarchy for sure","commenter_a":"This article is very misandrist and perpetuating the matriarchy. All men are handsome inside and out. Try being more accepting, less shallow, and do less femsplaining UGG #triggered","post_message":"'If someone was quite a weird child, he tends to be a great date.'"},{"comment_id":"10153061896611051","commenter_b":"She did nothing wrong. I applaud her.","commenter_a":"What IN the hell is this World coming too this kid don't have MONEY and she was nice too give her food too eat I thank her for her kindness and Love and a heart, caring!!!!!","post_message":"A hungry first grader who didn't have money for lunch started crying in front of this kitchen manager, so she gave her some food. Bad move."},{"comment_id":"1015796225098514","commenter_b":"Funny... I keep hearing people say that Climate Change is George W. Bush's fault.","commenter_a":"What's funny is climate change was never a political issue before the republicans made it one after Obama was elected. Even Bush admitted it is real, but the sheeple just keep to their marching orders from fox.","post_message":"Get ready"},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks 'everyday' and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect 'us'! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see 'us' killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"}]
