[{"comment_id":"1823440651212555","commenter_b":"Shut up bitch","commenter_a":"All Lives Matter, or NO LIVES MATTER. Sick and tired of people useing the Race card for their answer to all their problems. How about INDIVIDUAL RESPONSIBILITY!","post_message":"Ben Shapiro is a liberal's worst nightmare...."},{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."},{"comment_id":"1774993129450173","commenter_b":"Ask him about carpet bagging the truth by billionaire media monopoly","commenter_a":"Thanks for discussion very informative","post_message":"Special debate coverage: Amy Goodman and Nermeen Shaikh host a pre-debate roundtable from 8-9PM ET with Kimberlé Williams Crenshaw, Melina Abdullah of Black Lives Matter - Los Angeles, Gyasi Ross, Soraya Chemaly, The Intercept's Lee Fang and Rashid Khalidi, followed by an expanded debate giving third party candidates a chance to respond to town hall questions. Jill Stein of the Green Party joins us from St. Louis starting 10:30PM ET. Tune in at democracynow.org/debate & post questions for our guests using #expandingthedebate."},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"10156140498930206","commenter_b":"She will definitely turn heads if she gets into the debates.","commenter_a":"@username has the knowledge, skills, and class of Reagan. She's disarming when she speaks, and able to get persuasive messages about individual liberty across to people who instinctively resist it. If she's nominated by the GOP, I think she has the best chance to win. If she's elected, she could invigorate the conservative/ libertarian movement and put our nation back on course.","post_message":"Today in Barrington, New Hampshire I toured Turbocam International and heard from voters ready for citizen leadership in Washington at a packed townhall. Join our team today. @webpagelink"}]
