[{"comment_id":"10153471873556770","commenter_b":"'@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"624394087751170","commenter_b":"SO TIRED OF STUPID RACISTS. !!!!!!!!!!!!","commenter_a":"Doesn't she want her peep to show? What a POS this he/she is.","post_message":"Michelle Obama suffers a humiliating wardrobe malfunction during vacation. This is hilarious. Do you agree Michelle Obama is a disgrace to America?"},{"comment_id":"10153182332356051","commenter_b":"i dont read anything about this lying bitch","commenter_a":"Hell no","post_message":"Here is how Hillary Clinton is defending herself against the e-mail scandal. Do you believe her?"},{"comment_id":"784296501703530","commenter_b":"Gross! It smells like Hitler up in this bitch.","commenter_a":"Isn't this another thing he can be impeached for?","post_message":"BREAKING NEWS...."},{"comment_id":"1568371310121541","commenter_b":"Cut their balls off and make them eat them.","commenter_a":"Hang them","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News  They deserve much worse than this.  What do you their punishment should be?"},{"comment_id":"10154221226031509","commenter_b":"Its not a stare down, lol! Whe one talks the other listens & thinks, then vise versa.","commenter_a":"Obama is intimidated by Putin he can't even look at him in the eyes.","post_message":"Heads slightly bowed, looking extremely serious: What were Obama and Putin discussing?"},{"comment_id":"10154227999432490","commenter_b":"Fine. Get on your knees and suck a dick if it makes you happy. I'm out.","commenter_a":"My Navy. The one I loved and served in for 20 years has become a piece of garbage. The morality is gone . It's run by leftist , gays and polatitions bending to the will of .02% of the weirdos making a lot of noise. What the hell?","post_message":"Same-sex couples are eligible to receive veterans benefits, but House Republicans still aren’t ready to fully acknowledge that."}]
