[{"comment_id":"1071265242982572","commenter_b":"Do NOT be BLINDED people for it won't be long before they find a way to seize everyone's guns- THAT'S WHAT THIS IS TRULY ABOUT- SMH","commenter_a":"You are representing terrorists","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."},{"comment_id":"10152947208161336","commenter_b":"There's a chic that would still date this guy, that's news!","commenter_a":"He proved himself to be an a** years ago.","post_message":"Lance Armstrong crashed his SUV into two parked cars after a night of partying and then let his girlfriend take the blame, according to police."},{"comment_id":"1023637380990606","commenter_b":"Bubble gum? Lol are you 12?","commenter_a":"I came to piss off pro vaxxers and chew bubble gum. Im all out of bubble gum.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"560952214097169","commenter_b":"These mf's white mf's think it's funny","commenter_a":"Whats the story? Video is not working... Someone pm me!!!!","post_message":"#BREAKING: There are reports that a #Chicago school bus driver has been shot in the head in the West Garfield Park neighborhood... @webpagelink"},{"comment_id":"10153274768969312","commenter_b":"Doesn't look like it! !!!","commenter_a":"Dont inmates get free dental care?","post_message":"Police say 32-year-old Jemayle Johnson escaped from St. Ann jail around 11:30 last night."}]
