[{"comment_id":"1333344573352236","commenter_b":"Omg! She LIED!!!!!!! IT HAS BEEN PROVEN. IT IS OVER","commenter_a":"While calling Breitbart a \"journalism\" might be pushing it, Breitbart should have thrown it's full weight behind Fields, and waged an all-out campaign against the Trump campaign until receiving a proper apology. The fact that they seemed to have abandoned her in light of evidence is despicable, and Breitbart needs to be held accountable.","post_message":"\"This is disgusting,\" former Breitbart editor Ben Shapiro said. \"No news outlet would stand for it.\""},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"},{"comment_id":"10154252810014749","commenter_b":"Women should do what they please and men can lump it.","commenter_a":"Burqa is not an Islamic thing it should go away, a women should dress modestly and cover her hair.","post_message":"15 countries have pledged to support the ban for security reasons, and there has hardly been any opposition among the Muslim community."},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"},{"comment_id":"10157942641385354","commenter_b":"Horseshit. Grow a set wussie. You give me a bad name.","commenter_a":"Danika Pearson","post_message":"Wake Up, Gun Owners. This is No Joke."},{"comment_id":"10152933391727061","commenter_b":"Someone call this woman a waaaaambulance!","commenter_a":"pumping is nosey - and a private matter......Maybe the airlines should have a private area for moms to nurse and pump.. My daughter travels and breast feeds and she has never pumped on the plane. She pumps before she leaves. BUT maybe it reallyl is time for the airlines to make areas for feeding and pumping.","post_message":"Mother claims male flight attendant relegated her to lavatory after denying request to pump breast milk in back of plane: @webpagelink"},{"comment_id":"884379288251594","commenter_b":"Sexy diva girl","commenter_a":"Nache Mishell","post_message":"[Watch] ABC Unveils Sneak Peeks For The Return Of TGIT @webpagelink Speaking of good TV...who's ready for Scandal and HTGAWM?"}]
