[{"comment_id":"10155452479610725","commenter_b":"I would vote for you","commenter_a":"Yes Yes positive steps move forward not backwards","post_message":"For America to be strong again, the ways of politicians must be put in the past. Let’s Make America Great Again!"},{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""},{"comment_id":"10158188671665231","commenter_b":"Not to change the subject but is the android in the picture holding a giant marshmallow or giant roll of toilet paper?!?!?! Just asking","commenter_a":"Rich Jones","post_message":"Google wants you to know that #BlackLivesMatter."},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"10153096865294614","commenter_b":"Adorable, precious, blessed by God! What a wonderful father & lucky to have this special little boy in his life! That woman is disgusting & I agree with another comment that she should have her tubes severed forever & never be allowed to have a child, not even adopted!","commenter_a":"Thank you everybody for sharing all the beautiful pictures of your wonderful and special family members, they are truly a blessing on this earth. I work in an Adult Foster Care home and we have cared for Downs Syndrome of all ages. Due to rapid decline in health recently, two of my special guys have left this earth to be angels. I cannot explain the special spark that they put in my heart when I was with them. I will never understand how people can be so heartless. God Bless Leo and his amazing father!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans... Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"}]
