[{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"484907421700536","commenter_b":"What an idiot, move to another country with the other celebrity dumbasses.","commenter_a":"His opinion matters?","post_message":"And that's not all Patton Oswald said either..."},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"10154471007837577","commenter_b":"They'll come here get a bunch of \"free stuff\", infest our country, infect our people, then go back to where they came from on vacation with all of the money they \"illegally\" obtained. Vile Criminals........Build that WALL!","commenter_a":"Say no to drugs TB","post_message":"Illegals With Drug-Resistant TB Allowed Into US Schools - @webpagelink/ Large amount of illegals entering US with diseases is alarming"},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."}]
