[{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"10153401491811323","commenter_b":"Talentless bleeder only got a gig in the first place because she was a woman.","commenter_a":"Was this the same BBC that was busy implementing their towards 2000 policy at this time?","post_message":"“I was told by the producers that they preferred my version, but the channel decided they couldn’t have a woman in charge.”"},{"comment_id":"618627604994485","commenter_b":"Right on Nicholesa and Aaron. From the word go, you could see that she was a south side of Chicago ghetto girl and she hasn't learned a thing being with the \"swells\". She is an embarrassment.","commenter_a":"Poor little rich bitch wants out sympathy. She should give us hers for all of our money that she's waster. What an ugly greedy ungrateful woman she is. We have never ever had a first lady worse in OUR white house. She is a despicable human being.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"886270021416239","commenter_b":"This is not good! We should close our borders for all foreigners indefinitely until further notice.","commenter_a":"Hey Rachel suck my cock","post_message":"A growing Muslim population in the U.S. is raising concerns that the nation could be at increased risk for instances of Islamic extremism in coming years. @webpagelink"},{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"10154291975578701","commenter_b":"Looks like he will have plenty of room for some illegals there","commenter_a":"Must be nice when all we have is homeless people living on the streets working their ass off just to get by","post_message":"The house was built in 1928 and has nine bedrooms and eight-and-a-half bathrooms. It was sold in 2014 for more than $5 million."},{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."}]
