[{"comment_id":"904031539740409","commenter_b":"'@username you are just Jealous because your fat ass cannot wear something like that. Shut the fuck up.","commenter_a":"1. Bitch you know damn well you can't wear that to school shut you're whinny ass up, talking about being oppressed. I'm offended about your damn video. 2. When the your school starts banning something you can't control like how your hair grows then your oppressed until then put a damn t-shirt on and go about your way because if you truly didn't car how you looked you wouldn't have wore a strapless dress.","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10153250211681336","commenter_b":"Seems like a lot of immigrants spouting out of their pie holes when no one knows what happened yet.","commenter_a":"AM I THE ONLY ONE WHO THINKS ALL THESE DERAILMENTS IN THE LAST FEW YEARS ARE BY TERRORISTS????","post_message":"“It is an absolute disastrous mess. Never seen anything like this in my life.”  Philadelphia Mayor Michael Nutter confirms at least five people are dead and 53 have been transported to hospitals with six in critical condition after Amtrak train 188 traveling from Washington, D.C. to New York derailed Tuesday night. @webpagelink"},{"comment_id":"10153796040151336","commenter_b":"Kyle Get off the illegals nuts already","commenter_a":"We need a zero child rule for liberals.","post_message":"Couples in China will now be allowed to have two children."},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."},{"comment_id":"1695743490702170","commenter_b":"'@username Hillary should be in Prison!!!!","commenter_a":"I'm 18 years old. This will be my first election to vote in. I'm proud to say that I am supporting Donald Trump! Save my generation, Donald! #MakeAmericaGreatAgain","post_message":"I want to win for the people of this great country. The only people I will owe are the voters. The media, special interests, and lobbyists are all trying to stop me. We won't let that happen! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10152983731016545","commenter_b":"Like all things. Just because it can be done, doesn't mean it should.","commenter_a":"What was he expecting? That's like going topless and wonder why people stare.. lol. People ask for attention only to flip once they get it.","post_message":"A Georgia man says he was harassed by police after openly carrying an AR-15 into an airport last week. Citizens are permitted to carry weapons in the open and public areas of the airport,  provided they do not move into the TSA-controlled secure areas of the airport property."}]
