[{"comment_id":"10154937686570329","commenter_b":"They must belong to one sexy mother fucker","commenter_a":"Those are some sexy thighs","post_message":"END OF STORY."},{"comment_id":"887798031255619","commenter_b":"'@username oh he knows and has known what he and his commies have planned for years. The plan of his has always been to take over the U.S.A. There are a lot like him supporting him and giving the cash as they all support evil and destruction. They are up to no good and they count on the uninformed and their party followers to go along with their evil. But they needed the illegals and open borders to aid and abet them even more. He is a muslim too and look at the damage they do to mind body soul and spirit. God, the Creator of Heaven and Earth will eventually take care of all evil. We have to be patient and know our true God wins. Lo, to those who are against him.","commenter_a":"He should be in prison LIFE.","post_message":"A global threat of terrorism, and THIS is what Obama does?  Time to IMPEACH!"},{"comment_id":"10153506659437964","commenter_b":"There are those who useabortion as a contraceptive. I know a young lady who had so many that when she got married & wanted a baby, she couldn't have one. Turned into an alcoholic.","commenter_a":"I thought Obamacare was going to take care of the poor...the ones who couldn't afford health insurance...so why do they need planned parenthood?","post_message":"On Monday, we'll be voting to eliminate federal tax dollars going to Planned Parenthood. I can assure you I'll be voting 'yea.' #preauxlife"},{"comment_id":"985399901519758","commenter_b":"Stupid cow what did she expect","commenter_a":"Really?","post_message":"'I thought he was The One'"},{"comment_id":"10154129877777377","commenter_b":"I hope this woman lives in Fear for quite awhile.","commenter_a":"I am not a Trump fan by any means, and both the Obama and Bush daughters had their fair share of bashing on social media, but this crossed the line.","post_message":"Katie Rich has been suspended indefinitely from her job as a writer on NBC's 'Saturday Night Live' after making a tweet about Donald Trump's 10-year-old son, Barron, the Chicago Sun-Times reports."},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"10153782621653869","commenter_b":"That's been exactly the narrative. It's about time for a woman president. There's a special place in hell. Bernie girls are just boy-crazy. It's her turn. Thou shalt not question Her Inevitability.","commenter_a":"The media have been crowning her daily since 2015. Your daily reminder that at this point in 2008, her backers (motto: 'Party Unity My Ass!') were still promising a bloody floor fight at the convention and demanding she be awarded all the illegal Florida delegates. Something to remember when you hear Hillarrhoids calling for you to 'line up behind her.'","post_message":"Today's Daily Cartoon by Kim Warp. See more cartoons with our randomizer: @webpagelink"}]
