[{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad? Watch and weigh in: @webpagelink"},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"}]
