[{"comment_id":"950226215018237","commenter_b":"Or a little pussy like @username","commenter_a":"Conor Lopez Micky Mac","post_message":"The first left me drooling, and the last left me shaking my head. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1781336095483197","commenter_b":"She is so darn crooked!","commenter_a":"OMG!!! How terrible......the next thing you know he'll be selling uranium to the Russians, or discussing Top Secret programs on his personal e-mail...or selling influence to the moslems.....","post_message":"Trump has also praised Vladimir Putin, Kim Jong Un, and Benito Mussolini."},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"1167878733267392","commenter_b":"Just a worthless pos","commenter_a":"What a loser","post_message":"Unbelievable! Michael Moore is now calling on liberals to disrupt and shut down Trump's inauguration. @webpagelink"},{"comment_id":"1385223764854222","commenter_b":"Drive through these bloody pests.","commenter_a":"drag them off tie them up off the road direct traffic tho. Looking at the photo take to the right hand cuff or tie to the guard rail.","post_message":""},{"comment_id":"10153028104776037","commenter_b":"She should be in prison!","commenter_a":"What Democrat party lackey will Obama cart out to replace her?","post_message":"#MarilynTavenner, the Obama administration official who oversaw the botched rollout of the #Obamacare website, #Healthcare.gov, announced she will resign as head of the agency that also manages the Medicare and Medicaid healthcare programs."},{"comment_id":"797617833687933","commenter_b":"Angela is brainwashed to believe that she'll suffer in the afterlife if she doesn't believe in Jesus.","commenter_a":"there is no jesus....little ceaser maybe","post_message":""}]
