[{"comment_id":"10153603991313132","commenter_b":"The tiger has been locked behind a cage for who knows how many years and when finally released he stood his ground and protected himself and they kill him for it? Animals no matter how small or what purpose do not belong in cages! Let's put a human in its place and see if they don't come out biting.","commenter_a":"Those animals need to be free not in a cage. Poor tiger, it was instinct. I feel for the man and his family too but it's not the tiger's fault. No zoos, circuses for me.","post_message":"\"It seized him by the throat,\" an eyewitness said."},{"comment_id":"10153752557287093","commenter_b":"Derrick Perez","commenter_a":"You think she passed?","post_message":"OOPS ~ Police believe she was driving too fast and then hit the gas instead of the brake.... @webpagelink"},{"comment_id":"10154246558899575","commenter_b":"I think she should have been charged with negligent homicide. She caused the child's death.","commenter_a":"Agree.","post_message":"The mother of a 2-year-old boy who fatally shot himself last month has been charged with neglect. Police say the child found the gun in her purse."},{"comment_id":"10153391027640950","commenter_b":"THEY DONT WANT CONTROL FOLKS.","commenter_a":"CBS, you need to get control of that audience, they really are ruining the debate. I want to listen to the candidates, not to cheers and jeers","post_message":"Marco Rubio to Ted Cruz: I don’t know how you know what I said on Univision because you don’t speak Spanish. Immediately, Cruz responds…in Spanish @webpagelink"},{"comment_id":"10153337350877217","commenter_b":"This is like a long running sentance And Jimmy saville is still dead.this often crops up in papers.","commenter_a":"Yaw hear about Colbert Chischilly?","post_message":"Tributes were paid to Leslie Nielsen today but he died 5 years ago..."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"}]
