[{"comment_id":"1371649186228159","commenter_b":"There's a Q now, what does that stand for?","commenter_a":"They absolutely deserved it. As a proud member of the LGBTQ+ community I am shocked at half of these comments. You show that crown off with pride honey because you really deserved it.","post_message":"Hateful backlash from jealous female classmates angry at being beaten by a 'boy'"},{"comment_id":"10154344957028753","commenter_b":"@username so you are ok with building a wall by cutting programs like help Americas like are vets and retired or elderly and poor, like a childrens education, too what build a wall that will no nothing in the end 10 years from now when or if is done, I will not give my money for a wall I rather help Americas, the environment, help kids have a good education, and yes help those illegals trying too become citizen that cant afford too pay 5000 dollars too take a class to become a legal citizen,a wall will do nothing ,ask any Germany how the berlin wall worked for them, most European, middleeast and faeest ppl come tho Canada, Toronto airport is a major gate way too northamerica, why not a wall there, this as nothing too do with topps illegals it has too do with dons ego, he has too ...","commenter_a":"I'm okay with that. I would rather pay for a method to keep illegals out as much as possible, than to pay for their food, housing, health insurance, etc. and also feel the wrath of the homelessness because they invade my husbands profession.","post_message":""},{"comment_id":"1665137810414324","commenter_b":"Beyonce is a racist and a cop hater.","commenter_a":"God Bless You.","post_message":"Whoa, this outspoken Obama critic didn't hold back at all when discussing Beyonce's Super Bowl halftime performance... and he pointed out EXACTLY what made it so hypocritical.  If you thought Beyonce's halftime performance was unacceptable, spread this video far and wide,,,"},{"comment_id":"477247782478735","commenter_b":"All of that and his arrogance!","commenter_a":"All of the above and more","post_message":"How will you Remember Obama? www.eaglerising.com"},{"comment_id":"10153560600894087","commenter_b":"DUDE ....PAYED FOR? ....REALLY? ....Hillary Clinton is the biggest political whore to ever walk the planet....SMARTIN UP","commenter_a":"Chris Christie is bought and paid for. Don't be surprised when he gets a position in Trump's cabinet. Donald Trump is used to paying off politicians. And some think he will change things in Washington. Lol. What a joke. \"I've got to give to them. Because when I want something, I get it. When I call, they kiss my ass.\" - Donald Trump on giving money to politicians.","post_message":"“Get in the plane and go home,” Donald J. Trump told Chris Christie after the New Jersey governor introduced the real estate mogul at a campaign rally. WATCH:"},{"comment_id":"1840578192829386","commenter_b":"WORDS DON'T CHANGE THE FACT! TRUMP IS YOUR PRESIDENT! LEAVE THE USA!","commenter_a":"Keep trying thumb suckers","post_message":"ALERT...."},{"comment_id":"1215709481782562","commenter_b":"Women's bathrooms are disgusting. Humans are disgusting.","commenter_a":"Seriously, why do women or trans, want to share the bathroom with the male species. The mens washroom is disgusting and I hate going into them myself. Please end this, men for men, women for women.","post_message":"Spotted at the Canadian National Exhibition in Toronto...   (Photo: Joshua Ostroff/HuffPost Canada)"}]
