[{"comment_id":"1762539284023573","commenter_b":"Adrian Chapman, Anyone that thinks trump is a racist has their head up their ass. Do you even know what the definition of racism is? Illegal immigrants are not a race. Stopping the flow of terrorism from Muslim dominate countries is a precaution to stop terrorism. Not all Muslims are terrorist but terrorist come from Muslim nations. Common sense not racism.","commenter_a":"How many TRUMP SUPPORTERS do you see on national news blocking highways, trying to stop other candidate's supporters legal right to rally.","post_message":"15-year-old groped and pepper sprayed at Trump rally"},{"comment_id":"695324637324781","commenter_b":"Get ISIS and obammy out of AMERICA first. We need to protect ourselves and children. Then we can help ours.","commenter_a":"Wipe them off the face of the earth!!!!!!","post_message":"An innocent American girl was found in the middle of this ISIS debacle. America now truly stands with France against ISIS. Do you think that America should wipe ISIS from the face of this planet?"},{"comment_id":"969205239835501","commenter_b":"Karma ain't she a bitch!!!","commenter_a":"Karma is a bitch. Racism and bigotry are not signs of a patriotic, freedom loving American.","post_message":"The couple that hates together stays together, but their hypocrisy has finally come back to bite them."},{"comment_id":"1146551715438403","commenter_b":"'@username Why did you just not turn over your emails Hillary? Why are they finding them now on Huma's deranged husband's shared lap top? Extremely Negligent come to mind? You forgot to Bleachbit and smash this one!","commenter_a":"What's Huma and Anthony's plan? Soon as the election's over get back together?","post_message":"“The Director owes it to the American people to immediately provide the full details of what he is now examining.'"},{"comment_id":"692662477538954","commenter_b":"This American Woman supports Trump and I feel more comfortable just thinking about Trump being the POTUS, then I have ever felt the whole time Obama has been POTUS","commenter_a":"As a woman, I wouldn't trust Obama unless I was armed. As a woman, I wouldn't vote for Hillary unless I was voting to send her to the nearest blackhole. Trump is not perfect, by any means. But he's infinitely better than what's currently fouling up the White House.","post_message":"What do you think about President Barack Obama's statements regarding Republican women and Donald J. Trump?"},{"comment_id":"708398475965965","commenter_b":"'@username You a liberal Troll go away.","commenter_a":"Bullshit. Hillary Clinton is losing and losing badly. Hey liberal media....we're not listening to a damn word you say.","post_message":"Hillary Clinton regained her lead in the polls over Republican challenger Donald Trump after she accepted her presidential nomination Thursday evening."},{"comment_id":"10153721168204170","commenter_b":"We have no room for their made up Allah in OUR Country!!!!! Go back to your Motherlands and take Nobama and Moochelle with you!!!!!","commenter_a":"Jeeze. I'm shocked","post_message":"Guess what block of foreign-born immigrants is growing fastest in the U.S?  If you said 'Muslims,' you win a cookie. Make sure it's halal"}]
