[{"comment_id":"10155297083883132","commenter_b":"Kimberly, you're obviously not paying attention. That's exactly what's happening. Also, the acts of past presidents don't take away from how terrible this is. Everything is quicker now. It's on fb as soon as it happens and people are less lax then they were to speak their minds. Don't act as if no one cared before. That directed to all the \"people losing their minds\" comments.","commenter_a":"So Trump bans certain people from entering the country and people lose their minds? Obama murdered how many women and children in those same exact countries using bombs and no one bats an eye? Funny how that works.","post_message":" one warned me when I was leaving, no one cared what will happen to my dog or my job or my life there, she said. one told me what I should do with my car that is still parked at the airport parking. Or what to do with my house and all my belongings. They didn say it with words but with their actions, that my life doesn matter. Everything I worked for all these years doesn matter."},{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"},{"comment_id":"10153991299268984","commenter_b":"Make sure he meets his virgins..","commenter_a":"Coming SOON to an ENTIRE COUNTRY near you . . . !!!!!","post_message":"This ISIS supporter had planned something truly terrifying for New Year's Eve... Thankfully, law enforcement caught him just in time. Do we need to do more to support law enforcement against ISIS?"},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"10155165115483010","commenter_b":"Preach it lady!","commenter_a":"It's the parking lots and the teenagers. I don't care to fight with people vying for a parking spot or those backing out without looking and those who think they can drive at freeway speed in a parking lot. The kids! I know they love to hang out where they can see and be seen, but I don't like their fresh mouths and their \"It's all about me\" attitudes. Their parents didn't teach them how to be respectful.","post_message":"Department stores are struggling."}]
