[{"comment_id":"422988511194831","commenter_b":"Drunk girl not girls","commenter_a":"How is a drunk girl gonna pull out her gun and shoot if she is passed out?","post_message":"Everytown for Gun Safety: “By saying that guns will prevent rape, they’re putting the burden on the victims.”"},{"comment_id":"10153258097608984","commenter_b":"And reporting them doesn't help. Even though you should ... This is disgraceful","commenter_a":"The sick part is my neighbor/friend gets 1800.00 a month via foodstamps and cash aid. Crazy huh. And she's an illegal and so is her boyfriend.","post_message":"Wow, I had no idea the government could do this. Now I'm terrified...  Are you tired of getting pushed around by big government?"},{"comment_id":"1005311662842639","commenter_b":"I would have kicked her in her taco real good!","commenter_a":"Damn what a sicko.","post_message":"This nun decided that students needed a hardcore lesson in Jesus' suffering -- so she stabbed a kid in the forearm."},{"comment_id":"10153096349467377","commenter_b":"I agree with Rush. I'm sick of women pushing themselves to the front of every topic. And using their gender to advance themselves. We who have sons and brothers hate to see the way they are pushed to the back of the bus.","commenter_a":"I have listen to Rush for 20 years!! Love him!! I agree with him.. most people who don't like him have never listen to him!! I like Michael Savage to, talk radio is where you find the real news... wake up people we are losing our country!!!!!!","post_message":"Rush Limbaugh says that too many women journalists have led to the \"chickification\" of the news — which gives it a female-friendly slant."},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"793075604079241","commenter_b":"Thank you SIR!","commenter_a":"Thanks, the GOP needs more people like you, Scott.","post_message":"I voted against the \"clean\" DHS funding bill today. I will not compromise when it comes to our Constitution. President Obama has shown he has no regard for the principles our nation was founded on. If Congressional Republicans won't hold the line against this president, then who will?"},{"comment_id":"1245719035484009","commenter_b":"Is the translation is correct? If yes why he should bother. He can marry any time and breed","commenter_a":"This is why America has never nor should have open borders.","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."}]
