[{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"},{"comment_id":"967879999960507","commenter_b":"Mr. Trump she is saying anything to get the Latino vote. She doesn't give 2 cents about any of those people.","commenter_a":"That's just insane!!!!!","post_message":"Do you believe that Hillary Clinton now wants Obamacare for illegal immigrants? She should spend more time taking care of our great Vets!"},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."},{"comment_id":"10153037800452434","commenter_b":"@username So yeah... indeed! That is a bit ironic, ain't it? I'm not republican either, I'm against the two party system, but anyway you're so right.. cracked me up.","commenter_a":"\"the Republican Muslim Coalition\" ....really?","post_message":"\"WHAT UP BITCH\" -this hijab"},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."}]
