[{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"1099414256845409","commenter_b":"No. We will still vote Republican democrat too far away from Christian beliefs","commenter_a":"DNC thugs started the riots.","post_message":"“I will respect that he’s the President, but I’m going to fight every single day to make sure he’s one-term,” a New York protester said of Donald J. Trump's election victory @webpagelink"},{"comment_id":"1383240758404704","commenter_b":"Yes they are and the ones that are stirring the pot should should lick the spoon amen","commenter_a":"So let me get this straight.... talking about pussy a decade ago makes you a sexist and bad person; however, talking about and encouraging the killing of cops is justified??? Did I miss something? All these people are a bunch of hypocrites! Saying they want peace and justice when they are the ones continuously stirring the pot and causing an even bigger racial divide!","post_message":"It's people like Sharpton that continue Obama's racial divide in this country. This is absolutely disgusting! Let's expose Sharpton for the race baiting fraud he truly is by sharing this post 2,000 times."},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."},{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"}]
