[{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"},{"comment_id":"777437579026197","commenter_b":"No I think the lying words wouldn't come out,she was choking on them.","commenter_a":"BS","post_message":"I don't think she had ANYONE fooled..."},{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"719584654846906","commenter_b":"LOL, OH LET HER, SHE'S THE CRIMINAL, DO YOU LIVE UNDER A ROCK?","commenter_a":"Con-man-Don, \"The Conald\", just a Common Carpet Bagger wanting to benefit from the ruin he would inflict on America. @username needs to call him to the carpet and allow the Criminal Justice system have their way with him.","post_message":"Donald Trump has painted a dark, divisive picture of America. We have 102 days to stop him from becoming president."},{"comment_id":"10153574217106509","commenter_b":"And she IS being a butthole!","commenter_a":"I don't know why everyone gets mad at someone's expression of an opinion. Opinions are like buttholes, we all have em","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"814269158659286","commenter_b":"Oh really!","commenter_a":"My sister became an alcohol by drinking at home, the drink prepared by her husband before he went out with other women.","post_message":"Some point to our liberty in Christ, but is it wisdom to consume alcohol? One pastor sounds off."}]
