[{"comment_id":"10152908269848855","commenter_b":"That isn't how lesbians do it.","commenter_a":"more and more promotion of sodomy","post_message":"Hooray!"},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"657416461115599","commenter_b":"MAYBE SHE NEEDS MENTAL HEALTH !!!!! IF SHE IS THAT BLIND TO WHAT IS HAPPENING IN AMERICA WITH O BUMMER AS PRESIDENT , SHE MUST NEED GLASSES TOO !!!!!!","commenter_a":"She is a traitor and Muslim just like her husband. Impeach him and send all of them back to their Muslim homeland.","post_message":"Michelle just told her biggest lie to date... Her and her husband are liars, plain and simple. Do you agree the Obamas are traitors to America?"},{"comment_id":"10153779495443854","commenter_b":"WE ALL DEAD","commenter_a":"is this where the inhabitants of the northern hemisphere exterminate themselves","post_message":"Putin Warnes of Global War"},{"comment_id":"1233839776660853","commenter_b":"Bet they sold a lot of papers....","commenter_a":"Couldn't care less.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"1180082675403600","commenter_b":"What a bitch and she says she is going to help the less fortunate! What a joke!","commenter_a":"And she has been for decades. So sad that so many black people are so clueless. This lying thieving dirt bag couldn't care less about anything but your vote.","post_message":"Talk about something the media will never show us. Look what happened when this young black girl got in Hillary's way. This is so sickening. Hillary is a complete and utter fraud."},{"comment_id":"1702951239953812","commenter_b":"Go to hell","commenter_a":"a liar and corrupt & a socialist what a pick for dems.","post_message":"Now it’s Hillary Clinton who has taken up the “white privilege” banner. During a recent Q&A she asserted that white people need to “recognize our privilege” and “practice humility.” Do you think Hillary is totally out of touch with reality?"}]
