[{"comment_id":"1722780531335461","commenter_b":"That's what my husband says, so why does he get to run.","commenter_a":"@username, answer the question - how can Ted Cruz run for President and be born in Canada.","post_message":""},{"comment_id":"10153488967916336","commenter_b":"He does not love America, he should be removed from office. The President has a sworn duty to protect the Constitution and the People of this Republic which he never has. He serves illegals, thugs and his fellow Muslims.","commenter_a":"they served our country they need respect but cannot change stupid","post_message":"\"This administration’s decision on who gets memorialized and who doesn’t is puzzling,\" Todd Starnes wrote."},{"comment_id":"10153307059689714","commenter_b":"Women are bad","commenter_a":"Girls at my school were not allowed to wear just leggings either.. I'm not scratching my head..don't really understand why this is a viral story..?","post_message":"Scratching our heads"},{"comment_id":"10153025279926491","commenter_b":"What's the deal with communist people looking at all the post in this feed? Makes me wonder if they sent people like in Ukraine to start protest and eventually riots and killings. So far 5 have msg me and I've called their bluffs. Busted","commenter_a":"American Folks are in desperate need of a National Refresher course on the Civil War and American Reconstruction, so with that been said, let just stop framing the Confederate Battle Flag issue as a \"free speech\" issue and call it what it is, TREASON !!, and that's a fact jack","post_message":"Many still support the current flag."},{"comment_id":"10152871258752411","commenter_b":"Tradition in high school sports.....especially football.........Give it a rest already!","commenter_a":"Lol omg. To all these people saying how mean it is. It's called having a sense of humor. It's awesome. And I'm SURE the neighborhood helps him clean it up;) relax;)","post_message":"ANYONE NEED TOILET PAPER? Coach Q's house was TP'd after Chicago Blackhawks Stanley Cup win.  Full story: @webpagelink"},{"comment_id":"1067465993294258","commenter_b":"James Whitehead","commenter_a":"Amanda Henry I squealed multiple times. The author is a great read too!","post_message":"A little something to brighten your day."},{"comment_id":"10153552105389087","commenter_b":"What an undemocratic woman.","commenter_a":"I can't stand her. She had no ideas other than the ones she stole from Sanders.","post_message":"Jeff Johnson, the head of the Washington State Labor Council, was scheduled to speak in at a pro-Bernie Sanders rally, but a pro-Hillary Clinton union affiliated with AFL-CIO threatened to take away funding from Johnson's group if he spoke at the event, forcing him to back out."}]
