[{"comment_id":"10153578491758984","commenter_b":"Let's ban ass holes","commenter_a":"He's the WORLDS biggest idiot,instigator, racist that ever walked the planet... Al you gotta go!","post_message":"Reverend Al Sharpton just announced his huge plan to destroy Kid Rock's concert tour, and it's absolutely sick. Kid Rock will NOT take this lying down. Sharpton has no idea what kind of war he just started."},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"10153530016051051","commenter_b":"@username So the child who was raped matters less than a nonsentient parasite?","commenter_a":"I am pro-life but in a case like this, there is no reason on the earth that this 10 YEARS old girl should have to endure any of this, and if anyone says other wise they need to have their heads examined, Rape is never, ever, the victims fault and if that results in pregnancy she should most deff be able to end the life of the baby. In other things abortion is still the womans choice and she and she alone decides weather or not to carry the baby, no one else has the right to say yes no or maybe on the situation at hand including the father, it is not his body that has to go through any of the complications. while i am Pro-Life and think that they should choose to let the baby live and give it up for adoption, i would never, ever tell ...","post_message":"A 10-year-old girl was raped and impregnated by her own father. Now she has learned whether or not she can terminate the pregnancy."},{"comment_id":"1013896902039895","commenter_b":"News flash, illegals don't have state ID's or driver's licenses therefore they couldn't be auto registered to vote. Another case of a republican who pretends to be smart.","commenter_a":"So illegals can vote too? dirty liberals","post_message":"A victory for voting rights!"},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"},{"comment_id":"1015046351849709","commenter_b":"Science BITCH","commenter_a":"Carlos","post_message":"Sorry folks."}]
