[{"comment_id":"10154607888371729","commenter_b":"What does carrying has to do with this?","commenter_a":"People wanna stop going to target bc of this but still eat chikfila after its owner gave a 100,000$ donation to thelbgt community months ago but still eat there what's the difference hypocrites","post_message":"Target just received a serious dose of reality..."},{"comment_id":"10152606529540950","commenter_b":"Okay says the 21 year old hag","commenter_a":"Old bag","post_message":"Hilary Clinton tweets support for getting children vaccinated @webpagelink"},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."},{"comment_id":"10154516833146162","commenter_b":"Ain't no 6ft sumn woman hanging their self in no jail cell miss me with that","commenter_a":"Wow, this tells everyone....NOTHING! I would like to hear... Exactly how Sandra Bland died. Period!!!!!!!","post_message":"An ex-guard admits to falsifying Sandra Bland's jail log... @webpagelink"},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"1121407184608726","commenter_b":"Of course it was her idea. The wicked evil witch knows she doesn't have a chance to win, even if she tries to rig, won't happen. God is in control.","commenter_a":"Why doe she not release all the crap, the Gov, has been asking for for years.? WHAT IS SHE HIDING.","post_message":"\"In the end, it was the candidate, Hillary Clinton...who wanted ducks on the ground, so, by God, we will get ducks on the ground,\" Robert Creamer says on the tape."}]
