[{"comment_id":"498847790306569","commenter_b":"Scott, the guy was born and raised in New York City, the 'Wall' you speak of would ideally be built to keep Mexican citizens from illegally entering the U.S. The 'Wall'you speak of will not keep U.S born citizens off of the terrorist list, nor will it keep them from being bigoted disgusting pieces of shit who intentionally hunt down large groups of unarmed people and kill them because of their sexual orientation.","commenter_a":"I blame that peice of shit obama.stop letting in these fucking idiots. Build a fucking wall now! !!!","post_message":"Officials have started removing bodies from inside an Orlando nightclub where 50 people were shot and killed.  Sunday night, workers brought four bodies on stretchers out of club Pulse and loaded them into white vans. The action was repeated over and over."},{"comment_id":"10153573918196746","commenter_b":"Danny..she can speak for herself..thank u","commenter_a":"He speaks the truth...","post_message":"'We've been looking at it (race) the same way for 20 years and here's where we are. We both have to try and understand each other,' said former New York City Mayor Rudy Giuliani on Face the Nation."},{"comment_id":"1004445152942983","commenter_b":"Obama's fault!!!!!!!!!","commenter_a":"The only thing we need. United Sovereign.","post_message":"FOUR PREVIOUSLY DEPORTED ILLEGAL ALIENS Charged In Rape, Beating Of Couple  A WALL AT THE BORDER WOULD BE GREAT!"},{"comment_id":"765284786938035","commenter_b":"real women respect themselves enough to not get knocked up and then run from responsibility.","commenter_a":"The Colorado shooter's neighbors have been interviewed and his shack has been visited. Turns out he was...drumroll please...AN OBAMA-LOATHING PRO LIFE CHRISTIAN! Now who could've possibly seen that coming? The propaganda videos led the terrorist to carry out his deed. Sound familiar something going down a tad east of here?","post_message":"What a sleaze ball."},{"comment_id":"1861600594119875","commenter_b":"Nasty Women","commenter_a":"Disgusted.","post_message":"LIVE: Women's Marches across the nation."},{"comment_id":"10154930680644218","commenter_b":"Why doesn't all the TV news stop digging dirt and let it go. News and social media is half the problem. Start spreading positive news maybe people will do acts of kindness to make the news instead of following the negative.","commenter_a":"Imagine if a white guy said. He would be canned fast.","post_message":"A Baltimore County fire lieutenant is being criticized for remarks posted to social media after the election of Donald Trump. See what was posted >> @webpagelink"},{"comment_id":"10152733465191051","commenter_b":"Karma is a ×itch!","commenter_a":"What goes around, come around. Can't feel sorry for a woman who screwed up her own life, and took it out of a child.","post_message":"A woman who killed her daughter and never served any jail time for it has just been found dead."}]
