[{"comment_id":"10153916837714255","commenter_b":"Tennessee ... leading us backwards towards the future.","commenter_a":"4th Amedment.","post_message":"While they worry about their precious guns..."},{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"939197849433302","commenter_b":"The real issue is the @username illegals flooding the country.","commenter_a":"Dumba** parents for not vaccinating! Selfish way of thinking! What if others get sick because you don't vaccinate your kid(s)!?!?","post_message":"NEW THIS MORNING > One of the biggest autism advocacy groups in the country is telling parents \"vaccines do not cause autism.\" KIRO 7 has discovered which Western Washington school districts are especially at risk for a measles outbreak. Watch here: @webpagelink"},{"comment_id":"494202484098498","commenter_b":"Do they want her cause America doesn't want or her trashy ole man and her entire trashy family oh and take Bruce with them too","commenter_a":"If you vote for Hilary , I'd be scared as much as she travels.","post_message":"Is Kim Kardashian West a secret agent? @webpagelink"},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."},{"comment_id":"10158374477135093","commenter_b":"Furthermore he did write an executive order which took guns away from Social Security recipients","commenter_a":"The morning after the 2008 Obama election I was not nearly as upset as liberals are now. Because unlike Trump who said exactly what he planned to do during the campaign, Obama said he was not trying to take our guns away, was not going to make us lose our doctors, and believed in traditional marriage. Obama lied in order to get elected then began do all the things he planned to do but didn't tell the truth about. Liberals are upset because Trump said exactly what he planned to do and they know exactly what he plans to do.","post_message":"But we didn riot, punch people, block traffic, take a day off school, or go on a fast."},{"comment_id":"10153004075042061","commenter_b":"These magnificent creatures were never meant to be made to stand on their heads or do any of the other ridiculous tricks they're forced to do.","commenter_a":"Stop hitting elephants.","post_message":"An elephant attacking your car - never a good thing: abcn.ws/1LxMzPP"}]
