[{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"1039779686062503","commenter_b":"Oh dear Lord! Yet you can have these so called \"Barbies\" walk around nude and no brains or respect for themselves or anyone else! They rob good hearted men and steal their hearts and yet this shyt is okay?","commenter_a":"People need to mind their own business if no one is getting hurt","post_message":"Is any place safe for moms anymore?"},{"comment_id":"10153260544144614","commenter_b":"What a coward b*tch","commenter_a":"Wow, he smacked that kid like it was a game! He needs his adult status revoked.","post_message":"Disturbing surveillance video shows a young boy being slapped by a man and falling to the ground in a Bakersfield grocery store. Justin Whittington, 23, was taken into custody in connection with the incident after the video was posted on social media and went viral. He was being held on $1,000,000 bail. The boy was not seriously injured, authorities said. Read KTLA's story here: @webpagelink"},{"comment_id":"1069162493180002","commenter_b":"Black LIES Matter!","commenter_a":"Life is what you make it....if you obey the laws and live a clean life none of this would happen....put the blame where it belongs.","post_message":"\"The idea that there are tensions between police and particularly black youth is something that kind of went without saying.\""},{"comment_id":"10153131128315950","commenter_b":"I hope their daughters get pregnant out of Wedlock","commenter_a":"I'm sorry, but your country deserves one more crazy, running it. Welcome Donald!","post_message":"The House voted to block Planned Parenthood's federal funds for a year."},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"}]
