[{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."},{"comment_id":"10153532801498984","commenter_b":"put her in jail and let some women make her their bitch","commenter_a":"JUSTICE FOR ALL?????!!!!!!!!!","post_message":"The extremely disturbing video of a young girl brutally attacking a schoolmate who was holding a small child went viral, now the attacker is facing some serious consequences...  Are you hoping justice is served?"},{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."},{"comment_id":"10157187236600354","commenter_b":"Feminists need to stage another protest akin to their bra burnings in the 60s. Perhaps a massive Hijab burning in multiple western countries.","commenter_a":"So funny how the media always pushes these anti-Iran stories even though iran is 1000x more secular than our 'allies' Saudi Arabia... let's hear about how many women Saudi Arabia executed breitbart. Stop the Iran propaganda pieces, you're turning into another Fox News.","post_message":"When will feminists take on the REAL 'War on Women'?    “...promote immoral and un-Islamic culture and promiscuity...”"},{"comment_id":"10153095836953299","commenter_b":"What does she care, it's not her money.","commenter_a":"no wonder she is flopping around like a boated eel.","post_message":"Almost $1 MILLION on polling alone in just a few months...."},{"comment_id":"10154172121273010","commenter_b":"They are moving the focus to have room to build a new ranger...","commenter_a":"This is disgusting. All respect for Ford, gone. After 2 Rangers, no more.","post_message":"It's cheaper and more profitable to make the cars in Mexico."},{"comment_id":"619174771576535","commenter_b":"Obama and Hillary: Muslim Brotherhood Connections Shoebat.com has spent quite some time revealing the Muslim Brotherhood and the Wahhabist connections of the Abedin family and it is perhaps the right time for all this to resurface again. We do not need just emails to prove it. @webpagelink.../ Vote @username 2016! & 2020! Crooked Hillary= 3rd Obama Term #BanShariaLawInAmerica #GodBlessAmerica","commenter_a":"While denouncing @username as unqualified to be president, Joe Biden pointed out the guy carrying his nuclear football to the crowd! The VP needs to be medically disqualified from office this day. @webpagelink","post_message":"We have a President and somebody running against me that doesn't even want to use the term RADICAL ISLAMIC TERRORISM. If they can't name it, they can't fix it! It is time to MAKE AMERICA SAFE AGAIN!"}]
