[{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"1237060979686981","commenter_b":"Felicity Odgers! See, your friend would go viral with 'fox'","commenter_a":"the \"mole freckle\" on youtube is more amusing.","post_message":"That's definitely not right!"},{"comment_id":"972410229461065","commenter_b":"It doesn't seem to matter, does it?...she's slicker than Willy!","commenter_a":"Oh stop it","post_message":"Arrest her, TODAY!"},{"comment_id":"889604141156365","commenter_b":"YOU LOOK LIKE A GORILLA SLAVE. WAS CHEETA YO MASTER? STUPID FUCKING NIGGER DOESN'T EVEN KNOW THAT IT WAS HER OWN RACE SELLING THEM TO MUSLIMS AND THEN TO WHITE PEOPLE. SOME OF THESE BLACKS ARE THE MOST IGNORANT SOB'S IN THE WORLD. MUST BE A QUEER BLACK WOMAN WITH A NAME LIKE BUBBA.","commenter_a":"First of all she is full of shit! when i worked in burger King you just kept on cooking .you dont know who is getting the Burger.she is pissed because she didnt prepare herself for a better job .Whos fault is that?why do thet put this shit onF.B .It isnt helping anybody It just fans the flames of racism.I find that OFFENSIVE!","post_message":"Did you miss this one? I bet you did because in Obamaland... 'The Media' doesn't cover such stories. Enjoy. @webpagelink"},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"}]
