[{"comment_id":"238735813255041","commenter_b":"And to think....they probably had children","commenter_a":"When the defendants were acquitted and they were just sitting back in their chairs with cigars in their mouths and everyone was just congratulating them on beating the case they had no remorse for what they did and it's terrible how could you be ok with kidnapping a 14 year old and just dismantle his face and then dump his body in a swamp that was pure evil and hate they had in their souls to just do that to him it's sad.","post_message":"The story behind the photo that exposed racism in America and helped spark the Civil Rights Movement. @webpagelink"},{"comment_id":"10153580791529170","commenter_b":"She is so stupid she thinks she Smarter than anyone else but Slick Willie has been out fooling her all of her life","commenter_a":"i guess im stupid","post_message":"According to Hillary, we're all just too stupid to understand how brilliant she is. She gets frustrated by that, and admits that her frustration is her \"greatest weakness.\""},{"comment_id":"10153495156678132","commenter_b":"Gosh, her voice is so heavily autotuned in this song, it sounds robotic!","commenter_a":"I dont get how she has music contract when literally all of her songs are autotuned. That means you're not a good singer. Anyone can sing when their voice is manipulated like that.","post_message":"Don't expect us to get anything done for the rest of the afternoon."},{"comment_id":"10156320084670354","commenter_b":"The most disgusting women on this planet !!!!","commenter_a":"why are these women so adamant on murdering of innocents?","post_message":"WATCH Whoopi Goldberg and Joy Behar unload on Dr. Ben Carson..."},{"comment_id":"1201296159904188","commenter_b":"Trump a moron! !!","commenter_a":"Donald J. Trump","post_message":"Megyn Kelly May Have Just Crossed The Line With This Comment About Trump  She just started a battle that she will never be able to win.  Do you stand behind Trump over Megyn?"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"1488163707879902","commenter_b":"she is just as ugly as orange hump","commenter_a":"Yeah I don't think so you idiot Crypt-Keeper","post_message":"Apparently this dimwit has never heard of the First Amendment. --Andrew"}]
