[{"comment_id":"728450517283994","commenter_b":"While I can appreciate that there is a flip-side to the coin on reproductive rights, I cannot fathom why or how you in your position can support an organization that works to outright dupe the public with false assertions, false information, or would work to purposely hurt a woman to meet their agenda. To pursue a pregnancy at the cost of the mother's life is not right when you can do something about it. The premise makes women disposable.","commenter_a":"No abortions mean women are not allowed to vote","post_message":"Inspired by the work of the Carolina Pregnancy Center in Spartanburg. We must do more to foster a culture of life."},{"comment_id":"10153765647881336","commenter_b":"The thing we are worried about is the fact this woman can become president when she has a possibility of doing all that.","commenter_a":"George W. Bush lies America into a pointless war that kills over 4,000 Americans, and deletes 5 million e-mails=eh okay with Republicans. 4 people die somewhere in the world and Hillary has her own server so that RWNJ's and terrorists can't hack her=throw Hillary in jail. The hypocrisy is thick with Republicans.","post_message":"Question: \"If Hillary Clinton wins, how many years will she serve in the first term?\" Answer: \"In prison?\""},{"comment_id":"10153750514111336","commenter_b":"Why isn't the media reporting on the violent acts being perpetrated by these muslim 'refugees' in Europe? Shouldn't Americans know the type of filth Obastard wants to bring to the US?","commenter_a":"The religion of peace strikes again.","post_message":"“I was taken by three men,” the murdered Syrian woman reportedly said. “Ever since that time my family has regarded me as unclean... They say that I deserve to die.”"},{"comment_id":"10153535731001157","commenter_b":"I don't 100% agree , but same happens when they send my child home from school with nothing but Spanish letters in a supposed \"Bilingual\" setting .","commenter_a":"Look's like a fag","post_message":"An Arizona mayor has refused an invitation to a meeting of U.S. and Mexican border city mayors because it was written in both English and \"Spanish/Mexican.\""},{"comment_id":"1579440092351045","commenter_b":"@webpagelink What Fox News doesn't tell you about #muslimlivesmattertoo","commenter_a":"I will never ever vote for someone as abominable as Trump! After four decades of voting GOP- I am done.Never Trump!","post_message":"'In spite of all the criticisms and vitriol being heaped upon Mr. Trump by Washington’s political elites, he has neither wavered nor sold his soul to the devil of Washington politics. Instead he has remained faithful, true and honest'"},{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"555784677879905","commenter_b":"They're not looking for life, we are looking for resources, we kill each other for that in this planet. When we find the other resources the inhabitants of set planet will surely deliver our faiths.","commenter_a":"So anti media feel stopping space exploration will solve earths worries? ?Sorry but go the space programs and all the science behind it!","post_message":"Right? Follow us --> The Anti-Media <--"}]
