[{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"10154673400449062","commenter_b":"Nope","commenter_a":"Not only are we erasing our history, but this change will cost a lot of money to redo signs, get new uniforms etc. The district has $107 MILLION shortfall because of the Robin Hood Plan. I won't have a job next year, and campuses will be forced to do more with less in many areas. So many reasons that this is NOT a good decision. If we ignore our history we are doomed to repeat it!","post_message":"JUST IN: HISD votes to rename 3 schools named after Confederate leaders. Details: @webpagelink"},{"comment_id":"10150607537004999","commenter_b":"Each act of terrorism has its own agenda. Define the act.","commenter_a":"A hate crime is an act against someone or a group of people based on their gender, race, sexual orientation or religion. Terrorism is an attack in which the victims are not relevant to the agenda. Terrorism is a statement normally made towards a government, a hate crime is a statement towards the victim, it's personal. For me I think a hate crime is more horrific, to hunt and kill someone for being who they are. Terrorism is more of an act of a coward, a hail marry pass.","post_message":"\"Why can’t we own up to the fact that hate crimes are just another form of terrorism, perhaps the worst, since they target the weak among us?\" Read on in The New York Times Opinion."},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"10150863474824999","commenter_b":"As opposed to when exactly? When was this glorious period of time when everyone spoke the truth?","commenter_a":"the problem these days we do not know who or what to believe, everyone seems to have their own agenda and telling lies is at the top of their agendas.","post_message":"\"Few other countries go to such lengths to deliberately inflict suffering on people seeking safety and freedom.\""},{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"783465908424965","commenter_b":"@username, we old","commenter_a":"@username so old","post_message":"1996 as in 20 years ago."}]
