[{"comment_id":"506619736194965","commenter_b":"Thats some nasty, ass mf shit","commenter_a":"Que terrible,","post_message":"Workers reportedly wear diapers to avoid becoming so desperate that they urinate or defecate on the floor."},{"comment_id":"10154959437824369","commenter_b":"If I was impregnated by my rapist, I can assure you that I would not be having that child!","commenter_a":"Again, this does not make exceptions for rape. Also, the only people getting abortions at that stage are women whose lives are in danger or something is terrible wrong with the fetus. This is more unnecessary legislation.","post_message":"Abortions would be banned after 20 weeks under a bill Republican lawmakers hoped to pass Wednesday"},{"comment_id":"10152771119936051","commenter_b":"Lady, when in America, do as Americans do. Our country was founded on a theocracy. Deal with it.","commenter_a":"Happy to hear it! American laws and rules apply here. NO others. Don,t like it then leave!","post_message":"This woman demanded that she be allowed to swear on the Quran before testifying. Well, she got her answer."},{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"1356943270993679","commenter_b":"Take away about 15-20 million illegal immigrants and where are you? Be careful what you wish for.","commenter_a":"Yet, those \"islands\" hold the majority of the population... which will continue to increase as urbanization increases. You can play spatial games with maps all you want, but the reality is, our country should be predicated on the idea of one person, one vote (equal representation).","post_message":"This is actually a very informative map."},{"comment_id":"10154018676368701","commenter_b":"If she used a gun and shot the fleeing perp then she should get off free and clear ! The cops do don't they !","commenter_a":"Sadly, if it was a gun she would be facing attempted murder charges in shooting a fleeing suspect. Since a car is a lethal weapon, it wouldn't be surprising if they decide to charge with something comparable. Property is not worth life, ever","post_message":"Police credit the octogenarian driver with leaving damage that helped officers identify the thieves car and apprehend them."}]
