[{"comment_id":"1754158708182258","commenter_b":"Rip officer...fly high... You will be missed","commenter_a":"Whoever is doing the laughing get off this page very disrespectful","post_message":"The funeral service begins for Detroit Police Sgt. Ken Steil. Watch along live as loved ones and fellow officers remember his life: Read more: @webpagelink"},{"comment_id":"10153356838133690","commenter_b":"Let ur sister to mumbai to get a rape","commenter_a":"Pak and ISI will use the money to fund terrorists !!","post_message":"Pakistan and China have held close diplomatic, military and economic ties for decades, but these projects would represent the largest investment in Pakistani history. @webpagelink"},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""},{"comment_id":"1714915928784727","commenter_b":"Looks like she fought with a lawnmower and lost! Seriously, she wants to look like that..... It looks horrendous","commenter_a":"UGH!","post_message":"What do you think of this extreme cut? Marketers are branding it “quirky, stylish and smooth.”"},{"comment_id":"1857128867864045","commenter_b":"What about the insane amount of lying going on in the White House right now? I haven't heard you talking about that.","commenter_a":"So lame.","post_message":"Please check out our 2nd Facebook live town hall right here!"},{"comment_id":"971095776261096","commenter_b":"#CottonCancer","commenter_a":"NO! I don`t even like Corn when it is too sweet,so i know i would not like fruit that is...and it cannot be good for us.","post_message":"Yes, \"cotton candy\" grapes are a thing."}]
