[{"comment_id":"10154270105832293","commenter_b":"Feminist spotted","commenter_a":"If you have an ounce of common decency, you're statistically more likely to support Hillary Clinton.","post_message":"If you have daughters, you're statistically more likely to support Hillary Clinton."},{"comment_id":"10153385478086756","commenter_b":"Real women do what they want to do. Feminism is about equality not which activity you prefer to do.","commenter_a":"real women go outside and play.","post_message":"Maddie found that in many video games, she could unlock the female characters by playing the game and amassing credit, but that could take hours. Or she could buy the character. On average, the female character cost $7.53."},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say \"roll tide\".... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"10153966537634714","commenter_b":"yeah i shut the bathoom door is consdered polite","commenter_a":"He said disgusting then you have no heart. You are not a lovable person.","post_message":"The quote has not been disputed by Donald J. Trump’s camp."},{"comment_id":"10153266920996051","commenter_b":"I think he's a muslim sleeper, programmed to distroy this country and let in all the muslims he can recruit.","commenter_a":"Even if he was it's his freedom to choose...why does he have to practice Christianity or Catholicism?","post_message":"Do you think these voters are right about President Obama?"},{"comment_id":"10154315230081051","commenter_b":"Kelly knows the enemy is coming from the south and must be stopped . Declare war and deport all foreigners !!!","commenter_a":"Military to the front again Obama to da back of the","post_message":"Trump's Homeland Security pick is dead serious about stopping the flow of illegal immigration into America. Does that sound good to you?"},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."}]
