[{"comment_id":"618782741607379","commenter_b":"She will never do it","commenter_a":"I can only see myself supporting Clinton if we have direct representation in her administration. I think a Vice President Bernie Sanders would be acceptable.","post_message":"Will Ana Kasparian and Hasan Piker support Hillary Clinton?"},{"comment_id":"10153701497529740","commenter_b":"Ben what is the answer. I'm sure more violence isn't but then what. Flowers, prayer, a handshake. These people, I use that term loosely, are predators. How do you stop a predator? You can try and take the source of the problem. Drugs for the money and high. Its a start. Not as easy as you might think.","commenter_a":"Tell the felon to STFU. Chicago is out of control. Most of us are not in that city's position. You can't control a city like that unless you show aggressive behavior and make these criminals know you mean business. This might not work in most places but Chicago is falling apart.","post_message":"The highly awarded Cmdr. Glenn Evans who has thrown himself in front of bullets to save fellow officers is now under scrutiny for same aggressive tactics that he's been praised for."},{"comment_id":"10153302212427439","commenter_b":"All other real religious beliefs will be outlawed !! Muslims don't do real religion ,,!!","commenter_a":"I guess he's all for isis and how shiria law can't be separted from the musilim religion they go hand and hand. And he's all in for this no such thing as islamophobia we can and will protest any genocide against anyone","post_message":"This is full blown sharia in the UK – not only will our ban not be lifted, I would expect more voices of freedom banned. UK: Labour leader says his government will criminalize “Islamophobia”, (thanks to Jihad Watch), April 26, 2015 We are going to …"},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"880499385321632","commenter_b":"100% yes.","commenter_a":"Absolutely","post_message":"Do you approve of this change?"}]
