[{"comment_id":"638058836332906","commenter_b":"Keep praying! @username is a Warrior for Christ!","commenter_a":"I was born and raised in Pennsylvania, and I'm hoping and praying that come election day the good people of PA will vote for a Presidential candidate who is a life long Conservative, versus an Entertainer!","post_message":"For seven years we've seen an administration that abandons our friends and allies.  That ends when I am president!"},{"comment_id":"894821663947420","commenter_b":"more idiots!","commenter_a":"I blame Obama","post_message":"Don't be quick to blame California's drought on plush lawns and swimming pools ..."},{"comment_id":"10154530724213645","commenter_b":"Yes Ryleigh this is really awesome. Great job !","commenter_a":"Nam Breanne Ewing NAM @username did you see this? Ryleigh @username and I are sooo proud of you. This is fantastic! Congratulations!!! I hope we are going to see you again this year in June!!! @username","post_message":"Meet Ryleigh!   Despite her physical challenges, she's beating the odds and inspiring everyone she meets with her story."},{"comment_id":"10154136814559411","commenter_b":"@username how is Rupert Murdoch theses days in sunny oz.","commenter_a":"Valdimir Putin will be proud!!! But this this newspaper is tied to a very sinister movement. Not all papers crytical of the government are shut down.","post_message":"Turkish authorities took control of Zaman last Friday, sales drop from 650,000 to 6,000 a day"},{"comment_id":"1091990537522616","commenter_b":"Fat lady has not even cleared her throat yet.","commenter_a":"Jesus Bernie. You've given up. You're turning into what you've said you despise. All of us fought for you, not so you could buckle up like a belt and endorse Hillary. I refuse to vote for Hillary. You are letting us all down, all because of a back-room conversation where Barack likely asked you to \"fall in line\". I'm concerned, but still very hopeful that you get up on that stage at the DNC, and demand that your followers vote 3rd party!!!!!","post_message":"I want to express my pride in what we have accomplished together over the last year. But so much more must be done to make our vision a reality. Now more than ever our country needs our movement — our political revolution. As you have throughout this historic campaign, I ask for your ongoing support as we continue through the fall and beyond."},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"10154810175428812","commenter_b":"@username, sthu sodomite and go back where you illegally camd from before we deport you and your family.","commenter_a":"That deal needs to be voided. Why would the U.S.A provide this animals with more weapons? That is ridiculous,they are responsible for so many deaths of innocent people and some of those terrorists are amongst us her in the USA causing death and destruction.","post_message":"Senate expected to vote this week on a resolution to reject a pending arms sale from the U.S. to Saudi Arabia following reports of civilian casualties in Yemen at the hands of the Saudi-led coalition."}]
