[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"970914179695452","commenter_b":"Shut up!","commenter_a":"Proof that even when your dad is the ex-President and your mom is the future president, family pictures are still a disaster P.S. It is a joke. You all need to chillax!","post_message":"Happy Father's Day, Bill!"},{"comment_id":"616279121877054","commenter_b":"@username not all people who are unemployed are \"deadbeats\".","commenter_a":"Get ready, republicans. You will find yourself with no health coverage. Keep praying to your god that you don't get sick.😂😂😂 I will personally take pleasure in watching you suffer.","post_message":"#BREAKING: Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president."},{"comment_id":"1117171088374939","commenter_b":"Amen","commenter_a":"Sir where have you been to be so incredibly deceived?","post_message":"Live from the MGM Grand Las Vegas lazy river pool: Dana Perino and Chris Stirewalt record their pre-debate podcast, \"I'll Tell You What.\" #debates"},{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"600616960147229","commenter_b":"@username It was $200,000; and I cannot stand that vile woman.","commenter_a":"This man is broke. He is a fraud.he knows if he loses he will go bankrupt. He cant even carry a sentence. His wife is an ex escort, and hes on his third marriage.","post_message":"WATCH #LIVE: Donald Trump speaks at Polish-American Alliance in #Chicago."},{"comment_id":"1208055202644589","commenter_b":"F*** GLOBALISM","commenter_a":"This country is in bad shape","post_message":"And the brainwashing starts. Included in the curriculum will be globalism too. Yaaaayyy... @webpagelink"}]
