[{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"'The Klan today is weak, poorly led, divided internally and without any political support'"},{"comment_id":"10155189081740354","commenter_b":"She ought to steam clean the empty space between her ears.","commenter_a":"There's a fool born every minute!!","post_message":"Who Says The Hollywood Left Is Out of Touch?"},{"comment_id":"839838619485613","commenter_b":"this is as serious as it gets , shes going to bring muslims to America whose religion dictates they rape women and behead the men ,NOT A JOKE","commenter_a":"your listening to the woman that will destroy America , its NO JOKE , ITS NOT BULL CRAP wake up this crook doesn't care about you , MONEY AND POWER that's all shes after","post_message":"WATCH LIVE: Hillary Clinton speaks at an organizing event in Florida — will she bring up Donald J. Trump's tweets?"},{"comment_id":"10152609996648663","commenter_b":"Do you think, if things progress in the next 10 years as they have, the next generation will have our privileges and freedom? Look at the debt. Look how the 2nd amendment has been attacked. And our religious freedoms. What about the Isis.....we are walking away from the America I have known, and I am 78 yrs old,","commenter_a":"My husband and I are fine, but woe to my grand and great grandchildren in the years to come. They will never understand how truly great Ametica was, they will never know what freedom was...","post_message":"In November, Americans sent a clear message to Washington that they were tired of political gridlock and want solutions and real results to the problems facing our country. Both President Bush and President Clinton used their State of the Union address following difficult midterm elections to acknowledge that they no longer have control of both chambers and that it was time for them to work with Congress. Unfortunately, tonight was another missed opportunity for President Obama and his legacy.    President Obama used this evening to appease his political base and focused on dividing our Nation and using bureaucratic control to run our country with top-down Washington-centered solutions. I believe the key to growing a healthy economy begins by strengthening the paycheck of hard working Americans, putting more money into Kansans pockets, and growing our economy from the bottom-up.     While I was disappointed in many of the President's remarks, I remain hopeful there will be opportunities in the near future to work together to expand trade and fix our broken tax code. I remain hopeful that this President will seize those opportunities just as those who preceded him did."},{"comment_id":"10153921301277217","commenter_b":"'@username has lost their integrity!","commenter_a":"Hahaha.sorry for the laugh. But @username Please investigate first before you conclude on this report. These are all accusations to our beloved president . even his rival denied those witnesses that testified in the senate. sad to say our president's rival now is doing the best they can to destroy our only hope to have a drastic change in this country . BTW You need to go to our country first to know more abt the facts and whats really happening here. :3 -_- #PostResponsibly -_-","post_message":"Gruesome gangland-style hits, including feeding one victim to a crocodile, were described to a Senate hearing by a former death squad member."},{"comment_id":"942693669149238","commenter_b":"None of the name calling is necessary... My views and opinions stand. ... And I can get my own personal point across WITHOUT name calling :)","commenter_a":"Wooooow people are so ignorant!! Since when is it 'crazy' to fight for freedom from a tyrannical government? They aren't trying to hurt anyone. They are wanting the ability to live free!! People are fined and jailed for living 'off the grid.' THIS IS WHAT WE CALL TYRANY PEOPLE!!! The constitution was created to help protect us from corrupt government... hence the ability to bear arms. This is why. GUNS DONT KILL PEOPLE, PEOPLE KILL PEOPLE!!!!","post_message":"BREAKING: Ammon Bundy says he, 150 militiamen taking over national forest reserve in Oregon to  up lands for ranchers, miners, loggers & to oppose  of the federal government. The group is also calling on  patriots to join them with arms."}]
