[{"comment_id":"10153197426077377","commenter_b":"I like you Ted but I want the migrants to assimilate into the US and the simple fact is the migrants from Mexico and Central and South America do that very well... we are them and they are us... get string borders but work out something so those that are hardworking people who make our country a better place can stay.","commenter_a":"Canada Cruz is an Amnesty supporter.","post_message":"Ted Cruz — \"I think Jeb Bush has been very honest, he's been very candid about his support for amnesty.\""},{"comment_id":"10152949428967061","commenter_b":"who freaking cares,she need to get her tubes tied !","commenter_a":"none of anyone's business....really don't care....","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"10154140006458525","commenter_b":"pure evil! No reason to harm officers.","commenter_a":"Suspect is now in custody.","post_message":"#BREAKING The suspect has been captured. Police in Iowa are searching for this man in the ambush-style attacks of two police officers, shot and killed in their cruisers. Police say Scott Michael Greene, 46, is considered armed and dangerous. SPREAD THE WORD: @webpagelink"},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"1043101302382000","commenter_b":"@username, the worst president in OUR lifetime was 2000-2008.","commenter_a":"Rep. Todd Young I understand your optimistic out look. How ever if you think that man will ever do anything, that would make America stronger then you greatly disappoint my opinion of you.","post_message":"While the President closed his State of the Union address by noting his desire to work across the aisle, much of his speech was spent digging in his heels on the same tax-and-spend policies rejected by the American people rather than identifying areas of common ground. But while I’m generally disappointed he took this tack, I still think there were some hints of bipartisanship that might present opportunities to grow a stronger economy. For starters, I agree with the President that Congress must pass a trade promotion authority bill. With two of the largest free trade agreements in the history of the world currently being negotiated, it is vital that the administration works with Congress to set negotiating priorities so that a deal might be completed quickly. In order to grow our economy, we must continue to open foreign markets to agricultural products and manufactured goods from places like Indiana, ..."},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"10153144460870950","commenter_b":"Rules are rules and the parents are aware of them before schools starts. There has to be more to this than what is being said by the parents. Schools are not allowed to say anything regarding any matter involving a child. Before I can make an opinion on the matter would like to know the schools side on it.","commenter_a":"That's an understatement...","post_message":"The 8-year-old girl's mother says the elementary school sent her daughter home for wearing a kelly green polo shirt."}]
