[{"comment_id":"1207240762629769","commenter_b":"She at the very least a pathological lair.","commenter_a":"LIKE if you agree that Hillary Clinton is MENTALLY and PHYSICALLY #UNFIT for the Presidency!!!","post_message":"Today - I outlined a plan for American economic revival - it is bold, ambitious, forward-looking plan to massively INCREASE JOBS, WAGES, INCOMES and opportunities for the people of our country!"},{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."},{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1197700750270781","commenter_b":"Get over it. The water is theirs. Respect it.","commenter_a":"@username I just adore you!!!","post_message":"These sharks aren't actually all that scary when you get your facts straight. Something else is, though."},{"comment_id":"10152878720003645","commenter_b":"Great american baboons","commenter_a":"There is something inherently wrong in the black community to promote this type of group violence. But then will cry racism at a drop of a hat...it is these very images that create the negative image of blacks. We are our own worst enemies not the \"white man\"...","post_message":" tenacity of placing something on video to shoot a young lady being beat down by six or seven young women is ludicrous in our community."}]
