[{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10155309638386509","commenter_b":"Stay home old hag","commenter_a":"There was nothing ,\" near\" about it . The Clinton News Network rolls on. In the bag for the Hag.","post_message":"Four days after her near fainting spell, Hillary Clinton is returning to the campaign trail"},{"comment_id":"1238390432847651","commenter_b":"Shut up Head","commenter_a":"THE FACTS ABOUT MUSLIMS ------ MUSLIMS are not here to assimilate. Muslims have NEVER assimilated to any society. ... THEY COME TO: ... * Force THEIR\" traditions, beliefs & political system upon us. * Delete our Traditions, Beliefs, religions & political systems. TECHNICALLY SPEAKING: Islam is NOT a religion. Islam is a \"political ideology/government\" hell bent on erasing all OTHER religions & ruling the world. Islam is hell on Earth... Eradicate this so called religion. SPREAD THE WORD, COPY & PASTE!!","post_message":"Seven civilians, including three women and a child, have been beheaded by suspected ISIS-linked militants in southern Afghanistan."},{"comment_id":"10157011618750354","commenter_b":"Would someone please tell me why these THUGS have not been arrested or gased?","commenter_a":"Dumb ass negros !","post_message":"WATCH the insane footage of the BLM radicals...  \"I will f*ck sh*t up!\""},{"comment_id":"1062563810499126","commenter_b":"Proud to be a new yorker","commenter_a":"What a bunch of BS!!!","post_message":"Former New York City Mayor Rudy Giuliani speaks at the RNC.  Donald J. Trump introduces his wife Melania Trump and she speaks at the Republican National Convention."},{"comment_id":"636847006505878","commenter_b":"who said she was a lady","commenter_a":"She is by far the worst First Lady of all time.","post_message":"What Michelle just said is one of the dumbest things we've ever heard.  This is just absurd. Michelle is moronic and un-American.  Is Michelle the worst First Lady of all time?"},{"comment_id":"1309116862459880","commenter_b":"Now if they can do something about her mouth....","commenter_a":"Seeing as she is costing taxpayers tons of $$$ for her moronish actions maybe a class action suit should be filed against her for $100M","post_message":"Just in!!"}]
