[{"comment_id":"10154363011532908","commenter_b":"In America, the people are the government. We're a republic, where our elected officials are acting on our behalf. Otherwise, we're supposed to kick them out. Taxation is the idea that no one can amass keep lot of money without a central authority to provide the infrastructure to make wealth creation possible, or the security to make created wealth sustainable. No one gets rich by themselves, and the people who work to make the rich people rich, or to keep the rich people rich, deserve an infrastructure they can survive on, too. Taxation makes a society fair, stable, and full of opportunity.","commenter_a":"Bernie is not asking people to share. Sharing involves VOLUNTARILY giving away your possessions.","post_message":""},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"1193499157336779","commenter_b":"Poor people. Blessed to live but with these memories. Prayers","commenter_a":"Very sad! I can't imagine the horror! God bless you always!","post_message":"\"We were just about to say the prayer to be released,\" said Felecia Sanders, one of three people who survived when a gunman opened fire during Bible study at her Charleston church on June 17."},{"comment_id":"1069463933089027","commenter_b":"All abortions are murders !","commenter_a":"he knows what we all know, the muslim is a fool a joke a laughing stock a disease forced on AMERICA","post_message":"*****BREAKING NEWS*****"},{"comment_id":"929346133862318","commenter_b":"If a bank (any bank or business) is going broke, such as Lehman Bros., how is it up to We the Tax payers to bail it out? A business either prospers of fails on its own merits, period! None should be \"too big to fail\"! Throwing trillions of dollars at a sinking ship is madness, it just prolongs the inevitable and hurts those that are being forced to pay for using their stolen tax paid monies, and harming the entirety of the economy, we are here to bail out the billionaires and globalist elites delusional scam they are perpetrating on man kind!","commenter_a":"What an asshole and she probably makes a 6 figure salary, time to clean house","post_message":"Not sure about you, but this REALLY pisses me off!   H/t: Emancipated Human Subscribe: @webpagelink  Join Us: The Free Thought Project"},{"comment_id":"10153832005601162","commenter_b":"Not a girl if you have boy parts, sorry.","commenter_a":"What about the rights of every girl at this school. This is insanity.","post_message":"30-DAY DEADLINE: The U.S. Department of Education says Palatine Township School District 211 is violating the rights of a transgender student by refusing to allow her the unrestricted use of a girls' locker room: @webpagelink"},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."}]
