[{"comment_id":"10154046625596051","commenter_b":"Furthermore what rights will trump take? The right for illegals to get more welfare then born americans? The right for illegals to start a business 7 years tax free and hand it of to their cousin for another 7 years?? I'm hoping for hard labor and prison time for desiccating the American flag on American soil.","commenter_a":"Since when did women become thinkers with their vagina's? Surely not many women are this dumb.","post_message":"With women voters, Clinton is leading by double digits. Why do you think that is?"},{"comment_id":"401125753409052","commenter_b":"Josh go live with the muzzies and obey THEIR laws in their land!!!","commenter_a":"It should be like that in America, too!","post_message":"'I don't want to take off my Muslim Head Covering in Court'..."},{"comment_id":"875104725882610","commenter_b":"muslims are worthless anyway..","commenter_a":"go ahead we will be happy for that!!","post_message":"And Turkey says the whole site will be banned if it does not obey"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"10151085765109999","commenter_b":"'@username, There is an 'illegal alien' in the penthouse of Trump Tower. She came to this country without a visa but persisted in working illegally until she found a sugar daddy who would marry her out of convenience. ICE needs to go there and interrogate her to determine if her marriage is a sham marriage for legal status or not.","commenter_a":"Let's face it, Trump does not care about Jews or Israel. It is up to Israel to save itself and work on two states solution. It is the only option to maintain a viable democratic Jewish state.","post_message":"'President Donald J. Trump may be the last man standing between Israel and a complete, self-inflicted disaster,' Thomas Friedman writes in The New York Times Opinion Section."},{"comment_id":"10153416483736162","commenter_b":"Her heels are scratching up the scoop and that just kills airflow efficiency!","commenter_a":"ALL OF US have pictures like this.","post_message":"A Chicago flight attendant for Spirit Airlines is in trouble for some photos taken on the tarmac at O'Hare Airport @webpagelink  For the stories you care about - 'Like' ABC 7 Chicago!  Instagram.com/abc7chicago"},{"comment_id":"10153907516071178","commenter_b":"Colbert is out of touch with reality","commenter_a":"Colbert and Koppel who ?","post_message":"It's like a liberal media love-fest."}]
