[{"comment_id":"10153281305806770","commenter_b":"Ladies need to have a knife, walk in pairs and stab to death the attacker. Do not attempt to wound.","commenter_a":"MODERN GERMANS NOT ACCUSTOMED TO ANIMALS","post_message":"The Cologne Carnival kicked off Thursday with 22 reported cases of sexual assaults, including two rapes, despite increased security."},{"comment_id":"10153200452766051","commenter_b":"I do not agree with celebrating Columbus day or the fact that he slaughtered the American Indians, however, I was born in this country where we speak English. I've spent 12 years in the Army proudly serving my country against all enemies foreign and domestic. I am against anyone that threatens my country not diversity - I'm against the law that enables illegal immigrants having children in this country and said children being natural citizens.","commenter_a":"It's not racist, we speak English in AMERICA, if you want to speak Spanish then go to or go back to fucking Mexico","post_message":"When this IHOP customer heard what language a fellow customer was speaking in, she snapped."},{"comment_id":"10153641975856234","commenter_b":"I don't know if it is objective or not. Some day we may find a genetic marker for transgendered people. In the mean time, you can travel to a state where you can find a chick with a dick to stand next to you as you pee.","commenter_a":"Interesting that the states with the lowest tax rates are places where I would NEVER want to live. I guess you really do get what you pay for.","post_message":"State and local taxes in the Garden State were 12.2 percent of income. See how that compares to other states."},{"comment_id":"835165216569680","commenter_b":"Don't accept it. Doesn't matter to me. I still have the right to marry...whether you like it or not.","commenter_a":"We Christians do not recognize this, not accept this, just ignore this. Just because MAN says it does NOT mean it is true. God is our Commander, Lord and Leader. Whatever He has stated is so; with His statutes we will stand, and believe Him forever. Look up everyone, for our redemption draweth nigh. . .","post_message":"So much for state rights. Where do we go from here? #SCOTUSmarriage"},{"comment_id":"10153363483281770","commenter_b":"Vincent N Laiza. He wants to stop illegals crossing the border for 1. Tax payers are taking care of them. We can't afford them 2. Many people coming across the border are criminals. 3. Many people carrying disease and have never had vacinations 4. Terrorists are sneaking into our country. All the above items do not just include just mexicans they are going through mexico to get in","commenter_a":"Florida, Ohio, Illinois, Missouri & North Carolina lets keep winning, vote Trump 2016. Full speed ahead Mr. Trump. We will do this, vote Trump 2016!","post_message":"BREAKING: Donald J. Trump wins the Florida Republican primary.  Read more: @webpagelink"},{"comment_id":"10152601738206519","commenter_b":"Let The Punk Cops Take Their Licks Like The Chumps They Are !","commenter_a":"They're expressing their displeasure with the Mayor. Suck it up Billy-boy, ypu wanted the job, now take your lumps","post_message":"\"New York police unions’ mini-rebellion against Mayor Bill de Blasio carries anti-democratic undertones, and even a faint odor of right-wing coup...\""},{"comment_id":"10156388253550389","commenter_b":"isis thinks if you get killed by a woman you go to hell.. lmao go get them girls!","commenter_a":"Just remember one thing, ladies. If you are in a position of fighting the enemy first hand like men do, the enemy will be just as fierce against YOU as they are against any man. Your feminism will not be a factor. And, if you become a POW, they will then treat you differently, but not In a way you will like.","post_message":"Defense Secretary Ash Carter announces plan to open all combat jobs to women, the Associated Press reports."}]
