[{"comment_id":"10153709197621336","commenter_b":"Was he having a stroke?","commenter_a":"Billynyvy Martinez","post_message":"WATCH: One Southwest Airlines employee could barely get through his safety spiel without nodding off and slurring his words."},{"comment_id":"10153644969898812","commenter_b":"Those flags do not represent the United States that I love.","commenter_a":"The church did not request it. The church is private property. Why does anyone think that TRASH should be placed on church property? If it is so much 'Southern heritage,' why was it placed on a predominantly black church? Is that like burning a cross on someone's lawn?","post_message":"Four Confederate flags were discovered this morning by the Ebenezer Baptist Church and the Martin Luther King, Jr. Center: @webpagelink"},{"comment_id":"1379793182036339","commenter_b":"because her goal is selfish...not to make HIM successful...not to help America....but to HELP HERSELF....","commenter_a":"They all say they have the answer when they're campaigning. I've always wondered the same thing...why the hell don't they tell someone, then??","post_message":"Here's another question that I have: If Hillary Clinton has the answers for the economy, why doesn't she tell Obama what to do now?  Why do we have to wait until she maybe gets elected and then gets inaugurated and then starts putting her ideas into practice?  If she's got the answers, why wait?  Why doesn't she make it a point to meet with Obama, who's in the Oval Office and say, 'Barack, this is what we need to do to fix the economy'?"},{"comment_id":"10153391185232217","commenter_b":"Lol. First...there are,a lot of people that doesn't know who she is. I personally have seen some of her exploits, but wouldn't recognize her voice. And second most that do follow her 'music' doesn't care what she does. Nobody gets mad at strippers. Nobody expects her to be smart...just dress in as few clothes as is legal and shake that azz. And lastly...the demographic that was knowledgeable enough to be outraged...went to work.","commenter_a":"Silly racist white people!!!","post_message":"They really weren't happy about Beyoncé's Super Bowl performance, calling it 'racism'."},{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: 'If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.'"},{"comment_id":"10154062164657042","commenter_b":"Let's dip her legs","commenter_a":"Poor baby,, how can she be such a horrible person,, well prison will be her first hell, then when she die, her other REAL HELL IS WAITING FOR HER,, she have no place in heaven .","post_message":"A child has died after his stepmother dipped his legs into scalding hot water."},{"comment_id":"794329380660118","commenter_b":"Away with dumb blonde teleprompter readers, away!!!","commenter_a":"Considering it's the only one she has, you'd think she'd find a better use for it.","post_message":"Sorry, Fox News! The 2015 Obamacare enrollment numbers just came out, and once again they smashed expectations.   Read more here: @webpagelink Image by Occupy Democrats."}]
