[{"comment_id":"10153057732666051","commenter_b":"She would of been bothering me..can I pull my junk out in public? No","commenter_a":"People and their phones need to get a life. This young Lady was not bothering him unless he had never seen a nursing child before. Sad world we now live in......","post_message":"A mother from Indiana was genuinely stunned when she found out that this photo of her had gone viral."},{"comment_id":"10155023483731037","commenter_b":"Fetuses are not considered sentient until around 6 months. Nothing wrong with an abortion within that time period","commenter_a":"Well, it would help if people quit having sex like rabbits and then run out and get an abortion because having the baby would be an \"inconvenience\". It's disgusting that 55 million innocent babies have been brutally murdered in a mere 43 years.","post_message":"An uptick in deaths, a slowdown in births and a slight drop in immigration all damped American population growth."},{"comment_id":"10153155404671323","commenter_b":"@username cool your jets mate !! Why should this woman or any woman in her situation sit around and wait for her breasts to kill her when she can do something proactive !! Do you know what it feels like to have the threat of your breast tissue turning against you and threatening your life !! Arrogant shite !","commenter_a":"What the fuck are you taking about? Are you a complete imbecile? She has a genetic mutation. This has nothing to do with chemicals. Besides, there are thousands of scientist like me around the world doing research to cure and prevent cancer. Read more before spreading nonsense.","post_message":"'I love my boobs but they have to go'. YouTube star Claira Hermet says goodbye to her beloved breasts before undergoing surgery for a double mastectomy"},{"comment_id":"837605946394236","commenter_b":"Another dumb southern woman","commenter_a":"If y'all vote Killary in, You are the dumbest people that walk the face of this earth. Obama has done enough damage. Military people do not want Killary as their commander and chief. If you think of no one else, think of our military. She has NO CLUE how to run this country.","post_message":"Donald Trump has landed at Dallas Love Field.  WATCH LIVE coverage of visit: @webpagelink READ latest updates & see photos: @webpagelink"},{"comment_id":"1662251920662029","commenter_b":"White thugs!!","commenter_a":"Love the broncos, but just for this I would have they're title taken from them and given to the panthers","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"948311541870934","commenter_b":"If they want to live in our country then they need to live by our laws. Things should not be changed to accommodate them! If they don't want to live by our laws they should live elsewhere! We have to abide by the laws...so should they!","commenter_a":"I don't think so .. Not in Fla","post_message":"This state is allowing burkas in driver license photos!  THIS SHOULDN'T BE ALLOWED IN AMERICA..."},{"comment_id":"914159775273545","commenter_b":"She is labeled as dumb!","commenter_a":"Lort.","post_message":"“I’m From Every Continent In Africa” Raven-Symone Continues To Put Her Foot In Her Mouth"}]
