[{"comment_id":"10155111456982178","commenter_b":"True, she just lies about everything to get votes. If she wins the WH we are all in trouble. ObamaCare will continue! Taxes will rise! Food prices will rise! More people will be out of work! Education will decline!","commenter_a":"Trump: Make America Hate Again!","post_message":"NEW POLL: Donald Trump is wildly unpopular among young adults, in particular young people of color, and nearly two-thirds of Americans between the ages of 18 and 30 believe the presumptive Republican nominee is racist. wral.com/@username"},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."},{"comment_id":"1769093619989896","commenter_b":"Send them all back across the border, they'll never get away with this crap in Mexico, they'll shot them there","commenter_a":"\"America was never great.\" Then why the fuck are you here?","post_message":"Blood flows in San Jose, California as Mexican flag-waving anti-Trump radicals attack Trump supporters, rip up American flag, chant \"Mexican Power!\"...\"America was NEVER great!\" PHOTOS...VIDEO..."},{"comment_id":"1004538792920312","commenter_b":"@username I'd love to hear your thoughts on the post from Kylelebrius Kennethius Jenkonious","commenter_a":"Hey friends, just wanted to highlight part of this post for those who aren't able to read the whole thing or watch the entire video. I really want this post to get people thinking about how we talk about these issues but also what causes these situations, not just the consequences of them. I know this is a tough situation and one that provokes lots of emotion and passion, but I hope we can talk about this in a productive and respectful way. Thanks in advance. \"Violence of any kind is wrong. But there's a serious problem when white students rioting after the annual Pumpkin Festival are described as \"rowdy\" and \"unruly\" but black protesters rioting in response to police brutality are portrayed as \"violent thugs.\"","post_message":"If you replace \"white\" with \"black,\" suddenly it doesn't sound so far-fetched. That's precisely the problem with the way folks are talking about the Baltimore riots. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10158064309830354","commenter_b":"She's so ugly!","commenter_a":"she looks like a dude to me. this not a real female.","post_message":"Poisoned coffee on the day of the debate???"},{"comment_id":"373546919515489","commenter_b":"She's retarded.","commenter_a":"I'm so sick of her BS, she needs to just plain go away and leave America alone.","post_message":"Pro-Gay, Pro-Abortion Nancy Pelosi Calls Marco Rubio a Bad Catholic"},{"comment_id":"10154434943826323","commenter_b":"The Arab trade was on a larger scale mate.","commenter_a":"The British Empire and other European nations were not the only ones responsible for the suffering of blacks. For centuries, Arab and Berber traders made big profits from the highly lucrative 'business' of slavery. Millions of black Africans were captured/kidnapped from their homes, abused and sold in slave markets. Today, In places like Saudi Arabia and Qatar de facto slavery still exists. People from the Philippines, Indian subcontinent etc. live and 'work' there in subhuman conditions. This is not a history lesson. It is happening right here and now. None of this justifies in any way the crimes committed by European colonialism in general and the British Empire in particular against indigenous peoples. But I do hope Mr. Gayle (whom I respect) will not hesitate to write/speak about injustice and racism that still exist in other parts of the world - including in African and Arab nations - with the ...","post_message":"Howard Gayle: \"The education system told me nothing but lies about Africa.\""}]
