[{"comment_id":"10155384832638132","commenter_b":"I wouldn't think a pregnancy so close after a tummy tuck would be good.","commenter_a":"Didn't she get a tummy tuck?","post_message":"Congrats to the Teen Mom 2 star!"},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"725495814307663","commenter_b":"Hillary is a virus!","commenter_a":"That's Tillery when we're not really being serious about lives of American citizens. She's a disgrace to represent any American. Trump 2016!","post_message":"Trump Just Leaked A Video Of Hillary Clinton That Could End Her Campaign [VIDEO]  She is panicking. See this video before it gets scrubbed from the internet.  Do you think Hillary has no place in our White House?"},{"comment_id":"1100432766685506","commenter_b":"F**k Obummer and his illegal aliens...","commenter_a":"Prayers","post_message":"OBAMA'S LEGACY: Veteran Kills Himself After Call To VA Suicide Hotline Goes To Voicemail    Meanwhile Obama Hotline For Illegal Aliens To File Complaints About Border Patrol Remains Fully Staffed"},{"comment_id":"517056128505278","commenter_b":"'@username I'm pretty sure much of what you typed is not true.","commenter_a":"Hillary should be forced to work as the next ambassador to Libya. She can hire the Mexican drug cartels as her security since Obama armed them better than he did our embassy in Benghazi.","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch '13 Hours: The Secret Soldiers of Benghazi' before voting for president."},{"comment_id":"10153115245746162","commenter_b":"What a pig!","commenter_a":"Unbelievable!!!!!!!!","post_message":"30-year-old Matthew Warner is charged with sexually abusing and killing his 19-day-old daughter.  How he almost got away with it @webpagelink"},{"comment_id":"1246779605377041","commenter_b":"this is the first smart commnet I read on here","commenter_a":"People just need to work harder and not be lazy is all.","post_message":"To bring back the so-called  dream, we desperately need to address the massive inequality that exists in America today."}]
