[{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"1505789769441048","commenter_b":"Boycott NBC","commenter_a":"When has NBC ever put a spot light on Trump in a positive way? Lol.","post_message":"The 2016 election has been quite the seesaw ride."},{"comment_id":"10154171433698701","commenter_b":"Crazy! :-)","commenter_a":"86 in Woodland, WA","post_message":"As of 2 p.m. today, Portland is hotter than Palm Springs, CA; Albuquerque, NM and Atlanta, GA! Stay up-to-the-minute with the FOX 12 Weather App: @webpagelink"},{"comment_id":"10153621551297377","commenter_b":"Crazy ancient old woman.","commenter_a":"ABSOLUTELY SHE WAS OUT OF LINE. Unbecoming and in appropriate from a person in her position.","post_message":"Some are questioning whether Supreme Court Justice Ruth Bader Ginsburg was out of line for criticizing Donald Trump in two recent interviews."},{"comment_id":"1013898135398451","commenter_b":"He'll yes. Put them back in there own country then nukem. All","commenter_a":"Time to fight back.","post_message":"The religion of Peace Strikes again! This time muslim migrants welcome their hosts...   Do you agree we should deport them all!?"},{"comment_id":"10152991363976336","commenter_b":"We know what we have to do!So what's the holdup !! Being our borders are wide open where just gonna wait till it starts in America! The longer this builds the harder it will be to totally defeat!","commenter_a":"Well, we could talk about why the government is giving Tonto National forest to a foreign mining company. Gold?","post_message":"Attorney General Eric Holder lashed out at Fox News, defending the Obama administration's reluctance to say 'Islamic extremism.'  'If Fox didn't talk about this, they’d have nothing else to talk about,' Holder said."}]
