[{"comment_id":"1442770955748411","commenter_b":"Well he's better than that BITCH","commenter_a":"That's an insult to pigs!","post_message":""},{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"},{"comment_id":"10152814040437293","commenter_b":"Especially among Liberals.","commenter_a":"It's not a surprise that Fox 'Faux' news should top the polls as the most trusted because most people (sheeples) are obviously dumb because common sense isn't in fact that common.","post_message":"Even among independents."},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"1168211463199863","commenter_b":"It's there. (Fuscia)","commenter_a":"I couldn't find New Zealand in there either. I suppose with a population of only 4.5 million...it's no wonder why.","post_message":"Where did Australia disappear to ..."},{"comment_id":"955289837857113","commenter_b":"How about we start with u lady . What a Moron!","commenter_a":"She should start with herself.","post_message":"(Video) 2 lies woven together to justify depopulating the Earth... Full Story: @webpagelink"},{"comment_id":"10153320820056051","commenter_b":"Think it's a good idea, then neighbors can tattle on those. We must find some way to catch the thieves. And I agree with Marilyn , also. And there are many, many whites on welfare that shouldn't be,also.","commenter_a":"I like to see what I am buying and if ny money is well spent or wasted.","post_message":"This mayor is going to make the names and addresses of all welfare recipients public."}]
