[{"comment_id":"10153429629189087","commenter_b":"Deport all illegals","commenter_a":"California...the Land of fruits and nuts...and illegals...and terrorists","post_message":"\"America is great. Trump is disgusting. Anybody but Trump,\" read words dotted across the sky above the annual Rose Parade in California on Friday."},{"comment_id":"1064050356984826","commenter_b":"Karen why do you want a President that would say, \"single payer will never ever come to pass\"? Despite over 58% of Americans supporting it, knowing it will save us money and insure everyone, and that every other industrialized country in the world has had it for years and years. @webpagelink Or someone who corporate lobbysists know will end up supporting the TPP? Do you know what this trade deal would do to my generations future? If you did you would not be voting for her. @webpagelink Please for my future and my generation future vote for Bernie in the primaries. #NoMoreTradeDealsThatSendJobsOverseas #HealthCareForAll #BernieForPresident #NinaTurnerForVP #WarrenForMajorityLeader","commenter_a":"It's Hillary's time! Bernie is good in the Senate.","post_message":"This is it—the Iowa caucus is today! If you’re standing with Hillary, share this."},{"comment_id":"1043008155755713","commenter_b":"To prison. Oh that's right she is above she law.","commenter_a":"It wasn't a vacation it was a paid leave of absence. Hello Obama is any body home? You work for us just like Hillary. O yeah she doesn't do anything but lie.","post_message":"Tonight is the biggest fundraising deadline yet of this campaign. It isn’t about money, budgets, or even what our competitor might raise. It’s about you and me, working together to protect and build on President Obama’s progress—making sure our country is strong, safe, and fair. If you're with me, chip in $1 right now: hrc.io/1NXINOf -H"},{"comment_id":"10153702399577377","commenter_b":"TRUE----BUT SHE OBVIOUSLY HAS THE WHERE WITHALL TO BUY PEOPLE OFF.","commenter_a":"SHE AND OBAMA NEED TO BE IN PRISON","post_message":"Former New York City Mayor Rudy Giuliani said Monday Hillary Clinton could possibly be the worst secretary of state in history."},{"comment_id":"422988511194831","commenter_b":"Drunk girl not girls","commenter_a":"How is a drunk girl gonna pull out her gun and shoot if she is passed out?","post_message":"Everytown for Gun Safety: “By saying that guns will prevent rape, they’re putting the burden on the victims.”"},{"comment_id":"10152929148789342","commenter_b":"That statement coming from a welfare trashy tattooed old skank. Go figure.","commenter_a":"aand let the killings begin...smh","post_message":"BREAKING -- The Texas Senate has given preliminary approval to allowing concealed handguns in college classrooms, a day after passing a measure allowing open carry of guns most everywhere else in America's second most-populous state.  FULL STORY ---> @webpagelink/  What do you think -- are guns on campus a good idea?"},{"comment_id":"10155302418745579","commenter_b":"lady, you need medication.","commenter_a":"My Grade for President Trump A-. Will go up to an A++ when those planted by the last administration to attempt a political coup are removed. My grade for Congress D- will go up when BOTH party's stop trying to slow down the executive branch and start working for the people .","post_message":"GOP Only: Your Grade of Pres. Trump & Congress?"}]
