[{"comment_id":"555357001316722","commenter_b":"@username open your eyes hill right hand person Muslim female yea so Trump might not be perfect or what this country really wants but he is 100 times better then hillary","commenter_a":"Mitt I actually liked you and voted for you! Thank you for giving me even more reasons to vote for an outsider! All of you politicians disgust me and are hypocrites! #trump2016","post_message":"WATCH: Mitt Romney slammed Donald J. Trump as \"a fraud\" and called on the 2016 GOP candidate to release his tax returns.  What do you think of Romney's speech? @webpagelink"},{"comment_id":"10153590637376336","commenter_b":"Nuclear is clean efficient and it's a country's pride! Do you know ordinary Iranians are really nice folks?","commenter_a":"Boy this Iran sure wants nuke power really bad, but what I don't understand is why they need nuke power to light up clay homes in the desert. Does anyone else see a different picture? America used wind, coal, steam as a first time power source.","post_message":"Iran will reportedly be allowed to use its own experts to inspect a site it allegedly used to develop nuclear arms under a secret agreement with the International Atomic Energy Agency."},{"comment_id":"10153017146936973","commenter_b":"But history is written by the victor i suppose.","commenter_a":"I'm from Mississippi and have been living in Oregon this pass year going school, work, etc. The Confederate flag represents our heritage and the hard working people like the farmers that supply food for you, and feed for the animals people in the U.S consume. Majority of the military that protects this country is Southern. People think they can just so publicly shit on us for something they know nothing about. Let me tell you something my family has been there for generations they had no slaves had to bust their asses having their children working hard picking cotton and corn using wood stoves until the damn 70s. Only the rich had slaves and that made up what 2% of our population ha. Bunch bullshit putting down an entire cultures heritage because of a few bad seeds that had the money and could call the shots.","post_message":"As the nation struggles with the legacy of a historic icon commonly brandished by hate groups, the outcome of that conversation could resonate in Oregon, too."},{"comment_id":"10153963536777235","commenter_b":"And a large percentage of illegal immigrants simply come here legally with a visa and just don't leave.","commenter_a":"The wall is absolutely absurd. See the ocean? You can use it to go around the big ugly wall. See the airplanes? You can go over the wall. Ask El Chappo about going under things. It's nostril flaringly stupid. Ancient technology. Pre airplane, backhoe and no ocean on either side. It would be funny if there weren't so many truly stupid people believing it. Gag, cough, hurl.","post_message":"BUSTED!"},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"10153226873549170","commenter_b":"Wrong. BOTH parents have to be citizens at time of birth. His father didn't become a citizen until 2005. If I go around the world getting women pregnant, those children are NOT citizens of the USA.","commenter_a":"First I like Cruz. There is no question he is a citizen. The real question is he a natural born citizen. Back in the day when I was in grade school (before history was re-written on the issue) we were taught that you had to be born in the United States to be president.","post_message":"There's plenty to debate about the race for the nomination, but folks, can we please put this question to rest?"},{"comment_id":"10156924432505354","commenter_b":"No! What people do sometimes astounds me!","commenter_a":"@username did you hear about this?","post_message":"Tree Hugger Causing Seattle Traffic Back Up  “Issue appears to be between the man and the tree,” Seattle police tweeted...  #ManInTree"}]
