[{"comment_id":"10153173313535090","commenter_b":"<(\") Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"},{"comment_id":"10153019122102060","commenter_b":"So full of it. There are other Drs who can xray women.","commenter_a":"Because god knows in a state as poor as Louisiana, keeping women from accessing basic reproductive care is a GREAT idea. That won't have any long term consequences. Heckuva job, Bobby.","post_message":"Gov. Bobby Jindal's office has announced Louisiana is terminating its Medicaid provider contract with Planned Parenthood."},{"comment_id":"10153919484005950","commenter_b":"I'm not copying, I'm telling the truth. You also look like a witch. It's catching.","commenter_a":"Angelina ruined him once, now she's trying again. She should have kept her man eater claws out if his first \"real\" marriage. I swear, I think she's a dark witch, casting dark spells.","post_message":"The LAPD released a statement to Entertainment Tonight to clear up reports that they were investigating Brad Pitt for allegedly being physically and verbally abusive with one of his children."},{"comment_id":"1782160282048254","commenter_b":"She needs to her big ass and I'll out of the country.oh I'm probably on the hit list now.","commenter_a":"guess time will tell....when he wins it will be interesting to see how some of these people deal with all they've said and done. i wonder if hillary is getting packed to leave the country on the 9th. i heard she's transferred big bucks out of the foundation to another country just in case!!!!! her plans for the white house will be plans for the big house when she looses!","post_message":"Karl Rove says there is no way Trump can win the election because of 'the campaign he's running'. Do you think he is right?"},{"comment_id":"417410465107501","commenter_b":"Should be shut down!! YEA---YOU'RE CHRISTIAN! !! ---- NOT!!!","commenter_a":"This is America and our two party system decides us all. No wonder that there are those who would help this business owner. Now let's see if this upright Republican claims all of it in taxes. My guess is that like most Republicans she will lie about it and cheat the government.","post_message":"Sadly, bigotry pays."},{"comment_id":"10154681794980329","commenter_b":"@username Cringe worthy.. Sounds like a super basic bitch thing to say lol","commenter_a":"As a 6 foot tall lady who is all leg, YAAASSS, SEND THEM ALL TO ME.","post_message":"\"I might keep the jeans for fun now,\" one recipient told BuzzFeed News."},{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."}]
