[{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."},{"comment_id":"1729707230595759","commenter_b":"See, you came here legally. That was your big mistake.","commenter_a":"I immigrated from Europe legally paying my dues. Before they even gave me the visa to enter in USA I had to travel across the country and spend a day at a hospital designated by the USA consulate being checked out for diseases. Had to have a certificate from the tuberculosis center that I don't have tb. And after the consulate got my results I was issued the visa and given the green light to come to USA......why did the laws change?","post_message":"Are Americans aware of this?"},{"comment_id":"1204572852997751","commenter_b":"Oh man....","commenter_a":"Alex Chapman WTF is it even gonna be worth watching that's 3/4 out of it now","post_message":"'No more soggy bottoms'"},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"}]
