[{"comment_id":"947714872011958","commenter_b":"Thereeeesss Billl---","commenter_a":"This is just an endorsement for trump.. it has nothing to do with Cruz.. Why is it that everything to do with t rump is exaggerated , or just outright lies ? Every time he opens his mouth the stooges have to run around for three days explaining \"what he meant to say\"? he didn't mean women should be jailed for abortions, he meant they should be celebrated.. he didn't mean mexicans were rapists he was talking about \"the bad ones\".. he didn't mean single payer health care he meant government paid health care.. he didn't mean to call Carson a child molester he equivocated that he was LIKE a child molester.. He didn't mean to hire all those immigrants for his hotel, he meant to say Americans are lazy and won't take the low paying jobs.. He didn't mean to imply that his wife is just a \"piece of ...","post_message":"Ted Cruz is having a hard time with Latinos for one EPIC reason. When I heard it, I couldn't stop cheering! All aboard the Donald J. Trump train! Do you think Ted is finished?"},{"comment_id":"10153683071398984","commenter_b":"Get the hell out bitch!","commenter_a":"Pork sandwiches for everyone.","post_message":"This Muslim tried to shame a grocery clerk into taking off her American flag pin... but instead, something amazing happened. This story is going viral across the nation..."},{"comment_id":"10152929070861336","commenter_b":"They're still human beings escaping horrible working conditions, some of these people don't even have the education or access to resources to migrate legally. So, our government is going to arrange for them to be able to live in peace and be employed in jobs that most people wouldn't take. And they'll be grateful. Sounds like the rush of immigrants that came over in the 1800's. Maybe you need to chill out instead of being knee-jerk reactionists like the anti-immigration groups from back then.","commenter_a":"Idiots both of them","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10154657445794575","commenter_b":"@username so what your saying is the other 55% or the majority are coming over the border illegally so we do need to build a wall right?","commenter_a":"Help AMERICA first. Like the veterans, homeless and elderly!!!","post_message":"Exodus Refugee Immigration plans to move 60 people from Syria and the Democratic Republic of the Congo to Bloomington next year, starting in March. \"These are the most thoroughly vetted people coming to the United States. We don’t do research into anybody else to this extent,\" said IU Associate Professor Elizabeth Dunn."},{"comment_id":"10153586191671336","commenter_b":"White girls everywhere lose their minds","commenter_a":"No to starbucks for quite some time.","post_message":"Yay or nay… What do you think of Starbucks changing up the pumpkin spice latte?"},{"comment_id":"10153324088600736","commenter_b":"Having a girlfriend costs alot more than a hooker","commenter_a":"You would think that even the ugliest of men can get a girlfriend without having to pay for one...","post_message":"The man showed up at the police station \"much to the bewilderment of those in attendance,\" West Linn police said."}]
