[{"comment_id":"1711137139137823","commenter_b":"@username I've been reading your comments and I can tell you're a Drumpf dwarf you dumb, classless, hillbilly trash you are utterly disgusting don't forget when you take your dump in your out house you can cast your vote for Drumpf at the same time!","commenter_a":"I think it was the movie Animal House..\"fat drunk and stupid is no way to go through life\" maybe you should take the same advice Rosie O'Donnell. You're a classless loud mouth, when Trump becomes President feel free to leave the country, Ill even pay for your ticket","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"10153475368683984","commenter_b":"What in the hell is wrong with people like her. She should be deported fro America after serving appropriate jail time.","commenter_a":"Big shock.","post_message":"I can't believe THIS is what parents had their children doing while protesting the Texas pool-party incident... Shocking... Do you think what these parents did was outrageous?"},{"comment_id":"1769177686700867","commenter_b":"Move out of our country then bitch! I'm glad Mike didn't let you carry our flag you traitor!!!!!!!!","commenter_a":"If your ass don't like it here leave you jabroni ass clown","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"10153414468266323","commenter_b":"Took five years for my son to be. Diagnosed he is now ten","commenter_a":"This is fucking offensive. I can't believe the writer is a senco of all people.","post_message":"The range of options available to the discerning child-labeller is growing: social issue, learning difficulty, behavioural need, obsessive tendency, food intolerance or – my all time favourite – being “on the spectrum” ..."},{"comment_id":"1128844340487134","commenter_b":"I believe in planned parenthood, but I believe it starts before you get pregnant, not after. Grab a couple condoms, take the pill or shot. Get your tubes tied. Life starts at the time of conception. Murder is murder, I don't care how old the person is.","commenter_a":"Can Hillary tell us on what date she considered Chelsea a human being?","post_message":"Sadly, true."},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."}]
