[{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"941978015839539","commenter_b":"I do like a chick with a beard...","commenter_a":"Hi I am Jessica. I am 17 years old. Inbox me and I'll compromise your account passwords and/or bank account.","post_message":"Penned on sheep skin, this document will have a major impact on the way we view Islam."},{"comment_id":"1001682469851506","commenter_b":"This lady is so delusional. .... how did this happen","commenter_a":"Does no one get the part where they are wielding skateboards at police? This isnt because a WHITE COP or two BLACK KIDS.... this is because TWO CRIMINALS TRIED TO ESCAPE AND USED SKATEBOARDS TO ASSAULT POLICE!!!!!!!!","post_message":"JUST IN: This footage shows step-brothers, Bryson Chaplin and Andre Thompson, at Safeway -- before they were shot by an #Olympia police officer. >> kiro.tv/SurveillanceOly  They are both expected to survive."},{"comment_id":"10156316346195725","commenter_b":"'@username , but Muslims will not vote for him","commenter_a":"We need you now Donald Trump!!!","post_message":"Remember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil."},{"comment_id":"10153896144132061","commenter_b":"Women get it done.","commenter_a":"Husband leaving town at a bad time","post_message":"'This is what happens when you are 35 weeks pregnant, husband leaves town for the weekend, childcare for your 3-year-old falls through, and you have a game to cover!'"},{"comment_id":"1840578192829386","commenter_b":"WORDS DON'T CHANGE THE FACT! TRUMP IS YOUR PRESIDENT! LEAVE THE USA!","commenter_a":"Keep trying thumb suckers","post_message":"ALERT...."},{"comment_id":"10153121950974641","commenter_b":"Oh really? Documented mental illness or zealous?","commenter_a":"Ohhhh good to know that! So, the ones to blame are those 150 victims for taking that plane!!","post_message":"Alps crash co-pilot suffered from severe 'psychosomatic illness,' according to reports: @webpagelink"}]
