[{"comment_id":"942978109072863","commenter_b":"You're supposed to protect your children not potentially ruin them.","commenter_a":"Ever think of asking her why she steals? How about showing how her loved ones are affected by her stealing, a family intervention. How about telling her that you love her and if there's ever anything that she needs, she can ALWAYS come to her father!","post_message":"Too far or just punishment?"},{"comment_id":"450455948478319","commenter_b":"Get off her fat butt and walk. That does not cost. Stop whining and exercise at home. Absolutely disgusting.","commenter_a":"Yet she has enough to do that fugly bozo the clown hair color","post_message":"Should All Welfare Abusers Be Arrested?  Comment 'yes' or 'no'."},{"comment_id":"10156401528845725","commenter_b":"'@username pretty sure thats illegal and unenforcible","commenter_a":"I support you from India, they are welcoming muslims while one of muslim countries Brunei just banned Christmas..not to mention all most all muslim countries have banned isrealis and most of them hate america after jews..","post_message":"Thank you Franklin Graham! I have always appreciated your courage, but now more so than ever!"},{"comment_id":"1320520624652837","commenter_b":"Minus the illegals AND the refugees AND the dead people!","commenter_a":"California in particular allows illegals to vote. When someone applies for a driver license in that state, they are automatically registered to vote, contrary to Federal Law.","post_message":"TEASE: TEASE: Yeah... about that."},{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"10157286687695093","commenter_b":"The same FBI that said Hillary Clinton was to dumb to be prosecuted? Gmafb dude. I tell you what why don't all of the uneducated whites thank think their better than blacks go, than not only will the crime rate be lower but the racial tension will be too.","commenter_a":"I guess they're gonna condemn violence against police when white folks stand and condemn police violence against blacks. Until then we'll continue to lie to one another.","post_message":"Must-see!"}]
