[{"comment_id":"10153648598172894","commenter_b":"Where's your daughter? Dummy","commenter_a":"Shes already A Mother. Didn't she give her first daughter Away?? 🙈🐸🐸🐸☕☕☕☕","post_message":"Confirmed: Janet Jackson IS Pregnant, Expecting First Child with Husband Wissam Al Mana"},{"comment_id":"750864925104085","commenter_b":"with OUR money !!","commenter_a":"Absolutely","post_message":"Obama Caught Red Handed Financing Mosques Around The World He has been hiding who he is for his entire presidency. Do you think Obama is a Muslim?"},{"comment_id":"10154652833671336","commenter_b":"BUILD THE WALL!!!","commenter_a":"let's end this by voting for trump","post_message":"A man who allegedly killed two people and kidnapped a third one over the weekend in the Dallas area had been deported three times to Mexico in the last two decades, immigration officials said on Wednesday."},{"comment_id":"1338481856248063","commenter_b":"Another woman with no self- respect!","commenter_a":"Typical racist coward","post_message":"He said the controversial chant he was heard yelling had nothing to do with Jews."},{"comment_id":"1324289204299860","commenter_b":"LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Tried to listen to Jill's reason for the recount but she made no sense. She is the reason Hillary lost and she's nuts. Wouldn't vote for either of one, both are evil.","post_message":"Uh-Oh, Hillary! Trump Just SMASHED Down The Hammer On Crazy Vote Recount Scam! THROW THEM BOTH IN JAIL!"},{"comment_id":"10152778500617093","commenter_b":"@username lol! I saw this earlier. Had me crackin up. She was playin NO games with him","commenter_a":"He may not see it now but when he gets older, he will thank her. God bless them.","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."}]
