[{"comment_id":"10155034427609197","commenter_b":"'@username you need to kno this too, @username n Dayna Bianca Haskins too. Pass the word..","commenter_a":"'@username fyii","post_message":"Could finding something on your car hood mean your safety is at risk? See why one woman's Facebook post is going viral!"},{"comment_id":"1528246223862069","commenter_b":"'@username Pink pussy bow","commenter_a":"I am so glad that someone finally said all of those things directly to her smug, lying, corrupt, evil face!!!! That was awesome! All of us 'deplorables' wish we could have the opportunity to do exactly the same thing!","post_message":"A notable percentage of voters changed their mind on Trump's attitudes toward women after the latest scandal."},{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once 'Obamacare' is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1318642101490448","commenter_b":"No dumbass that's why she lost","commenter_a":"No she is to crooked","post_message":"Honest question: Do you think Hillary Clinton would have been a better president than Trump?"},{"comment_id":"10154382479866159","commenter_b":"Now is a good time to venture into the moving industry !!","commenter_a":"I know a lot of people I hope does this.","post_message":"'Make dating great again!'"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":"is just  it's a wonderful line. I own some of it. I fully  I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10154054009251337","commenter_b":"God Damn I want some fries now.","commenter_a":"Fuck Topher Grace. He ruined Venom.","post_message":"IT'S NOT A REUNION! Curb Your Enthusiasm's reunion for Seinfeld finally gets edited together..."}]
