[{"comment_id":"1105387789537448","commenter_b":"Truly AMAZING she's still walking free, let alone running for ANY office other than cell block Queen!AND NOW the big 30 minute meeting of billy boy and AG L Lynch in Phoenix while under investigation! DEEP DEEP CORRUPTION","commenter_a":"Using her words when she said\" When Bill left office we were flat broke\". Folks that was less than 12 years ago. Pretty good return on her investments. Instead of President, maybe we should make her the Federal Reserve Chairman.------NOT","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"10153738689479032","commenter_b":"Thanks to those who muck it up for other people. Your stupidity is so appreciated. Stop breeding too.","commenter_a":"Maribel Maldonado","post_message":"Visiting Fossil Creek? As of May 1, you need a permit. @webpagelink"},{"comment_id":"10154667540793812","commenter_b":"#theybothsuck","commenter_a":"#VOTETRUMP","post_message":"UPDATE: One person in custody after two officers are injured in shooting in Arkansas. abcn.ws/2aGeleD"},{"comment_id":"1242270725821978","commenter_b":"#MyBodyMyChoice . Oh get over it men.. you have no right over women... You would never stop abortions.. we will find our own ways.. neener neener.. grow up and realize you don't matter..","commenter_a":"Oh yes, women just can't make these important decisions without a man's assistance and approval. Jeez, what's next, taking away women's right to vote?","post_message":"“I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,” said the Oklahoma representative who wrote the bill."},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"}]
