[{"comment_id":"10153038783201717","commenter_b":"She is absolutely ridiculous","commenter_a":"Dude she had how many warnings to do her job and she refused? Did the judge think that putting her in jail then taking her out would scare her into doing her job now? I highly doubt she's gonna get out and be like \"oh yea imma start issuing out these licenses now, even tho its against my religious beliefs\" pffft fat chance.. -_- I'm so sick of this bitch","post_message":""},{"comment_id":"1119120924851115","commenter_b":"You're a misogynistic prick who probably doesn't get laid often. Go masturbate or something.","commenter_a":"Aww poor babies couldn't handle a wittle emotional turbulence? Fuck you, you are such testicles (in lieu of pussies, which can actually take quite a pounding).","post_message":"Depression, muscle pain, mood swings, acne, and changes in libido – sound familiar?"},{"comment_id":"10155217718349411","commenter_b":"Sanders is most sensible politician than other American leaders the only guy who is not a Zionist boot licker long live socialism Nothing wrong in being socialist , socialism is the best ideology that distributes wealth equally there is never extreme rich or extreme poor in socialist societies take examples from Danmark , Finland , Norway etc you see how well they are doing","commenter_a":"Donald Trump is your President! Because I'm American hispanic and I'm tired of how all of these coward racist liberals that hate America like Obama, and his supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":""},{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"}]
