[{"comment_id":"1843443299266966","commenter_b":"Yet recent college grads have to have 3-4 years of experience to get a damn job with their field. This lady is straight unqualified for this position.","commenter_a":"Handle ya bizness AL!!!! Yasssss!!!!","post_message":"Al Franken is stunned to learn that Betsy DeVos is unfamiliar with the difference between proficiency and growth."},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just \"no means no\" and \"yes means yes.\""},{"comment_id":"1172394232854914","commenter_b":"Hell yes !.... Hillary !","commenter_a":"I think Trumps ego is what will make him a great president. He couldn't stand to fail. There's nothing anyone could say to make me vote for Clinton. Don't trust her-don't like her.","post_message":"Make sure you're registered to vote HERE=> vote.gov  COMMENT Below who you thought won on the issue of immigration tonight-  \"Trump\" or \"Hillary\""},{"comment_id":"600457780118425","commenter_b":"You fukn punks need to get out of our country. You are a disgrace to black people everywhere. You bitches are pathetic excuses for human beings.","commenter_a":"How much did Soros pay them??????","post_message":"Trump Hating Thugs Spit On Flag… Look What Happens Next [VIDEO].  If you don't respect Ole' Glory then you can leave our country.  Do you think these thugs should be deported?"},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"10154044912016756","commenter_b":"Heterosexual couples also have anal sex.","commenter_a":"Anal sex greatly increases your chances of catching aids.","post_message":"A Christmas Eve first date. A Christmas proposal, three years later. And now, a first Christmas with their son."}]
