[{"comment_id":"10154892796939927","commenter_b":"Hi Kay Facebook Animal Adventure Park","commenter_a":"When the hooves start to come out they are gonna go live from a ground cam, if u like their page u can turn on notifications for videos so u will get a notification to make sure u don't miss it :)","post_message":"LIVE: Giraffe Cam! We continue to watch and wait for April the giraffe to deliver her new bundle of joy."},{"comment_id":"10153207458909135","commenter_b":"Cindy- don't conern yourself with the three blind mice","commenter_a":"What lies are you planning on telling today? How are those donors and polls coming along?","post_message":"On the radio with Laura Ingraham now. Listen live here: @webpagelink"},{"comment_id":"10154313146426045","commenter_b":"Lady Liberty not going to get you in HEAVEN","commenter_a":"For all the Christians out here, I thought you might need a reminder of what your God says about foreigners. Leviticus 19:33-34 ESV “When a stranger sojourns with you in your land, you shall not do him wrong. You shall treat the stranger who sojourns with you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt: I am the Lord your God. Before anyone starts screaming Old Testiment. Mark 12:30-31 (NIV) 30 Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’[a] 31 The second is this: ‘Love your neighbor as yourself.’[b] There is no commandment greater than these.”","post_message":"Mexican President Enrique Pena Nieto said his country  not pay for any wall, defying the claims U.S. President Donald Trump has made."},{"comment_id":"10153448230456680","commenter_b":"'@username Lucky for you these modern day Hitler's didn't murder you in your womb.","commenter_a":"The innocent handicapped underdeveloped should not be punished by death. Some are responsible and need to be punished. Donald J. Trump is correct again. Trump for president 2016.","post_message":"Planned Parenthood Action also issued a five-figure ad buy in partnership with Priorities USA Action – a super PAC supporting Hillary Clinton."},{"comment_id":"1945808648983136","commenter_b":"This Fucking pussy","commenter_a":"What a freak thus guy is!","post_message":"Must-watch. Morning Joe, a Republican, was left speechless by top Trump advisor Stephen Miller's dictatorial, lie-filled performance on the Sunday shows.  Shared by Occupy Democrats, LIKE our page for more! Video from MSNBC."},{"comment_id":"10152914795481336","commenter_b":"Women, in particular, need to be observant, especially at night! Plus, they would be well-served to get their CCW and learn how to use their weapon---proficiently...!!!","commenter_a":"One of us would not have left there.","post_message":"Police in Texas are searching for a man seen on surveillance video forcing a woman into the trunk of her car at an ATM."},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."}]
