[{"comment_id":"10154202111261037","commenter_b":"The real question is why she felt it necessary to do it!!","commenter_a":"Here you go: These are not my words. This was a comment from a woman named Laura Johnson who posted on TYT thread, and I thought it was worth the share. When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn’t even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood – both were forced to withdraw their names from consideration. Next she chose Janet Reno – husband Bill described her selection as “my worst mistake.” Some may not remember that Reno made the decision to gas David Koresh and the Branch Davidian religious sect in Waco, Texas resulting ...","post_message":"In a wide-ranging interview with FoxNews, President Obama says he failed to adequately plan for the day after the U.S. helped toppled Libya's dictator in 2011."},{"comment_id":"1439684252723748","commenter_b":"Hilary is definitely not as bad. You got complacent about gore in 2000 and inflicted gwb and eight years of mayhem on the rest of the world","commenter_a":"Lord have mercy on everyone in the world if he's elected president. Somebody keep that from happening - pleeeeeease ...","post_message":"Donald Trump is spiraling out of control."},{"comment_id":"417410465107501","commenter_b":"Should be shut down!! YEA---YOU'RE CHRISTIAN! !! ---- NOT!!!","commenter_a":"This is America and our two party system decides us all. No wonder that there are those who would help this business owner. Now let's see if this upright Republican claims all of it in taxes. My guess is that like most Republicans she will lie about it and cheat the government.","post_message":"Sadly, bigotry pays."},{"comment_id":"10155783604970293","commenter_b":"If she was defending herself I hope she walks. Woman beaters should all end up like him.","commenter_a":"Likely another abused women who will be in prison for defending herself. I'm so tired of this happening!","post_message":"A Huntsville woman is being charged with manslaughter after her boyfriend died from his stab wounds."},{"comment_id":"10154100013603598","commenter_b":"I have no more words to write about this witch","commenter_a":"Add murdering human life to the list of HER immorality!","post_message":"Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10152962610452894","commenter_b":"Lady, what a dumb comment","commenter_a":"So what. If Bruce Jenner can be a woman, she can be black. People can be whatever they want.","post_message":"Exposed! Spokane NAACP Leader Rachel Dolezal Lied About Being Black — She’s Actually a White Woman from Montana [Photos + Video]"},{"comment_id":"10154380383764091","commenter_b":"Hoe shut up!","commenter_a":"Thank gawd he is out! Worst president ever. They want to praise the south side of Chicago,but have done nothing to help the killings in the city where they got their start. Turned their backs on them","post_message":"\"You've made me proud. You've made the country proud.\" President Barack Obama gets emotional as he takes a moment to acknowledge his wife, First Lady Michelle Obama. @webpagelink"}]
