[{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"1349098891770012","commenter_b":"She butchers infants, rapes ad sells and children for the sex trade and you wounder she is breaking a promise? I find it hard to understand how people still defend or are associating with her name. No amount of fluoride can explain this type of behavior.","commenter_a":"once a hi-LIAR-y always a liar.","post_message":"Breaking yet another promise: What a way to fade into obscurity and irrelevance..."},{"comment_id":"10153254069356130","commenter_b":"God damn feminists","commenter_a":"Kara Capozzi","post_message":"We've got a bearded man who meets his bearded mom, a world-record lady beard and a coiffed competitor on this week's Weird News podcast."},{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."},{"comment_id":"1190828210956634","commenter_b":"Ist: ENFORCE THE IMMIGRATION LAWS, forbidding businesses from hiring ILLEGALS & H1B workers; 2d: DEPORT THE FAKE MUSIM \"refugees\"; 3rd: BUILD THAT WALL!!! 4th: BEGIN DEPORTATION OF ALL ILLEGAL ALIENS! That's enough for the first day. Most of our problems can be solved just by ending ILLEGAL IMMIGRATION!","commenter_a":"RESIGN....","post_message":"GREATEST QUESTION: @webpagelink"},{"comment_id":"1128827183850702","commenter_b":"Hahahaha","commenter_a":"@username Benoit Badra @username thuggglifee","post_message":""}]
