[{"comment_id":"10153722857026336","commenter_b":"How sad! God be with his family at this time.","commenter_a":"Who won the game ?","post_message":"17-year-old Evan Murray was a victim of internal bleeding caused by a ruptured spleen, an autopsy revealed Monday."},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"1038851362838059","commenter_b":"Merry Christmas from your Muslim neighbors! Fighting for #AmericanUnity Like us on FB #AMOT American Muslims in Opposition of Terror","commenter_a":"Merry Christmas, Hillary & to your family!","post_message":"Can't think of a better day than one with family, food, and the best gift of all: a new grandchild on the way! Merry Christmas. -H"},{"comment_id":"1147055582023224","commenter_b":"She is a thief put her in jail","commenter_a":"She is obviously enjoying her new found freedom . Notice there is no hajji .","post_message":"Muslim Welfare Queen Loses Benefits After Cops See THIS On Her Facebook Page..WOW!  Do you agree that Muslims come to America just to soak up free money?"},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10152609996648663","commenter_b":"Do you think, if things progress in the next 10 years as they have, the next generation will have our privileges and freedom? Look at the debt. Look how the 2nd amendment has been attacked. And our religious freedoms. What about the Isis.....we are walking away from the America I have known, and I am 78 yrs old,","commenter_a":"My husband and I are fine, but woe to my grand and great grandchildren in the years to come. They will never understand how truly great Ametica was, they will never know what freedom was...","post_message":"In November, Americans sent a clear message to Washington that they were tired of political gridlock and want solutions and real results to the problems facing our country. Both President Bush and President Clinton used their State of the Union address following difficult midterm elections to acknowledge that they no longer have control of both chambers and that it was time for them to work with Congress. Unfortunately, tonight was another missed opportunity for President Obama and his legacy.    President Obama used this evening to appease his political base and focused on dividing our Nation and using bureaucratic control to run our country with top-down Washington-centered solutions. I believe the key to growing a healthy economy begins by strengthening the paycheck of hard working Americans, putting more money into Kansans pockets, and growing our economy from the bottom-up.     While I was disappointed in many of the President's remarks, I remain hopeful there will be opportunities in the near future to work together to expand trade and fix our broken tax code. I remain hopeful that this President will seize those opportunities just as those who preceded him did."},{"comment_id":"10152692455750950","commenter_b":"Bullshit...gay people are a disease and should be eradicated....I say we boil them alive in acid","commenter_a":"these people are a minority forcing their perversion on everyone else. So when are the pedophiles and rapist going to start marching too","post_message":"LGBT groups march in Boston St. Patrick's Day parade @webpagelink"}]
