[{"comment_id":"2205226956370072","commenter_b":"OK so pack your bags and GO...Your people didn't come here to dominate the world and spread hate.","commenter_a":"He was born in New York and he says he's an immigrant? I'd say this chap has been sniffing too much airplane glue. Yeah, if he wants to be deported, make him the first astronaut on Mars.","post_message":"NY-Born Governor: 'If There is a Move to Deport Immigrants, I Say Then Start With Me' [VIDEO]"},{"comment_id":"1391527697542910","commenter_b":"She's a self-serving, self-promoting blowhard who couldn't care less about anyone but herself.","commenter_a":"Hillary Clinton may have been investigated by the FBI, but Jill Stein has a fucking arrest warrant out on her, yet she still thinks she's a plausible option.","post_message":"Memo to Dr. Jill Stein: There's nothing \"progressive\" about saying that Hillary Clinton is more dangerous than Donald J. Trump, or that Bernie Sanders is a political insider, just because they don’t pass your purity test."},{"comment_id":"707039379420654","commenter_b":"Shut DOWN Sanctuary Cities FUNDING","commenter_a":"NO STRIP TRUMP FROM AMERICA","post_message":"Trump should strip federal funding from sanctuary cities - Agree or Disagree?  For more videos like this, check out Opposing Views Video"},{"comment_id":"1030297853698998","commenter_b":"Wow NOW THIS IS A TRAGEDY! A YOUNG BOY GUNED DOWN FOR NO REASON BY A THUG GANG MEMBER ! I GUESS IF A BLACK MAN KILLS A BLACK CHILD IT DOESN'T MATTER! BUT IF A WHITE COP KILLS A BLACK THUG COMMITTING A CRIME IT'S A BIG DEAL ! LORD FATHER GOD TAKE THIS PRECIOUS CHILD AND HOLD AND CHERISH HIM IN YOUR ARMS ! COMFORT HIS FAMILY AND SEE THE JUSTICE IS FOUND FOR THIS CHILD ! AMEN","commenter_a":"So where is the Black Lives Matter group now?","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank  You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter   @webpagelink"},{"comment_id":"10154983391004138","commenter_b":"@username so all white men are evil? Racist!!","commenter_a":"Being US citizen, I was planning to leave the US for the first time ever to visit Africa and Dubia. Now I can't even leave and visit my love ones that I haven't seen them since 1996. I am Somali American who is proud to be Muslim but also love this country just like many Muslims. . We're all the children of Adam and Eve, one nation under God, we're all immigrants. Ban Donald trump not Muslims.","post_message":"Approximately 500 to 700 people gathered at Terminal 1 to protest President Donald Trump's ban on immigrants from seven Muslim-majority countries entering the U.S."},{"comment_id":"10153694012485779","commenter_b":"Smart women!","commenter_a":"See some women aren't as smart as men","post_message":"Part support group, part grassroots political organization, Republican Women For Hillary was founded in Washington, D.C. where GOP women were commiserating about Donald J. Trump. Meet the Republican women who are backing Hillary Clinton."},{"comment_id":"10153995983694203","commenter_b":"should be a white woman","commenter_a":"Michael Jackson had a deep-seated race problem. Or an Elizabeth Taylor fetish...","post_message":"What the f*ck?"}]
