[{"comment_id":"10153201111658984","commenter_b":"DEPORT ALL OF THEM !!","commenter_a":"And the sad part is that I have no faith this error will ever be fixed.","post_message":"This is just astonishing. I think this revelation will make a lot of people very uneasy..."},{"comment_id":"10156315267360725","commenter_b":"Humble pie lol","commenter_a":"She was getting way to cocky... talking way 2 much... didn't hit gloves before the fight .... she was force fed a slice of humble pie last night","post_message":"Glad to see that Ronda Rousey lost her championship fight last night. Was soundly beaten - not a nice person!"},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"1271439512904593","commenter_b":"Now this is the kind of moms we need in America. This the type of mom who deserves happiness","commenter_a":"wow","post_message":"MOM OF THE YEAR: She says she promised herself she'd do anything to give her kids a normal life."},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."}]
