[{"comment_id":"1393410924025989","commenter_b":"Sam","commenter_a":"They should name the chicks Liberty and Freedom","post_message":"HATCH WATCH CONTINUES: Eagle parents Harriet and M15 have taken turns incubating two eggs. We could have an eaglet hatchling soon. (Video courtesy of Dick Pritchett Real Estate) @webpagelink"},{"comment_id":"10156546943220354","commenter_b":"THIS SHAMEFUL........","commenter_a":"What a piece of shit","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10153055382512061","commenter_b":"That woman. Was disgusting","commenter_a":"I'm sure there must of been a 'medical' term for the reasoning....","post_message":"\"I asked him why I couldn't do it and he said, you're black.'\" Black delivery driver replaced after customer wanted whites only: @webpagelink"},{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"10153136894823145","commenter_b":"Bottom line do what the officer says and don't talk back. The girl kept running her mouth to him. My child would have got in trouble by me for talking back the way she was.","commenter_a":"The only good cop is a dead cop","post_message":"Here's 5 things to know about the Texas officer seen on a viral video breaking up a disturbance at a pool party. #WFTV Watch the video here: @webpagelink"},{"comment_id":"10154336325219062","commenter_b":"Bradley Darrell see above message..","commenter_a":"To suggest the Pope has a liberal agenda is just showing ignorance. Conservatives claiming the Pope is pro-gay, pro-abortion, anti-marriage, blah,blah. The Pope has never said he agrees with those things, he has said it's not his place to judge others who have that life style. Just like Jesus would do today. He loves everyone without reservation. Something sorely lacking in today's society.","post_message":"Pope Francis says addressing climate change `can no longer be left to a future generation'"}]
