[{"comment_id":"10153229424353352","commenter_b":"What a crock of shit. She's a crazy bitch who needs life in prison.","commenter_a":"Postpartum depression is a real illness. This women obviously is in psychosis; not recognizing her action at the time. Praying for these babies, her husband and her. When she is in her right mind; she will have to live with this action for the rest of her life. Also, if her husband and doctors were aware of her illness; they should also be accountable. A women this sick should never be unattended with her children. I pray for these babies health.","post_message":"Army wife says she slashed throats of her three crying babies with kitchen knife to keep them from disturbing her Special Forces husband"},{"comment_id":"990316741094881","commenter_b":"Fuck her","commenter_a":"Never heard of her.....moving along now","post_message":"Was she right??"},{"comment_id":"10153751332879369","commenter_b":"Ok, and most of those are probably illegal aliens .. lol","commenter_a":"Well there's tens of thousands of people for every Ex-American that leaves. So...bye.","post_message":"Americans are renouncing their citizenship over this."},{"comment_id":"10154673400449062","commenter_b":"Nope","commenter_a":"Not only are we erasing our history, but this change will cost a lot of money to redo signs, get new uniforms etc. The district has $107 MILLION shortfall because of the Robin Hood Plan. I won't have a job next year, and campuses will be forced to do more with less in many areas. So many reasons that this is NOT a good decision. If we ignore our history we are doomed to repeat it!","post_message":"JUST IN: HISD votes to rename 3 schools named after Confederate leaders. Details: @webpagelink"},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"987087694644317","commenter_b":"Babies gotta eat . If you don't like it don't look . If you want to fight something, fight the laws that deal with drunk drivers . Come on America WAKE UP !","commenter_a":"Well said @username","post_message":"Dozens of mothers staged a \"nurse in\" in front of the state Capitol building today in nationwide movement. What do you think? A. I'm glad these moms are standing up for their rights B. Attention to \"discrimination against breastfeeding\" is needed C. This wasn't needed D. That's fine, we just don't need to see it E. Your own answer"}]
