[{"comment_id":"1170305866326090","commenter_b":"@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"1569633279990452","commenter_b":"U a fat bitch.u hater.k.k.k.","commenter_a":"Oprah is a racist bitch","post_message":"Way to go Carrie Underwood!"},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"754838434706734","commenter_b":"Oh God, the taxes, the illegals working for him, the handicap man with evil intentions, and now a rape! Next anything against Mr. Trump, please, lol Your evil would not be able to destroy Mr. Trump! Don't waste your time!","commenter_a":"Wtf ever stop grasping","post_message":"BREAKING: Trump Engulfed In MASSIVE Rape Scandal   This could end his campaign right now. Let's show our support.  Can we get 30,000 'LIKES' for Donald Trump?"},{"comment_id":"1721863561367662","commenter_b":"Hopefully to die of a stroke while receiving anal from pence, while he dies of a heart attack from actually getting his tiny penis erect.","commenter_a":"Lol... Wow at all the hate. Smh... Do you all think that the Muslims that come over here are going to accept your Christianity.... Lol.... Maybe some researching on how they are behaving in other Country's with the mix of the two is in order. But you all continue with your hate and see where that takes you.","post_message":"Reminder: If Trump attempts to discriminate against Muslims, we will sue."},{"comment_id":"10153721851426178","commenter_b":"People are waking up. They don't need TV or papers anymore,until the net is more strangulation than it is now, serious voters make up their own minds and look at all sides of issues important to them. They are no candidates that one can agree 100% with but at least there are many out there there one can reconcile most of their views with and throw support that way.","commenter_a":"I have no use for the networks...","post_message":"Despite being the biggest story in the pro-life movement since Roe v. Wade, the networks couldn't care less."},{"comment_id":"10154774162911323","commenter_b":"@username, since you agree with @username, how does one load a machine with votes?","commenter_a":"\"The people have spoken\" is such an unfortunate choice of words when they gave your opponent in excess of 2M votes more than you.","post_message":"\"We believe we have an obligation to the more than 64 million Americans who cast ballots for Hillary Clinton.\""}]
