[{"comment_id":"10153221007429575","commenter_b":"Lmao. Guess who isn't surprised. I just wish I was there. There'd be holes in some stupid flat brim hats.","commenter_a":"Where's Jackson? Where's Sharpton? Where's Eric Holder? Where's the NAACP? Where's the constant 24/7 national news coverage? Oh wait, the attackers were black and the victims were white? Well in that case, move along, no big deal, nothing to see here.","post_message":"\"Their children and grandchildren were running around while we were fighting and they don’t know what’s going on and there’s blood everywhere.\" A party at an Ohio Chuck E. Cheese's got out of control after the store manager told guests the photo booth wasn't working."},{"comment_id":"10153369191183984","commenter_b":"Yes it is.The best we can do is try to covert those that are a,ready here. I'm not sure how many would even listen.Its a job for the Holy Spirit. In the mean time we should stop immigration of Muslim population into the USA . When it reaches a certain percentage than there will be major problems. Satan is a master at deception and he came to kill steal and destroy.Jesus came to give life and give it more abundantly .","commenter_a":"OOOOH boy!! are we sitting by and letting this happen before it grows too late? Hell no!!!! Anyone interesting to get rid the prez, say aye!","post_message":"Wow, after watching this, I've got to wonder how this guy can say what he does and get away with it! Unbelievable! Do you think that radical Islam is the threat this woman claims?"},{"comment_id":"1800130780216983","commenter_b":"Any misguided female.","commenter_a":"You should not talk about lying crooked murdering KILLERY that Way!,, her day is coming in jump suit in prison!!!!!! GOOOOOOOOO TRUMP TRUMP!!!!!","post_message":"\"Vote your conscience.\" Ted Cruz declines to endorse Donald J. Trump during his speech at the GOP Convention: @webpagelink"},{"comment_id":"10156215776400354","commenter_b":"The grisly death of a human life, which is abortion, has a dedicated, zealous following who treats the death rite in a religious manner. Clearly, there's more at work here then just the convenience of sloppy people. Imagine an America with 19 million more black people, virtually all of which would vote Democrat. Things would be much different. The 55 million human lives lost since '73 would make for a vastly different nation. Democrats commit crimes against humanity in many different ways, and clearly abortion is the most depraved and reprobate of them all.","commenter_a":"They need to harvest her vagina","post_message":"“Planned Parenthood is proud of its limited role in supporting fetal tissue research.”"},{"comment_id":"10153128633786323","commenter_b":"I think you're getting a bit sadistic Sanchita. \"Lowered into vats of acid\"? You should hear yourself. That's inhumane. They should be put in prison, like they already are. And women CAN rape, though sadly this country's rape legislation is inadequate when it comes to women-perpetrators. What about a woman-on-woman rape? Or when a woman in her 30s rapes a 13 year old boy?","commenter_a":"Stop demonising men","post_message":"“I began this film with a narrow focus: ‘Why do men rape?’ I discovered that the disease is a lack of respect for gender. It’s not just about a few rotten apples, it’s the barrel itself that is rotten.”"},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."}]
