[{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"10154683405811756","commenter_b":"Well what can one expect when they compromise their values to support an incompetent candidate for president for the sake of the Republican Party! I thought you all take an oath to do what's best for our country and the American people. Not sure how Trump could possibly be considered part of this equation!","commenter_a":"@username, what we were talking about","post_message":"It was already a difficult election for down-ballot Republicans, a top campaign aide says. \"The bottom is starting to fall out a little earlier than expected.\""},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"1086256118053035","commenter_b":"So we leave our selves defenseless so that some kid can study underwater fire fighting?","commenter_a":"Spending more money that we don't have, Thank You, so very much!","post_message":"The Perkins Loan Program can be a critical lifeline for many low-income students. I’ve joined 53 of my colleagues, including Senator Robert P. Casey, Jr., in calling for its reauthorization. Learn more below."},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"10150839207834999","commenter_b":"@Gabrielle Nicole Alvarez By that logic, any psychologist whose job it is to draw such distinctions about attraction is a paedophile and any feminist knowledgeable about different types of abuse is a rapist. @@username hebephilia concerns the early stages of puberty, so ephebophilia, attraction to mid-late teens, might be more fitting.","commenter_a":"And now we wait for the complaining pedophiles...","post_message":"Miss Teen USA is ditching bikinis for athletic wear."},{"comment_id":"1746288005610861","commenter_b":"Women do not get kicked out of restaurants because their children cry. What world do you live in ?","commenter_a":"Whatever. If that kid was crying in the middle of some restaurant & the owner told the mother to leave for the sake of the rest of the patrons he'd be applauded. Taking a baby to a political rally is as foolish as taking a baby to a Slayer concert. The exception being Slayer fans are far more courteous than the average politcal junky.","post_message":"\"I think she really believed me that I love having a baby crying while I'm speaking. People don't understand.\""}]
