[{"comment_id":"10155348213273132","commenter_b":"Oh boo hoo! Get over yourself! The world doesnt revolve around Queen B! Plus she is not the same artist she used to be... of course her sister would be the one to start the unnecessary drama lol","commenter_a":"Beyonc is not all that any more ADEL IS ABSOLUTELY THE BEST SINGER EVER Beyonc did not get snubbed She lost GET OVER IT","post_message":"have only been two black winners in the last 20 years for album of the year.'"},{"comment_id":"1018817644877956","commenter_b":"#STOPHATEANDFEARMONGERING #dumpTrump #VOTEDEMOCRATS","commenter_a":"I have a bet going that Trump declares bankruptcy again after he loses the nomination. I hope he loses everything and all his foreign factories close down. DUMP THE TRUMP DUMP THE TRUMP DUMP THE TRUMP","post_message":"You reap what you sow."},{"comment_id":"10153541203558690","commenter_b":"She's a recovering alcoholic...... That says it all right there","commenter_a":"Living within your means should not mean living in a cardboard box or struggling to pay for minimum needs! What a selfish ignorant thing to suggest! Low wages determine the quality or lack of it in your life, it also means absolute lack of choice!! It absolutely sickens me to read the suggestion that if you are working and struggling it is automatically your own fault! Life happens and not always by our conscious choice! There are many many external influences that can alter your existence negatively! The American dream is a distant illusion for millions of people! In many instances through the greedy manipulation of conglomerates and the loaded banking system! Please don't give me the tired ' think and grow rich ' schemes! I am an old chook, I've known uber wealthy and the other end of poverty throughout my life! Wealth is mostly ' built upon the ...","post_message":"While the debate over minimum wage continues in the US, Emilia Stancati , a 50-year-old who has worked as a waitress for most of her life,  falls further into credit card debt as her  job fails to cover her bills.    Watch the latest episode of Hard Earned:   @webpagelink"},{"comment_id":"10153544562557411","commenter_b":"Maybe if he didnt talk back, laugh and pull away, they would have let it go!!","commenter_a":"How can u steal FREE milk?? Lol smh....","post_message":"'This is ridiculous... this is beyond embarrassing... he's at home for 65 cents.'"},{"comment_id":"10153584523586336","commenter_b":"I'm not an Alabama fan, but if I was, I'd be truly upset with this video..... Not one time did those girls say 'roll tide'.... I'd ban it too!! GBO #rockytop","commenter_a":"I just love when someone judges something they know nothing about.","post_message":"The recruitment video has been criticized for lacking diversity and objectifying women."},{"comment_id":"623158744555639","commenter_b":"Oh my that thing looks scary","commenter_a":"Adriana R. Eiro","post_message":"A baby chameleon is born"},{"comment_id":"1099626483393732","commenter_b":"RINO revolt began with Romney. We shall soon see a series of similar dogs.","commenter_a":"Ventura is a jackass!","post_message":"Someone other than Michael Bloomberg is considering a run for president.  Could this controversial figure make an impact on the 2016 race?"}]
