[{"comment_id":"801744643293915","commenter_b":"#HillNo #HillaRigged #NeverHer #LatinasForBernie","commenter_a":"hillary is going to get the majority of bernie voters to vote for her in the end and trump will be squashed.","post_message":"Of those surveyed, 74% said they have an unfavorable opinion of Donald J. Trump."},{"comment_id":"10153784799867894","commenter_b":"Andy needs to fire her ! #GoodBye2BasicBitches","commenter_a":"@username another storyline to stay on #RHOA","post_message":"It’s Really Over! Cynthia Bailey Announces Plans to Divorce Peter Thomas: ‘I Just Don’t Want to be Married Anymore’"},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"},{"comment_id":"10153401968107411","commenter_b":"GOOD..,TIRED OF SMELLING DOG POOP ON A HOT SUMMER DAY we have filthy nasty neighbors with too many dogs...they don't clean the poop and it FEEDS RATS PEOPLE...","commenter_a":"Esoj Ornelas","post_message":"Mayor Emanuel and several Chicago aldermen are proposing a new ordinance that calls on property owners to clean their lots daily to keep them free of feces -- or face fines up to $500."},{"comment_id":"10153320749437439","commenter_b":"Appeasement increases Islamofasism. Now, go study, @webpagelink","commenter_a":"I can't believe you. Yes you are free to be as stupid as you want. But one of these days you are going to be the cause of the death of some innocent person. Shut up and go away you dumb bitch.","post_message":"Going live on @jaketapper The Lead on @CNN to discuss jihad attack on free speech #garlandshooting"},{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."}]
