[{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""},{"comment_id":"1660263367594109","commenter_b":"May be we should shove firecracker up their A-- & see how they like it. God bless America","commenter_a":"Awesome. ..thank you...","post_message":"\"If you have the right to burn my flag, then i have the right to kick your ass.\" - Creed Fisher"},{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."},{"comment_id":"1356822761024859","commenter_b":"I agree. What a Bitch.","commenter_a":"shame all those parents whose children have been murdered by Obama can't sing to their dead children... wake up this man is a bastard","post_message":"This is the most beautiful thing you will see all week."},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10156140498930206","commenter_b":"She will definitely turn heads if she gets into the debates.","commenter_a":"@username has the knowledge, skills, and class of Reagan. She's disarming when she speaks, and able to get persuasive messages about individual liberty across to people who instinctively resist it. If she's nominated by the GOP, I think she has the best chance to win. If she's elected, she could invigorate the conservative/ libertarian movement and put our nation back on course.","post_message":"Today in Barrington, New Hampshire I toured Turbocam International and heard from voters ready for citizen leadership in Washington at a packed townhall. Join our team today. @webpagelink"}]
