[{"comment_id":"10152940577256336","commenter_b":"Enough of our young men have died. Keep them home and stop certain trash from coming into the USA. Then we won't have to worry about them.","commenter_a":"I heard today that he doesn't have a college degree. Low hanging fruit for the press to grab onto. Better fix that before he enters the national arena.","post_message":"Wisconsin Gov. Scott Walker, a potential 2016 Republican presidential candidate, said Sunday he is open to sending U.S. troops to the Middle East to defeat ISIS."},{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"10153470522401545","commenter_b":"I totally agree. It won't happen because it generates big money. A bunch of sick people","commenter_a":"And Porn is still accepted & allowed in our country & world ?!?! Porn is a horrible addiction causing harm to others. I want our elected officials to get porn out of our lives forever !","post_message":"In police documents obtained by WFAA, school bus driver Leonard Bradford told investigators he swam in a public pool with 40 to 60 children in the summers of 2014 and 2015. According to police, Bradford admitted to investigators that he purposefully rubbed his genitals on five girls."},{"comment_id":"1666828886940954","commenter_b":"when someone finally makes sense .. THANK YOU SALMAN RUSHDIE!","commenter_a":"Every thing they say here is an outright lie. There is Huffpoop id evil. not a shred of truth about any of these.","post_message":"Let's put Hillary Clinton's emails into perspective."},{"comment_id":"10153190279501336","commenter_b":"Haha!","commenter_a":"Oh Lord, they'll hug the bark off the tree over this","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""}]
