[{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153955448341350","commenter_b":"She's a cold, calculating bitch.","commenter_a":"From her big warm embracing feminine heart ... are you kidding me? Voting for Hillary because she is a woman, makes no sense at all.","post_message":"\"I want my president of the United States to make decisions on my behalf based on her experience, her command, her intelligence, and from her big, warm, embracing, feminine heart.\""},{"comment_id":"1561579034151058","commenter_b":"She's wile annoying","commenter_a":"@username .. This is so Gemma Gallanagh","post_message":"\"By the time I put it together there was nothing I could do to stop him.\""},{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."},{"comment_id":"1214139651951673","commenter_b":"What a crock! Mr Trump is not a racist","commenter_a":"Sorry Jake but this isn't just about your skin color.it's also about a economic plan which the republican party has that is unfair. A foreign policy that won't work. -just about any plan they come up with is for the upper class.about much more than just you.","post_message":"18-year-old Jake Anantha was a Donald J. Trump supporter until he was kicked out of a rally. Anantha says he was being \"profiled\" and wants an apology. Watch more here: @webpagelink"},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."},{"comment_id":"10154162666938812","commenter_b":"Omg Hillary is a lier and got Americans killed! She only admits lieing when completely and totally caught","commenter_a":"Hillary should win Not that dumb Trump","post_message":"JUST IN: American Samoa Democratic Party says Hillary Clinton has won Democratic caucus. abcn.ws/1L42Yyx"}]
