[{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?!   This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES.   They sound so terrified. :("},{"comment_id":"1227346897337998","commenter_b":"Idiot sick woman","commenter_a":"Good thing we have wikileaks and Project Veritas for the truth. Trump/Pence 2016 #draintheswamp #hillaryforprison #spiritcooking","post_message":"JAY Z said he doesn't have any \"ill will\" toward Donald J. Trump, but he \"cannot be our president.\" Before introducing Hillary Clinton onstage with Beyoncé at the Cleveland, Ohio, rally, Jay Z repeated this twice: \"Once you divide us, you weaken us. We're stronger together\" @webpagelink"},{"comment_id":"10153405102629255","commenter_b":"Josh Duggar,Dennis Hastert,who's next.. Gawd let it be Ted Cruz!","commenter_a":"I think he's another Sandusky","post_message":"This scandal is getting dark—fast."},{"comment_id":"10152698672020927","commenter_b":"This is the same dolt that though islands could over-populate and flip over.......Donkey","commenter_a":"Another out of touch dem.","post_message":"The GOP budget will cause riots?"},{"comment_id":"1059208864172624","commenter_b":"Sounds just like a female lol","commenter_a":"Obviously. Ignorance is bliss? But when will they see who he really is. A narcissistic sociopath. Will to nuke anyone who hurt his little feelings","post_message":"\"People who support Donald J. Trump are people who should be respected for how they feel, but I worry that they don't understand that they're being scammed. And that they're being scammed by someone who's really good at it.\"  - Mika Brzezinski, co-host of Morning Joe"},{"comment_id":"10153006205351051","commenter_b":"I would have shot him.","commenter_a":"I am glad he did what he did. This is what you do instead of standing around recording.","post_message":"This dad was driving his daughter to school when he saw a police officer on the ground with a guy on top of her. The guy was reaching for her gun. The dad didn't hesitate."},{"comment_id":"421728768009004","commenter_b":"Burn her as a witch","commenter_a":"So intelligent, and powerful women","post_message":"Share if you're Ready For Hillary!  Get all the best HRC coverage you need here:  @webpagelink"}]
