[{"comment_id":"1724147734520564","commenter_b":"First Ladies always ware pearls. Hers are a double strand!","commenter_a":"She's no lady she is only 1 step above hillary Clinton in being the most pathetic excuse for a first lady","post_message":"Has Michelle Obama been a good First Lady?"},{"comment_id":"10154046888226167","commenter_b":"If their lesbians,where does the sperm come from?","commenter_a":"Did he say lesbians pouring blood, and eating milk and sperm? ahahahaha!!!","post_message":"Trump ally Alex Jones claims Secret Service is terrified of \"devil worshiper\" Hillary Clinton because she \"acts like Linda Blair\" and \"flops around on the ground\" and \"spits at them\" and \"stinks!\""},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"1756908037896244","commenter_b":"No! just let them leave our Country.","commenter_a":"Mega bucks to play ??? Go out and really work !!! Ha ha!","post_message":"If they want to disrespect our nation, then they can leave. Anyone who doesn't want to stand for our national anthem on game day should be kicked from the league. Do you think these ungrateful players need to be taught some respect?"},{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."},{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"}]
