[{"comment_id":"10154662154026323","commenter_b":"God help America and American people if these two women get into the White House.","commenter_a":"The nastiest of women. Apparently Nasty women are UN shills hell bent on overthrowing the rule of law in America, and worldwide. Cunts.","post_message":"“Get this, Donald. Nasty women are tough, nasty women are smart, and nasty women vote, and on November 8, we nasty women are going to march our nasty feet to cast our nasty votes to get you out of our lives forever.”"},{"comment_id":"10153103899511336","commenter_b":"HEHEHEHEHEHEHEHEH YEP THEY DO BELIEVE WE THE PEOPLE ARE STUPID\" WHAT A INSULT TO OUR INTELLIGENCE GRRRRRRRR....@webpagelink","commenter_a":"I didn't vote for obama or agree with any of the daily mistakes this administration makes. With that being said, we the people must find a way to be heard and stop any deal with Iran. Our congress can't let one man with no foreign policy skills, put the world in danger. Everyone knows that Iran can't be trusted and after the Bergdahl disaster, can we trust Obama.","post_message":"The U.S. is considering letting Iran run hundreds of centrifuges at a once-secret bunker in exchange for limits on centrifuge work and research and development at other sites."},{"comment_id":"10154235366227060","commenter_b":"Yea and Mardi Gras day they'll be showing their breasts for beads!!!","commenter_a":"Yall be safe.....show them","post_message":"The Women's March New Orleans begins now from Washington Square Park."},{"comment_id":"1149152748439068","commenter_b":"Kegels engaged automatically","commenter_a":"not a big white shark, just a fox shark","post_message":"Just stay calm, nothing to be afraid of ..."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"1865190080165091","commenter_b":"What about the serial killers child molesters child rapists murderers here in the United States we should get rid of all of them as well have them sent somewhere so they can stop all this craziness here and yes there are many Savages right here in the United States","commenter_a":"These people are f--king sick get them out of our Country.","post_message":"Muslim Nurse Mutilates Little Girl’s Genitals, What She Told Her Is Even SICKER"},{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them \"good 'ole white boys\" for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."}]
