[{"comment_id":"1158459407522812","commenter_b":"Liberal ay, so telling you that Trump broke the pledge first, makes him a liberal.","commenter_a":"Why don't you Trump people shut the hell up about Cruz, and focus on Killary for a change?","post_message":"I agree with Phil Robertson \"The Duck Commander\"!"},{"comment_id":"1185974561486681","commenter_b":"Motherfucka must of been hella hungry","commenter_a":"Ys Ir","post_message":"Ladies, would you let him?. #WSHH"},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153526082496323","commenter_b":"NASA erased 'accidently' the high resolution tapes from the 1st moon landing in the 80's .lol .","commenter_a":"They never went to the moon though","post_message":"Even astronaut Buzz Aldrin had to file travel expenses – for a less than astronomical $33.31."},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"1754158708182258","commenter_b":"Rip officer...fly high... You will be missed","commenter_a":"Whoever is doing the laughing get off this page very disrespectful","post_message":"The funeral service begins for Detroit Police Sgt. Ken Steil. Watch along live as loved ones and fellow officers remember his life: Read more: @webpagelink"},{"comment_id":"608374436000078","commenter_b":"ignorant, they are so wrapped up in their own little world, they have not clue what the average citizen has to deal with, a wall needs to be built around California to keep all the fruits and nuts in, then the rest of us would not have to listen to their dribble","commenter_a":"She's an idiot actress who is dumb enough not to realize she is committing career suicide when they get involved in politics. I dare all TRUMP supporters to blackball her shows and .movies","post_message":"Game of Thrones actress Sophie Turner (Sansa Stark) attacked Trump saying that if she could fix the world, she would kick him \"out of the country. And we’d create a wall around him so he couldn’t escape.”"}]
