[{"comment_id":"10155050570035329","commenter_b":"I'm the biggest pussy out","commenter_a":"@username you have to read these!! Ouch","post_message":"Exposed nerves, unexpected orgasms, and a whole lot of blood."},{"comment_id":"10154061542714411","commenter_b":"\"Hey, Jews are getting their own country, let's all go be our typical fuckhead selves and try to butcher them all.... we'll need a name, someone go digging around and come up with something while I strap a bomb to my kid\" (The founding of Palestine).","commenter_a":"O God!!! hahahahahaha...Ignorant Mr.MP...","post_message":"Letters matter"},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."},{"comment_id":"10154950558833256","commenter_b":"How on earth can you make this RACIAL?. It grabs EVERYONE!","commenter_a":"I wish I can say I am shocked; but just about every one black who's trying to make a difference is going through it' other races probably are also' its horrible '","post_message":"Calling the practice of intercepting cellphone information secretive and widespread, a federal lawsuit alleges Chicago has an \"arsenal\" of cell site simulators (or \"Stingrays\"). When deployed by police, these devices capture data from any phone in its range — not just the intended target.  \"Government spying on its citizens without appropriate judicial oversight is inconsistent with the freedoms guaranteed by the Constitution,\" said Jerry Boyle, a Chicago attorney who brought the case."},{"comment_id":"10156075719260389","commenter_b":"kill the rapist please","commenter_a":"The Military is a disgrace. What the heck has happened to our military?","post_message":"“Your behavior is inexcusable and incompatible with the high standards of performance, military discipline and operational readiness of Special Forces,” the memo states."},{"comment_id":"1701996636715698","commenter_b":"@username What kind of murder,Cuz whites kill in record numbers in one single act of violence.","commenter_a":"Imagine the riots and violence that would be rampaging across the country had police shot four African Americans overnight - even were they all legitimate uses of force.","post_message":"Ambushed for wearing the badge: Four police officers in cities across the country were shot overnight.   There’s a manhunt for a suspect who shot and killed San Antonio Detective Benjamin Marconi as he sat in his squad car outside police headquarters. @webpagelink"},{"comment_id":"1110149189061308","commenter_b":"criminals do know each other and apparently marry their offspring to each other's families!","commenter_a":"Father a criminal politician, Ex., asked for Clinton's support in Mizzou 2 years ago, not to be, and there is some concern that Hillary supported with information received as Secratery of State, investments made by Mezvinskey the younger, including a deep water construction opportunity...............!","post_message":"Allen West Republic"}]
