[{"comment_id":"1566749223612191","commenter_b":"Make no mistake Maggie I no where near put A women that murders children on the same level as animals. ANIMALS ARE BETTER THAN THAT.","commenter_a":"If a woman has an abortion she should IMMEDIATELY BE FIXED SO SHE CAN NOT EVER KILL ANOTHER CHILD.","post_message":"Abortion is MURDER!"},{"comment_id":"639736896151349","commenter_b":"That's great and all but how do these women make money now?","commenter_a":"yeah and there'll be some bleeding heart liberal who'll be out fighting for robots rights and defending human trafficking because 'pedophelia is a disease!' and we 'shouldn't judge'.","post_message":"Experts believe that cyborg prostitution will help ‘clean up the industry’ by reducing sexually transmitted diseases and ending sex slavery."},{"comment_id":"529761760538579","commenter_b":"You ruined it","commenter_a":"'@username @username Sam Finch We get the joke :)","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154026224212869","commenter_b":"I agree! There are plenty of legitimate issues that should convince anyone paying attention that Clinton does not belong in the White House. I feel like spinning 100 different (and in many cases overwhelmingly mean spirited) conspiracy theories makes the relevant confirmed issues on either side carry a lot less weight. I'm not saying that I don't think her health may be an issue, or even that it shouldn't even be written about, but there are 100 different reasons for a vehicle like that to include a wheelchair lift.","commenter_a":"Is anyone else tired of these feeding frenzies, I for one am.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"830478970320859","commenter_b":"Send them all back to where they came from.","commenter_a":"Well Rush what about the Amish kids that started it in Ohio?","post_message":"Rush is right: Obama’s amnesty is a serious national security issue!"},{"comment_id":"541637449341656","commenter_b":"Pls sign here here and here","commenter_a":"Wow, big shock. The state who elects the most insanely leftist politicians went for Trump. I wonder why. I can't wrap my head around it. Man, so bizarre.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1739251936290298","commenter_b":"exactly. Women belong in the kitchen, this is stupid.","commenter_a":"Great. Ahmed, the suicide bomber, will be next. Anything to appease the muslims, right?","post_message":"The six-year-old girl is the first-ever Afghan Muppet, and she is aimed at promoting female empowerment in Afghanistan."}]
