[{"comment_id":"10154042885608352","commenter_b":"N BITCH U HELLA UGLY..LOL.LOL.N GET UR HAIR FLAT IRON POOFY HEAD HOE!!YEA U A DIRTY HOUSE HOE,YEA U CAN STAY MAD,WAY N ALABAMA. TALKING SHIT..YEA U WOULD...","commenter_a":"SHE TALK ALL THAT. SHIT,N SHE A PUNK ASS HOE!!!MAKE US WOMEN. LOOK. BAD N US WIFE'S....DUMB ASS!!","post_message":"Mo'Nique Defends Letting Her Husband Have A Side Chick! Says 'That's When The Relationship Is Real'"},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"10154153489278984","commenter_b":"They are grasping at straws! VOTE TRUMP!!","commenter_a":"all president getting sworn into office! before giving testimony in a courtroom! WAKE UP AND THINK SHEEPLE","post_message":"Donald Trump just addressed some of his loudest critics head on, and it's sure to have his supporters grinning... Do you support Donald Trump?"},{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"}]
