[{"comment_id":"10153431181609497","commenter_b":"Get rid of her for your own future. You can never be president if you only eat pizza.","commenter_a":"Dad's girlfriend orders pizza every night.","post_message":"\"One time, she even let us get cheesy bread and watch an R-rated movie.\""},{"comment_id":"10156321873895725","commenter_b":"Global warming is responsible for baby dick","commenter_a":"iIN United States there plenty terrorist as illegal immigrants driving yellow taxi in the cities of United States taking the jobs from American people and ready to do bad things to us here that's why we need DONALD TRUMP to deport all of them","post_message":"As President of the United States, my top priority would be to keep America safe & strong! Thank you for your support."},{"comment_id":"803355223130806","commenter_b":"we love newt, let the whole world know about her shady crap , we don't care about your tax release, she has the nerve to talk crap about that and look at her hiding server deleated emails, noooooo way. go TRUMP","commenter_a":"Good Luck with Today President Trump!!Go Gently, but be Strong!! Stand Your Ground but be Humble!! America needs You!!","post_message":"\"Speaker Newt Gingrich pointed out the pay disparity between male and female executives at the Clinton Foundation, where men earn 38 percent more on average, before telling viewers that Trump is more pro-woman than the former secretary of state. He also noted that this likely would come as a \"shock\" to many voters.\""},{"comment_id":"10154876019385329","commenter_b":"Better fat than a dumb Mexican. Have fun once trump is elected. Fool. Lol","commenter_a":"\"Fat\" the word you are looking for is \"Fat\"","post_message":"Simone Mariposa told BuzzFeed News she created #WeWearWhatWeWant to \"highlight plus-size girls making unconventional fashion choices, and looking amazing\"."},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"10153190295751336","commenter_b":"Nothing better than a HOT conservative woman.","commenter_a":"Looks like the Catatonic Parkway. No cowboys in that area, maybe a few cowgirls, but they ride English.","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."}]
