[{"comment_id":"10154589090613132","commenter_b":"I thought the same thing...wow, she's just like every other woman!!","commenter_a":"I'm not gonna lie, I'm glad her mascara runs too hahaha!","post_message":"A pregnant Blake Lively and husband Ryan Reynolds were caught locking lips in Rhode Island over the weekend."},{"comment_id":"10153837280246051","commenter_b":"@username I totally agree with you! If people would not hire illegals at the first place, illegals would not be in the USA!","commenter_a":"The end! \"Beating the system\", fucking seriously! There is a system for a reason. How many people do it the right way and how many are unable to do so because of people like her and her family \"beating the system\"! Her scholarship should be revoked!","post_message":"This Yale-bound valedictorian stood in front of her entire school and made an announcement that stunned everyone:"},{"comment_id":"626971257493453","commenter_b":"Kiss our asses","commenter_a":"he should be charged with murder","post_message":"George W. Bush was right, there were weapons of mass destruction. We always had his back. He is a great man, and a true patriot. Do you support George W. Bush?"},{"comment_id":"1865774367000002","commenter_b":"If you think that way then you should leave as well. This Country actually belongs to the Native Americans.","commenter_a":"I am a lifetime member of the Sons of the American Revolution. My ancestors landed in 1732 and father and son fought in the revolution. All of you republicans whose family landed AFTER that revolution are not \"pure Americans\" and must get MY permission to remain. Ban half breed Americans..only the descendants of REAL patriots may remain","post_message":"\"We're not going to shut up. We're going to resist.\""},{"comment_id":"10153149843920090","commenter_b":"NOT this woman ;)","commenter_a":"too bad all the women will vote for her, for no reason other than shes a woman, like the minorities voted for Obama...with no reason other than he is black","post_message":"Share this with your friends & neighbors—take the pledge to Stop Hillary! Start here: @webpagelink"},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"},{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."}]
