[{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"1233839776660853","commenter_b":"Bet they sold a lot of papers....","commenter_a":"Couldn't care less.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"1628197660735785","commenter_b":"Typical woman. Always find something to complain about.","commenter_a":"I see no bacon...this game sux","post_message":""},{"comment_id":"10154473701808812","commenter_b":"Good for her! This is the American Dream at its finest. All you haters who think this country belongs to you and all immigrants are criminals and steal your jobs can suck it! I was born here and will die for my country if necessary and this is what I will fight for. The right for EVERYONE to pursue life, liberty, and happiness. God bless you little girl!","commenter_a":"This is amazing.","post_message":"Texas high school valedictorian reveals secret in graduation speech: \"I am one of the 11 million undocumented immigrants living in the shadows of the United States.\" @webpagelink"},{"comment_id":"10152964410961130","commenter_b":"It's Bush's fault Duh","commenter_a":"If they'd have shot him it would be all because he's black & a victim of the evil white man lol","post_message":"Have you seen this man?"},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""}]
