[{"comment_id":"10154376947093271","commenter_b":"Kind of reminds me of Walking Dead when Negan took the mattresses and lit them on fire. That was only a TV show and we screamed at the injustice. No need to take things away from people. Especially the homeless in this cold.","commenter_a":"This is really sad... sad that the mayor decided to enforce the camping ban, sad that the police department officers don't tell their higher ups that they aren't going to be cruel and steal from citizens, and sad that a majority of the public is just barely realizing that the mayor and his police force has been doing this for a long time now. I read each and every comment, as well as the replies to comments... to those that think all the homeless people choose to live on the streets and refuse to go to the shelters, stfu and learn something before you speak... talk to a couple of them, see them, really SEE them, before you pass judgement. To those that are outraged at what they read, speak up... take a stand... help out someone just because it's the kind thing to do. And to those who are ...","post_message":"After video surfaced of officers taking blankets away from the homeless during a cold Colorado night, Mayor Michael Hancock is now speaking out."},{"comment_id":"10152993326411336","commenter_b":"bahahaha hahaha........I love your comment....exactly","commenter_a":"So we agree....no gun is responsible for a crime.","post_message":"“No religion is responsible for terrorism. People are responsible for violence and terrorism.”  Moments ago, President Barack Obama delivered remarks at The White House Summit on Countering Violent Extremism. @webpagelink"},{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"10153822554726800","commenter_b":"Linda you sound like a true feminist. If feminist hated all women who dressed nice and looked pretty. She is an attractive woman. I won't comment on her alternative income or employment. Selling your vagina to make money is about the most American and feminist thing I can think of. It's like eating an apple pie with a slice of American cheese on it that was baked by a bald eagle complimented by a nice mason jar of Kentucky moonshine.","commenter_a":"If President Obama needed a raw onion in the podium, what was John Boehner's excu.. er, where was his raw onion stashed the millio... um...many times he cried over far less than dead kids?","post_message":"Andrea Tantaros on President Barack Obama's tears during his speech on gun violence: \"I would check that podium for, like, a raw onion or some no more tears. I mean, it's not really believable.” @webpagelink"},{"comment_id":"10153843965931336","commenter_b":"Great va is screwed bc dc is so close no refugees should be allowed period","commenter_a":"Wow, it was 24 a few hours back. Looks like a rebellion.","post_message":"LATEST: 30 U.S. governors are now opposing or refusing to allow Syrian refugees into their states. @webpagelink"},{"comment_id":"702034983304927","commenter_b":"So you ladies that said you'd leave the country, hurry and get the hell out. We don't care for you or need you. Good bye","commenter_a":"These so-called celebrities exist only too the insignificant people they entertain","post_message":"Yes, it's as bad as you imagine..."},{"comment_id":"10156335806925725","commenter_b":"ahahah im sorry you said lead... omg kill yourself please xD","commenter_a":"President Obama is being a leader - something that Donald Trump only dreams of.","post_message":"What is our President doing?"}]
