[{"comment_id":"10153111531487483","commenter_b":"While yes , abortions do bother me, I can see where they are necessary in some instances HOWEVER, I don't believe the federal and state govts ought to pay for an abortion that is not medically necessary!","commenter_a":"Here we go again..Same poop, different day. Same old narrow-mindedness and folks being too lazy to do ACTUAL research. Some people are so close-minded that even if you had the proof right in front of their face, they wouldn't believe it. \"Oh my God! Planned Parenthood (PP) does abortions!!! We MUST stop them NOW!!!!\" *SMDH* Heaven forbid that they actually admit that PP provides other things to both women AND men as far as health screenings, treatment and counseling. So go ahead you Fools, and defund a program that low-income families have depended on for years. I just don't understand how some folks call themselves \"Christians\".","post_message":"Planned Parenthood says Medicaid patients have a right to choose their health care provider. A 21-year-old woman, who has received contraceptive shots from Planned Parenthood, joined the lawsuit against the state."},{"comment_id":"1788331291434935","commenter_b":"She is a nasty woman","commenter_a":"If those liberals ever lost their middle fingers they'd never be able to drive in Oklahoma.","post_message":"Leftist Amy Schumer battling charges of racism..."},{"comment_id":"10153575506851782","commenter_b":"It doesn't show a picture of the impala. All the vehicles in the picture are police cruisers.","commenter_a":"The article says it was a white impala, is it just me or does that car look black?","post_message":"HIGH-SPEED CHASE: Purcell police are chasing a vehicle at speeds of more than 100 mph on 180th Street: @webpagelink"},{"comment_id":"1086650491355306","commenter_b":"Furthermore: @webpagelink","commenter_a":"the outcome is so sad, I feel sorry for the woman relatives... I believe her suicide was due to the bad treatment she received from police, and that she was extremely emotional about it... nothing will avoid this happening again, but re-training the whole police dptm about the way they treat any ordinary citizens nowadays","post_message":"A Texas trooper who arrested Sandra Bland has been fired after being charged with misdemeanor perjury on suspicion of lying in the arrest report he filed, officials said. Read more: @webpagelink"},{"comment_id":"893334250795530","commenter_b":"@username shut your dumbass up. She doesn't need to be in a nasty bathroom cause ur perverted ass can't keep walking and mind ur business. I'm sure you don't mind girls shaking their tits for u just not this baby doing what they were actually made for. Take your ignorant ass on.","commenter_a":"Do it in the bathroom where u have your privacy. Not in the cafe lady...and why are you filming it? Cause you want attention? Or go to the women's section and do it there. You knew you were going to Target, why didn't you bring some bottles with you?","post_message":"This stranger started harassing a woman because she was breastfeeding at Target  but customers and staff defended in the most beautiful way.  #MicBrights"},{"comment_id":"1736517199968208","commenter_b":"go figure a REAL SHARK swimming the the ocean trying to grab a yummy meal.....SFPeopls","commenter_a":"Oh please! 1,000,000+ to 1 he'd do anything. If he wanted to harm them...he could have done it in seconds. Relax!","post_message":"Terrifying video shows a shark swimming metres away from people at Hollywood Beach in Florida, prompting people to flee to safety.   Credit: Caters TV"},{"comment_id":"10155817024445192","commenter_b":"If she has an abortion, there is no child support. If you have the kid, they have to eat whether you like it or not.","commenter_a":"Women say it's thier body until it comes to child support. Then is both. Hmm mm if abortion is legal because of pro choice then child support should be pro choice too.","post_message":"A Florida judge is blocking a new state law that requires women to wait 24 hours before getting an abortion."}]
