[{"comment_id":"1176917475682056","commenter_b":"Well, we can let them kill Americans starting with you!","commenter_a":"I am for the mass genocide of assholes.","post_message":"A bunch of paranoid gun nuts on a mission to kill Muslims, at the advice of a presidential candidate. Is there no line we won't cross anymore?"},{"comment_id":"10153442882309087","commenter_b":"'@username No Edna is the one with the brains, you however should go get and education and then come back to the table. Nevermind don't bring that stupidity back, you may let the men in your family rule your body but they definitely will not rule mine. Whether you like it or not abortion is legal in this country ..... why would any self respecting woman let any GOP teabagger try and rule their bodies....,.I just don't get it and never will. If you won't vote for the women in your lives I certainly will !!","commenter_a":"Obama is ISIS! That's why he didn't cry before!","post_message":"“I was affected by [President Obama crying during Monday's gun control speech] but I thought we should’ve had the same kind of reaction when James Foley was beheaded, when San Bernardino and Paris occurred,' Speaker Paul Ryan said. 'That’s the kind of reaction I had when those occurred.”"},{"comment_id":"10153831418716336","commenter_b":"The wall is a good thing and will create thousands of jobs on both sides of the border. It will diminish drug trafficking and illegal entries. Trump has many options with regard to financing this colossal project. Furthermore, there will be no need to round up and deport millions. Simply register and background check everyone that is here illegally. Anyone beyond the dead line to register will be deported when discovered during routine traffic stops for example. The remainder should pay into the system until they complete the legal entry process, whatever that may be.","commenter_a":"Bryan NY Chow","post_message":"'It's not only deportation. It's building a wall, and I mean a real wall. Mexico will pay for the wall.'  Tonight on 'Special Report with Bret Baier,' Donald J. Trump explained his plans for dealing with illegal immigration. @webpagelink"},{"comment_id":"10154529409364342","commenter_b":"There was 4 people in that house and one person died. It was one of those three","commenter_a":"I would sue too! His SISTER was murdered and this network is blindly claiming he did it.....WITH NO PROOF! Court of public opinion is harmful..... he's innocent he's never been put to trial it's not fair for this network to claim that this guy did it","post_message":"Burke Ramsey claims that his reputation was ruined as a result of the a series that accused him of killing his 6-year-old sister, JonBenet."},{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."},{"comment_id":"10153438882926130","commenter_b":"That's rape !!! Lmfao !!!! Jk","commenter_a":"I am a Viking woman. I don't play any games when it comes to sex. I don't try to look sexy when I want it. I go up to my man and take it.","post_message":"Terry Crews completed a '90-day sex fast' with his wife and it left him 'more in love' and 'more turned on' than ever."},{"comment_id":"1616996585254121","commenter_b":"Now keep the fuckers from being immigrants in this country","commenter_a":"'The Brig it is.'","post_message":"These pirates never saw it coming..."}]
