[{"comment_id":"812987998844624","commenter_b":"Bra,panty,stockings,make up are part of a woman's world We want to look presentable when we go out ....not look like a beat up gf or wife","commenter_a":"The husband is so sweet ,im sure he bought perfume and other toiletries for her","post_message":"The husband was helping his wife choose a makeup color that matched her skin tone. He helped her find the color and kissed her on the forehead, according to Love What Matters."},{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"662636977246385","commenter_b":"This is stupid why not help other people or animals","commenter_a":"More money than sense. !!!","post_message":"She already owns two Apple Watches 😕"},{"comment_id":"10153220980835950","commenter_b":"Calm your tits lady damn it's fuckin cup!","commenter_a":"I CARE ! That \"plain red cup\" represents the disdain that Starbucks and its homosexual CEO have for Conservative and Christian values. Except for the color red,Starbucks refuses to advertise any semblance of the Christmas season or what it represents..Well I don't intend to patronize their coffee shops again ! They can HAVE their liberal agenda and I\"ll continue with my Conservative principles !","post_message":"WATCH: At campaign rally, Donald J. Trump says maybe we should boycott Starbucks over plain red \"holiday\" cup design, promising: \"If I become president, we’re all going to be saying 'Merry Christmas' again, that I can tell you.\" @webpagelink"},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"},{"comment_id":"10153778649078854","commenter_b":"This witch should have been fried after being tried!","commenter_a":"a bullet does not cost much and in this case it would definitely improve the penal figures.","post_message":"Mother Sentenced to 25 Years in Prison After She Presented an FBI Informant with a Disturbing Offer"},{"comment_id":"10155149699869558","commenter_b":"I just watched two segments of news, that being just a plain old person, it seems to me could be mutually worked out to everyone's benefit. It costs to become a citizen. AND our infrastructure is failing..Why cant' we find how willing these people are to be here by having them work for 2 or 3 months for construction, they could work for 4 hours for free to pay for citizenship, and 4 hours for pay for living expenses, A place to stay would be provided while they go through a 2 or 3 month vetting and so prove they really want to be here and are willing to honestly work for it.","commenter_a":"All you americans opposing trump are thick as hell he trying to save your country leave him alone let him do what is needed i wish we had him back off dont be thick all your lives","post_message":"\"That's not press bias. That's blatant dishonesty... The illegal immigration issue has been set up by the media to demonize Mr. Trump as a racist and a brutalizer of the poor.\" In his Talking Points Memo tonight, Bill O'Reilly ripped the mainstream media coverage of federal immigration officials arresting more than 600 people across at least 11 states last week. MORE: @webpagelink"}]
