[{"comment_id":"10153441041876037","commenter_b":"She was living a lie by her own choosing. Time to clean it up.","commenter_a":"When her tan started to fade did anyone ever think she looked a bit less black?","post_message":"In a resignation post, the civil rights activist vows to fight for “what is right and good in this world.”"},{"comment_id":"1256658817687479","commenter_b":"Lady I think you need a snickers bar.","commenter_a":"Yeah be on the lookout! They have white skin, blondish hair, blue/gray eyes and they shoot up movie theaters, churches, schools and clinics! Oh my bad, wrong terrorists!! Please continue! Smh....a bunch of fucktards.","post_message":"After masquerading for months as a newly Americanized housewife, Tashfeen Malik dropped the facade in a burst of gunfire."},{"comment_id":"843332055796851","commenter_b":"CRIMINAL","commenter_a":"LIAR","post_message":"Hillary Clinton doubled down on her assertion that the FBI declared her public remarks on the email scandal “consistent and truthful,” despite independent fact-checkers concluding otherwise. @webpagelink"},{"comment_id":"10152935961526717","commenter_b":"Marriage laws are in the USA,not in Africa,this is and excuse to a naked street party","commenter_a":"I'd like to protest Kenya's murdering of gay people for simply being #uncivilizedculture","post_message":""},{"comment_id":"10153829711751523","commenter_b":"Eirik, shut up ya punk ass bitch","commenter_a":"I seen him, but I'm not saying nothing!!!!","post_message":"UPDATE: Donald Rozga has been found safe!"},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10154638798186336","commenter_b":"Neil Cavuto ...per this morning's discussion: people killed on the highway not same as being murdered by immigrants...who over stay, are not vetted or are illegal!! How many of the 15 9/11 killers fit these descriptions...and we sacrificed the lives of many in order to accommodate immigration. Immigration is not in the Constitution...we need strong laws, enforcement and a wall!!","commenter_a":"dead people make it a war.","post_message":"On \"FOX & Friends Weekend,\" Dr. Sebastian Gorka commented on Donald J. Trump's approach to radical Islamic terrorism."}]
