[{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10154227254693256","commenter_b":"So give your vote to Hillary. Obama lover!","commenter_a":"\"NEVER\" - Trump, and that's not a \"Suggestion\" Mr. Trump, and that goes for \"John Miller\" either. What a Joke not him....... LOL! I say GO for it Mitt!","post_message":"Conservatives, even those not all that enamored of him in 2012, are beginning to entertain the possibility of Mitt Romney."}]
