[{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"682746131874162","commenter_b":"sorry i would not F%%% hillary the whore bitch, too many germs","commenter_a":"Hillary is a whore is better","post_message":"Drivers got one hilarious shock, but is it enough to turn Texas blue? -- Ellen"},{"comment_id":"10153175852531990","commenter_b":"That ain't no woman either !","commenter_a":"400 lbs with a beard.....that ain't no woman!","post_message":"BEARDED WOMAN: So this happened. @webpagelink"},{"comment_id":"1011455315580612","commenter_b":"Is this guy a republican?","commenter_a":"Ignorance perpetuation personified!!!!!","post_message":"This guy is a complete moron."},{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"10154389558756336","commenter_b":"@username LOL! it's the world who runs to, scrambles to get to, imitates and leaves all behind to get to The US not the UK! We don't need to catch up with anywhere, no one's out in front of us!.....hence a hella immigration problem!","commenter_a":"Hey aren't guns illegal there? This must be a misunderstanding I'm sure, take your gun control and stick it up your a$$ Thought Europe(Germany) had very strict gun laws? Just goes to show you that the bad guys will ALWAYS find a way to get guns!!!!","post_message":"Breaking News: There are reports of a “threat situation,” involving \"some sort of weapon\" at a German movie theater in Viernheim, according to police. @webpagelink"},{"comment_id":"1126248447419705","commenter_b":"Yes we need that wall to keep the illegals out","commenter_a":"they would stop coming if we stopped giving them free food and shelter and started shipping them back","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"}]
