[{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"10155180907040649","commenter_b":"@username You are right but the other way around Soros running Obama and Hillary. They all need to go. God be with us all. Trump needs us more now than ever. Pray people and I mean pray as hard and often as you can. We will also fight them tooth and nail if need be and its looks like we are going to have to. Just stay awake, stand up no giving up and no giving in, we will not be taken down and we will win.","commenter_a":"They're rioters, not protesters. Well paid radical left-wing thugs. Call it like it is...and find out who's backing these people.","post_message":"Question of the Day: Do you think President Barack Obama and Hillary Clinton should condemn the violent left-wing protesters?"},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."},{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."},{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"10154937079431729","commenter_b":"Those are some ugly women.","commenter_a":"Indeed, Colonel.....I was also having thoughts along the same lines like why aren't women engaged in sports with men like football, baseball, rugby, la crosse, hockey and, on and on.","post_message":"Folks, I need you to weigh in on this as well."},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."}]
