[{"comment_id":"10153182888819060","commenter_b":"Run, Kamala, run!","commenter_a":"@username - her Agenda is TO REPRESENT US, CALIFORNIA, in Washington, D.C., UNlike the Republicans who spout \"The American People Want\" yet they ( GOP ) go for what the 1%ers want.","post_message":"“An entire generation of Democrats, who have been waiting for this moment for years, took one look at Kamala Harris, and quickly backed off.” For the first time since 1992, California has an open Senate seat and only a Democrat can win. That should have been the cue for an almighty dust-up. Yet, one by one, a billionaire environmentalist, a former mayor of Los Angeles, and the lieutenant-governor, have all stepped aside so there is only one serious candidate. Are they scared? Yes. And they have every reason to be: Ms Harris is an intimidating opponent. The daughter of an Indian cancer researcher and a Jamaican economics professor, she is the first woman, first African-American and first Asian attorney-general of California @webpagelink"},{"comment_id":"10154360418471729","commenter_b":"...she IS A LIAR !!!...always been and always will...","commenter_a":"Now...that looks like an angry candidate!","post_message":"The truth hurts. Especially if you're Hillary Clinton."},{"comment_id":"10153823675392235","commenter_b":"Truth hurts bitches!","commenter_a":"Oh you f****** douchebag liberals have your head so far up your asses if it wasn't for us good white heterosexuals paying all the bills for your lazy asses because you want everything handed to you for free because you believe you're entitled to everything that anyone else has and not willing to work your ass off for it Donald Trump is point on need to shut our f****** borders down. If that's racist then I'm proud to be a racist and stand up for my white skin! You f****** liberals can f*** off and die!!","post_message":"This is truly hilarious."},{"comment_id":"10153184918416336","commenter_b":"never believe this man promise. that's look errr. that's look that can behead you, rape your children and take your wives.","commenter_a":"The face of evil.","post_message":"Abdul Rahman Shalabi, who allegedly served as a bodyguard for Usama bin Laden, went before a parole board to ask for his release so he can marry and have a family."},{"comment_id":"10153146701373984","commenter_b":"Scumbag","commenter_a":"He will never get impeached. He has to many people in his pocket. He started crap the second day in office and it just snowballed, and here we are today. Happy you liberals and the people who voted twice for this Muslim","post_message":"This new plan could spell disaster for America...  Should Obama be impeached before he does more damage?"},{"comment_id":"10157695745225354","commenter_b":"Kanye and his fat ass bitch are 2 POSs.","commenter_a":"Yezzy? I think he probably meant sleezy.","post_message":"FIRESTORM as Twitter backlash grows.   Read the TWEETS:"},{"comment_id":"965206956824108","commenter_b":"Heena thank you for that original post. More level headed than many on social media. Personally I think Islam and Christianity are both a blight to our species- but it is your RIGHT to believe whatever you want. I'll gladly defend your right to be or believe whatever you want. I know Islam and Christendom view me as an abomination because I am gay- I think that is incredibly stupid but I still respect their right to believe it. There is no reason a female officer could not have dealt with this lady and, after checking for contraband, allowed her to keep it on.","commenter_a":"I'm so tired of seeing this article. I wear a hijab and I've been wearing it for 10 years and it's just as much my identity. But if I'm asked to take it off, I will. There's plenty of times I've been asked to remove it for security reasons and I comply, and that's not even because I got arrested. I'm pretty sure God isn't going to smite me for showing my hair to comply with the laws of the country I was born in and choose to reside in, which ironically gives me more religious freedom than living in a Muslim country. Is it entirely fair that this happened, probably not. A female officer could have taken her picture. But that didn't happen, and unfortunately being asked to remove your headscarf in a non-Islamic county doesn't amount to a violation of rights in the same way as it would ...","post_message":"“I’ve worn my scarf for 12 years and my religion says that I can’t take it off. It’s not just a religious issue; this is a part of me. It’s my culture, my life and my identity.”"}]
