[{"comment_id":"10154532453451051","commenter_b":"@username, do you kiss your boyfriend with that mouth?","commenter_a":"You're goddamn right I do. Hope he cracks down on the obstructionist Dems swiftly, and mercilessly, and for those who will inevitably say \"Oh, but the GOP were nothing but obstructionist with Obama! Buhuhuhu.\" To that I say: Elections are a game of King of the Hill, we now have the Hill and soon all 3 branches of Government. I'm not gonna entertain that \"moral high ground\" game, no, this is strategic warfare plain and simple, and we have the strategical advantages.","post_message":"Do you support Jeff Sessions as attorney general?"},{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154607888371729","commenter_b":"What does carrying has to do with this?","commenter_a":"People wanna stop going to target bc of this but still eat chikfila after its owner gave a 100,000$ donation to thelbgt community months ago but still eat there what's the difference hypocrites","post_message":"Target just received a serious dose of reality..."},{"comment_id":"875483499177795","commenter_b":"It doesn't fit their \"outrage\"","commenter_a":"Where's the GoFundMe link? Her business is a non-profit, they feed the hungry, her organization deserves a lot more than a pizza parlor in Indiana. FoxNews, where is your outrage over this?","post_message":"Republicans don't want government to feed poor people. They want charities to do it. So, what happens when a chef who runs a charity steps up to the plate?"},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"936977403012167","commenter_b":"If they are illegal, how can they vote ?? Just askin'","commenter_a":"Hell no","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"}]
