[{"comment_id":"10153583578957144","commenter_b":"they were chanting,Bernie,Bernie...:)","commenter_a":"Ah @username... no mention of the STANDING OVATION for Bernie at the end of the debate? You guys are so blatantly transparent in your shilling for HRC","post_message":"\"I'm not even answering that question.\""},{"comment_id":"10154425900258366","commenter_b":"There is no wall","commenter_a":"Who f****** cares. Now it will be a party. They're gonna roast him like never before.","post_message":"BREAKING: President Trump has officially announced that he will not attend this year's White House Correspondents' Dinner."},{"comment_id":"1037877766321802","commenter_b":"THE ONLY VOTE FOR HILLARY WERE BUTTERCUPS AND ILLEGALS.","commenter_a":"Shabaz, you have a problem with Israel I see!!","post_message":"Who's meeting with the president-elect today? We're at Trump Tower watching the most famous elevators in the world"},{"comment_id":"10154126988050787","commenter_b":"And emma dunsdon, you filty woman.","commenter_a":"Zzzzzzzzz yet more boring posts from the BBC..oo I've got cancer, please feel sorry for me. Yeh we get it, is it a competition to get the most comments ,likes and shares on FB..let's just pull some ..more..on..those..heart strings.","post_message":"Battling cancer with confidence 🙌  Meet Laura, the make-up artist who works with cancer patients in her spare time. (via BBC Three)"},{"comment_id":"10152701049955496","commenter_b":"I had no idea a woman would take offense to the sex part....","commenter_a":"First of all Sex isn't priority one. Marriage is about being there for your spouse, understanding each other, respect and being willing to come to an agreement when you have a difference in opinions. This young buck is confused.","post_message":"A 29-year-old columnist says marriages today just don't work. Here are his reasons: @webpagelink  Do you agree?"},{"comment_id":"10152774435682144","commenter_b":"Misogyny FTW !!!","commenter_a":"Suck my pussy hag","post_message":"Another indication the Supreme Court is likely to rule in favor of gay marriage this June, when justices will hear a monumental case deciding if the Constitution provides the right for same-sex marriages."},{"comment_id":"10153333178554087","commenter_b":"Guess what Kerry illegals have no constitutional right to stay here either.","commenter_a":"Except for a little thing called the Constitution. And laws. I didn't notice the call to shut down churches after the white Christian kid walked into a black church and executed parishioners","post_message":"“Nobody wants to say this and nobody wants to shut down religious institutions or anything, but you know, you understand it, a lot of people understand it,\" Donald J. Trump told Sean Hannity. \"We’re going to have no choice. There's absolutely no choice.\""}]
