[{"comment_id":"10156250000825354","commenter_b":"This leftist democrat is trying to push the blame to christian Americans. She wants what the democrats want more terrorist here. VOTE OUT ALL DEMOCRATS.","commenter_a":"People, please read the book \"The Seduction of Hellary Rodham, by Brock.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"10154931929434641","commenter_b":"Lickass, lickass, lickass from Sri Lanka.","commenter_a":"CNN offered a lot of 'fake news; and 'alternative facts' about Hillary and \"fake polls\" showing her victory.... Mainstream media has lost its credibility.... You cannot stop Trump getting elected in 2020 either","post_message":"\"Alternative facts aren't facts, they are falsehoods.\" - Chuck Todd In an interview on NBC's \"Meet the Press,\" Trump senior adviser Kellyanne Conway said White House press secretary Sean Spicer's false claims about the size of the crowd at President Donald J. Trump 's inauguration were \"alternative facts,\""},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"}]
