[{"comment_id":"10154442937338690","commenter_b":"@username sunni Arabs do not deserve a state.","commenter_a":"Since Iraq invasion, the people have only seen bloodshed, division and their oil is stolen. I guess, this is what 'divide and conquer' looks like!","post_message":"More than 200 people were killed in Iraq's capital, Baghdad, in a suicide bombing attack claimed by ISIL"},{"comment_id":"10155889983075354","commenter_b":"This was the flag of SOUTHERN DEMOCRATS, no less! It took a Republican (Lincoln) to free the slaves!","commenter_a":"With all of the \"racism this, and political correctness that\" nonsense going on, the attempt to distract the masses is working. Do you know the REAL REASON this flag is under attack?? Simple, it's because it's the rebel flag, the flag of RESISTANCE!!! The one true evil behind all of this, is government. They realize people are waking up to their BS and want the sheep to behave... nope, I will NOT ABIDE!!! Wake up people!!!","post_message":"\"I understand the true nature of the war, and slavery was not the primary issue.\""},{"comment_id":"10153874531382464","commenter_b":"IF YOU ARE REALLY WORRIED ABOUT AMERICA CHRISSY ....... DUMP THE TRUMP!!","commenter_a":"Cruz lied about what he did with Carson! CNN fact checked and it was just like everyon knew it was. Cruz is a Liar and a terrible man! He threw Carson under the bus! Rubio puts out the same speech he and his family migrated here and had no money and how he supposedly walked dogs for spare change whileforgetting to mention that the dogs he walked were gaurd dogs for his mother and fathers drug dealings. Both which spent time in prison and were with a Cartel. I am not saying that as a child Rubio was guilty of the drug dealings.What I am saying is that he is giving peoplea false storyof some made up life. Anyone can fact check eitherof these two lying cheating thieves. I wouldn't let either of them wpe my dogs paws! Both are liars and career politicians. As for Bush, His familyuses eminant ...","post_message":"A super sale for #SB50. Get your #TeamCruz jersey for just $50: @webpagelink"},{"comment_id":"496464583811469","commenter_b":"we are not picking on her because she is a women!!!!!!!!!!!!!! Get that straight right off! we are stating that she has a very long line of a shady past, and if you people dont get your head out of the sand it could very well damage our country more than what we can correct. She will never get my vote, already saw her in action and it was not a pretty site.","commenter_a":"I can't believe how mean and cruel people are!!! It's sad. Hillary is not perfect, no one is!! She has made mistakes just like all the other presidential candidates. Every person that has run for President and every President in the White House has made lots of mistakes. Everyone picks on her because she's a woman!!!!! I'm thinking seriously about voting for her.","post_message":"Trump says Clinton is a woman abuser who would be a horrible president. Agree or disagree?"},{"comment_id":"10152589003412894","commenter_b":"That bitch got implants","commenter_a":"I agree with C completely. He has God given talent. She has what God and cosmetic surgery gave her. She has no talent. She did not invent big, voluptuous butts.","post_message":"Charlie Sheen Pops All the Way Off on 'Zero Talent' Kim Kardashian: 'Go F Yourself'"},{"comment_id":"10153697360054091","commenter_b":"Relax...pretty sure she won't get a welcoming party in jail...LOL","commenter_a":"Really? So now taxpayers get to pay to house her, feed her, clothe her, get her medical attention when needed. Who wins? This woman should just be drawn and quartered after a long term of suffering torture. A mind like hers should never be able to influence others in prison. Maybe they will put her in a dark place alone and forget about her.","post_message":"A Colorado judge sentenced the woman who cut a baby from a stranger womb to a century behind bars."},{"comment_id":"10153074180200090","commenter_b":"she is evil and lies so much her nose is growing!","commenter_a":"Question? Why do Hiliary, Rosie and Michelle always have their mouth open when they never say anything.","post_message":"Take the survey if you know Hillary Clinton is trapped in a web of lies: @webpagelink"}]
