[{"comment_id":"10153765647881336","commenter_b":"The thing we are worried about is the fact this woman can become president when she has a possibility of doing all that.","commenter_a":"George W. Bush lies America into a pointless war that kills over 4,000 Americans, and deletes 5 million e-mails=eh okay with Republicans. 4 people die somewhere in the world and Hillary has her own server so that RWNJ's and terrorists can't hack her=throw Hillary in jail. The hypocrisy is thick with Republicans.","post_message":"Question: \"If Hillary Clinton wins, how many years will she serve in the first term?\" Answer: \"In prison?\""},{"comment_id":"10155073600242235","commenter_b":"Quit covering the bitch. Your continued coverage is not news, it is for personal gain. How long can one beat a dog?","commenter_a":"NO THANKS!","post_message":"There's only one reason why she wouldn't be reprimanded..."},{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"},{"comment_id":"10153664512035530","commenter_b":"Ya Chaldean girls are cute ;) lol","commenter_a":"Honestly it's about half right. But if you want to talk about the Metro Detroit area as a whole there are some really beautiful women in the area. I was at Exodos rooftop (in Greektown) in the Summer a couple years back talking to a girl that was there from Philly and she said how good looking everyone was. The Albanian and Chaldean women in Metro Detroit are GORGEOUS. The city itself might not be the prettiest but there are some beautiful foreign women in the area. But I know the article wasn't just focused on the people.","post_message":"Detroit takes it on the chin in this survey based on nightlife, setting, hot locals and \"an undercurrent of desire.\""},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"}]
