[{"comment_id":"10152720795558717","commenter_b":"According to the article, the mother actually administered cancer meds into the girl, as well as a feeding tube. That's where the endangering comes in.","commenter_a":"How is this lie endangering a child? I don't get it. I don't really know the story so I can't really say. Just going on headlines here.","post_message":"An Iowa woman who lied about her daughter's cancer diagnosis won't serve any time in prison for endangering the life of her child: @webpagelink"},{"comment_id":"1639044993063408","commenter_b":"Hahahaha english language correctly? Hahahahahahahahaha english language accurately yiu filthy Camel Cunt. India will rape your mother and your sisters till kingdom come. We will shove the Quran up your mom's asshole and tear it open page by page. When yiu stick yiur forehead on the ground and say allahu fuckbur your mom will moan with pleasure coz her vagina will be stuck to your forehead. Go fuck a camel you cunt l.","commenter_a":"Arabs will and have never won against Israel. If I were Arab I'd get on me camel and hoot into the unknown if me desert shit hole.","post_message":"LIVE: Netanyahu responds to Kerry speech on Middle East"},{"comment_id":"10153482045808984","commenter_b":"She is a nut","commenter_a":"I would hate to have lived under her roof , she is not fit to be president. Or anything else.","post_message":"Hillary Clinton is known for her liberal view on just about every topic she chooses to sink her teeth into. And looking at this, her next move might be to include children in her agenda...  Do you think Hillary needs to be stopped?"},{"comment_id":"10155170960495093","commenter_b":"You know, the more I see about Manspreading and Manslamming and Mansplaining and etc...the more I think 'Womanwhining'","commenter_a":"How bizarre that a feminist would lie while trying to make a (man-shaming) point. First time for everything, I guess","post_message":"The term 'manslamming' comes from one woman's claim that she walked around NYC without moving out of anyone's way and almost every man slammed into her but almost no women did.   So National Review's Katherine Timpf decided to try it out herself  and 66 women ran into her vs. just 23 men. You can see video of all the slams here:"},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"10150622928829999","commenter_b":"She needs to go and work with Al Dunlap. They both do jobs that no one else has the guts to.","commenter_a":"Joe Jack","post_message":"Ellen Pao is resigning from reddit after a week of ceaseless criticism from angry users."},{"comment_id":"10154633221506162","commenter_b":"Chelsea so this was my bike ride","commenter_a":"Lexi","post_message":"Cool clouds rolling over the Chicago area!"}]
