[{"comment_id":"610661985768228","commenter_b":"white kids of lower middle class know what it is like to be in those areas of transformation and watch their towns become unsafe ghetto's. These immigrants always come forcefully in the streets to establish turf and whites have dealt with it from every race that comes in. don't know ghetto's eh, some of us know and were forged in them. what an ill guided statement to make","commenter_a":"Love the positive comments here, and even if theres negative comments bernie will always have a great comeback as he did in the debate last night. This man deserves the title of president. So much can come from this stop thinking about it & vote for him","post_message":"I am very proud of being Jewish, and that is an essential part of who I am as a human being. My father’s family was wiped out by Hitler in the Holocaust. I know about what crazy and radical, and extremist politics mean. I learned that lesson as a tiny, tiny child when my mother would take me shopping, and we would see people working in stores who had numbers on their arms because they were in Hitler’s concentration camp."},{"comment_id":"10154057367791600","commenter_b":"Exactlyyyyyyy","commenter_a":"My dogs would be out of there before me","post_message":"The cause of the early-morning fire is under investigation."},{"comment_id":"1480806588645751","commenter_b":"@username, Nancy is not well educated. Clinton or Trump presidency will lead to WWlll. We need to stop voting for the lesser of the two evils. I bet Nancy has never heard of Machiavelli.","commenter_a":"And Hitlery wants to bring thousands of Syrian refugees to our country. This has to be stopped!! TRUMP/PENCE 2016","post_message":"Manhattan bombing in Chelsea has similarities to the Boston Marathon bombings of 2013, say explosives experts"},{"comment_id":"10153312472421323","commenter_b":"Over kill..............","commenter_a":"It's a wonder the shells didn't bounce off the medals.","post_message":"Hyon Yong Chol, who heads the isolated country’s military, was purged and then executed by firing squad with an antiaircraft gun, watched by hundreds of people, South Korean media reported on Wednesday."},{"comment_id":"10153484924965861","commenter_b":"Impeach her","commenter_a":"Mary Failin was trumped","post_message":"BREAKING: The Oklahoma Court of Criminal Appeals has granted a two-week stay in the execution of Richard Glossip."},{"comment_id":"1198337853547380","commenter_b":"Simple solution, ARREST Them and prosecute to the full extent of the law! They keep doing this crap because they are not being prosecuted!","commenter_a":"Yes","post_message":"These loons need to be locked up!"},{"comment_id":"10154118857949087","commenter_b":"Stop it with the memes already! I wish @username would disable them.","commenter_a":"He will be just fine. It's Hillary The Post needs to be concerned about.","post_message":"“It’s beyond debate that Donald Trump is unfit to be president.\""}]
