[{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"10157286339920093","commenter_b":"There's no such thing as humane murder, just like there's no such thing as humane rape. Either way they're going to die and nobody wants to die. It's not our choice, these are foreign proteins that make our bodies suffer . They have a negative impact on us yet were continuing this vile massacre. Did you know that they rape cows ( the artificially inseminate them with a \"rape rack\").","commenter_a":"Humans love to kill land and sea animals. People are like cavemen and think they still have to kill to eat. I've been doing great for 20 years now without eating meat or seafood. I don't believe in killing things it's a pretty crappy thing to do. Heartless and inhumane. It's called using your brain and evolving. How can anyone with a conscience bully and kill something I don't get it.","post_message":"Hundreds of lobsters avoided being boiled alive thanks to a group of Buddhist monks."},{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"},{"comment_id":"10153931727246162","commenter_b":"She deserved it!! Drunk idiot","commenter_a":"Excessive indeed, but I wonder what happened before he tossed her in.","post_message":"North suburban Skokie has agreed to pay $875,000 to a woman who accused a police officer of using excessive force after a DUI arrest: @webpagelink"},{"comment_id":"10154727217281037","commenter_b":"When your cat was grabbed, am sure you did not mind. Trump is an insult to humanity.","commenter_a":"He is a low class guy with money.","post_message":"Melania Trump defended her husband, saying the vulgar remarks were not reflective of him and that she had accepted his apology and hoped others would, too."},{"comment_id":"10153047867707452","commenter_b":"Kimberly wirth you're an idiot and very ignorant","commenter_a":"I saw video footage of the man and he was clearly white with a reddish beard. The camera was laying on the ground and caught the bottom of his face. I'll look for the video and will post it.","post_message":"EXCLUSIVE: A Burbank woman says she's sick to her stomach after learning the man she went to junior prom with, Vester Flanagan, is responsible for the fatal shooting of a WDBJ-TV news crew in Virginia. abc7.la/1VbHsIC \"It almost feels a bit numbing because you don't think this would ever happen,\" she said. \"I knew him as a different person.\""},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""}]
