[{"comment_id":"10154713474904586","commenter_b":"GO VEGAN LEAVE ANIMALS ONE YOU EVIL PEOPLE","commenter_a":"I hope there is a hell, and the people who inflict this unspeakable cruelty on these poor helpless beings, burn in it for an eternity...lowest form of scumbag life on the planet..","post_message":"This is what 'shackle & hoist' looks like."},{"comment_id":"887553468004375","commenter_b":"What a pig","commenter_a":"The entire 'occupy' movement is a collection of unemployed, pot smoking, attention strumpets who receive gov. assistance and don't want to lose their free ride.. Morons!","post_message":"Pass it on.  Image by Occupy Democrats."},{"comment_id":"10155285284005389","commenter_b":"This woman is deluded! I think our entire State Department is.","commenter_a":"What a dumb liberal idiot.","post_message":"“We cannot win this war by killing them [ISIS], we cannot kill our way out of this war.”  That is according to our very own State Department.  State Department Deputy Spokesperson Marie Harf told Chris Matthews that we cannot win this war against ISIS by killing them.   So what is her solution to stopping radical Islamic terrorists from murdering and taking over territory?   Job opportunities.  Seriously!?"},{"comment_id":"10158081616760603","commenter_b":"'@username Lame.","commenter_a":"Well I had sushi last night lol","post_message":"Any fish eaters out there? The most popular fish on your plate could be carrying a tape worm"},{"comment_id":"10156572722830354","commenter_b":"You are so stupid it hurts.","commenter_a":"SPOILERS: The fact the chick was able to learn the force on her own, without even really knowing anything about it? And then to be able to defeat ren without any sort of training? That alone ruined the movie","post_message":"'...may be the worst thing ever to have happened in the history of cinema.'"},{"comment_id":"1113200062092053","commenter_b":"Hillary is the bigger liar and has laundered millions for her own use through the Clinton Foundation. At least Donald actually worked for his money. She is a murderous also. Her stint as Secretary of State and her private e-mail server has put us in great danger from our enemies. If you plan to vote for Hillary raise your right hand and slap yourself in the face!","commenter_a":"I really like you Dr Carson but if this is true why do you support TRUMP, who lies, has no common sense and won't release his tax returns. He's hiding a lot and we all know it.","post_message":"People all over the nation are starved for honesty and common sense."},{"comment_id":"899421576802371","commenter_b":"Stupid BITCH !!!","commenter_a":"Why don't you release your vitriolic hatered towards the real enemies the Muslims, the Obama administration, Hillary Clinton, the democrats, black lives matter and other groups like that and anyone on the left that thinks like you. Unfortunately the rest of us don't have the money to buy protection so we have to protect ourselves. There is not enough police to protect everyone. I use to like you but I don't anymore.","post_message":"Actress Rose McGowan Unloads Hate-Filled Rant Over Muslim Murderers Syed Rezwan Farook and Tashfeen Malik. Her target: American gun owners and Republicans.    Sorry, Rose, but we poor, regular folks can't afford ARMED bodyguards and a million dollar house like you and your Rich Hollywood Liberal pals.  #elitist #1Percenter"}]
