[{"comment_id":"10154716865434586","commenter_b":"Omg idiots","commenter_a":"What's wrong with people they don't use there heads","post_message":"Dear everyone: Animals are NOT selfie props. This has to stop."},{"comment_id":"10153730476318145","commenter_b":"Lol Hilary is a f** murderer and needs to rot in a prison cell.","commenter_a":"I never thought I would say this but I really hope Hilary wins !! Republican Party has become a freaking joke !!","post_message":"#BREAKING: Former presidential candidate Dr. Ben Carson will endorse Donald J. Trump, the real estate mogul said. Watch Channel 9 Eyewitness News at Noon for details and a recap of the GOP debate."},{"comment_id":"10152968274184099","commenter_b":"Thank God!! These kids don't know what they are doing to their parents and the dangers there are out there. Stay ya tail in the house.","commenter_a":"Glad she is safe","post_message":"A missing teenager who left her Edgemont home more than a week ago wearing only pajamas has been found in Manhattan, police said. @webpagelink"},{"comment_id":"1091574534232574","commenter_b":"Why this government is all B/S! Why this government is all B/S! It left over 180,000 tailor and mobile homes in Louisiana that the people never used and this sh**hole of a government could have added to that number and moved them all over the Midwestern farms for many of this countries people living off long term benefits! Just relocate mom and her 2-3-4 or more kids out there to work the farms! I think that this would be much healthier for the kids than being raised in many respects in slum cities and neighborhoods This bullshit about Americans are unwilling to work the farms, well, maybe if they are forced to, or all subsidy will end, maybe they with their children will learn a healthier way! And other women, who may consider this lifestyle, may think twice! The only reason that this government wants the border open is to ...","commenter_a":"Yes","post_message":"'Cuban nationals should be treated under the same immigration rules as nationals of other countries.”"},{"comment_id":"10152869187276336","commenter_b":"Yes ... where ??...","commenter_a":"Islamic Cleric: 'Islam is Not a Religion of Peace!' www,thetrumpet.me","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad?  Watch and weigh in: @webpagelink"},{"comment_id":"10153860133856336","commenter_b":"He just figured this out LOL i knew ever since he took office.","commenter_a":"Absolutely.","post_message":"Do you agree with Mike Huckabee?"},{"comment_id":"1190973280940010","commenter_b":"All these lackluster punks would do anything for the limelight even give Killary 8 years in White House. Just punks selling junk.","commenter_a":"I used to always watch and listen to GB. No more, lost a lot respect for him.","post_message":"GB getting shoot notes from his team."}]
