[{"comment_id":"10154244362139411","commenter_b":"@username - Shut up bitch","commenter_a":"I can just see a flood of poor women getting pregnant so they can sell babies. What a terrible idea. Plus the fact that many which grew up in a state foster home become criminals if not adopted early","post_message":"'Chance to live'"},{"comment_id":"10153779566119170","commenter_b":"Bush is a tush","commenter_a":"They need to stop this childish back and forth banter, and get back to the serious problems that need to be solved in this country! SMH...","post_message":"Jeb is pulling out all the stops on trashing Donald J. Trump, even comparing the billionaire to ultra-liberal filmmaker, Michael Moore. Of course, Trump had to respond!"},{"comment_id":"10153309653924614","commenter_b":"She doesn't love him if she's trying to take off his mask","commenter_a":"About time.","post_message":"A Baltimore mother is being praised after cameras captured her berating and smacking her son after reportedly seeing him throw rocks at police during the city violent protests.   wish I had more parents that took charge of their kids out there tonight, the police commissioner said.   Nearly 200 people were arrested on Monday after more than 140 vehicles were set on fire and at least 15 police officers were injured during the protests.   Read KTLA story here: @webpagelink"},{"comment_id":"10153700369301600","commenter_b":"Florence Colo is the federal supermax for the U.S.......","commenter_a":"HELL NO TAKE THEM TO WASHINGTON DC","post_message":"Republican Congressman Scott Tipton’s office said he believes the transfer of some of the world’s most dangerous terrorists from Guantanamo Bay to Colorado is “unacceptable.”  What is your opinion?"},{"comment_id":"572406196218003","commenter_b":"@username bigotry people?!? First learn to compose a literate sentence, then read your comic book.","commenter_a":"Unfortunately, anti-gay bigots never seem to go away since we're still dealing with them 40 years later. When will we, as a people, learn to stop hating people who are different than us?","post_message":"TV's \"All in the Family\" was way ahead of its time.   Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153120807760671","commenter_b":"I think it a historical landmark and therefore cannot be torn down and if its not it should be. Even in its dilapidated stated it is still beautiful and the history that building has is a part of everyone who grew up on this area. #SAVETHEHOTELMARYSVILLE!!!","commenter_a":"Make it a church","post_message":"What should happen to this hotel?"},{"comment_id":"10154209285520969","commenter_b":"Madeline why then, where we're your masses in Nov. Your just sad","commenter_a":"Patricia slice that is such a lame fucking saying","post_message":"WATCH LIVE: The Senate votes on the nomination of Jeff Sessions for Attorney General after Republicans voted to silence Elizabeth Warren."}]
