[{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"},{"comment_id":"10153516000908984","commenter_b":"If they want want to stay in America, they should have to obey our laws","commenter_a":"Give them all a one way ticket to Iraq. Let them embrace their Shariah Law and the ISIS.","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"1388314524545146","commenter_b":"Someone should kick this Muslim Animal out of our country years ago.","commenter_a":"Delusional moron!","post_message":"Just another scumbag black leader who hates Jews...boy, sure glad we helped them with their civil rights in the 60's - WE WERE THE ONLY ONES!"},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."}]
