[{"comment_id":"987873944592566","commenter_b":"She willl burn in Hell","commenter_a":"you have that right @username,I wonder if she ever thought how she got here on earth??","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"},{"comment_id":"1401035306583488","commenter_b":"Trump was sneaking in another drug shipment.","commenter_a":"Well government systems are remarkably insecure compared to the sensitivity of information on them. If Republicans would stop slashing operational budgets maybe we would have security of information across government. So shortsighted. So small minded.","post_message":"U.S. Department of Homeland Security employees in the Washington area were unable to access some agency computer networks on Tuesday, according to three sources familiar with the matter."},{"comment_id":"10154148489244060","commenter_b":"@username I just think OUR country needs to find a way for its CITIZENS to be productive, if we want to limit immigration ..just an idea","commenter_a":"You are forgetting that Rodney King was drunk and high on PCP. He also attacked the cops, that is clearly seen on video. White people who are drunk and high on drugs are beaten by the police when they resist arrest too... Please tell all the story of you are going to tell it. As for the Black Lives Matter movement goes, they just increase tension and stir things up. All Lives Matter, end of story. Where are the BLM protesters when two black kids are shot in their front yard in a gang-related shooting and there are no leads in the case? Nowhere. If a white police officer isn't involved, they don't care. They just want headlines, not community building. And that community is all of us, not just one ethnic group.","post_message":"Rodney King, an American taxi driver, was beaten by four LAPD officers after being caught speeding. He suffered a fractured facial bone, a broken right ankle and severe bruising and lacerations. It sparked a global conversation about police brutality; two of the officers were found guilty of violating King’s civil rights on April 16th 1993"},{"comment_id":"10154367276527293","commenter_b":"@username, stay away from our country!!","commenter_a":"I don't think I have ever been so ashamed of this country. Deplorables, indeed. The morons clearly vastly outnumber the intelligent among us.","post_message":"The uncertainty over the outcome of one of the most contentious presidential elections in modern history rattled investors around the world."},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""}]
