[{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"10154806560781509","commenter_b":"Hillary is a joke. Too bad we didn't have a good candidate. I will not vote for Clinton. The Democrats are losing voters in mass.","commenter_a":"NOT IN JAIL YET......it's not what you know (she knows stuff all) it's the case of WHO....","post_message":"Hillary Clinton just did a Donald J. Trump impersonation, mocking him in a hypothetical debate @webpagelink"},{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"10154414829691051","commenter_b":"You've been programed on 30 years of BULLSHIT that has not stuck, she's not perfect no politician is but to have this mfer win is just off the fucking charts people will suffer from this including me but these racist mfers will suffer a rath of bs way worse when Gw was in office.","commenter_a":"I think it's a good thing. I honestly don't think that America would have a problem with a Female President, I just don't think that America wants Hillary Clinton to be that First Female President. She's got a rough track record, a record that has a lot of corruption and lies written upon said track record, and the American people see that. She's done a lot of great things in her life, but alas, being President will not be one of them.","post_message":"It looks like Hillary Clinton is done with politics for good. Is that good or sad news to you?"},{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills. God is so good."},{"comment_id":"1863241907237719","commenter_b":"You better not get one or I'm on your ass like a black cock!!","commenter_a":"Lamar Dent Damon Hardison","post_message":"Roast sessions all day! #WSHH"},{"comment_id":"1049777781778246","commenter_b":"@username aw did I offend you?, I'll consider your little bitch feelings next time you comment ok. Lmfao pathetic","commenter_a":"Approx 100 million gun owners in US , approx 200 million guns, several trillion rounds of ammo. If us \"white guys\" were the problem, you'd Damned sure know it.","post_message":"Clear as crystal. FOLLOW US at Reverb Press and Stories That Resonate."}]
