[{"comment_id":"10154136361277293","commenter_b":"@username Oh! Just saw the guns!!!! You can live in your own basket. Would not want you as my neighbor. I'll live near a refugee.","commenter_a":"All these \"deplorable\" comments make me truly ashamed of my fellow Americans. SMDH at all the lies, irrational hate and fear mongering.","post_message":"Kerry told lawmakers \"that if it is possible to do more\" in terms of accepting refugees, \"we would.\""},{"comment_id":"10153609114867212","commenter_b":"@username and the other \"haters\", tension in the city? \"Maybe\" criminals and snipers will think twice before shooting someone like the officers, if they know they have fire power back! In Dallas most of those officers only had hand guns to defend theirselves and the innocent people! Their hand guns didn't reach the distance needed! Now, that's TENSION! You think it would be \"tension\" if your Police Officers were equipped properly in your city, but what would you do if this same thing happened in your city like it did in Dallas? Dont ever say it can't! The world is changing, wake up! It shows you do NOT have a son, brother, father, uncle or a good friend out there daily in a police uniform or you would want them protected! Keep hiding your head in the sand and hope one day you, your child, parent or loved one never ...","commenter_a":"They should carry their guns on duty n off back off the cops they save life's no matter what anyone says they have been their when I needed them and I have my blue to show it. Chief is doing what he thinks is right period","post_message":"The American Civil Liberties Union of Oklahoma (ACLU) is speaking out against Oklahoma City Police Chief decision allowing officers to carry personal rifles, saying it is likely to increase tension between the public and law enforcement. #News9"},{"comment_id":"827359944060385","commenter_b":"Hillary is truly a liar.","commenter_a":"Hillary, always evolving while taking corporate money for corporate favors. Show me the speeches from Goldman Sachs so I can see exactly how much of my back you really have... #FeelTheBern","post_message":"Too many trans Americans still face violence and discrimination, just for being who they are. Together we'll fight for safety, respect, and full equality for the trans community."},{"comment_id":"10153141332863984","commenter_b":"She's a complete idiot. Take care of your own bratty girls and leave Americans alone","commenter_a":"Hell yeah it is!!!our kids cant eat that crap","post_message":"Really, Michelle?  Do you think that Michelle's lunch program has been a colossal failure?"},{"comment_id":"10153082331816600","commenter_b":"I agree Kaliah Nichole! I am not a fan of what Obama is doing either, however, to say that vaccinations don't work is absolutely ridiculous! The comment about hippie is because there are so many people \"hippies in the 70s\" that thought that we were all invincible and that we shouldn't have any restrictions and that the whole world was all about \"love\". This is not a game and even though our children get vaccinated and should be immune and resilient to certain viruses, this is not a game and not all immunizations are foolproof! So it's better to be safe than sorry and if people don't want to have their children vaccinated then they should all go to a communal area and go to school with each other and spread diseases amongst one another.","commenter_a":"Let's BAN @username! Go to a foreign country and bring back all types of diseases and parasites because of your lack of knowledge! Clearly by the looks of your picture you're a hippie who thinks that every thing you do is okay and that your indestructible because you smoke weed! Get an education and do your research!","post_message":"If a parent refuses to vaccinate their child and the child goes on to spread a deadly illness to others, do you think there should be consequences?"},{"comment_id":"10153179631761833","commenter_b":"lots of canadians too,,but they have to do it ILLEGALLY,,,lol..","commenter_a":"The enemy fears us does not matter if they are in Washington or are muslim extremists the end results will be the same. We will protect our 2nd Amendment rights.","post_message":"John Lott: Terrorists can strike anywhere and at any time, giving them a huge strategic advantage.Unfortunately, too many politicians around the world are refusing to admit this.  In the U.S., over 12 million American civilians are licensed to carry concealed handguns.  These Americans save lives."},{"comment_id":"1840806586176177","commenter_b":"Will someone get this dumb bitch to shut up. let her crawl back into the hole she came from","commenter_a":"And I believe Conway has four children.","post_message":"Apparently the Trump team still thinks it's 1955."}]
