[{"comment_id":"10154264831942411","commenter_b":"@username Did you even look at the picture?","commenter_a":"Enjoy climate change people humans are to blame for early spring weather.","post_message":"We've never seen anything quite like it."},{"comment_id":"1297175820325446","commenter_b":"IF TRUMP IS SO PRO-ISRAEL THEN WHY NOT A 2 TIER SYSTEM AND HUMANE PRISON REFORM SYSTEM HERE 2?!!!!!!!!!!","commenter_a":"Once the ACA is dismantled, people are in for a RUDE awakening. If you thought premiums/pricing was bad before, they will only get higher once \"Obamacare\" is gone. Trump voters are, essentially, like the dog with the bone who sees a reflection in the water of another dog with a bone, and tries to snatch it, losing both bones. I guarantee that you will be severely disappointed.","post_message":"LIVE: Sen. Bernie Sanders is holding a town hall meeting on CNN, talking about how we can fight back against Trump's bigotry and fascism.   *** audio is missing from the first few seconds, please stay tuned and it comes on shortly***  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154266616104714","commenter_b":"@username hey wanna help us build the wall when trump gets elected","commenter_a":"Good you can celebrate without my dollars goodbye target fn libtard fruitcakes","post_message":"\"Inclusivity is a core belief at Target\" said the retailer in a statement. \"It's something we celebrate.\""},{"comment_id":"1104176122983583","commenter_b":"Fire her sorry Ass!","commenter_a":"traitor, as a senator you have more of a way of fighting for what you believe in than 99.9% of us ....Do what you were elected to do and stand up for flag and country, or get the h out of the goverment","post_message":"What?! Man!!!"},{"comment_id":"10155101545959866","commenter_b":"I was in prison and the c.o.s and inmates were always like buddies","commenter_a":"Do you even know what C.O goes through everyday? Well you guys are probably working at mickey D's thinking you have a hard job","post_message":"LIVE: Delaware prison guards taken hostage by inmates a maximum security prison - live ground video. MORE at @webpagelink"},{"comment_id":"875427632505785","commenter_b":"I prefer to be even more accurate than that. The legal term is \"Illegal Aliens\".","commenter_a":"Hey Fox 10! I love you, but this has to stop! It's ILLEGAL IMMIGRANTS NOT JUST IMMIGRANTS! Immigrants are preserved for those who came here LEGALLY. GET WITH IT!","post_message":"More than 1,800 immigrants that the federal government wanted to deport were nevertheless released from local jails and later re-arrested for various crimes, according to a report released Monday. What do you think about these findings?"},{"comment_id":"858336867535069","commenter_b":"Good for her Muslims need to go back to their own country and stay there. Stop pushing their laws on us. And stop giving into them","commenter_a":"move go back to your country","post_message":"#Sharia comes to Texas?   Not this time!"}]
