[{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"},{"comment_id":"1239601439418363","commenter_b":"kill yourself then you basic bitch","commenter_a":"yo this shit is funny as fuck and if you disagree you're definitely not lit kill yourselves if you didn't laugh when the girl dialed 911 on the microwave and the first few notes of the x-files theme song plays as you hear the operator lmaoo im deaaaaaad if you didn't like this vid fuck u, ur bitch, ur fam, and the clique u claim","post_message":""},{"comment_id":"764116903756422","commenter_b":"@username I don't see you birthing a baby out of your pee hole.","commenter_a":"I see all of these people shaming women for having an abortion, but it takes two. The woman just has to walk around with the evidence. So many are so quick to hold up signs and protest against a woman's choice yet we have so many unwanted children waiting to be adopted. Caring for children doesn't stop at a fetus. If you're going to protest and shame a woman for making, for some a very difficult choice, how about you go through an adoption process, pay for children's education and medical, etc. If you're not out there trying to adopt unwanted children, then you really shouldn't be shaming a woman for having an abortion or taking her right to choose. Perhaps if people and the government put this much attention toward education, and giving equal opportunities to all, we would have more successful people and less unplanned pregnancies.","post_message":"\"Women's health and rights are now one of the first casualties of the Trump administration.\""},{"comment_id":"10154456298447169","commenter_b":"I might add that she also stated that America was against immigration, that is a oxymoron statement, she's here!","commenter_a":"If a wall goes up, you are free to live on whichever side of it you want.","post_message":"\"Berlin didn't start out just with a wall coming up innocently, the Russians shooting everybody. It starts gradually and it gets worse and worse.\" \"The [Berlin] Wall was meant to keep people in because the Communist system was so horrible. This wall is being designed to protect our borders.\" An emotional debate broke out between participants at the \"First 100 Days\" Immigration Town Hall when comparing President Donald J. Trump's border wall plan & the Berlin Wall. Read more: @webpagelink"},{"comment_id":"452100988313815","commenter_b":"Oprah is on her way out No one watches her American people don't like racist people like her","commenter_a":"I've thought she's been racist for years!!","post_message":"Do You Agree Oprah Is A Racist? Comment 'yes' or 'no'."},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"},{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"}]
