[{"comment_id":"10153717178056002","commenter_b":"why not just peep in their windows?? people are falsely put on these so called \"lists\"","commenter_a":"There already is one of these lists. When a Employer does a deep background check it shows everything. You and I can go on OTIS with the right info on a person like birthday date , ssn and full name you can get all of their info.","post_message":"Two boys from different families are abused by the same woman. See what this mom is doing to protect other children."},{"comment_id":"1062072083905575","commenter_b":"@username this is the saddest thing I have ever seen","commenter_a":"AND SOME OF TH AUDIENCE LAUGHED? Grrrrrrr!","post_message":"UPDATE: See the response from Caleb's dad and school, plus CALEB GIVES HIS LAST LINE! WATCH: @webpagelink  PREVIOUS: A 6-year-old boy with autism was brought to tears on stage when a teacher grabbed the microphone away from him when he was about to speak during his school's Thanksgiving play. Caleb was dressed as a turkey, and just wanted to say, \"gobble, gobble.\" STORY: @webpagelink"},{"comment_id":"10154668676208797","commenter_b":"Never mind iam deaf ok that women did it .she just want money ok .","commenter_a":"I don't think johnny deep do that is her she pull her safe for money johnnydepp money I don't like her .is no alway he did her . Johnny Depp don't get married and he have his life .","post_message":"'I LIVE IN FEAR': A judge has ordered Johnny Depp to stay away from his estranged wife after she accused him of repeatedly hitting her during a fight, leaving her face bruised."},{"comment_id":"1043010225790700","commenter_b":"She'll want you to lie and cheat just like she does. Better stay clear of that lot.","commenter_a":"This is why I'm proud to be a Democrat Hillary is on her way Sign me up Hilary Whatever you need me to do Love is better than hate Love you Republicans","post_message":"Tonight: Hillary Clinton at the #DemConvention. Watch the speeches LIVE on Twitter now."},{"comment_id":"10152987943491636","commenter_b":"We all foreigners no one stay for ever on this big country called earth.","commenter_a":"She's not banning foreign students only getting them to leave after they have qualified. It's not part of the deal that they can settle in The UK","post_message":"It's not a very popular decision"},{"comment_id":"10153731368766756","commenter_b":"Aubrey A Price","commenter_a":"Jay Stephan Steinmetz, oh the La Fee!","post_message":"It was not art, but necessity that first helped popularize absinthe: It was included in the rations of French soldiers who marched off to colonize Algeria in the 1840s, issued \"for the prevention of fevers and treatment of dysentery.\"  It was only later that drinking absinthe came to be viewed as an indulgence for both the eyes and the tongue."},{"comment_id":"10153132008994497","commenter_b":"Conceded bitch... this shit practically writes itself. Lol","commenter_a":"This sick beat. Oh no!! Now what? Gimme a break. Never heard something so idiotic. A phrase? Boooooo!! :)","post_message":"From our sister publication:  The A.V. Club: \"From this day forward, any and all sick beats belong to Taylor Swift, under penalty of law.\""}]
