[{"comment_id":"10154283827397014","commenter_b":"Milita Military Milita Military those two words don't sound the same","commenter_a":"A collection of dudes with short man complex playing army man and pretending to be 'patriots'....awwwwwww, you guys run along and have fun now, don't get anyone or yourselves killed","post_message":"The group said they'll vow to protect the Second Amendment, even under Trump."},{"comment_id":"844173412298350","commenter_b":"She's a witch!","commenter_a":"And she is a pig!","post_message":"NEW unpublished audio recordings of Clinton Foundation head Donna Shalala privately expressing concerns about Bill and Hillary Clinton’s mental state."},{"comment_id":"858172280911557","commenter_b":"We'd be better served to ban the Muslims from our country period!","commenter_a":"Stick to your guns. We support you","post_message":"UPDATE: Gun Range Ban On Muslims Draws Fire  In the five months since Jan Morgan banned Muslims from her gun range in Hot Springs, Ark., business has boomed and predictions of a lawsuit brought by federal civil rights enforcers have so far proved inaccurate. Morgan, who claims keeping Muslims out of her Gun Cave... #guns #islam #shootingrange  @webpagelink"},{"comment_id":"1028049810606008","commenter_b":"This evil witch should spend The rest of her life in a solitary jail cell without food or water for all the evil she has perpetrated on this country!!!","commenter_a":"Softball questions","post_message":"She's totally cooperative! And yet she won't talk to investigators. Why? Wait until you see how she tries to explain this one away."},{"comment_id":"10154299684276547","commenter_b":"???","commenter_a":"hire catfish ... they find everyone","post_message":"Judith met John online. But he wasn't John. He was a 'romance scammer' who made off with ,000 of her money. @webpagelink"},{"comment_id":"1013523678688104","commenter_b":"Stupid bitch !!","commenter_a":"Shameful","post_message":"Comedian Ricky Gervais was so appalled by the image of Rebecca Francis grinning next to the freshly-killed giraffe that he tweeted it to his 7.52 million twitter followers, and almost broke the internet."},{"comment_id":"848307568693153","commenter_b":"GO stuff your FAT ,UGLY, RACIST face!","commenter_a":"What IF I ONLY HATE \\bOBAMA'S 'WHITE' Half???","post_message":"If you hate Oprah does that make you a racist..."}]
