[{"comment_id":"1877645852479520","commenter_b":"Me thinks Conservatives protest to much! There was no outrage when Sen.Foley was exposed for pedophilia, in fact 36 other senators wrote impassioned letters begging for mercy for Foley. Trump bragged about oggling young girls naked at Teen Miss America and 46 million people didn't think it was a big enough issue to prevent a pedophile from becoming President. It is clear Conservatives sexual icing children is okay!","commenter_a":"Karma!","post_message":"BREAKING"},{"comment_id":"1341782245865041","commenter_b":"Wow!!!! Clearly a Muslim traitor...... Like Barry and Michael, maybe they can all room together......Prison 2017 !!!!!!","commenter_a":"'Farking Nuts'","post_message":"YES, POLITICIANS HAVE LITERALLY LOST THEIR BRAINS..."},{"comment_id":"1773738762840165","commenter_b":"Yea but she doesn't wear that dress well as Melania .Petty old lady","commenter_a":"This is just tacky and remarkably low class.","post_message":"10/10 burn. 🔥"},{"comment_id":"10153337670592061","commenter_b":"Omg your so ignorant lady!","commenter_a":"I've had enough of this 'let's show black crimes in the news disproportionately bs' what's up with those occupy federal land militia and who's going to right the Steve Avery corruption wrongs. What he has to be an affluenza to qualify for civil rights in America?","post_message":"WATCH: Kidnap victim explains how she escaped after an alleged carjacker jumped into her car and forced her to drive nearly 150 miles: @webpagelink"},{"comment_id":"925335920856271","commenter_b":"What has she done is any of her 'jobs' ??","commenter_a":"let's see.... do nothing, do nothing. who cares.. liar, philanderer, cheat.....","post_message":"Some familiar faces on Roosevelt Island."},{"comment_id":"10153742340973812","commenter_b":"Just drop your Facebook account. We'll all be happier and you can be crazy all by yourself with no interruptions.","commenter_a":"Please post worthy news and not perversion... Next will be pedophiles wanting to marry little kids.","post_message":"Meet James Yates and William Smith, Jr., the first same-sex couple to get marriage license in Rowan County, KY. This was their sixth attempt to get a marriage license."},{"comment_id":"10154115958779740","commenter_b":"How is chatting about baseball anything like questioning someone about their personal relationship with religion...?","commenter_a":"If they can't talk about repentance and God then they can't talk about anything else either outside of the law and professionally defined parameters consistent with law enforcement . We can't be picking and choosing what a man can talk about. What? Are we going to ban cops from discussing baseball? What about 'hello Mrs Jones, how's the husband and kids, has Mr Jones been staying sober?'","post_message":"Should officers be allowed to preach to civilians while on duty?"}]
