[{"comment_id":"1289811051085647","commenter_b":"Nothing prepares your for a move a bitch ass pussy makes smh","commenter_a":"Always gotta be ready. I definitely think it was a pussy move though","post_message":"What a cheap shot! #mma #cheapshot #wshh www.worldstarhiphop.com/videos/video.php?v=wshhfsWHNoydsw8M0AY7"},{"comment_id":"1607217966231983","commenter_b":"Both are trash , miley gross she nuts to she better grow up !","commenter_a":"Both are idiots","post_message":"Hillary Clinton and Miley Cyrus are a match made in Hell"},{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"},{"comment_id":"10154573950249411","commenter_b":"Wow, it's funny how Democrats claim to be the party of love and tolerance but all her supports sound like you, ignorant!","commenter_a":"Way before this his own party should have replaced this dumb ass! And his dumbed down supporters have only remarks about Clinton whenever this ass wipe says and does something outrageously stupid! Shows they have the same low mentality as Trump! Trump doesn't have the smarts or the temperament for this position. Anyone who would want this dummy anywhere near some nuclear button are just as delusional as Trump or just as dumb and sure don't give two shits about this country! Trump will never ever be president of this country and we can look forward to one of the biggest meltdown and temper tantrums from this maggot!","post_message":"Case study: When mainstream media morphs into political activists."},{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."},{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."}]
