[{"comment_id":"1812447718973572","commenter_b":"Trump could not be trusted with his own password on Twitter!","commenter_a":"Habeis conseguido que este mas hasta los huevos de los que hablan de Donald que del pato.","post_message":"Only four days until the inauguration! Who will be meeting president-elect Trump today?"},{"comment_id":"1790748334489343","commenter_b":"So go.","commenter_a":"Goodbye to all the rif-raf. America will be great again!","post_message":"SHARE THIS IF YOU WILL BE HAPPY TO SEE THEM GO!"},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."},{"comment_id":"10152699029652377","commenter_b":"Idiot comment of the day","commenter_a":"Top reason. He is not Obama!","post_message":"Marco Rubio for President 2016?"},{"comment_id":"1308041469292102","commenter_b":"Yet he never put anyone first ever in his life. You are believing a con man who is very good at conning people like you!","commenter_a":"All of this hate, all of this rage, against one man because he want to make this country great again, says a lot about those who want to stop him, and should be even more of a reason why Americans should vote for him, because he wants to put us first - I think that's a great idea.","post_message":"Show insiders told the AP that Donald J. Trump rated female contestants by the size of their breasts and talked about which ones he'd like to have sex with."},{"comment_id":"10153947256054369","commenter_b":"You don't know much about the Black Hills or surrounding areas, do ya there, Todd and friends.","commenter_a":"What the hell is there to do in South Dakota","post_message":"You work hard, here's where to retire well."},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"}]
