[{"comment_id":"10153260257844614","commenter_b":"Signed!! And shared!!!","commenter_a":"Let's start a petition to ban this person. Apparently not fit to perform the duty","post_message":"Gabriel Fernandez parents allegedly beat him to death after dousing the little boy with pepper spray, forcing him to eat his own vomit and locking him in a cabinet with a sock stuffed in his mouth, according to court records. Now, the Department of Children and Family Services supervisor who was fired after it was determined he missed opportunities to save the 8-year-old Palmdale boy is close to getting his job back. Gregory Merritt was among those who decided to close Gabriel case shortly before his death even though he knew the boy had written a suicide note and had a BB gun pellet embedded in his chest. A civil service panel recently voted unanimously to reinstate Merritt, imposing a 30-day suspension in lieu of termination, the L.A. Times reported. Read KTLA story here: @webpagelink"},{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"498451153654689","commenter_b":"This is one more reason we need you","commenter_a":"I want to vote for you. However, would you please address the very serious immigration issue.","post_message":"Just spoke to National Right to Life Convention. We are united in cause. Thanks for having me. Defend the defenseless. We are the voice for the voiceless. #HealInspireRevive"},{"comment_id":"10153646418046770","commenter_b":"Me too...bad ole' white Cain and Trump lovin' women...shame on us...NOT!","commenter_a":"Love you Herman Cane! Oh, wait, you are black and I am racist! Isn't that what they say! Oh well, I love you, Dr Ben, Allen West! I guess I can be racist some other day!","post_message":"The Cain Train is Back in the Station - Herman Cain is back again live on day 2 of Trump's Convention"},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"983699055080206","commenter_b":"Stay out of the bedroom of married women.","commenter_a":"Yes because of his sorry voice and music, put your money where your loud mouth is west, take on a navy seal and see what happens to your sorry arse. Then let them send you to pakistan and see what happens, I bet body bag for you","post_message":"DELUSIONAL! Kanye thinks he's tougher than an American soldier. 'LIKE' if you think Kanye West is just a completely idiotic LOSER. [Read below] @webpagelink"}]
