[{"comment_id":"10152906505382169","commenter_b":"Fascist pigs always think they'll be spared by the police state for being boot licking authoritarians. Never really works out that way though.","commenter_a":"America is a complete mess right now because of the Flower Power Generation, Obama, and liberal lunatics. Way to go, @username, just fanning the flames even more with this story. I'll be glad when the Flower Powers die off and we can have America normal again.","post_message":"TONIGHT: Return to the most divisive moment in American history since the Civil War, and witness the mayhem that followed the Kent State shootings.   THE DAY THE ‘60S DIED airs at 8/7c on PBS as part of a special programming block commemorating the Vietnam War. #VietnamPBS Learn more: @webpagelink"},{"comment_id":"10153952866914726","commenter_b":"IN TODAY'S WORLD YOU CAN DO ALL KINDS OF THING LIKE MAKE UP POLL NUMBERS AND VOTES HELL I,M SURPRISED THEY DON,T HAVE BUSH IN FIRST PLACE THESE DUMB FUCKS KEEP TRYING TO PUSH BUSH IN A RACE HE DOES NOT BELONG THE ONLY WAY HE IS GOING TO WIN IS IF YOU JUST GIVE THE FUCKING THING TO HIM","commenter_a":"Don't look now people, but there may be a Clinton & a Bush in the 2020 or 2024 races. George Prescott Bush(Jeb's son) & Chelsea Clinton.","post_message":"The Bushes are back and looking for a big win — whatever it takes..."},{"comment_id":"935666689826142","commenter_b":"Tom thats only because fox hires those wannabe dumb blonde bimbo beauty queens who are only good for getting idiots who watch them get a hard on.","commenter_a":"How low does your IQ have to be to qualify as a Fox viewer?","post_message":"Um......what?"},{"comment_id":"10153107912406051","commenter_b":"I hope she gets eaten by a carnivorous flower","commenter_a":"Or go egg free. Its possible. Vegan all the way!!","post_message":"We're going through the worst egg shortage in US history. What does that mean? It means get ready to pay a lot more for all your food."},{"comment_id":"875360339257302","commenter_b":"God did not allow it but there is also an evil force in this world called Satan. Satan was at work in the guy trying to take the child but God was working when he was stopped. Give evil the name that it has and that is Satan.","commenter_a":"All the comments are giving credit to the determination and strength of the mother and the officer for being on site at the right time. Why is it so difficult for everyone to see it is the hand of God that gave the mother strength and put the officer exactly where he needed to be. We are not victims we are conquerors. We can do all things through Christ Jesus.","post_message":"Video captured a Florida mother wrestling her own daughter from the arms of a would-be kidnapper inside a store. The suspect ran out of the store but was quickly stopped by an off-duty police officer at gunpoint. @webpagelink"},{"comment_id":"10154692047301037","commenter_b":"Guess she can dress anyway she wants. Is that a big deal?????","commenter_a":"Hillary is on heroin!She wears long sleeves always even when its 95° out.And she fell out at the 9/11 memorial. And she'd have to be on heroin to put a U.S.Ambassador in a war zone with a couple of bodyguards. The last one he may have had some info that could get her convicted and that was a way to off him.","post_message":"“He has delusions—I’m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes, then denied he said it in front of a hundred million people.”"},{"comment_id":"1234054046635197","commenter_b":"Mary Williams jealous of a Roger Ailes flunkie?","commenter_a":"I freaking hate Megyn Faux News Kelly. Arrogant, narcissistic twit.","post_message":"Holy crap! D.L. Hughley called out Megyn Kelly and Fox News for their coverage of police brutality and he did not mince words."}]
