[{"comment_id":"773846622745734","commenter_b":"'@username Hillary is For everyone . Remember being rich does not make for a bad American. Honesty and integrity and caring about each other is what matters . Turn on ur heart lite ( just like Hillary said ) Everyone matters and together we can be a united people .","commenter_a":"Well, now I feel guilty! Before her uplifting victory speech about sticking together and lifting each other up, I was on another site smacking Bernie Brats upside the head. I'm gonna work a little harder on that ' love each other ' thing! Sorry, Bernie folk! So, gently, respectfully, and with loving patience in my heart: Go Hillary, go!","post_message":"It may seem odd to hear someone running for president say we need more love and kindness in America—but we do."},{"comment_id":"10153237578092144","commenter_b":"So she's dumb n ugly","commenter_a":"she's as smart as she is beautiful...","post_message":"To borrow a line from 'Jaws,' she's either very very smart or very very dumb."},{"comment_id":"10153653816037377","commenter_b":"NO AMERICAN FLAGS!","commenter_a":"The color of Hillary stage is UN blue. No America to be found.","post_message":"As the Democratic National Convention entered its second day, presumptive presidential nominee Hillary Clinton's campaign is getting ready for Wikileaks to release more purloined emails and downplaying their potential impact."},{"comment_id":"988263084573780","commenter_b":"Iam not ur bitch","commenter_a":"'@username Jøkêå Downey-mccain Kealeo Dixon @username 😂😂😂","post_message":"When Your Whole Squad On F*ckery Level 10!"},{"comment_id":"998546203523695","commenter_b":"when i ask, it's bengazi","commenter_a":"No president has ever endured the disrespect that President Obama, has. If there are people out there, that say that race has nothing to do with it. then they are the ones that are doing it.","post_message":"Sign your name if you're still standing with President Obama → @webpagelink"},{"comment_id":"10153897957233352","commenter_b":"Stfu","commenter_a":"He was a menace to the world. He destroyed so many lives so that he can so call keep the children of Columbia to stay away from drugs. What a bum. He destroyed lives right here in the USA., way too many.","post_message":"My life with the world’s most infamous drug lord: Pablo Escobar’s son reveals the heartbreak, fear of violence and how his father once burnt $2MILLION in cash to keep warm one night on the run"},{"comment_id":"1117955828258960","commenter_b":"Smart girl","commenter_a":"Why doesn't he acknowledge Tiffany??--- his daughter with Marla??","post_message":"Donald J. Trump has asked the White House if his adult children can have top-secret security clearances."}]
