[{"comment_id":"10153303433876162","commenter_b":"Hope not. There is nothing wrong with having a woman president. However other countries in particular the middle east countries dont see women as equals.","commenter_a":"I seriously hope people don't vote for her to have a \"first\" female president.","post_message":"CLINTON 2016? Hillary Clinton is expected to announce her candidacy for President tomorrow. Here's what you need to know: @webpagelink"},{"comment_id":"1128370543896366","commenter_b":"Girl quiet !!","commenter_a":"When I would sneak in food for you while you hid your pregnancy with jayden from my parents. Jacqueline Carranza 😂😂 #iGotChu","post_message":"Sibling goals!"},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"10153594866289641","commenter_b":"Ignore these followers of ayesha exploiter. their book says its good to drink camel piss and have sex with a goat.. dont mind these illegitimates children of arab savages","commenter_a":"WTF.....I know so many Hindus who drink cow's milk. ...n why shouldn't they eat beef. ...totally nonsense. .","post_message":"In Hinduism, cows are deemed sacred and their killing a sin."},{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"},{"comment_id":"1252133991511641","commenter_b":"Hillary Clinton for the next president","commenter_a":"Just like President Obama said, if his own campaign can't even trust him with a simple tweet, then why should we trust him with the nuclear codes? #VoteBlue","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"}]
