[{"comment_id":"10153331066431162","commenter_b":"Who cares!? It's not like he did it himself and besides back in the day that's what people did. It wasn't right but that's what happened alot has changed since.","commenter_a":"It does not matter he did not do it if we look hard enough I'm sure we all have someone in our family history who's done something we are not proud of","post_message":"Ben Affleck is coming clean about why he wanted to keep a slave-owning ancestor a secret @webpagelink"},{"comment_id":"10153877177851162","commenter_b":"Get raped to death","commenter_a":"I'm not sure if they deserve death or to get raped everyday. Tough call.","post_message":"JUST IN: Two men have been charged with murder in the fatal shooting of a pastor's pregnant wife during a home invasion.  Amanda Blackburn was raped and shot in the head during the attack at the couple's home. She died the next day.  NEW DETAILS: @webpagelink"},{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10153083814076051","commenter_b":"Americans! Utilitarians. They have no use for you unless they can use you.","commenter_a":"'@username said it all.","post_message":"This dog has one little deformity. Still, his owner decided it was just too much to deal with and opted to get rid of him."},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1102153109844436","commenter_b":"Women need sex","commenter_a":"She should be locked up! She's sick! And just to say a massive thankyou to this brave soldier for looking after us and our country x","post_message":"How can a wife be so heartless?"}]
