[{"comment_id":"10154575658114255","commenter_b":"The women who want to be at the beach fully clad should be left alone. Why is this an issue?","commenter_a":"Those women would be sentenced to death for not respecting the laws and religion of some countries.","post_message":""},{"comment_id":"659659264197547","commenter_b":"We all know why he said this... Statistically speaking illegal immigrants will vote Democrat.. This is another reason why they do not want voter ID... It is not racist to want voter ID... everyone carries an ID.. Again a narrative from the left, In 10-15 years will we will be a one party country... We will also have a single-payer system, so get in line and prepared to wait for your doctor because you are now dealing with the government which is like dealing with the department of motor vehicles.. We will also have 500,000 more Syrian refugees in this country, A pay for play with Soros, she is a puppet for him... All of our tax dollars will have to pay for these refugees and all of the entitlement programs, along with all of the illegal immigrants in the country currently... We are on our way to socialism, open ...","commenter_a":"Well, in the next three days you will see our crooked media , led by CNN and NBC , run all the dirt they can dream up on Trump and absolutely nothing negative on Hillary despite all the information. It's our last chance to get rid of corrupt Washington insiders like the Clintons. VOTE TRUMP !!!","post_message":"***SHOCK*** Days before presidential election, Obama is openly and blatantly thumbing his nose at the rule of law that governs American elections..."},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"917042908355458","commenter_b":"Shut your moaning you wench","commenter_a":"so all three of them are showing themselves to be dickheads!!! i hope to god they dont get another show. may and hammond are basically saying its acceptable to punch an employee! DISGRACEFUL!!","post_message":"Top Gear's May and Hammond ‘WILL quit with Jeremy Clarkson’"},{"comment_id":"1562278293792195","commenter_b":"Hillary for PRISON !!!","commenter_a":"Deplorable in fl","post_message":"Join Chris Jansing at the polls from the key battleground state of Ohio Live! Full coverage all day: @webpagelink"},{"comment_id":"10153377125868984","commenter_b":"This administration doesn't WANT to bring people together. They constantly pit people against each other with inflammatory, insulting rhetoric - while involving themselves with the worst of the worst (like Al Sharpton). The entire world is up in flames and it's getting worse and not better.","commenter_a":"She's just pathetic.","post_message":"Michelle Obama just issued a message to black America about what white people do to \"folks like you and me.\"  This woman needs to be exposed for what she is telling our youth... spread this everywhere so Americans know who's REALLY trying to divide the country."},{"comment_id":"1031660353527286","commenter_b":"I dunno, it seems like America went from a pretty nice country with polite, religious hardworking people to lazy, angry mean spirited race conscious materialists since those days. So I think there is nothing to celebrate in this 40 year decline since then.","commenter_a":"I am surprised the director of this movie which claims it is historical, heard recording of 1964 meeting between LBJ and MLK and knew Johnson cared deeply over black voting issue but she depicted him as indifferent! Why would she do that? I hear LBJ daughters and aides are furious!! We should all be!!!","post_message":"Our so-called #CivilRights president: I am surprised the new Selma Movie omits the Obama connection—oh wait, there isn't one!"}]
