[{"comment_id":"1404388792935308","commenter_b":"For those of you that vision oriented. 😝","commenter_a":"Michael is a cutie, btw. 😉","post_message":"You have to admit that this is a pretty great way to highlight the hypocrisy of anti-trans politicians."},{"comment_id":"1020783114655014","commenter_b":"Hillary is a racist!!!","commenter_a":"always my president hillary clinton the best of live 100% help fanta t jolie kant","post_message":"Hillary Clinton holds a net favorability rating of 58 percent among Democrats -- an increase of nearly 10 points since October."},{"comment_id":"10153918436462619","commenter_b":"God have mercy on those who hate","commenter_a":"Revenge is mine says the Lord!! Definitely a different God!!","post_message":"An Islamic State terrorist praised Wednesday's attack on Charlie Hebdo, telling Reuters the attack was revenge for insults against Islam."},{"comment_id":"10153443636529087","commenter_b":"She is another racist B*t*&","commenter_a":"Influential? I think her 15 minutes were up some time ago.","post_message":"Influential conservative commentator Ann Coulter called claims that Ted Cruz was a natural born US citizen 'absolutely false,' joining Donald Trump in questioning whether Cruz can legally run for president."},{"comment_id":"10154375635804342","commenter_b":"'@username oye pendeja....white girl....give it a rest!","commenter_a":"As long as Trump doesn't show up, I don't see the problem. He can't help who supports him, just like Hillary can't help that all her supporters are cry babies.","post_message":"One of the largest Ku Klux Klan groups in America plans to celebrate Donald Trump's election with a parade."},{"comment_id":"10154432896669342","commenter_b":"The first 2 females that get drafted if there is one better be his kids.","commenter_a":"What they need to do is send all the government babies to serve leave the women alone","post_message":"The timing of Obama's support for women registering for the draft makes it mostly symbolic, but where do you stand on the issue?"},{"comment_id":"10152743176086545","commenter_b":"It actually doesn't take that long anymore for capital murder death sentences for them to be executed.","commenter_a":"To bad the state can't appeal for the death penalty versus life in prison","post_message":"'I wasn't surprised by the verdict, just based on the overall tragedy of what happened. I was very disappointed that the jury reached a conclusion so fast. We were very kind of shocked by that,' he said."}]
