[{"comment_id":"1391331507694716","commenter_b":"Shut up hoe","commenter_a":"It's really hard to see the rest of us as people when you have to distance yourself with your extreme views and lifestyle to find some amount of self esteem. Keep fooling yourself apparently NBC loves putting you out there to keep poking us in the eye, but we know we are right and you are wrong. That is the standing in America right now.","post_message":"Rachel Maddow was nearly hysterical over Trump's speech. #RNCINCLE"},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."},{"comment_id":"1174084612658964","commenter_b":"They are sex obsessed weak willed bonobos.","commenter_a":"What is the anti gunners obsession with genitals and degeneracy","post_message":"Cocks Not Glocks, the gun control group that literally strapped gigantic dildos to backpacks and made lewd gestures that would get any man thrown in prison, was invited to the White House last week. They actually completed their trip on Friday while I was enjoying my time fishing on the Oregon coast. The Cocks Not Glocks organizers posted their White House trip on all their social media accounts making it a big deal - all while Trump was taking flack for saying the word \"p*ssy.\" Now, as a woman, I have said before that I… [ 224 more words ] @webpagelink"},{"comment_id":"1179869992091535","commenter_b":"Lol yeah never thought about a lefty you ever try those net bags to catch spent casings I use them because we reload that should help","commenter_a":"First of all the guy was lying no way he shot it he said the casings flying in front of his face gave PTSD has anyone ever had a spent casing fly in front of them why shooting the AR not me lol so I doubt he even used one","post_message":""},{"comment_id":"1618315388221218","commenter_b":"Disgusting. The trolls perpatrating this clearly have issues with yor mammas.","commenter_a":"I sure hope so","post_message":"She's got to be scared..."},{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"}]
