[{"comment_id":"1681683485379770","commenter_b":"That should be a crime leave OUR money alone I'm sad to see this .don't we have rights what was this country built on!!!","commenter_a":"Why !!!!!! Muslims ????? Why !!!!! They need to remove there burkka and all the drag queen garb all the poof ta\"s wear !!!!!!!!","post_message":"\"In God We Trust\" To Be Removed From The Dollar Bill Leave the dollar alone. Are country was built on Christian beliefs. Do you think they should leave 'In God We Trust\" on the dollar bill?"},{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"759027444232402","commenter_b":"Sounds like a hate crime to me. Where is Loretta Lynch","commenter_a":"Judson no one cares what you would do, you sound like a child","post_message":"Judson Phillips, founder of Tea Party Nation and a Ted Cruz supporter, said that he would have punched Donald J. Trump instead of endorsing him if he was in Dr. Ben Carson’s shoes."},{"comment_id":"10153304564243525","commenter_b":"Typical knee jerk, fear based response. The terror attack in Paris was masterminded by a Belgian, not a serian. The NSA is a lot harder to get through than the security in Paris. What we need to do is acept the refugees, like Germany has done, and educate them on taking back their contry from the corupt regime AND ISIS.","commenter_a":"This is a very sad situation.","post_message":"#BREAKING Governor Rick Scott says Florida will not be willing to accept any refugees from Syria. Florida joins the growing list of states that have sent similar notices to the federal government. STORY: @webpagelink"},{"comment_id":"10153109594476519","commenter_b":"Women always tell there sob stories, leaving out key facts and events, seen it, been through it, went to jail over it!","commenter_a":"Men that beat woman usually don't get in fights with men.","post_message":"You'll never look at unrepentant woman-beater Dr. Dre again the same way after reading this..."},{"comment_id":"863220680381940","commenter_b":"She looks like a he in drag","commenter_a":"If I have to hear one more time how beautiful and glamorous our First Lady is, I'm gonna take a hostage....not that she couldn't be attractive, but her personality pretty much ruins it.....","post_message":"“Michelle Obama looks like she’s part of the cast of...\""}]
