[{"comment_id":"969277346429620","commenter_b":"Women only have X chromosomes.","commenter_a":"Those babies will never be normal. You need X and Y chromosomes. This is going to be sad.","post_message":"Humanity may have crossed a treacherous threshold as Researchers led by an Indian-origin scientist, have shown that stem cells from the skin of two adults of the same sex can be used to make human egg and sperm cells. What this means is, there is no longer a need for the opposite sex to “create Life”. What could possibly go wrong with “Playing God” and altering the creation of Life? #daysofnoah"},{"comment_id":"10156255636920354","commenter_b":"At least admit you got beat up by thugs...","commenter_a":"To bad the band did not hit him in his lying liberal mouth.","post_message":"Things are about to get VERY interesting..."},{"comment_id":"10153824341126955","commenter_b":"Who has a billion dollars for this nonsense? That obscene wealth needs to be redistributed!","commenter_a":"Sure it Berns now but it will itch latter.","post_message":"HILARIOUS"},{"comment_id":"10153052484116491","commenter_b":"GTFO illegals","commenter_a":"And he shouldn't! Go TRUMP! Out with those freeloading illegals!","post_message":"Even after losing a slew of business partners, including Macy's, NASCAR and NBC."},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."},{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."}]
