[{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic by going straight to the source. Get the full experience at mic.com/enough"},{"comment_id":"10155083954441509","commenter_b":"Bernie sanders , Hillary Clinton,barrack Obama , Set out a bobber in the middle of a HUGE democratic lake , And caught a HUGE amount of sucker fish from the Bernie Campaign, just to find out it was a catch and release campaign ! \"Awesome\" Hand the election to Donald J Trump , Cause it's over for the Democrats Thanks Bernie","commenter_a":"HIllary Rodham Clinton is going to be the 45th~! Putin is manipulating the US presidential election as the De Facto Master manipulator behind Wikileaks- exclusively for his Neo-colonial ambitions. Under Trump's erratic, contradictory rhetoric there is disregard for the 1945 Yalta/1949 Armistice Agreements Border Treaties. A new deal with Putin will re-allocate all former USSR-European domains unless they contribute a \"protection-fee\" Mafia-Culture, upsetting the political/ climate balance of the entire planet;-)","post_message":"Protesters chanting “No TPP” disrupt Representative Elijah E. Cummings' speech at the Democratic National Convention in Philadelphia. @webpagelink #DemsInPhilly"},{"comment_id":"10153258132214342","commenter_b":"Black man created their selves!!","commenter_a":"Why when cops kill a black man he is justified but when a black man kill a cop he is a coward .. I said this before black man was going to start doing the cops the same way they are doing them ... And it happen .. Sad for this man family. but this what these cops created in the black man","post_message":"An intense manhunt is underway for a 29-year-old man police say murdered a Memphis cop. Officer Sean Bolton, who's a former US Marine, was gunned down when he interrupted a drug deal that would have resulted in just a misdemeanor citation."},{"comment_id":"1248241848569316","commenter_b":"They are coming in on cargo planes in the dead of night and then being bused throughout our country. Once they reach \"refugee\" status they can roam throughout America without any restrictions. Refugee is just a word to make it look right........it is not. Illegals are just criminals and not the best for our country. The new immigrants are not the same that came over after WWII who felt blessed and were willing to be woven into the fabric of America. The new ones are coming for only the money and the Demos are only aiding and abetting them for the votes. Plain and simple.","commenter_a":"Trump is the biggest liar out there. \"We did not discuss paying for the wall\" - Trump \"I made it clear that Mexico will not pay for the wall.\" - Nieto \"Chicago Police told me crime will stop in one week\" - Trump \"We did not discuss stopping crime in one week\" - Chicago PD \"The NFL sent me a letter about the presidential debates\" - Trump \"We did not send any letter to Trump\" - NFL Promises on deportation of illegal immigrants, self-funding of his campaign, no teleprompter, muslim ban, and release of his tax returns, now confirmed LIES. Who still believes conman Trump? #LyingTrump Feel free to share.","post_message":"Donald J. Trump's claim that the federal government has no idea how many undocumented immigrants are in the United States is false."},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."},{"comment_id":"10154099616106162","commenter_b":"I thought it was hilarious","commenter_a":"Double standard. If the tables were flipped we wouldn't even be allowed to mention a lack of caucasians without protests and al sharpton crying on tv.","post_message":"What would this year's Best Picture nominees look like with black actors? Chris Rock, Tracy Morgan and Whoopi Goldberg gave us a (hilarious) idea."},{"comment_id":"10153992655564740","commenter_b":"Both groups are basically the same and it's sad that people can't or won't stand up and think for themselves.","commenter_a":"Story was after the 30 protesters souround the 6 kkk and begin getting violent the 6 defended themselves... 4 of the 6 were arrested... Wtf is going on here.","post_message":"Anaheim police have said “one or two” self-described KKK members have been seen in the city in the last two years."}]
