[{"comment_id":"10154889440018701","commenter_b":"@username I totally agree with you ! So many people are making lame excuses for these kids! They were old enough to be out by themselves with no supervision,THEY MADE THE DECISION to do what they did,which KILLED PEOPLE and DESTROYED HOMES !! I hope the deaths and destruction is imbedded in their minds FOREVER !!! Bad choice of a way to spend your day ya little F***ERS !!!","commenter_a":"As a child a friend and I were playing with fire in a field. We accidentally set a huge bush on fire that could have easily spread out of control had we not had a drink with us. By the grace of god it didn't spread to all the near by homes. We were not trying to burn people's homes down. I think people need to realize that kids don't always think of what could happen. They are children! They will have this on them for the rest of their lives.","post_message":"Two minors have been arrested and accused of starting wildfires that killed 14 people in eastern Tennessee."},{"comment_id":"10154078689087894","commenter_b":"Smh! I find it hard for woman to think they can touch people and think its ok. Everybody don't like to be touched. Yes his a artist performing, not for you to be there grabbing all on his or her clothes just to say \"Oh I grabbed his pants\"!! Sit back and enjoy the show....without touching me!","commenter_a":"Oh please he didn't take his foot and shoved it down her throat! He tapped that girl with the top of his shoe. And because he's a big dude it look harder then what it probably was. She still stay at the show, so she must wasnt hurt that much! 6months is ridiculous!!!","post_message":"Kevin Gates Sentenced to Six Months in Jail for Kicking Female Fan [Video]"},{"comment_id":"1238033529550008","commenter_b":"Cute blonde catching giant gator. There's no race problem here, chill out!","commenter_a":"If this \"Aligator\" was black the outcome certainly would have been different!","post_message":"'Godzilla' did not take kindly to being restrained by alligator hunter Christy Kroboth @webpagelink"},{"comment_id":"10153764153724117","commenter_b":"Hey you fucker","commenter_a":"It's simply beyond comprehension how anybody can even entertain the drivel that spews forth from his vapid-short-sentence-narcissistic mouth. (And disclaimer for the inevitable butthurt Repubs, Clinton isn't any more trustworthy. Happy now?)","post_message":"Donald J. Trump is selling skepticism about the democratic process because he does not believe in it himself."},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"10150782154259999","commenter_b":"I'm a woman and I am voting Sander's. Actually MOST women I know are voting Sander's. I won't vote for Hillary. I'm done with the Clinton's.","commenter_a":"Cue 8,000 virtually identical comments by Bernie Bots, clogging up the comments so no one else can be heard. All nearly identical, all arriving at the same time. Almost like some sort of organized social networking plan. Feel the burn.","post_message":"\"Some folks may have the luxury to hold out for the perfect, but a lot of Americans are hurting right now, and they can’t wait for that. They need the good, and they need it today,\" Hillary Clinton said today."}]
