[{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = 'ca-pub-@username'; google_ad_slot = '@username'; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” The inspector general for the Intelligence Community notified senior members of Congress that two of four classified emails discovered on the se"},{"comment_id":"10153248489871037","commenter_b":"Rob your a pussy.","commenter_a":"Hillary for Prison 2016","post_message":"A variety of sources in the Clinton orbit say they are anticipating an imminent announcement of #Hillary2016."},{"comment_id":"10153745171813837","commenter_b":"She lied. There's a difference.","commenter_a":"Far more honest about her mistakes than Hillary Clinton.","post_message":"MRS. TRUMP: Melania Trump announced Thursday that she took down her website, acknowledging that it contained inaccuracies."},{"comment_id":"1711039005849878","commenter_b":"This Mexican thug should be the one that's taken out. Lots of people would like to see that happen.","commenter_a":"This is so fake people will write anything to make a story","post_message":"This is bone-chilling.  Our prayers are with you, Donald J. Trump!"},{"comment_id":"10154292587651336","commenter_b":"'@username he has submitted the required financial statements","commenter_a":"Running a country isn't the same as running a business. It'd better not be, since Trump has a habit of declaring bankruptcy...and that's not an option for the country. Sure, he's rich. However, he STARTED really rich and would be about as wealthy now or even more so if he didn't go into business at all, based on average stock market gains. @webpagelink/ With his unwillingness to release his tax returns and his inability have to have a serious discussion of policy, beyond 140-character tweets and repetition of: 'tremendous', 'problems', 'so many people tell me', 'better deals', and 'believe me', Trump is most certainly NOT qualified for the job.","post_message":"'I feel Mr. Trump can come and get us better deals. He is a businessman,' former Kentucky councilman David Abbott said. 'I don't want my children Dave and Erika to grow up in debt all their lives.'"},{"comment_id":"546543972211278","commenter_b":"More Bullshit they don't do any of the test you say they do... Your make how much money off Dead Babies at 9 months? Disgusting Women","commenter_a":"Only a woman should decide what happens to her and her body!! Unbelievable that a so called modern nation is still discussing about that issue ! The body of a woman is not a incubator without any rights!!","post_message":"'I will defend Planned Parenthood. I will defend Roe v. Wade. And I will defend women's rights to make their own health care decisions.' —Hillary"},{"comment_id":"1228973160510939","commenter_b":"Typical liberal lesbian! Walking around with blinders on and not reporting the facts.","commenter_a":"She is the problem and needs to shut her mouth people like her have divided this country so much so sad they let her use what is suppose to be a bias platform to put out all this hate","post_message":"Run for Your Lives! Rachel Maddow is now warning that Donald Trump will definitely round up people and jail political opponents.  Meanwhile, you are accused of being a 'fear monger.'"}]
