[{"comment_id":"1877847435771618","commenter_b":"Hopefully she'll keel over and die.","commenter_a":"not so easy to back track in our modern age of electronics","post_message":"FRAIL LOOKING HILLARY HITS TRUMP FOR CALLING NYC ATTACK 'BOMBINGS' -- AFTER DOING THE SAME..."},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"},{"comment_id":"10153054360324411","commenter_b":"your wicked..i no longer have remorse for your kind....it is a tare...to be pulled up by the roots to be shoveled in a lake of ever lasting fire........you can't raise yourselfs up above nothing but killing......it is of old......you want this earth to yourselves.......its not going to happen...like sands in the hour glass ...........your time is short...","commenter_a":"brain washed .........or is it ..in their seed ?","post_message":"URGENT: Pakistani police use tear gas against anti-#CharlieHebdo protesters near French consulate in Karachi"},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10154035810956130","commenter_b":"I just see this on my feed that's sort of dress I wear to a nightclub in Not gonna put her down as i hate bitchness but maybe she could of gone with something little more elegant and saved this dress for a night out","commenter_a":"Before I read it I'm going to take a guess and say it was other women who were \"shaming\" her Oh I was right, although I wasn't surprised. Said it a thousand times. Women's biggest critics and women themselves.","post_message":"It's unfortunate that women can face sexist backlash from other women."},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."},{"comment_id":"1126248447419705","commenter_b":"Yes we need that wall to keep the illegals out","commenter_a":"they would stop coming if we stopped giving them free food and shelter and started shipping them back","post_message":"Donald Trump reiterated this week: If he becomes president, he's building a wall at the border. Would you be for or against the wall?"}]
