[{"comment_id":"10153577909221756","commenter_b":"And finally, Jesse Jackson IV, since I think he likes Kendrick Lamar too?","commenter_a":"@username Mata Though I'm sure you have seen this...","post_message":"High school teacher Brian Mooney used rapper Kendrick Lamar's latest album to teach a unit on Toni Morrison's novel, \"The Bluest Eye.\" Lamar found out about it, and decided to stop in for a visit. Full story here: @webpagelink"},{"comment_id":"10154083516697541","commenter_b":"She a Dildo lover lol..hahaha","commenter_a":"Hahahahhah! Dildo lover! @username lol","post_message":"Kylie Jenner won't be posting on her own app anymore after an inappropriate message went up without her approval."},{"comment_id":"10153610330463132","commenter_b":"Scum","commenter_a":"This concept of if someone slap you and you give your other cheek instead of smacking back doesn't apply here. He killed 9 innocent, unarmed and specifically in a worship place, the crime is much bigger and what is the guarantee he won't do it again??? So no mercy, or leniency must be shown to deal with this BABY-CUT apparently innocent looking monster....","post_message":"\"You have killed some of the most beautifulest people that I know And it will never be the same. But as we said in Bible study, we enjoyed you. May God have mercy on you.\" #CharlestonShooting"},{"comment_id":"982852498479883","commenter_b":"racist hater sit down and shut up","commenter_a":"Oh, sure, especially the way he goes to other countries and slams the US, apologizes for America and bows to other world leaders and racist michelle complains that she wakes up in a house built by slaves, was not proud of her country til barry started destroying it and spends millions of taxpayer dollars taking her huge crew on vacation around the world. They are an embarrassment.","post_message":"Are you proud to have the Obamas representing America around the world?"},{"comment_id":"908006605999185","commenter_b":"Just try to take mine down!","commenter_a":"Good for USA...fuck obama","post_message":"This is HUGE!"},{"comment_id":"557993331054503","commenter_b":"Yes and some she A BITCH from HELL.","commenter_a":"With her freedom.","post_message":"Pentagon Attacks Trey Gowdy, Because He Refuses To Abandon Persecution Of Hillary... He Needs Your Support  He's taking a stand for the soldiers who were left to die.   Do you think Hillary needs to pay for her crimes?"},{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"}]
