[{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"479633975574097","commenter_b":"Every time she opens her mouth ... ........I smell !","commenter_a":"BUSTED! What's done in the dark will get exposed to the light!","post_message":"Hillary Clinton has previously claimed that she and Bill Clinton were “dead broke” when he left the White House, but the two have since amassed millions of dollars in wealth."},{"comment_id":"10153721427574753","commenter_b":"Devious nasty man woman. Ugh","commenter_a":"1 she is a man...2 who cares","post_message":"Caitlyn Jenner just competed in her first golf tournament where she played as a woman. Jenner has always loved golf and this didn’t change when she transitioned. For some reason, it just took this long for her to do a tournament. ET Online shared the details of Caitlyn’s recent golf tournament. Jenner was in the ANA Inspiration Pro-Am in Rancho Mirage, California, on Friday morning and she played alongside former U.S. soccer star Abby Wambach. Caitlyn did a great job on the golf course today... @webpagelink"},{"comment_id":"1765902270312370","commenter_b":"Asshole","commenter_a":"P","post_message":"The message from Ted Cruz and Donald Trump is clear: If either of them become president, Guantanamo Bay won't just stay open -- it will be expanded. Does that sound good to you?"},{"comment_id":"10152920340851051","commenter_b":"What we can't stand u either ghetto bitch","commenter_a":"Sad part is my son is mixed with white......I wish I could do magic and make that part of him disappear.........cant stand white racist mtfhs","post_message":"This woman decided to break up a fight by taking out her gun and shooting into the crowd. The problem is, her son was in the crowd."},{"comment_id":"10155902934120294","commenter_b":"I agree, if its fact its clearly ok to say it. That chick had no place in that store","commenter_a":"They said it loud enough for her to hear. She heard it and it hurts. Just be kind. If you can't say something nice don't say anything.","post_message":"This woman knew what she had to do after the hurtful conversation she said she overheard between a teenage girl and her mom at Old Navy."},{"comment_id":"10154826896060530","commenter_b":"One more time","commenter_a":"Trump won! Get over it! Hillary lost 2 elections and she accepted the loss once she called trump and congratulated him on his win before all the votes were in!","post_message":"#BREAKING: Michigan's Board of Canvassers deadlocked 2-2 on President-elect Donald Trump's objection to a recount of all presidential ballots cast in Michigan."}]
