[{"comment_id":"1309167775828422","commenter_b":"Start packing and get the hell out of America now","commenter_a":"Don't forget to take your BS . with you","post_message":"At least one Hollywood celebrity has kept their word. Here's a star who said they'd leave the United States if Donald J. Trump got elected who's actually doing so...  Bon voyage! We can think of a few more you can take with you!"},{"comment_id":"1179483682071660","commenter_b":"And what is going to stop the criminals from getting guns????? All a gun ban would do is disarm us everyday, good citizens who want to protect ourselves from THE CRIMINALS with guns!!!!!!!","commenter_a":"Stop protecting guns over people. The NRA is laughing at you people every time you defend a gun over a life.","post_message":"A gunman opened fire on a reporter and cameraman during a live television broadcast in rural Virginia."},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"'Madame President Hillary Clinton.'  Do you like or dislike the sound of that?"},{"comment_id":"10154923446001337","commenter_b":"No I didn't miss the point Sorry somebody got killed but I live in a town that that happens every day every single day. I'm so used to it that I'm tired of hearing about it. The human species will keep killing each other forever and there's nothing nobody can do about it so why I get pissy.","commenter_a":"So fucking what. There are bigger things in this world to worry about.. it's a fucking word. Nothing else","post_message":"YIKES. The Joe McKnight case took another strange turn..."},{"comment_id":"10153882814429916","commenter_b":"You can tell she loves BREAD, not that she's inbred.","commenter_a":"Well just look at her, you can tell, she is inbred.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154329807781051","commenter_b":"These insecure women manage to chase away the good men...then end up with another POS and can't figure out why...imo","commenter_a":"Opps!","post_message":"This girlfriend really, really didn't trust her boyfriend, so she decided to send a porn star to test his fidelity while she watched it unfold on camera. She thought she was ready for anything - but she was definitely not ready to see what he did."},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"'Will you go out and pick the strawberries?'  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"}]
