[{"comment_id":"10154082308022293","commenter_b":"Perfect boot lickers. Masters proud of you idiots. More dumb girls.","commenter_a":"I'm sure you liberals celebrated their death too.","post_message":"The discovery of two Catholic nuns found slain in Mississippi on Thursday sent shock waves through their rural community."},{"comment_id":"10153962696310950","commenter_b":"Seriously?? You are part of the problem! What she is wearing is irrelevant! She shouldn't have to wear a turtleneck to keep creeps from thinking they have free reign. Just because a woman wears sexy clothing it is not an open invitation. You still have to have permission period end of story!!!!","commenter_a":"She needs to get some self-dignity and wear something that covers her breasts.","post_message":"The soap star notably did not mention the GOP candidate in her statement."},{"comment_id":"10152632904466636","commenter_b":"Natasha Rebecca","commenter_a":"Zee Gee","post_message":"'She was on a mission,' said the owner of the determined little miniature schnauzer..."},{"comment_id":"10153440458394087","commenter_b":"God please give us her in the White House so we can see her on TV everyday!!","commenter_a":"just a dumb shit for hanging with trump","post_message":"“Do I agree with him all the time? No,' Melania Trump says of her husband Donald J. Trump. 'I think it is good for a healthy relationship. I am not a ‘yes’ person. No matter who you are married to, you still need to lead your life.”"},{"comment_id":"1001645919925097","commenter_b":"why don't she shut the f up and leave","commenter_a":"Open her mouth.","post_message":"Rosie O'Donnell isn't qualified to ___________."},{"comment_id":"10153138369757293","commenter_b":"freedom of religions","commenter_a":"Delaney Lynch","post_message":"“To be the first person to touch something that’s been lost for 300 years is a magical experience.”"},{"comment_id":"10154244033251519","commenter_b":"So @username does not use gas. Good for you.","commenter_a":"Hey they lost a war. Get over it. Ppl been fighting ppl over land since the beginning of our time, even animals do it. What makes Indians so special?","post_message":"Salon's Charlie May was at Standing Rock as protesters celebrated the recent #DAPL news. Veterans, including Wes Clark Jr., bowed and asked Native elders for forgiveness.  Read more: @webpagelink"}]
