[{"comment_id":"814884995294947","commenter_b":"this is sick.stupid bitch,","commenter_a":"SLUT TRASH","post_message":"Only thing this proved is that she is flippin' disgusting. @webpagelink"},{"comment_id":"10153532117044586","commenter_b":"Test on the bimbos that model, that's what I say. Ugly monsters","commenter_a":"Please, help, Humane Society International...please.","post_message":"TERRIBLE NEWS: Here are some of the animals who will be hurt for Victoria's Secret."},{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."}]
