[{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"10152610870925950","commenter_b":"And go on a global eradication war to execute 2 billion Muslims.","commenter_a":"AND; the 100,000 troops need to come from the Middle Eastern nations (not the U.S.)!","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."},{"comment_id":"10153916819542426","commenter_b":"How about what Democrat Bill Clinton did for the black people? And how about Hillary supporting his bill and explaining that black people are \"super predators\"? Now we have a problem with unemployment. People are fighting for jobs, and Obama and Clinton want to allow THOUSANDS of immigants in our country to expand the fight over jobs. Illegal Mexicans are being hired before you or I because they are cheaper. Democrats have done none of you any favors.","commenter_a":"Truth. What gets me is that the Dems get elected in these cities then the voters blame Republicans for holding them back. How can someone you did not elect to run your city have any power to hold you back?","post_message":"\"You're living in poverty, your schools are no good, 58% of your youth are unemployed -- what the hell do you have to lose?\""},{"comment_id":"10154150775406636","commenter_b":"The House of Lords are having this overturned? Since 2005 The House of Lords do not have the authority to overturn a court decision. The highest court in the UK is now the Supreme Court.","commenter_a":"the country voted that Judges are tw@s...but the house of lords are having this overturned..","post_message":"More follows"},{"comment_id":"991078264282036","commenter_b":"Tom Schmidt I beg to differ !!!!!! She is very much for woman and for men to!!!!!!","commenter_a":"Women let's unite for Hillary. President Hillary.","post_message":"Raising the minimum wage, paid family leave, child care: These aren’t just women’s issues -- they’re also family issues and economic issues."},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"}]
