[{"comment_id":"10153383373028984","commenter_b":"Why don't you go back to where you came from Asshole!!!!","commenter_a":"President Obama said the right thing.","post_message":"Israelis are NOT happy about this, and it's easy to see why. Whoever becomes president in 2016 will have a lot of work to do in repairing relations with Israel...  Do you support Benjamin Netanyahu - בנימין נתניהו and Israel despite what Obama does?"},{"comment_id":"10154769435278812","commenter_b":"Does this lady ever stop lying roflmao","commenter_a":"and Hillary thinks her connection to black voters is carrying hot sauce in her purse.","post_message":"Addressing the National Baptist Convention in Kansas City, Hillary Clinton took a veiled shot at Donald J. Trump, who made his first trip to a black church on the campaign trail this past weekend and has been making a pitch for the African-American vote."},{"comment_id":"426764770781451","commenter_b":"let the idiot walk home ! she does not deserve to be around others !","commenter_a":"Her Bus, Her Rules.","post_message":"This bus driver decided to teach a foul-mouthed teen some manners."},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"'Will you go out and pick the strawberries?'  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"10154921930118690","commenter_b":"Karim Alyaa Dina","commenter_a":"Bal","post_message":"Integrating into a new country can be hard. That's why Horst Wenzel is teaching refugees the ins and outs of German dating culture."},{"comment_id":"1581842645443556","commenter_b":"'@username We saw that guy with the brains.Did you?","commenter_a":"'i need all the white people to move to the back' that's not racist or anything...shaking my head, god forbid a white person had said that about black people, a riot would break out","post_message":"Black Lives Matter protesters attempted to segregate white members of the media during a demonstration near the DNC. @webpagelink"},{"comment_id":"10152886547876051","commenter_b":"Yep, every woman carries black tape in their purse. What they need is to carry.","commenter_a":"A piece of black tape and the whole situation could have been avoided.","post_message":"This woman was putting her shirt back on in the Target dressing room when she suddenly noticed something glowing."}]
