[{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"\"This video is heart wrenching,\" says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  \"Even a 7- foot wall won't keep your pets safe,\" the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"10157390239980354","commenter_b":"Strip their citizenship and deport them. They do not deserve to be American citizens.","commenter_a":"BLM must be destroyed as a movement...just like the mob, or any other organized terrorist group.","post_message":"The BLM radicals shut down a CA freeway and vandalized an Oakland police station..."},{"comment_id":"10153372997486051","commenter_b":"It's a shame that she's no longer here and those 3 scum-bags are. Too bad she couldn't have shot all 3!!!!!!!!","commenter_a":"The fearless leaders kids.","post_message":"This 76-year-old woman was confronted by 3 attackers. Rather than giving in to their demands, she reached over, grabbed a gun and decided to take all of them on."},{"comment_id":"1099336866769294","commenter_b":"There great on the grill","commenter_a":"they are nasty things.. we have loads of them out here in Texas.. they tear up pasture land and wreak havoc on vegetation and are very dangerous and have been known to maim and kill people who get too close.. I would seriously not encourage residents to take them out unless they are in a rural area and are familiar with how to use caution in hunting them.. get the parks and wildlife involved.. they better know how to deal with them..","post_message":"Update: Wild pigs that have damaged landscaping at Fairmount Park and other Riverside County areas have caused millions of dollars worth of damage, and officials are warning residents to be careful around the animals.  Read KTLA's story here: @webpagelink"},{"comment_id":"1425446234154201","commenter_b":"That chick Greenville Reece is crazy","commenter_a":"Is an idiotic argument when people say that the world is flat take some Physics classes in college and you will actually do experiments to look at this phenomena. Don't educate yourself off YouTube actually read some Physics books, even physics 201 and 202 in college will answer this a question.","post_message":"Kyrie Irving got defensive when a reporter asked him about his recent comments on the idea of the Earth being flat."},{"comment_id":"10153894992921336","commenter_b":"@webpagelink Wake up my friends. Biological Jihad being preached all over Islam is the most dangerous problem to ever face the world because the world is still ravaged by fake political correctness, and many countries are not united as they once were. Immigration without assimilation is invasion. Be a Guardian for good. #CognitiveAwareness #KnowledgeIsPower #Guardians #ProtectYourCountries #AlwaysBeReady #UniteAgainstIslam","commenter_a":"I heard that Obama does come from a family that is muslim. maybe his father but either way he does believe in their ways and as for Hilary Clinton she is a liar a thief and has no business running for president. we do not need anymore murders caused because she has better things to do like warning her family and not America about anything.","post_message":"“President Obama and Secretary Clinton just won’t say it—radical Islam. And they’re making a big mistake…They somehow think that is a declaration of war on religion. And I don’t know where they get that idea. It’s not. It is specifically identifying the enemy.” – Greta Van Susteren  MORE: @webpagelink"},{"comment_id":"10153919889436955","commenter_b":"Trump is the only one who will throw out all of the illegals and anchor babies too stop the influx of Muslims","commenter_a":"Rubio has supporters?????","post_message":"POLL: Who will Marco Rubio supporters vote for?"}]
