[{"comment_id":"860254627375604","commenter_b":"So their religion allows that then ? Bunch of fucking cowards .","commenter_a":"Time to nuke the FILTH........when will the uk and America finally stop bowing down to this scum","post_message":"Some women have been forced to seek hospital treatment after violent sexual encounters"},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"995637910477067","commenter_b":"HATE this hypocrisy. It's perfectly acceptable to tell a skinny woman to eat a hamburger or something, but if that woman then responds with \"eat a salad\", she's seen as a cruel bitch. Hate it!","commenter_a":"Prefer Pink any day to those anoreic coat-hangers.","post_message":"We love this tweet from P!nk about how you don't need a \"perfect\" body to be happy. <3"},{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."},{"comment_id":"10154186163347483","commenter_b":"Are there illegals enrolled at AU?","commenter_a":"They get lot more money from those students. It's about money","post_message":"A statement from the university said: \"Auburn is an international university. Students, faculty and staff from all backgrounds strengthen our campus, and we remain committed to fostering an environment that upholds our values of inclusion and diversity.\""},{"comment_id":"10153315530254203","commenter_b":"Yes,Everywoman has a right to choose.","commenter_a":"Here's one for ya: \"WHAT DIFFERENCE AT THIS POINT DOES IT MAKE!??!?!?!\" (With appropriate accompanying \"toddler having a tantrum\" body language). That's one of MY faves.","post_message":" rights are women rights and women rights are human rights once and for all."},{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"}]
