[{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"},{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you. Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."}]
