[{"comment_id":"980977625292266","commenter_b":"Send them all back to where they came from. We don't need the ANY illegals","commenter_a":"once again in the world of idiots we see how stupid people can get. illegal in country, on welfare, sucking tax payers money and they say they have rights? the only right they have is to get the hell out","post_message":"A group of illegal aliens filed a federal law suit in Georgia for what they claim to be a violation of their constitutional rights by denying them driver's licenses."},{"comment_id":"10153725058711178","commenter_b":"The tea party is NOT a criminal organization. Black lives matter IS a hate groups.","commenter_a":"There wouldn't be a black lives matter movement, if police brutality didn't exist.","post_message":"Is there a double standard in the media for the Tea Party and Black Lives Matter?"},{"comment_id":"10153808886723984","commenter_b":"Idiot bitches","commenter_a":"You just GO Ben!","post_message":"Wow! You don't see Dr. Ben Carson get this fired up too often, but  he sure wasn't taking any of Whoopi Goldberg and Joy Behar's nonsense.  Do you stand with Ben Carson despite the constant attacks from the mainstream media?"},{"comment_id":"10154119755618188","commenter_b":"now why on earth would you go and say something so hateful?","commenter_a":"Glenn is an idiot","post_message":"Crazy flash back photo from the early 90's.    Mike Opelka center and a long haired drinking Glenn."},{"comment_id":"609058575939393","commenter_b":"Not only is she a bigot but she is a lying murdering greedy bigot!!!!","commenter_a":"NO HIL LIAR EE!!!!!","post_message":"Join me in MISSISSIPPI for a few minutes! It is time to MAKE AMERICA SAFE AND GREAT AGAIN!"},{"comment_id":"10152607725262452","commenter_b":"How does he have signal?! Lol","commenter_a":"Meanwhile, we're all on our phones judging this man. Lol","post_message":"It's a sign of the times -- an Instagram photo shows a man missing a humpback whale surfacing just two feet away from him because he was glued to his cellphone. @webpagelink  (Photo via Instagram/Eric Smith)"},{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"}]
