[{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"1033520256666198","commenter_b":"It would be that woman riding in on a broom!","commenter_a":"what governor","post_message":""},{"comment_id":"10154526330973352","commenter_b":"I also stated that this evil woman deserves prison because she knew damn well what she was doing!!!","commenter_a":"This isn't mental health issue. She knew what she did was wrong as she hid the bodies. That's not mental health issues. First thing everyone wants to make of horrible crimes like this is that It's mental health issues. Bull shit. This woman knew what she was doin so call it what it is....it's EVIL. She is an evil woman who got tired of being a mom and decided to kill her children. No empathy for this murderer. Call it what it is. There are just evil people in the world sometimes. Not mental health impairments every time a parent murders their child. She needs to rot to death in a jail.","post_message":"Pictured: The 'pregnant' Phoenix mom, 29, and her three young sons that she 'stabbed to death before stuffing their dismembered bodies in a closet and suitcase and trying to kill herself'"},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."}]
