[{"comment_id":"10152949754631336","commenter_b":"Being the measles were literally wiped out in the US, it had to come from somewhere else. I propose instead of making us get vaccines, we send all the illegals back to their 3rd world countries! Hence, problem solved! Oh, I'll go to jail before I have the government make me have one.","commenter_a":"I'm old school. I remember when country was more important than individuals. I nor my children COULDN'T start school unless I had my shots. What happened? ONLY in America do we have medicine to prevent sickness and ONLY in America does vaccines turn into a political stance. I voted for so and so because of their vaccination policy. WHAT?","post_message":"\"The government believes it owns your body.\"  Judge Andrew Napolitano chimes in on the great vaccine debate. Where do you stand on the controversy?"},{"comment_id":"1801914530074898","commenter_b":"Deport all illigals","commenter_a":"Deport all illigals","post_message":"WATCH LIVE: Donald J. Trump speaks at campaign event - will he address the multiple allegations of sexual assault?"},{"comment_id":"10153780337219203","commenter_b":"I am so fucking over this black lives matter shit. But, you know, I'm a basic white bitch so what do you expect?","commenter_a":"Not true....he said all American lives matter. He's the only one who had the balls to say it and you should give him credit for that DB.","post_message":" lives matter, Sanders responded to uproarious cheers."},{"comment_id":"562921477245254","commenter_b":"I'm so sick of that self-righteous hateful woman.","commenter_a":"Are we surprised? She's just reminding us all what a thin skinned vindictive man Trump is.","post_message":"That didn't take long. Not even a week has passed, and the president elect's team is already warning Trump critics to be \"careful\" about the way they criticize Trump."},{"comment_id":"10152570556535496","commenter_b":"Oh that's right. IT'S ALL ABOUT THE MONEY!","commenter_a":"Some of you should mind your own business and stop throwing judgement at how others live their life.","post_message":"Accumulating reports are suggesting Bruce Jenner is transitioning to female and plans to document the change for a TV docu-series later this year.  See more: @webpagelink"},{"comment_id":"10155215673171337","commenter_b":"He better quit smoking crack with lamar odem","commenter_a":"Someone summon Bill Nye to drop knowledge on him.","post_message":"Um... what?"},{"comment_id":"451215538402360","commenter_b":"I will refuse, fuc her and the dirty dog she rode in this on!","commenter_a":"YES","post_message":"Will You Refuse To Turn Over Your 2nd Amendment Rights To Michelle?  Comment 'yes' or 'no'."}]
