[{"comment_id":"10153846448114087","commenter_b":"No matter what I will never vote for Hillary!","commenter_a":"If, and that's s big if, she ousts her you can guarantee she'll give/get her some other position of influence and big money either public or private sector.","post_message":"Bernie Sanders has put ousting Democratic National Committee Chairwoman Debbie Wasserman Schultz at the top of his list of demands, putting pressure on Hillary Clinton to get rid of an ally accused by her rival’s supporters of tilting the race in her favor."},{"comment_id":"642587655914116","commenter_b":"These people are uneducated and ignorant!!!!","commenter_a":"The blind leading the blind. Good lord they actually believe this nonsense. I'd honestly be embarrassed for them if it wasn't so flipping sad. Dummy down people we're in for a long four years.😥","post_message":"Dear Lord."},{"comment_id":"10153470128239497","commenter_b":"Get outta here!","commenter_a":"Strange new cult forming under my guidance 😈","post_message":"\"Somehow, the account management team has forged a society all its own.\""},{"comment_id":"1281317941894705","commenter_b":"she is crazy in the head","commenter_a":"No","post_message":"So apparently everyone that doesn't support Hillary Clinton is just being juvenile, according to Streisand."},{"comment_id":"1281508448553159","commenter_b":"She probably have a better shot at playing the Wisconsin lottery !","commenter_a":"Man sues Crispy Cream because the blueberry doughnuts don't have the same nutrients as blueberries.","post_message":"Yeah, she's totally got a shot at winning."},{"comment_id":"925264027533346","commenter_b":"So skinny women aren't real?","commenter_a":"oh look real women","post_message":"Large ladies in lingerie are No Angels"},{"comment_id":"1524668304213513","commenter_b":"The other egg isn't going to hatch","commenter_a":"did both eggs hatch","post_message":"LIVE: American bald eagles Harriet and her mate, M15, are caring for their newly-hatched eaglet! So cute! (Credit Southwest Florida Eagle Cam)"}]
