[{"comment_id":"1190105204361047","commenter_b":"Hang the bitch!","commenter_a":"Takes time to plan a coronation!!","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"},{"comment_id":"10153638768074062","commenter_b":"And take your bimbo wife with you!","commenter_a":"Kanye, please listen to the voices in your head and leave the country!","post_message":"Kanye West opens up about rushing the stage during Beck's acceptance speech at the Grammys.   He says the voices in his head told him to do it.  He's also now calling Beck one of the nicest and most respected people in the industry.  Check out what else Kanye had to say and let us know... Is this really just too little, too late? @webpagelink"},{"comment_id":"501432243350902","commenter_b":"The blood will be on your hands when the terrorists and illegal aliens kill American citizens, you child molesting PIECE OF SHIT!!!","commenter_a":"'ELECTED' enforcers for the largest criminal organization on the planet.","post_message":"BETRAYAL.  #RINOStampede"},{"comment_id":"1503406889676883","commenter_b":"Are people really this stupid its kinda hard to belive","commenter_a":"She certainly has enablers on her death wish trip. Medical bills should be paid by her.","post_message":"Do you agree our tax dollars should NEVER be used on any of her medical bills? This is unreal!"},{"comment_id":"455979541241733","commenter_b":"Get a life, lady!","commenter_a":"how many illegals have we settled in nh that are on medicaid using this? what towns are they in, do we have a sanctuary city in nh or are we planning to?","post_message":"Good to see that more than 41,000 Granite Staters have signed up for coverage under Medicaid in the first year of the program. While I continue fighting to improve the Affordable Care Act, I'm glad to see health care reform moving in the right direction in New Hampshire."},{"comment_id":"1050187868329829","commenter_b":"Die already you old prick !","commenter_a":"lol I see the libturd heads exploding in here! Deport them all!","post_message":"On the Texas immigration ruling: President Obama is well within his established Constitutional authority and the legal process will bear that out. The only effect of this ruling is to delay justice for thousands of families in Nevada and across the country. Governors, mayors and law enforcement officers have emphasized that these programs are good public policy, help our economy and keep our communities safe.  Courts are only involved in the first place because Republicans have spent years blocking Congress from fixing our broken immigration system. Congress should live up to its responsibility and pass an immigration bill that secures our borders, keeps families together and provides an earned path to citizenship.  There is nothing stopping the Senate from debating immigration legislation immediately. Unfortunately, the Senate is mired in a completely avoidable impasse over funding the Department of Homeland Security. Senate Democrats have a simple solution for getting out of this jam: take up and pass a clean bill to fund Homeland Security, then move on to a robust debate on immigration legislation.  Democrats’ offer to first fund Homeland Security and then debate immigration stands. All Republicans have to do is say yes."},{"comment_id":"10155266404471756","commenter_b":"I bet the indigenous Indians would love all of us to go home and leave their water alone !!!","commenter_a":"Bull! Obama and Clinton too!","post_message":"Protesters 'March to the Arch' to oppose Trump immigration order"}]
