[{"comment_id":"634164716716710","commenter_b":"They can go suck a weenie!","commenter_a":"When the cold wind blows, I will stand with the Christians. We will stand together.","post_message":"This is the only logical end for the hate for Christians that the militant left have whipped themselves up into."},{"comment_id":"1287037484665003","commenter_b":"DRAIN THE SWAMP !!!!!!!!","commenter_a":"I agree they can ,than they can be fired also!","post_message":"Democrats want EPA staffers to RESIST Trump"},{"comment_id":"10152923308511130","commenter_b":"Women lie about is ALL of the time, right?","commenter_a":"Imagine if women didn't falsely accuse men of rape because a man 'upset her'. (It happens ALL of the time.......) Maybe more men would reach out. Instead, modern feminists slam men daily then expect to be worshipped?","post_message":"Powerful."},{"comment_id":"10150645509299999","commenter_b":"Apple should have made an iPhone 4C. Then all the women can just buy it. Problem solved.","commenter_a":"I visited China a couple of years ago and my guide, a 30 year old woman had written herself off already for ever finding love. She told me women in China look for the 4Cs: car, condo, credit, cash in a man. I laughed. But she wasn't joking...","post_message":"“Even though she’s a successful woman, she would come back home and be nothing in her mother’s eyes because she is a single woman.”"},{"comment_id":"904121959720983","commenter_b":"Lock Her up!","commenter_a":"Behind bars fits her","post_message":"America is waking up!"},{"comment_id":"1732731136976178","commenter_b":"'@username STFU","commenter_a":"No one will care! Liberals will vote for this criminal no matter what she does!","post_message":"New details about the investigation into Hillary's pay-to-play scheme while she was Secretary of State."},{"comment_id":"579350648893184","commenter_b":"These other ones need to keep on walking","commenter_a":"At Portland High graduation three young muslim woman remained seated during the National anthem, one of them grabbed the hand of the young muslim man who was standing , trying to get him to sit.He brushed her hand aside and remained standing.Then she turned around to face a large group Muslims and tried to get them to sit.Everyone of them remained standing.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO]. If you don't respect our country, feel free to leave. Do you find this disrespectful?"}]
