[{"comment_id":"1173415112684267","commenter_b":"Society is being destroyed by this abomination! Gay lifestyle brought the AIDS virus, now innocent woman and children are dying because of promiscuity, bisexual acts, and gay relationships! Sin has deadly consequences that all in society pay the price for! That's why Rian!","commenter_a":"I agreed ban same sex marriages.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"905632936170129","commenter_b":"No mames wey pobre jente k vive cercas!!!","commenter_a":"Luis atacko godzila.","post_message":"Huge Chemical Plant Explosion In Tianjin, China!"},{"comment_id":"404934952964433","commenter_b":"We will be screwed with either of these two jackasses!","commenter_a":"I hope I never hear of either ever again","post_message":"Will Jeb Bush face Hillary Clinton in next year's race for president?"},{"comment_id":"1067424023316727","commenter_b":"Just what the world needs- an entitled fat black woman - how unique....","commenter_a":"i am sorry but i am so sick and tired of la'porsha bashing on FB, that is her opinion which she is entitled to. she was probably raised in a small town with narrow minded views and parents who put those ideas in her head. she is a beautiful talented woman who is raising a child on her own since was a victim of domestic abuse. she is using what she went through to help other women dealing with the same. we need to focus on her talent and contributions to society not her own personal views. i am gay and i have gay friends who are not thrilled with the gay lifestyle either, and it's this kind of unnecessary bashing which causes negative feelings. i voted for the ultimate winner trent who also was from mississippi and i don't see any interviews with him about the lifestyle. so ease ...","post_message":"Should we forgive La'Porsha Renae ?   American Idol"},{"comment_id":"10152777705324877","commenter_b":"not true.","commenter_a":"True. And she knows and will continue to go along with... People like them are ALL ABOUT money, and will do ANYTHING to keep it coming in their accounts!","post_message":"Mike Huckabee: Jay Z Is Crossing The Line Of Husband To Pimp. Read more of the conservative's tirade on Beyonce and Jay Z.   Grio fam, read his words and sound off with your thoughts."},{"comment_id":"693348717485384","commenter_b":"Someone beat his ass.......again.","commenter_a":"A disgrace to the American oeople...Harry Reid you are way, way past your usefulness, so why don't you just go home","post_message":"SEN HARRY REID (D) UNLOADS ON THE SENATE FLOOR HATE SPEECH AGAINST TRUMP (VIDEO)  @webpagelink"},{"comment_id":"1632165196804485","commenter_b":"'@username how are we snowflakes if we don't want to hear the opinion of some feminist being sad about a pipeline when there are thousands already in this country. To the other side of the wall for you.","commenter_a":"Unfollow.","post_message":":("}]
