[{"comment_id":"10153796202658797","commenter_b":"I sure am glad this lady didnt work at a bank....","commenter_a":"really?? you're going to fire a pregnant employee for being robbed? how dumb and stupid and idiotic can they be? are they blind and deaf SHE JUST GOT FREAKIN ROBBED. i say sue them dumbasses","post_message":"YOU'RE FIRED! Marissa works at a fast food place. She’s 5 months pregnant. Imagine her terror when a gunman jumped the counter and demanded money. He got away with nearly $400. But Marissa says the store blames her. They gave her a choice: She can pay back the money or lose her job. But the store has a very different story:"},{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"10152972519324753","commenter_b":"This bitch","commenter_a":"Nathan Perez @username omg","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"10153477021199087","commenter_b":"Needle dick","commenter_a":"What will Obama give them for his release?","post_message":"#BREAKING: North Korea announced Friday that it had arrested an American student for allegedly carrying out \"hostile acts\" against Pyongyang."},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."}]
