[{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: \"After the failure of 'After Earth,' a thing got broken in my mind...\""},{"comment_id":"1184451798317737","commenter_b":"Foolish, foolish woman.","commenter_a":"SHE IS INSANE TO WANT DONALD TRUMP! I HOPE SHE KNOWS THAT SHE AND ALL THE REST WILL BE THROWN OUT ON THEIR HEADS!!! CAN NOT BELIEVE THIS!!!","post_message":"Saba Ahmed is trying to convince other Muslims to support Donald J. Trump."},{"comment_id":"10153573907066509","commenter_b":"She couldn't bring women down, only herself!","commenter_a":"I don't want to swear.... but.....way to go bringing the equality movement down a peg! !!! You really didn't think that one all the way thru!!!! :(","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"1311480565578355","commenter_b":"@username. She in Aussie. This yo opportunity to get rekt by her wrecking ball. Heh.","commenter_a":"Noooooooooooooooooooooo we don't need pollution here","post_message":"Miley Cyrus could soon be calling Australia home."},{"comment_id":"10154780872790695","commenter_b":"One tactically trained security Guard at the massacre in Orlando changed nothing.","commenter_a":"RIP young angel If the school faculty were allowed to be tactical trained and had permission to use a gun in this kind of cases our kids would be safer idiots would fear and no one will have to shed a tear","post_message":"JUST IN: The coroner has confirmed 6-year-old Jacob Hall died this afternoon.  Hall was one of three people shot during an elementary school shooting in South Carolina earlier this week."},{"comment_id":"10152930337971749","commenter_b":"Gramma Cankles will NEVER be President...","commenter_a":"Can't wait for Hilary. All the brain dead idiots heads will explode.","post_message":""},{"comment_id":"10153564606248984","commenter_b":"She needs to be taking down. She not worried about what you doing. This needs to be done quickly","commenter_a":"She should not be allowed to run. She is a liar bad person evil evil !!!! If she gets in people pack your bags go anywhere don't stay here she will put the cherry on the demise of our country !!!!!!","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it!  Rep. Trey Gowdy won’t tolerate her deceit, and neither will we.   Send a message to Rep. Trey Gowdy telling him what you think!"}]
