[{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"10152874635857894","commenter_b":"There's a reason she can't get and keep a man.","commenter_a":"Rob Spencer","post_message":"The Wife of Kenya Moore’s ‘Millionaire Matchmaker’ Boyfriend Speaks Out: ‘She Knew He Was Seeing Somebody!’"},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"10155175533915389","commenter_b":"Looks evil. Tired of the liberal PC bull :poop: that is going to end up killing good people. Maybe if the Terrorist went after liberals only..they wouldn't be in a hurry to let these murders free. Starting with Washington please","commenter_a":"What is this world becoming","post_message":"The United States Department of Justice said a former Al Qaeda operative was released last week from a federal prison prior to completing his 15-year sentence because of “time served.”"},{"comment_id":"10154909768331509","commenter_b":"The World knows Obama and Hillary have failed us.","commenter_a":"Trump might use be them, but Hillary will email them to someone..","post_message":"The U.S. president has the power to order a nuclear strike anywhere in the world at any moment -- so choose your next leader carefully, America. (via CNN Opinion)"},{"comment_id":"10153233810444087","commenter_b":"She is lying","commenter_a":"They didn't bring their girlfriends","post_message":"“I think there are lots of people who wanted there to be a race for different reasons and they thought the only way to make it a race is a full-scale, frontal assault on her. This email thing became the biggest story in the world.\" said President Bill Clinton about the controversy over Hillary Clinton's email."}]
