[{"comment_id":"1124537887639264","commenter_b":"It is a shame that one of the frontrunners for the Presidency is directly responsible for spreading the fears and bigotry that lead to this nonsense. Islamaphobia is going to ruin this country from within..","commenter_a":"And so it begins again The seeds of hate, distrust and ignorance have sprouted","post_message":"She never could have expected this. Not in America..."},{"comment_id":"10155000451429228","commenter_b":"When the Ayatollah came to power in Iran, Iran had a major drug problem. They hung their way out of it; they didn't hang anywhere near all the addicts . . . It's just that, apparently, people can get the \"disease\" of the addiction under control if they see government is serious. **** The Nation of Islam cleaned up some housing projects in the 90s, again, with lots of negative reinforcement--then the ACLU and bleeding hearts put a stop to that. **** If such measures here could stop drug-related deaths and murders, and give people in projects safe places to live, we would have a net gain. Kindness to the guilty is cruelty to the innocent.","commenter_a":"Oh, well then . . . If criminals don't care, I guess we shouldn't punish them at all. ***** Getting real, living things seek pleasure and avoid pain. If negative reinforcement does not seem to be working, we're just not using enough of it.","post_message":"Missouri's new Governor is asking for tougher laws.  Some experts say criminals don't care."},{"comment_id":"10153329101624087","commenter_b":"Shut em down and bulldoze em!","commenter_a":"HAHAHAHAHAHHAHAHAHAHAH HE HAS 0% CHANCE TO WIN!! WORRY NOT NON- RACISTS!!!!!","post_message":"\"You're going to have to watch and study the mosques, because a lot of talk is going on at the mosques,\" Donald J. Trump said. \"I would hate to [shut down the mosques], but it's something that you're going to have to strongly consider because some of the ideas and some of the hatred, the absolute hatred, is coming from these areas.\""},{"comment_id":"10153589906358984","commenter_b":"Stop giving this ignorant b*tch attention.","commenter_a":"Yes I do send them over to join isil","post_message":"Wow. This news makes her challenge even more shocking...  Do you think there should be a punishment for those who desecrate the American flag?"},{"comment_id":"821592037937050","commenter_b":"And unfortunately it is another woman saying it. SMH","commenter_a":"Doesn't someone always say: \"Forget these women\"?","post_message":"“Forget these women. What you’re seeing is the destruction of a legacy.\"  - Phylicia Rashad"},{"comment_id":"10155048083994182","commenter_b":"she's a jerk","commenter_a":"The only person it would be a stock to is the teachers union . Because they do not really care about the children it's all about them.","post_message":"Elizabeth Warren has been outspoken against Betsy DeVos. But there was once a time she was in favor of school choice....  What changed?"},{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."}]
