[{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"1369581076434970","commenter_b":"Stay on your meds lady","commenter_a":"If you go and read her fb page you will see this is FALSE reporting.","post_message":"Sinead O'Connor has 'threatened to jump off a bridge'"},{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"},{"comment_id":"1035032136534126","commenter_b":"You're a sick woman.","commenter_a":"Go Trump..Tell us the truth because that's what the people want to hear! We don't want Muslims or Cubans running our nation!!! Trump 2016","post_message":"Donald J. Trump wants Iowa voters to keep this one thing in mind come caucus day: \"When you’re casting your ballot, remember.”"},{"comment_id":"1173905836039000","commenter_b":"She's not my plan b.","commenter_a":", Sanders is a good man, sad what the DNC did to him, they rigged the rules against him, Hillary is running all the way to the bank laughing her big fat @ss off, this Democrat will not vote for that money sucking Hag !!","post_message":"Bernie Sanders shoots some hoops with NBC's Chris Jansing. More from the court: @webpagelink"},{"comment_id":"10153901120586336","commenter_b":"If the current laws are followed and enforced like they should be then no one who should not own a firearm would be able to buy a firearm from a license FFL Dealer. Read about it on the ATF website","commenter_a":"This will do nothing to stop the criminals from doing what criminals do. It will only hurt law abiding citizens.","post_message":"President Barack Obama is reportedly finalizing a proposal to expand background checks by executive order."},{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"}]
