[{"comment_id":"10153216177713984","commenter_b":"I have 3 sons--never once did I pack their lunch---for a reason---I wanted them to experience other foods and if they got hungry they would eat what was in front of them---My guys are not picky eaters and like most everything--mission accomplished.","commenter_a":"So people don't want their kids to eat healthy OK LOL!!","post_message":"This unhappy 2nd grader just served up a giant helping of truth about Michelle's school lunch agenda. I bet she had a tough time swallowing this one.  Do you support this kid for confronting Michelle Obama?"},{"comment_id":"10153724551069641","commenter_b":"I remember years ago being in Saudi and Riyadh was lit up like Vegas and I thought this place could be nice after all.the reality came a few days later when walking down a shopping mall with some other guys and some women who were covered were heading in our direction .They made a miniscule mistake of revealing the smalles amount of leg.Out of nowhere came the \"Religious police\",who started flogging them with sticks for this horrendous \" crime\",.The reality of the country set in for how women are treat and this was one of the many mistreatments of people in general i saw.The dark ages is what describes the country .if that is what helps to eventually lead you to heaven i am glad i am going to Hell!Though back then i had an early insight into it.","commenter_a":"Let them vote, drive and have some say so, that is more powerful than anything you could give them.","post_message":"How significant is this change for Saudi women?"},{"comment_id":"10153110515583984","commenter_b":"I've seen out of work lesbian truck drivers. Moore looks MUCH worse.","commenter_a":"Is that Michael Moore in a Debbie Wasserman Schultz wig???","post_message":"I can't believe this radical feminist liberal would so gleefully mock and lie about a distinguished female veteran like this.  Do you support the Republican senator this woman belittled?"},{"comment_id":"1784031898507079","commenter_b":"She is a heartless bitch!","commenter_a":"She still hasn't gone to Louisana like she said she would after the devastation from the recent tropical storm that passed through there . And wasn't it her and her campaign who accused Trump of making Louisana a political stunt when he went to help after? Here she is making it political when it's time to focus on evacuations, preparation and people's well being.","post_message":"As Florida residents prepare for Hurricane Matthew's impact, Clinton buys ads on the Weather Channel."},{"comment_id":"809566335745494","commenter_b":"So women are just as bad as men, better just keep it men. Got it.","commenter_a":"Sorry but all woman in politics have proven just as deviant and en n efficient as men. So let's not rush anything. They should be recognized for there merits. So are the men that have no connections and money. But stile do amazing work","post_message":"Powerful."},{"comment_id":"10153707738441680","commenter_b":"Pathological liar","commenter_a":"When I read these hate filled comments I want to cry. All this hate for a person you do not know and neither do I. I just know that I read bills and reports . I try to see what you all say about Hillary but I just do not see it. I am educated And I am a women I also know if all that is said about her is true men she has defeated would have locked her up a long time ago She is not perfect has she made mistakes sure Haven't we all. I will cont to listen and research and vote for who is best for my children and grandchildren That vote will go to Hillary","post_message":"Hillary Clinton: \"Whatever party you belong to, or if you belong to no party at all, if you share these beliefs, this is your campaign.\""},{"comment_id":"10153576717714024","commenter_b":"This is what's wrong with our country. Not just the BRAINLESS, CLUELESS, MORONS like her in congress, but THE SAME ONE'S THAT PUT HER THERE!","commenter_a":"They do indeed walk among us and get elected","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink #BB4SP"}]
