[{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"10155472723180603","commenter_b":"Girls what happen to being ladies?","commenter_a":"Inexcusable! They should all be expelled and forced to repeat the school year...","post_message":"\"'All these other girls started jumping off the table into the fight,\" said 10th grader Raejah Bratcher. \"Everybody started screaming and people were on each other's backs. Everybody was just fighting, people running in, getting hit, and running out. It was crazy.\""},{"comment_id":"10154131960333797","commenter_b":"It's a free country. She is free to leave!","commenter_a":"Bye bye!","post_message":"\"WHAT HAVE I DONE?\" British-born actress Emily Blunt became a naturalized U.S. citizen in August, but now she says it was a \"terrible mistake.\" What do you think? Here's what made her come to that decision:"},{"comment_id":"10153740832391800","commenter_b":"Chris, honey, being a salty bitch isn't going to solve the problem.","commenter_a":"Islamic Extremists: Kills people that don't share their beliefs, Christian Extremist: Kills people that don't share their beliefs! I say, we should worry about these pro-life extremist before we worry about extremists on the otherside of the earth!","post_message":"In the wake of a shooting at a Colorado Planned Parenthood, the media questions whether or not it was an act of domestic terrorism.  ►Watch last night’s full episode now: @webpagelink"},{"comment_id":"522092037950751","commenter_b":"Lol Uriah Bahl. Bitch","commenter_a":"Fuck these ingins","post_message":"\"It's a tiny community of [about 1,000] people taking on the federal government of Canada and three multi-billion dollar energy companies — opponents with virtually unlimited resources.\""},{"comment_id":"1558544671099313","commenter_b":"Go to hell","commenter_a":"He is such a joke ! I wish he would go back to where he came he's not even an AMERICAN !!!!!","post_message":"This makes my blood boil!"},{"comment_id":"10153952670046509","commenter_b":"Seriously.. Why are people mentioning Asians at all?! Great for them, and when they are highlighted, I praise them too.... However, The point of the article was to bring light to a young man doing exceptionally well. He has a great start to life and a great career. All praises due and deserved. Anything else doesn't even matter.","commenter_a":"Because his SAT scores are off the charts!","post_message":"He was accepted by all 8 Ivy League schools. How’d he do it? @webpagelink"}]
