[{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"1296712253679455","commenter_b":"Domestic Terrorists should be punished to the full extent of the law.","commenter_a":"Bundy, it's time to pay the piper !","post_message":""},{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"10155246118099749","commenter_b":"Just the words am looking for..... Thanks Gladys!!!!!!","commenter_a":"Awww! Whoever is using this little girl for political propaganda should know that she just won't get him or her any positive result.","post_message":"The seven-year-old girl, who became the symbol of the tragedy unfolding in Syria, has addressed President Trump in a moving video."},{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."}]
