[{"comment_id":"10153182922011943","commenter_b":"Time to round up these extremist traitors and deport to Muslim countries!","commenter_a":"She is the POTUS, Obamass is her puppet clown. George Soros funds the riots, paid Obamass millions and Valarie transmits all the government information to Iran where her father-in-law gives to his Iranian people. They know whats going on in Iran before we do here in the states. She had her office and quarters in the WH before Obamass and Mooschelle moved in.","post_message":"It been well documented that Valerie Jarrett, a Chicago lawyer and longtime Obama confidant, is a liberal extremist who wields tremendous power in the White House.   She has connections to many Communist and extremist groups, as FBI files obtained by Judicial Watch show. (SHARE THIS!)"},{"comment_id":"1346176708775407","commenter_b":"Tell that to the two","commenter_a":"God had promised us He will not wipe out humans on the face of the earth any longer therefore the doomsday theory can NEVER happen. It is just a figment of imagination in the mind of the writer of this article. I will rather suggest he asks 'what would happen if Rapture takes place now?","post_message":"What the world would look like if doomsday struck and humans were wiped out"},{"comment_id":"1002821876430463","commenter_b":"There it is. He's going to protect her lying corrupt butt.","commenter_a":"They will only indict her if she losses Iowa and New Hampshire to Bernie then Bloomberg will join. Politics are so filled with crime it's sickening 🇺🇸","post_message":"FUBAR."},{"comment_id":"10153066092873445","commenter_b":"I bet the strippers were forced to strip and what not","commenter_a":"Okay... Retracting previous statement, these fucks need to be jailed... Illegal immigrants being forced into prostitution... Nope! Pigs","post_message":"More DEA Scandal!  DEA Agents Arrested for Lying About Owning a Strip Club"},{"comment_id":"10157633958190389","commenter_b":"@username IDIOT.","commenter_a":"I'm voting Donald Trump and I will not let the media influence me. Yes he has made some clear mistakes in his campaign with \"words\" but, Secretary Clinton has made clear mistakes multiple times with ACTIONS. She's a politician, getting paid by Saudi, Benghazi, getting paid to speak, email server, the list goes on. BUT, Trump showed more heart last night then any candidate I have seen; not because he wants power but because he cares for you & me. After seeing Lester Holt TRY to demolish trump, it did hit me, that the media does have power, and will do anything it takes to get what they want.","post_message":""},{"comment_id":"871197372940012","commenter_b":"What a vile creature! Hope she rots in jail!!!","commenter_a":"Some people don't deserve to work in child care, I worked in child care for 25 yrs & I have seen some things as well, I worked in a nursery room at my last job( where I got injured & can't work again) & my assistant at the time picked up a 7 month old baby by 1 arm which is a major NO NO, carried him across the room & dropped him 1 metre onto cushions, I spoke to her about it & told her it wasn't on & she went & dobbed to the directors & i was the one who got into trouble, at another centre I sw someone tie a 5 yrs feet up & put them in the resource cupboard so they wouldn't wander around during sleep time, they lost their job for it. so many sickos.","post_message":"Footage shows her attacking girl who fell asleep on nursery floor cuddling her teddy bear"},{"comment_id":"10153838476451509","commenter_b":"We \"poor people\" are richer than she'll ever be. Shallow, vapid tart.","commenter_a":"Grande opening, Grande closing. Hopefully her career.","post_message":"Security footage showed singer Grande appearing to \"maliciously lick\" a donut in a shop: @webpagelink"}]
