[{"comment_id":"471664429690804","commenter_b":"THERE IS NO PLACE IN AMERICA for SHARIAH LAW !!!, Not Now... NOT EVER.. IF those people want their own laws.. GO BACK where YOU came from... Never to Return !!!....Close our country to ALL Muslims, those who are here, send them packing back where they came from !!!","commenter_a":"OK Here we go again... we are going to let muslim religious practice in government owned facilities but not Christian or Jewish? No prayer or religious organizations (Christian Athletes Association, for example) allowed for anyone in public schools, but exceptions for muslims? They can have time for prayer and muslim student organizations in school, but we are not to have prayers at student events? Come on SCOTUS ... what the heck is going on? We now have separate rules for muslims? Unbelievable. If the muslim inmate can grow a beard then anyone should be able to do it. They are becoming a government sponsored and endorsed religion. They even provide prayer rugs and call to prayer at gitmo. The state shall establish no religion.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"},{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."}]
