[{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"1229861343720720","commenter_b":"She would govern effectively by not selling out, like HRC did decades ago and like Sanders never did during his campaign. #JillNotShill","commenter_a":"I have liked her page.I'm trying to research her. I have ave some reservations. If she were to win how could she govern effectively? With zero green party reps and senators to assist her. For the green party to be effective we would need down ticket victories also. I don't like Hillary Clinton! I absolutely fear Donald Trump. Voting green in 2000 gave us GWB. That is NOT debatable those that don't accept that are just in denial. Jill's platform is in accordance with my beliefs. I do think that her promise to put Snowden on her cabinet is pure pandering. That troubles me. Voting my conscience would be horrible if it means a Trump presidency.NOTHING COULD BE WORSE! !!","post_message":"Dr. Cornel West on the morally bankrupt DNC Platform: \"There's no way for me, as a human being, a teacher & a citizen - if we can't say a word about TPP, if we can't talk about Medicare for All explicitly, if the greatest prophetic voice dealing with impending ecological catastrophe can hardly win a vote, & if we can't even acknowledge occupation as something that's real for a slice of humanity... there's no way in good conscience I could say 'take it to the next stage!' I wasn't raised like that. That's not my calling. I'm just being truthful. It'd be a violation of my own limited sense of moral integrity and spiritual conscience. That's how I roll.\""},{"comment_id":"10154885110756509","commenter_b":"Build a wall around Connecticut.","commenter_a":"Of course and that is why we love Trump!! He is the only one daring to say the truth!!!","post_message":"\"He's saying what a good amount of people are thinking and don't want to say,\" a Donald J. Trump adviser said."},{"comment_id":"10154199913475530","commenter_b":"You told me about them n we used to look for my Riverland park","commenter_a":"@username Remember us searching for these when we were kids?! Lol","post_message":"Get outside and train your eyes onto the forest floor. Morel season is on in Michigan."},{"comment_id":"10154682808296037","commenter_b":"@username. We don't need male genitalia to be smarter than you. Go run along and play, now.","commenter_a":"In his hand against his thigh. Plain as day. Please save and share for the ignorant.","post_message":"Charlotte police release body camera and dashboard videos of fatal shooting of Keith Lamont Scott."}]
