[{"comment_id":"10153838559734203","commenter_b":"I said it, these muslims terrorists are disgiusing themselves as refugees, it is time for europe to immetiate Autraleria, keep them in prison like camp, then deport them back to where they are coming from","commenter_a":"bull. shit.","post_message":"A Greek official said the Syrian passport holder whose ID was found on the body of one of the Paris attackers landed in Greece last month on a boat from Syria."},{"comment_id":"887276944740413","commenter_b":"'@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"677143662389195","commenter_b":"Shut Up!!!!!","commenter_a":"The Patriots are speaking! Donald Trump is our Patriot Leader! E-verify. Numbersusa.com. Arm all our military - - active, reserve, and veterans. Honor The Constitution / Bill of Rights, limited government, free enterprise, and USAmerican exceptionalism. Make The USA Great Again! Go, Trump! Support the Muslim Reform Movement. No more terrorists! m.facebook.com/Muslim-Reform-Movement-@username/ MuslimReformMovement.org","post_message":"If Donald J. Trump 'gets his way, it will be like Christmas in the Kremlin,' says Hillary Clinton"},{"comment_id":"446969245501847","commenter_b":"We need a first lady with her boobs hanging out ?? Geeeez - that is classy","commenter_a":"Beautiful family! Trump got good taste when it comes to women!","post_message":"Thank you!!"},{"comment_id":"10154796309533010","commenter_b":"She always plays the race card","commenter_a":"If Donald wins When he goes to court for trump university fraud and is convicted. Its a criminal act. And impeachment process can began","post_message":"Like Al Gore, Clinton may be on track to still earn more votes across the country."},{"comment_id":"1442907392435671","commenter_b":"You guys do know you can get disease from women too, right?","commenter_a":"Women who say bisexual men are better have a 130% greater chance of contracting multiple venereal diseases","post_message":"They're better lovers AND fathers"},{"comment_id":"813299352038859","commenter_b":"You're ignorant whores on government programs. Stfu.","commenter_a":"This is her response. She would kill a newborn. Her OWN newborn even. Enough said.","post_message":"Thousands of protesters gathered at the US Capitol this week..."}]
