[{"comment_id":"10150607537004999","commenter_b":"Each act of terrorism has its own agenda. Define the act.","commenter_a":"A hate crime is an act against someone or a group of people based on their gender, race, sexual orientation or religion. Terrorism is an attack in which the victims are not relevant to the agenda. Terrorism is a statement normally made towards a government, a hate crime is a statement towards the victim, it's personal. For me I think a hate crime is more horrific, to hunt and kill someone for being who they are. Terrorism is more of an act of a coward, a hail marry pass.","post_message":"\"Why can’t we own up to the fact that hate crimes are just another form of terrorism, perhaps the worst, since they target the weak among us?\" Read on in The New York Times Opinion."},{"comment_id":"1035305006509971","commenter_b":"No woman should be a republican if they are smart..","commenter_a":"Young Republicans whyyyyyyyyy!!!!!!!!!!! Is any woman a republican?????????","post_message":"\"this young woman’s death serves a purpose. She 'Took one for the team.'”"},{"comment_id":"889604141156365","commenter_b":"YOU LOOK LIKE A GORILLA SLAVE. WAS CHEETA YO MASTER? STUPID FUCKING NIGGER DOESN'T EVEN KNOW THAT IT WAS HER OWN RACE SELLING THEM TO MUSLIMS AND THEN TO WHITE PEOPLE. SOME OF THESE BLACKS ARE THE MOST IGNORANT SOB'S IN THE WORLD. MUST BE A QUEER BLACK WOMAN WITH A NAME LIKE BUBBA.","commenter_a":"First of all she is full of shit! when i worked in burger King you just kept on cooking .you dont know who is getting the Burger.she is pissed because she didnt prepare herself for a better job .Whos fault is that?why do thet put this shit onF.B .It isnt helping anybody It just fans the flames of racism.I find that OFFENSIVE!","post_message":"Did you miss this one? I bet you did because in Obamaland... 'The Media' doesn't cover such stories. Enjoy. @webpagelink"},{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"865498240307419","commenter_b":"She does this for money . She is a witch like her Mom","commenter_a":"I do feel sympathy for Chelsea. She is truly a victim of the unlucky sperm club. She has to defend two people who are seriously flawed while trying to raise her own family. Their lecherous and unlawful behavior are certainly not her fault.","post_message":"Chelsea tried to challenge her, immediately regrets that decision. This woman was forcefully raped by Bill, let's show her some support for god sakes. Can we get 10,000 'LIKES' for her Bravery?"},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."}]
