[{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"1139700699375519","commenter_b":"Stop All Muslims. Send them back where they came from.","commenter_a":"Wrong not here","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"844972862206722","commenter_b":"Why don't women have enough sense to take care of there sex life. U play u pay. Use birth control.","commenter_a":"The guy in the photo wants to be aborted NOW!!!","post_message":"“There are thousands of unborn babies who need us to fight.\""},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"871509956275393","commenter_b":"Fuck u.bitch dani","commenter_a":"Whoopl.is.a.racist bitch","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."}]
