[{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"},{"comment_id":"10153029967097014","commenter_b":"She's a weirdo","commenter_a":"Amy Lunsford JUST DO IT","post_message":"At first glance, the text messages appear to show a disturbing case of cyberbullying: one teen urging another to kill himself. But this was no bully. They were from a 17-year-old girl to her boyfriend, whom she called the love of her life. \"You can't think about it. You just have to do it. You said you were gonna do it. Like I don't get why you aren't\""},{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""},{"comment_id":"685160361665842","commenter_b":"She must have needed something to have married this turtle.","commenter_a":"His wife will head transportation dept. or something. She is anti-union and for big corporations. Family does Business abroad. Her family gave turtle face around 25 million.","post_message":"Astoundingly dishonest."},{"comment_id":"10152831288276636","commenter_b":"Terrible woman screaming like that I'm glad she was sacked","commenter_a":"If it doesn't affect your pay don't let it affect your day let star bucks hire security you getting pay regardless you sell coffee and straw LESSON \"I WILL NEVER BE JOBS WORTH AGAIN\"","post_message":"\"Give me the straw, give me the straw, give me the straw, give me the straw... call the cops.\""}]
