[{"comment_id":"1026880740704736","commenter_b":"Crazy runs deep in that family","commenter_a":"Still 'illegal' still a liar and still not eligible for being in Congress or running for president...","post_message":"Da'fuq?"},{"comment_id":"536832686498611","commenter_b":"Some of bernies supporters have been crazy lately","commenter_a":"Hillary Clinton MAY HAVE BEEN a liberal at one point. She no longer is. She is a bought subsidiary of large business. If Sanders isn't nominated I'm staying home. She won't get my vote. Edit: I also will never forget the racism and division of Hillary supporters who made the entire DNC kiss their ass to mend fences. It's not 'her turn' and if I had my way she would never ever see the White House.","post_message":"Let's not do the GOP's bidding."},{"comment_id":"10152804039052293","commenter_b":"Wonderful news she was untouched, hope her family has a quick recovery.","commenter_a":"Amazing. I also wonder what brand car seat, because I wish to buy that for every expectant parent I know","post_message":"“Then they said her eyes opened and she started smiling,' a relative said."},{"comment_id":"10153000313242383","commenter_b":"you mean Haliburton? .. don't you think they got compensated enough?","commenter_a":"What about the contractors who did everything including making the ultimate sacrifice only to come home and be crapped on","post_message":"Interpreters who helped save Marines lives on the battlefield are fleeing to the U.S. with nothing  so one Marine is pushing to get them veterans benefits. @webpagelink"},{"comment_id":"1273581186010307","commenter_b":"Shut up bitch","commenter_a":"I wonder what u yank heros would do if a dog attacked u?? That's right, each and every one of u pussies would take out your big tough guns and shoot it!! You're all cowards who hide behind guns so don't blame the cops for doing their jobs","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"663841097139802","commenter_b":"F the immigrants, it is Thanksgiving, you Effing Retard. Welcome to America, we are Americans.","commenter_a":"fuck him","post_message":"The Obama administration is trying to ruin your thanksgiving.  This is absurd. We can't let him get away with this.  Will you still call it Thanksgiving no matter what?"},{"comment_id":"10154996547968010","commenter_b":"Let the muther fucker SUFFER!","commenter_a":"Think he'll be well enough in time for Trump to appoint him to the SCOTUS?","post_message":"A source said Manson was seriously ill and it was unclear how long his treatment would take."}]
