[{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"},{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"10150611422369999","commenter_b":"The south wants to keep it.....FLY IT HIGH SOUTHERNERS WHO ARE PROUD OF THEIR HERITAGE KEEPING STATE RIGHTS.","commenter_a":"It's a VA battle flag....why was SC flying it? oh yeah, State's rights were taken away...sad so many people think that war was over nothing but slavery...I'm a history major....would never fly it but I know what it's true purpose is...Those who had confederate soldiers die in their family still use it....KKK ruined it and so did this fool....","post_message":"Breaking News: Gov. Nikki Haley of South Carolina called for removal of a Confederate battle flag from the State Capitol grounds after the white man accused of killing 9 black people was seen brandishing that flag in widely circulated pictures. “It’s time to move the flag from the Capitol grounds,” the governor said."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"1865774367000002","commenter_b":"If you think that way then you should leave as well. This Country actually belongs to the Native Americans.","commenter_a":"I am a lifetime member of the Sons of the American Revolution. My ancestors landed in 1732 and father and son fought in the revolution. All of you republicans whose family landed AFTER that revolution are not \"pure Americans\" and must get MY permission to remain. Ban half breed Americans..only the descendants of REAL patriots may remain","post_message":"\"We're not going to shut up. We're going to resist.\""},{"comment_id":"936217929734331","commenter_b":"Miley is the best white feminist ever! Also, Bangerz was a half-decent album","commenter_a":"She is really a sweetie has a good heart.","post_message":"There's a side of Miley Cyrus that just about everyone misses."}]
