[{"comment_id":"10152746311166519","commenter_b":"Thus hes still a bitch!!!","commenter_a":"This igit wouldnt last .5 nanoseconds in the south bronx","post_message":"Ladies and gentlemen, this is pure Fox News: “If I see a group of blacks coming at me with hoods on, I’m walking to the other side of the street.\""},{"comment_id":"10153355238374411","commenter_b":"People who live in Palestine are Palestinians. People who live in Israel are Israelis. Most Israelis are immigrants.","commenter_a":"Israel may destroy the Gaza Strip but they will never destroy the Palestinian Spirt. Long Live Palestine!","post_message":"A new flotilla with humanitarian aid on board is going to help people in Gaza; the mission is beyond political polarization and in full compliance with international law, Osama Qashoo, member of the first flotilla to Gaza, told RT In The Now."},{"comment_id":"10153321708401955","commenter_b":"She does have Huma.","commenter_a":"Even Hilary needs a man once in a while !","post_message":"Hillary allows men at 'women-only' event amid weak turnout..."},{"comment_id":"10156326796940725","commenter_b":"Alexander Gregoire Well? Let's help the guy out and get that wall built! #MakeAmericaGreatAgain","commenter_a":"Soon, please.","post_message":"Eight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!"},{"comment_id":"10153058283284411","commenter_b":"Carlan those who behead people in the name of fake Islam are created by Mossad , CIA and MI6 have been given training by them please wake up to the reality CNN and fox news are not just the lives stop your hatred against us muslims please leave us alone , those isis members have kept their fake muslim names","commenter_a":"Germany starting shit again... Shocker.","post_message":""},{"comment_id":"1238174809572379","commenter_b":"Con-woman!.....criminal.","commenter_a":"And you believe that both Pence and The Wall Street journal are saying the truth!! Pence is campaigning although, as an honest Republican, he'd better stay silence. And WSJ, I have not seen it but it sounds like somebody's opinion.","post_message":"Labor Day is a time to pause and honor the hard-working Americans who have built our nation's infrastructure, and powered our economy for generations."},{"comment_id":"10153546751448352","commenter_b":"Annissa stfu bitch...whites use welfare in illegal ways too...fuckin idiot","commenter_a":"why are people saying \"good job?\" Yes what officers are doing out here is wrong but this guy has nothing to so with that. Innocent cop murdered for someone else's wrong doings. Not right!!!! He had his whole life ahead of him. Truly sad.....we need justice for all who die for nothing. This crap needs to STOP now.","post_message":"NYPD officer, 25, who was 'shot in the face by a career criminal' has died from his injuries after two days in hospital"}]
