[{"comment_id":"644282239071875","commenter_b":"I wish you ugly frumpy women would shut the hell up. Your blind support of Hillary is going to put Trump in the White House.","commenter_a":"He needs to bow out, pledge his delegates to Hillary and move on.. Hopefully she will have a place for him in mind and he can be of some help in the future. He's led a sterling campaign, but has been on the loosing side for the last few primaries and is bound to loose tomorrow.... YAY Bernie for doing what you did, now solidify the party, tell your supporters to support Hillary and then we can all go forward to enihilating trump and winning the presidency. Your Elizabeth Warren can still BE the VP candidate and together the women can set the world on fire and win... America is ready for this.. Trump must be downed and your support of Hillary will clinch that! PLEASE..","post_message":"Does Bernie Sanders keep fighting through July's Democratic convention? Or does he bow out?"},{"comment_id":"10154712376336756","commenter_b":"He was a pastor in the Southern Baptist Conference whose strict, written doctrine is anti-LGBT. Whether rabidly or tacitly he was promoting anti-LGBT beliefs by choosing to hold that job.","commenter_a":"The story doesn't address how the pastor felt about gays before his son 'came out' ? Did he always think that gays should be loved, treated fairly, equally like every one else, or is he just coming to that realization because of his son.","post_message":"After the pastor told his congregation about his son's coming out, \"I felt like this weight had just been lifted out of me, and people knew where we stood.\""},{"comment_id":"10153263448855095","commenter_b":"Arguments about religion, politics are a useless battle people nobody wins and about the refugees coming in i'm highly against it, there is no way we will know the good from the bad and I believe there are good and honest people that have been brought to America but you can bet your ass that there's a radical somewhere in the 10,000. I love my country and I'll be damned if we're gonna stand by and let our government bring in a possible threat and believe me it's very possible with the insane actions our president is taking, this will turn out bad and it will be the American people who will suffer in the end","commenter_a":"\" My parents came to this country 45 years ago searching for freedom and a chance.\" But you dont want to afford that same chance to others? What a hypocrite.","post_message":"I cannot tell you what an honor it has been to run for President of the United States of America. My parents came to this country 45 years ago searching for freedom and a chance.  When I was born, we lived in student housing at LSU, and never in their wildest dreams did they think their son would have the opportunity to serve as Governor of Louisiana or to run for President.  They raised me to believe Americans can do anything, and they were right, we can. But this is not my time, so I am suspending my campaign for President.  Going forward, I believe we have to be the party of growth and we can never stop being the party that believes in opportunity. We cannot settle for The Left’s view of envy and division. We have to be the party that says everyone in this country - no matter the circumstances of their birth or who their parents are – can succeed in America.  One of the things I will do is go back to work at the think tank I started a few years ago - where I will be outlining a blueprint for making this the American century.  We must show the way forward on growing our economy and winning the war against terror, and especially defeating radical Islam.  I realize that our country is off on the wrong track right now. Everyone knows that, but don’t forget, this is still the greatest country in the history of the world – and every single one of us should start every day by thanking God that we are fortunate enough to be US citizens.  Now is the time for all those Americans who still believe in freedom and American exceptionalism to stand up and defend it.  The idea of America – the idea that my parents came here for almost a half a century ago - that idea is slipping away from us.  Freedom is under assault from both outside our borders and from within.  We must act now, we do not have a moment to spare."},{"comment_id":"977246632310796","commenter_b":"Wth is a \"male feminist\"? This term is a total failure to understand what a feminist is.","commenter_a":"Amazing! A way for men and women to share the responsibility of contraception. This is the true mark of a male feminist.","post_message":"This is ballsy."},{"comment_id":"10152950589906051","commenter_b":"Let's throw her away with out anything too hope she go to hell","commenter_a":"This is true evil!","post_message":"Even the police were a little surprised that someone could be so cruel for no reason."},{"comment_id":"10154266348729203","commenter_b":"Go on sis!","commenter_a":"It seems that people are pushing their agenda however way they can... Big changes are coming soon... @webpagelink","post_message":"'Captain America: Civil War' screenwriters on the importance of Cap in light of Trump: \"It important to have someone remind people that that is not what this country is about, and you being kind of an ugly fool, and reductive.\""},{"comment_id":"10153689413136336","commenter_b":"Because 1471717696187557gallathat is not how God works in a church. If the pastor is wrong God will deal with him, it's not her place to do that. @username we don't know if he spoke to her privately & just because he rebuked her behavior doesn't mean it wasn't in love or that he doesn't love her. She may truly have been disrupting the services. God rebuked the behavior of many in the bible. The bible also says that God disciplines those he loves. No pastor is going to be able to preach in a way that makes everyone happy & making people happy isn't part of his job. He's supposed to preach the truth of God's word without compromise. His delivery can change, but the truth cannot.","commenter_a":"What kind of pastor throws out a 103 year old woman? Not even non-Christians would do this to an elderly woman. Madness. They hate her for believing the same doctrine that she learned at that church every Sunday for a century. The bible charges Christians to take care of the elderly and the widowed.","post_message":"Genora Biggs said that she and the current pastor, Rev. Tim Mattox, have long sparred over his form of preaching, which she characterizes as a \"Holiness style\" that doesn't belong in the Baptist church."}]
