[{"comment_id":"10153376436094087","commenter_b":"Ok some of you all don't get it. I like Trumps idea on closing our borders for a time being and this is why and a simple example. Please come to my house I have a bowl of 10,000 M&M's and in that bowl I may have 100 but at least 2 M&M's that are poisoned and will kill you the moment you put them in your mouth and slowly corrupting the bowl. So I want you to stick your hand in the bowl and eat a handful! Oh you won't? Why not oh cause the odds are your gonna die? Oh I see but it's ok to let 10,000 immigrants in knowing some are most likely deadly. But won't eat 20 M&M's because at least 2 out the 10 grand will kill you what's the difference??","commenter_a":"The immigration and Nationality Act passed June 27, 1952, revised the laws relating to immigration, naturalization, and nationality for the United States. That act, which became Public Law 414, established both the law and the intent of Congress regarding the immigration of Aliens to the US and remains in effect today. Among the many issues it covers, one in particular, found in chapter 2 Section 212, is the prohibition of entry to the US if the Alien belongs to an organization seeking to overthrow the government of the United States by , violence or other unconstitutional means. This, by its very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the US would be prohibited under this law because the Koran, Sharia Law and the Hadith all require complete submission to Islam, which is antithetical to the ...","post_message":"“Anytime somebody is making inflammatory statements about Muslims or whatever, they can take that and use it to their advantage for recruiting purposes,” House Homeland Security Committee chairman Rep. Michael McCaul. “They take things like this and they spin it, to inflame the Muslim world, to get more recruits to join the cause to fight in Syria.”"},{"comment_id":"968873019828099","commenter_b":"Some dumb uuuugly woman","commenter_a":"Who is Kim Kardashian and why must I look at this?","post_message":"#KimKardashian felt #liberated, Bette Midler didn't!"},{"comment_id":"698436883649598","commenter_b":"What's the deal with these frogs.","commenter_a":"One of his few good decisions. General Mattis is a fucking fantastic choice","post_message":"Trump wants a military vet to be secretary of defense for the first time in over 60 years."},{"comment_id":"10153329238969228","commenter_b":"So what Johnny they were here before you were... immigrants.","commenter_a":"A permanent plaque in the public sidewalk for a kid who tried to kill a police officer in broad daylight?! May as well let all the murderers, rapists, and sexual predators go free and give them all a museum!","post_message":"Mike Brown's dad works to remove the memorial in the middle of Canfield Drive in Ferguson.  This would have been his son's 19th birthday.    A permanent plaque will be placed in the sidewalk after a Ferguson paving project.  The objects will be temporarily stored by Urban League"},{"comment_id":"10153620963073984","commenter_b":"When will Americans wakeup to the fact that Hillary is for Hillary and she don't give atinkers damn about anyone else!!! She BITCH!!","commenter_a":"Who in their right mind would vote for her???","post_message":"As cynical as I may be about politics, I just don't see how Hillary can survive this avalanche of scandals.  Do you think Hillary is destined for the ash heap of history?"},{"comment_id":"1208640665842055","commenter_b":"#NEVER HELLARY CLINTON !","commenter_a":"Be careful. People who cross the Clintons have a strange way of \"committing suicide\" by a few \"self inflicted gunshot wounds\" to the back of their heads.","post_message":"CROOKED HILLARY really SCARED  @webpagelink"},{"comment_id":"547509162098460","commenter_b":"I can t push like I push agree!","commenter_a":"sounds like you support clinton ted","post_message":"Our nation is at war. From 9/11 to the Boston Marathon, from Fort Hood to Chattanooga, from San Bernardino to last night’s horrific attack in Orlando, radical Islamic terrorism has declared jihad on America. Early reports indicate the Orlando terrorist had pledged his allegiance to ISIS, and he had previously been investigated by the FBI. And yet, as with the prior attacks, we were not able to act to stop this act of vicious terrorism that has now murdered 50 and injured more than 50 others.   Our hearts go out to those killed and wounded last night. Our prayers are with their families, and with all their grieving loved ones.      It is a time for action. We need a Commander in Chief who will speak the truth, and who will unleash the full force and fury of the American military to utterly destroy ISIS and its affiliates. We need to pass the Expatriate Terrorist Act, so that known ISIS terrorists cannot use U.S. passports to return to America and wage jihad. We need a President who is serious – who will identify the enemy by name and do everything necessary to defeat it.   The next few days will be sadly predictable. Democrats will try to use this attack to change the subject. As a matter of rigid ideology, far too many Democrats – from Barack Obama to Hillary Clinton – will refuse to utter the words \"radical Islamic terrorism.\" They will claim this attack, like they claimed every previous attack, was isolated and had nothing to do with the vicious Islamist theology that is daily waging war on us across the globe. And they will try to exploit this terror attack to undermine the Second Amendment right to keep and bear arms of law-abiding Americans.   Enough is enough. What we need is for every American – Democrat and Republican – to come together, abandon political correctness, and unite in defeating radical Islamic terrorism.   ISIS doesn’t just target soldiers. They don’t just target Republicans. Or Jews. They also target Christians and fellow Muslims. They target each and every one of us. As we saw this morning, they target the gay and lesbian community. Their objective, which they broadcast worldwide, is to murder or forcibly convert every single American.   For all the Democrats who are loud champions of the gay and lesbian community whenever there is a culture battle waging, now is the opportunity to speak out against an ideology that calls for the murder of gays and lesbians. ISIS and the theocracy in Iran (supported with American taxpayer dollars) regularly murder homosexuals, throwing them from buildings and burying them under rocks. This is wrong, it is evil, and we must all stand against it. Every human being has a right to live according to his or her faith and conscience, and nobody has a right to murder someone who doesn’t share their faith or sexual orientation.  If you’re a Democratic politician and you really want to stand for LGBT, show real courage and stand up against the vicious ideology that has targeted our fellow Americans for murder.   Today, all of America stands in solidarity with the people of Orlando. All of us should lift them up in prayer, demand action, and if you have any information about the Orlando shooter or potential radical Islamic terror plots, please act to keep us safe by using the FBI tips website: @webpagelink"}]
