[{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"},{"comment_id":"1736640533224849","commenter_b":"What are the Muslims doing to make Christian's comfortable?????? We as Christiams MUST stand up for our rights.","commenter_a":"she is a fool! crosses belong in CHRISTIAN churches! maybe she needs to be a muslim preacher. shame on her for denying Christ!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More 'Comfortable' We are talking about a Church. This is ridiculous. Do you think society is becoming too sensitive?"},{"comment_id":"10153803162214456","commenter_b":"There is a big difference between a legal immigrant and an illegal alien. Ivana trump was a legal immigrant.","commenter_a":"Thanks JENNIFER...this is what I am seeing and hearing. No matter how brash everyone thinks Donald Trump is...we have incompetent leadership in this country...I agree with him...","post_message":"BREAKING NEWS: French police have issued a wanted notice with a photo of a man suspected in the Paris attacks."},{"comment_id":"1401080203318363","commenter_b":"Well eventually there will come a day of reckoning.","commenter_a":"Notice how these people claim to be Christian meanwhile they do the opposite of what Christians do & they dislike true Christians as much ad they do people of other faiths, they quote the bible to support their homophobia but they don't except & love people who are different, like God says that they should","post_message":"This is absolutely deplorable."},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152976248907232","commenter_b":"I am guessing both Pamela and Leslie are cop wives, or just like giving cops free head","commenter_a":"You know what boggles my mind is how they are here to protect and to serve but it goes both ways here .. they are paid by our tax $ to protect and to serve and yes there job is a hard job but at the end of the day these ppl are just like anyone of us ppl of the streets but I'm confused as to why if little mikey off the block killed somebody beat somebody or whichever would get a he'll of lot of years in prison and cops who are supposed to be here to protect and serve us would get a slap on the wrist or a leave of absence and paid .. so in reality we are all not treated the same by the system but let's just keep being blinded to the matter it has nothing to do with race it has to ...","post_message":"Thousands of demonstrators stood on sidewalks in Delaware County to show their support for law enforcement. STORY HERE: @webpagelink"},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"}]
