[{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"10153452535630399","commenter_b":"Your attempt at cleverness comes off as fairly moronic.","commenter_a":"Obama should go to China........he might love being with his fellow Commies so much he Might not want to come back....","post_message":"Scott Walker takes on...Chinese economics."},{"comment_id":"565035256989762","commenter_b":"What would the us do if mexicans where stealing land putting colonies into their land? Only rockets?!","commenter_a":"Military action would be used against a country which sends rockets, terrorists and death into any western democratic country. Why is it unacceptable when the only democracy in the Middle East does it to protect their own democratic citizens? If the vice news offices where destroyed by a Mexican rocket would their be a US reaction.","post_message":"The armed wing of Hamas has vowed to retaliate for the deaths of the two children."},{"comment_id":"712619718886803","commenter_b":"At the risk of repeating myself, J. McCain turn your back on this blight you call a presidential candidate! You do a disservice to your party, your constituents, your military compatriots and most importantly your moral compass which should be leading you away from rather than to Trump.","commenter_a":"Trup will be lopplllllppp Cidgbelillnnrvrubrg","post_message":"He's mad as hell but is he gonna take it any more? -- Paddy"},{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"10154128932095579","commenter_b":"Domestic terrorists! Red neck spoiled Yahoo's, not patriots by any means.","commenter_a":"When I think of \"Terrorists\" I think of malicious intent to do harm\". When I think of \"Domestic Terrorists\" I think of the same, but the suspect/aggressor is from within. A \"rotten apple in the barrel\", if you will. When I think of patriots fighting for principles as defined by the Constitution, I think of statements like the ones that these people are making in Burns. I'm not saying that what is going on here is right, warranted, and just, but I am saying that (if their story is true) then we absolutely need be paying attention and asking 'why would the Fed Gov need to use strong arm, mafioso tactics to squeeze/coerce people of of their own lands'', and why are we allowing them to get away with it'? Take a close look at the mission statements of the Sierra club, Agenda 21, etc. Then go look your grand ...","post_message":"Rep. Greg Walden (R-OR) spoke on the House floor for over 24 minutes on the armed standoff in Oregon. Here is the closing 5 minutes of his remarks. Watch the complete video of his remarks here: @webpagelink"},{"comment_id":"10153748388188132","commenter_b":"You have lost. Your. Mind. Woman.","commenter_a":"All of you women on here calling her disgusting and gross and saying \"Ewww we don't need to see that,\" are absolutely part of the problem. There are countries where menstrual shamming still occurs and young girls are treated like animals as a result. You may think it's gross because you live in an entitled world where you're treated no differently when you have your period. Educate yourselves before you run your mouth... @webpagelink","post_message":"Thoughts?"}]
