[{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10154314532254218","commenter_b":"Gee thank you,I haven't heard anything about Freddie Grey for at least 10 mlnutes!!","commenter_a":"She's a joke... Disgrace to Maryland","post_message":"The trials of the six Baltimore City police officers charged in the police in-custody death of Freddie Gray are still ongoing."},{"comment_id":"10152892004126051","commenter_b":"This sick woman took advantage of boys. This was not age-appropriate activity. Why can't you creeps see the truth in that? The kid who told did the right thing.","commenter_a":"Kids these days,when I was a teenager we dreamed of something like that happening to use but now these little sissy go crying to their mommies. don't figure","post_message":"Police took one look at what this woman did to kids at a bar mitzvah and arrested her as quickly as they could."},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"10153638805358598","commenter_b":"Abortion is NOT legal!","commenter_a":"just go above the supreme court and ban all abortions.","post_message":"BREAKING NEWS: Supreme Court Won’t Let North Dakota Ban Abortions on Unborn Babies After 6 Weeks"},{"comment_id":"732788963494483","commenter_b":"The Demon worshipping Islamic Terrorists murdering Jews even Jewish children needs to be put to death and send them to hell to meet their beloved false -prophet Mohammed .","commenter_a":"Where is the proof that Jews were responsible for this ? We all know only to well how Muslims murder their own children and use them is human shields and train them as shahids .And why is this self -hating Jews calling Jews terrorists and not calling Muslims Terrorists ? Jews are not Terrorists !!!!!!!!!!!!","post_message":"Jewish Home’s Ayelet Shaked calls the fatal firebombing ‘terrorism in every respect,’ and says that Jewish terror does more damage to Israel than Palestinian terror."},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"}]
