[{"comment_id":"10153221680277217","commenter_b":"@username: Why do Muslim women feel desperate?","commenter_a":"So, are Muslim women ALLOWED to choose to be child free?? Not being sarcastic, it's a real question. This meme seems misleading. By the way, I think ALL women should be allowed to choose, and I think people who don't want kids shouldn't have them. However, everything I've ever read suggests this isn't an option for Muslim women (as well as in some other religions). Would like input on the realities.","post_message":"\"Don't get me wrong, I love children - just as long as they aren't mine\" #100Women"},{"comment_id":"10153916167801178","commenter_b":"Mommas ain't no saints in this passion play either.","commenter_a":"I agree. Black on black crime is so out of control and too many momma's ate losing their children to death. It needs to stop, all drivebys gang shooters need to be prosecuted to the entire law, not just slaps on the wrist.","post_message":"Sheriff Clarke slams Jesse Jackson for refusing to 'talk about the black-on-black crime in South Chicago.'"},{"comment_id":"10153776672201770","commenter_b":"So Is @username","commenter_a":"Who is this Pollyanna? She thinks Hillary is all rainbows and unicorns. You can't put lipstick on a pig.","post_message":"\"She is a real person...\""},{"comment_id":"1771313199818566","commenter_b":"Women just need excuses to be shirtless in public","commenter_a":"No.. He's not the ex-Stanford swimmer. He's a convicted rapist! Stop pampering the white boy FFS!!!","post_message":"We’re outside the Santa Clara County Jail where people are protesting the release of Brock Turner. He's the ex-Stanford swimmer who served three months after being convicted of sexually assaulting an unconscious woman."},{"comment_id":"910228435682060","commenter_b":"That's why it's good she'll never be president.","commenter_a":"Communism at work! No freedom of speech if they have their way! Vote them OUT!","post_message":"Are you at all surprised by this?"},{"comment_id":"10153466611918635","commenter_b":"Amen","commenter_a":"Amen, aleluya","post_message":""},{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"}]
