[{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"},{"comment_id":"711971608993417","commenter_b":"The Liberals and Democrats are complete idiots. They've spent their entire lives destroying society and blaming everyone but themselves for the evilness they've generated.","commenter_a":"He is not a man - is a she","post_message":"Like if you agree."},{"comment_id":"1556960097657348","commenter_b":"This is a state with Making a Murderer. I'd be wary.","commenter_a":"Eternal rest grant unto HUSSAIN, O Lord, and let perpetual light shine upon HIM. May the souls of the faithful departed, through the mercy of God, rest in peace. AMEN!!","post_message":"Police say it's likely several people saw Alnahdi being beaten, but only one has come forward."},{"comment_id":"10153587068405329","commenter_b":"Dolphins are such vicious, terrifying monsters!","commenter_a":"@username \"It hit my wife and knocked her over, and punched my daughter.","post_message":"The dolphin jumped in, broke someone’s ankles and “punched” a 16-year-old girl."},{"comment_id":"10153122280259877","commenter_b":"Beautiful girls. Happy birthday","commenter_a":"Happy birthday Sasha,,,my twin girls birthday is today,,14yrs old","post_message":"We are wishing #SashaObama a very HAPPY BIRTHDAY today!! COMMENT to sign our #GrioBirthdays card for Sasha!!"},{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"1793145997633986","commenter_b":"I believe Joy was referring to the women who willingly screwed a married man. That would absolutely make you a nasty tramp.","commenter_a":"That kind of shaming is the reason why many rape victims don't report there rape to the authorities. Joy needs to zip it and have respect for these girls!","post_message":"Paula Jones responded to Joy Behar’s claim that she was a \"tramp,\" and she took Bill Clinton down at the same time..."}]
