[{"comment_id":"1023160814385680","commenter_b":"Pussy bitch","commenter_a":"Fuck that! If that fuckin dog was comin at me is shoot the cunt too! No questions asked! Why risk your life for someone's untrained mutt!!","post_message":"The difference between firefighters and cops. Coward → @webpagelink Filming Cops (Y) via Cop Logic (Y)"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just it's a wonderful line. I own some of it. I fully I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"10154455008597509","commenter_b":"Andre Ceasar","commenter_a":"Brittany Benoit, Jade Walker","post_message":"Take a look at the friends who you have outgrown, who you don’t talk to anymore, who makes no effort to see you. Focus on the friends who matter most."},{"comment_id":"1334294883276632","commenter_b":"What a joke Hillary Clinton is! She's allowed to continue running while there is a fbi criminal investigation?! I wouldn't even be able to apply for a job at McDonald's if I were under a FBI criminal investigation! Nail that bitch!","commenter_a":"the traitorous bitch looks and sounds just like Nixon.","post_message":"BREAKING: Hillary Clinton holds press conference about FBI reopening email probe. VIDEO OF HER STATEMENT: @webpagelink"},{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."}]
