[{"comment_id":"10153501091738690","commenter_b":"Afgan want peace but usa want target killing of muslims.","commenter_a":"Afghan was peaceful peoples. Bu when usa attack on afghan they become defender and now usa and others calling terrorist. Shame on you.","post_message":"At least 17 policemen have been killed in Afghanistan's Helmand province after 'hundreds of Taliban fighters' attacked the police compound, officials said. @webpagelink"},{"comment_id":"10154769699754486","commenter_b":"STOP THESE TWO IDIOTS...............WHY CAN'T YOU UNDERSTAND WHAT ILLEGAL MEANS? YOUR A DISGRACE TO THE OFFICE YOU HOLD........ALL ILLEGALS AND REFUGEES SHOULD BE DEPORTED AT ONCE.........STOP THE ATTACK ON AMERICA...............","commenter_a":"What stupid Fools!!","post_message":"They want to make Obama's Executive Order amnesty for millions of illegal immigrants the law of the land."},{"comment_id":"10155117699521178","commenter_b":"Especially women not yet born.","commenter_a":"So... the baby killers are really not for ALL women? Gotcha. 😂😂👀","post_message":"BREAKING: Pro-lifers not welcome at women's march after uproar from feminists."},{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"10153242802786336","commenter_b":"She needs to step down. Bad form lady!","commenter_a":"recue her self all the way back to college, and stay awake the second time around , , and learn the law. don't judge out of hate to please your president and holder ,and al.","post_message":"Defense attorneys representing six Baltimore police officers charged in the death of Freddie Gray filed a motion to have the case dismissed, or for the city’s top prosecutor to be replaced."},{"comment_id":"591608484297524","commenter_b":"smh....","commenter_a":"John","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153032098202483","commenter_b":"The same move is taught in the military to subdue someone not to injure them.","commenter_a":"The officer gave him an order it was not obeyed. Act first and ask questions later. If you wait to see if he has a weapon you end up shot.","post_message":"Have you seen the entire video?  Do you think it should be shown in court?"}]
