[{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"1232367160117626","commenter_b":"You aren't a fan of any carnivorous animal? LOL ok.","commenter_a":"Killing for fun. \"End of the moral analysis\" The \"arguments\" of the article are pathetic. \"let’s not forget that wildlife reserves can also kill lions.\" Oh, right, I had forgotten that in this world, \"I'm not the only one to do bad\" is considered an argument. I'm not a fan of any carnivorous animal, but if you decide that they're a problem, you'd better come up with solutions that are more ethical than their own actions.","post_message":""},{"comment_id":"10154374594014087","commenter_b":"All other respectable women","commenter_a":"don't grab your pussy hahaha I dought there is a worry there.","post_message":"\"After months of attacks against women and minorities, women grab back.\""},{"comment_id":"987010284749083","commenter_b":"oh i would get me a few mini pigs i can have 3 here in my town in town. then i would put pig crap on the lawn all around my home i would be so mean. if i could hear them i would call the cops everytime make it a real pain","commenter_a":"Dope, I'd have pork on the grill and my guns loaded and pointed right at it. A sign saying come and get it, your choice on which one you want","post_message":"What would YOU do if you were put in this situation? Choose one of the two options! @webpagelink"},{"comment_id":"10152782539256130","commenter_b":"It would take the entire roll of toilet paper for some women. Hell I go through super plus tampons with a super extra maxi overnight within 2 hours bc I have PCOS. I was homeless and LUCKILY people donated to the shelter and I was usually able to have what I needed. Sometimes I didn't but I would go sit in the day labor office with a bunch of homeless men, I was like the only woman there, while I was on my period, bleeding through my clothes just to go do manual labor all day so I could make $30 to buy what I needed. I fucking hate asshole people.","commenter_a":"Growing up poor, you learn to use other methods. Guess what's free and in bathrooms everywhere? =p","post_message":"Pads and tampons are often what homeless women ask for the most."},{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."}]
