[{"comment_id":"922774087855770","commenter_b":"And my favorite flavor of boot is the one I'd plant square in your ass for being such a pussy...sir.","commenter_a":"SO, he converted to Islam a couple months ago and he is talking about oppression in America!!!!! He is some kind of stupid ignoramus.","post_message":"You thought him not standing was bad? This is FAR WORSE."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"1257226684318485","commenter_b":"Thank god Hillary did not get in she is to dangerous to our constitutional rights. And you know nothing of our constitution or you would know how dangerous Hillary really is. I don't think anybody that is not a American has a right to who we have as a president. Now it's time to make everything great and get along for all of Americans based on the constitution where it all started and will stay.","commenter_a":"If GOD could erase USA right now he would do it, i have no doubt. Trump is a living nightmare, and the American people are in the rollercoaster of stupidity right now. God don bless America...","post_message":"Things are not looking good on Wall Street"},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims. Norway made a brave move, now the rest of the world needs to follow their example. Do You Support Muslim Deportation In The United States?"}]
