[{"comment_id":"1641151569508654","commenter_b":"@username: no fault but Puerto Ricos...pretty sure they had a chance to vote for independence, and y'all didn't take it. You can have all the cultural pride you want...but it's the Olympics man, it is only for countries to compete in. Why not have Coca Cola and Pepsi join in?","commenter_a":"The underdog defeating the #2 in the world for gold.. Monica eres grande!!! PUERTO RICO!!! and to the bunch of salty Americans go read a book and learn about the damage the USA has done to PR!!","post_message":"After some of her more dramatic points, fans were shouting \"Si se puede\" and waving the flag of Puerto Rico."},{"comment_id":"855492334499315","commenter_b":"Leave her in the hot car","commenter_a":"Idiot to the max.......","post_message":"It has happened again. Police say a woman left her child in a hot car Friday, now she's facing charges."},{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"10153425250862217","commenter_b":"I had a design like that when I was in seventh grade in 1993. It was an idea from Dick traci and knight rider. Knight could talk to kit with. Glade it took so long for this to happen 23 years was all! lol","commenter_a":"Yall now getting this lol to late","post_message":"It's a lot more hi-tech than our day. Times tables written on our arms was the height of sophistication back then..."},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."}]
