[{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"1027678373922850","commenter_b":"Yes Michael, when an intruder breaks in your home, watch him rape your wife while you blow a whistle. Makes perfect sense. Smh Humans have the right to defend their home and family. I would rather rott in prison, than do nothing.","commenter_a":"Stupid brits. Lol","post_message":"Self-defense is now ILLEGAL in the #UK"},{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"},{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"},{"comment_id":"801744643293915","commenter_b":"#HillNo #HillaRigged #NeverHer #LatinasForBernie","commenter_a":"hillary is going to get the majority of bernie voters to vote for her in the end and trump will be squashed.","post_message":"Of those surveyed, 74% said they have an unfavorable opinion of Donald J. Trump."}]
