[{"comment_id":"10153443482053352","commenter_b":"He knew that bitch was cazey","commenter_a":"Idk what to say bout him, i know personally a man who loves n does for his kids, but his child's mother does not let him take his son ANYWHERE, n will continuously say he sick or he can't go, but always calls when he needs shoes or something and holidays.. So i can't judge him. Also just because ur behind on child support doesn't make u a deadbeat, you can be behind while making payments still!! Its sad what this family has to go thru but not everyone is educated on their parental rights or can afford court! I just feel sorry for the kids n the family.","post_message":"Dad of Kids Found Dead in Freezer Comes Forward #TRENDING"},{"comment_id":"894578323912842","commenter_b":"Then it would forever be a mystery. That hag will never tell the truth.","commenter_a":"Did they ask Hillary that question well when she tells the truth then they can come back and ask Rick that question.","post_message":"\"These are tough issues...\""},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"10153873967388797","commenter_b":"Women want equal treatment. Then cry they don't get special treatment...","commenter_a":"The Man Should be on the Right.","post_message":"WHAT'S WRONG WITH THIS PHOTO? A picture of a couple walking down the sidewalk has sparked a heated debate on social media. What do you think? Here's why people are talking:"},{"comment_id":"10157704194035725","commenter_b":"MAKE SURE SHE HAS NO EAR PIECE IN HER EAR.","commenter_a":"Great show this morning!","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"1011635658879674","commenter_b":"And this bimbo is our Sec of State😂😂😂😂 No wonder the world is laughing their asses off at America if this is the best we can do","commenter_a":"And thinks the idiot he works for had ANY real experience when he was put in office. Trumps runs a global business","post_message":"When it comes to meeting the constitutional requirements to seek the nation’s highest office, Donald Trump appears to have all the boxes checked: He’s older than 35; he’s a natural born citizen, and he’s lived in the U.S. longer than 14 years. But for John Kerry, constitutional requirements aren’t enough. Because Trump does not believe in global warming, he, and all “global warming deniers,” are automatically disqualified. @webpagelink"}]
