[{"comment_id":"1287965734605309","commenter_b":"Fuck Trump. There's my dignity. I'll grab him by the pussy.","commenter_a":"All of you need to remember that you are not in the fourth grade anymore, and that we can actually behave as adults. Cut out the filthy language and the belittling insults. If you have something to say, say it with a little dignity. Also, try to improve your spelling and grammar.","post_message":"Gullible fools...  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1377243338962685","commenter_b":"@username Typical liberal retards dodging the question. This isn't a matter of immigration, it's a matter of letting in the right immigrants.","commenter_a":"Good welcome to all terrorist to Canada ..According to Qubiec attack police arrested two and says......The two suspects are Alexandre Bissonnette and Mohamed Khadir Two students including one of 'Moroccan origin' have been arrested for the slaughter of six people at a Quebec mosque ...Mr. PM you are really trying to kill innocent people ...Idiot. .","post_message":"Six people were killed and eight wounded when gunmen opened fire at a Quebec City mosque during Sunday night prayers, in what Canadian Prime Minister Justin Trudeau called a \"terrorist attack on Muslims\"."},{"comment_id":"10154481356497098","commenter_b":"You a dumb hoe kris","commenter_a":"The awkward moment when you spent all of your infrastructure funds on illegal immigrants and government handouts. 😂 #ihopetrumpmakesyougetonyourkneesandbeg","post_message":"FEDERAL FUNDS REQUESTED: Gov. Jerry Brown is asking the Trump administration for federal assistance in responding to a potential failure of a spillway at the Oroville Dam in Northern California."},{"comment_id":"1329754913767400","commenter_b":"Both those women have lost their minds.","commenter_a":"The comedy act of Waters and Pelosi are more entertaining than SNL. Keep up the good work, this will assure another republican landslide in 2018","post_message":"TIME TRAVELER NANCY PELOSI Says She Just Can't Work With...President Bush??? [Video]  Haha! Check out Maxine Waters!"},{"comment_id":"1330438396971266","commenter_b":"Better than the PUSSY approach you girls are doing","commenter_a":"What does Biden know he follows Obama.","post_message":"Biden took on Trump in a recent foreign policy speech, arguing that America doesn't need \"empty bluster,\" or the \"insecurity of a bully.\" What do you think of his comments?"},{"comment_id":"10155541308376002","commenter_b":"@username or we could use the same money they giving all folks coming here to do the same thing . Plus we want the wall and not these folks that want to blow us up .","commenter_a":"He has an issue with executive pen on immigration but no issue when Obama was doing it? Also this executive order is for 60-120 days same thing Obama did. Obama before he left slowed down Cubans to come in, President Carter sent Iranian students back during the hostage crisis. Hell my own grandparents in the 1900s came over and we're sent back to Italy. Rather fix the VA first then global problems second. Immigration isn't a right, my taxpayer dollars doesn't want to go to a bunch of illegals","post_message":"Senate Minority Leader Chuck Schumer is holding a press conference to demand the reversal of President Donald Trump's immigration ban.   You can watch the press conference live here:"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"}]
