[{"comment_id":"10154731956548797","commenter_b":"@username - Canadian!","commenter_a":"What the hell is wrong with this city? What is the death toll so far for this month?","post_message":"FATAL STABBING ON RED LINE: CTA Red Line trains are suspended between 35th and Garfield after a woman was stabbed to death on a train Thursday afternoon."},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"677264589079564","commenter_b":"If Muslims are offend by us they can leave and go else where....maybe Syria.","commenter_a":"He'll no","post_message":"Muslims Are OFFENDED By This Teams Fans Uniforms, Should They Be Forced To Change it? Take our poll!"},{"comment_id":"1388314524545146","commenter_b":"Someone should kick this Muslim Animal out of our country years ago.","commenter_a":"Delusional moron!","post_message":"Just another scumbag black leader who hates Jews...boy, sure glad we helped them with their civil rights in the 60's - WE WERE THE ONLY ONES!"}]
