[{"comment_id":"628028950680040","commenter_b":"Finally intelligent smart women say what the leader of this country needs to say. It's simple as that. They could prevent this attack they chose to be Muslim lovers.","commenter_a":"Yes sir I have many.","post_message":"\"Get a gun. Because this government ain't in a position to help.\" – Judge Jeanine Pirro bit.ly/1UgPEW4"},{"comment_id":"10154493231947235","commenter_b":"That's if she lucky..now don't get me wrong,I never hit a woman,but this bitch would've caught a 1989 Mike Tyson uppercut to da jaw at best case scenario lol","commenter_a":"Why can't I see none of these people...man I'm telling you,if that was my daughter she was talking to,her fucking head would've been in her mailbox","post_message":"What an absolutely HORRIBLE person"},{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"},{"comment_id":"10153181502489705","commenter_b":"RJ Ring,Brett Alexander,Chandler Hunt","commenter_a":"Victor Trezic Mata","post_message":"Star Wars fans. It has arrived. Rejoice."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"}]
