[{"comment_id":"891542370901815","commenter_b":"Behead the shitbag goat fuckers","commenter_a":"Hehehe","post_message":""},{"comment_id":"10155392185178352","commenter_b":"@username she still immigrant . She come in visa and hurry married for papers like any other person.","commenter_a":"He better deport his wife too","post_message":"It's open season on illegal immigrants: Trump declares that ANYONE in the US illegally can be deported, regardless of whether they've committed a crime"},{"comment_id":"10155634882296509","commenter_b":"@username. Get the hell out of my country crybaby","commenter_a":"Do we have to tell President Cheeto not to \"grab her\" ? Someone might have to tell him. I can't believe this is our reality now. Ugh. Sorry world. :-(","post_message":"The British government is considering whether to invite President-elect Donald J. Trump to the UK for a state visit in 2017."},{"comment_id":"10153047601521336","commenter_b":"how many lawyers have been sent to \"find dirt\" on her, like they did with Sarah? can you imagine Sarah debating this heifer on live t.v.?","commenter_a":"Well of course they didn't find anything. You never had anything interesting to say.","post_message":"\"Will they put the same effort into her emails as they did mine?\"  Former Alaska Gov. Sarah Palin thinks the media should hold Hillary Clinton to the same standard to which they held her over access to emails. What do you think?"},{"comment_id":"10153794621104726","commenter_b":"Thats the REAL ISSUE here..PRAYER and FAITH ..these guys are so far remoived from G-d its pathetic..This all has to do with the men in POWER.....has been since the beginning....even satan wanted to be above our creator..these followers of satan are no different","commenter_a":"Still another reason I'm a pub!","post_message":"Democrats come out against God"},{"comment_id":"10153508480963984","commenter_b":"She is a disgrace","commenter_a":"There is nothing here for a reality show. Maybe a show on mental illness.","post_message":"NAACP race faker Rachel Dolezal stepped down from her job, but she already has a new gig in the works. You might be shaking your head when you see it..."},{"comment_id":"1048204431922451","commenter_b":"in the beginning of his campaigned media said he was a Muslim,friends of the activist terrorist eyre and his pastor mentor for 20 yrs condemned America,his wife hate America, the only PRESIDENT APOLOGIZED FOR AMERICA and the people still vote for him, and look America now, bankrupt morally,financially,economically and bankrupt spiritually. AND THE BAD NEWS HILARY GOAL IS TO FOLLOW HIS STEPS. IF ANY ONE OF DEMOCRATIC WIN, THE END OF AMERICA . WE WILL BECOME A SOCIALIST ,COMMUNIST COUNTRY LIKE CUBA AND SOCIALIST COUNTRY OUR LIFE WILL RUN BY THE GOVERNMENT. YOUNG PEOPLE ARE BRAINWASH OF THE SOCIALIST TEACHERS IN SCHOOL AND UNIVERSITIES. PRAY FOR OUR COUNTRY AND YOUNG PEOPLE,","commenter_a":"I have been saying that for years!!! He isn't going to do anything to hurt his peeps.","post_message":"Former CIA Agent Says Obama is Working With The Muslim Brotherhood Against America. ⋆ Please Share ⋆"}]
