[{"comment_id":"10153700840423812","commenter_b":"She just mad cause she can't have a slice lol","commenter_a":"Some one pls buy these ppl a cake.","post_message":"Couple married for 60 years eats a piece of their original wedding cake every anniversary. They store cake in a coffee can, and moisten it every year with brandy before eating another piece. @webpagelink"},{"comment_id":"10153333221058984","commenter_b":"illegals cant vote and thats a fact","commenter_a":"yes especially with this crap happening in europe w radical muslims id say def close the borders latin americans dont want that crap either","post_message":"If you don't believe immigration is going to be THE issue in 2016, read this. My eyes were opened in a big way.  Do you support securing our borders?"},{"comment_id":"1193491007392830","commenter_b":"@username she better pray that she does. Her crooked butt will see prison bars.","commenter_a":"Horrifying? No, what is horrifying is you ignoring the pleas for help from four Americans, for 13 hours, while they were tortured, raped, and murdered, you evil witch.","post_message":"Debate question: Will Donald Trump accept the results of the election?  Donald J. Trump: “I will tell you at the time. I’ll keep you in suspense.”  Hillary Clinton: “That’s horrifying.”"},{"comment_id":"10152702377667869","commenter_b":"Praying that God leads you to serve in the best way possible.","commenter_a":"We will miss your show","post_message":"This evening I wanted to share with you some news that is very personal to me.  Because you have been such a good friend and a strong supporter of all my efforts, I wanted you to know first that tonight I will do more than just say goodnight on my Fox show.  I will say goodbye.  This is the last edition of Huckabee on the Fox News Channel. It has been the ride of a lifetime, and I have never had so much fun in my life. But I also realize that God hasn¹t put me on earth just to have a good time or to make a good living, but rather has put me on earth to try to make a good life.  There has been a great deal of speculation as to whether I would run for President.  I won't make a decision about running until late in the spring of 2015, but the continued chatter has put Fox News into a position that is not fair to them. The honorable thing to do at this point is to end my tenure here at Fox so I can openly talk with potential donors and supporters and gauge support.  As much as I have loved doing the show, I love my country more, and feel that it may be time for me to leave a zone of comfort to engage in the conflicts that have almost destroyed the bedrock foundations of America.  I feel compelled to ascertain if the support exists strongly enough for another Presidential run. So as we say in television, stay tuned!"},{"comment_id":"10153703182846438","commenter_b":"lolz u wot m8","commenter_a":"just look at them..smh ....what idiots and morons","post_message":"Why his supporters stick with him despite all his gaffes and lies."},{"comment_id":"10154457010786378","commenter_b":"U should've said bring it on sista!!! This white girl from P.G Co. lol...","commenter_a":"I don't know who she is. I'm glad I dont.","post_message":"A black Saturday Night Live writer is under fire after cracking a joke about white people who support Black Lives Matter."},{"comment_id":"847928802003105","commenter_b":"I am not Impressed with a government that steals elections so they can choose the president.","commenter_a":"This will give Rise to the Libertarian party who is right now starting to gain traction The GOP thought they had issues with @username...they wont be able to control a Libertarian Party candidate The establishment is destroying their 1 party 2 party system .... Thank you @username even if you get screwed out of the nomination you have accelerated the cause of freedom and liberty","post_message":"This is happening all over our country—great people being disenfranchised by politicians. Republican party is in trouble!"}]
