[{"comment_id":"10153938458440695","commenter_b":"Go home Barbara. You're drunk.","commenter_a":"We're checking on the condition of the other child injured in the crash for the Channel 2 Action News Nightbeat at 11.","post_message":"HEARTBREAKING: Police say a 12-year-old critically injured in a crash on I-285 today has died. Please keep her family in your thoughts and hug your loved ones tight tonight. @webpagelink"},{"comment_id":"780559568801287","commenter_b":"Get a Real Job Bitch!!","commenter_a":"on welfare??? guess how much those tattoos cost>>???","post_message":"Welfare Recipients In THIS State Just Received Some DEVASTATING News  It is unethical to leech off the hard work of others.  Are you fed up with welfare moochers?"},{"comment_id":"1074511882569822","commenter_b":"You cared enough to comment","commenter_a":"Needlessly inflammatory and untrue. Time to unlike.","post_message":"Nearly a century later, Einstein has been proved wrong."},{"comment_id":"10152731629721051","commenter_b":"Kids should never be returned to this evil woman and she should do years in jail.","commenter_a":"Why Don't these nutty individuals just take themselves out and leave others alone !","post_message":"This mom threatened to beat her kids if they didn't drink the apple juice she gave them. The next day they were rushed to the hospital."},{"comment_id":"10153009921992507","commenter_b":"I'm with you. I could teach a class in this at this point, because most women DO NOT CLIMAX without clitoral stimulation, no amount of deep thrusting will do","commenter_a":"This is quite common, and enjoyable for the man if he grows up. When she's using the vibrator & he is inside it feels like the penis is vibrating","post_message":"Awkward!"},{"comment_id":"765017110298136","commenter_b":"I agree. That would stop illegals dead in their tracks!","commenter_a":"If they would allow the soldier to shoot that vermin off the fence, that shit would end","post_message":"For some reason, this truth is lost on liberals, but what isn't?"},{"comment_id":"1049317721755905","commenter_b":"full retard mode: engaged","commenter_a":"This is the evidence of existence of Allah !!!","post_message":"Our brains are truly amazing.  By Emily's Quotes, via AsapSCIENCE."}]
