[{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"1129299917126536","commenter_b":"Hillary is the real war on women.","commenter_a":"Together we Move Forwards Vote to President @username 2016.","post_message":"In ten years, we can generate enough renewable energy to power every home in America. #EarthDay"},{"comment_id":"10157328778620354","commenter_b":"Kimberly Dawn Horvath Mullins , most Muslim immigrants are actually highly educated doctors, lawyers, computer engineers. Kimberly, you're just a mailman right? Soon you'll be replaced by a drone LMAO, and go back to your trailer living off welfare again LMAO.","commenter_a":"Still waiting for some idiot liberal to explain to me how importing hordes of stinking uneducated radical muslim savages is good for America. Other than dumbass mouthpiecees spouting the usual \"that's not who we are\" bullshit.","post_message":"\"How did we get in the position where we’re screwed if we’re not in the good graces of the Muslim community? Maybe we should stop doing that.\""},{"comment_id":"10153424908946094","commenter_b":"I wonder if the folks at Apple are thinking \"PLEASE Mr. Snowden, don't support us!\".","commenter_a":"Citing an 18th century law concerning iPhones?!","post_message":"A major debate over privacy and online encryption has erupted after the computer giant Apple announced it will resist a court order to help the FBI break into an iPhone recovered from one of the San Bernardino shooters."},{"comment_id":"10156488324870093","commenter_b":"About time now shoot the poachers especially dentists lol","commenter_a":"Thanks!!","post_message":"Yay!"},{"comment_id":"1790539951180053","commenter_b":"Yes I'm so glad we have had 164 shootings still at war . and trillions more in dept millions more in wellfare a totally screwed up healthcare system. Iran nuclear deal giving Iran billions . can't read it if you don't sign it . let's lie to the Americans because they are to dumb to see it . it was a video we are sorry ,sorry you destroyed our embassy killed raped and mutilated our people. Here is a couple of billion dollars and forget what you already owe us . oh and can we raise the dept drilling again or we won't pay SSI to the people who ducking paid into it . but let's keep those welfare checks going got to keep my peeps happy . get Chicago how are those tough gun laws going , highest rate of gun crime in the country . yup more gun ...","commenter_a":"Thank you GOD for giving us President Obama for two terms!!!!!!","post_message":"Hear that Donald J. Trump? President Obama DGAF about how you describe a terrorist attack."},{"comment_id":"10154641460388734","commenter_b":"Where there is smoke. There is fire. Only the individuals involved will ever know the truth.","commenter_a":"Hi Tony","post_message":"A woman accusing Republican Presidential nominee Donald Trump of ‘of victimizing her with inappropriate sexual conduct’ is speaking with the press for the first time."}]
