[{"comment_id":"1570942919862279","commenter_b":"@username how about keeping your dick in your pants if all you men are going to do is walk away.....","commenter_a":"58 million human babies have been victims of abortion in the past 43 years since Roe vs Wade legalized abortion through all 9 months of pregnancy. Science has proven that life begins at conception. Social injustices continue such as poverty, hunger, underemployment, and child abuse has actually increased. Killing innocent life has not and will not solve these problems. Women and men suffer terrible regret for a decision that can never be reversed. They need real help and healing. The website hopeafterabortion.com offers loving help to post abortive women. Prolife Pregnancy Care Centers offer free nonjudgmental, loving support whether a woman decides to give birth or abort. So many women have been exploited and even died due to abortion. Abortionists get rich killing babies. Planned parenthood is the largest abortion provider in the United States. They do not provide any prenatal care or even mammograms. None of their services are ...","post_message":"\"Only when America chooses, remembers, and restores her respect for life will we rediscover our moral bearings and truly find our way,\" Rand Paul said."},{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"10155084101790329","commenter_b":"LOL she's too real","commenter_a":"@username LMFAO BYE","post_message":"The best answer to the infamous question we've ever heard."},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"10154702328234411","commenter_b":"Trump build that wall","commenter_a":"ONLY IF THEY'RE SWIMMING BACK ACROSS THE OPEN SEWER!","post_message":"\"This policy de facto creates an open border with Mexico.\""},{"comment_id":"10155549933771729","commenter_b":"They are terrorists. Maybe, its time to form our militias and eliminate these crazy evil nuts.","commenter_a":"Yes indeed. Love it!","post_message":"Oh, so sorry..."},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""}]
