[{"comment_id":"10153621396858352","commenter_b":"Look little girl you came out me with your dumb ass statement, you the one feel some type of way bitch because gow I feel and what I know. Now I understand your 16......young and dumb like I said","commenter_a":"Oh let me guess....its not about race, her people's have money.....yea right, its all about race and for those dum ass white people who says its not......go eat a dick.....this some bullshit","post_message":"Parents’ fury after girl, 16, who killed three friends in crash while driving SUV without a license is ordered to write an ESSAY instead of serving jail time"},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"773429869426968","commenter_b":"This is why the crooked libs are trying to let illegals vote. Another law breaking move. Criminals. That's what libs are.","commenter_a":"He is a waffler. Stop the insanity. Everyday. He takes a different stand. Go away. Please","post_message":"Trump's rally in Phoenix, Arizona immediately made headlines all over the country - and there's 10 big reasons why..."},{"comment_id":"1100615946681704","commenter_b":"@username I am very well aware of anything involving Trump or Hillary. I have kept myself very informed for years. Information he gained while being social with the Clinton's is exactly the information he needed to make his decision to run for President. She is corrupt. Period.","commenter_a":"There is a prayer movement sweeping across the country for Donald Trump. More and more roadblocks are popping up to stop him. If he is your choice, please share a prayer at 10 am and 7 pm that God will take him to the presidency. Feel free to share this post.","post_message":"Wow... he really said it! @webpagelink"}]
