[{"comment_id":"567943360046309","commenter_b":"How did you get where you are if that is true and by the way lady, the last time I checked the White House was occupied by a Black Family !Stop feeling sorry for yourself ! Get therapy and get over yourself !","commenter_a":"When hate is all you got to sell","post_message":"“This country was founded on racism and sexism, point blank.\""},{"comment_id":"10157212234715389","commenter_b":"They left them to die!!!! They were tortured before they killed them.... What kind of sick people lets this happen with the best armed forces in the world!!! These people need to go to jail!!!!! They did it on purpose!!!!! Sick !!! For heavens sake place these people in jail!!!!","commenter_a":"#nofaithintheGOP. Yeah, we know.. So you wrote a paper about it. What do you want? A diploma...Go arrest them. #theyarepartoftheproblem.","post_message":""},{"comment_id":"10155051034632235","commenter_b":"OMG, that white woman nothing but a pathetic looser, of course everyone could attack elderly or children, what a moron, see what happened if she fought younger Korean woman, she definitely 'll get beat up by her taekwondo or judo and beg for mercy, are we going to live backwards like in 90 again!?!😠😠","commenter_a":"It just goes to show you what low life's the \"superior\" white folks are.","post_message":"Welcome to Trump's America."},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"},{"comment_id":"10155461378486509","commenter_b":"trump Come clean , admit your a Rapist and we will feel sorry for you and vote for Hillary ,","commenter_a":"I'd love to see Trump supporters try to deny he said the things he was filmed saying.","post_message":"Watch Anderson Cooper repeatedly ask Donald J. Trump about sexual assault at the last debate. @webpagelink"},{"comment_id":"953722131412277","commenter_b":"Bye bye little bitch","commenter_a":"All of this MORMON bailting tactics.......declaring him the prophecy.....ARE YOU ALL KIDDING ME....YOU REALLY BELIEVE THIS GARBAGE?? LOOK INTO HIS EVIL EYES and you will see what he plans for us!!!","post_message":"A new poll shows Sen. Ted Cruz (R-TX) with a sizable lead in Utah's upcoming caucus vote..."},{"comment_id":"10154438861719726","commenter_b":"While I can understand the basis for some of these observations, the main thing I firmly believe is that perhaps just over half the Democrats who actually voted for Obama in the last election will turn out to vote this cycle. I do not see near the support, energy, emotion, or urgency that I saw in the last two Obama campaigns, and lets be honest here folks... Hillary Clinton IS NOT barak obama. She does not have the well-oiled campaign machine Obama had. All she has is a character-assassination campaign, that's it, and it's exactly what I expected from her too. It honestly would not surprise me if Trump carried a lot of the swing states simply because democrat voters know she's a damaged candidate. Add to that that about half of the Democrat voter bloc in play this cycle was Bernie Sanders supporters of which many of them won't ...","commenter_a":"HIllary doesn't want to talk about the issues because she has no plans except what Obama has told her to say.","post_message":"This is the strategy Trump can use to defeat Clinton:"}]
