[{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"10153828669523984","commenter_b":"So tell me what religion does rule the world ! Plus most of you are SCARED because you have either been the bully or profited from the bullying of other countries ! Just admit that you don't know how get your power back ! It seems to me that 9/11 made our county a rape victim and you see the rapist in every Muslim ! But we've used the same tactics! Oh , you didn't mind sending missionaries over there to convert them , but we don't want them here, even the ones that became Christians ! We reap what we sowed and you still don't see it or get it ! You can't kill them off . We tried that already ! Change how we deal with them for starters. Or we can squat to their level and try again ! But if you yourself are not going to ...","commenter_a":"I think this is a good example of why not to allow sharia law in the United States. We have our own laws that need to be enforced. When you come here that's the laws you follow. Muslims don't rule the world. Time to set them straight","post_message":"These Muslims were going around burning churches, but they were in for a RUDE awakening when they showed up at this one...  Concerns about Sharia being implemented in the United States have been escalating, do you think we could see this spread to the U.S.?"},{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"},{"comment_id":"933394380031531","commenter_b":"Good girl tell it like it is","commenter_a":"No one should lose their job for honesty","post_message":"Judge Jeanie Could Lose Her Job After Job After Publicly DESTROYING Obama On Live TV [VIDEO]  She just put everything on the line. Let's show her our support.  Can we get 30,000 'LIKES' for Judge Jeanie?"},{"comment_id":"1794488717482719","commenter_b":"Entertainers are daydreamer & live in fairytale world. Reality is not their attribute or focusing on oneself identity. Most live in denial & are good at role playing an artificial character. I'm not shocked at their liberal idealism & doing whatever for attention. These are individuals that struggle with growing up.","commenter_a":"Are they all just insane. Who cares if you cut your hair or any other stupid thing. It only hurts you no one else. So asinine.","post_message":"This is how some liberal women are coping with Trump's election win."},{"comment_id":"10153843036548984","commenter_b":"She should be in jail!","commenter_a":"Not more than the parents and siblings of the fallen, you arrogant wench.","post_message":"Hillary Clinton was already in a tough spot at the Benghazi hearing. Then she went and said this sentence and buried herself even deeper...  Do you think Hillary should be held accountable?"},{"comment_id":"10154266056696051","commenter_b":"She looks dreadful!!!","commenter_a":"the VALUES are no 'right' unless they are YOUR values?? I don't think so...........the American people have spoke. Donald Trump Is Our President","post_message":"Hillary Clinton made her first major appearance since losing the presidential election last Tuesday. Do you agree with what she's saying?"}]
