[{"comment_id":"10156229104235354","commenter_b":"Kim more is nothing but a troll. But she needs to shut up and mind her on business. Dumb Limey.","commenter_a":"Piers shut up and stay in England, count all the people been kill in your own country....................................................","post_message":"See his 5 tweets."},{"comment_id":"10153305940576051","commenter_b":"If she is guilty, she should get the death penalty...","commenter_a":"\"Parents should be allowed to do whatever they want with their kids,\" we insist. \"It's THEIR children,\" we say. But what happens when the parents are sick and twisted? Huh? Don't kids have a right to be safe from their own parents?","post_message":"Even the grand jury was stunned that a mother could be so cruel to her own daughter."},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"},{"comment_id":"10153593433561323","commenter_b":"when people are in the process of migrating from one spot to another they are sometimes referred to as migrants.","commenter_a":"because it describes a particular group of people. Like descibing a group of people from Norway as Norwegian or whatever. jeez","post_message":"\"You will still see the word 'migrants' or 'migration' in the Guardian as a general expression to cover people who for whatever reason have moved, or are moving, from the country of which they are nationals to another. But 'refugees', 'displaced people' and 'asylum seekers', all of which have clear definitions, are more useful and accurate terms than a catch-all label like 'migrants', and we should use them wherever possible.\" - David Marsh, Guardian style guide editor."},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"1213211328691180","commenter_b":"Yes","commenter_a":"YES","post_message":"It's AMERICA! Learn it or leave! Comment yes or no! LIKE OUR PAGE!----> Freedom Daily"},{"comment_id":"10153679869402629","commenter_b":"Who cares... Let her be a kid!","commenter_a":"good for her","post_message":"Malia Obama. is touring colleges to decide where she will go to school (and maybe play beer pong?) next year."}]
