[{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"1034093419959450","commenter_b":"@username OMG Yay! We should praise bernie more often! <3","commenter_a":"He needed to win by 57%. He barely squeaked by, and only tied in delegates. It was not a good day for him.","post_message":"Are you feeling the Bern?"},{"comment_id":"10153603934566336","commenter_b":"From one extreme to the other. Idiots who need to find villages.","commenter_a":"That is so ridiculous! Why are people so stupid and go to such extremes.","post_message":"In the wake of the controversy surrounding the Confederate flag, a school district in Tennessee has banned all flags and banners, including the American flag."},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"},{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"},{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"}]
