[{"comment_id":"10153252381712016","commenter_b":"Don't speak for young women. You aren't one.","commenter_a":"Young women see through Hillary..she put up with a cheat for a husband as a ticket to the WH...thats not what young women want for a future...its from the 50s...she lied to protect him through numerous scandals and no longer does it convincingly...she mumbles stock phrases about equality with no real commitment to anyone but her ambition!","post_message":"\"Through a record-breaking voter turnout, we won because we harnessed the energy and the excitement that the Democratic Party will need to succeed in November.\" --Bernie Sanders"},{"comment_id":"10152882647786234","commenter_b":"Hypocrite. ^^^ She let 4 Americans die. You dummy.","commenter_a":"Christie goin down. I always said he would.","post_message":"David Wildstein admitted to conspiring with others to \"punish\" the Fort Lee mayor for not endorsing Governor Chris Christie in his re-election bid."},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10154655361619170","commenter_b":"She looks like calling us Deplorables. She should look in the mirror..","commenter_a":"And she belongs in a mental hospital.","post_message":"Here's what Hillary thinks about you. Now click to join us in a little experiment concerning this."},{"comment_id":"876414139081949","commenter_b":"You guys should follow the example of other country's. In Panama there is a big movement right now. No more inmigrants! Everybody is taking the social media and demanding that all the undocumented get out of the country! So let your voice be heard!","commenter_a":"Grinning fool. Poster picture for Term Limits.","post_message":"Click to see the back-room deals Republican leaders are making to fund Obama's executive amnesty..."},{"comment_id":"10153380129759087","commenter_b":"The countries that ban him should take the refugees. If they want to stand up for them so bad, take them. Oh ya, Dubai won't take any refugees. They are just hypocrites.","commenter_a":"Another great endorsement to vote for Donald Trump. Way to go Dobye.","post_message":"Donald Trump's name has been removed from a multi-billion-dollar luxury golf course project in Dubai in the wake of public outcry over the GOP presidential candidate's proposal to ban Muslims from entering the US."}]
