[{"comment_id":"1366520420044674","commenter_b":"Hope you get well soon. Your health is what's important. Take your time so you can heal completely before you return.","commenter_a":"Do what you need to get completely healed because we need you when the football season comes.","post_message":"Wishing you a speedy recovery, JJ Watt!  MORE-->@webpagelink"},{"comment_id":"10153509704082452","commenter_b":"So she sees a medieval torture device in her snatch, boy that's a bright one right there. I feel sorry for whoever got that scag pregnant.","commenter_a":"LOL........","post_message":"A pregnant woman said she saw an image of the crucifixion of Jesus Christ during her ultrasound."},{"comment_id":"10153805659416167","commenter_b":"For some reason I don't find the position of first lady (as you put it) as important as President. He cheated on his wife, maybe you've never done that, but there's many people ou t there who have cheated on their significant others. Not saying it's right of course, but the other presidential candidate cheated on his wife(s) also and I know the Republican's like to compare other political people when they're accused of something. Look at Trumps wife and her past. Do you really think she should be living in the White House? She's not even from America. Not that I think that's a good enough reason, but I know how you Republicans feel about immigrants. If you look at the naked pictures of her you may also feel she doesn't belong in the White House for that reason. Not that I think that's a good enough reason, but ...","commenter_a":"IMAGINE if you can...a useless, disgusting, nasty, corrupt, rapist, POS perverted woman abuser as our 1st Lady...Billy the perverted Clinton!!!","post_message":"Good grief. Uhh Joe why are you just mentioning this now?"},{"comment_id":"1057065101012919","commenter_b":"Those camps are for the Ameriicans. The illegals are going to be slaves & the muslims will be living in your house.","commenter_a":"Not nearly enough room for all the democrats,liberals,communists ,illegals .ect....afterwe start to round them up.","post_message":"The 800 FEMA camps across the U.S. can only hold 16 million..."},{"comment_id":"1023434111010933","commenter_b":"someone can't read the headline in the article lolol","commenter_a":"Stop blaming anti vaccers, we are the ones smart enough not to inject ourself or others with the disease.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10153409489988010","commenter_b":"AIR COOLED vs. WATER COOLED. Not all motorcycles are designed alike. Bikes also have a tendency to overheat in higher/hotter temperatures.","commenter_a":"I've heard a common argument in favor of lane-splitting from motorcyclists that it's a necessary practice due to the lack of cooling on motorcycle engines. To avoid overheating, motorcyclists cannot sit idle very long as automobiles do. I've always wondered what the full truth is behind that.","post_message":"Motorcycle lane-splitting — the rush-hour time saver for bikers that enrages many drivers — may be poised for formal legalization."},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"}]
