[{"comment_id":"10154048575244456","commenter_b":"Joke","commenter_a":"Prayers for Gunn's mom and prayers for Officer Smith. I pray that the whole truth be revealed and this young man will be safe.","post_message":"\"MPD supports their men and women in blue. #it'sok2hitthelikebutton,\" the post on a MPD Facebook page stated.  Here's what we learned today:"},{"comment_id":"1204607766260053","commenter_b":"Crazy woman","commenter_a":"Why is she even in the news? What is wrong with people that will send her money for this fruitless action...how stupid can you be?","post_message":"WOW! JILL STEIN'S 'FIRESIDE CHAT' Exposes Her Delusion On Recount [Video]   Jill Stein trying her best to remain relevant!"},{"comment_id":"10157473875275354","commenter_b":"The fact that he is pledging his support after this email scandal, proves that he is now being bought by Killary!","commenter_a":"A leaked memo shows the Bernie Sanders campaign considered asking the Democratic National Convention for a private plane as part of his endorsement of Hillary Clinton to help his movement energized. Feel the burn of corruption!","post_message":"WATCH the mass march and see just how \"united\" Democrats are...against Hillary Clinton!  \"Hell No, DNC, We Won't Vote for Hillary!\" #DNC"},{"comment_id":"10153326850769411","commenter_b":"muslims bitch and cry more than the gay. lets just put all of them gays and muslims on 1 island. and blow it the fuck up","commenter_a":"All muslims ever do is make demands.","post_message":"'They behave like the neighborhood bully, persecuting Palestine footballers, athletes and the movement of sporting equipment. Enough is enough.'"},{"comment_id":"10153862268256680","commenter_b":"@username I was waiting for Hillary to pass out again and need to get dragged off stage. Maybe next debate!","commenter_a":"He wasn't great we can admit that but he just needs to show he can sit in the chair and he more than did that!","post_message":"Donald J. Trump is used to audiences that are already primed and ready, unlike the debate crowd."},{"comment_id":"481936961966259","commenter_b":"He was the saviour of Manchester last season You fickle lot Haha","commenter_a":"When i read what those nukes are capable of,and that there are people who'd use them,I honestly despair for the human race...","post_message":"Each warhead has an explosive power about 22 2/3 times larger than the Hiroshima blast."},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims.  Norway made a brave move, now the rest of the world needs to follow their example.  Do You Support Muslim Deportation In The United States?"}]
