[{"comment_id":"1702718559987828","commenter_b":"Vote Trump & #MakeAmericaHateAgain","commenter_a":"Enjoyed seeing everyone and the interaction. Refreshing to see and will support Trump all the way. Vote Trump and let's Make America Great!!","post_message":"GOOD MORNING! If you missed last nights #TrumpFamily Town Hall on CNN with Anderson Cooper- you can watch the full version here! My family and I had a wonderful time. Enjoy!"},{"comment_id":"792840600880967","commenter_b":"I agree, but so does the weak Democratic Party leaders who have also FAILED us.","commenter_a":"I'm a democrat, Maxine Waters please sit down and regroup. The Democratic Party is weak weak weak and has no legs to stand on and you, Nancy Pelosi and Chuck Schumer need to be replaced period.","post_message":"Maxine Waters on Trump advisers: 'This is a bunch of scumbags. That's what they are, who are all organized around making money.' @webpagelink"},{"comment_id":"10153312840067098","commenter_b":"My point is, YOU don't know what people do.","commenter_a":"How about we worry about our homeless vets and not other countries people.","post_message":"The results come amid a heated debate in the wake of the attacks in Paris..."},{"comment_id":"10154274724531320","commenter_b":"Let us see the lady you're talking to.","commenter_a":"Where is Greg?","post_message":"Good Day After Show!"},{"comment_id":"10153468728217507","commenter_b":"By RIGHTS she should be arrested, Constititutionally tried on TV and executed for TREASON. The first woman","commenter_a":"Hillary is a disgrace","post_message":"47 more states to go!"},{"comment_id":"778618008970820","commenter_b":"I am hoping for a selective hailstorm just on the protest groups, with BIG stones.","commenter_a":"This is not protesting. These are forceful dictator type actions that are not consistent with what our country is about. And if the whole point of this is to start up Martial Law, you have no idea what you are trying to start. I am confident God is bigger than this. :) Lord, protect our freedom from dictators and those who wish to act like them.","post_message":"These left-wing groups have vowed to 'shut down' Trump's inauguration. Here's how."},{"comment_id":"1026494337483744","commenter_b":"#MakeWhiteAmericaGreatAgain","commenter_a":"How about instead of protesting they work on getting jobs and off the system. I'd love to go to the inauguration but I have a job and millions of people on welfare are counting on me every day to work so they can freeload.","post_message":"Unbelievable..."}]
