[{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152981955661336","commenter_b":"Obama the terrorist wants Islam to take over America!","commenter_a":"There's no sense in complaining!The people can get rid of obuma anyday they choose to!!","post_message":"\"[President Obama] clearly romanticizes Islam and treats it as though Islam is above all criticism… And until we hold Islam to the same standards as every other religion, ethically and behaviorally, terrorism wins.\" – Lt. Col. Ralph Peters"},{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"},{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"},{"comment_id":"10153851640243984","commenter_b":"Fire that going bitch","commenter_a":"Isaiah 5 : 20 ~ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!","post_message":"This young Texan is standing up for her religious beliefs BIG time after her teacher tried to force students to deny that God is real, and threatened them with failing grades if they did not. Do you support this young girl for taking this stand?"},{"comment_id":"491024294436506","commenter_b":"@username you are a horrible racist pile of feces. You're worthless.","commenter_a":"I take offense at The Great White Trash's reference to any member of Native America. He should keep his trash talking to himself. Pocahontas' only crime was a lapse in judgment by saving the life of some white guy.","post_message":"When Donald Trump was asked if “he had been chided by any Republicans” for his Twitter war with Elizabeth Warren, the presumptive nominee said, “You mean Pocahontas?”"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."}]
