[{"comment_id":"882209121877695","commenter_b":"When they said the meek would inherit the Earth, I don't think they meant the stupid. Unless they did and if that's the case someone is so fired for reading that wrong. But I am sure that isn't the case. Though that means god is going to be ever so pissed. At least everyone of these blind hate filled asshats will be happy to know Hell is warm year round forever.","commenter_a":"Kudos to them 'good 'ole white boys' for doing there part against ISIS by attacking an innocent old man. They should go fight in Syria if they have the courage.","post_message":"U.S. Sikhs are frequently conflated with Muslims and often wind up absorbing the backlash against Islam."},{"comment_id":"992964070763341","commenter_b":"well you know... some women have it...some don't... (but i agree with your message)","commenter_a":"She's got a boyfriend and I haven't","post_message":"She attacked her boyfriend in a drunken rage because he refused to have sex with her"},{"comment_id":"10153285137206770","commenter_b":"Make them eat PORK.","commenter_a":"YES!!!!!","post_message":"'In the Middle East, we have people chopping the heads off Christians. Not since medieval times have we seen what’s going on.'"},{"comment_id":"10152633233581680","commenter_b":"women are human beings that can die from forced pregnancy.","commenter_a":"A baby is not a CHOICE its a human being thats alive.","post_message":"“Congrats, you’ve earned this for trying to deny women their right to choice,” the note inside read. “Mind your own uterus.”"},{"comment_id":"10153796714106636","commenter_b":"Lady please..take a seat!!","commenter_a":"Obama has destroyed this country and race relations in US","post_message":"'Black men dying and being forgotten. People retaliating against the people that are sworn to defend us. We have to come together and end all of this.'"},{"comment_id":"1067465993294258","commenter_b":"James Whitehead","commenter_a":"Amanda Henry I squealed multiple times. The author is a great read too!","post_message":"A little something to brighten your day."},{"comment_id":"885760648126024","commenter_b":"Such a wonderful hero to me. He's human, makes mistakes and humbly admits it. That takes a real man. Thank you, ' W'.","commenter_a":"he is a moran.","post_message":"So funny, and 100% class..."}]
