[{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."},{"comment_id":"1091470624223610","commenter_b":"I beg the differ sir! Here's one for Trump!! I want at first, but as this plays out, he is the only out sider I trust!!","commenter_a":"You are so wrong again. Stop you are losing all credibility. Your own hate for Trump, is going to be the end for you.","post_message":"\"You're damn right.\""},{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"10153629166689170","commenter_b":"I bet Herman has watched this a 1000 times","commenter_a":"You mean to say that I have to save this so I can show my lil boy when he gets older the travesty that happened and the wrongs performed by these terrible women, it won't be easy but it's for future reference , thank you Libs for bringing this horrible video to our attention or no one would have known about it hahahaha","post_message":"The left does not want you to ever watch this video because it's \"hyper-feminine\" and not diverse or something. So even though we've embedded it here, don't watch it!"},{"comment_id":"10153029899116336","commenter_b":"She's a idiot.","commenter_a":"What a joke! Anything to grasp at more sympathy","post_message":"'American Sniper' Chris Kyle’s wife, Taya, asked family friend and U.S. Navy SEAL Pete Scobell to record the song \"Hearts I Leave Behind\" to honor her late husband. Watch Scobell's performance from earlier today on Fox & Friends."},{"comment_id":"1046875855332998","commenter_b":"Scary!!!","commenter_a":"correct your self b4 you talk about Mr President Obama tramp....","post_message":"Since I am self-funding my campaign, I don’t have to worry about being politically correct! President Obama has fought ISIS in a politically correct manner and look where it has gotten us! If we don’t talk about and address our country’s issues - we will never solve them!"},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."}]
