[{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"10153940739241178","commenter_b":"What a bum bitck","commenter_a":"IDIOT!","post_message":"MSNBC host goes on CRAZY rant about Star Wars being racist."},{"comment_id":"10157063927485725","commenter_b":"#ByeByeCrookedHillary","commenter_a":"Wipe terrorism off the map...so many countries suffering...and who knows...without TRUMP we WILL be next...TRUMP 2016","post_message":"Thank you Lt. Steven Rogers. We will respond to terrorism with strength in 2017!"},{"comment_id":"840577339312941","commenter_b":"I can't help but wonder at a few things, if the anti vac parents with children that have Measles now had seen to it that their kids had the MMR vac, would the kids be sick now and also, look at where the majority of the kids that have had and now have measles have in common...vacation to Disneyland...ummmm no illegal alien has that kind of money, unless they are coming from wealth in the first place. It is all too easy to blame the \"illegal aliens\" for everything wrong in out country...not always the case.","commenter_a":"Ya think? Duh....","post_message":""},{"comment_id":"923226521098446","commenter_b":"Shut up Loretta, now!","commenter_a":"Not only telling the truth - but the DOJ just blatantly stated that they will take away your First Amendment rights!! So DOJ is after our 1st Amendment rights, Obama wants to take away our 2nd Amendment rights, the list goes on and on.....the hits keep on coming!","post_message":"Criticism of Islam equals Islamophobia, and the attorney general of the United States, Loretta Lynch, has just warned that people will be prosecuted for criticism of Islam -- i.e., telling the truth that Islamic terrorism exists. You can be prosecuted if you tell the truth about Islam."},{"comment_id":"10154505706873812","commenter_b":"If you create terror among a group because you are shooting them and killing them, you are a terrorist. If you align yourself with a KNOWN terrorist group, you become part of that terrorist group. I don't believe any domestic terrorist has EVER sworn allegiance to God and commenced to killing folks though.","commenter_a":"Just because it's deleted doesn't mean it wasn't said!!! He swore his allegiance to isis! We already know this. I guess offending those of the same belief and/or faith is more important than the entire truth being released so it's sugar coated and deleted. Sickening!! Why bother releasing any of it if you delete the parts where he ADMITS he's a freaking terrorist?!!!!!","post_message":"UPDATE: DOJ and FBI release full transcript from Orlando shooter's 911 call to provide the \"highest level of transparency.\" abcn.ws/28It1Ld"},{"comment_id":"989113651145780","commenter_b":"Well I don't consider myself religious just because I have a relationship with god. I am Christian. The lord is my savior.","commenter_a":"sigh....","post_message":""}]
