[{"comment_id":"10153784232529255","commenter_b":"Money. Sickening greed. If taxes were confiscatory for the top rates, we'd have less of this.","commenter_a":"Do these companies that are selling...like a pharmaceutical or National Geographic not know WHO they are selling to or even care?","post_message":"RIP From Daily Kos user Eyesbright"},{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"1192453620787838","commenter_b":"Pitiful female !","commenter_a":"She's not the teacher she could be a student","post_message":"The report said the teacher ended up having an abortion after she got nervous when Child Protective Services unexpectedly showed up at school in February to question her and the student about their relationship."},{"comment_id":"10153231031836051","commenter_b":"Yes, Hillary should have lost her security clearance a long time ago when they first discovered she had breached security with her emails...she should also lose her freedom...she belongs in jail for her crimes. And she will get out lucky if we don't ask for her life as well.","commenter_a":"Hell yess","post_message":"Do you agree or disagree with these intelligence officials?"},{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"}]
