[{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"},{"comment_id":"540816769423579","commenter_b":"Don't run 3rd party now. We would get blamed for a Hillary victory. There may not be much a republican party left in 2020, so that would be the time to start a new party.","commenter_a":"I think we should run a third party candidate now!","post_message":"Should conservatives start a third party? Should they begin one now and put it in place for 2020 or Should they run a candidate now? How would they not be blamed for a Hillary Win? Do you have the stomach for bloody politics to drive the final stake in the heart of Mitch McConnell's corrupt GOP? I have an opinion. I may surprise you. I want to hear Yours. Let's keep the name calling to a minimum let's have an actual debate based on Reason?"},{"comment_id":"10153222902488645","commenter_b":"@username dont worry about those nails.... worry about that mouth full of yellow teeth.... nasty","commenter_a":"Who cares? The dude is old as hell and WWE is for red necks.","post_message":"Hulk Hogan claims that he resigned from the WWE in the wake of the release of the transcript in which he used racial slurs, while the pro wrestling company says he was fired. Either way, all mention of him has been scrubbed from the WWE's website."},{"comment_id":"894713893918640","commenter_b":"They are teaching the future illegal aliens how to unionize for maximum benefits. What a COUNTRY!!!!","commenter_a":"VERY WRONG!!!","post_message":"The IRS commissioner says that even illegal aliens who don't pay taxes could receive tax refunds with Obama’s executive amnesty!"},{"comment_id":"1234184189935923","commenter_b":"Júlia, por favor, não vire uma crazy cat lady!","commenter_a":"Se encontró una asociación entre tenencia de gatos a temprana edad y desarrollo de trastornos siquiátricos en la adultez. Según el journal of schizophrenia research. Doble de probabilidad de desarrollar esquizofrenia, post infección por Toxoplasma gondii. (Por arañazo de gato) Cuidado con quedar como la vieja de los simpson. Paulina Santander","post_message":"A parasite common in house cats has been linked to mental illness."},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"10153854560011378","commenter_b":"Hillary is nothing but a liar... Trump 2016","commenter_a":"I'll be so glad once Hillary Clinton wins and becomes our new president because her speech she gave the other night everything that she said about keeping the guns out of the hands of criminals terrorist and these bad people that shouldn't have guns in the first place she will keep us good people from getting shot will be great we need a change in America please God let Hillary Clinton get enough votes to win in November","post_message":"A shooting victim has died and one man was taken into custody after a police chase and crash in South Philadelphia."}]
