[{"comment_id":"10153219350514486","commenter_b":"She should EAT SHIT AND DIE !","commenter_a":"Should have been the day after she was elected","post_message":"Now that Harry Reid has announced his retirement, some Democrats think it time for Pelosi to do the same..."},{"comment_id":"921271484601636","commenter_b":"she spends our tax dollars on all kinds of expensive garbage. the woman needs a clue. race is not the issue. her habits are.","commenter_a":"And didn't they take her law degree away from her? And he apparently didn't even pass the bar exam.","post_message":"Everyone is racist at me!!  Michelle Obama whiny, self-centered commencement speech  @webpagelink"},{"comment_id":"10154985295149614","commenter_b":" this woman is simply amazing","commenter_a":"This story is inspirational n definitely tells us never to give up no matter what!!","post_message":"Karen Klein walked through 26 freezing miles, subsisting on just twigs and her urine, in order to get help for her husband and 10-year-old son after their car fell in a ditch off a secluded road.    kept her going ... is she didn want her mother to bury her daughter. She didn want her son to be without a mother, Klein's twin sister said."},{"comment_id":"10153948812912434","commenter_b":"@username you are a AntiWhite and you are for White Genocide that is why you call me a Nazi. ALL White countries and ONLY White countries are being flooded with third-world non-whites, and Whites are forced by law to integrate with them so as to “assimilate,” i.e. intermarry and be blended out of existence. Massive immigration and forced assimilation is genocide when it’s done to Tibetans in Tibet. When it’s done to Whites in White countries, it’s called “diversity.” By UN Convention, it’s genocide: “Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.” Diversity is a code word for #WhiteGenocide!","commenter_a":"White genocide is real and we can prove it. Learn the truth. @webpagelink","post_message":"The threat of ‘white genocide’ is a conspiracy theory, promoted by elements of the so-called alt-right and fueled by anxiety over fertility and immigration trends, that was popularized by South Carolina segregationist Bob Whitaker. The idea also comes up in the writings of Dylann Roof, who murdered nine black parishioners at a church in Charleston."},{"comment_id":"10153881396091336","commenter_b":"It doesn't take rocket science to figure out the motive","commenter_a":"But it was probably just workplace violence.... We just don't know...","post_message":"According to police, here’s what we know about the #SanBernardino shooting: @webpagelink • 12 pipe bomb type devices were found in the home at the center of investigation • All four guns were legally purchased • The motive has not been determined • There are no credible threats at this moment   According to the FBI, here's what we know about the suspects: •  Male came back into the U.S. in July 2014  •  Female came to the U.S. on a K-1 visa under Pakistani passport"},{"comment_id":"10154413621893279","commenter_b":"Bet she took the money anyway. How pathetic","commenter_a":"Progressives are all right in the moment Conservatives alway have the best long range strategies for gaining and holding power","post_message":"Hillary Clinton faced protests Monday by Palestinian rights activists outside a fundraising event at the Beverly Hills estate of billionaire Haim Saban."},{"comment_id":"10154991280103812","commenter_b":"Make America Hate Again","commenter_a":"Hopefully trumps followers do not take this the wrong way and try to overturn the world if he looses.... smh","post_message":"In final campaign stop before Election Day, Donald J. Trump calls on working class to 'strike back.' \"Today is our Independence Day.\" @webpagelink"}]
