[{"comment_id":"1014316725248091","commenter_b":"Sondra, you sound like someone who doesn't know what she is talking about. For many women PP is the only place where they can get cancer screening. PP provides birth control. How dare you assume that you get to make the health decisions for even a single person. Shame on you.","commenter_a":"Mr. Bera, the real 'consequences' of ending funding to PP would be an end to PP altogether..they should be brought to justice for their depravity and disregard of the law by selling baby parts-- we taxpayers have been funding them TWICE OVER for years and are sick of their lies are many other reputable womens health centers you know all of this but are afraid to vote your conscience.I'm really ashamed of you..and if you are a pyhsician as you claim, you are not a humanitarian nor a normal human being.","post_message":"As one of the few practicing doctors serving in Congress, I understand the real consequences ending federal funding to Planned Parenthood would have for patients. That’s why I stand with Planned Parenthood and will not vote to defund it. We need to keep politicians out of the exam room and instead work together to make sure women have access to preventive health care → @webpagelink"},{"comment_id":"10155209769476337","commenter_b":"And he destroyed the liberal press...made them look like the fools they are.","commenter_a":"All you hillary sorry pussys get real the Donald is the president deal with it","post_message":"Trump spoke for over an hour, and what an hour it was..."},{"comment_id":"1685131825099212","commenter_b":"Bitch!","commenter_a":"Bitch","post_message":"Can you describe #Trump with 1 word?  The Free Thought Project.com (y)"},{"comment_id":"10153282421385779","commenter_b":"Eat a bag of dicks.","commenter_a":"White Privilege: Being held accountable for the actions of your ancestors by people who refuse to be accountable for the actions of thier children","post_message":"Late last week, Macklemore and Ryan Lewis released a new song called 'White Privilege II,' featuring the poet and singer Jamila Woods. The song immediately inspired praise, scorn and conversation. Here are four things Macklemore told us about the track."},{"comment_id":"10152739973466519","commenter_b":"The Democrats are the snakes. Here come the eagles.","commenter_a":"At least the Republicans are growing a spine and starting to stand up to the Democrats properly rather than just whining about impeaching Obama.","post_message":"It took long enough, but here's how Obama realized that playing nice with Republicans is a sucker's game..."},{"comment_id":"447635222089017","commenter_b":"You are probably pro abortion cause you hate child support...","commenter_a":"This is great. You idiots that are against abortion are just that Idiots. Quite trying to take rights from Women . Plus Planned Parenthood doesn't pay for abortions. The client does. They provide health care. Get your facts right.","post_message":"JUST IN: A Houston grand jury investigating undercover footage of Planned Parenthood found no wrongdoing by the abortion provider but instead indicted anti-abortion activists involved in making the videos that provoked outrage among Republican leaders nationwide."},{"comment_id":"10152882681411028","commenter_b":"Man ..... She Can Eat LOL","commenter_a":"I just are a bagel this morning and had a great cupe of Coffey.","post_message":"Molly Schuyler ate three 72-ounce steaks, three baked potatoes, three shrimp cocktails, three salads and three rolls in way less time than it'd take for someone to cook all that food at home.  And the reason she turned down a fourth steak? She was sick of the taste -- not full. @webpagelink"}]
