[{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."},{"comment_id":"1054028271282063","commenter_b":"You know thats an opinion. My grandfather fought some battles i could never even imagine in my worst nightmares. He earned his title and passed it down and if to a woman so be it. I stick with this country has the best military not because of our abilities but the devotion of our troops make it so. If a woman earns a ranger tab she did it because she truly wanted it. She pushed herself beyond her limits and succeeded. So no matter what others think because its only their opinion i am proud of these women and i ambproud of our troops. Sure they may be women but look how many millions of americans wouldnt dream of going to war yet these women are willing to risk it","commenter_a":"You know Russia in world war 2 fought with women on the front and never had an issue. Israel has women in their military and has never had an issue. Heck they have yet to be defeated. My question is why not allow women the opportunity to serve as well? Set a standard and if a man or a woman either one have the skill and determination to achieve it then that is what we need in our military. It reminds me of a story in Vietnam I heard once (Of course before my time) there was an older black man and an older white man I spoke with once. They were best friends and would do anything for each other. They told me that each was in the 1960s very prejudice. The black was raised to hate whites and the white raised to hate blacks. They went to Vietnam ...","post_message":""},{"comment_id":"471937499632872","commenter_b":"Give it up lady. Your lies won't work with me.","commenter_a":"He's what a president should be and it's a shame the next won't try half as hard as he did.","post_message":"\"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made.\""},{"comment_id":"1793385047544902","commenter_b":"@webpagelink wrap.com/trumps-law-firm-won-firm-of-the-year-award-in-russia/","commenter_a":"How are we continuing to allow this to happen? How high a mountain of evidence must be built before someone in charge realizes something has to done to prevent his reign from commencing?","post_message":"You literally can't make this up..."},{"comment_id":"887276944740413","commenter_b":"@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"10153366613454712","commenter_b":"She's a joke","commenter_a":"So how is she suppose to be courageous when she hides reports that was commonly issued? She hide knife? How is she courageous? How courageous to point a muder finger at innocent driver","post_message":"Memo to Marilyn Mosby: Baltimore wants transparency, not sealed documents and gag orders."},{"comment_id":"10153097133433271","commenter_b":"Better relocate. .. drunks and moosee don't mix well..... drunk will loose","commenter_a":"@username this would've been amazing:)","post_message":"A young female moose wandered into downtown Boulder Sunday night, strolling down the Pearl Street Mall. On the advice of a state wildlife officer, police fired some bean-bag rounds at the moose's backside and eventually shooed it away from the populated area.  More details: @webpagelink"}]
