[{"comment_id":"638227583024858","commenter_b":"They were all womanizers.","commenter_a":"President Lincoln: \"...that government of the people, by the people, for the people, shall not perish from the earth.\" President Kennedy: \"...Ask not what your country can do for you.\" Dr.Martin Luther King Jr. \"....one day we will be judged not by the color of our skin but by the content of our character.\" Donald Trump: \"...Grab 'em by the p***y\"","post_message":"Watch a Republican CNN commentator call on Trump to step down after tape was released of him explaining how to sexually assault women: \"He is a pig, he is vile. This is consistent behavior by him...He is not fit to be the Republican nominee. He is not fit to be called a man.\""},{"comment_id":"10154099189924071","commenter_b":"Killary is an Embarrassment ,she evidently has no idea how to run an office Legally or with Class. What she poured into this election was ill gotten money. She sure didn't use her own. I Honestly feel her major Dissapointment is her self absorbed issues that would have only added more money to the Clintons Fraudulent Foundation . Being a Great Nation is now much more attainable without corrupt Killary and the rest of her lackeys.","commenter_a":"Wow. So much hate on these posts. I hear a lot of people upset about the protests going after she lost but it seems like there are just as many sore winners out there. Whether you like her or not, people need to learn some respect. I guarantee 99.9% of the people on here haven't the foggiest idea what it takes to hold a high ranking position in our government or run for president. She poured a lot of time and effort into her campaign and to still come up short must be a major disappointment. I'm sure a lot of people have done less and been more hurt by their own failures. I thought this was a country of conscience and good will. This election has proved we are much further from being a great nation than we claim.","post_message":"“I know that over the past week a lot of people have asked themselves if America is the country we thought it was.\""},{"comment_id":"923696117653244","commenter_b":"She's not that pretty. Having breast implants make her look more like a man","commenter_a":"I heard she was back. What's Botched about?","post_message":"“One Tit Is In Africa And The Other One Is In Europe.” Tiffany “New York” Pollard To Appear On “Botched”"},{"comment_id":"10155994453335389","commenter_b":"Lady don't hurt me! @webpagelink","commenter_a":"If Trump can't handle a Fox debate against other GOP'ers, how's he going to handle debates in the general election? He may have some good ideas, but he's a sideshow. Always tooting his own horn or would that be a \"Trump\"et?","post_message":"From fiery criticism of ObamaCare and the Iran nuclear deal to support for Israel and the rights of the unborn, the top 10 Republican presidential candidates did all they could to define and separate themselves Thursday night during the Fox News debate in Cleveland, Ohio.  Who do you think won?"},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"10154082308022293","commenter_b":"Perfect boot lickers. Masters proud of you idiots. More dumb girls.","commenter_a":"I'm sure you liberals celebrated their death too.","post_message":"The discovery of two Catholic nuns found slain in Mississippi on Thursday sent shock waves through their rural community."}]
