[{"comment_id":"878088758974173","commenter_b":"I agree some people need to do there research on Noble Dru Ali.","commenter_a":"Nothing about that medallion is racist people are just uneducated and stupid!","post_message":"Jay-Z Stirs Outrage by Wearing Medallion of Racist Group"},{"comment_id":"10153929310543037","commenter_b":"Lesbians get their own series since they probably could beat the guys, @webpagelink","commenter_a":"This event is unfair....lesbians have a total advantage. ;-)","post_message":"The event will host 200 teams with 5,000 people."},{"comment_id":"970626379645816","commenter_b":"#Ansab go back to your history, that land is promised land to Israel by God. Israel made mistake coz God told them to kill anybody who will be in that land but due to kindness of Israelites now they are suffering with these Palestians cursed tribe. Land of Canan belongs to Israel coz is promised land","commenter_a":"Palestinians they deserve to be killed by Israel because of their provocation. No mercy to Palestinian death","post_message":"More than 60,000 people in the UK have so far signed the petition calling for Israeli Prime Minister Benjamin Netanyahu to be arrested for war crimes against Palestinians when he pays an official visit to Britain next month. Read here: @webpagelink"},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"}]
