[{"comment_id":"10154148707777994","commenter_b":"I'm more scared of a white maniac than some isis rag head sitting in a cave.","commenter_a":"They did it in response to capturing the guy behind the Paris attacks. You have to hunt them down and destroy them ruthlessly and make them fear you otherwise they will continue","post_message":"Here are some photos from the scene in #Brussels. The latest -- at least 26 people have been reported dead in the blasts. Dozens of others have been injured. Continue reading about what happened here: @webpagelink"},{"comment_id":"705783696236172","commenter_b":"No ovaries. Only clitoris.","commenter_a":"The clit and ovaries.","post_message":"Most of you are, or will be, very familiar with it. But it looks very different than you might imagine."},{"comment_id":"10153808795866336","commenter_b":"@username Typical Illegal Alien.","commenter_a":"Frankly it feels lousy to be called a murderer when all I'm trying to do is keep you safe. Im not a murder. That is slanderous. That is not how I act","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"592533384204588","commenter_b":"Matt, she's just another dumbass liberal !!","commenter_a":"TRUMP THE GREAT {ONE AWESOME GUY }","post_message":"Trump: \"We must replace the present policy of globalism....and replace it with a new policy of Americanism.\" How do you feel about this?"},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"937892139587360","commenter_b":"OF COURSE democrats WANT illegal aliens to vote. This would give them a VAST majority for all future elections. If this were to happen, the America that we know would cease to exist. ALL American citizens, regardless of party affiliation, must prevent illegals from being allowed to vote.","commenter_a":"What do expect it will help them to continue getting their freebies!!","post_message":"More than half the voters who identified themselves as Democrats in a recent Rasmussen poll said they believe illegals should be allowed to vote. Among all voters, more than one in three believes illegals should be allowed to vote. What do you think? @webpagelink"},{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."}]
