[{"comment_id":"723743707725776","commenter_b":"@username Marco can't stand ya!","commenter_a":"Why don't they go after his immorality.. Didn't he cheat on two of his wives. He is no Christian and then also said he has never had to ask for forgiveness OMG Adultry is a Commandment","post_message":"Donald Trump started a mortgage company (that failed) at the worst possible time -- when the housing bubble was about to burst."},{"comment_id":"1037555982922868","commenter_b":"GB = Greedy Basturds!","commenter_a":"Where does he live now?","post_message":"Tony Blair’s office said there would be “no negotiations” over his fee, which per-minute is higher than the yearly salary of someone on minimum wage in the UK."},{"comment_id":"963715427023908","commenter_b":"Thugs is a nice word for these fools...","commenter_a":"Disgusting!!","post_message":"SAVAGE THUGS DIG UP CONFEDERATE SOLDIER: Group Fed Up With Waiting Begin Digging Up Confederate General Grave (VIDEO)  NO RESPECT!   @webpagelink"},{"comment_id":"10154732148698961","commenter_b":"You recently proclaimed that you would rather see a move toward screening and the passage of more gun control. Are you serious? American citizens are being raped and murdered by illegal aliens streaming into our borders and you want them all to come on in, collect benefits paid for by American taxpayers, yet take away guns that can protect us from these illegals. You are a very disturbed person and even worse are those endorsing you and voting for you. It's a state turned upside down by liberal sycophants.","commenter_a":"Senator Murphy, how about a little get together down here in the New Haven area?","post_message":"A huge THANK YOU to everyone who came to the town hall tonight. For those who couldn't join, check out the full video here."},{"comment_id":"1010697719021125","commenter_b":"It must be true, it's on Facebook, Melanie. Facebook!","commenter_a":"Chris this was an op ed piece in a psych journal and not scientifically tested - don't tell me not to hug my dogs!😉","post_message":"Noooooo"},{"comment_id":"1263136400442382","commenter_b":"You mean Country before party right","commenter_a":"Bunch of bullshit. They need to do there job. Party before country.","post_message":"WOW."},{"comment_id":"10153443009598984","commenter_b":"She is a total THUG herself. She is helping to take Baltimore down the sewer. She needs to go it there is any hope for that city.","commenter_a":"I think Sharpton should pay it!!! He caused the riots or Jackson.","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling.  Are you outraged by the Baltimore mayor's request?"}]
