[{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"},{"comment_id":"501076896740857","commenter_b":"Please jailer give that crazy lady a good short hair cut. Get rid of that horses tail.......","commenter_a":"She wants more of the spotlight I do hope that they send her back and let her stay there enough of her do your job or resign enough of you","post_message":"Send her back!"},{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"1585875914805484","commenter_b":"Yer yer yer no one beleavs it","commenter_a":"Melissa Saucedo","post_message":"She claims Donald J. Trump 'groped her butt' because she 'looked like a younger Melania'"}]
