[{"comment_id":"903880782991323","commenter_b":"Discrimination!!","commenter_a":"I think it something that must be done, especially when children are involved. The effect of cigarette smoke on kids is devastating.","post_message":"A children's hospital announced it will no longer hire employees who smoke: @webpagelink Do you think it's a good policy or too harsh?"},{"comment_id":"10156070915820354","commenter_b":"We all know what Jorge Ramos is full of !!","commenter_a":"No, sir you are a loud mouth rude, obnoxious piece of shit!","post_message":"Reporter?   Or Activist?"},{"comment_id":"10153885803644411","commenter_b":"Those UkraNazi cockroaches belong in the trash bin.","commenter_a":"Ha! The \"Trash Truck.\" lmao... Never was there a more worthy chariot for such an unworthy set of a-holes.","post_message":"It is also not certain how much protection the new tank will be able to give those operating it, as its armor is a mere 40mm thick."},{"comment_id":"10154417440556729","commenter_b":"Muslim Jihadem Horde!","commenter_a":"And guess which country is going to have to fix things like in WWII?","post_message":"Hello??? Is anybody listening?"},{"comment_id":"736103763189471","commenter_b":"I hope the police are called for every item he, or anyone else, takes to school that appears to be an explosive device of any sort. Truly Americans can't be this ignorant. Oh, wait! We are! Obama is president and was not only elected once, but twice! For those that truly believe in tolerance and are willing to allow Islam to infiltrate our country, just wait and see how tolerant they are of you, your children, and your children's children when they become the majority. Remember this, Obama is moving in thousands of \"refugees: next year and the current Muslim population is already having children at a much higher rate than the average American family. SURPRISE!!!!!","commenter_a":"No, comments.","post_message":"Of COURSE."},{"comment_id":"10155232882540093","commenter_b":"I'm speaking about illegals, from 3rd world countries coming over our border and infecting the liberals who love them with diseases. There is a reason the government won't allow the American Citizen know where all those illegal kids and familes went to in OUR country. I'm sure the CDC would show there is a correlation between this outbreak and where these illegals settles. Look to those liberal states that have santuary cities.","commenter_a":"Funny we had nothing like this going on until illegals flooded our border.","post_message":"For many conservatives, resolving issues of faith and science can be tricky. What excuse do Democrats have?"},{"comment_id":"871781506248238","commenter_b":"one of the dumbest bitchs on TV","commenter_a":"VERY SIMPLE : The Nazi Swastika, was not invented by Hitler or the Germans. It was a Pre Egyptian and Egyptian emblem...It can also be found in Native American symbols. But Hitler and Nazi horror's exploited The Symbol ! The Confederate Flag, has much History and status. But, The KKK in the early 20 th century, hijacked this Flag, (Symbol) and carried out Murder, Lynching and Devastation to many in the South, and all over America ! Unfortunately, but accurately, these two SYMBOLS represent, Horror & Evil beyond most comprehension. Many perceive the Swastika as Evil, (When related to The Nazi Party, they're correct) & Many perceive the Confederate Flag as Evil, (When related to Racism, they're correct). What you perceive is how you believe.... Perception is Reality. Removal is just...Now what will Mississippi do ?","post_message":"They really destroy the argument for keeping the racist flag around."}]
