[{"comment_id":"791521404314373","commenter_b":"ENOUGH FREAK SHOW BULLSHIT IF YOU HAVE A COCK YOU USE THE MEN'S ROOM","commenter_a":"That's the Republicans in a nutshell lol. Poverty??? Jobs?? Helping the Poor and Veterans??? FUCK NO!!! we don't have time to do that we have to make Bathroom rules lol","post_message":"Oh no....last time I posted on something like this I hate Liberal hate mail for about a month. So what's your thought on this?"},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."},{"comment_id":"10153178842572061","commenter_b":"Give me a break!!! I do NOT want her as a role model for my daughter!!","commenter_a":"So it's for self gratification and not to improve our country? Gotcha Hills. Now go away.","post_message":"Hillary Clinton starts of debate by saying: \"For me, this is about bringing our country together fathers will be able to say to their daughters, you too can grow up to be president.\" abcn.ws/1R9qmZ2"},{"comment_id":"760477217433112","commenter_b":"Why is this show still one who watches these whiny bitches anyway","commenter_a":"So tired of people who think they are celebrities and think they can use that to preach their stupid opinions. Just shut up.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"10152788140495950","commenter_b":"She did the right thing. Can't imagine how disappointed in her son she must have felt at that moment.","commenter_a":"I am so on board with what this mother did. She cared!","post_message":""},{"comment_id":"10155175533915389","commenter_b":"Looks evil. Tired of the liberal PC bull :poop: that is going to end up killing good people. Maybe if the Terrorist went after liberals only..they wouldn't be in a hurry to let these murders free. Starting with Washington please","commenter_a":"What is this world becoming","post_message":"The United States Department of Justice said a former Al Qaeda operative was released last week from a federal prison prior to completing his 15-year sentence because of “time served.”"},{"comment_id":"10153933282696350","commenter_b":"Bethsaida Yadnara Why have their own muslim brother's turned them all away??? Jordan, UAE, Dubai, Saudia Arabia?? Those are some very rich countries, right around them.","commenter_a":"They don't belong here...and sure their parents are collecting major benefits, just for entering the country.","post_message":" know people have mixed feelings, and they can be afraid because it's the unknown. But the more we get to know these people, the more the community gets to know them, the more that's just fading away.\""}]
