[{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"410796369044958","commenter_b":"Wasn't there a time when people were suppose to be Christian? We go backwards insread of forward. We may offend another religion, but it is OK for them to offend Christians. We are feeding the Christians to the lions again.","commenter_a":"Christians has the rights , just like the mustuims do. Let them do","post_message":"Another group was kicked off campus, but the reason will shock you. Are Universities going too far?"},{"comment_id":"10153784799867894","commenter_b":"Andy needs to fire her ! #GoodBye2BasicBitches","commenter_a":"@username another storyline to stay on #RHOA","post_message":"It’s Really Over! Cynthia Bailey Announces Plans to Divorce Peter Thomas: ‘I Just Don’t Want to be Married Anymore’"},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""},{"comment_id":"1308041469292102","commenter_b":"Yet he never put anyone first ever in his life. You are believing a con man who is very good at conning people like you!","commenter_a":"All of this hate, all of this rage, against one man because he want to make this country great again, says a lot about those who want to stop him, and should be even more of a reason why Americans should vote for him, because he wants to put us first - I think that's a great idea.","post_message":"Show insiders told the AP that Donald J. Trump rated female contestants by the size of their breasts and talked about which ones he'd like to have sex with."},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"}]
