[{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please.   #WSHH"},{"comment_id":"10153317149514087","commenter_b":"@username Ok I demand that and also anyone who rents to an illegal be punitively fined. Good enough? Oh yeah and build that wall and shovel the illegal bastards out of the country. Ok Tommy-boy?","commenter_a":"No the majority of Americans do not want to keep the illegal bastards, but they do want immigration reform- it's called a wall! To hell with Sanders vote Trump!","post_message":"“We cannot and must not sweep up millions of men, women and children, many of whom have been here for years, and throw them out of this country,” Bernie Sanders said Monday. “As president, passing a legislative solution to our broken immigration system will be a top priority. But, let me be clear—I will not wait around for Congress to act.”"},{"comment_id":"10154500289369091","commenter_b":"Build that wall","commenter_a":"Trump is making up his own stories !! What would he like the ppl to do with the Syrians kill them ? They are human beings ! Smh.. All the other countries took them in ...Trump has No heart , Maybe we should put him in Syria and see how he likes it !","post_message":"Swedes have been ridiculing President Trump's remarks at his rally yesterday that suggested a major incident had happened in the Scandinavian country."},{"comment_id":"10153288204601130","commenter_b":"@username And don't even get me started on that bullshit that women think they \"feel free\" because they can hide their faces and bodies behind that stupid piece of cloth. That's not freedom dummies, that's another way of mind fucking, you can also feel free of not needed to know how you look if you spend 40 years in jail in a separate cell where no one will even know you exist.","commenter_a":"He's not holy, no one has ever been a holy person , enough your closed mind religious bullshit.","post_message":"No one rocks a baseball cap quite like the Holy Father."},{"comment_id":"10154612435337042","commenter_b":"For this comment I sincerely hope you choke on the next dick you suck. LMAO","commenter_a":"There's 83,000 Syrians and BLM thugs available.","post_message":"It's almost the holiday season -- and Macy's is hiring 83,000 seasonal employees.  Here's how you can apply:"},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"1684672748486504","commenter_b":"Just what is with these piece of shit that will videotape it and allow this to happen without breaking it up. They see a child standing there and they continue to videotape and not stop this fight. They are just as sick as the women that are fighting.","commenter_a":"Lowest of the lowest ignorant white trash. Why can't these fools go back and at least get a third grade education?","post_message":"WHAT!?   I can't believe what I just witnessed..."}]
