[{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."},{"comment_id":"10154716628348812","commenter_b":"Cynthia, please please do not vote or reproduce.","commenter_a":"Republicans are throwing everything at Hillary trying to see if it will stick. They know they will lose the election in November, and this is the only way they can come up with crap to try to cast doubt on her campaign. It is not America's fault that the only person representing their party is a certified lunatic. :D","post_message":"The various iterations of the Clinton Foundation are coming under scrutiny as Hillary Clinton runs for The White House."},{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"10152950876076130","commenter_b":"They're such bitches.","commenter_a":"Emma Green @username","post_message":"\"I cleaned the counter for you.\""},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"1313221025411316","commenter_b":"Big ear bitch stfu","commenter_a":"Keep resisting arrest dumbasses 👌🏼... If you do what your told you'll be fine If not well then that's yo fucken fault Don't try to fight them , especially against a lot of cops.., that's retared your gonna lose If your rights are violated then take them to court. 😮👌🏼. Hopefully you guys learned something from this video","post_message":"Where the officers being too aggressive? #WSHH"}]
