[{"comment_id":"10153377243163812","commenter_b":"Criminals go to Jail not to a coffin u c u n t","commenter_a":"Never in my entire life did I see so much racism!!! And it's NOT whites against blacks but the other way around!!!! Freddie gray was a criminal as was Michael brown!! Both got what they deserved in my opinion! Both had rap sheets a mile thick! Don't break the law and you won't get arrested! Simple logic! Don't get me wrong in today's society many cops coming are only there for the power but there are more that truly want to make a difference and it's sad when they're charged for trying to remove scum from the streets!","post_message":"BREAKING UPDATE: Warrant issued for arrest of 6 officers in Freddie Gray case; various charges including murder, manslaughter, assault being leveled: @webpagelink"},{"comment_id":"10154090150895329","commenter_b":"OMFG she's such a bitch...","commenter_a":"@username STRUGGLE SO REAL","post_message":"\"I will bleed on everything you love.\""},{"comment_id":"10153216157089087","commenter_b":"Screw Carly the bitch","commenter_a":"She hit the nail on the head with that statement. Problem is that people are so selfish, narcissistic, and apathetic that they don't really LOOK at a person until its too late. Did I mention lazy? Handle problems on the front end and there will be less on the back end. Do you want to elect Carly Fiorina? Or a woman with multiple murders under her belt? Or a hatemongerer? Not my first choice, but I still like her.","post_message":"“The reason I’m running for president is because I don’t want to see hope fading from anyone’s eyes,\" Carly Fiorina said. \"When someone is addicted, you watch them disappear before your eyes.\""},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"},{"comment_id":"10153240848239087","commenter_b":"So he's trying to hold her accountable.... I think more people need to keep asking the ignored questions...","commenter_a":"I have never seen a grown man act that ridiculous in a public setting. Fucking pussy.","post_message":"Rep. Jim Jordan, chairman of the House Freedom Caucus, got into a heated shouting match with Planned Parenthood president Cecile Richards during today's House Oversight Committee hearing into the nonprofit's use of federal funds. WATCH:"},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"}]
