[{"comment_id":"10153724968418598","commenter_b":"She must have been taught by Satan himself.","commenter_a":"Who taught her about Jesus? Wow.","post_message":"Abortion Clinic Owner: “The Jesus I Was Taught Would Hold Women’s Hands” as They Abort Their Baby"},{"comment_id":"10154874909449369","commenter_b":"No actually one of my best friends is a gay black woman. She knows I love her.. she is just not childish enough to allow difference of vote affect our friendship.. we have had since we children. :) Bcuz she is grown.","commenter_a":"I have grown to respect Mike Pence. Great choice!","post_message":"Vice President-Elect Mike Pence is taking over President-elect Donald Trump's transition team, replacing the former chair of the operation."},{"comment_id":"991326630995465","commenter_b":"I will never refer to you as a woman, just a bitch!","commenter_a":"I will never refer to him as President, just trump, no capital t","post_message":"From placing sworn white supremacists in key cabinet positions to sucking up to Vladimir Putin, Trump's actions speak for themselves... he is a clear and present danger to the survival of our country."},{"comment_id":"10154533840951509","commenter_b":"well you certainly are a hateful person!! Jealousy is a evil trait poor girl.","commenter_a":"I dont know if rock hudson was at the gates to meet nancy reagan if she even made it shame shame shame on you nancy","post_message":"1980s star Mr. T did not pity the fool as he recalled his seemingly odd-couple friendship with Nancy Reagan."},{"comment_id":"936780129786105","commenter_b":"This lawlessness will stand until the National Guard is called out to do a sweep for illegals. If these sanctuaries are allowed to continue more lawlessness will occur in its most violent forms.","commenter_a":"Not proud of the mayor of Chicago for sure.","post_message":"Rahm Emanuel to Illegal Aliens after Trump Win: Chicago is Your Home – You are Always Welcome Here. @webpagelink"},{"comment_id":"942704895828117","commenter_b":"Wow your a cold heart bitch With a small dick","commenter_a":"A druggie died of an overdose with assistance from his mom and grandmother - unfortunately only he died and not all of them.","post_message":"The teen's mother and her mother face multiple charges."},{"comment_id":"556485904539702","commenter_b":"Will her top fall off?","commenter_a":"What about the Blonde girl on the right? I didn't see anything unusual about her.","post_message":"TAKE A CLOSER LOOK A THE BLONDE GIRL ON THE RIGHT..."}]
