[{"comment_id":"652304278301265","commenter_b":"Jeremy Kwan Matthew MacKellar Anthony De Ruijter have a look at urs its actually fooked","commenter_a":"Braden Shaw","post_message":"There's a hidden map in your iPhone of everywhere you've been."},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."},{"comment_id":"10152936625961491","commenter_b":"She's as brainwashed as the rest of that family. Very sad.","commenter_a":"Why did his wife marry him? WHY????","post_message":"\"What was Duggar’s political value for Family Research Council, his moral example, has now become a cost.\""},{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"10153221947888984","commenter_b":"I pray Bibi wins. I believe he will, because if the Lord is on your side, who can stand against you?","commenter_a":"Please vote wisely Israel; the world needs Bibi to lead in the fight against Iranian nukes. Our administration won't, so we need you to lead the free world.","post_message":"It's down to the wire in Israel, as anti-Bibi Obama keeps a close eye on critical elections there. Do you support Bibi Netanyahu?"},{"comment_id":"10153431961096130","commenter_b":"Look what she made him do!","commenter_a":"I was NEVER a fan of Johnny Fraud!","post_message":"Johnny told police that his girlfriend was both “a little mad” at him and “a little bit intoxicated.”"},{"comment_id":"10153055275424877","commenter_b":"How can a woman rape a man..??","commenter_a":"interesting turn of events","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"}]
