[{"comment_id":"10153362565997093","commenter_b":"Chale","commenter_a":"Como estuvo en la manana @username","post_message":"CAUGHT ON CAM ~ Tuesday morning's severe storms blow through a Far North Fort Worth neighborhood... @webpagelink"},{"comment_id":"10154255486503812","commenter_b":"@username She was talking about your looks (see, that's a joke).","commenter_a":"Because seeing a gigantic animal in front of your car with your own eyes is somehow just too hard these days.","post_message":"Moo-ve over! Volvo shows off its large animal detection system coming to its vehicles in 2017."},{"comment_id":"10156366153880389","commenter_b":"\"The very foundation of the United States is rooted in Native American genocide and the violent, forced abduction, murder, rape, annihilation, and enslavement of Africans... .So racism becomes a shield, hiding the magnitude of killing millions of people of color around the world... . If we must be told of the killing, we are told they are necessary to defend the way and . Because U.S. life is subsidized worldwide (and within the United States by people of color and poor White labor), racism must exist or else the entire edifice crumbles... . Race is not only necessary, but also a central tenet of westward expansion, for Western imperialism and capitalism are intimately tied to White superiority\" (Christopher Knaus \"More White Supremacy? The Lord of the Rings as Pro-American Imperialism\" Multicultural Perspectives, 7(4), 54-58. 2005).","commenter_a":"\"Who the United States considers to be evil is certainly not winning in reality. Poor, starving, bombed out women and children in Iraq and Afghanistan are not winning. The women working 16-hr workdays in sweat-shops in Thailand, the Philippines, Jamaica, and Mexico are not winning. The victims of human trafficking in New York, Florida, and Texas are not winning. Those with AIDS in Africa are not winning. The billions of poor people of color throughout the world are not winning. And yet we have set up an entire system of imperialized globalization, which we call democracy to keep them from winning. So we are, in fact, winning, although we only win because we have obscured not only what we are fighting for, but also whom we are fighting against\" (Knaus).","post_message":"Question of the Day: Which Republican presidential candidate do you think will be the toughest on radical Islamists?"},{"comment_id":"10154161430028635","commenter_b":"Which is exactly why feminists aren't equalists, because they haven't dropped the privileged first-class citizenship baggage yet.","commenter_a":"My husband's previous wife took his son five states from him and the courts made him pay support without any effort to give the boy visits with his dad. That state is Indiana. The CP courts there are filthy with corrupt administrators.","post_message":"Teen applying for college finds out social security info don't match up and he was abducted as child"},{"comment_id":"10154932317190690","commenter_b":"\"A bit of a bear\"??? What IS it with this woman and BEARS?","commenter_a":"I hope she takes care of that grizzly bear problem once and for all.","post_message":"Education Secretary Betsy DeVos: \"For me personally, this confirmation process and the drama it engendered has been a bit of a bear.\" Full video here: @webpagelink"},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel.   (via Strange Inheritance)"},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"}]
