[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"'@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"1187848264597052","commenter_b":"Do you want to be responsible for a bus full of kids? Better to keep them home than risk it","commenter_a":"Why don't people buy chains? I don't get it","post_message":"JUST IN: Per the Flagstaff Unified School District, all FUSD schools will be closed on November 29th due to icy road conditions."},{"comment_id":"1257627894274548","commenter_b":"NEVER Hillary!","commenter_a":"It's really quite a disgrace that The Ben Howe Show would've released this right before the election. This clearly shows who he's in the tank for. There's absolutely no reason for this nonsense. He does realize he could've made a three-part documentary on the 'sociopath' Hillary Clinton, right? Worse yet, her scandals are writing themselves as we speak.","post_message":"“I believe that what happens after this election will define the future more than the election itself.”"},{"comment_id":"10153640202729740","commenter_b":"check the last couple of videos I put up here.","commenter_a":"If cops weren't being abusive, murderous filth, then people wouldn't be this worked up...","post_message":"Protesters were captured on camera yelling 'pigs in a blanket, fry 'em like bacon'."},{"comment_id":"10152730591461545","commenter_b":"^^Is there some kind of cream for that you think? LOL","commenter_a":"Just because it's on paper doesn't mean it is acceptable to God. Period.","post_message":"Sarah Goodfriend and Suzanne Bryant became Texas' first same-sex couple to receive a marriage license this morning. This is them speaking at a press conference in Austin.  MORE: @webpagelink"},{"comment_id":"10152780915443124","commenter_b":"the person who insists on letting everyone know their phone conversation in a public place #AmazonGiveaway","commenter_a":"The GravyMaster","post_message":"Add a name to the  and live like  by entering the Amazon.com  Blacklist Villain Sweepstakes for a chance to win a trip for you and a guest to NYC including airfare, hotel accommodations, and more. To enter for a chance to win, respond to this post in the comments below with one sentence or less naming your own The Blacklist villain (please include #AmazonGiveaway in your comments). @webpagelink  Don forget to watch  Blacklist, available on Blu-ray, DVD, and Amazon Instant Video US. @webpagelink  Ends 2/2/2015 at 11:59 PDT. We will reply to the winner's randomly selected comment with instructions on how to claim the prize. NO PURCHASE NECESSARY. See Official Rules: @webpagelink"}]
