[{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"10154289283474149","commenter_b":"Why does she keep hitting he neck","commenter_a":"Push it out already lol.","post_message":"We're on #GiraffeWatch2017! When do you think the baby giraffe at Animal Adventure Park will make its debut? Read more: @webpagelink"},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."},{"comment_id":"10157124735195354","commenter_b":"They've no one to blame but themselves.","commenter_a":"Go Trump","post_message":"“Conservatives love to throw conservatives out of conservatism; it’s like an ancestral tic,” Noonan says. “But great political movements should not be run like private clubs. And have the anathemitizers noticed they aren’t in charge anymore? That in the great antiestablishment disruption of 2016 they have been upended, too?”"},{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"},{"comment_id":"719778928160572","commenter_b":"SHE'S a lying BITCH!!!!!","commenter_a":"Maybe for your distorted economy, sissy. It's perfect for Free Enterprise Capitalism. Just picture perfect.","post_message":"Clinton says that despite his years of business experience, Trump is dangerous and \"shouldn't have his hands on our economy.\" What do you think about her comments?"},{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."}]
