[{"comment_id":"10153101255675779","commenter_b":"Tailgate Savannah only time will tell i like ronda but she is getting a bit arrogant t","commenter_a":"ronda rousey is gonna lose to holly like if you agree","post_message":"Ronda Rousey visited the The Tonight Show Starring Jimmy Fallon last night to promote her upcoming fight with Holly Holm and discussed Floyd Mayweather and challenged Fallon to a Mario Kart match. Watch below."},{"comment_id":"1210507815635913","commenter_b":"No cop killers are by definition an individual who's killed a cop..An old lady with no criminal pass and bake cookies for the local fire department can be a cop killer if ever she kills a cop doesn't make her a thug though.You see by definition there not the same you can be one and not the other.","commenter_a":"RIP, condolences to his family. And, NBC would you please refer to him as a police officer and not a 'Cop'? That's disrespectful","post_message":"Officer Gregory Alia was shot and killed after responding to a call about a suspicious person inside a shopping mall."},{"comment_id":"10153064930639135","commenter_b":"She should be returned to New Jersey. So should it's Governor.","commenter_a":"Why wait until the end of August? Drop out now and avoid two weeks of mental anguish. It's over for you, which is a good thing for America.","post_message":"President Obama and Secretary Kerry, now that we have an American flag flying in Cuba, I urge you to demand the immediate return of Joanne Chesimard to New Jersey.  Like so many others, the families of her victims continue to suffer under the Castro regime. Justice must be served."},{"comment_id":"493850430805537","commenter_b":"Shut Her Down !","commenter_a":"They spend money that is not theirs and should be made to pay it back.","post_message":"Michelle Obama was caught red handed and is going to pay the price.  Finally. It's about time this family is brought to justice.  Do you agree the Obamas should be thrown in jail?"},{"comment_id":"1697203373859671","commenter_b":"All dems want is their vote!","commenter_a":"YES. Now Nutsy Pelosi wants to have more programs to \"prop up\" immigrants. How doing something for Americans for a change?","post_message":"Are you ready? It only makes sense!"},{"comment_id":"1805645433016457","commenter_b":"Congress stop her","commenter_a":"Hell Yes she's a racist traitor and one ugly Ass HE SHE or whatever it is.","post_message":"Michelle Obama is leaving her mark before she leaves. She wants to shut down our National museums for this absurd reason. Do you think Michelle Obama is a racist?"},{"comment_id":"10156563653020652","commenter_b":"Man, my dog is always happy. I learn from my dog, so now I am always happy. “We understand how dangerous a mask can be. We all become what we pretend to be.” ― Patrick Rothfuss,","commenter_a":"@username - gedink jy sal ook hierdie interessant vind :)","post_message":"What can we learn from how animals cope?"}]
