[{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"10158081616760603","commenter_b":"'@username Lame.","commenter_a":"Well I had sushi last night lol","post_message":"Any fish eaters out there? The most popular fish on your plate could be carrying a tape worm"},{"comment_id":"573913712787669","commenter_b":"Yada, yada, yada. This woman(?) Is so full of BS she makes me ill.","commenter_a":"Get over it!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10154736458587300","commenter_b":"Clinton's own faith says she should not be elected. For it is told in the bible, ' For the love of money is the root of all evil; which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.' ...and Jesus said to the Money Changers that his house was a house of prayers and they had made it into a den of thieves' There is no Baptist, Catholic, or any other Christian that should be voting for Hillary Clinton. Next class...Murdering children in the womb!","commenter_a":"Geraldine Donze Berlingeri this is amazing mom!","post_message":"Protons destroy cancer cells while avoiding healthy tissue and minimizing side effects."},{"comment_id":"1313767168664034","commenter_b":"Just a bunch of self absorbed leftist lesbians.","commenter_a":"Just say there prayin see what happens","post_message":"Wait...so the WNBA is still a thing??"},{"comment_id":"10153424598644726","commenter_b":"Hillary's policies will be like Obama's policies on steroids!","commenter_a":"Hillary is just an echo of Obummer.","post_message":"WATCH: Hillary Clinton says Businesses don't Create Jobs"},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"'@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination'"}]
