[{"comment_id":"10153990601334726","commenter_b":"Joel Gillespie One thing to have hired them (via a contractor) totally another to hand them citizenship. Maybe if Rubio and his fellow politicians would secure the border enforce immigration laws there would not be illegals for hire.","commenter_a":"hilarious that Rubio is the one that said Trump misspelled Choked and he didn't... Rubio was wrong","post_message":"WATCH: Rubio Mocks Trump, Reads Misspelled Mean Tweets, 'Friends Don't Let Friends Vote For Con Artists'"},{"comment_id":"1015835041846081","commenter_b":"She needs to take her conscience to another job.","commenter_a":"I'm getting real tired of her behind. My God's name is not Kim Davis. It's time for her to find a new job.","post_message":"BREAKING"},{"comment_id":"1494929760811093","commenter_b":"Isis isn't islam... Hahaha okay","commenter_a":"If Islam is a peaceful religion why is every Muslim country in turmoil and its citizens are totally controlled by the Imans and the Koran? Don't believe the lies of political correctness.","post_message":"\"Before you say, 'War is what ISIS wants,' realize that's simply an argument for inertia and putting off the inevitable. Does that make me a war-monger? Sure. It also makes me a global survival-monger.\" Last night on \"The Greg Gutfeld Show,\" Greg Gutfeld said radical Islam needs to be countered with \"radical Americanism.\" @webpagelink"},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"10150721680719999","commenter_b":"That's not true @username. There care is every bit as good as ours and not nearly as expensive.","commenter_a":"We need a single payer system. My daughter lives in France, and I'm always impressed with their healthcare. Stress free.","post_message":"Here is the surest way to enjoy the peace of mind that comes with having health insurance: Don’t get sick."},{"comment_id":"1099414256845409","commenter_b":"No. We will still vote Republican democrat too far away from Christian beliefs","commenter_a":"DNC thugs started the riots.","post_message":"“I will respect that he’s the President, but I’m going to fight every single day to make sure he’s one-term,” a New York protester said of Donald J. Trump's election victory @webpagelink"}]
