[{"comment_id":"10153166657159456","commenter_b":"White devils are a nightmare!!","commenter_a":"Welcome President and Mrs. Obama. It is an honor!","post_message":"UPDATE: President Obama has arrived in Selma. Scheduled to speak at 1:35 p.m.  The President is on his way to Selma after landing in Montgomery. Should be there soon! @webpagelink"},{"comment_id":"10155292793551509","commenter_b":"Look at all the zombies/paid trolls. #imwithher at the hospital HitLIARy will never be president.","commenter_a":"Hillary can't attend a simple ceremony without collapsing, can't lead a nation and not fit to be president! One more reason to vote Donald J. Trump 2016! Those who plant injustice will harvest disaster, and their reign of terror will come to an end. Proverbs 22:8. Hey liberals?? Look what has happened to your Hillary Clinton!! Karma is real!! And justice is being served!!","post_message":"Hillary Clinton's exit from Sunday's September 11 commemoration set off a flurry of questions and concerns about her health.  For the reporters who cover her, there was also frustration."},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"853290011375903","commenter_b":"Actually, the influx of all of the communicable disease carrying illegals getting through our open borders IS his fault! Crooked teeth, acne, and cancer are not communicable diseases. Wake up.","commenter_a":"Oh yeah, blame it on Obama, he's also responsible for crooked teeth, acne and cancer... such an awesomely powerful human..all hail superpresident!!!","post_message":"What do you think about this?"},{"comment_id":"10153209922201491","commenter_b":"Yes, let's leave the talk up to celebrities. Why should parents teach their kids anything? Brilliant, world.","commenter_a":"Admins, please contact me through inbox messages","post_message":"Jessica Biel: \"We want girls to know what their [body is going through] so they don’t feel scared or ashamed or gross.\""},{"comment_id":"1626733787627072","commenter_b":"D'nariusLovable Lewis you ever hear this girl talk? Lol she is delusional and ignant as fuck haha","commenter_a":"Tomi Lahren. The next Ann Coulter?","post_message":"You've seen Tomi Lahren's criticism of anti-Trump protesters making the rounds. Here is our Occupy Democrats response. Share it on her wall to make sure she sees it!"},{"comment_id":"1689347211355625","commenter_b":"Well hopefully none of these girls are lesbians because if they want shari law they could end up getting stoned to death. Bunch of fools.","commenter_a":"I'm offended that must stop OHH wait a minute I'm a white America I don't have rights !!!","post_message":"SHARIA WEEK! Islam Week At Schools In America, Administrators Demand Females Wear Hijabs To Show Support!   Lets get 3000 SHARES if you'd like to see Trump outlaw Sharia Week!"}]
