[{"comment_id":"749959158486192","commenter_b":"Lots of people spoke up and condemned him for the remarks you speak of. This time he just happened to use a word that always triggers outrage.","commenter_a":"Is it just me or are we seeing all these white women and men speaking up because Trump spoke about another white woman? they didn't care about the Latino beauty queen, or black women, gay women, heavy women and 'not a 10 women'....Why now?","post_message":"Looks like all the rats are jumping the Trump ship. --Andrew"},{"comment_id":"704049616452283","commenter_b":"fuck that stinky black ugly bitch","commenter_a":"She maybe a First but NO LADY..","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"979292718775058","commenter_b":"Y hell yeah. I know is I do stupid stuff I would be locked up. She should be treated the same. That don't mess with her because she has money. The poor folks pay the price. The rich walk around like that are untouchable. It bs.","commenter_a":"False!","post_message":"BREAKING: FBI Finally Makes Move To Arrest Hillary Clinton…   Her time is coming to end. Say goodbye.  Would you be happy if Hillary was arrested?"},{"comment_id":"10154609681272300","commenter_b":"Actually she was not fat. The rules do not say you have to be a size 2.","commenter_a":"trump has no room to talk about calling anybody miss piggy especially when he posts pictures of him eating Mcdonalds and KFC on his private jets.","post_message":"Donald J. Trump called her “Miss Piggy” and “Miss Eating Machine” because she gained weight after winning the Miss Universe crown."},{"comment_id":"470849343105646","commenter_b":"LOL.","commenter_a":"Fucking faggots. Abomination","post_message":"Something amazing just happened for the bakers who refused a gay couple.  Good, we fully support their decision and stand by them.  Should they have been forced to bake for a gay wedding?"},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."}]
