[{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"10153216754526167","commenter_b":"Madam President get used to it.","commenter_a":"But Hillary sucks","post_message":"Finally, everyone starting to agree that we need to shut it down. It's instructive to look at how we got to this point."},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""},{"comment_id":"1600976746609844","commenter_b":"wow.Its a cartoon.It was cute.Do you take every comic strip so seriously? It wasnt make a bold political statement it was just a cute funny comic.Let people enjoy things..Not everything is sexist.This is what gives feminism a bad name.Some of you take things so literally and so seriously.Lighten up.","commenter_a":"Oh no... people, this was meant to be cute and funny, and even a little disturbing. Don't make it a sexist thing, please? Let it be what it is.","post_message":"5. Don't sweat it. The world is our runway every day."},{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"1152081494853966","commenter_b":"Well if men are allowed to use ladies rooms why didn't he just go in and guard her stall there. Maybe he didn't feel like a mommie that day.","commenter_a":"I don't shop at target, so...no big deal","post_message":"WOW! Father Guards the Door While Daughter Uses Target Restroom..Then This Happens. (VIDEO)"}]
