[{"comment_id":"566305263572986","commenter_b":"When are they going to be persecuted?","commenter_a":"Vote! Vote Donald J Trump!","post_message":"WIKILEAKS BOMBSHELL.... The election should be OVER. The Clinton campaign admits to Obama having emails from Hillary off her personal server and that the president knew before he heard about it from the press.  SEE EMAIL"},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"},{"comment_id":"10154008398892093","commenter_b":"an old woman did this on her apartment and end up with this, be careful guys","commenter_a":"Well my heater doesn't work right now guess I have to dress warm going to bed. Other than that I love this weather.","post_message":"How are you preparing for the first hard freeze of the season? bit.ly/2gAPzAa"},{"comment_id":"10153213322076051","commenter_b":"First of all, this is a fake.","commenter_a":"looks accurate to me what the problem? does the truth hurts there wittle feelings","post_message":"This is the 'memorial' for Michael Brown that went up on a police Facebook page."},{"comment_id":"10154403628496336","commenter_b":"Ban all bombs - Obama","commenter_a":"Obama will call for more gun Control in Istanbul!!! It's not a terrorist attack in his eyes. Because of him these cowards are killing innocent people.","post_message":"Breaking News Update: At least 10 people were killed in the two blasts at the Ataturk Airport in Istanbul, according to the Turkish Justice Minister. @webpagelink"},{"comment_id":"10153180114156636","commenter_b":"Easy to say coming from a white man whose ancestors were the criminals. I bet if that was your ancestors murdered on a genocidal level by the NATIVE Americans, you would not be saying this. Stand out for justice, even if it's against yourself.","commenter_a":"Do your self a favor find a another date, maybe in November, with Thanksgiving...Columbus day is here to stay, and will stay; we are not about to change our History....Christopher Columbus had to vision, the world was not flat, that is why we have the Americas' North and South.","post_message":"'Far too often the contributions of indigenous peoples’ go unrecognized in our history and textbooks'"},{"comment_id":"1765051320401865","commenter_b":"Trump gave a rousing speech to cheers and shouts. Just checked in at Fox programming and all they have is same regurgitated talking heads spouting how bad this last week has been. I'm sick of seeing same boneheads saying same thing EVERY show. ME TV reruns from now on!","commenter_a":"This is what the people want Trump any Republican that does not support him is not supporting the people of America who choose him","post_message":"\"In our shared mission to make America great again, I support and endorse our Speaker of the House, Paul Ryan.\"  Donald J. Trump endorsed Ryan at a rally in Green Bay, while also endorsing John McCain and Kelly Ayotte in their reelection bids, after earlier comments implying he might withhold his support."}]
