[{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"},{"comment_id":"1339079532789860","commenter_b":"Yo she cheated she should be feed the next chick","commenter_a":"MAKE HER EAT A BAG OF THEM","post_message":"Chip Roulette: Who Will Eat The Carolina Reaper Chip, The World's Spiciest Tortilla Chip, First?"},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"10156311109050354","commenter_b":"FUCK THEM.","commenter_a":"Another attack on the First Admenent","post_message":"\"You’re taking my rights. You’re taking what I am. My roots run Southern.”"},{"comment_id":"1251358764916884","commenter_b":"@username she is the epitome of EVIL...","commenter_a":"This happens when you are stressed and not comfortable with what you are saying. She has to stay in the race or she goes to jail. There are a lot of people depending on her to keep them out of jail. She will crack and meltdown if pushed long enough...","post_message":"@webpagelink"}]
