[{"comment_id":"689911851133407","commenter_b":"white trash...","commenter_a":"She needs never him also never to have children ever again","post_message":"This man repeatedly beat his wife's 5-year-old and would even send videos and pictures of the abuse to his wife. She refused to step in and both joked about beating and killing the girl. Well, a judge just decided what their punishment will be. Was justice served?"},{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"},{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"1698243613797536","commenter_b":"@username u racist chink","commenter_a":"Dimash Shayan we gotta do this","post_message":"Japan is hiring full-time ninjas!!!"},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."}]
