[{"comment_id":"1176020919129046","commenter_b":"People are saying trump is unfit to lead the country","commenter_a":"Guys I'm scared... Polls are showing crooked Hillary leading by double digits now.... Someone please give me a virtual hug and tell me everything is going to be okay","post_message":"Many people are saying that the Iranians killed the scientist who helped the U.S. because of Hillary Clinton's hacked emails."},{"comment_id":"10152871964481491","commenter_b":"Says the woman whose profile pic looks as if she is in drag!!!! You should never talk about anyone's looks!!!","commenter_a":"Quit posting this, she isn't even a woman, so stop it","post_message":"“You’re too young for a 51-year-old!”"},{"comment_id":"727321410703321","commenter_b":"She is gross","commenter_a":"WILEY CYRUS","post_message":"Her parent's must be so proud! Smh..."},{"comment_id":"10152996037727869","commenter_b":"Abortions are legal, fingerbanging little kids illegal. Change the law if you want to stop abortions and legalize kid screwing. Oh, but you have Christians like the Duggars fighting for you. Good luck with that. I'll pray that you elect pedophiles so you can pray away the sin and let the criminals walk around molesting new victims. Jesus forgives. but society should prosecute crimes. He admitted to committing CRIMES!","commenter_a":"you might wanna find out more about the Duggars before you endorsed supporting them today..this is why YOU WILL NOT BE PRESIDENT. america doesn't want a president who thinks sexual abuse of children is ok or normal.","post_message":"We’re headed into Memorial Day weekend.  That means more than just picnics and sales and the start of summer.  It’s a time to offer tribute, prayers and thanks to the heroic men and women of America’s military who for over two centuries have laid down their lives to protect our freedoms.    But we should also remember the many wounded warriors who survived the battles, but came home with deep and lasting scars.  They deserve the very best care we can give them.  Not only through the Veterans Administration, but through private aid groups, like K9s For Warriors.  It’s a non-profit group that provides service dogs to vets with PTSD, traumatic brain injuries and other disabilities, to help them return to civilian life with independence and dignity.  100 percent of individual donations go to the program.  And 95 percent of the service dogs they train are rescued from shelters.  So when you donate to them, you don’t just help a veteran, you save a dog, too. Talk about doubling your money!  To learn more, go online to K9sForWarriors.org."},{"comment_id":"1024542317579852","commenter_b":"@username, Planned Parenthood doesn't sell body parts and those that say they do are lying","commenter_a":"Thanks to the fact that the local Planned Parenthood clinic was closed down in Scottsburg, testing for AIDS and other diseases was nearly nonexistent in Scott County. And now Republicans are wanting to defund Planned Parenthood despite the fact that abortions make up only 3% of what PP does. SMH... @webpagelink","post_message":"In recent weeks, the American people have learned more about the barbaric practices Planned Parenthood uses to take innocent human life. Despite the outrage of millions of Americans, Planned Parenthood’s response has been to blame the messenger or the videographer, without addressing the barbaric practice of harvesting aborted body parts.  We need to let Planned Parenthood know that the American people do not support these inhumane practices. Congress should vote to end federal funding for Planned Parenthood before we leave for August recess. I urge Senate leadership to give every Senator the opportunity to affirm that life is a sacred and precious gift that must be protected."},{"comment_id":"10153873551727550","commenter_b":"Scores girls accept nothing less!","commenter_a":"As long as liquor stores, bartenders, strippers and cigar shops accept them who cares who is on the twenty dollar bill?","post_message":"ABC News has confirmed through a Treasury spokesman that Harriet Tubman will replace Andrew Jackson as the face of the $20 bill.  Full Story --> @webpagelink"},{"comment_id":"10153523667426336","commenter_b":"Please don't reproduce, the stupid must stop with you!","commenter_a":"TRUMP ALL THE WAY!","post_message":"The 2016 election kicks off on Fox News Channel August 6th!  Fox News and Facebook are teaming up to bring you the first Republican presidential debate! LIVE coverage begins at 5p ET. Don’t miss it."}]
