[{"comment_id":"910295292400057","commenter_b":"God bless that woman. Sure hope some jerk doesn`t get on her for hitting her kid. He deserved it.","commenter_a":"This is a great mother! I would have done the same thing!","post_message":"A Baltimore mother hailed as #momoftheyear after disciplining her son in the middle of yesterday's riots. That moment was caught on camera: @webpagelink"},{"comment_id":"10156057897300725","commenter_b":"Who would vote for this guy?! Mexicans are the main ones who supplies you with your food and groceries! They built all the buildings you take advantage of today!","commenter_a":"They aren't crashing. Get real. And what the hell do you think you could do about it, huh?? Kick Walmart out of America? They put China on the map today. Good business people. Anything for a buck.","post_message":"Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."},{"comment_id":"10152962989707014","commenter_b":"Get rid of illegal non English speaking students whose parents pay no taxes and there will be loads of $ and all the scores will magically rise. I wonder what it would be like if American students were able to get attention in class?","commenter_a":"My daughter started at a Charter school when she was 4 years old K-6, proceeded to a public school in Jr High which she had to test into she was then placed in ALL honor classes and has maintained a 4.0 gpa now on her way to High School on Wednesday at the age of 13....So thanks Charter schools!!!!","post_message":"There's a huge waiting list to get into in a Valley Charter school. Find out why some 1,000 parents hope to get their kids enrolled."},{"comment_id":"10153664203915950","commenter_b":"And you should be judged because you're a moron, Mary.","commenter_a":"How are you going to ban an American Muslim???!!!!! Wake up Mr. Trumpo!","post_message":"Donald J. Trump is pointing to the deadly Orlando attack to reiterate his support for the Muslim immigration ban he proposed last winter."},{"comment_id":"10153851389446955","commenter_b":"@username this guy Julio & Cruz are dangerous crazy nuts that do not understand our European culture & they are racist loonies. BUILD the WALL. Go TRUMP 2016. lol","commenter_a":"Little Jebbie & Cruz is a LIAR & I want to watch sue the crap out of him, maybe Cruz can get another Goldman Sachs loan to pay the damages.","post_message":"FRUSTRATED JEB: 'I Should Stop Campaigning Maybe'..."},{"comment_id":"10153846948701162","commenter_b":"The wording is hilarious though. \"Twerking on a stranger\"....lol!","commenter_a":"@username how ridiculous are these two idiots!","post_message":"CRIME OF TWERKING: Two women are being sought for sexual assault after twerking on an innocent man.  FULL VIDEO: @webpagelink"},{"comment_id":"10152728420456519","commenter_b":"Ducking duckers lol","commenter_a":"@username hahaha","post_message":"No one should be forced to drop this kind of money to celebrate a loved one..."}]
