[{"comment_id":"410796369044958","commenter_b":"Wasn't there a time when people were suppose to be Christian? We go backwards insread of forward. We may offend another religion, but it is OK for them to offend Christians. We are feeding the Christians to the lions again.","commenter_a":"Christians has the rights , just like the mustuims do. Let them do","post_message":"Another group was kicked off campus, but the reason will shock you. Are Universities going too far?"},{"comment_id":"10156284992790354","commenter_b":"Shes an ugly man","commenter_a":"You can't unwatch. But you can refuse to watch.","post_message":"If you've ever said to yourself, \"Gee, today I really want to see a 74-year-old Socialist disco dance,\" then today is your lucky day. If, on the other hand, you said, \"For once, I'd like to see Democrats not seek to destroy their own country,\" well...no such luck."},{"comment_id":"10154103059341509","commenter_b":"LMAO He will never menstruate or go through menopause LOL","commenter_a":"His NAME is BRUCE Jenner. Will he give up his medal, because he won those medals as a Man","post_message":"A judge has granted a petition allowing Caitlyn Jenner to officially change her name and gender. @webpagelink"},{"comment_id":"468369446686969","commenter_b":"I believe these things are available in Africa where they can be real African's.","commenter_a":"We already know, they want to sit home doing nothing mooching on working people, make love and have babies to get more government checks, and get fried on dope.","post_message":"An all black student group, 'Being Black', is threatening violence if their demands are not met. We're tired of Al Sharpton, Eric Holder, and Obama's race baiting! Who agrees?"},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."}]
