[{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"10153614298213812","commenter_b":"muslims are animals","commenter_a":"They need to do this to all Muslims so they can't breed....gfu","post_message":"Experts say the ancient practice is not officially linked to religion in any way: @webpagelink"},{"comment_id":"10153213531701336","commenter_b":"I will bet she cannot fix anything, maybe breakfast if she knew how to turn the stove on.","commenter_a":"Sounds like she's twisted","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"832342470197694","commenter_b":"Boring!","commenter_a":"We do the very same things here today.","post_message":"What do you see in this inkblot?"},{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10153870911641680","commenter_b":"Crooked Hillary only a few more weeks until she goes away for good","commenter_a":"Forced conscription ”has always been a bipartisan goal“? News to me.","post_message":"Hillary Clinton: \"I don't think you'll hear any of this from my opponent, and I think that's a shame: National service has always been a bipartisan goal.\""},{"comment_id":"1395470217172404","commenter_b":"Who knew?","commenter_a":"This is not news talk about garbage.","post_message":"As if he had to announce this..."}]
