[{"comment_id":"10153122066896037","commenter_b":"Porter up there is absolutely right","commenter_a":"no, we have no backbone in the US so we will let Russia take what it wants.","post_message":"The leaders of #Ukraine, #Germany, #France and #Russia pledged renewed support for a tattered ceasefire in eastern Ukraine despite violations -- including the storming of a key town by pro-Russian rebels.  Do you think peace will happen?"},{"comment_id":"10154741880843145","commenter_b":"Illegal immigrants? Not for long bye!","commenter_a":"Why should I leave Lisa I didn't make the mistake of voting for his sorry a$$.","post_message":"WATCH: President Trump announces Alexander Acosta as his pick for labor secretary. Here's the latest: @webpagelink"},{"comment_id":"10153548977449607","commenter_b":"she wants to get out before all hell brakes loose LMAO","commenter_a":"let her travel who cares","post_message":"Some local activists are shaking their heads over the Mayor's plans to travel out of the country next week, on the one year anniversary of Freddie Gray's arrest."},{"comment_id":"10154536419509087","commenter_b":"Jolie should worry about fixing her house first..","commenter_a":"Some day in history Freedom of Religion will meet the crossroads. How will America defend itself from enacting Shari Law?","post_message":"“Shutting our door to refugees or discriminating among them is not our way, and does not make us safer,\" Angelina Jolie said. “Acting out of fear is not our way. Targeting the weakest does not show strength.\""},{"comment_id":"10153264678366336","commenter_b":"98 percent of the illegals don't show up for their hearing.","commenter_a":"All future liberals lol.","post_message":"Some judges believe the backlog is expected to get worse."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"1139418446080798","commenter_b":"Cruz, your are lying conniving little bitch! Trump 2016","commenter_a":"Cruz is full of S&$t, they did not VOTE for him or anyone else. They were not allowed to vote.","post_message":"\"Donald Trump 65,000 people voted in the state of Colorado. They just didn’t vote for you. They voted for our campaign. Or to put it more simply, Donald Trump, it ain’t stealing when the voters vote against you.\""}]
