[{"comment_id":"10153302488640329","commenter_b":"You obviously don't know what feminists sound like then.","commenter_a":"\"How dare you show women's breasts you pervert\" - Feminists \"How dare you censor women's breasts you oppressor\" - Feminists.","post_message":"Warning: NSFW due to lots of nipples. (via BuzzFeed News)"},{"comment_id":"1017645858352192","commenter_b":"This she bitch should be locked up.","commenter_a":"Every one knows what to expect from you. Nothing good.","post_message":"ClashDaily.com"},{"comment_id":"1027250217329982","commenter_b":"Samantha please do me a favor you sound like and intelligent young lady .HERE GOES LOOK AT SOCIALISUM IN SOUTH AMERICA THE People ARE STARVING LIVING LIKE RATS AND THE BIG BOYS ARE TAKING THE MONEY 85 percent TAXATION SAME CRAP IN CANADA AND THEY WILL SWARE ITS THE GREATEST FREEDOM AND FREE MARKETS ARE THE ONLY WAY NOT CONTROL","commenter_a":"Every state should have open primaries. Pretty disappointed in my state of NY. So many people can't vote because of this.","post_message":""},{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"10153532117044586","commenter_b":"Test on the bimbos that model, that's what I say. Ugly monsters","commenter_a":"Please, help, Humane Society International...please.","post_message":"TERRIBLE NEWS: Here are some of the animals who will be hurt for Victoria's Secret."},{"comment_id":"2117406141818910","commenter_b":"@username Lmao...lmao...lmao...lmao...lmao","commenter_a":"So now he he is blaming his own voters if he loses. Face it trump you are going to be the one who loses to a girl and in a big way.","post_message":"Donald J. Trump says he \"will never, ever forgive\" voters if he loses the election."},{"comment_id":"1225936470775105","commenter_b":"Bye naked fool","commenter_a":"What a worthless p.o.s. go get out its types like you we need to be rid of.","post_message":"THEY'RE OUTTA HERE!"}]
