[{"comment_id":"10153489644226680","commenter_b":"@username Hillary 2016!","commenter_a":"I support Bernie but, in a democracy you don't always win. Clinton's big victory in NY is not the result of some sort of conspiracy. It is a result of counting the votes. I am not one of the \"Bernie or Bust\" people. Trump/Cruz are too dangerous to advocate some sort of 3d party campaign where Bernie is the candidate. When Ralph Nader took votes away from Al Gore, it resulted in George W. I do not want a rerun of that movie. I am not happy about how the race seems to have ended, but, Hillary got more votes than Bernie and that ends it.","post_message":"Hillary Clinton gets emotional telling the story of Sandy Hook Elementary principal Dawn Hochsprung, whose daughter is at the victory rally."},{"comment_id":"1739139336348305","commenter_b":"My thoughts are she need to shut up! She belongs being bars!!","commenter_a":"She is a disgrace.","post_message":"\"It's essential that we stop terrorists from getting the tools they need to carry out the attacks and that is especially true when it comes to assault weapons like those used in Orlando and San Bernardino.\" -Hillary Clinton  Weigh in with your thoughts. @webpagelink"},{"comment_id":"963844390305083","commenter_b":"Atlanta housewives just ratchet!","commenter_a":"We got housewives of Orange County, Beverly Hills, And New York. Those women act like straight up fools. I'm wit you Lisa Ray but Uhmm hey morals are out the door when it comes towards cashing in","post_message":"She says she's trying to bridge the gap between \"us sistas,\" not take part in some of the controversial reality shows out there."},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"10153274848901600","commenter_b":"Just send a card. She should get the hint.","commenter_a":"Decline the invitation","post_message":"A mom is causing a backlash online for an apparent email she sent before her son’s first birthday party. The email includes specific requests about acceptable gifts for her son."},{"comment_id":"10153635150260950","commenter_b":"Create a sanctuary for endangered animals instead of putting them on display for arrogant humans... This mother is at fault.. That simple.. Cincinnati Zoo should have never been given this gorilla.. They aren't equipted to protect him... If a parents negligence causes the death of an animal like this, it should be treated as a crime.. On the parents.. Shameful.. I will never go back to the zoo.. My grandkids can Google animals until they are old enough to one day take a safari...this is disgusting and unessesary..","commenter_a":"I HOPE THE PARENTS OR ADULTS THAT WERE RESPONSIBLE FOR THIS CHILD WAS IMMEDIATELY ARRESTED..","post_message":"The four-year-old boy spent a terrifying 10 to 15 minutes alone with the adult primate before the decision was made to kill it."},{"comment_id":"899714753418554","commenter_b":"If we sent the illegals home wages would go up. It is called supply and demand. What are our collages and universities teaching these days?","commenter_a":"That's about half a million jobs for our citizens if we sent them home.","post_message":"Wow."}]
