[{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"1154135184625068","commenter_b":"@username,get that trailer cleaned up woman!","commenter_a":"Fake","post_message":"\"Donald Trump’s birther event is the greatest trick he’s ever pulled\""},{"comment_id":"592897514209538","commenter_b":"That'll get a lot of these men shot in the ladies room !!! Hey ladies , keep shooting till you're sure they're dead","commenter_a":"A bunch of idiots!","post_message":"A bill to repeal a rule allowing transgender individuals in Washington state to use public bathrooms based on their gender identity has cleared a state Senate committee."},{"comment_id":"10153759226208188","commenter_b":"At least the governors are smart!!! Get a clue Obama!","commenter_a":"Amen!!","post_message":"UPDATE - 17 states now: The Republican governors of Maine, Nebraska, Texas, Arkansas, Arizona, Indiana, Louisiana, Mississippi, Massachusetts, Ohio, North Carolina, Wisconsin, Georgia and Illinois joined their counterparts in Alabama and Michigan in saying they would no longer help settle Syrian refugees. One Democratic governor, Maggie Hassan of New Hampshire, joined them in rejecting Syrian refugees."},{"comment_id":"10153242003291636","commenter_b":"Who gives a s**t the programs shite anyway I have better things to do with my life than watch reality shows","commenter_a":"Hannah Daw not the reason you thought","post_message":"'I screwed up'"},{"comment_id":"1719312091654441","commenter_b":"It sure can happen. We'll see.","commenter_a":"Trump beats Hillary??? Never going to happen. He's too much of a loose cannon.","post_message":"Hillary Has Dark Secrets, Dick Morris Reveals Dick Morris says Trump can defeat Hillary. \"She will lie and cheat at every turn,\" Morris says, \"But Trump needs a new strategy.\" Morris reveals it in his new \"Armageddon: How Trump Can Beat Hillary.\" Get the book here: @webpagelink"},{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"}]
