[{"comment_id":"10152829771848271","commenter_b":"But she's a good girl out to hurt no one. I call BS!","commenter_a":"For all you saying \"She didn't deserve to die.\" So it would have been better if the police office was killed!? Where are your morals people. But when that thug comes knocking on your door who are you calling?","post_message":"The Denver medical examiner's office said Jessica Hernandez also had marijuana and a small amount of alcohol in her system during the Jan. 26 shooting that sparked protests and calls for an outside investigation. DETAILS:"},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153463508245950","commenter_b":"@username thats your opinion, but if she makes president, guess what....WERE FUCKED even more!!!!","commenter_a":"I'm not a Clinton supporter, but well said. Hillary's maturity and eloquence are refreshing after listening to Trump and the rest of the GOP schoolyard clamor.","post_message":"Donald J. Trump has \"incited this violence over months,\" Hillary Clinton says; watch the Democratic candidate's interview with Nancy Cordes: @webpagelink"},{"comment_id":"10158044749370294","commenter_b":"@username nothing about him says he would do any of that....he got into a car crash lol stop making these puppets look like heros","commenter_a":"Why was he even shot when he had no weapon e could have been taken in to custody without killing him. That officer needs to be investigated and put on leave of absence","post_message":"There's still a lot of question about what happened leading up to the fatal shooting of a college student."},{"comment_id":"10152596926553067","commenter_b":"This is not going to hurt North Korean govt only the people","commenter_a":"Take this clown out already.,F ing joke.","post_message":"BREAKING: The U.S. is hitting North Korea with a new set of economic sanctions in response to the hacking attack on Sony. @webpagelink via CNN"},{"comment_id":"10152944576132061","commenter_b":"Good thing they aren't dogs- the barbarians would skin them alive and eat the,.","commenter_a":"@username I want one for my birthday!!!","post_message":" China debuts its newborn panda twins: @webpagelink"},{"comment_id":"10154805398708812","commenter_b":"Ha ha. That'll teach them.","commenter_a":"George R. Sadler DW Adams","post_message":"Police in Southern California on the lookout for brazen thief who broke into a YMCA and stole fake cash from a toy register."}]
