[{"comment_id":"541211179416415","commenter_b":"hey Trump when you talk about the refugees, can you name every refugee groups that lives in the United States and what kind of jobs they have to work to feed their family and children? BTW, every refugees family's that moved to United States are helping out U.S. economy by working at those places where no white man can stand to work there, also they are paid with minimum wage without complaining. so be grateful and welcome them to come and live in the United States, especially the Karen refugee.","commenter_a":"Mr Trump the solution of the conflict between Israel and Palestinians can be very simple America and Europe should stop sending billions of dollars to Palestinians so the Palestinians know that when they get up in the morning if they want to eat they have to work and not killing the Jews!!","post_message":"We’re going to come together and come up with solutions- and so far I cannot believe how civil it’s been up here! #GOPDebate"},{"comment_id":"10153239066656491","commenter_b":"No he wouldn't lol. Hagrid wouldnt be close to slytherin","commenter_a":"All muggles should be sorted to Hufflepuff.","post_message":"J.K. Rowling isn't afraid to tell Harry Potter fans when they're wrong."},{"comment_id":"10153283527870950","commenter_b":"This BITCH makes me sick","commenter_a":"She should be treated as she treated this poor child.","post_message":"The 11-year-old girl's cousin told investigators that the young girl had a medical condition that caused her to lose control of her bladder and bowels. A family friend said the woman was upset that her daughter had the condition, and liked to keep the house spotless with bleach."},{"comment_id":"699563113502060","commenter_b":"I don't like killing of animals or anything what soo ever..... but.... i don't mind hunting to Feed your family.. its just hunting for sport that i hate with a passion","commenter_a":"It doesn't matter how I feel about this! They are free to do as the law allows. My opinion is: this is awesome!","post_message":"How do you feel about this?"},{"comment_id":"659791487492443","commenter_b":"yes but he is treating America Badly, Screw him,","commenter_a":"Stop talking about obama, you shoul start building for the vets they deserve it, and you can do it Mr, Donny","post_message":"President Obama looks and sounds so ridiculous making his speech in Cuba, especially in the shadows of Brussels. He is being treated badly!"},{"comment_id":"1225927100760651","commenter_b":"@username And this from the person from Farmville?","commenter_a":"When do we decide that our gun culture is not worth another child dying? What a sad story. Prayers for her family.","post_message":"\"She's not going to first grade, because he made a choice to pull out his gun,\" Lilly's mother said. Read more: @webpagelink"},{"comment_id":"10153796040151336","commenter_b":"Kyle Get off the illegals nuts already","commenter_a":"We need a zero child rule for liberals.","post_message":"Couples in China will now be allowed to have two children."}]
