[{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"},{"comment_id":"10153714205856336","commenter_b":"First Ladies don't drive.","commenter_a":"Who in their right mind would ever think a Muslim would make a good President of the United States. No One would. This is such a bunch of crap. Liberals get over yourselves and your Gotcha BS. Can you even imagine the first lady in a Burka and not allowed to sit at the table with the men or drive a car or vote? Come on get real.","post_message":"“I’m not a politician, so I'm not going to be looking for the politically correct answer – I’m going to be looking for the truth.\" Dr. Ben Carson told Bill O'Reilly that he stands by his controversial comments that he would not advocate for a Muslim president. Watch the full interview: @webpagelink"},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."},{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""},{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""}]
