[{"comment_id":"10153705245475667","commenter_b":"Build that wall tall!!","commenter_a":"Libertarian is just another word for Republicanism!","post_message":"Libertarian presidential candidate Gary Johnson talks with Paul Singer."},{"comment_id":"10153324707666336","commenter_b":"Hillary 2016! Go USA!","commenter_a":"Welp, if rand does not win the nomination I'll be voting libertarian. Good luck","post_message":"Breaking News: A bill that would allow key government surveillance programs to resume for now – after they were temporarily suspended Sunday – has cleared another hurdle in the Senate and is headed to the president's desk. @webpagelink"},{"comment_id":"10153443725952293","commenter_b":"O AGORA SOSSEGA E ME DEVOLVE MEU DESODORANTE","commenter_a":"Victoria Dowsley","post_message":"Why it’s smart to buy the men’s version of almost anything."},{"comment_id":"10153780457712217","commenter_b":"you must be a left-wing refugee welcomer :D","commenter_a":"WRONG! People on the scene say it was a gas leak explosion not some suicide bomber...Mainstream media never let a tragedy go to waste","post_message":"The man detonated a backpack device after being refused entry to a music festival."},{"comment_id":"992066754146411","commenter_b":"No, we don't want their kind here.","commenter_a":"How great it this to see! The same people who have always looked down upon us Tacoma people are now wanting to live here. Sweet justice is here. :)","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"10153393133746051","commenter_b":"the cunt should be dead","commenter_a":"Sickening. this teen should be in a juvenile detention center!!!!!!!!","post_message":"The police took one look at what happened to this little boy and immediately realized they needed to get involved."},{"comment_id":"10153169137025950","commenter_b":"Ella Patrice Nierva","commenter_a":"Ricardo Alvarez","post_message":"WATCH: Little girl can't wait another second to hug her soldier dad, runs to him in the middle of a ceremony @webpagelink"}]
