[{"comment_id":"515543338636246","commenter_b":"Go home","commenter_a":"Absolutely...","post_message":"These Muslims thought they could do this, big mistake.  Good. This is America, they need to learn their place.  Do you support these Muslims being thrown out of the building?"},{"comment_id":"10153430837822061","commenter_b":"beautiful woman","commenter_a":"Beautiful Robin!","post_message":"Robin Roberts looking stunning this afternoon! She's on her way to the red carpet. #Oscars"},{"comment_id":"458392787682348","commenter_b":"I dont think they have been treated bad enough...kick em out of the White House and Ill be happy!","commenter_a":"POS","post_message":"Seriously..."},{"comment_id":"10153836733820950","commenter_b":"You are a sick women. Hope you burn in hell","commenter_a":"Disgusting","post_message":"The mother reportedly removed the infant from the closed fridge after 3 hours."},{"comment_id":"10152745138297093","commenter_b":"Way to go Steve!! You put this guy on blast!!! Look out people.","commenter_a":"Busted !","post_message":"Consumer reporter Steve Noviello was invited to a demo for a safety and security window film, but things didn't quite go as planned... @webpagelink"},{"comment_id":"1048332608520428","commenter_b":"Lmao Persian women though.. Gorgeous.","commenter_a":"You are free to choose between Arab uneducated fundamental extremists and moderate enlightened Persian Cats..","post_message":"Iranian Foreign Minister Mohammad Javad Zarif said on Wednesday a new U.S. law putting visa restrictions on Iranians and those who had visited Iran would, if implemented, breach a nuclear deal Tehran had struck with world powers earlier this year. Read more: @webpagelink"},{"comment_id":"10153801088312690","commenter_b":"But that's just it. It's not about the transgender. In fact its nothing against them. It's about the fact that it now opens the door to any man out there. How do they want to strip women who were born women from there rights??? How do they want to take our safety and security. And yes a sexual assault can happen anywhere. We get it.","commenter_a":"Show me one article where a transgendered person assulted someone in a bathroom and I'll show you 10 where a priest, football coach, or teacher did the same thing.","post_message":"President Obama will issue an executive order that public schools must permit transgender students to use bathrooms consistent with their gender identity. Who should make that decision?"}]
