[{"comment_id":"10153715295681336","commenter_b":"Nancy Pelosi ? What are you smoking?","commenter_a":"As a GOP Tea Party, it's the best news I have heard this whole year! This RINO had to go, he's dishonest, he campaign as a Tea Party Patriot and then became a Liberal hack as many of them usually do! When I saw Nancy Pelosi defending this clown, I knew we were betrayed.","post_message":"“It’s become clear to me that this prolonged leadership turmoil would do irreparable harm to the institution… This morning, I woke up and I said my prayers...and I decided, you know, today is the day I’m going to do this.”  Moments ago,  Speaker John Boehner announced why he has decided to resign this year."},{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."},{"comment_id":"1264276990298713","commenter_b":"Several poor individuals could have food, shelter and job training for the amount of money spent on a wedding that won't probably last, this wedding was just to impress other rich people.","commenter_a":"ugly and ridiculous! Wasted money!","post_message":"How a billionaire gets married"},{"comment_id":"10154220387809312","commenter_b":"The girl should have been dealt with a lot sooner than 2 years!!","commenter_a":"They should have all bought headphones and blasted The Bible on tape.","post_message":"When the noise first became an issue about two years ago, Saylor said she would knock on the door and ask her neighbor to quiet down. It didn't help."},{"comment_id":"487115881470292","commenter_b":"What a perverted, sick and depraved asshole!!","commenter_a":"Fucktard","post_message":"God will put rainbows and sunshine over the house of every straight, white, christian cis man!"},{"comment_id":"541066452731681","commenter_b":"Melania Trump speaks 5 languages and has a degree in architecture and design!!! That sets a new HIGH STANDARD FOR THE FIRST LADIES!!! I LOVE Donald Trump","commenter_a":"If we really get to vote and they really count them correctly, Trump will WIN..... but that remains to be seen. Trump one great American for President ! Go Trump !!!","post_message":"Join us at a TRUMP 2016 Presidential Rally near you! Daily updates at www.donaldjtrump.com/schedule - we look forward to welcoming you! Thank you for your continued support!"},{"comment_id":"10157736489990603","commenter_b":"Omg I think it's funny that 12 year olds got onto their parent's Facebook and are saying things like lick my butthole. Classy.","commenter_a":"Wow I knew the average Missourian was dumb but I didn't realize they had a fetish for shooting themselves in both feet.","post_message":"JUST IN: CBS News projects Donald J. Trump will win #Missouri."}]
