[{"comment_id":"10153619360488132","commenter_b":"Your not a father!!!","commenter_a":"Jennifer Ramirez","post_message":"It was a very happy Father's Day for Caitlyn Jenner."},{"comment_id":"919963074724525","commenter_b":"It's not burning fast enough.hope they got all there goats out.would be a shame to lose what use to be there virgins","commenter_a":"probably after insurance so they can buy more guns???????????","post_message":"Taking bets...accident or on purpose? Was this an 'act of God'? What do you think?"},{"comment_id":"10152656496006680","commenter_b":"No Hillary, 'JUST YOU!'","commenter_a":"Loretta Lynch is another clueless, racist, who will follow Eric Holder with more bad decisions, race baiting, and support for illegal aliens, as indicated by her actions on the bench and answers to questions during confirmation proceedings. She should absolutely be voted down.","post_message":"Clinton’s social media outburst comes after Loretta Lynch has been waiting for Senate confirmation for 128 days."},{"comment_id":"10154339068600399","commenter_b":"@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"\"If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!\"  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news.  No riots, no protests, no media coverage.   Do you think he should be charged with a hate crime?"},{"comment_id":"10155025724612940","commenter_b":"And youre a profile of a pussy chucky","commenter_a":"No she is a political hack","post_message":" Yates is a profile in courage.  ICYMI: Senator Chuck Schumer took a shot at the Trump administration over the firing of acting Attorney General Sally Yates for her refusal to enforce Donald J. Trump refugee order."}]
