[{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"},{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"},{"comment_id":"679029648954280","commenter_b":"Lock her ass up","commenter_a":"Waiting?","post_message":"FBI moves to arrest Hillary and put her in prison for 10 years. Good, it's about time. She deserves longer. Would you be happy if Hillary was in Jail?"},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"10153627289889641","commenter_b":"\"Sally\" western name \"Mohammed\" Muslim last name person: Know that our former immigrants were from Christian countries such as Ireland, Italy and Germany.. NOT from terrorist breeding ones. Our Christian immigrants learned our country's language, laws, and ethics. Muslims and or other ethnic immigrants should do the same or stay in their own countries and cultures. We Americans are not migrating to yours so take the hint. Quit invading our world to just get free education, money and riches without working for our western rights.","commenter_a":"Good for him. He should fit right in with all the other Ahmed and Mohamed culture. Check back in 15yrs to see what his training result is.","post_message":"The teenager arrested for bringing a homemade clock to school is moving from the U.S. to Qatar:"},{"comment_id":"10152962676067060","commenter_b":"ASSclown !","commenter_a":"Mitch, Moon the coon's little boy people are begging to have their streets fixed, once you remove the monuments your murder rate and black on black crime will disappear.You are a special kind of stupid","post_message":"WATCH: Mitch Landrieu's full Confederate monuments speech he delivered to the City Council today."}]
