[{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"607404219443285","commenter_b":"He's an idiot","commenter_a":"Then why in the hell did he get elected...twice?","post_message":"Delusional..."},{"comment_id":"1518802311757226","commenter_b":"For people illegally here","commenter_a":"Especially if you are anyone other than the WORKING CLASS !!","post_message":"President Obama just addressed Donald Trump in a not-so-subtle way. Do you agree with the president?"},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."},{"comment_id":"474793122711268","commenter_b":"NIGGA you need to go back to Kenya, and fucken stay there.","commenter_a":"I was not born in England why don't Odumber go back to Kenya where he was born. He is such a idiot they probably don't want him back.","post_message":"The President just said 'all white people should go back to England'. This is outrageous, and just plain racist. 'LIKE' if you agree!"},{"comment_id":"1232095813528626","commenter_b":"Deplorable bitch","commenter_a":"Corrupt politician","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."}]
