[{"comment_id":"10153650644833812","commenter_b":"Feminism at its finest.","commenter_a":"Hillary Clinton has a beautiful spirit God bless","post_message":"Hillary Clinton's mom, family life at center of $2,000,000 TV ad buys directed at Iowa and New Hampshire: @webpagelink"},{"comment_id":"1072808739397262","commenter_b":"Oppression? You are way off base here. It is oppressive to want it to be 1959. Here is the bottom line. Do what you want but you don't get others to do what your religious Far right cult says. And I am a Christian.","commenter_a":"Alas...another unintended consequence of liberalism. In their quest to 'help' people, they made them worse off. To correct their unintended consequence, what will liberals recommend? They will recommend coercing the college into providing the students with birth control... And class...this is another example of liberalism leading to oppression...","post_message":"What would Jesus do?"},{"comment_id":"10154271812178717","commenter_b":"Seems like all women think of is sex lol","commenter_a":"I would love to see the media dig deeper into this story--if possible. So many details baffle me. Why was she with Rood and Ross in the hotel room, sharing a bed? If sexual abuse/assault was part of this web that led to her death, I hope it's exposed and the appropriate people are charged.","post_message":"Jazzmyn Rood was sentenced Friday for her role in the 2015 death of Eve Tarmey. Details here: @webpagelink"},{"comment_id":"10153084060819330","commenter_b":"I. Jesus. Side. Way. I am not. Crazy. Even. With. Alzheimer. If. He. Every. Receive. Jesus. He. Still can. Today","commenter_a":"Elvis with his wings bowing his head.","post_message":"Do you see the angel in this ice formation on a porch in Bristol? Audrey Totire sent us this See It, Share It photo after her friends noticed the image of what they say looks like an angel.  What do you think?  See more top photos from the week here ---> @webpagelink"},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"533111413538548","commenter_b":"This idiot already built a wall and call it over taxation, high gas prices, sanctuary cities.","commenter_a":"I'll help, maybe they will leave the union. Or better yet, fire their idiot governor.","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10154738811856336","commenter_b":"THE MINUTE YOU VOTE FOR HILLARY CLINTON YOU BECOME GUILTY BY ASSOCIATION FOR HER CRIMES. Think about that for a minute...yep every time you see her, hear her she will be lying, and you become one too...a horrible person! She let 4 beautiful men get tortured, sodomized, and killed, all because she didnt answer her phone. She deleted 33,000 classified emails after she got a supena. She will Open borders for hell to get in. ISIS will kill and you will be guilty of this. You will be guilty by association and all your friends will turn on you! All because you wanted the first woman President...We pitty you if she gets in....you won't get help from us....we will be to busy fighting for our guns to save America from her!...We choose TRUMP, a MOVEMENT beyond your reach.","commenter_a":"r I have watched Megan Kelly for a while now and use to love her show. However, I am so disappointed in her need to make a name for herself that she has sold herself to the devil and we all know who that is. Seriously, the sexual predator comment??? And you call yourself a lawyer, what happened to innocent until proven guilty or does that just apply to the Clintons! Why don't you call out Killary for disgracing the office of Secretary of State or even better her husband who has actually paid money to women for his sexual indiscretions. Oh, and how many people close to them are in the grave?? So @username...get rid of the trash and get some class....Hint'...The Ainsley Earhardt File!!!!","post_message":"'That's not law enforcement. That's selective prosecution.'  Newt Gingrich reacted to the perceived double standard with the investigation into Hillary Clinton's private server, saying 'this is the kind of stuff that in a place like Venezuela, you'd understand.'"}]
