[{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."},{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"10154306785891130","commenter_b":"Hillary's crimes against women will get the best of her.","commenter_a":"Bush was 33, Trump was 59, its easier to fall and be impressed by a rich man at that age Trump should have act like the grown up. Trumps ego will get the best of him yet.","post_message":"But Donald J. Trump is still a presidential candidate."},{"comment_id":"1181787745189978","commenter_b":"Lock her up","commenter_a":"BULLSHIT!!!!!","post_message":"******BREAKING NEWS******  Finally!!"},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"848558051846284","commenter_b":"Ghetto booty......for ghetto trash!!!","commenter_a":"I think Michelle needs to follow her own advice on eating nutritious. She's a bit hefty from behind","post_message":"You won't believe how much you're paying for the #Obama family vacations.    This will leave you outraged!"}]
