[{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"10153627289889641","commenter_b":"\"Sally\" western name \"Mohammed\" Muslim last name person: Know that our former immigrants were from Christian countries such as Ireland, Italy and Germany.. NOT from terrorist breeding ones. Our Christian immigrants learned our country's language, laws, and ethics. Muslims and or other ethnic immigrants should do the same or stay in their own countries and cultures. We Americans are not migrating to yours so take the hint. Quit invading our world to just get free education, money and riches without working for our western rights.","commenter_a":"Good for him. He should fit right in with all the other Ahmed and Mohamed culture. Check back in 15yrs to see what his training result is.","post_message":"The teenager arrested for bringing a homemade clock to school is moving from the U.S. to Qatar:"},{"comment_id":"10153765705598132","commenter_b":"Don't care what her point is/was... No woman should do that. It's nasty and probably a health hazard as well. Koo koo.","commenter_a":"Should have been declared a Health Hazzard and disqualified. What a disqusting thing to subject others to. And can someone tell me how being a ragless woman is going to get sanitary napkins to 3rd world woman? I bet if they don't have tampons they don't have TV either... Stupid Stupid Stupid","post_message":"She thinks critics only prove her point."},{"comment_id":"10154093094596756","commenter_b":"Yes that's it Alissa, it is \"hidden on purpose\" but you supposedly know this secret and post it on Facebook...yet it is hidden? How, just HOW do you make that thinking work in your mind?","commenter_a":"They just lie with confidence and no facts and figures. The economy is worse than when Obama came to power? Are you serious? The whole banking system had crumbled and TARP funds had to be injected. Lehman Brothers had closed down. Merrill and Bear Stearns were sold, housing was plummeting, unemployment was rising, stock market had crashed, sentiment was pessimistic. Now that we are all good - yep let's not give anyone credit where it is due.","post_message":"If you missed last night's GOP debate, here's a recap in 100 words."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets? As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves. Will Obama be able to keep his jihadists in check until he declares Caliphate? Read More + Video: @webpagelink"},{"comment_id":"728623440630942","commenter_b":"Adam , undocumented immigrants pay billions in taxes.","commenter_a":"The wall we take longer than 4 years to build. He won't get re-Elected and the wall won't be finished. Then us tax payers will be stuck paying for it.","post_message":"U.S. taxpayers will foot the bill for the wall, at least initially."},{"comment_id":"455432694647311","commenter_b":"Will not eat there. She would turn my stomach and I couldn't eat---ugh","commenter_a":"Well that does it McDonald's out","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."}]
