[{"comment_id":"10153148690502014","commenter_b":"I remote control my grandson to clean my auto engine. He's for hire. Lol. .","commenter_a":"Good morning from Flagstaff!","post_message":"It's Sunday Shoutout time! Post your pics here!! Jaime Cerreta"},{"comment_id":"10154568633769411","commenter_b":"@username, fuck cows!!","commenter_a":"It's really strange, Facebook isn't offering me a chance to superimpose the Pakistani flag over my profile picture. It's as if they dont really give a fuck unless it suits the agenda of the overlords of western governments.","post_message":"The Khorasan province branch of ISIS has claimed responsibility for the attack"},{"comment_id":"1017808354978885","commenter_b":"This is bullshit lady","commenter_a":"Trump is no different than isis and we need to recognize the radical christians in america trying to take our country.","post_message":"After today, when Trump said he would ban ALL Muslims from entering America (even Muslim-Americans who just happen to be traveling overseas) it's easier than ever to see the frightening similarities.  Image shared by Occupy Democrats, like our page for more."},{"comment_id":"941709942541740","commenter_b":"Stay out of my relationship","commenter_a":"This is clearly propaganda to boost the cause to have people see same sex marriage in the same light; it's a ploy, not that I have anything against racial marriage, I'm 100 hundred percent for it but it's no coincidence this is being addressed in light of what is happening this month. When a black man or white man marries a latina woman or black or white woman or Aborigine woman, that is still a man marrying a woman, the way that God had intended. The sexes are complementary and marriage has been since the beginning of mankind, the core unit to propagate the family and for mankind to spread and to flourish. Two males and two females cannot propagate the family that is why they have to take other unnatural alternative measures to achieve this because that is the only way they can. Please don't think I'm putting down ...","post_message":"On this day in 1967, the Supreme Court legalized interracial marriage in the United States. Happy Loving Day! #LovingDay"},{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":" need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."},{"comment_id":"10152679214316545","commenter_b":"I don't understand why it's called The Miss Universe pageant when our planet is the only one competing?","commenter_a":"I thought it was very rude for the audience to boo, I felt bad for Miss USA.","post_message":"Miss USA was SO close to taking home the crown, but many thought Miss Jamaica was the biggest snub!  Thoughts on Miss Universe?"},{"comment_id":"550293038455179","commenter_b":"Keep waiting! Americans are on to this BS! We gonna put a stop to millions flooding in here every year!","commenter_a":"Millions of hard working immigrants are still waiting on that promised immigration reform. Remember? November 20th 2014. Merry Christmas Obama and family.","post_message":"\"On behalf of Malia, Sasha, Bo, Sunny, Grandma, and everyone here at the White House, Merry Christmas.\" —President Obama  Watch the weekly address."}]
