[{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"},{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."},{"comment_id":"923707264362696","commenter_b":"Then fuck off with THAT bullshit. You ain't Gods gift to women. 😂😂✋","commenter_a":"Why are dudes so obsessed with a woman's personal life? Why do you need to know that and why does that information matter? The real issue is are you both STD free, not how many people someone has had sex with. Evolve please!","post_message":"When She Says She Only Had Sex With 3 Guys"},{"comment_id":"10152720268826636","commenter_b":"Sweet name bro","commenter_a":"Old people are more of a danger than teenagers.","post_message":"Why you should always keep your eyes on the road."},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."},{"comment_id":"10153869614430329","commenter_b":"She's not even made up of gasses, geez","commenter_a":"We throw the term \"star\" around way too often","post_message":"She tells BuzzFeed News, “I don’t regret it for a second.”"}]
