[{"comment_id":"10154087462891813","commenter_b":"Maybe after they have this 200,000 woman march on Washington Saturday for women's rights then maybe we'll finally get a female: Ambassador to the United Nations, Secretary of Education, Secretary of Transportation, Senior adviser to the President and first female to successfully run and win a Presidential campaign, female Director of small business affairs..preferential hiring for females and federal laws mandating all government workers and state workers and military personnel get the same pay for the same rank and experience? Oh and abortion on demand.....wait...","commenter_a":"powerful and mighty statement","post_message":"Today and every day, dissent is patriotic. #WomensMarchonWashington"},{"comment_id":"10154662205964575","commenter_b":"Good she needs to be arrested!","commenter_a":"Yes this girl has done this before. She willingly is w him! She needs to be charged for running away over and over again. And it's her mothers vehicle. Something needs to be done!","post_message":"UPDATE: The teen at the center of the Amber Alert has been found safe, according to police.  --------------------- An Amber Alert has been issued for a for a missing 17-year-old girl who authorities believe is in extreme danger.   Police believe an escaped convict out of Hancock County, Dustin Fisher, 20, abducted the teen. Fisher is also considered a violent sex offender."},{"comment_id":"10153833449353145","commenter_b":"Ignorant uniformed woman!","commenter_a":"Totally stupid. It's an illegal drug! Small amounts lead to large amounts. Bad enough there is a jerky a.. Attorney who is trying to legalize marijuana in Orlando. Get a grip. Bad enough this state is number one in the country with the worst drug problem!!","post_message":"This would be a major change in Orlando, but is it a step in the right direction or should leaders nip this in the bud? Let us know what you think."},{"comment_id":"10155083272367994","commenter_b":"I don't care if this woman is a mental reject, I'd like to throw her off a bridge to see if she can fly.","commenter_a":"She forgot to take her psychotic pills...","post_message":"Officials: Woman throws dog from bridge, claiming it can fly."},{"comment_id":"10153836733820950","commenter_b":"You are a sick women. Hope you burn in hell","commenter_a":"Disgusting","post_message":"The mother reportedly removed the infant from the closed fridge after 3 hours."},{"comment_id":"10154003948143812","commenter_b":"I know it's late but does anyone have her address?","commenter_a":"Thanks to all that helped i know she was happy","post_message":"8-year-old girl who survived a fire that killed her family receives more than 700,000 Christmas cards from around the globe. \"It really moved a whole community.\""},{"comment_id":"10150618266494999","commenter_b":"Benny no where have I said or implied \"let the floodgates open and let every single person just come on in\". If you read my 1st few words, you would see that just putting a concrete wall around the WHOLE country is not the answer. Take the opportunities away and well, you should be able derive the answer. The ones that are here, are, whether you believe it are not, contributing to society already. They cut your lawns, serve your food, make your sandwiches etc etc. Even work the farms. I am not for illegal immigration whatsoever but to say they who come over bring us problems!!...I think we have benefitted more from them than not. I am just saying not all illegal immigrants are Mexicans. As for your Chinese response, true they would love to come to America. A lot do make it here (illegally I may add). Have ...","commenter_a":"This is how people misinterpret words. Trump was talking about ILLEGAL immigrants. No offense was towards Bushs wife. Unless of course she is illegal.","post_message":"\"He’s not a stupid guy, so I don’t assume he thinks that every Mexican crossing the border is a rapist,\" Jeb Bush said of Donald J. Trump."}]
