[{"comment_id":"10154961510296729","commenter_b":"Lying bitch!","commenter_a":"ALWAYS REMEMBER BENGHAZI","post_message":"And I'll tell you EXACTLY what difference it makes..."},{"comment_id":"10153911212003984","commenter_b":"Go Candance!!! Who is the woman on the right with the white duck on her head???","commenter_a":"I support Candace 100% God bless you","post_message":"I have to give major credit to Candace Cameron Bure. It can't be easy to be surrounded by the liberals of \"The View\" and stick to your guns like this. She sure got them riled up, and I could watch it over and over again!  Do you agree with Candace Cameron Bure?"},{"comment_id":"10153020526397464","commenter_b":"STAND FOR PRINCIPLE or lose America!","commenter_a":"Either the Republican party morphs into liberatrian values or even conservative values, I see no reason to continue to throw away my votes on them. As it stands now, the difference between Republicans and Democrats is hard to see. They are BOTH for bloated Federal Government way beyond it's constiutional limits.","post_message":"We are facing a fundamental decision for our country.   Do we go back to the same old, same old or do we stand for principle? #SCTeaParty15"},{"comment_id":"10153737198202235","commenter_b":"Fucking dumb women.","commenter_a":"Carson will never be elected because the majority of American women will never vote for this clown","post_message":"What a horrible person he is. Just awful."},{"comment_id":"10153063204299726","commenter_b":"What a mouth full of shit that is!","commenter_a":"They promised to kill all in the Us if you will recall as well as Israel called us the great satan","post_message":"WATCH: Obama says Islam will cause Iran not to pursue nuclear weapons!"},{"comment_id":"10153986318004071","commenter_b":"Still I could look up plenty more lyrics","commenter_a":"But he just did a commercial with little yachty which doesn't make sense 🤔🤔. In lil yachtys biggest song he saids ''tell her I can get that pussy easily''. Wake up sheeple","post_message":"LeBron James is speaking out against Donald J. Trump's 'locker room talk.'"},{"comment_id":"10153945679949087","commenter_b":"Don't care for Michael Moore but im with him on this, gooo Trump!! Beat that lyin corrupt Hillary.","commenter_a":"Alyssa Hohorst","post_message":"Liberal filmmaker Michael Moore is doubling down on his prediction that Donald J. Trump will win the White House with a list of 5 reasons why."}]
