[{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"10154017510261336","commenter_b":"I NEVER SEE THIS KIND OF PLANNED HATE TO DONALD TRUMP OR DOCTOR CARSON AND NOT TO OBAMA OR SOCIALIST ILL SANDERS OR HYENA CLINTON... NOBODY IN CNN OR ISLAM PAY MEDIAS NEVER ASK DEMOCRATS... WHAT SOCIALIST COUNTRY IS DOING BETTER THE U.S.A. ....WE DON`T NEED SOCIALISM OR ISLAM LAWS ,,SOCIALISM LEECHES SUCK CAPITALISM LIKE CUBA FOR 65 YEARS SUCKING FLORIDA MONEY TO CUBAN GOVERNMENT AND PEOPLE ...WHAT A ZOMBIES IGNORANT DEMOCRATS ARE ....NOW EVERYBODY CAN SEE THE FUTURE IF TRUMP WIN THE WHITE HOUSE... BUT NOBODY CAN IMAGINE OR SUGGEST THE DESTRUCTION THAT MUSLIM LEADER OBAMA ALREADY DONE IT ..OBAMA`S ACTION ALWAYS BENEFITS HIS RACE ISLAM ,SOCIALISM ,BLACK CRIMINALS ,OUR MONEY SEND TO HELP ALL PLANET BUT NOT THE TAX PAYERS....OUR CONSTITUTION IS BY FAR THE BEST GIFT TO HUMANS FREEDOM ....AND CAN YOU BELIEVE ME I`M NOT GETTING PAY FOR DOING THIS I CALL THIS THE POWER OF ...","commenter_a":"And the lobbyists and special interest groups Bush, Trump 2016","post_message":"Jeb Bush said to defeat radical Islam, we \"shouldn't have the warfighters have their arms tied behind their backs.\" Do you agree? #GOPDebate"},{"comment_id":"1101968433174725","commenter_b":"Okay? That doesn't mean he wasn't talking to all Americans in this quote.","commenter_a":"He was actually talking to the wealthy in America with that phrase. He was about to raise their taxes.","post_message":"BOOM!"},{"comment_id":"10155246322201509","commenter_b":"Hillary will only do what pads her pockets and feathers her own nest...","commenter_a":"Trump Newest Hat Says \"The Low Educated Loves Me\" #TrumpIsAnIdiot!","post_message":"Nope, the newest Donald J. Trump hat isn't a parody."},{"comment_id":"10153482509219714","commenter_b":"The girl is a faker","commenter_a":"Once you go black you don't go back. She took it out of context.","post_message":"NAACP leader Rachel Dolezal is speaking out in the wake of controversy."},{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."}]
