[{"comment_id":"10154165946748606","commenter_b":"Please don't stereotype. You can not speak for all Hispanics. We all don't \"love\" to drink and drive.","commenter_a":"RIP... The Hispanics love to drink and drive. Thank God mo one else involved this time.","post_message":"A car went airborne after hitting a beltway bridge abutment before landing on the roadway below, killing the driver. @webpagelink"},{"comment_id":"370852156623268","commenter_b":"It appears that She doesn\"t know how to do anything. Maybe she can pole dance or do hoing!!!!","commenter_a":"Guevona!","post_message":"She hasn't done anything..."},{"comment_id":"10154388275884087","commenter_b":"@username yes. Literally. @webpagelink","commenter_a":"He literally yelled \"Allahu Akbar.\" Why isn't anyone reporting that?","post_message":"#BREAKING: Russia’s ambassador to Turkey Andrey Karlov was shot and killed by a Turkish police officer who shouted \"do not forget Aleppo.\""},{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10156577406325231","commenter_b":"Girl tell it.","commenter_a":"Did anyone question how much the late Nancy Reagan spent during her time in the White House, especially on all that expensive china she had to eat off of and let's not even discuss her designer clothing, shoes, and handbags and the country was in a recession then too. Leave these children alone!","post_message":"How about people stop worrying about the price of the first family's clothing?"},{"comment_id":"1350752595003273","commenter_b":"Michelle is beautiful and elegant. However, she isn't even giving Trump a chance. We gave them 8 years. I'm so grateful Clinton lost.","commenter_a":"Good answer Trump","post_message":"During an interview with Oprah Winfrey, first lady Michelle Obama said that there was \"no hope\" under Donald J. Trump. The president-elect didn't sweat it, though... his response was PERFECT. This is why Trump will be such an epic president..."}]
