[{"comment_id":"10153881194507464","commenter_b":"My FB wall today is swamped with nothing short of filthy dirt on Cruz, thanks to a handful of Trump supporters. Just how ugly will this get?","commenter_a":"absolutely right, @username is the only consistant conservative in this race. CRUZ missile to the White House 2016!","post_message":"Rush Limbaugh: \"If conservatism is the dominating factor in how you vote, there is no other choice for you in this campaign than Ted Cruz... this is the closest in our lifetimes we have ever been to Ronald Reagan.\""},{"comment_id":"883919521667797","commenter_b":"newsflash, genius. there's a bunch of dumb females already in ISIS.","commenter_a":"no female should be deployed where isis are, you are just asking for trouble.","post_message":"Kayla Jean Mueller, 26, traveled the globe fighting genocide, AIDS and domestic abuse."},{"comment_id":"1059407147484519","commenter_b":"She is terrible!!! She never said how she would protect us. My dog can do better than her!!!","commenter_a":"Agree!","post_message":"Eric Trump criticized Hillary Clinton's foreign policy and said it should be a requirement for Americans to watch \"13 Hours: The Secret Soldiers of Benghazi\" before voting for president."},{"comment_id":"1215709481782562","commenter_b":"Women's bathrooms are disgusting. Humans are disgusting.","commenter_a":"Seriously, why do women or trans, want to share the bathroom with the male species. The mens washroom is disgusting and I hate going into them myself. Please end this, men for men, women for women.","post_message":"Spotted at the Canadian National Exhibition in Toronto...   (Photo: Joshua Ostroff/HuffPost Canada)"},{"comment_id":"1482796298404171","commenter_b":"@username that's such a nice thing to say","commenter_a":"As an Asian non-American, I have a lot of similar feelings with people from the video. However, one thing I do not share is the that even I am not American, not born here, you still don't get to say \"go back to China\" to me. I go where I want and I came here legally. America could be more friendly.","post_message":"An editor for The New York Times wrote an open letter to a woman who told him to \"go back to China.\" Asian-Americans responded by sharing their own racist moments using #thisis2016. Here are some of those moments.  Warning: This video includes racial slurs and vulgarities."},{"comment_id":"1363332557011521","commenter_b":"Robert Flemming you still haven't answered my question.","commenter_a":"I tell ya, if any of that shit were real, I'd much rather be on the side of Satan, than some dude that allows childhood bone cancer to be a thing. I'll keep my free thought thanks, you can keep your sadistic, imaginary friend to yourself.","post_message":"Food for thought."},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."}]
