[{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""},{"comment_id":"10153481756262507","commenter_b":"@username \"you're\" means \"you are\"--so \"To you're point\" means \"to you are point\"...just an FYI","commenter_a":"If he doesn't win the dem ticket he can still run as independent and take all his votes that really do matter with him! along with over half the so called dems and prob a 1/4 of so called repubs!","post_message":"It's not over until it's over."},{"comment_id":"1195133713860336","commenter_b":"AND WE ARE OFFENDED BY ANYTHING MUSLIM. FEEL OFFENDED, GO HOME!","commenter_a":"Muslims are transgender too. They need a ladies room too.","post_message":"Patriots are pissed over this post. 'LIKE' and 'SHARE' this if you think they should shut the hell up. @webpagelink"},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"},{"comment_id":"1023543291017240","commenter_b":"Nappy fake hair bitches.","commenter_a":"Black women aren't hot ! You can't do a fucking thing to me ! White lives matter !","post_message":"Do you think what this college student said is racist?"},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153699640168984","commenter_b":"Trump2016, Deported his ass and then let him back in,Just like he said he can do with the good illegals, but if they are bad then he will leave them on the other side of the wall.lol","commenter_a":"the most entertaining candidate I have ever seen :)","post_message":"This Univision host thought he could battle it out with Trump, but he failed BIG time. Do you think Donald Trump made the right move?"}]
