[{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."},{"comment_id":"10153344418725326","commenter_b":"Me too..they are owned by Time Warner her 7th largest donor!?!?!","commenter_a":"THE QUESTION IS THIS. DID CNN FEED HILLARY THE QUESTIONS IN ADVANCE. IF YOU LOOK AT HER BODY LANGUAGE AND LACK OF PONDERING THE QUESTION HER RESPONSES WERE CANNED. I FIRMLY BELIEVE CNN FED HER THE SCRIPT.","post_message":"Hillary Clinton was put on the defense Tuesday for her ties to Wall Street. While Sen. Bernie Sanders has been saying for years that the Wall Streets are contributing to the overwhelming income inequality in America. Ed gives Commentary. Don't forget to Subscribe to Ed's YouTube Channel at: goo.gl/ScLQVu"},{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"605117769694222","commenter_b":"WE DONT BUY IVORY PERIOD!!! WE NEED TO BOYCOTT CHINA ESPECIALLY AND DONT EVEN BUY DOLLAR STORE THINGS THAT ARE MADE IN CHINA!!! IVE BEEN TO HONGKONG AND TAIWAN IN 87. SAW MEGA IVORY BACK THEN👿💔👹 FOR SALE! NOTHING HAS CHANGED! CHINA HAS NO PUNISHMENT! AFRICAN COUNTRIES NO TRADE PUNISHMENT! EVENTUALLY THE COUNTRIES IN AFRICA WILL STARVE OUT IF WE BOYCOTT TOURISM!!!","commenter_a":"Every country involved in the purchase of animal products from Africa as well as gaming in Africa are the reason why we have this problem. It's not only Africa's problem this is a world wide issue. Next time you hear a piano play or go to the pub to play some billiards question what they are made of. Ivory poaching legally ended in 1989, but the demand will always be there and countries like China and Japan will always buy their way through these bans as long as we keep buying tacky souvenirs from Asia containing Ivory. Education is the key, we have to take an interest and ask what is the item I'm about to purchase made from? This is what we can do to reduce the demand of items made from threatened species.","post_message":"Poachers, beware. These dogs are coming for you from the air. @webpagelink"},{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"10153910972008812","commenter_b":"it should be 25 to life","commenter_a":"He's gonna be getting plenty of footlongs where he's going lol","post_message":"JUST IN: Ex-Subway spokesman Jared Fogle sentenced to over 15 years in prison after pleading guilty to child pornography charges."},{"comment_id":"10153756605707293","commenter_b":"They under no obligation to equally satirize. None at all.","commenter_a":"When you do one on Cruz's squished nose, Hillary's liar farm, Bernie's insane core math, then I'll listen.","post_message":"Wait, what?"}]
