[{"comment_id":"10153809270614454","commenter_b":"Hurrah! Hurrah! Hurrah!!!","commenter_a":"Couldn't happen soon enough. Long overdue .","post_message":"ICYMI: This week, Hong Kong pledged to ban the import and export of Ivory goods. #SaveElephants"},{"comment_id":"10156328983890389","commenter_b":"just a dried up old liberal lying witch .","commenter_a":"The appearance of former secretary of State Hillary Clinton before the House Select Committee on Benghazi raised very important questions on diplomatic security, the relationship between the secretary of State and her ambassadors and leadership. My experience during 38 years in the Foreign Service, including six assignments as an ambassador, has given me a perspective on these issues that differs from some of the arguments developed by the Committee. First, about security. Every secretary of State and every ambassador has security as a top priority. It is a dangerous world, and we are everywhere in it. An ambassador is responsible for the security of her personnel and her embassy. Internal defense plans, risk assessment, movement controls, adequate defensive systems these are all on the shoulders of the chief of mission. The department is responsible for getting her what she says she needs. There is no perfect security. Risk has to ...","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"'Madame President Hillary Clinton.'  Do you like or dislike the sound of that?"},{"comment_id":"10154002938919749","commenter_b":"Cindy Rhodes go do one stupid cow feminists are scum","commenter_a":"If your still hung up on feminism within the uk and the us then you need to develop your personality. Not your discrimination skills.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"10153559640036051","commenter_b":"This post gave me cancer all over again....","commenter_a":"I support guns. I love them. I have some. They are for Huntin. I believe we should be able to own guns. But this Type of rifle. I think our militry And police is the only ones who should have this kind of gun. What does a deer hunter need with somethin like that. I think somethin like a 30-06 is plenty of gun. Or somethin similar. Not just that kind. But Nothin like Whats shown. There should be a limit. But not banned","post_message":"A federal court just ruled that a Maryland law banning citizens from owning military-style rifles is unconstitutional. Do you support the court's ruling?"},{"comment_id":"1763482420575354","commenter_b":"'@username your savor is going back on his own immigration stance. He was so bold at first, but now he's retreating lol. #typicalChump","commenter_a":"'Today in his Mexico press conference, Donald Trump lied about discussing how to pay for his wall with the Mexican president. Trump has boasted for months that he is going to get Mexico to pay for his ridiculous wall but when he came face to face with the Mexican president he got out maneuvered and then tried to cover it up on worldwide TV. Simply put, Donald got rolled. It turns out Trump didn just choke, he got beat in the room and lied about it.'","post_message":"Hillary Clinton didn't go to Louisiana, and now she didn't go to Mexico. She doesn't have the drive or stamina to MAKE AMERICA GREAT AGAIN!"}]
