[{"comment_id":"502143199967560","commenter_b":"I wouldn't even give her the Cleveland steamer","commenter_a":"That's a face you could donkey punch.","post_message":"She makes it official!"},{"comment_id":"1155452914533533","commenter_b":"She has blood in her hands #garyjohnson President 2016","commenter_a":"Hilary Clinton my president of America, I'm so Happy for and all the women's should be able to learn from her. My president Clinton is very professional and smart. Sorry! Trumper's but it's time to be in the top line. \"With great people, we move forward to another level\"","post_message":"Michelle Obama on Donald J. Trump: \"...that's why he demeans and humiliates women as if we're objects meant solely for pleasure and entertainment.\" @webpagelink"},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."},{"comment_id":"10152604672427894","commenter_b":"I bet the beautiful lupita will be married before her silly ass will ever be...hell Walter didn't want her .","commenter_a":"Kenya need to stfu with her stupid ass","post_message":"Kenya Moore Shades Lupita Nyong'o Over Golden Globes Photo Snub: 'Girl Bye'"},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"10154647842874197","commenter_b":"KHILLARY HAS ROBBED ALL OF US. BILLIONS OF DOLLARS IN HER COFFERS!!! TAKE THEIR MONEY AND GET OUT OF THE US!!!","commenter_a":"He won't save it he will get what he wants at your expense lol","post_message":"WATCH LIVE: Donald Trump speaks in North Carolina."},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."}]
