[{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"},{"comment_id":"10155415365743812","commenter_b":"Alfredo Aguilar This comment","commenter_a":"I see Trump's shipment has arrived. This explains his snorting problem. lol","post_message":"U.S. Coast Guard Cutter Midgett crew offloads more than 13 tons of cocaine at Naval Base San Diego that were seized in 21 separate incidents in the Eastern Pacific Ocean. @webpagelink"}]
