[{"comment_id":"10153646418046770","commenter_b":"Me too...bad ole' white Cain and Trump lovin' women...shame on us...NOT!","commenter_a":"Love you Herman Cane! Oh, wait, you are black and I am racist! Isn't that what they say! Oh well, I love you, Dr Ben, Allen West! I guess I can be racist some other day!","post_message":"The Cain Train is Back in the Station - Herman Cain is back again live on day 2 of Trump's Convention"},{"comment_id":"10153018871246130","commenter_b":"Lesbian porn is boring. Girls that don't have the slightest clue as to how to thrust their hips.","commenter_a":"Men say \"fucking disgusting\" then get their morning jerk off to lesbian porn.","post_message":"How adorable is this?"},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"10153085724024228","commenter_b":"let her leave, she's the one who will suffer","commenter_a":"Let's not forget child-support from Miss congeniality.","post_message":"After holding baby Leo's hand for the first time, his dad fell in love."},{"comment_id":"10153109676116051","commenter_b":"Fire the bitch","commenter_a":"UNBELIEVABLE ,THEY SHOULD BE CHARGED WITH THAT POOR LITTLE BABY DEATH,PRAYERS FOR THE FAMILY","post_message":"This EMT was dispatched to a home where an 8-month-old baby desperately needed assistance. The family was begging for help at this point. The EMT had a different plan, though."},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""}]
