[{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the \"Contract with America\" and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10153176859780667","commenter_b":"Yep..that's what it comes down too. Ungrateful brat & worse money hungry parents !!! Deport them now...but demand payment for his education& for being allowed to live in this great land of opportunities !!! Seriously !!!","commenter_a":"It figures about the money ,but they won't even get 10,000","post_message":"\"The school and city officials involved knew what they needed to do to protect Ahmed's rights. They just decided not to do it.\""},{"comment_id":"10152818451732014","commenter_b":"Can't believe it. She had black heart so seem didn't care own baby. Y are abuse own child.","commenter_a":"How can people be so freaking stupid??!!!!!!!","post_message":"A Phoenix mother has been arrested for allegedly leaving her 4-month-old daughter in a hot SUV."},{"comment_id":"10154326005239657","commenter_b":"Just heard this morning, accordeing to an article in the NYT, that Hillary's unprotected server had an email disclosing the locaation of Ambassader Stevens on 9/11/2012. It was also disclosed that our allies knew her email was not secure, so we can only speculate our enemies knew as well. If all of this is true, this woman should be shuned by the American people.","commenter_a":"Lollllllll. True","post_message":"A look back at the week's most memorable, powerful, and funny political cartoons.  #5 might be one of the best we've seen all year!"},{"comment_id":"573261456173658","commenter_b":"Praying for you Dr.Carson you can do this","commenter_a":"they don't persecute christians alone. innocent people of all faiths and lack of faiths are persecuted, i think its wrong to focus on only the christian victims","post_message":"Our country faces grave national security threats. We must act boldly and decisively to protect American citizens from terrorists at home and abroad. We can no longer dawdle while ISIS continues to persecute Christians, enslave young girls, oppress civil societies and perpetrate terrorist attacks against the free world. We must destroy their caliphate and prevent their terrorists from infiltrating our homeland. We must also secure our borders, identify radical Islamic extremism by name and root out its agents and collaborators in our own country. My \"Seven Steps for a Safer America\" offers a path forward for confronting these threats and protecting this great country.  1. Congress should immediately issue a formal declaration of war on the Islamic State, which is also known as ISIL or ISIS.  2. The United States should lead the immediate formation of – and provide substantial advisory, financial and military support to – a military coalition in the Middle East to wage war against ISIS. Such a regional coalition would consist of countries such as Egypt, Saudi Arabia and Jordan.  3. The United States should urge its allies and partners in the Middle East to engage in massive recruitment and training of Sunni Syrian men based in Saudi Arabia and the Gulf and of Sunni Syrian male refugees in Jordan – to establish a military force to destroy ISIS and to establish a protection zone for the victims of the terrorist state.  4. The United States should deploy its military resources and work with moderate Arab nations – as well as extend strategic support to Kurdish, Christian and Sunni tribes in the free al-Hasakah Province in northeast Syria – to establish a refugee safe zone in the Province. All refugees should be directed to that free area and to other liberated areas later, and be put under international protection.  5. Congress should immediately establish a war-time emergency visa and immigration policy; establish an emergency inter-agency task force to review all visa and immigration policies; and limit visitor visas to three months with mandatory check-ins for extensions no longer than three months.  6. President Barack Obama and Congress should immediately deploy the National Guard and military troops to patrol the U.S. southern border as well as designated spots along the northern border.  7. The Department of State should designate the Muslim Brotherhood and other organizations that propagate or support Islamic terrorism as terrorist organizations, and fully investigate the Council on American-Islamic Relations (CAIR) as an offshoot of the Muslim Brotherhood and a supporter of terrorism."},{"comment_id":"1068655089908149","commenter_b":"Beautiful!","commenter_a":"Beautiful!!!","post_message":"Happy 24th anniversary, Barack Obama and Michelle Obama! Here's a look back at the First Couple's sweetest moments."}]
