[{"comment_id":"1768080320145861","commenter_b":"She is a criminal to her core","commenter_a":"TRUMP will protect LBGT people from the moSLIMEs. Hitlery will always side with iSLIME because that is who keeps her rich. VOTE for TRUMP!","post_message":"On June 18, 1983, Sally Ride became the first American woman and first LGBT astronaut to go to space."},{"comment_id":"1312435595456367","commenter_b":"Meeee and babe lmao I feel bad for you on Saturday","commenter_a":"Maria LMAO","post_message":"Yo Chill"},{"comment_id":"497157623808151","commenter_b":"Oh but their day is coming!!! We will show up one way or another!!!","commenter_a":"Obama sucks","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."},{"comment_id":"1206621306053557","commenter_b":"Truly this HYPOCRITICAL woman with NO MORAL CONSCIENCE and u hope one day she will be in a Federal Lockup w/ The Clinton CRIME FAMILY along w/ OSAMA OBAMA and they'll have time to know GOD...","commenter_a":"Piss off and die, libtard.","post_message":"WOW..."},{"comment_id":"10153411890826167","commenter_b":"Don't Muslims go the mosque all the time? What's the big deal?","commenter_a":"Well, we knew THAT was coming!!","post_message":"The White House said Obama's upcoming mosque visit is meant to \"reaffirm the importance of religious freedom to our way of life,\" but suddenly conservatives don't seem to care about that:"},{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."}]
