[{"comment_id":"776943375772176","commenter_b":"Nope definitley not a lie lol, I was biologically born female.","commenter_a":"I'm a conservative on most issues, but I disagree big time on this one being a trans male as well (my original biological sex being female). You really want me to go in the women's room and make people there uncomfortable?","post_message":"Are you freaking kidding me..."},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"10155125514911178","commenter_b":"hhahahaha disgusting pig!","commenter_a":"Disgusting. ...","post_message":"Can you put a price on human life? Because that's how the morally warped, Hollywood left view abortion."},{"comment_id":"10153709236220927","commenter_b":"I think she was in WAY over her head. I guess she hasn't been a flaming Liberal long enough.","commenter_a":"What's new","post_message":"Moderator Elaine Quijano continually challenged Gov. Pence. #VPDebate"},{"comment_id":"940335786059476","commenter_b":"That's right fuck that dumb cunt!!!","commenter_a":"Michael Lance Kaniala-Ekahi Baldasare-Low Shelbie King @username","post_message":"How to silence Kim Davis supporters who cherry-pick the Bible to discriminate against LGBT Americans. In the comments, tag your friends who need to see this. Video by Occupy Democrats, please LIKE our page!"}]
