[{"comment_id":"10154724995284197","commenter_b":"Good dog. Take a bite out of crime!","commenter_a":"Another morning of bumper to bumper. And another police chase. Thank goodness no innocent people involved.","post_message":"JUST IN: #Milford police said they were pursuing shed burglary suspects down I-95 when it resulted in a crash with one of their own cruisers: @webpagelink"},{"comment_id":"876368152479964","commenter_b":"She is ugly.","commenter_a":"wow","post_message":"OUCH!!!!! This is a MUST WATCH! This video of a serious Michelle Obama takedown is going viral fast.  'LIKE' if you think Michelle gets exactly what she deserves. @webpagelink"},{"comment_id":"10153030361596636","commenter_b":"y'all feminists need some patriarchy","commenter_a":"Well when it comes to equality between the sexes I can easily say that Sweden is equally retarded and out of touch as Saudi Arabia in regards to the rights of women in society. This whole feminism movement has gone totally out of control here in Sweden and become something like the Catholic church.","post_message":"Maybe it's time we did the same?"},{"comment_id":"10155050454914469","commenter_b":"White girl wasted","commenter_a":"I'm chocolate wasted","post_message":"BABY GIRAFFE WATCH: We are waiting for April to have her calf! Will it happen today? bit.ly/2l14Zin (Video via Animal Adventure Park)"},{"comment_id":"10154362944566880","commenter_b":"Leonardo Gai","commenter_a":"Vasilis Sotiriou","post_message":"$39 billion and rising."},{"comment_id":"10154356585776509","commenter_b":"The mass shooter in California, were not by Americans. They should establish a law that anyone who comes into this country looking for citizenship should established themselves as Americans ,have at least 2 year or more waiting period. Until they do an extensive background check","commenter_a":"When black people kill white people and rape white women you don't see no tears from Obama. When Muslims terrorize and kill people cut Christians heads off you don't see no tears from Obama","post_message":"President Barack Obama wipes away tears while speaking about victims of gun violence: \"Every time I think about those kids it gets me mad.\" @webpagelink"},{"comment_id":"943377485718781","commenter_b":"Never Bernie. This Latina will vote for Hillary.","commenter_a":"@username mil veces mi voto para ti..!!","post_message":"\"Para el Señor Trump, solo tengo una palabra.\""}]
