[{"comment_id":"1082429571840463","commenter_b":"Sounds like @username sharing a very personal account.","commenter_a":"I agree, but those who refuse to see this analogy... the seriousness or the truth of what is happening to America ... and what to do about it... before it's too late and America is totally unrecognizable... is another story.... the story of the real American history is not being taught for one thing ... the story as in the recent documentary by \"Dinesh Desouza, \"Hillary's America\"... the story of the real America is not being told in the history books or on the campaign trail...and not mentioned once in any of the debates....WHY??? these are the people who need to hear the real American History .... I for one was in shock...to learn the truth... but was blessed and was one of the fortunate ones to \"see\" this documentary... but there are others who are ignorant of this truth ... who are or choose to remain a victim or ...","post_message":""},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"684212015075058","commenter_b":"@username Your mom was penetrated 3 or 4 times in one day by a cave dweller","commenter_a":"The source file was on whitehouse.gov when they originally released it. I downloaded it, simply opened it in photoshop, and all of the layers were still accessible. I was able to remove words, dates, signatures and even fragments of words where they pieced them together. It was a complete fumble on their part.","post_message":"I thought this was just a conspiracy theory. But it actually happened today. #fakepresident? Edit: No we have not been hijacked, and our mods have diverse political opinions. This was from AP and tons of other sources both left and right, definitely not fake. Heavy was the most neutral we could find."},{"comment_id":"1233016690120338","commenter_b":"I would say #NeverHillary. Write in Bernie OR anybody else. The woman is so corrupt.","commenter_a":"\"Superprepared warrior\" is absolutely nothing you should be proud of. You're a disgrace to world peace and America. America will never elect someone as insidiously corrupt as you. Hope the FBI comes knocking soon!!!","post_message":"“On April 19, New York Democrats will have unusual say over the party’s nominee. They have in Clinton a superprepared warrior realist... By choosing Clinton, Empire State Dems would powerfully signal that the party has gotten real about achieving long-sought goals.” —New York Daily News nydn.us/1Vn9bcK"},{"comment_id":"10154879829717178","commenter_b":"They are not moving anywhere. Btw transgender is not a protected class.","commenter_a":"BOA is in talks to move it's headquarters out of Charlotte because of the discrimination law. Way to go State Politicians.","post_message":"House Bill 2 has just about everything an editorial cartoonist could want: a well-known story, controversy, key players to lampoon, and toilets. Story >> wral.com/@username"},{"comment_id":"10153330773746336","commenter_b":"Killing America ....... Job by job......","commenter_a":"Good it should not be right to work, should be the best man for the job.","post_message":"“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\" – Greg Mourad, National Right to Work Committee"},{"comment_id":"1235543663197041","commenter_b":"Are you crazy fat black lady?","commenter_a":"Can't fix stupid","post_message":"Apparently, torturing white people and yelling \"F**k Donald Trump! F**k white people!\" isn't a hate crime..."}]
