[{"comment_id":"10154102446149749","commenter_b":"@username, STFU and go lick the pope's ass ..","commenter_a":"Well why doesn't the Catholic Church hand over some of its many billions and do something about it and relax their pathetic view on contraception No wonder there are so many of them","post_message":"The Pope laments Europe's handling of the influx of migrants and refugees fleeing war and persecution."},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"606606769472505","commenter_b":"Karma's a bitch!","commenter_a":"not that I don't think this would be a good thing, but what's shown isn't likely. Unless this particular suicide bomber killed himself without using the bomb he was wearing, that bomb has been used. somebody would have had to put the scraps of his body into a new wearable bomb for this to happen... without anyone noticing.","post_message":"Video: This funeral for a suicide bomber is about to take a MAJOR unexpected turn for these terrorists. Karma?"},{"comment_id":"1670051896580847","commenter_b":"Hell yes","commenter_a":"Definitly YES !","post_message":"OMG! Obama shortchanged the VA by 2 billion and gave away 4 billion to Muslim migrants! He hates our vets! FOLLOW US----> Freedom Daily"},{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"1797835747132215","commenter_b":"A nasty woman","commenter_a":"This women should never be allowed to moderate another debate ever again, she clearly has an agenda.","post_message":"At Monday’s White House press briefing, ABC’s Martha Raddatz lobbed President Obama a question designed to get him to criticize President-Elect Donald Trump. He refused to humor her request."},{"comment_id":"10155098283689411","commenter_b":"Bitch","commenter_a":"Politics and sex don't belong together. Also, what a dirty whore.","post_message":"'Everything is ok'"}]
