[{"comment_id":"10152758880516636","commenter_b":"Would it mean I get to touch a woman?","commenter_a":"No i would get stage freight","post_message":"Who actually volunteers to have sex in a laboratory?"},{"comment_id":"10153512925208854","commenter_b":"They can take the next boat, plane, or train out of my country!!","commenter_a":"All those who sign this petition should be banned from the USA forever","post_message":"U.S. Citizens Sign Petition to Ban American Flag"},{"comment_id":"10156197809660725","commenter_b":"I think you mean deports the illegals","commenter_a":"thank you Donald Trump...for being the voice of and for \"the people\". liberal media and politicians are not used to truth...refreshing to hear you vs the politicians not in touch with Americas condition and needs!","post_message":"An updated POLL tracker (with all polls thru the weekend) reveals I maintained a double digit lead at 34.8%. Not only that, my poll #'s are double that of 2nd place candidate. #Trump2016 #MakeAmericaGreatAgain"},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support \"feminism\" have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."},{"comment_id":"10153416181512217","commenter_b":"if I had to go, this is how I'd do it","commenter_a":"@username this is like your entire sense of humour in one headline","post_message":"Father Stephen Crossan has taken extended leave from the priesthood."},{"comment_id":"10153122884761130","commenter_b":"This article suggests I'll never find a smart woman to have kids with. That's disheartening","commenter_a":"Hmmmm.....","post_message":"As if being a woman is just about having kids."},{"comment_id":"1004595529587074","commenter_b":"Show me where I said that Jeep!! Assume much?? Many woman have had very easy deliveries and others more difficult. You cannot predict which way it will go. HOWEVER, every successful abortion kills a new human.","commenter_a":"Choose Love, Choose Life! All human beings deserve a chance at life. If you agree with saving trees or animals but, not human beings you are an idiot.","post_message":"Every life is a blessing!"}]
