[{"comment_id":"10152564279192623","commenter_b":"Notice everytime it moves up and down is when she brakes. It falls forward when she brakes. And honestly this woman in the front car has been a menace for a while now! It's about time someone got proof of her ridiculousness.","commenter_a":"the cops were called. she started in back of driver redneck lady tried to run lady and child off road first time. and slowed down to let the other in front. the phone was in a dashboard holder while taping driver not holding phone.","post_message":"WATCH: Road rage out of Randleman.   Just tilt you head and wait until about the 3-minute mark.  Egads.  Warning: Language and gestures may be offensive to some."},{"comment_id":"1287419524611131","commenter_b":"Lefty lady","commenter_a":"My peeps","post_message":"It's National Left Handers' Day! Did you know only 10% of the U.S population is left-handed? Comment below if you're a lefty like these celebrities. >> kiro.tv/Famous-Lefties"},{"comment_id":"10153895109342994","commenter_b":"Let Canada take in all the refugees - America doesn't want or need them.","commenter_a":"That's Canada! Friendly and welcoming people :) Wish the rest of the world was like that..","post_message":"A church in Canada is making a statement in the holiday season that's brewing controversy - and they're going beyond the church sign."},{"comment_id":"10155329030581002","commenter_b":"What's wrong with these racist black women?","commenter_a":"What is wrong with these nasty white bitches?","post_message":"A former Santa Fe Independent School District teacher is accused of having sex with two students over the last year and a half."},{"comment_id":"1191494990889956","commenter_b":"I could care less what that judge has or says, I AM TRUMPED ALL THE WAY TO THE WHITE HOUSE !!!!!! THAT FREAKIN JUDGE JUST DON'T WANT THE WALL !!!!!!!! TRUMP 2016","commenter_a":"Boy, if Obama worked as hard pleasing the people as he does trying to destroy the republican front runner we'd all say he was great instead of destructive.","post_message":"HISPANIC JUDGE THE NEWEST ATTEMPT TO DERAIL TRUMP  @webpagelink"},{"comment_id":"10154951315667235","commenter_b":"Oh, well, let's just kill the bitch. Thank goodness there are smarter people in America than people like you. Pick a fight that matters.","commenter_a":"Not going to watch her. She has no credibility or can be trusted. She was part of the Obama hate and lies machine that paid her millions of dollars to create the monster who is going to be our president. I am not going to watch her. Get trusted news from FSTV.","post_message":"That time Megyn Kelly told children that Jesus and Santa were white?  It wasn't the only time..."},{"comment_id":"10154242038366323","commenter_b":"If someone voluntarily choses this classless \"job\", they deserve anything and everything that might come their way. I have no sympathy with whores and sluts, be they male or female. Why should I?","commenter_a":"Are you kidding me? Political correctness has come to THIS? The authors ersatz rationalization is nothing more than a peurile legitimization of prostitution. Call it whatever you like and for whatever reason, prostitution is prostitution, period. The whole point of the world's oldest profession is to exchange sexual favors for money. That prostitutes, no matter the reason, willingly engage in the services they offer is no reason to create bogus excuses for the consequences. If the sex worker - and make no mistake, that's what they are, regardless of their sex - comes away psychologically damaged, well, that rather goes with the territory of the profession. That is their problem, not anyone elses. In case they hadn't heard, prostitution is illegal. Why should taxpayers be burdened with caring for their psychological ills? As it is, sex workers already reap the benefits of medical attention at emergency rooms or through state ...","post_message":"\"If, while having sex with someone, you feel repulsed by them touching you, afraid of what they might do, degraded and humiliated by the sexual acts – the fact that you’ll get a bit of cash at the end does not change anything. There is no invisible hand in the prostitution market that magically disappears the lived experience of sexual abuse.\""}]
