[{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in. Should parents have taken kids out of school for the parade?"},{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."},{"comment_id":"1614159405537839","commenter_b":"Throw her on a plane and get her the hell out of here","commenter_a":"Send them all back","post_message":"Deport these radicals NOW!"},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"},{"comment_id":"10155125514911178","commenter_b":"hhahahaha disgusting pig!","commenter_a":"Disgusting. ...","post_message":"Can you put a price on human life? Because that's how the morally warped, Hollywood left view abortion."},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""}]
