[{"comment_id":"943670819034115","commenter_b":"lol..that is a joke...that skank aint pretty at all..not cause her skin color..its because shes ugly..Id rather hit precious","commenter_a":"She is the most racist, evil, conniving bitch to ever be in the white house! With her 22 \"assistants\"! And you know most of them are probably white so she can treat them like slaves!","post_message":"Americas Freedom Fighters"},{"comment_id":"629306997259879","commenter_b":"Well listen up you stupid, IGNORANT BITCH! If your planning to remove the word BOSSY, well then you might want these words removed also. BOSSY,BITCHY, MOODY, HORMONAL, ON YOUR PERIOD, shall I say more. All these words have the same meaning. Of all people Michelle Obama, I believe that you've been quite the fucking BOSSY ONE lately so don't fucking start PREACHING your BULLSHIT TO THE AMERICAN PEOPLE. By the way BITCH you must not have anything to do and to much time on your hands to open your BIG FUCKING MOUTH ABOUT A WORD THAT HAS MICHELLE OBAMA WRITTEN ALL OVER IT. TELL YOUR BIGOT husband your pathetic issues.","commenter_a":"I vote to ban Michelle","post_message":"You'll never guess which word Michelle is trying to ban.  This is ridiculous. Michelle needs to be booted OUT of the White House immediately.  Would you be happy if Michelle was kicked out?"},{"comment_id":"10154003044699199","commenter_b":"They dont wanna work !","commenter_a":"Picking apples and berries?","post_message":"There were 5.4 million job openings in the U.S. in April  the highest number of openings in 15 years.  It is a record high since the Bureau of Labor Statistics began tracking monthly job openings in December 2000."},{"comment_id":"375119059510655","commenter_b":"This woman is very wicked. You can see the evil spirit in her face. She is a demon from \"hell\"!","commenter_a":"Worst people you can meet in your life are LIARS! This administration is full of them!😏","post_message":"CNN has HAD it with Conway and her lies."},{"comment_id":"10152788579600736","commenter_b":"Yes, dumb ass lady","commenter_a":"Good!!! @username Kevin Heard","post_message":""},{"comment_id":"10152570108341770","commenter_b":"She's not upset about the coat, it's that her father is a turd and her mother is a pig.","commenter_a":"I guess so","post_message":"What do you expect when you dress your toddler in a $3,500 fur coat, Kim Kardashian?"},{"comment_id":"999541756747912","commenter_b":"Wake up American, Those people re Terrorists not Refugees.","commenter_a":"New York! !!","post_message":"WOW!"}]
