[{"comment_id":"1182026965223689","commenter_b":"Those Redumblicans are getting worse everyday!","commenter_a":"He deserves what he got !","post_message":"Here's some more of those \"family values.\""},{"comment_id":"850737528316277","commenter_b":"Does anybody realize the U.S. has 5,525 miles of border with Canada and 1,989 miles with Mexico. Our maritime border includes 95,000 miles of shoreline. How do you propose to secure this border? How do you propose to identify and round up 11 million people and deport them? I would really like to hear your reasoned proposals.","commenter_a":"just do it already.","post_message":"Don't you think we should start enforcing CURRENT immigration laws?"},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."},{"comment_id":"10154366303774749","commenter_b":"British Airways are a really bad airline, I would not trust a child of mine to them!","commenter_a":"If you can afford a top boarding school then you can afford a return ticket. Maximise revenue from those with plenty of disposable income to subsidise economy travel sounds like an excellent way to do things - well done BA.","post_message":"Parents will now have to travel thousands of miles to see off their children."},{"comment_id":"893629520678836","commenter_b":"Hi, what do you mean their own kind?","commenter_a":"Why are they attacking their own kind?!","post_message":"At least 37 people have been killed during a #Saudi airstrike on a dairy plant in western #Yemen."},{"comment_id":"1194657977239103","commenter_b":"Yep theirs just as maney glacers now as their was then . But their smaller now then they were then. The Artic ice cap is smaler now then it was then and the Anartic is doing somthing with large chunks braking off.So I guess you all know more then the people that study the weather Maybe almost as much as you know about doing your job in stead of taking money to lie","commenter_a":"The whole global warming crap is a lie its away for rich people to gouge the world for more wealth","post_message":"This is going to upset a lot of people!"}]
