[{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"},{"comment_id":"10150971534884999","commenter_b":"The thrust for stories to prove a Trump presidency will embolden bigots is so great right now, people are faking hate crimes.","commenter_a":"\"RISE IN HATE CRIMES\" -If 'Murican media is anything like Toronto's , they are rigorously hunting down stories that fit the appropriate narrative of the day.","post_message":"Kids are at risk of getting the message that racism and harassment are OK, Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"811770395611301","commenter_b":"Kennites ! Caine's offspring is the remnant. Numbers 33 : 50 - 56 God told the Jewish people when entering the Promised Land. God said - Run the Inhabitants out of God's Land. Destroy all pagan Idols. Destroy all pagan high religious places. Possess the Promised Land ! May God bless Israel !","commenter_a":"Sons of Satan who want their own Caliphate hiding behind religious to commit atrocities again fellow humans.","post_message":"Women taken captive in Iraqi town Mosul. #Sexslave #ISIS #Iraq"},{"comment_id":"10154258591333701","commenter_b":"What a bitch. Just say you don't want to exercise, don't take it to the next level.","commenter_a":"Once they hit 65 it should be mandatory yearly testing until age 75 in which case it needs to be testing every 6 months. Elderly people do not belong on the road. NOW before you idiots talk crap let me just tell you my father drove until he was 87 years old. When my brother and I reported him to the DMV at 83 years of age he was sly. He just went and took his drive test at the Silverton branch of the DMV and passed because all they had him do was drive around the block. Regardless, old people need to be allowed to ride the buss and max for free and stay out from behind the wheel!!.","post_message":"Police say nobody was injured in the crash, however there was something very familiar about it for everyone involved."}]
