[{"comment_id":"1640983469535980","commenter_b":"Speak for yourself. You've been in your spot for years, tell us something you have done. LADY, clean out from under your doorstep before you start criticizing someone else.","commenter_a":"Your a sick women","post_message":"Pelosi on Republicans: \"They pray in church on Sunday, and prey on everyone the rest of the week.\""},{"comment_id":"10154001304876509","commenter_b":"She should be fired and arrested. No one else can break the law and get away with it.","commenter_a":"That is insubordination! She is not following the rules and duties depicted in her job description! Justified cause forr job termination! Her Supervision should file charges and she should be processed according to HR procedures which could lead to job termination.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."},{"comment_id":"10153676230638984","commenter_b":"Hillary u r one dumb fucking bitch.u have to treat every race equal. An the man in the interview I have a question for you. (WERE U BORN IN AFRICA AND IF U WERE NOT THEN U R A BLACK AMERICAN.","commenter_a":"Where is the surprise in this? She's always been a radical.","post_message":"While Black Lives Matter is disruptively crashing other candidates' events, they're getting treated to behind the scenes meetings at Hillary Clinton events. Thank goodness this was captured on camera... Spread this video so everyone can see the real Hillary in action..."},{"comment_id":"10154333235104726","commenter_b":"So all the gun owners need to boycott Hawaii. See how they do when there money source dries up.","commenter_a":"It's begining","post_message":"Hawaii became the first U.S. state to sign into law a bill requiring all residents who register as gun owners to be placed in a federal criminal records database that monitors them for any crimes committed."},{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"}]
