[{"comment_id":"1686144921672620","commenter_b":"Sixty percent of the donations to his church are by mail. I'll wager sent in by those that can least afford it.","commenter_a":"I am thoroughly confused. Why does a preacher have to be a millionaire? Jesus did not need a million dollars to spread the Word of God and there is no other as Him. Nor did his disciples. They taught the Word and lived the Word and never did they live as lavishly as these preachers. Many of you are saying that IRS should not get involved and the people should do something about it. The problem is that no one is and the blatant greed and lavish lifestyles is out of control - and what is the absolute worst- it is all done \"in the name of the Lord\". Sorry folks, these are not churches. They are tax free money making machines that feed off of very good hearted Christian people that just want to do their best to live according to the Word and these \"preachers\" know just what ...","post_message":"I can't believe this is happening. Sending prayers for Joel Osteen and the rest of America's churches that are being attacked."},{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""},{"comment_id":"10156625898105354","commenter_b":"Boo hoo whiney bitch. !","commenter_a":"Wow these lady must see through smoking glasses","post_message":"\"B**ch commits! That’s the hashtag.”"},{"comment_id":"1806158626337786","commenter_b":"She has pneumonia like I have the plague! UGH","commenter_a":"Now they're saying she had pneumonia since Friday---yet she did a celebrity fundraiser Friday with no mention of being ill. And if she did have pneumonia since Friday, why wasn't that the first excuse given for her collapse?","post_message":"\"Overheated.\" \"Short circuit.\" These are her and her campaign's own words. If they're using language like this to spin her appearance, what is the reality?"},{"comment_id":"10155111489782009","commenter_b":"you are crazy lady!","commenter_a":"He has brought ugliness and division.","post_message":"\"He has he has brought smiles to faces.\""},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"}]
