[{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"1784321135174854","commenter_b":"No you not voting makes you a hypocrite","commenter_a":"I am so done with this mentality.","post_message":"\"...the oppressor isn't going to allow you to vote your way out of your oppression.\" Colin Kaepernick explains why he didn't vote."},{"comment_id":"10153943433408645","commenter_b":"She should go to hell for posting this picture on her profile..","commenter_a":"Maybe because she has a horrible profile picture of someone beheading a cop?!....the same photo the shooter in Dallas had on his Facebook....or maybe not....not condoning either act, just responding to the ridiculous lead in of the article...","post_message":"Lanaydra Williams told FOX 4's Megan Dillard she didn't know where Overland Park was before Thursday night, nor did she know the man who made a threatening Facebook post on a picture of her daughter. The stranger was identified as an Overland Park Police Department officer, and the department apologized to her after firing him on Friday."},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"}]
