[{"comment_id":"857457044291637","commenter_b":"One man will never accomplish that .That will never happen.","commenter_a":"Obama is very naive when it comes to the Arabs. Maybe he is trying to have faith in human nature.that will not work in that cesspool in the middle east.That viewpoint does not even work here in a fairly civilized country.","post_message":"“Even if Israel has to stand alone, Israel will stand.”"},{"comment_id":"10154338817664411","commenter_b":"Arabic jews were never persecuted. This crap comes from your corrupted zionist controlled medias. Actually the white European jews were always persecuted by europea christians and Hitler etc. Can't you see the difference between a white European non-semitic jew with blonde hairs and blue eyes and a semitic middle eastern jew? Obviously you can't. You're a trash.","commenter_a":"There are calls by scientists and engineers, presidents etc etc etc etc etc to re - open the 911 case for new investigation. Suddenly the Saudi propaganda is out just at a time when the world is waking up to the 911 israeli zionist connection. Truth will prevail 😂","post_message":"Man wants to buy a plane & an abandoned building to 'prove it once and for all: Was 9/11 a hoax or was it real?'"},{"comment_id":"10154192129196176","commenter_b":"The average lifespan of a giraffe is 25 years","commenter_a":"I feel several brain cells dying from reading these comments.","post_message":"Baby watch! Do you think April the giraffe will give birth soon? All eyes have been on this sweetheart for a couple of days now. (Video courtesy: Animal Adventure Park in New York.)"},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10153848371885779","commenter_b":"Not*","commenter_a":"RS, why in the world does a music magazine now consider itself a forum for serious topics and an authority on what people ought to think? You are obviously pushing a liberal agenda when Noone with any sense is turning to you for any of this. Go cover a Backstreet Boys reunion show and leave these matters to serious adults in unbiased forums.","post_message":"At last night's #VPdebate, Mike Pence explained that his faith controls his position on abortion. But Pence's stance is nothing short of cruel toward women."},{"comment_id":"10154840580075695","commenter_b":"Go Hillary!!!!!! Vote blue!!!!!!","commenter_a":"#voteblue","post_message":"People fainting, 3-5 hour waits in line and it's only day 1 of voting. Local elections officials say today was the biggest turnout they have ever seen for early voting in an election. @webpagelink"},{"comment_id":"939799776150807","commenter_b":"Screw her!!!","commenter_a":"They have been alright with it as long as it worked inn their favorr.","post_message":"Democrat Senator Introduces Bill to Abolish Electoral College @webpagelink"}]
