[{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."},{"comment_id":"1537745819864402","commenter_b":"and that still doesnt make him legitimate to run. Even down here in Australia we know he doesnt qualify... Surely they havnt dumbed billy yankee down that much???????","commenter_a":"Boehner and Trump, best of buds...who would have thought?","post_message":"Ted Cruz just got the best endorsement he could ever get. He could not have gotten a better endorsement than he got out of John Boehner."},{"comment_id":"1266458500080562","commenter_b":"These articles consistently show how unbalanced a frightening amount of women are. Cheating should NEVER result in assault or worse. Never.","commenter_a":"Did he learn anything?","post_message":"She shot him in the groin for having an affair"},{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"10152976985741636","commenter_b":"some clothes are made smaller then others, i can buy jeans at one store that are size 14 i can go too another store that has jeans that are size 14, the same day and there too tight so my point is sometimes different stores vary greatly in size so you have to wear bigger sizes because of how they are made","commenter_a":"the problem with this story is this....the young girl was NOT directing her comment at anyone but the shirt itself. I am a larger sized woman and have done the same thing when I found clothes that were super large. It's not a slight to those who are larger than me and I'm sure it wasn't meant that way by this girl. If you are that sensitive by your size, then stay at home or do something about it. I have been called names my whole life because I'm not a size 2 or even a size 12. What others think of my size is none of my business. If they allow my \"size\" determine whether they want to know me or not, I don't care. It's their loss. I'm pretty freakin' awesome once you get to know me. I like me. I'm confident in who I am on the ...","post_message":"A photographer is getting a lot of attention after a picture in a dressing room went viral."}]
