[{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."},{"comment_id":"10154003017405575","commenter_b":"Liberal bitch!!","commenter_a":"The entire Clinton family needs to take their millions and go home and stay there.","post_message":"This should be a wake up call to the #NeverTrumpers. They're coming after your guns."},{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"1006685692721909","commenter_b":"hahaha, that's not what i had in mind! Just thought it was cool!","commenter_a":"@username Ali Sharp cool concept","post_message":"This is wonderful <3"},{"comment_id":"1762721907277999","commenter_b":"yes it is I don\"t care for her either but talking bout taking a life is wrong. weneed let goodLord dealall shes done doing. will answerto Him in the endnot us and he knowsit all. don\"t vote for her that simple","commenter_a":"Just remember: NASTY WOMEN VOTE!","post_message":"This is unacceptable. Period. I hope they track down the car's owner--and whoever made this bumper sticker.--Darrell"}]
