[{"comment_id":"928579767188091","commenter_b":"and by the time the police come the dog is probably dead by then.","commenter_a":"Whenever you take justice into your own hands you're committing a crime, call the police that's what they're there for and that's what we pay our taxes for, if we didn't pay the taxes to have those brave police officers do their jobs and we all win that round doing vigilante justice what we paying taxes for","post_message":"Charges against the veteran who was arrested for breaking a window to save the life of a dog left in a hot car have been dropped: on.hln.tv/2QzbEY"},{"comment_id":"957541017614653","commenter_b":"I think she's a class act!","commenter_a":"I like all three of the non professional politician candidates and Ted Cruise and Scott Walker.","post_message":"Whoa..."},{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."},{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10153709556991880","commenter_b":"Mario","commenter_a":"Maggie Urgupluoglu","post_message":"The city's five boroughs are filled with hidden spots."},{"comment_id":"982253175146252","commenter_b":"Surprised? Evil bitches!","commenter_a":"Wait until you need one...","post_message":"So their non-apology apology meant nothing? Color me shocked!"},{"comment_id":"10154871308810586","commenter_b":"Oh it was Bakersfield, now I get why it happened.","commenter_a":"Brooke, I bet this is my problem!!","post_message":"“They said it’s just fat, you’re just fat…it’s just fat developing there,” the man said of the benign tumor that doctors now believe likely started due to an ingrown hair."}]
