[{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."},{"comment_id":"900994056627010","commenter_b":"@username if it's their religion then they shouldn't have been lesbians in the first place but your comment speaks volumes about you","commenter_a":"Nothing to do with religion.","post_message":"Muslim lesbian and her vampire-loving girlfriend, then it gets weird"},{"comment_id":"10153692809021694","commenter_b":"\"there are people who care enough to find you\" Riverrrrrr??? D:","commenter_a":"@username :0","post_message":"We have so many questions, but we won't have to wait long for answers!"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"10153266988046636","commenter_b":"Nah that doesn't bother me, I'm a risk taker the rest of the time","commenter_a":"things like this make me nervous of going to London most weekends","post_message":"Police say they are treating it as a 'terrorist incident'"},{"comment_id":"1000558950003853","commenter_b":"Nope. But I've had enough experience with woman in business to know that they are always looking for some excuse to demand a refund, which they never get.","commenter_a":"this is how women are - always looking to steal back their money.","post_message":"He who pays the piper . . . doesn’t like him drinking"}]
