[{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"},{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."},{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"},{"comment_id":"10153579902226135","commenter_b":"I think it's illegal to drive while drinking whether or not you have a child in the car...","commenter_a":"What's her name? I want to see if she has a Facebook.","post_message":"Initially, the woman is seen on video wearing only a tank top and underwear. Police says she appeared sluggish and smelled of alcohol."},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"},{"comment_id":"1048491781950666","commenter_b":"thats the look we give when they let Kellanne dumbass talk..why they ever listen to that dumb blonde i will never understand..","commenter_a":"That is after barfing.","post_message":"So true!"}]
