[{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"},{"comment_id":"10153486672691336","commenter_b":"What do we have in place for allowing Muslims into the United States? I would like ALL OF THEM to be on a watch list. Same with anyone else coming here to settle. Also, what are we going to do with these illegals coming over our borders?? Until you are a United States citizen you should not be receiving benefits!!","commenter_a":"Why aren't race crimes punished on both whites and blacks? I know this question will not make it due to the fear of what will be said but it needs to be asked.","post_message":"What is YOUR one question for the candidates? Fox News and Facebook are teaming up to bring you the first GOP presidential debate. Submit your question in the comments below or click here: @webpagelink to upload a photo or video. It could be featured in the debate August 6th on Fox News Channel!"},{"comment_id":"10153939704691178","commenter_b":"With this huge influx of illegals and radicals the REAL AMERICANS are in danger of extinction , wise up Hollywood!","commenter_a":"Must have fallen fron his star ship and landed on his head.","post_message":"Kind of hypocritical coming from a guy who owns tons of planes."},{"comment_id":"10153255153245329","commenter_b":"Jason Winter you must","commenter_a":"@username eeeeee","post_message":"These dogs don't know what to do now."},{"comment_id":"10152701811618067","commenter_b":"What about Asians! We have more wealth than whites! ;)","commenter_a":"CNN thought process: Pot? Check. Ladle? Check. Add racial mixture. Add perceived racial sleight. Stir vigorously. Serve on CNN Special, \"[fill in gap] in America\"","post_message":"The latest report about financial inequality makes for uncomfortable reading... @webpagelink"},{"comment_id":"1753315408263301","commenter_b":"When u ugly as Fuck but because of your money u can fuck whatever hot girl you want! 😒😒😒","commenter_a":"😧we have become the laugh Hurd around the world..","post_message":"Nothing wrong with nude modeling, but could you imagine how they would scream if Michelle Obama had done this? Hypocrites..."},{"comment_id":"545764515614128","commenter_b":"Is she that dense ??","commenter_a":"If she was subjected to shariah law, she sold wished it never happen. Major mistreatment of women","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way.  What a disgrace. She needs to deported to the Middle East.  Do you think Nicole Kidman is a sell out?"}]
