[{"comment_id":"10156901332200192","commenter_b":"Roxann Bracken ,you are above this EVIL woman ,you do not need to justify yourself ,YOU ARE AN AWESOME MOM , I don't know how someone like this @username sleeps at nite !!!! when she has such evil thoughts , Maybe if she would have raised a better Son he wouldn't be an abuser and in Jail ....just sayin ......I love you and am praying for you","commenter_a":"Just because you live in a nice house doesn't make you a good mother Robert Jennings is the father of Clayton there's a lot of facts people don't know I just hope they keep the investigation up this is no accident this is neglect","post_message":"BREAKING: Pasco deputies found the body of a missing 2-year-old Hudson boy Wednesday night in a pond near his home."},{"comment_id":"1499235536803237","commenter_b":"Oh I am pissed, then the ones that need help, can not get it. And that lazy ass gets everything for free and that for 15 years. They should tell her to get her ass out and work, and stop spreading her legs.","commenter_a":"parasites","post_message":"Are you angry yet? Just listen to what she has to say about it!"},{"comment_id":"1682640372017419","commenter_b":"I'm not gonna even comment on this ignorant racist bitch 🤐","commenter_a":"'@username Sundae Vibes","post_message":"Anchor Upset Beyoncé Wants “An Overthrow Of White Domination'"},{"comment_id":"10154735713113132","commenter_b":"She lives for the fame..controversy and all.","commenter_a":"Why discuss this with tabloids? What does her children gain from it? That's private. Quit putting your kids out there to be vulnerable like this.","post_message":"Kate Gosselin is opening up about her son Collin."},{"comment_id":"10154166607743352","commenter_b":"Jail needed for sex scum","commenter_a":"Troubled ladies-counseling needed.","post_message":"What sort of school IS this?! Geography teacher is now accused of lesbian affair with teenager after two colleagues 'had threesome with boy'"},{"comment_id":"10153132641871051","commenter_b":"Wow marla racist much? What else can we minorities thank you whites for?","commenter_a":"REMOVE YOUR HEAD DRESS!!!!!I!!!YOU'RE IN MY COUNTRY NOW HABIBA!!!!!!❤","post_message":"The police told this woman: take off your head scarf or you’ll be sorry. She didn’t take it off."},{"comment_id":"1176769975734870","commenter_b":"Hell yes, it's about tyme someone stand up the the World Biggest Bully Obama, You Go Donald Trump.","commenter_a":"Trump is our only way out he is our only Vote we got to stay in touch @ all times","post_message":"Liberals are demanding that Donald J. Trump walk back his rhetoric against President Obama in the wake of the Muslim terror attack in Orlando. Trump isn't going to do that, though... he just doubled down and accused President Obama of TREASON.  This are Trump's most stunning remarks on President Obama yet. Do you agree with what Trump had to say?"}]
