[{"comment_id":"10155048729377235","commenter_b":"I cannot and will not even listen to this lying disgusting woman! I cannot watch her on TV for even three seconds, she makes me wanna puke!","commenter_a":"Oh shut up!","post_message":"The Trump administration just doubled-down on their attack on one of America's biggest allies."},{"comment_id":"992065330813220","commenter_b":"Nooo! Stay away from Tacoma. We don't need Seattlites messing up the city.","commenter_a":"Stay out of T-town jerks...you'll ruin it just like you ruined Seattle...","post_message":"#Seattle workers are moving from the city to #Tacoma -- in the search for more affordable living! [kiro.tv/SEAtoTAC] Do you think:   A. Seattlites shouldn't have to move, rent control please! B. This is making Seattle traffic worse.  C. Moving to Tacoma or a suburb is a good solution.  D. (Your own answer)"},{"comment_id":"10153479887206037","commenter_b":"There are no grounds to deny 3 women, 4 men or any number imaginable from acquiring a marriage license. Where does the number 2 come from?","commenter_a":"Good job supreme court! Whether you agree or disagree with same sex couples it is not our right to judge them. It is nobody on this earths right to judge anyone. May all same sex couples find happiness","post_message":"Follow our live blog for all the latest updates on the U.S. Supreme Court's #MarriageEquality decision."},{"comment_id":"10153130896422293","commenter_b":"Mosquitoes might be to blame if a bat runs afoul of someone's head: @webpagelink","commenter_a":"soooo why was the bat euthanized?","post_message":"Terrifying."},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"1021163441238000","commenter_b":"The next deaf girl I encounter will hear me cumming","commenter_a":"Lucy Truelove","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153858888594474","commenter_b":"Actually, she needs to go to jail.","commenter_a":"Not soon enough!!!!! We might get Hillary so it will just be like having Obama in the White House.","post_message":"Let the countdown begin. Share if you're ready for the end of the Obama era!"}]
