[{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"},{"comment_id":"10154047067166756","commenter_b":"I hope you didn't watch the trailer. Lol","commenter_a":"WARNING:This article gives out way to much information.","post_message":"Leonardo DiCaprio was part of a cast that didn't have to fake being freezing or exhausted during the eight winter months spent in the Canadian and Argentine wilderness. Still, all anyone wants to talk about is the bear attack, says NPR film critic Bob Mondello."},{"comment_id":"878088758974173","commenter_b":"I agree some people need to do there research on Noble Dru Ali.","commenter_a":"Nothing about that medallion is racist people are just uneducated and stupid!","post_message":"Jay-Z Stirs Outrage by Wearing Medallion of Racist Group"},{"comment_id":"10155071797057235","commenter_b":"@username Melania is smart. She's living in New York with her son and her parents. Trump isn't even home half the time. All she has to do is keep up appearances. Show up at the Inauguration and a few key events.","commenter_a":"Yeah. You don't even have to know him to know this was gonna happen. Just watch him for the last 20 years. Why didn't his family talk him out of it.","post_message":"The giant orange baby-man president hates his job. Nobody could have predicted this..."},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"989796557698481","commenter_b":"Women aren't human beings?","commenter_a":"women will die?????? really???? this is incredible... what about how many BABIES HUMAN BEINGS will die???????????","post_message":"Breaking ranks"}]
