[{"comment_id":"10155489129664657","commenter_b":"Not with a Republican Senate she isn't!","commenter_a":"as soon as these two women are no longer useful they will be out, they are pawns.","post_message":"Uh oh."},{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"},{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"10154602894018145","commenter_b":"wcjb tv 20 out of gainesville covers you daily too.","commenter_a":"Hardly news when you live in the Ocala area............and BTW, we are in YOUR viewing area and could use the same weather 'attention' that Orlando/Daytona/Melbourne get.....especially those of us in the rural area.....thanks","post_message":"MUCH colder weather is around the corner!"},{"comment_id":"10153913587481341","commenter_b":"@username The fact is Israel is the nation of Israel since the time of David , Palestinian come here from Syria and Jordan bf 48 , The Things there is no one to talk peace , PA are feeding the money from Eu countries by cover of charity organization , Some money go to Games to take care of the poor but the majority go to weapons against Israel , i'get u the gov link who provide evidence , but u still won't believe cause u are dreaming in Lala land","commenter_a":"Israel has no moral or ethical values. It only knows how to oppress and terrorise people.","post_message":"Canada will be a frank voice in the Middle East, even if it means criticizing Israel, said the country's new Prime Minister Justin Trudeau."},{"comment_id":"10153155797009205","commenter_b":"Kill the whole breed .","commenter_a":"Always have your concealed firearm in case one of these beasts attack.","post_message":"Pit Bulls Maul Multiple Men [GRAPHIC]"}]
