[{"comment_id":"976218969153516","commenter_b":"I hope she gets life in prison! She is a twisted individual! The other prisoners know how to handle child killers. She woo get what's coming to her then rot in hell!","commenter_a":"They all should die the very same way he did!!!!!!","post_message":"Rachel Bostian, one of three women charged with savagely beating five-year-old Alexander Stephens to death during a 22-hour abuse and torture marathon — one of the accused women the little boy’s own mom — pleaded guilty to murder and several other charges in an Ohio courtroom last Friday, according to a report in The Cincinnati Enquirer. But what led Bostian, 29, and allegedly her 26-year-old friend and Alexander’s mom Theresa Hawkins-Stephens, as well, to tie the little boy up for what... @webpagelink"},{"comment_id":"386115264910101","commenter_b":"She needs to die. She would never have gotten any place in this country without white people. I hate that racist trash.","commenter_a":"She sounds like she is mad at the world .","post_message":"Oprah plays the race card again..."},{"comment_id":"1813062615599826","commenter_b":"She was good at taking separate vacations and other unnecessary trips at taxpayer expense!","commenter_a":"Yes","post_message":"Yes or no: Was Michelle Obama a good First Lady?"},{"comment_id":"10156646291425093","commenter_b":"@username there is such a thing as legal immigration !","commenter_a":"You traitor establishment Repubicans are a discrase. Donald Trump for President of the United States","post_message":"Donald J. Trump wasn't against  interests. He was special interests -- and did his best to run people out of their own homes."},{"comment_id":"934836243223515","commenter_b":"Take the cop dick out of your mouth, June. It's not a good look for you.","commenter_a":"This is ridiculous! Officers, please forgive the Mayor for having a more \"balanced\" perspective, because of the diversity of his family. He is in a unique position to be able to \"see both sides.\" It would behoove you, officers , to learn something from him and his family!","post_message":"America has told the NYPD in no uncertain terms that using a funeral to make a political point is not okay, and they just did it again."},{"comment_id":"10153639148511656","commenter_b":"Girl! Lol.","commenter_a":"Uhm... Hmmm...","post_message":"In the lawsuit against Kendrick Lamar, the woman alleges that she met with the rapper in Philadelphia and the two  for like two hours, over the course of which they  a deep conversation."},{"comment_id":"10153606250119778","commenter_b":"You look beautiful and happy!!! Congrats to you!!","commenter_a":"Stupid","post_message":"A woman vowed that she'd marry herself if she hadn't found true love by 40. And for her 40th birthday, that's exactly what she did."}]
