[{"comment_id":"1048840968488441","commenter_b":"Or is the environment of higher education overwhelmingly dominated by dogmatic liberal and neo-progressive worldviews, while openly and often aggressively shunning anything resembling 'conservative.'","commenter_a":"You're imposing some causality here, @username... Does education make people more liberal? Or do people with liberal tendencies put a higher value on education?","post_message":"One possibility might be the growing numbers of women (who tend to vote for Democrats more than men) getting college and advanced degrees."},{"comment_id":"1701571813463264","commenter_b":"Carly without a doubt!","commenter_a":"No question Carly","post_message":"Poll: Who Would Be A Better President, Carly Fiorina or Hillary Clinton  (A) Carly Fiorina (B) Hillary Clinton"},{"comment_id":"1120776417932667","commenter_b":"Whoop-te-do! What an earth-shattering piece of news that is! One loser endorses another loser... ho-hum.","commenter_a":"the end of Jeb","post_message":"Lindsey Graham endorses Jeb Bush for president"},{"comment_id":"1669850779963439","commenter_b":"Fat bastard","commenter_a":"Another big jerk, oh bye the way michael were not muslim","post_message":"CLOWN SHOW."},{"comment_id":"1073692496071264","commenter_b":"She's a POS !!!!!","commenter_a":"hahaha love this dude","post_message":"'[Hillary Clinton] keeps saying that we need to move slowly on this. Someone give her a Red Bull, because the wolf is at the door – the wolf is chewing through the door.' – Sheriff David Clarke on fighting Islamic terror threat"},{"comment_id":"349993335204181","commenter_b":"Since nobody will charge her with anything, she is above the law","commenter_a":"Yelp the Clintonss. Obama .Kerry's .. all do.","post_message":"Rand Paul says Hillary thinks She Above the Law"},{"comment_id":"10154539619803433","commenter_b":"he has never cared about facts, just rambles, surprised that so many people are taken in...oh wait many people were taken in by Hitler also, very similar","commenter_a":"Trump, pay attention; you are wrong!","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"}]
