[{"comment_id":"10154371662414117","commenter_b":"This will make it easier to build a wall. Then Mexico can invade and get back it's land.","commenter_a":"God I hate my damn State.","post_message":"The people who are pointing to CalExit as a possibility have little grasp of either the demographics of the state, nor its actual finances. It is oblivious to the fact that the non-coastal parts of California are similar to the non-coastal parts of the rest of the United States. It is oblivious to the reality that the state's financial crisis is due to overspending within California and not because they're sending money to D.C."},{"comment_id":"908907002538886","commenter_b":"Kool aid Oh Yea...","commenter_a":"Lol I love my president. ✊🏾","post_message":"“Bernie Sanders might run… apparently some folks really want to see a pot-smoking socialist in the White House. We could get a third Obama term after all.” - President Obama at the 2015 White House Correspondents' Dinner"},{"comment_id":"10153436086986509","commenter_b":"She's a crooked, unethical liar.","commenter_a":"Hillary Clinton seems to irritate all Republicans. I don't understand their problem is it because she's strong, smart, not afraid to speak her mind?","post_message":"While Hillary Clinton isn't the first secretary of state to use a private email address, she is the first to exclusively use a private account during her tenure: @webpagelink"},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"},{"comment_id":"10154133163039032","commenter_b":"Ohhh waaaa, namecalling hurts soooo bad, better to be a pig and be free than to be \"hip\" and be a socialist. Again libtards are so out of touch with reality its scary, you all hate this country and the constitution but yet none of you have lived in anoyher country to compare. Like I said, try living in China or Cuba, or Greece, or Russia if you all think big government and socialism are so great. Btw, name calling and insults mean nothing.","commenter_a":"To the guy with \"the america was never great\" sign, why don't you go live in another country for awhile and then come back and waive that sign. Scary how delusional some people are.","post_message":"Music, signs and lots of confrontation between Trump protesters and rally attendees in Prescott Valley. @webpagelink"},{"comment_id":"618134845039685","commenter_b":"It's about time, defund them and get them out of the country.","commenter_a":"Make it so! Move this anti-American institution offshore!","post_message":"Have Obama and the UN finally gone too far?"},{"comment_id":"10153197051250329","commenter_b":"Lol that's like half of us @username","commenter_a":"Kimberley Stefan","post_message":":/"}]
