[{"comment_id":"10153387831771336","commenter_b":"It's like when people are drowning we add more water.","commenter_a":"No stricter gun laws won't work. I know!!! Let's keep throwing more guns into the mix! More guns and LESS strict gun laws will definitely solve this!","post_message":"\"If it can happen in church, it can happen anywhere, so there’s no answer to it. You can't predict when evil's gonna show up.\" – Toby Keith"},{"comment_id":"1253710404722011","commenter_b":"@username you nailed it","commenter_a":"Actually, it's bullying - in his case, you know he would be doing just the same to a male competitor. I believe sexism is a river that runs through him, but I see a ogre of a bully when I see him...","post_message":"TRUTH. Thanks to Hostile Politics."},{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"},{"comment_id":"956349277815184","commenter_b":"To keep the bad guys out.....Tear down that wall and invite them in.","commenter_a":"This is why liberals suck, do as I say not as I do.","post_message":"ClashDaily.com"},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"},{"comment_id":"690224757750904","commenter_b":"the only parasites and thieves are the palestinians and hamas","commenter_a":"Nice for starters!","post_message":"The US House of Representatives Armed Services Committee has approved $474 million for Israel’s anti-missile systems."}]
