[{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10154101126057680","commenter_b":"That's why we as black folk don't claim her ass! She can take a seat over there with O.J. and Tiger Woods!","commenter_a":"She is going straight to hell for stating people will BOW DOWN to that clown. Who talks like that????? OMG! Sad part about it ... she's oh, so serious. smh This chick needs to be mentally evaluated. Clearly, the elevator doesn't reach the top floor in that screwed up head of hers. Delusional is an understatement! She is so embarrassing ... :(","post_message":"Omarosa Injured at the White House, Reportedly Rushed to the Hospital on a Stretcher"},{"comment_id":"915434395182976","commenter_b":"As a mom myself, I agree with you Ben. How much did she actually ingest if she took a sip and said it tasted funny?","commenter_a":"Clearly this is not cool, but accidents do happen in life. She drank a tiny amount of watered down sangria, not methylated spirits or even vodka. I think the parents are massively over reacting. I would be angry, but come on, a few sips of cheap wine mixed with orange juice is not going to kill a small child.","post_message":"She was rushed to the hospital drunk"},{"comment_id":"1134898503249901","commenter_b":"That's supposed to make me want to vote for her?????????","commenter_a":"From a Bernie Delegate: A hard day for most of us. I have contacts within both campaigns. Here what I was told yesterday and today. Clinton campaign to vote down every concession made to Bernie on the platform if he did not endorse her prior to the convention. Knowing that Superdelegates were not going to switch to his side without something major happening, the best he could do was hold on to the progressive concessions he won for US on the platform. He could not, in good consciousness let the GOP and Trump win, especially when we have a potential half of the Supreme Court Justices that will be replaced within the next 4-8 years. He was looking out for the future of our movement and our nation in this very hard decision he made. This post is not to tell you to vote for Hillary, or to not leave ...","post_message":"In the coming weeks, I will be announcing the creation of successor organizations to carry on the struggle that we have been a part of these past 15 months. I hope you will continue to be involved in fighting to transform America. Our goal will be to advance the progressive agenda that we believe in and to elect like-minded candidates at the federal, state and local levels who are committed to accomplishing our goals."},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."},{"comment_id":"10155044912398010","commenter_b":"Trump doesn't want any more tunnels, after he builds his wall.","commenter_a":"Maybe it is true? Trump appointed him to head the DEA and he is going to pay for the wall??","post_message":"The Sinaloa cartel boss was recaptured a year ago after his second jailbreak."}]
