[{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"},{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"1284672578275634","commenter_b":"The woman is Wacko !!","commenter_a":"And so are the Subpoenas!","post_message":"Six weeks after the election, email leaks are plaguing Hillary Clinton."},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."},{"comment_id":"1293464810706279","commenter_b":"Foolish talk from a foolish woman","commenter_a":"Try retraining the dumb crooks and thugs!","post_message":"@webpagelink"},{"comment_id":"10154139350608132","commenter_b":"She needs her original face back. She looks just like thousands of other women who have paid to look like Jack Nicholson's version of The Joker.","commenter_a":"For the love of God, someone give her a sandwich...stat!","post_message":"Patrick Dempsey's plans for divorce are now off the table."},{"comment_id":"10153963839661782","commenter_b":"Why is it ok for the woman to hit him ?","commenter_a":"Not ok you POS","post_message":"BREAKING: A video that shows Oklahoma running back Joe Mixon punching a woman two years ago has been released. We want to stress that this video might be disturbing. We are showing it to you in an effort to be transparent. Click on the link to watch the video now: @webpagelink"}]
