[{"comment_id":"10153053153366717","commenter_b":"I can't believe how selfish this woman really is! How can she make a whole office and try to make the whole county think the way she does?! She gives no condition the others in her office that have to work under these stressful conditions. Amazingly selfish. God must be so proud.","commenter_a":"The Devil is your boss and no she is not going to let this die","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"881686708534340","commenter_b":"Still doesn't eliminate the fact that your router has been hijacked.","commenter_a":"Ad Block Plus add on for Chrome and Firefox","post_message":"If you're seeing scammy ads on legitimate sites, hackers may have gotten to your router."},{"comment_id":"1512943285667077","commenter_b":"While ur asses get your alcoholic drinks!","commenter_a":"'@username hahaha","post_message":"'Is there free food?'"},{"comment_id":"1361756670528336","commenter_b":"Vengeance is mine saith the Lord.","commenter_a":"Disgusting and low class","post_message":"More tolerance from our friends on the left."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx ' you big dummy '","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"1016134701742911","commenter_b":"'@username OK as soon as I take mine out of a white woman's mouth","commenter_a":"I not very religious, but I stand with them. Obama will have you believe this country was found on Islam. I'm a proud American that enjoys the mention of God on my money, the pledge and so forth.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153416517971051","commenter_b":"She should not face any charges. She protects her child.","commenter_a":"You go girl he got off easy","post_message":"When this wife discovered what her husband did to her 7-year-old, she set him on fire."}]
