[{"comment_id":"1488225507869622","commenter_b":"LOSER !!!","commenter_a":"Good should have done that long time ago","post_message":"HAHA! He's FIRED!"},{"comment_id":"10152658419777894","commenter_b":"Girl Bye!! Bitch Please!! #DelusionalWhore","commenter_a":"Get her life....","post_message":"Say What Now? Joseline Hernandez Says She 'Knows for a Fact' that Cookie Lyon from 'Empire' is Based On Her [Video]"},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"870644459698474","commenter_b":"Hillary will win. I'll take more Clinton any day.","commenter_a":"That is disgusting! They just don't get it! We don't want another bush! But their greed will get the better of them!","post_message":"Getting closer to announcing?"},{"comment_id":"693471650843413","commenter_b":"Yes they should be deported!","commenter_a":"Yes it should!!!","post_message":"Unbelievable fate for this liberal that disrespected our flag. This man will never be the same. Should burning the flag be grounds for deportation?"},{"comment_id":"10153880559652411","commenter_b":"I hate to see what she did when she got home!! Poor Billy run bill run!!","commenter_a":"Trump won hands down. Put her on the defense from the beginning and she stayed there. She just gave America that fake smile like she always does and then pretends everything is just perfect. Give me a break! I know she was extremely angry with some of the truthful comments Trump was saying and I could see that in her facial expressions. If it wasn't for the liberal media Trump would be miles ahead!","post_message":"#KenBone's overnight fame was fueled by his snazzy red sweater, white shirt-tie combination, his thick mustache, his disposable camera and of course, his catchy name, according to social media."}]
