[{"comment_id":"1755814751326418","commenter_b":"Not my words but totally agree. Found this on another FBook site. VOTE YOUR CONSCIOUS NOT YOUR PARTY! Don't be influenced & persuaded, been going on far to long. WHY WOULD YOU VOTE FOR HILLARY WHEN.... Most cover ups & lies by a family in America's history. If you are #Gay, why are you voting for Hillary when she wants to bring in 1,000's of refugees that believe all Gays should be executed? Criminalizing Christians who don't believe this? If you are #Black, why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood when they want to abort as many black babies as possible. Exterminate the black race because they are like \"weeds\". Most of those clinics are in Black neighborhoods? If you are a #Christian, why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his ...","commenter_a":"Can even stand to listen to her! *wave*","post_message":"Watch: Hillary Clinton speaks during a campaign rally."},{"comment_id":"10154888986680579","commenter_b":"Build that wall..","commenter_a":"Where will he get the money if he cuts taxes with our huge debt? Borrow it?","post_message":"Military Only: Your choice for 2016?"},{"comment_id":"1584390601848053","commenter_b":"12 years old. She looks 30 !","commenter_a":"Of course she sings well.....her mother is FAITH HILL!","post_message":"Wow. She is incredible. Just like her mother!"},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"},{"comment_id":"10153697157652098","commenter_b":"THIS ARE MAMA'S KIDS THEY NEVER DON NOTHING BAD, NO DRINKING, DRUGS, ROBE, HURT OR KILL SOMEONE, WHY THE POLICE DON'T SHUT ALL OF THEME ON THE SPOT, TAKE THEIR CARS AND NEVER LET THEM COME OUT OFF JAIL. EVER. BUT THEY GOT MORE WRITES THAN YOU OR ME. UNTOUCHABLE. IF YOU TOUCH THEM THE STUPID PROTEST WILL START.","commenter_a":"Nancy Jovana","post_message":"VIRAL VIDEO: A CHP vehicle was vandalized as an East Bay sideshow took place... DETAILS & FULL VIDEO: @webpagelink"}]
