[{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"840187412685267","commenter_b":"How about no sex till your married. No need for pills or protection. Problem solved","commenter_a":"you can't fool Mother Nature","post_message":"New commentary from Matt Walsh on birth control. \"Where is the feminist outrage when you need it?\""},{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10152837029192894","commenter_b":"I do the housewives should be married","commenter_a":"I kinda have to agree @username what do u think ?","post_message":"NeNe Leakes Says Bravo Should Get Rid of All the 'Unmarried' Housewives -- Do You Agree?"},{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"},{"comment_id":"10153793456236336","commenter_b":"@username, actually I am quite the opposite. I believe that a 17 year old, is not a child anymore. I believe in raising kids to respect authority not defy it. I believe in order for people to succeed in this life, they need to learn to communicate appropriately and in the correct place. This punk did none of the above and she challenged because she thought she could control the authorities in the room. There was no brutality here at all and what the Officer did probably stopped the room from erupting in violence. Go watch @username's video and read the story. It may teach you something. Hopefully, this thug learned something from all she went through, but somehow I doubt it.","commenter_a":"I watched the entire video. You had a belligerent girl who refused to put away her cell phone. She was mouthy to the teacher, the principal and then the officer was called. He asked her nicely to obey. She refused to follow his orders even after being asked several times. He went to take her out of the chair, she hung on. He did not body slam her, as reported and actually she came out of the chair pretty easily. It just looked bad because the chair fell over. The officer was completely correct and the girl was completely wrong. They better clear this officer or they will be sending a very bad message and more kids or punks as the case may be, won't listen to their teachers either. Chaos will ensue in the classroom and order will be totally out the window.","post_message":"Do you think this is a case of excessive force or lack of respect for authority?"},{"comment_id":"10154232027346491","commenter_b":"Tom....amen","commenter_a":"PRESIDENT DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA...EVEN THOUGH obama DIVIDED MORE THAN ANY SITTING PRESIDENT... SHOW YOUR BIAS time mag...THAT'S WHY YOUR PART OF HISTORY, AND NOT FOR THE PRESENT !!!!","post_message":"How TIME Person of the Year runner up Beyoncé went from pop star to political force. @webpagelink"}]
