[{"comment_id":"10154396026094714","commenter_b":"Hey woman need your number","commenter_a":"Angie Slater.... awesome words for you","post_message":"\"A strong spirit transcends rules.\" — Prince #RIP"},{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"10153209724819575","commenter_b":"You guys do understand that chickenpox is much worse and more dangerous to adults than children, right? And what about those babies who are too young to be immunized? The point is to vaccinate your children so that diseases like \"only chickenpox\" can be eradicated!","commenter_a":"OH MY GOD ITS THE END OF THE WORLD! Fear porn at it's finest.","post_message":"Carmel Clay Schools sent a letter to parents explaining that cases of chickenpox had been confirmed. The school system has not revealed the amount of confirmed cases."},{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10153729819244753","commenter_b":"if miley cyrus is taking her place i will not watch the voice no more, she is trash","commenter_a":"I will no longer watch he voice with Miley Cyrus on it.","post_message":"Christina Aguilera will not return to The Voice for season 11, and ever since the announcement was made official, rumors have swirled, claiming the “Genie In A Bottle” singer’s alleged feud with Gwen Stefani and Blake Shelton may be to blame. In a recent report, it was alleged that Christina Aguilera’s feud with her co-stars had gotten so ugly that she had actually enlisted Miranda Lambert, the ex-wife of Shelton, to help her get back at them. “[Christina Aguilera’s] feud with Stefani is... @webpagelink"},{"comment_id":"1122159437825214","commenter_b":"Hillary is only qualified for prison , Americans that vote for her are idiots, wake up !!!!","commenter_a":"That is how politicians make their fortunes. Crooked Hillary should not get near the White House. Who knows what she will continue to do; she believes she is untouchable.","post_message":"TREAT PEOPLE WITH DIGNITY? HILLARY TAKES MILLIONS FROM REGIMES THAT BRUTALIZE WOMEN & LGBT RESIDENTS: What Clinton said today, \"If you believe as I do, America values hard work and treats people with dignity and offering everyone the chance to live our dreams and cares for those in need, well, the formula for America's success have always been that we are stronger together.\" Versus Behind closed doors, Hillary Clinton uses State Department access and favors to rake in massive sums of money from some of the most oppressive regimes on planet Earth. “Rarely, If Ever, Has A Potential Commander In Chief Been So Closely Associated With An Organization That Has Solicited Financial Support From Foreign Governments.” “Rarely, if ever, has a potential commander in chief been so closely associated with an organization that has solicited financial support from foreign governments. Clinton formally joined the foundation in 2013 after leaving the ..."}]
