[{"comment_id":"810160139094199","commenter_b":"guns? what guns? we aint got no stinking guns. Now lets play hide and go seek...","commenter_a":"And hopefully this is what ends up being her downfall","post_message":"Band-aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts..."},{"comment_id":"1751080988447451","commenter_b":"FUCKING IDIOT!","commenter_a":"Tyler Steinle","post_message":"You should be VERY careful with things that go BOOM!"},{"comment_id":"1005620852830996","commenter_b":"Of course the wives are to blame! Sad that she hunts for weak married men because clearly she can't find one of her own! See picture !","commenter_a":"Correction - the person going out of their way to cheat is to blame for not trying to fix any problems their relationship may have, for not giving their partner a chance and lying. Women like her who go with men knowing they're are married give the rest of us a bad name, she should be ashamed of herself, coming out with drivel like that just proves she has no morals and is kind of desperate for any male attention, but she is not completely to blame here either. Fix what's wrong in your relationship and if it's unfixable then leave, DON'T CHEAT.","post_message":"Woman who has had 100 affairs with married men blames their wives"},{"comment_id":"1187297661307572","commenter_b":"'@username well, fair enough. Lol.","commenter_a":"The comments here have be idiotic, as I expected. Most likely, this was an attack due to their religious identification. I love how when the victim is not Muslim, these (commenters here) jump to radical Islam. However, when a Muslim is the victim, they want to wait for the facts and not jump the gun. Can't have it both ways.","post_message":"Shot in the back."},{"comment_id":"588617174663431","commenter_b":"Hillary Clinton is a criminal!","commenter_a":"Republican's are the enemy of millenials. They have been ruining America since before we were born. It's time to vote blue and vote for Hillary. We need to stand up against hate and bigotry. #Hillary2016","post_message":"'And believe it or not there are even some Republicans in Congress who have already said they want to start the impeachment process,' President Obama says."},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"},{"comment_id":"10153400582321051","commenter_b":"She's a bitch? Really???","commenter_a":"Have fun in jail bitch","post_message":"When this man's wife discovered he was cheating on her, here's how she decided to handle it."}]
