[{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"974047066004855","commenter_b":"These tanks could easily create the blast heard around the world. Should that take place, this nation will erupt in a revolution unseen for hundreds of years. The resident of the white house should have his escape plan worked out because We the People will coming to evict him and his whole family .....and his mother in law too......!!!!","commenter_a":"Be afraid, be VERY afraid!!!!!","post_message":"FBI ON ALERT: Theft of dozens of propane tanks, purchase of 150 prepaid cell phones  [READ MORE]"},{"comment_id":"1140721385968332","commenter_b":"I like her filthy mouth. Filthy mouths FTW!","commenter_a":"Hardly a roll model really. She's got a filthy mouth.","post_message":"\"We have to be a role model for these little girls, because who do they have? All they have, literally, is the Kardashians!\""},{"comment_id":"1251187991558679","commenter_b":"And a woman who should be in jail should disqualify to...","commenter_a":"This alone should disqualify this poor excuse for a human being from ever getting close to the White House.If I was the parent of that reporter who was mocked I would hurt down Trump and slap the shit out of him.And you can take that to the bank.","post_message":"This tells you everything you need to know about Donald Trump."},{"comment_id":"1164001233718693","commenter_b":"Come on bitch follow the dress code","commenter_a":"Justin Drake pleaaaaase go off on her for being annoying","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"475937869263460","commenter_b":"what drug is she on these days? Think she's lost it in her old age....","commenter_a":"yes christian should pray all the time","post_message":"Parton delivers strong message to christians everywhere.  This is out of line, we need to show her that this type of public disrespect is unacceptable.   Do you agree that christians should be able to pray in public?"}]
