[{"comment_id":"10152653855300950","commenter_b":"Good! That mother is a monster!","commenter_a":"I don't know that it's child abuse, so much as poor parenting. Different religions physically discipline their children, pursuant to their faith - there's a line where it become child abuse, but I don't know that that threshold has been met. As to the poor parenting - yeah, she really should not have done this. Humiliation of a child is not ever going to be the correct form of discipline. And, it will likely result in later life issues. This is a private matter, which should have remained in the home. If the girl had friends, then they should have been told in private, not through a public shaming. And I would hope the mother focuses less on the letter grade and more on the actual learning. If your child thinks that \"allowed\" and \"aloud\" are the same thing - your problem is bigger than you realize.","post_message":"A mother is facing child abuse charges after she sent her daughter to middle school wearing a \"public shaming\" t-shirt for getting \"F's in all of [her] classes.\""},{"comment_id":"10153696766386159","commenter_b":"Blue laws are state laws or local laws that regulate in state commerce and are not the purview of the Federal Government. Few states have Blue Laws any more. In our state, only alcohol (package sales) are banned and that decision is made locally - not by the state. We have dry counties and dry townships. That decision is made by local residents.","commenter_a":"Freedom OF religion is also freedom FROM religion.","post_message":" United States of America did not create religious liberty. Religious liberty created the United States of America."},{"comment_id":"1069739979818471","commenter_b":"I thought she'd be gone by now! How the F can they relect that bitch!","commenter_a":"This lady can hide her own Easter Eggs...","post_message":"Folks, Pelosi is at it again..."},{"comment_id":"630794597099043","commenter_b":"Jill is Anti TPP! TPP protects corps who want to outsource american jobs!!!!!!","commenter_a":"Yay","post_message":"We’re here with Green Party candidate Jill Stein and her running mate, Ajamu Baraka to take your questions ahead of tonight’s #GreenTownHall. Please submit your questions in the comments section below. Tonight's Green Party town hall starts at 9 pm ET. @webpagelink"},{"comment_id":"10154051789570326","commenter_b":"There ARE alternatives for oil. There is NO alternative for clean water.","commenter_a":"Tell it to the people in Arizona . . . How'd you like this coming out of your tap? @webpagelink","post_message":""},{"comment_id":"387550718099889","commenter_b":"That is a good point.","commenter_a":"It's time to blame and hold congress accountable for allowing him to stay in office.","post_message":"I cannot believe it..."},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\"  Read on in The New York Times Opinion Section."}]
