[{"comment_id":"1021881241225156","commenter_b":"@username bildim niye chocolate sevirsen :D","commenter_a":"Turkan M. Devrijova, @username duz deyirmish :D chocolate is good","post_message":"People who love chocolate are more likely to be clever"},{"comment_id":"10154140633222093","commenter_b":"cash him ousside howbow dah?","commenter_a":"Loss prevention people were sleeping on the job.....ha","post_message":"ARE YOU HAPPY TO SEE ME? Man steals guitar by stuffing it in pants, walking out of Fort Worth store... @webpagelink"},{"comment_id":"652310991589660","commenter_b":"LMFAO. Stupid dumb Bitch.","commenter_a":"@username i can see u doing this. so smart of him","post_message":"When the mother who was in line behind him refused to do anything about her loud, obnoxious child, this man decided to take matters into his own hands."},{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"},{"comment_id":"1059210544118408","commenter_b":"Ramos is a Mexican so he won't listen to reason. When we lived in Temecula, Ca., our Mexican neighbors next door would go down to the Mexico/San Diego border & pick up illegals & bring them up to live in their garage!!! So I know firsthand what goes on at the border!!!","commenter_a":"Immigrants aren't the root of this country's problem. #scapegoat.","post_message":"Do you agree with Bill O'Reilly here?"},{"comment_id":"10153463508245950","commenter_b":"@username thats your opinion, but if she makes president, guess what....WERE FUCKED even more!!!!","commenter_a":"I'm not a Clinton supporter, but well said. Hillary's maturity and eloquence are refreshing after listening to Trump and the rest of the GOP schoolyard clamor.","post_message":"Donald J. Trump has \"incited this violence over months,\" Hillary Clinton says; watch the Democratic candidate's interview with Nancy Cordes: @webpagelink"},{"comment_id":"1405783259444718","commenter_b":"Nothing will be done. The past muslim made sure plenty of others were in charge before he left to keep it that way.","commenter_a":"I remember last year someone was sentenced pretty harsh for putting bacon on the door handles of a mosque. They called it a hate crime. Let's see what they do about this if they even do anything at all! Sickening","post_message":"Can you imagine the outcry if something like this had been done to a mosque?"}]
