[{"comment_id":"1452387791451811","commenter_b":"until they bring in these terriosts refugees here watch diseases spread","commenter_a":"Not vaccinated your all welcome","post_message":"Antivaxxers, don't fuck this up for us."},{"comment_id":"10153294760143984","commenter_b":"Who gives a flying flip of these two self serving godless people? They are both the horse's ass and should be ignored! !!!","commenter_a":"I wonder how it got that way ???????","post_message":"It seems as though Wild Bill's love life wasn't the only thing that was out of control in the White House during the Clinton's tenure..."},{"comment_id":"10153394569638984","commenter_b":"What's her problem. Can't she walk straight.","commenter_a":"Crook ( I mean acorn or nut ) probly isn't far from the tree","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim...  Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"1081326848578752","commenter_b":"Should have been impeached a long time ago. I will believe it when I see it","commenter_a":"No I don't agree on that or anything he ever says. He should have been gone a long time ago.","post_message":"Former House Majority Leader Tom DeLay told Newsmax TV  that if President Barack Obama implemented a plan to require background checks on some gun sales by executive order and without congressional approval, the House should consider impeachment proceedings. Like, Share and Vote in Newsmax’s online poll: Do you support Obama’s gun control? Respond here: @webpagelink"},{"comment_id":"10153479315413984","commenter_b":"2 wonderful women !!! just shoot me now....","commenter_a":"Thank you Bristol ! Well said. We all need to start standing up to these people.","post_message":"BOOM! Bristol just dropped a major truth bomb on Miley, and there's NO way she can argue the young Palin's point...  Do you agree with what Bristol Palin said here?"},{"comment_id":"10154116667236002","commenter_b":"If this is true (drowning and family defense) she and her family need to be removed from the gene pool","commenter_a":"If people witnessed her letting her children drown, why didn't they help them?","post_message":"The family of a Texas woman accused of allowing three of her children to drown in a swimming pool is defending her."},{"comment_id":"10153145036396167","commenter_b":"Maybe a big dick up there asses just makes them crazy!! It drives my ex-wife batty!! ha!! B|","commenter_a":"The violence wasn't connected with his homosexuality but it's pretty common for gays, particularly gay men, to be mentally unstable.","post_message":"Seriously, CNN?"}]
