[{"comment_id":"1835608856683220","commenter_b":"What shut the fuck up","commenter_a":"Nazi Supremacy! Disgusting Asshats!","post_message":"The university stated that Richard Spencer's views are 'in direct conflict with our core values.'"},{"comment_id":"1360247024053830","commenter_b":"Get these bastards out of our country they are worse than maggots","commenter_a":"Ship her sorry ass back to the Middle East. She will be the one spit on.","post_message":"This Muslim did something absolutely SICK to white Americans at Walmart... She's now facing hate crimes charges over this... wow."},{"comment_id":"1174959735872779","commenter_b":"They reported that in Oklahoma only Blue Cross/Shield was still in it and that they will be dropping out as well.","commenter_a":"I hope so...","post_message":"It's official!"},{"comment_id":"10153405463063132","commenter_b":"5 year cancer survivor right here. I flew everywhere, because I didn't want to stay at home alone, my guy is a commercial pilot and I can fly for free..so why not?Because my cbc count was low, I had to fly with a mask on, because I had to. I even flew on Alaska airlines from Denver to anchorage. I believe this to be an isolated incident...I was always treated with dignity and respect and allowed to go down first because I said I felt weak..Because I did! So tell me what's the difference between if an elderly person says they feel weak and a cancer patient says it?","commenter_a":"Dear America, your bottom line is not more important than common courtesy or basic human rights.","post_message":"\"We need to make sure that ... corporations aren't so concerned with liability and bottom line that they overlook common sense and common decency.\""},{"comment_id":"452813904909190","commenter_b":"Why doesn't the women who complained go back to Africa? Why walk over our freedom of expression?","commenter_a":"Yes","post_message":"Do You Support This Woman's Refusal To Remove Her Flag?  Comment 'yes' or 'no'."},{"comment_id":"631371687022892","commenter_b":"What a chump","commenter_a":"Doesn't it make you wonder what Trump is holding over these guys?? I'm so dang curious but it will be years before it seeps out.","post_message":"\"After months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald J. Trump.\""},{"comment_id":"587298078081643","commenter_b":"You dumb bitch","commenter_a":"Pasco ain't little","post_message":"That sort of puts things in perspective, doesn't it?   @webpagelink"}]
