[{"comment_id":"10153578637147235","commenter_b":"How much you wanna bet that this nut case is a conservative?","commenter_a":"1st class white privilege on display. We'll get you and your little dog, too!","post_message":"This is insane!"},{"comment_id":"1082383445115167","commenter_b":"Looks like a Transvestite Alien. Brucelyn Jenner looks better","commenter_a":"A new level of trashy. Way to be a good role model (insert slow clap)","post_message":"DAMN, TAYTAY!"},{"comment_id":"10152586371551135","commenter_b":"This is unacceptable. We need to stand up and love one another despite differences! Isis has definitely scared a lot of people. It would be nice if the Muslim community would make a statement in response to the killings around the world. Just to declare they are different of the terrorist and that what Isis has done is wrong. Then I think there would be a better understanding of Muslims. But even still there will remain evil people , like this man at Kroger. I'm constantly praying for our world. The world needs love. The world needs God. Blacks against whites. Whites against Arabs. Muslim against christian. Oh God help us all!!!!!","commenter_a":"Kelly Sleiman!!!!!","post_message":"Dearborn Police are investigating the beating of an Arab American man inside a local grocery store.  Police have also contacted state & federal officials to help investigate the attack.  STORY: @webpagelink"},{"comment_id":"10153572357110667","commenter_b":"Penny Henderson can you imagine all the hysterical women...","commenter_a":"There are no wrongs or rights in that situation.. But... I wish everyone had gone quiet and not screamed out, if everyone was silent I wonder would the animal have behaved differently.. Just a thought.. And if the animal was not scared by the screaming, perhaps a tranquilizer shot could have been used... Perhaps we need to have some strict guidelines for us humans visiting zoos,","post_message":"If a tranquilizer dart, which takes five minutes to 10 minutes to work, had riled Harambe, the child might have been killed. Imagine the uproar then.  More from USA TODAY Opinion:"},{"comment_id":"10153878198208984","commenter_b":"Decrepit old Hellary needs her fatA$$ ship sunk already!!! DESPERATION makes her even uglier!!!","commenter_a":"everything about this bitch is fake.","post_message":"Wow. Hillary is in a rough spot, and what was just revealed will NOT do her any favors. I knew she had sunk low, but I didn't realize she was this low...  Do you hope Hillary loses in 2016?"},{"comment_id":"659550864214259","commenter_b":"#lastword","commenter_a":"@username @username This is so true!","post_message":"How true is this?  Thanks to www.republicandirtytricks.com"},{"comment_id":"2180394368851633","commenter_b":"I saw this same exact comment today😂","commenter_a":"I am confused why people telling me they voted for trump somehow grants them some sort of mythical powers now that they think they didn't have before. It was a vote, not a sword delivered by the lady in the lake.","post_message":"This lady clearly has deeper issues!  #WSHH"}]
