[{"comment_id":"1744837412449340","commenter_b":"that depends upon whether they can pass a rigorous background check.","commenter_a":"\"Absolutely!\"😎👍🏽","post_message":"Do you think lawful, gun-owning citizens make America a safer place?"},{"comment_id":"539209459602967","commenter_b":"why is everybody bendind over backwards for the muslims what about us true blue white americans everythingis for the forenners","commenter_a":"I dont understand why muslims are even here to begin with. Do they really think they are going to come to america and take our country? Good luck with that is all i have to say. They need to go back to their own country and worry about their own people and keep their crazy Godless religion to themselves. WE'RE NOT INTERESTED AND WE DONT CARE!","post_message":"Burger King just bowed to Muslims in this sickening way.  This is such a joke. They just lost our business forever.  Will you support Burger King after finding this out?"},{"comment_id":"10153293762581037","commenter_b":"Jack, most straight couples procreate. Those who don't are a minority. Marriage rights are supposed to encourage people to procreate so we have The Next Generation. It's just a matter of practicality. If you want to be gay, go be gay. No one is stopping you from being gay.","commenter_a":"Wow....she is EVIL.","post_message":"Ruth Bader Ginsburg, a former civil rights lawyer, has been uncharacteristically outspoken in advance of one of the most significant civil rights decisions in decades - by Liz Goodwin in Yahoo Politics."},{"comment_id":"10153327022163984","commenter_b":"I hope that he succeeds She is Satan","commenter_a":"Go all the way with this!!!!","post_message":"It’s been just over a week since Hillary’s announcement set off a firestorm of negative press about her past.   But one scandal stands out… Benghazi! Send an email to Rep. Trey Gowdy and tell him to pry the truth out of Hillary Clinton!"},{"comment_id":"1046205432190874","commenter_b":"Paul, I'm in Columbus, too. Do you think this is a Trump thing?","commenter_a":"At 11:35PM tonight, we lost our feed for your show locally on CBS affiliate WBNS. I missed your monologue, but I'm sure it was just an alternative coincidence.","post_message":"Tonight on The Late Show... from the film 'The Comedian,' actress Leslie Mann, an interview with comedian Lewis Black, and from Schitt's Creek, actor Dan Levy!"},{"comment_id":"10153194834046717","commenter_b":"Fuck you bitch","commenter_a":"Many Jamaicans are F'd up; bleaching, trickery, conning, God awful people!!","post_message":""},{"comment_id":"10154944476018984","commenter_b":"@username but the First Lady Elect wants the Indians to go back to India so how will they be able to go to the White House?","commenter_a":"I do think before the Trumps move in the whole place should having laying of hands and prayers from our faithful people to cleanse the evil that has lived there for so long.","post_message":"As soon as the White House opened its doors to display the Christmas decorations, many Americans were surprised by one item in the background. This is getting a lot of attention, and you'll instantly see why..."}]
