[{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10152669093692434","commenter_b":"This girl is always bipping off about something, anything to get attention to her has been ass. All she ever was a girl in the movie and shitty tv show Clueless. She wasn't even the main character. She needs to sit her ass down and take 100 seats.","commenter_a":"She has ruined Clueless for me.","post_message":"“I’m not saying I’m a victim. I’m pissed off. I don’t wanna be a victim.” Stacey Dash is entirely owned by Meredith Viera in an incredibly awkward debate about the wage gap on The Meredith Vieira Show"},{"comment_id":"10150862298954999","commenter_b":"Hillary is the devil!","commenter_a":"Anyone who supports Trump, the human pile of fecal matter, at this point is also a human pile of fecal matter. Vote Hillary, Johnson, Stein, or write in Jesus for all I care, but for the love of all that is good and holy, do not vote for Trump.","post_message":"“I’m not going to relax,\" Christine Quinn told Donald J. Trump's former campaign manager. \"Because we have a man running for president of the United States who made a gold star mother have to go on TV and cry in front of America. This isn’t about politics——\""},{"comment_id":"10153354540679087","commenter_b":"U PEOPLE NEED TO WAKE THE FUCK UP","commenter_a":"Let's see how far his numbers drop when people realize that there will not be 100 Black Leaders endorsing him on Monday!!! They are pisses about that whopper of a lie!!","post_message":"Donald J. Trump claimed future generations are “going to know about Barack Hussein Obama” when they look back at today’s financial problems. “They're going to be thinking about, 'Obama really blew it.'\""},{"comment_id":"10152910274569091","commenter_b":"Lmao I wonder what gave him away... The eyes?","commenter_a":"@username lol","post_message":"This man was arrested smuggling 18 pounds of marijuana in his checked bags at LaGuardia Airport: @webpagelink"},{"comment_id":"10154067213591770","commenter_b":"@username take out Ca and she lost that too illegals told ok to vote by Oblamo","commenter_a":"I'm so fed up with hearing about the \"popular vote\". Our constitution was NOT set up that way, so please stop talking about it. IT DOESN\"T MATTER. Let me break it down for the simpletons. Suppose you live in a homeowners association. If there is an issue, each home has 1 vote, decision is made fairly. However, if it was a \"popular vote\", then each resident would have a say. If you lived by yourself, you'd possibly be outvoted by your neighbors who had a houseful of 5 people, everytime there was a vote. Which would you prefer? That's how our republic is set up: each state has a FAIR vote in electing the president. Forget the popular vote, unless we change the constitution.","post_message":"Liberals did not like what Ann Coulter tweeted."}]
