[{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"10153585291913132","commenter_b":"The only reason 14-16 is a plus size model is because of fashion magazines. She is a NORMAL size model. That is average size.","commenter_a":"The woman depicted in this picture is a \"plus sized\" model and she's drop dead gorgeous! I wish they would STOP trying to glamorize Tess Holiday... she's pretty and if she truly feels good about herself being morbidly obese and unhealthy then good for her, but she's sending the wrong message!","post_message":"\"All women need to do to get a bikini body is to put a bikini on.\" - Tess Holliday"},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"10153627289889641","commenter_b":"\"Sally\" western name \"Mohammed\" Muslim last name person: Know that our former immigrants were from Christian countries such as Ireland, Italy and Germany.. NOT from terrorist breeding ones. Our Christian immigrants learned our country's language, laws, and ethics. Muslims and or other ethnic immigrants should do the same or stay in their own countries and cultures. We Americans are not migrating to yours so take the hint. Quit invading our world to just get free education, money and riches without working for our western rights.","commenter_a":"Good for him. He should fit right in with all the other Ahmed and Mohamed culture. Check back in 15yrs to see what his training result is.","post_message":"The teenager arrested for bringing a homemade clock to school is moving from the U.S. to Qatar:"},{"comment_id":"555525737965249","commenter_b":"@username for starters, voting for someone as corrupt as Hillary Clinton has proven to be is worse in the long run for this country than electing a fool like Donald Trump. He says stupid things, she does criminal things.","commenter_a":"The whole Republicans party think like Trump!!","post_message":"This should be required viewing for all Trump supporters. Shared by Occupy Democrats, SHARE to spread the message!"},{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."}]
