[{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"1750985641784496","commenter_b":"What that is the craziest thing I have ever heard he's not racist just because he wants to build a wall and stop Muslims from coming into the country until we have a better way of verifying documents he said nothing about that","commenter_a":"are you kidding me. assama has set this country back 50 years","post_message":"Democratic leader says Donald Trump will bring back segregation.  Is he being this obtuse on purpose, or does he really believe this? #TTT16"},{"comment_id":"10154456467843717","commenter_b":"Real Feminists Don't Kill Babies You just can't ban abortion. You can only ban safe abortion.","commenter_a":"You just can't ban abortion. You can only ban safe abortion.","post_message":"The ban is expected to be challenged in court."},{"comment_id":"502375926577851","commenter_b":"WELL damn go fund ME!","commenter_a":"It worked for this hating pig, wait for the next one. Gopers are slow learners.","post_message":"I'd say I've been doing it all wrong the past few years... except I'm a decent human being with a conscience... via The GOOP  | Liz"},{"comment_id":"1139418446080798","commenter_b":"Cruz, your are lying conniving little bitch! Trump 2016","commenter_a":"Cruz is full of S&$t, they did not VOTE for him or anyone else. They were not allowed to vote.","post_message":"\"Donald Trump 65,000 people voted in the state of Colorado. They just didn’t vote for you. They voted for our campaign. Or to put it more simply, Donald Trump, it ain’t stealing when the voters vote against you.\""},{"comment_id":"690494281108627","commenter_b":"pregnancy, keep your pants on and shut up!","commenter_a":"They need a Vasectomy law instead lol stop blaming the Uterus","post_message":"100,000 women took to the streets ... and now the abortion law has been dropped."},{"comment_id":"1233979523321475","commenter_b":"@username This is what I do know. He has had more than 1 stance on this. So Will the real Ted Cruz please stand up? Maybe you should learn a few things? Research... Trump does not have to do Cruz in. Give him enough rope and he will hang himself.","commenter_a":"Cruz will say anything to get elected so he can do nothing for the American people and everything for himself. Don't believe anything he said.","post_message":"Believe him?"}]
