[{"comment_id":"1084382244943634","commenter_b":"The below information must get exposed. Hillary wrote a college thesis on Saul Alinsky's book. We have to save America .!! These are facts., Not propaganda Please read and copy paste to pass this on The Cloward-Piven aka \"Coward Proven\" strategy is based on the teachings of Saul Alinsky a communist socialist died about 43 years ago, but his writings have influenced the politicians who control our nation today. Hillary Clinton did a college thesis on his writings and Barack Hussein Obama writes about him in his books. Saul Alinsky Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone think this stuff isn't happening today in the U.S. ? All eight rules are currently in play. There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The ...","commenter_a":"These are okay but when will the size and cost of government be SUBSTANTIALLY reduced? When will we secure our borders? When will we un-bridle the economy and the coal industry? When will we adopt the Fair Tax? Stop playing with the small stuff and fix the big issues!","post_message":"Here are 7 bills we recently sent to the president's desk. Every single one is now law. @webpagelink"},{"comment_id":"1021280037910232","commenter_b":"Maybe Russia will take care of the roaches for us.","commenter_a":"Sad","post_message":"This is just sad. I never thought an American president would be seen as weaker than the Russian leader."},{"comment_id":"992176534225146","commenter_b":"Then pick that worthless POS Hillary.","commenter_a":"You can say trump is the lessor of 2 evils but if you think trump will be a good president you are a moron","post_message":"Here's what we've learned from undercover videos. Is this how our next President will do business? @webpagelink"},{"comment_id":"1157956670923761","commenter_b":"No can't be true!!! Germans wouldn't let that happen!!","commenter_a":"God help us ALL","post_message":"Goodbye Germany!"},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."}]
