[{"comment_id":"10153060673305329","commenter_b":"Sharon Needles bitch!","commenter_a":"Oh my gosh @username and Tavian Broderick you got to take this shit- i got Bianca","post_message":"Good luck, and DON'T f**k it up."},{"comment_id":"10153226808856378","commenter_b":"Get over yourself Sarah","commenter_a":"Smart, caring woman who made a point in a positive way","post_message":"INSPIRING ACT OF KINDNESS: A woman says she was at the coffee shop with her 22-month-old child when two women behind her in line started making mean, hushed comments about her looks. Rather than returning hate with hate, the woman decided to be a role model for her child and show the women kindness."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"624507887756570","commenter_b":"She's a globalist evil one","commenter_a":"Obama don't put the flag on either!!","post_message":"Did you notice THIS?!?!"},{"comment_id":"1051374008255409","commenter_b":"Oh please. half a million is chump change to those guys. BUY A CLUE.","commenter_a":"People, We're talking about Goldman Sachs here. Don't think for an instant that they'd shell our half a million with no expected returns on their \"investment\". Besides, hillary said she'll look into releasing those transcripts. so I'll hold my breath until I see them(getting a little lightheaded tho\")","post_message":"Another lie about Hillary Clinton goes down in flames."},{"comment_id":"10153639899983132","commenter_b":"She didnt make the show! Nene thought the show revolved around her, she cant handle the truth!","commenter_a":"Well that show won't last without her, I will not watch anymore.","post_message":"EXCLUSIVE: NENE LEAKES is leaving the Real Housewives of Atlanta but teases an exciting new project: \"I'm actually going to be doing a new primetime television show with a big legend.\" @webpagelink"},{"comment_id":"10153881231351800","commenter_b":"Rubio is for granting amnesty for all these illeagals. Sorry we don't need rubio or his muslim immigrants.","commenter_a":"I would much rather see Rubio get the nomination instead of Chump Trump or Crazy Cruz...they are both psychos.","post_message":"Marco Rubio claims he's a GOP underdog because of his fancy boots, but Trevor thinks it might be something else. @webpagelink"}]
