[{"comment_id":"595288380595755","commenter_b":"We just had 2 bombings and a knifing involving these peaceful refugees after NOW RECEIVING OVER 10,000 of them and this idiot is still trying to sell them coming into our country! Well Obama you won't be in office next year and Trump is our mouth piece \" no vetting no refugees \" WE DONT WANT ANYMORE OF THIS CULTURE , ask Merkle in Germany about them, she said if she could go back and change her decision she would not have taken these Muslims in!!!!!!!!!","commenter_a":"He's wrong.........we have citizens right here that need our help first and foremost.","post_message":"President Obama says turning away refugees based on background or religion \"would be reinforcing terrorist propaganda.\" Agree or disagree?"},{"comment_id":"1908531226047249","commenter_b":"But where is Hillary?? This would have more weight if she were working with you","commenter_a":"Yes the people voted and they voted for CLINTON by over 2.5 Million votes!!!!","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"10153551887101130","commenter_b":"it was funny....people lighten up","commenter_a":"Be serious. Not offensive","post_message":"You be the judge."},{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?” Answer: “I think she’s honest to the people who pay her.” MORE: @webpagelink"},{"comment_id":"461209797400647","commenter_b":"This isn't the dark ages, human beings are starting to accept all people. Perhaps the asswipes on this thread should become more tolerant and stop wasting all their energy on irrational hatred.","commenter_a":"What awesome gay couple would want to be married by a bigoted pastor? There are plenty of other ordained people who will be more than happy to marry a beautiful couple!!! Peace!!","post_message":"Breaking..."}]
