[{"comment_id":"658224230997183","commenter_b":"She's buying her way out, watch. Criminal Just like Bush/Cheney. Ever see them traveling abroad? Ever wonder why?","commenter_a":"She is Ugly and a Liar just like Bill !!","post_message":"Judicial Watch announced it has filed a proposed order for discovery with a federal court that seeks the testimony of Hillary Clinton about her use of personal email account(s) for official State Department business. Judicial Watch discovery plan also seeks the testimony of Cheryl Mills, Clinton former chief of staff; and Jake Sullivan, former senior advisor and deputy chief of staff, as well as other current and former State Department officials. Please SHARE!"},{"comment_id":"1232264963481332","commenter_b":"@username, you should read up on the case! It doesn't look good and she's only after what Trump would consider pocket change.","commenter_a":"Wait, Wait, Trump claims he never sexually assaulted anyone, \"I only spoke words, Bill acted\". but Bill was charged and cleared and Trump has been charged. Also, he is being charged with Raping a 13 year old girl. And I don't want to hear from Trump supporters that he \"innocent until proven Guilty\" because every single charge they've made against Hillary, she has not been proven guilty of.","post_message":"WOW. Trump has a lot of explaining to do... in federal court."},{"comment_id":"1085989268155126","commenter_b":"How old is this beech? She sound ignorant dumb and stupid. U need to stay off the coke white girl!","commenter_a":"Send her back to the bunny Farm.....she's useless....","post_message":"Tomi Lahren says #BlackLivesMatter is the new KKK."},{"comment_id":"480556725471124","commenter_b":"She is right! Lock up Hillary.","commenter_a":"She is right, absolutely. This corrupt two system set up by Republican party for a long time ago, specially in G.W. Bush's administration. Now finally, some one found a guts to talk about it. We need more of these speech to bring the truth and fact to American and Washington. Shame, shame.............and shame. Viva and thanks to Democrats for bringing a truth in this matter.","post_message":"YES! This morning, Sen. Warren gave Republicans an EPIC smackdown as they voted for a Koch-sponsored bill to make it harder to prosecute financial criminals. \"There are two legal systems in America; one of the rich and powerful, and one for everyone else.\" \"Billionaire Republican donors Charles and David Koch have been pushing for the corporate crime relief amendment\" according the the Huffington Post. UGH! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"10153091745866523","commenter_b":"You're a pig!!!","commenter_a":"This whole thing was started by a Lawyer whose wife was a Teacher and a School Board Member. She was hysterically crying over the whole...Act 10 thing, so her dutiful hubby wasted millions of our tax dollars to pull out a witch hunt. Which begs the question: Did his wife put out after all that? Because I want to know if my tax dollars amounted to a 'Happy Ending' for most dutiful hubby.","post_message":"JUST IN: Wisconsin Supreme Court ends probe into 2012 recall campaign of Gov. Walker."},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"}]
