[{"comment_id":"10154886702384166","commenter_b":"We got a little here in Honea Path :-)☃","commenter_a":"got some in pelzer, they are haveing a blast in it!!!","post_message":"Sort of an encore performance of snow over parts of the Upstate just before 7 AM. Folks in Anderson could very well get a quick dusting out of this. Let us know if you do! We're on for another 2-3 more hours on FOX Carolina. -Ben"},{"comment_id":"932842660117117","commenter_b":"wait so confused why that chick pushed her lol","commenter_a":"Sydney Robles","post_message":"Meanwhile In New Jersey"},{"comment_id":"10158695661875206","commenter_b":"Check this out i mean Inc.org","commenter_a":"Humans have souls and can live etrnally and that is according to what is written in the holly scripture 'the bible.' God forwarned us that earth will be burned during the secon d coming of jesus ... judgement day.. The bad ones will be burned and gids chosen people will be saved and have second life eternally","post_message":"If there really are multiple, interacting universes, then it would be possible for time travellers to visit Earth, and every imaginable scenario would be played out in a parallel universe at some point."},{"comment_id":"10158094006710354","commenter_b":"Great job! This is why some illegals should be deported","commenter_a":"So sad.","post_message":"HORROR:"},{"comment_id":"10154809272254714","commenter_b":"Says a female....smh","commenter_a":"Shows the ignorance of those who can't be bothered to do their research at this time in that country...and instead ,waste their energy having hissy fits on issues that are harmless, while they invite the she devil herself to continue destroying them... Mercy...","post_message":"It will cost between $3,000 and $10,000 to fix the damage.  (via Good Morning America)"},{"comment_id":"1619461488113974","commenter_b":"Fuck Rosie!!! Stay fuck out of the U.S. no one misses u ... we promise!!!","commenter_a":"She was right about one thing. She truly is one sorry individual.","post_message":"Keep 10 year-old Barron out of politics!"},{"comment_id":"10154534822598132","commenter_b":"The only way,she should have stop him is by calling the authorities. She need to go to jail,knonkle head","commenter_a":"She is as guilty as that stupid dude!!! She knows a thing or two she should be charged!!!!","post_message":"The second wife of #Orlando killer Omar Mateen has reportedly said she pleaded with him not to do anything violent."}]
