[{"comment_id":"976218969153516","commenter_b":"I hope she gets life in prison! She is a twisted individual! The other prisoners know how to handle child killers. She woo get what's coming to her then rot in hell!","commenter_a":"They all should die the very same way he did!!!!!!","post_message":"Rachel Bostian, one of three women charged with savagely beating five-year-old Alexander Stephens to death during a 22-hour abuse and torture marathon — one of the accused women the little boy’s own mom — pleaded guilty to murder and several other charges in an Ohio courtroom last Friday, according to a report in The Cincinnati Enquirer. But what led Bostian, 29, and allegedly her 26-year-old friend and Alexander’s mom Theresa Hawkins-Stephens, as well, to tie the little boy up for what... @webpagelink"},{"comment_id":"1117289745030745","commenter_b":"Joshua DeVere you don't like vaginas? You think they're \"yucky\"? You stupid fucking asshole. You don't have testicular fortitude, you have testicular stupidity. Get off the steroids pee per head.","commenter_a":"I swear the haters probably have a sexual fetish on saying he failed as a president. It is more sad that around 23% of americans (more likely republican) still believe he is a muslim. -_(\\\\","post_message":"Pres. Obama's accomplishments speak for themselves. And to think that he did it all without ANY help from Republicans.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump.  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1670944519835060","commenter_b":"These women need to learn to lug around bottles with store bought milk that contains half the nutrients in case their baby becomes hungry and fussy and starts bothering everyone around them. They should use their brains!!!!","commenter_a":"Feeding your baby and using your body the way God intended it to be used is absolutely shameful. How on earth could women stand up for such a thing and demand that society accept this!","post_message":"Women are brilliantly standing up to breast-feed shaming.  Read a powerful example right here: @webpagelink  Like ATTN: on Facebook."},{"comment_id":"1137481012959422","commenter_b":"Get the hell out, asswipes!","commenter_a":"I wish Scottland would welcome me in. I've had it with the states.","post_message":"In case you missed it: Syrian refugees arrived in Scotland this week. This is how they were greeted."},{"comment_id":"1025596987461312","commenter_b":"Sure, blame the illegals. What do you Morons know?","commenter_a":"Kristen Kirschner","post_message":"Let's take a moment to remember that measles was ERADICATED from the USA in 2000. Nice job, anti-vaxxers."},{"comment_id":"1368961776496629","commenter_b":"Obviously yours is up ur boyfriends ass you homo!","commenter_a":"IF YOU ONLY REPORTED REAL NEWS! ! ! !","post_message":"This scandal is only getting worse."}]
