[{"comment_id":"10154264315237550","commenter_b":"Yes you and your mother, @username! You old goat!","commenter_a":"They look real stupid with riot gear on outside a stadium!! There's no bomb threat! That Chief Of Police is a idiot. People are coming to enjoy a football game. Don't bring unnecessary rhetoric to this.","post_message":"Police are in riot gear outside of Bank of America Stadium in Charlotte ahead of the Panthers game. Read more here: abc11.com/@username/"},{"comment_id":"10154264837836130","commenter_b":"No she isnt spitting fire..she is comng off as a wimp","commenter_a":"Living in reality is not at all something conservatives are known for.","post_message":"Hillary Clinton spitting fire. 🔥"},{"comment_id":"10153445338169170","commenter_b":"The best government is the least government!!!!","commenter_a":"Never","post_message":"Net neutrality regulations kick in today. ...So when has government regulation actually helped?"},{"comment_id":"10153338869724411","commenter_b":"hey asylum seekers, if you don't like it in italy, then don't go to italy!","commenter_a":"Modern slavery and the should be thankful for that. Hate this shit!","post_message":""},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"}]
