[{"comment_id":"1015647588491215","commenter_b":"@username Hillary hasn't officially won the nomination there my dude... Did I say I was voting for her?","commenter_a":"In his defense, and I am in no way voting for this guy, he said the economy ran better under democrats but it SHOULD NOT be that way. So, that plays into him wanting to be a different option within the party. But whatever, the guy is a moron and I'm voting DEM!!","post_message":"LOL, WOW. You could ask this guy what he had for breakfast, and his answer would change from one minute to the next.   Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154233003321336","commenter_b":"@username criminal actually the first foreign language spoken by illegals immigrants in the usa territory was English","commenter_a":"Donald Trump he's making our nation the laughing stock of the world but he is not the problem apparently in the usa there are a legions of racists misogynistics and fear filled ignorant people just waiting for a voice of lead and release them ,, he is not our shame the idiocy of some of our citizenry is our shame","post_message":"\"I've spent less money than almost anybody else and I'm in first place by a lot.\" – Donald J. Trump"},{"comment_id":"10153400594587994","commenter_b":"those that wanna look like a female do!","commenter_a":"Just put a weave on it everybody else does....","post_message":"We've all had them -- but this bad hair cut even brought the hairdresser to tears."},{"comment_id":"10153961406315695","commenter_b":"Praying now!","commenter_a":"@username Redemption Baptist Church Carissa Byrd please pray for this baby. She is Ron's daughter's cousin.","post_message":"“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,\" the boy's father said."},{"comment_id":"10153143736247434","commenter_b":"Bitch, I will snatch the wig off your f'ing head! Don't come for us gays, whore. We don't play!!!","commenter_a":"Another example of LGBT being absolutely clueless when it comes to racism.","post_message":"These are by no means new rumors but now’s not the time for this, Alexis!"},{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in.   Should parents have taken kids out of school for the parade?"},{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for \"women\"","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"}]
