[{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"10152835596391519","commenter_b":"This woman should have her vocal chords removed!!","commenter_a":"I like to go down to the beach and write naughty words on the back of crabs.","post_message":"Repulsive..."},{"comment_id":"10152995075029342","commenter_b":"A lot of women think they have to \"eat for two\" which they don't and that gets out of hand.","commenter_a":"People will never be happy. If a woman gains 100 lbs during pregnancy, people will \"OMG THATS SO UNHEALTHY! \" BUT, someone who is healthy and in shape, people are still gonna have a problem with it. What I think it is, alot of women get extremely fat and think it's ok. They use pregnancy as an excuse to over eat. This woman CHOSE to stay fit and there is nothing wrong with that. Kudos to her!","post_message":"Sarah Stage, the internet-famous pregnant model, finally gave birth on Tuesday to an unexpectedly large baby boy:"},{"comment_id":"10155013190899726","commenter_b":"Yup she's a nobody!","commenter_a":"Yes precious snowflake because you won't be happy until abortion is a Live pay per view celebration #sick","post_message":"'This isn't working, this two-party system'"},{"comment_id":"10153841941246770","commenter_b":"I'm not voting for the CORRUPT, LYING, MURDERING, CROOKED iLL SICK PERSON! I'll VOTE FOR TRUMP, you know why because the LIBERALS are a bunch of sick twisted people who do give one crap about this country!!! #NEVERHILLARY","commenter_a":"You ad your husband are a perfect for each other. Both dumb as a brick!","post_message":"Chrissy Teigen just called Trump a \"sociopath\" on live television."}]
