[{"comment_id":"949147745161454","commenter_b":"Nancy Pelosi said on the House floor that 30 million people were uninsured in the United States. After Bummercare, we were told that 40 million Americans were still uninsured. One year later, we were told that 55 million Americans were either uninsured for under insured. Islamic religion prohibits insurance because they claim it's gambling and are exempt from getting insurance. With the current influx of refugees and people sneaking into our country and getting free medical, welfare and food stamps, how many millions are now in this country unisured or under insured? Why would anyone bother to get insurance? Hospitals still take patients, doctors still see patients, and medicine is still sold at the pharmacies. If no one has insurance, costs will immediately be adjusted and negotiated at a lower cost. People will stop running to a doctor for every sniffle.","commenter_a":"amazed it lasted as long as it did, now the states are left holding the bag right along with those folks who tried to abide by that totally damaging obummercareless law.","post_message":"Oh Not Again! 400,000 Americans Enrolled In Obamacare Need To Find A New Plan"},{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10150576091714999","commenter_b":"Another highly paid rapist.","commenter_a":"@username...good or bad?","post_message":"Sports Alert: Jameis Winston, the star quarterback from Florida State Seminoles Football who played under a swirl of controversy, was chosen first over all in the NFL draft by the Tampa Bay Buccaneers."},{"comment_id":"10153238696686813","commenter_b":"@username Oh yea you and and stupid California is a payer State... you dumb asses pay twice as much to live in pollution surrounded by painted hills of immigrants. You people have made mad bank off the backs of Immigrants, thus the reason you want more. Dumb Blonde wow, I thought that was a cliche!","commenter_a":"The people of this Country are tired of being worked into Slavery to merely exist... The continuous need to help outsiders with no regards to the effects of the US Citizens that do not need anymore competition for jobs and affordable housing is Un-Patriotic and a spit in the face to every working class American and their children and grandchildren. We are asking the Federal Government to listen to the People's request but they are blatantly ignoring and denying our request to stop this invasion. Anyone that stands for the Big Federal bully tactics should go down with them when the Civil unrest begins.... It's coming, just wait for it! There are far more Citizens on this land than the Police, Military and Government goons combined! KEEP POKING THE BEAR! NO REFUGEES OR IMMIGRANTS are Welcome here don't you get it.... Take your ass to California and mooch off the ...","post_message":"GOOD NEWS: Court denies Texas motion to block Syrian refugees, and finds Texas unlikely to win lawsuit.   “There is nothing in the law that gives the state veto power over any decision of the federal government or permits any state to discriminate against certain refugees based on their nationality, in fact the law says just the opposite,\" said ACLU of Texas’ Rebecca Robertson. #refugeeswelcome #allfaithswelcome"},{"comment_id":"10153245155862550","commenter_b":"Candace, those who are offended by the American Flag can move!!! HAPPY INDEPENDENCE DAY Ladies!","commenter_a":"I hope they catch them...my ancestor is buried there. And who knows...some of those soldiers that they dishonored are probably non-white....my ancestor is NA. All lives matter....","post_message":"#BreakingNews Update: The Durham Police Department is investigating after a Confederate memorial in Maplewood Cemetery was vandalized.  More details here: @webpagelink"},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"10154666429943258","commenter_b":"Go back to France, sing a song and appease all the Muslims......","commenter_a":"Immature. You should do what your customers ask of you.","post_message":"James Taylor wanted Fox News changed at Boston Logan International Airport. Here's what Bill O'Reilly had to say about that."}]
