[{"comment_id":"868758169887103","commenter_b":"crying about the NRA , every lobbying groups receives money from those they represent . Guns sell themselves , new models fly off the shelves and gun stores hardly discount. Women are one of the fastest group of gun owners in the country .Many single mothers and single women carry weapons , it is the best defense . Many women have stopped harassment , rape or assault because they were armed, weapon is often never fired .","commenter_a":"If you read the article, it sounds as if alcohol should be banned from campus. What the article does not say, is you still need to be 21 to legally have a handgun. That and you would still need your concealed carry permit. Concealed carriers are as a group less likely to commit crimes than even the police. Ever time carry options get more loose, liberals cry the streets will run red with blood, but the reality is just the opposite.","post_message":"These bills are moving through state legislatures across the country - here's what you need to know."},{"comment_id":"10154315699286509","commenter_b":"No laws were broken She just happened to cross paths with a power hungry pig","commenter_a":"She also wouldn't have been in police custody if she were a law abiding citizen","post_message":"Bernie Sanders said that Sandra Bland wouldn't have died in police custody 'if she were a white woman.'"},{"comment_id":"10154282422068128","commenter_b":"'So Veli, I saw an article about you in the WSJ today...' Haha, but my only interactions with him were over email, so as far as I know...","commenter_a":"'@username veli?","post_message":"“Just when I wanted to nominate Jill Watson as an outstanding TA,' it turned out she was computer."},{"comment_id":"10153953240508984","commenter_b":"We are AMERICANS! As are all legal CITIZENS! We believe in the LAW, THE CONSTITUTION and what it stands for! I don't have a problem with blacks, Mexicans or Muslims! But they seem to have a problem with us! They shoot or hurt us first and because we fight back we are racists? What the heck s wrong with this! Our Lord Jesus gave us two great laws, to love God above all else and to love our neighbors as ourselves! It doesn't say our neighbors have to be white, black, brow, or purple!","commenter_a":"Americans are done with the media as well as p.c.We are not racists or bigots..or hateful people as we are portrayed.We are patriots who are not going to let this country fall.","post_message":"This 8 word statement from the Republican debate was the most important and influential of the evening. Whether or not the candidate who said it becomes the GOP nominee, its far-reaching impact will be felt for the rest of the campaign.  Do you support this candidate's position?"},{"comment_id":"10153561445142093","commenter_b":"Really lady? Liberals and Muslims want to rewrite history? @webpagelink","commenter_a":"There are already people who say the holocaust didn't happen. With today's trend of re-writing history for political correctness, it may disappear in the next 50 years!","post_message":"A WW II vet was reunited with a Holocaust survivor who he helped liberate and the incredible moment was caught on camera...@webpagelink"},{"comment_id":"543491929108734","commenter_b":"Good, send her to prison then send her to Isis!","commenter_a":"She should be jailed for life.","post_message":"For weeks, this Muslim woman sat behind her computer spreading hate and threatening the 'infidels'. She thought she was going to get away with it, then she heard a knock at the door."},{"comment_id":"10153486926096770","commenter_b":"Conservative Populist? Lmfao","commenter_a":"Trump your next President.","post_message":"After acknowledging he will now raise money for the general election, presumptive Republican presidential nominee Donald J. Trump has named a national finance chairman who has a history with some organizations that could clash with his conservative populist message."}]
