[{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"1137251062961589","commenter_b":"Hillary Clinton for President!","commenter_a":"Hillary 2016... and trolls in 3.2.1..","post_message":"The 2016 Democratic candidate said that incomes have stalled even as corporate profits have skyrocketed, creating inequality that is \"a drag on our entire economy.\""},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"10153929310543037","commenter_b":"Lesbians get their own series since they probably could beat the guys, @webpagelink","commenter_a":"This event is unfair....lesbians have a total advantage. ;-)","post_message":"The event will host 200 teams with 5,000 people."},{"comment_id":"726800087419505","commenter_b":"@username get 'em, girl!","commenter_a":"BERNIE SANDERS AMERICAS ONLY HONEST CHOICE 2016","post_message":"Hillary Clinton campaign's \"abuela\" post sparks #NotMyAbuela hashtag."},{"comment_id":"1401866033180478","commenter_b":"Well said!","commenter_a":"Only took mass shootings for something to be done! Stop illegal aliens from getting jobs here, no papers=no jobs or sending our money to help other countries when we have plenty of homelessness & poverty here in our own country. Fix this country first b4 you try to fix others.. Children here need help just like across the world, we have Veteran's dieing & sleeping on streets, starving people & animals everywhere. And the only way something is ever done is when there's some sorta tragedy. The whole state (country) is in need of change. We need to correct us b4 we try to help others.","post_message":"WATCH LIVE: Gov. Rick Scott is in Orlando giving a briefing on the Florida Department of Law Enforcement's counterterrorism efforts. Gov. Scott wants to spend $6 million to increase the number of agents dedicated to fighting terror: on.wtsp.com/2j4OSzV"},{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"}]
