[{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."},{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"1023160814385680","commenter_b":"Pussy bitch","commenter_a":"Fuck that! If that fuckin dog was comin at me is shoot the cunt too! No questions asked! Why risk your life for someone's untrained mutt!!","post_message":"The difference between firefighters and cops. Coward → @webpagelink Filming Cops (Y) via Cop Logic (Y)"},{"comment_id":"10153299356731051","commenter_b":"@username IGNORE THE TROLL. NO FRIENDS ..NO SITE..NO BRAINS!!!","commenter_a":"Yes I agree with Trump make this nation great again","post_message":"Donald Trump wants to make America's military so powerful that the whole world will be afraid to challenge us. Would you like to see it happen?"},{"comment_id":"10153259731496615","commenter_b":"They are grown women they knew exactly what they were doing","commenter_a":"Stop calling these Ppl victims they knew what they were doing everyone knows Cosby is married what type of woman will got to a hotel room for drinks with a married man they had their own agenda miss me with that victim bs","post_message":"BREAKING: Bill Cosby has been charged with sexually assaulting a woman in Pennsylvania more than a decade ago. @webpagelink"},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"}]
