[{"comment_id":"782996508468592","commenter_b":"@username You know nothing fool.","commenter_a":"U.S. Attorney General Loretta Lynch is an idiot. Her and the Obama Gang are clearly violating the US Constitution and disregarding the rights and safety concerns of women and children. She should be hauled into congress for questioning.","post_message":"Just in: U.S. Attorney General Loretta Lynch announces that the Justice Department is suing North Carolina over bathroom law. \"This action is about a great deal more than bathrooms.\" @webpagelink"},{"comment_id":"10156075719260389","commenter_b":"kill the rapist please","commenter_a":"The Military is a disgrace. What the heck has happened to our military?","post_message":"“Your behavior is inexcusable and incompatible with the high standards of performance, military discipline and operational readiness of Special Forces,” the memo states."},{"comment_id":"10152938461282293","commenter_b":"GOOD. We need less politics. Clinton's and Bush's destroy this country. Carson is an actual person, not a career politician. Wise people WANT someone who is not a politician, unless you would prefer to stick with the status quo.","commenter_a":"Gifted hands, doesn't mean meant for politics...","post_message":"In Opinion, Dana Milbank writes: \"Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness.\""},{"comment_id":"1836299966658207","commenter_b":"Damn @username is just as bad as those UNAmericam bitches","commenter_a":"Hey whoopie knuckle dragging Goldberg, I thought you were leaving if Trump got elected, get the fk OUT of OUR COUNTRY and take your brainless bimbos with you!","post_message":"Things got CRAZY on the set of 'The View'  when one host went completely over the edge, and then demanded that Donald Trump do the unthinkable. Viewers could hardly believe it..."},{"comment_id":"10153765437796336","commenter_b":"Then stop bringing in hundreds of thousands of illegals, then bring the jobs back to America.","commenter_a":"I agree, put people back to work and stop giving them freebees from the Government. Make them responsible for their own lives.","post_message":"Billionaire Charles Koch joined \"The Kelly File\" tonight for a rare interview, and said progress will depend on the American people understanding what is fair and what makes their lives better."},{"comment_id":"10153001992671770","commenter_b":"discusting","commenter_a":"Who cares ?? I DO NOT CARE !!","post_message":"Lather, rinse, repeat. Kim Kardashian's posting cleavage shots again."},{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."}]
