[{"comment_id":"618782741607379","commenter_b":"She will never do it","commenter_a":"I can only see myself supporting Clinton if we have direct representation in her administration. I think a Vice President Bernie Sanders would be acceptable.","post_message":"Will Ana Kasparian and Hasan Piker support Hillary Clinton?"},{"comment_id":"10154514079711509","commenter_b":"That is funny","commenter_a":"I hate to say it but Bernie has done much more for equality than Donald trump","post_message":"\"There's nobody that's done so much for equality as I have,\" said Donald J. Trump."},{"comment_id":"10153120259284411","commenter_b":"Ran like the bitches they are !!","commenter_a":"Marines don't flee. They were ordered home... there's a difference...","post_message":"Fleeing US marines handed over weapons to random Sanaa airport employees Yemen official"},{"comment_id":"10153485942076491","commenter_b":"Thanks for the suggestions Mark but I really don't care what yoy think I should be reading.","commenter_a":"He really should narrow that down to a top 10 list. Nobody likes to read that many books.","post_message":"It includes ‘The New Jim Crow’ by Michelle Alexander."},{"comment_id":"1121161091293379","commenter_b":"I thought she was 100","commenter_a":"Nick Foley @username @username bruh.. lol this is about to be mom","post_message":"A man named Sidomejo from Indonesia has documents that claim he was born in 1870 – which may mean he is 146 years old."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"10153331383855329","commenter_b":"Ummm they are...? If a diamond ring is a deal breaker for a woman she needs a reality check","commenter_a":"Thank fuck I have a husband who knew when he was proposing to me that I'm not a shallow twit who will only accept diamonds :) Also to those who say you don't get the sparkle with a fake, let me tell you, you do, you get sparkle in abundance, just because its \"fake\" doesn't mean its not good quality!! My rings catch many an eye and always oh that must of cost a lot bla bla bla, as far as I would be concerned my advice to men would be that if she DEMANDS a diamond she is not worth it :)","post_message":"Put a diagram on it."}]
