[{"comment_id":"1510465682300437","commenter_b":"Drained the swamp by putting the gators in his bathtub. What happens when they attack him and each other? Too much love of power and love of money in a small space.","commenter_a":"Well, with all his wealthy Cabinet appointments, we can thank Trump for finally draining the swamp, which is unpresidented.","post_message":"This just happened. He said it! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156273080720389","commenter_b":"She's a gutless wonder!","commenter_a":"good for you rudy.now call out the queen of liars abad tell her this country does not need a corrupt murdereer of ameicans in bengazi...","post_message":"In Case You Missed It: Rudy can be a little blunt sometimes."},{"comment_id":"10153757247084753","commenter_b":"She needs to stay in prison!!!","commenter_a":"She has been in jail almost 50 years let her go to die a free woman for all you goodie 2 shoes some people deserve a second chance let he who is without sin cast the first stone","post_message":"In shocking news today, Charles Manson follower Leslie Van Houten could be getting out of prison after all this time. Us Magazine shared that Leslie has now been tentatively approved for parole effective today. She has actually been turned down 19 times in the past. Most people know her as the one who wrote the messages on the wall at the murder scene of married couple Leno and Rosemary LaBianca back in 1969. At this time, Leslie Van Houten has been recommended for parole. There is nothing... @webpagelink"},{"comment_id":"10153546398404071","commenter_b":"my baby","commenter_a":"avoiding to say that but still im homeless","post_message":"Millionaires never say these things — and you shouldn't either."},{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"},{"comment_id":"1279876618745757","commenter_b":"Why tho. She's the one that slept with em. She's a dirty ass hoe and she got caught. If you were the dude and she wanted to bang you you'd probably do the fuckin same","commenter_a":"All you guys are saying he shouldn't whip his ass if you listen to the video he is calling dude out by his name so he obviously knows him which means he probably knows them I'm not gunna lie call me what you want but I'd whip dudes ass too","post_message":"He had rage behind each blow! #WSHH"}]
