[{"comment_id":"10154091101902042","commenter_b":"Sarcasm at its finest, they should've pulled their pants up!","commenter_a":"All white guys I see","post_message":"THIS CRAZY BURGLARY! These burglars rammed a car through the gated front door of an Indianapolis clothing shop, and then about a dozen spilled in and grabbed whatever they could. It was all caught on tape. More details: @webpagelink"},{"comment_id":"10154720282189170","commenter_b":"B.S. She's campaigning for Hillary, and fighting for gun control. She's an adult who's inserted herself into the process. Don't want to take the heat? Stay out of the fight.","commenter_a":"She is not a politician. She should be left out of it.","post_message":"Wow.  Five bucks says Chelsea will do everything in her power to dodge this question in the future."},{"comment_id":"1277810208923879","commenter_b":"I wouldn't trust him to drain anything","commenter_a":"Ryan is a swamp rat.","post_message":"Let the draining begin!"},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"1112148695548048","commenter_b":"Imagine if Hillary did all the finger wagging that Bernie does in debates?","commenter_a":"Men can get away with anything this election season that women (Hillary) could not. Waving their arms, swearing, making fun of people...anything goes.","post_message":"Social scientists have found the exact same affect by a woman simply doesn’t play the same way."},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"10153876245464411","commenter_b":"She's actually not Austrian. Quit with the PC BS.","commenter_a":"She got what she deserved. Make up your fucking mind and stick to it.","post_message":"Unconfirmed reports of the 'poster girls' fate also circulated last year, with UN counter-terrorism expert stating that one had been killed in fighting and the other had disappeared"}]
