[{"comment_id":"10152774943488717","commenter_b":"Women drivers..","commenter_a":"hmmm - am I the only one who doesn't \"buy\" the foot caught on accelerator? I feel for anyone who reaches the point where they should no longer be driving - this appears to be one of them.","post_message":"Watch as a driver in Wisconsin slams into nine cars in a parking lot: @webpagelink"},{"comment_id":"1729302324008318","commenter_b":"@username like your sister & her boyfriend helped rape your niece!!!!","commenter_a":"If the kid is dumb enough to Climb into a gorilla pen, and the mother is dumb enough not to pay attention to a kid climbing into a gorilla pen.....then by all means that gorilla should have ripped the little kids head off, at least the gorilla would have had a better reason to get shot and killed","post_message":"After the Cincinnati Zoo gorilla incident, some want a sort of leash law for children. Your thoughts? Via CNN Opinion"},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"1529103134057563","commenter_b":"She should go to hell!!!!","commenter_a":"She should think before she speaks good about Obama and his laws","post_message":"Democratic presidential candidate Hillary Clinton says she supports President Obama a 100% \"in his fulfilling his constitutional duty to send a nominee for the court to the Senate.\" How do you feel about this?"},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."},{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."}]
