[{"comment_id":"493684487507628","commenter_b":"Keep em out our we go the way of Europe. No Trojan Terrorists!","commenter_a":"Vet everyone coming in","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.”   Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10153554399159087","commenter_b":"Naw a wall sounds great how's how is he going to pay for it? Oh it's free lol fool","commenter_a":"Trump offering free stuff, free deportations, and a free wall. damn national socialist","post_message":"If Donald J. Trump is victorious in several March 15 winner-take-all contests, including Ohio and Florida in which he is currently leading, it would take an “extraordinary effort to defeat him,” Karl Rove said."},{"comment_id":"10156536159770354","commenter_b":"That's not a woman. It's a guy","commenter_a":"definitely a man","post_message":"This VIDEO is absolutely nuts.  “I’m going to cut you. And I’m going to get away with it. Now if you say one more word, it’s going to end very badly. Do you understand?”"},{"comment_id":"10153141566354641","commenter_b":"She is one of the terrorists in this world","commenter_a":"The time is now, change in governance of UNCLE SAM, time for good women of UNCLE SAM to vote for Hillary Clinton, what a man can do a woman can do it better. Let's give her a chance. She will surely make the difference. UP DEMOCRATIC PARTY.","post_message":"First on CNN: Hillary Clinton’s press team is growing: @webpagelink"},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the \"word.\" The \"word\" is love.","post_message":"\"Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"1728134044133544","commenter_b":"Screw off with trump both candidates suck","commenter_a":"IM STAYING AROUND TO SEE HOW BAD IT IS HAHA","post_message":"This was a \"Behind the scenes TV Production Meeting\".  The really good part to me comes about half way through where we begin to discuss show on future tech and AI."},{"comment_id":"10154654748316320","commenter_b":"What barbarians","commenter_a":"Savages","post_message":"SHOCKING:  Video posted on social media during demonstrations Wednesday night in Charlotte appears to show a group of protesters beating up a man and stripping him of his clothes as he begs for mercy.  @webpagelink"}]
