[{"comment_id":"10153051549632169","commenter_b":"She will always genetically be a she period Cat is not a dog just because someone wants it to be","commenter_a":"Why are my tax dollars and donations going to publish this crap????","post_message":"From FRONTLINE:"},{"comment_id":"10153128765639586","commenter_b":"<3","commenter_a":"Jessica Thompson this is why we cut those things!!!","post_message":"ALWAYS CUT YOUR PLASTIC SIX-PACK RINGS.   PETA fieldworkers found this poor feral cat reminding us all how dangerous discarded plastic & other trash can be: @webpagelink   SHARE to remind everyone!"},{"comment_id":"10155292076102501","commenter_b":"can't we keep her out of this state somehow? I tihnk every time I see her kids commercial how many unborn infants have died because of her support for abortion. Protect kids? Get serious lieing Hillary","commenter_a":". --------------------------------------------------------------------- HILLARY - BREAKING THE GLASS CEILING? --------------------------------------------------------------------- Mrs. Clinton, how can I possibly tell my daughter to follow you as an example after you allowed your husband to assault and demean multiple women throughout his political career? Were those women not important? Tell me, will you fight for my rights like you fought for those womens? Ummmm, I hope not. What about the sisterhood, Mrs. Clinton? Did you expose your husband for his abuse? No! Instead, you enabled him as the abuser and tried to silence his victims. How can you live with yourself? Female empowerment? ......... Nice try!","post_message":"Hillary is coming back."},{"comment_id":"10154087270880047","commenter_b":"Oh hell no - the responsibility lady falls on the dingbats having unprotected sex for hell sakes...","commenter_a":"Wonderful.... Just incredible how everyone is so consumed with life at conception. I have yet to hear a plan from the Pro-Life movement that will ensure these 'life begins at conception' babies will receive all of the necessary love and care that a child so rightful needs & deserves. This becomes YOUR responsibility!","post_message":"VICTORY: The U.S. House of Representatives passed the 'No Taxpayer Funding of Abortion Act' by a vote of 238-183.        This is a significant, bipartisan step forward for the pro-life movement."},{"comment_id":"10155893910319062","commenter_b":"Nobody gets that the action he repealed would have put the housing industry back where it was a few years ago with foreclosures flooding the market again.","commenter_a":"Wait a sec! You're telling me that a billionaire scumbag that has sent jobs overseas, left commissioned workers unpaid and exploited illegal immigrants ISN'T looking out for the best interest of middle/lower class Americans? Huh. Imagine that.","post_message":"President Donald Trump blocked an Obama administration policy Friday that would have reduced the cost of mortgages for millions of home buyers."},{"comment_id":"10154847976925560","commenter_b":"This is so sad and disgusting...and women kill for these bags.","commenter_a":"This is just bullshit","post_message":"This is why Hermes & Louis Vuitton bags have those bumps on them. [GRAPHIC]"},{"comment_id":"1457804240939001","commenter_b":"Don't forget the nra was starred by giving rifles to free slaves in the south to protect themselves from mobs and the kkk","commenter_a":"Just like President Obama, Al Sharpton is losing his grip on reality . Dr. Martin Luther King would roll over in his grave if he knew how far backwards race relations have slipped because of the ideals of Mr. Obama and Al Sharpton. I'm 51 years old, and I'm seeing more race related problems than I can EVER remember.","post_message":"Watch David Webb destory the Reverend..."}]
