[{"comment_id":"10152850866306051","commenter_b":"susie you didnt read so shut up u dumb bitch","commenter_a":"What does the kind of dog have anything to do with insurance.","post_message":"When the insurance company found out what sort of dog this woman had, they told her that her claim would be denied."},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"1640792116219030","commenter_b":"That takes some balls","commenter_a":"What a pair to draw too. How can anyone support these idiots.","post_message":"Details you'll want to know are here: @webpagelink"},{"comment_id":"10153958527368822","commenter_b":"apparently you havent done your homework or been around long enough to have seen and heard her bigot comments in the past. She stated she will raise all taxes and healthcare. unless you are wealthy and dont care about others who are not your ok with paying more. Also I would still love to see Bush in prison right beside OBUMMER and KILLary. She is not for woman. She was the lawyer for a man who raped a 14 year old girl and got him off. Do some homework. Ive studied both sides and a liar , a cheat and a murderer for president of my country. our country that so many have died for no F_G way. Your so hung up on a stupid wall and blinded on real issues. Our parents and grand parents have worked all there lives for ss and its a loosing battle because the ...","commenter_a":"So to the people that are angry by this. You are willingly admitting that you are and support racism, bigotry, homophobia, xenophobia, getting rid of women's rights, allowing abuse of children and women to be legal. To literally rounding up whole races of people tagging them and putting them in camps. Exactly what the Nazi's did. You are saying that you are unable to think for yourselves, that you think there is this america that you are being held back from that doesn't actually exist. If so I hope you are proud of being a horrific human being. You are a traitor to America and all that it stands for. You are scum, a filthy plague on human society. You are the embodiment of everything that you hate.","post_message":"\"We are a city of bridges, not a city of walls,\" said Congressman Mike Doyle, referencing Donald J. Trump, at Clinton-Kaine rally in #Pittsburgh."},{"comment_id":"10154134849200695","commenter_b":"Sorry that you have to know the pain :( if you want to follow along like my page @username Walks ..I'll be posting updates there along the way","commenter_a":"I am walking across America this year in honor of my sister who died of an overdose. I am going from Delaware to California and telling people about this epidemic and about Good Samaritan laws that protect people from going to jail if they call 911 for help when they see someone overdosing. @webpagelink","post_message":"A powerful new drug is triggering a spike in overdose deaths in Atlanta & across Georgia. Where the pills are coming from and the urgent warning from experts at the CDC, today at 5."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."},{"comment_id":"1633238976976440","commenter_b":"Debate is good!!! It means they're taking an interest in politics! I don't agree with the shirt but how can you be a 'free country' and yet ban a tshirt ? The teen has a right to free speech","commenter_a":"No keep it on, this is a good learning experience for them to do research and compile facts to rebut the shirt. In fact if she wants to wear that shirt she should have to make a presentation showing fax and citations from non-biased source is why she thinks it's true!","post_message":"The teen said she was asked to take the shirt off after it sparked a debate in class."}]
