[{"comment_id":"10154715830017509","commenter_b":"It'll be a sad day for women if that's the best they can offer as their poster child.... In fact I find it a huge insult to all the smart, strong, driven and hard working women in this country. So many women that are so better suited for the job... Such a shame","commenter_a":"Can't wait to break that glass ceiling tomorrow Hillary by making you the first woman President of the United States! #StongerTogether! #ImWithHer!","post_message":"Since Bill and Hillary Clinton left the White House 15 years ago, they have taken in more than $240 million in income and paid $100 million of that back in taxes."},{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."},{"comment_id":"989796557698481","commenter_b":"Women aren't human beings?","commenter_a":"women will die?????? really???? this is incredible... what about how many BABIES HUMAN BEINGS will die???????????","post_message":"Breaking ranks"},{"comment_id":"848324611946507","commenter_b":"Actually I spent a number of years in special ops in the military, we called guys like you \"Dinky Daos\".","commenter_a":"ISIS thanks Senator Cruz for supporting their strategy to create a war of religions.","post_message":"The Obama Administration has no foolproof vetting process, and this is tantamount to rolling out a welcome mat for terrorists to this country. Congressman Jeff Duncan and I have together introduced legislation that would empower states to use their Tenth Amendment authority to opt out of the national refugee resettlement program. Our legislation requires the federal government to inform states of its intent to settle aliens within their borders, and allows governors to reject those aliens if a governor believes that the refugee presents a security risk. Our children’s safety tomorrow depends on our ability to secure America today."},{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"},{"comment_id":"10152782539256130","commenter_b":"It would take the entire roll of toilet paper for some women. Hell I go through super plus tampons with a super extra maxi overnight within 2 hours bc I have PCOS. I was homeless and LUCKILY people donated to the shelter and I was usually able to have what I needed. Sometimes I didn't but I would go sit in the day labor office with a bunch of homeless men, I was like the only woman there, while I was on my period, bleeding through my clothes just to go do manual labor all day so I could make $30 to buy what I needed. I fucking hate asshole people.","commenter_a":"Growing up poor, you learn to use other methods. Guess what's free and in bathrooms everywhere? =p","post_message":"Pads and tampons are often what homeless women ask for the most."},{"comment_id":"1236189426462383","commenter_b":"#ImNotWithHer","commenter_a":"You mean Hillary campaign staffers posing as sanders supporters","post_message":"Bernie Sanders supporters have taken to Twitter to reluctantly express support for Hillary Clinton using the unenthusiastic hashtag #GirlIGuessImWithHer."}]
