[{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."},{"comment_id":"10153110239287093","commenter_b":"It should be removed","commenter_a":"Wow anyone that wears this is a sorry person. I fully support our men and women in Blue. I think the teacher made a great call . Better safe than sorry . I expert even looked at the \"clock\" and said it is a count down read about it. Also who makes a clock these days that looks like it would be a bomb.","post_message":"It was only a matter of time!! If you wear this costume to school, be careful who you show it to. @webpagelink"},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"1510465682300437","commenter_b":"Drained the swamp by putting the gators in his bathtub. What happens when they attack him and each other? Too much love of power and love of money in a small space.","commenter_a":"Well, with all his wealthy Cabinet appointments, we can thank Trump for finally draining the swamp, which is unpresidented.","post_message":"This just happened. He said it! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155461555215354","commenter_b":"Cause shes an ASSHOLE","commenter_a":"Let her pay for it.","post_message":"Liberal values..."},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."}]
