[{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"10153647913121051","commenter_b":"@username, Bitches and N***** 'are' two different words....sentence formulation goes a long way towards making one look less uneducated","commenter_a":"Hope the black girl punches the radio when rap artists use that word and call other women bitches","post_message":"Some people say this girl's angry reaction was justified. Others disagree. Decide for yourselves who is right."},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"10153562067157377","commenter_b":"@username She seems just as evil as Cecile Richards.","commenter_a":"The judge should have had Daleiden executed ,so the people in the clinic could sleep at night.","post_message":"\"This is a huge win for the pro-life movement,\" said Jared Woodfill, an attorney for Daleiden. \"The court recognized that the charges brought by the Harris County District Attorney's Office were flawed from their inception.\""},{"comment_id":"10156122375765354","commenter_b":"Wow!!! She had to be real high.","commenter_a":"I am not going to make a pun about a bang.","post_message":"Her mugshot says it all."},{"comment_id":"10154799760844641","commenter_b":"Stop being such a yes woman","commenter_a":"Lol!!! It's Obama fault that a Multinational move jobs overseas!!!! Lol Let's blame Obama for the KKK, Osama, Sunspots, AIDS, making it late to work, and etc..... Daddy Trump is going to fix everything.... hahahhahahaha","post_message":"Some Rexnord workers said they felt left behind by President-elect Donald J. Trump"},{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"}]
