[{"comment_id":"934086226709659","commenter_b":"Put more women in your cabinet!","commenter_a":"I AM MY SISTERS VOICE VOTE DEM :::::::::::REVELATION 21 = THE TWO ARE ONE = TWO TRUMP AND WALKERIGHT ONLYESATANACYES <DID 911 SATANACYESEENTHREE THE FATHER THE SON THE HOLYESPIRIT <<< THEY DID IT NY INDYESHUALLHEARTRUTHEART:::::KY DC = DOVESON CHRIST < TRUE IN THE FLEASH CAME ON THE 3RDAYESON ROCKING < THE TRUTH USABLE <++++}:::::::::::::::::::::::::::::::>ART<:::::::::::::::::::::::::::::::{+++>:<>","post_message":"Born five years before most women could vote in America, Shirley has lived through the Great Depression, two world wars, the Civil Rights Movement, and the moon landing. Today, she’s rooting for something she never thought she’d live to see: the first woman president of the United States."},{"comment_id":"10153268989822894","commenter_b":"A marriage should have 3 parties involved at all times!! Furthermore, I don't think women will ever understand how men think..ijs","commenter_a":"Y'all are so quick to judge. Giving him passes to cheat, doesn't necessarily mean he has cheated. And because she's allowing him to do it without being affected means that nothing is wrong with her self-esteem. If she just doesn't want to give her man something, then she leaves it up to him to decide where to get it. And who's to say he's making the decision to cheat? I highly doubt if she's allowing him to do it and not caring, then he isn't. That's so not how men work. And to say that they shouldn't have gotten married is stupid because they've been married for a while and I'm sure she has grown to bring about this decision with her husband. And you're not married for sex anyways. LOL!","post_message":"Mo’Nique Explains Why She Gives Her Husband ‘Free Passes’ to Cheat: ‘They May Give Something I’m Simply Not Willing to Do’"},{"comment_id":"1070107396359933","commenter_b":"She would have to drug me like Bill Cosby does his women","commenter_a":"This gal needs to get laid.","post_message":"“Her conduct and behavior are appalling, and I am not only disappointed, I am angry, that a member of our faculty acted this way.'"},{"comment_id":"462985670577219","commenter_b":"I'm not pro 15, but we need to realize automation would have occurred with or without a min wage hike anyway. This just hastened it. The problem is most jobs can be made automated including yours too. I don't support give intervention but when pharmacists and construction workers find themselves out of jobs there made need to be some government regulation saying no to so much automation in the future. Human labor being supplemented by robots is not only a minimum wage concern, but one for everyone.","commenter_a":"They got what they wanted, you can't blame Wendy's. Or Wendy's could change the 'Dollar menu' and make it 'Five dollar menu' then maybe they could afford to keep all the help, but then nobody could afford to eat out. Oh well","post_message":"Congratulations, Democrats! Your push for a $15.00 an hour minimum wage has resulted in the destruction of Wendy's jobs at 6,000 stores!    '...we work to offset any impacts of future wage inflation through technology initiatives,' said Wendy's."},{"comment_id":"10154000261646337","commenter_b":"Tiny Fey and Amy Poehler would so destroy you right now with words of girl power and women unitedness. #Womanizer","commenter_a":"#BETsoBlack am I doing this right or nah?","post_message":"'IT'S A REGRESSION': Will Smith stays positive about the #Oscars and Hollywood's bigger problem with diversity..."},{"comment_id":"819567068195360","commenter_b":"Build the wall. Get rid of illegals now.","commenter_a":"Those of you who are trolls (you know who you are) , really need to attempt to get some education, I.e., government or civics classes. 🇺🇸🇺🇸🇺🇸 TRUMP","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"10154339068600399","commenter_b":"'@username keep drinking the kool-aid, Ms. Deplorable.","commenter_a":"As Trump himself is a serial philanderer, I can't fathom how he figures the presence of Gennifer Flowers would hurt Hillary. To me, it just proves that the Great Orange Misogynist sees women as pawns and does not hesitate to try to use them to hurt each other. He is the textbook definition of a male chauvinist pig.","post_message":"'If dopey Mark Cuban of failed Benefactor fame wants to sit in the front row, perhaps I will put Jennifer Flowers right alongside of him!'  Cuban is the leading skeptic when it comes to Trump's claims about his wealth."}]
