[{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please.   #WSHH"},{"comment_id":"731507293614546","commenter_b":"DUMBASSES...HAVE TO KILL THINGS...HUMANS ARE FUCKED UP.","commenter_a":"He should have drug it up on the shore and smashed it's head in with a boat oar. The only thing a fish like that is good for, is seriously limiting the population of other fish in it's habitat. You can't even eat a fish like that, you could try but I wouldn't advise it. #Conservation #BottomFeeders","post_message":"Surprised?"},{"comment_id":"1076789345700753","commenter_b":"Put a bullet in his face. Is she was my daughter or sister, that's exactly what would happen","commenter_a":"ugly pig!!!!!!","post_message":"HATE CRIME! Swept under the rug because she's white and they were black lives matter thugs.  ARE YOU SICK OF THE DOUBLE STANDARD?"},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1591036221183491","commenter_b":"NICE ! Drop that bitch","commenter_a":"That was just so great","post_message":"OUCH! That's gotta hurt.  This bully had it coming."},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"933293890039082","commenter_b":"And any criminal will just turn in their guns! Like they do in Chicago and California!","commenter_a":"Clinton is so clueless!! This isn't about gun control bitch. This is about Obama allowing Muslims to come here knowing the repercussion of this. They were making IED'S in their garage you stupid fuck Clinton. Better start putting a ban on IED'S. Now all these Syrians Obama? Your the terrorist and the democrats are all equally guilty for putting you in and backing you. Come get my guns. You will get them no problem there but you won't be walking away. Black lives matter and Muslims are all terrorist.","post_message":"Wasting no time..."}]
