[{"comment_id":"10153648281727093","commenter_b":"What an ignorant woman.","commenter_a":"She shoulda kept her mouth shut. Definately part of the problem not the solution... Our Dallas officers have absolutely ZERO to do with the recent ON CAMERA MURDERS of those men. So NO JOHNSON IS NO MARTYR. HE WAS A VILE POS THAT GOT JOHNNY C4d","post_message":"The first African-American Miss Alabama said she knows it's not right to feel this way, but can't help it... @webpagelink"},{"comment_id":"10154125168701770","commenter_b":"Oh I see how he filled the room he was in Chicago hahaha the city of thugs","commenter_a":"Can't wait for him to be gone!!!!!!!!","post_message":"Democrats really don't want Obama to leave the White House..."},{"comment_id":"593592797513564","commenter_b":"Absolutely. Bitches get treated!","commenter_a":"@username 😂","post_message":"Watch out"},{"comment_id":"1739336132953313","commenter_b":"Stupid bitch lmfao","commenter_a":"Obummer has been rode so hard by his tranny boyfriend that he has lost his mind and should be hung for treason.","post_message":"Q: What 4 words would you say to Barack Obama?  The Free Thought Project.com (y)"},{"comment_id":"10153990107026955","commenter_b":"See you at Blade Show bitch!","commenter_a":"The rights to a free press, free speech, assembly, and religion are extremely important but none of them matters very much if you can’t defend your own life against aggression. Leave your hands off my guns!","post_message":"BREAKING: Active shooter at Lackland Air Force Base in Texas, at least 2 dead"},{"comment_id":"10157030256485615","commenter_b":"\"The Tennessee hardware store owner who banned \"the homosexual people\" and posted a \"No Gays Allowed\" sign at his business last year recently constructed an outhouse that he's calling a \"Transgender Bathroom.\" @webpagelink","commenter_a":"yeah he test each person that comes in his store","post_message":"And yes, he sells \"choose god or gays\" hats, too..."},{"comment_id":"10154729419757699","commenter_b":"Aww Gee must really be scared of Trump . Just use all the money we send them and rest of south America and build the wall that will do it","commenter_a":"TRUMP 2016 !","post_message":"FOX's Gurnal Scott reports."}]
