[{"comment_id":"10154193452504087","commenter_b":"2 choices: 1. Hillary(blue pill) 2. Trump(red pill)","commenter_a":"Donald Trump killed his own chances to win the presidency. He should shut his mouth. Keep his zipper closed. Closed his Twitter account. Prepare for the debates. Finally, listen to the advice of your children and staff.","post_message":"Trump interrupted Clinton during the debate to call her a \"nasty woman\" as she was reiterating her commitment to raise taxes on the wealthy."},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"1401080203318363","commenter_b":"Well eventually there will come a day of reckoning.","commenter_a":"Notice how these people claim to be Christian meanwhile they do the opposite of what Christians do & they dislike true Christians as much ad they do people of other faiths, they quote the bible to support their homophobia but they don't except & love people who are different, like God says that they should","post_message":"This is absolutely deplorable."},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"1014897985199658","commenter_b":"A FUCKING MEN!!!","commenter_a":"#ALLLIVESMATTER","post_message":"A new low. #BlackLivesMatter"},{"comment_id":"10153144460870950","commenter_b":"Rules are rules and the parents are aware of them before schools starts. There has to be more to this than what is being said by the parents. Schools are not allowed to say anything regarding any matter involving a child. Before I can make an opinion on the matter would like to know the schools side on it.","commenter_a":"That's an understatement...","post_message":"The 8-year-old girl's mother says the elementary school sent her daughter home for wearing a kelly green polo shirt."},{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"}]
