[{"comment_id":"10152713060892623","commenter_b":"Those disgusting guys would not have made it off the beach if I was there. I know I'm just a women but I would hv done everything I could to hurt them","commenter_a":"I don't understand why they did nothing? ! I think I would have screamed, throw things at them, run for help, SOMETHING!","post_message":"\"There’s hundreds, hundreds of people standing there. Watching, looking, seeing, hearing what’s going on.\"  Police say spring break in Panama City Beach will change big-time after video of an alleged gang rape went viral:"},{"comment_id":"10153600714709087","commenter_b":"This lady represents Trump.","commenter_a":"Good! Pepper spray the idiots! There's a difference between protesters and violent rioters! Stand there with your picket signs! And speak your mind but stay out of an arena full of supporters who came to hear Trump speak! This is a travesty of the 1st amendment! No one in the media even shows and exposes the idiocy and rhetoric espoused at BLM movements where they threaten to assault or kill police! Or threaten and degrade black officers maintaining the peace. This is ridiculous! All of these protesters won't have enough time to protest when Trump is in office because they'll be put back to work!","post_message":"#BREAKING: As Donald Trump comes under fire for escalating violence at his rallies, video shows police in Kansas City, Mo., using pepper spray against protesters. WATCH:"},{"comment_id":"575919325907618","commenter_b":"She still does this stuff","commenter_a":"I am with hillary Clinton. All the way.","post_message":"Share if you’re ready to make history."},{"comment_id":"811711869019390","commenter_b":"I wouldnt trust that asshole with my worst enemies life","commenter_a":"He should have never been trusted in the first place.","post_message":"Obama Scrambles And Goes Into Hiding After This Investigation Leaks.  He's doing whatever he can to keep this quiet.  Do you think Obama should not be trusted?"},{"comment_id":"1157488834340407","commenter_b":"I thought she was leaving. No one cares what she says","commenter_a":"She lies as much as killery","post_message":"Miley Cyrus, a Hillary Clinton supporter, is extremely sad."},{"comment_id":"10154263809393598","commenter_b":"A very sick lady, Murderer. Lier. Corrupt.","commenter_a":"SHE WILL EAT THOSE WORDS ONE OF THESE DAYS","post_message":"As the debate begins, remember.... Hillary Clinton: An Unborn Child Just Hours Before Delivery Has No Constitutional Rights"},{"comment_id":"10155066406976509","commenter_b":"Don talking bull**** without proof !","commenter_a":"Everyone dopes in the Olympics China, USA, Germany you name it, everyone, the Russians were just dumb enough to get caught.","post_message":"BREAKING NEWS: Russia has failed in its quest to have a ban on its track and field athletes at the Rio 2016 Olympic Games overturned."}]
