[{"comment_id":"1195382713852612","commenter_b":"Okurumoniwonba Orimekunluyi, you are an idiot. None of what you say is even remotely true. Please pay attention.","commenter_a":"If Elizabeth Warren called me she would certainly get an earful of how despicable she is. She would hang up on me but I wouldn't hang up on her.","post_message":"When Elizabeth Warren isn't busy holding special interests accountable, she finds the time to make some calls for Hillary. Join her: hillaryclinton.com/calls"},{"comment_id":"10154242349186336","commenter_b":"Darwin is going to get this woman one day soon.","commenter_a":"stupidity !!!!!!!!!!","post_message":"'This woman is extremely lucky. We can’t explain why he didn’t get up.'"},{"comment_id":"10153722294756350","commenter_b":"Nobody is forcing people to contribute","commenter_a":"This is what has been attained from people feeling low, down & out. Preacher Joel Osteen had amassed a fortune of $56,508,500 and lives in a $10,500,000 mansion in River Oaks. River Oaks is the wealthiest and most expensive community in Texas.","post_message":"Are you going through a tough time? Pastor Joel Osteen has some advice. (cc: Joel Osteen Ministries)"},{"comment_id":"919963074724525","commenter_b":"It's not burning fast enough.hope they got all there goats out.would be a shame to lose what use to be there virgins","commenter_a":"probably after insurance so they can buy more guns???????????","post_message":"Taking bets...accident or on purpose? Was this an 'act of God'? What do you think?"},{"comment_id":"10153430518633445","commenter_b":"She is no friend of common Americans! This bitch is out for herself and her MIC handlers, fucking traitor!","commenter_a":"Hillary Clinton will say anything to get elected but she is no friend of Marijuana.","post_message":"#Trending - Hillary Clinton Suggests Rescheduling Marijuana, But Does Not Currently Support Like-Minded Legislation."},{"comment_id":"1819434894958282","commenter_b":"'@username pa la princess 😂😂😂😂","commenter_a":"Melissa Kaplan","post_message":"That pose though"},{"comment_id":"10154037346055329","commenter_b":"See bitch William Huybers","commenter_a":"Andria Gamuza Kimberly C Lin","post_message":"ewww...."}]
