[{"comment_id":"10154362433106509","commenter_b":"What a pussy","commenter_a":"Obama = anti christ he wants to disarm us so he can let his refugees attack and we be left defenceless","post_message":"Barack Obama addresses the notion of a 'conspiracy' that 'we are creating a plot to take everybody's guns away so that we can impose martial law...' #GunsInAmerica @webpagelink"},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"10153065871694138","commenter_b":"It was just an upgrade to walking 5 miles each day for water...","commenter_a":"He could have bought a car, he chose not to.","post_message":"He kept a perfect attendance record walking 21 miles to work every day for 10 years."},{"comment_id":"798452466914476","commenter_b":"thank you againe Mr President for saving your citizens from the corporate wolves","commenter_a":"Question: wasn't the FCC suppose to have public comments?","post_message":"BREAKING: This is a huge victory for American consumers.  Share the good news!  Read more: @webpagelink Image by Occupy Democrats."},{"comment_id":"184666305270788","commenter_b":"This stupid woman is probably senile!","commenter_a":"Another lying liberal...we should be surprised?","post_message":"Wow! She didn't think we would find this letter!!"},{"comment_id":"852438651458224","commenter_b":"She's an idiot!","commenter_a":"AS. THE REAL Castro DID FOR THE USA. SEND THE BOAT PEOPLE. RETURN THE FAVOR. SEND OUR BOAT PEOPLE LET THEM SEE HOW THE REAL CUBANS ARRE BEING TREATED THE NUT. JOB IS TALKING. REVOLUTION.ARESST IT PUT IT IN JAIL. THE SCHOOL KNOWS ALL ABOUT HER AND DID NOTHING.INVESTGATE THE SCHOOL THEY HAVE MORE LIKE her","post_message":"Look kids, this is what #liberalism does to the brain!  Pray you're never on a plane with someone like this! You have to see it to believe it:"},{"comment_id":"1274512465962929","commenter_b":"Look at the fucking rat you idiot!","commenter_a":"Ray this is the first one I don't know if I would 😂","post_message":"Would you? #WSHH"}]
