[{"comment_id":"10156175309065231","commenter_b":"She lookin to get paid! I'm sorry ....she a hoe","commenter_a":"Voting democrat","post_message":"Pierson feels her new alliance with the Donald is \"perfect.\""},{"comment_id":"10154103517111178","commenter_b":"Tell the truth its because you give all illegal aliens full medical care.","commenter_a":"They say 17 million people are enrolled so if it cost that much then scrap it","post_message":"Truer words have never been spoken by the president."},{"comment_id":"893404867419235","commenter_b":"Really! Like WTF! Those sharks don't belong there! This bullshit is effecting tourism! Kill'em all, right?? You freakin gluttonous capitalistic bitches! 😡","commenter_a":"o_O *slow blink*","post_message":"Why isn't the government protecting our freedom of beach?"},{"comment_id":"10154144312645861","commenter_b":"I'm sure they don't assume Christians drink wine and eat tiny pieces of bread for attention, nor insult their robes or any other attire calling it dress up. OR stand up and interrupt their prayers/services when they disagree with it! Freedom of religion, and simple respect...ever heard of it? I hope you don't expect anyone to respect your religion!","commenter_a":"He wanted attention, he wanted to upset people. Someone should tell him his dress is too big for him/her....but not to worry Halloween will be here soon enough, and he can go get a new costume to play dress up in.","post_message":"\"I saw community of people come together and take a stand for what was right.\""},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"},{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"10154563644004087","commenter_b":"With the illegals being deported Shitlarys vote count drops","commenter_a":"Funny but if you libturds went to Mexico and tried to live and work there illegally you would end up in prison. Libturds want open borders for cheap votes, no matter how much it harms America. See: \"The Reason Trump Got Elected\" for further reference.","post_message":"The Congressional Hispanic Caucus is requesting a meeting with U.S. Immigration and Customs Enforcement after more than 300 undocumented immigrants were arrested in raids over a 48-hour time span."}]
