[{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."},{"comment_id":"10153400467734228","commenter_b":"Why would anyone expect there are appropriate records if baby stealing was happening? Poor women!","commenter_a":"Records are only as good as your charting if it's not written down it didn't happen ! That's law never said it was a good law so a lot could have been left out","post_message":"\"You are trying to kill my character. You`re trying to lie and say I was at one hospital and you can keep up your records that good.\""},{"comment_id":"10153536148652426","commenter_b":"That's sad! Lawyers can find many ways of getting people out of trouble. Bet the girl didn't show remorse or learn an important lesson.","commenter_a":"Ok, fine people for smoking around children. Then let's raise the fines for texting and driving and add fines for talking and driving. These fines can be used to further aid in our children's education. But most important-people can use their lessons they learned in driver's ed such as using a turn signal and stopping at a stop sign.","post_message":"Should smokers be fined for smoking in cars with kids? A - Yes B - No"},{"comment_id":"1026349820770159","commenter_b":"@username holy shit","commenter_a":"Ashton Thalia Buzash Kaitlyn Mckinnon Heba Syed @username Joshua Miller Quinton Chaz I apologize for the weirdness of this but it's also kind of interesting","post_message":"WARNING: Graphic Content"},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""}]
