[{"comment_id":"852381858149314","commenter_b":"she is a total ASSHOLE and the biggest racist along with her husband. could just imagine how they are raising the girls.","commenter_a":"The only thing I see that she's done is screw the guy that planned to lie, cheat, steal his way into the white house. She did, he did, and they keep going.","post_message":"INSANE VIDEO: IT’S GRADUATION TIME...AND THAT MEANS IT’S TIME FOR OUR RACIST FIRST LADY To Spew Hateful Lies And Rhetoric About Racist White America And The Mistreatment Of Blacks ***WARNING****It's hard to watch this video filled with lies and anger toward white Americans without feeling like your head is about to explode!"},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"10158855992795206","commenter_b":"Your taste is all in your mouth. This woman lies quicker than a spider can grab it's prey. Karma will be, her children practice her art, on her.","commenter_a":"Role model, amazing mother, classy and smart. Love her! #MAGA","post_message":"Today, Donald Trump named Kellyanne Conway as presidential counselor. Here are some interesting facts about her:"},{"comment_id":"10153731471343967","commenter_b":"But a laser pointer. Entertain your cat AND COOK DELICIOUS BACON.","commenter_a":"@username James Speck @username","post_message":"Brilliant"},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"10154400168208525","commenter_b":"Good grief, you ladies are in a panic. There is the morning-after pill for that kind of thing.","commenter_a":"Believe it or not, you don't have to get pregnant. It's a personal choice","post_message":"#BREAKING: President Donald Trump has signed an executive order withdrawing the U.S. from the Trans-Pacific Partnership deal, and has also placed a hiring freeze on some federal workers and cut off funding for international groups that perform abortions. MORE: @webpagelink"},{"comment_id":"1523980264284296","commenter_b":"I love spinning when your winning !! #MAGA #GBA","commenter_a":"I love how this man thinks and his love for Ameirca. :)","post_message":"I think Donald J. Trump has every intention of revising how everything happens in Washington, in terms of how it happens, how fast it happens, the routes you take to make things happen. If I'm right, it's gonna be fun to watch 'cause people's heads are gonna be spinning trying to catch up with him."}]
