[{"comment_id":"10152867699771636","commenter_b":"how sad that people still think he's anything other than a disaster capitalising tory.","commenter_a":"Don't tell me he plans to run for leader of Labour Party again?","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"590770071125294","commenter_b":"Now if these douche bags will leave they know where their bread is buttered.","commenter_a":"They have money! They can easily move wherever they want, away from old bigot Trump and his supporters.","post_message":"Remember the celebrities who said they would leave the country if Donald J. Trump was elected president... @webpagelink"},{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"},{"comment_id":"1038558619518329","commenter_b":"How many more *illegal* guns are gonna kill people before you relize that if these people want guns, they'll get 'em... Illegal or not... #howmany","commenter_a":"There goes a wasted minute that I'll never get back.","post_message":"This video is packed with more celebrities than we could count — and they have one powerful message for the world."},{"comment_id":"1166718606737699","commenter_b":"Why?","commenter_a":"Anyone realize some veterans actually support Kaepernick. Also if you think this is the best country in the world you must be ignoring the debt, constant war, and division of society by ethnicity, race, sex, religion etc. that is plaguing this country. So if you think this country is not oppressive then you are wrong. If you think this country represents equality you are wrong. If you think this country represents democracy you are wrong. If you think this country represents the bourgeoisie elite and capitalist greed then you are right and that is why I won't support the flag not to disrespect the troops who died but to respect them because they died only for greed and American imperialism.","post_message":"Allen West Republic"},{"comment_id":"613032028845756","commenter_b":"Well I can only say if you had to live with Barack Obama as president for 8 years she might see herself that way.","commenter_a":"Else get bitch out of.thire","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"10154357824606037","commenter_b":"Trump doesnt want muslims in the US..period..so","commenter_a":"Trump... ISIS...Today","post_message":"A man armed with guns and explosives told police he was in the area for West Hollywood's gay pride parade."}]
