[{"comment_id":"10153477974742217","commenter_b":"When u search at this matter, u will find that these are european muslims.... not arab muslims or the east muslims. they misunderstood the islamic religion. I hope return to their mind.","commenter_a":"We reject and condemn terroristic attacks which happened in Brussels today. These attacks make our travel to the Union Europeans' countries a more difficulty, and will sufer the syrian refugees and arab muslims who work there from a compulsive procedures at this regard from now on. These actions obstruct anyone wants to travel so as learning and resume his study and those that travel to enjoy short trip. #Islam is a peace religion. we will find your media tell u that muslim persons commited these actions..... but these persons don't believe in any religion, yes. they are extremists. they don't belong to us. All of us feel sad for u","post_message":"Belgian PM calls for \"calmness and solidarity\" in \"black moment\" for country. #Brussels   Latest: bbc.in/21ENlj8"},{"comment_id":"10152959292394753","commenter_b":"I don't think you can read lady. Either that or human compassion is lost on another bitter old woman.","commenter_a":"that is jus nasty to have sex with your stepdad","post_message":"North Las Vegas police are still investigating the rape and child abuse case. The law enforcement are continuing to review what they have a “three-generation case of child abuse” involving the teen rape victim’s mother, Kellie Cherie Phillips, 38, and the man she described as her stepdad, Jondrew Magil Lachaux, 39."},{"comment_id":"957019640987493","commenter_b":"It's normally women who wear high heels that shame women who don't if we are going to be honest. As a woman you can't get into many clubs if you're not in heels.","commenter_a":"On the other hand, I don't think it's right to \"shame\" women who likes to wear heels either.","post_message":"Looks like somebody learned his lesson."},{"comment_id":"10152777705324877","commenter_b":"not true.","commenter_a":"True. And she knows and will continue to go along with... People like them are ALL ABOUT money, and will do ANYTHING to keep it coming in their accounts!","post_message":"Mike Huckabee: Jay Z Is Crossing The Line Of Husband To Pimp. Read more of the conservative's tirade on Beyonce and Jay Z.   Grio fam, read his words and sound off with your thoughts."},{"comment_id":"987027218019347","commenter_b":"No you dumb ass fuck, you named 3 individuals over a period of time, now open your local paper and tell me how many blacks are killed by other blacks \"everyday\" and tell me did they deserve it? Black people need to sweep our own porch first, once we show unity, they'll have to respect \"us\"! Hell how can we war with them, if we show up to the war and half of our troops are dead from other blacks","commenter_a":"I'm so tired of y'all reporting about police killings. I wake up everyday and see \"us\" killings!!","post_message":"Stay woke.   Report shows that 1,134 people were killed by police in 2015. About 47.2 percent of those who died were people of color. Another 53.6 percent of people of color who were killed by cops were unarmed.   The study shows that young African-American men are nine times more likely to be murdered by cops than other people in our country. DETAILS ---> @webpagelink"},{"comment_id":"10153861731493352","commenter_b":"Beat you make ass. Seems like that's what the people in the world needs.. #anasswhipping","commenter_a":"Haha. Wow.","post_message":"Woman frantically calls police after she finds a naked intruder inside her house taking a shower and doing his laundry"},{"comment_id":"981872948594888","commenter_b":"Ugly garment..her Mamma didn't teach her well at all.","commenter_a":"Yeah","post_message":"Hillary Perón"}]
