[{"comment_id":"1170886402975254","commenter_b":"Great family, a drunk, his brother a cheating womanizer, and his lying idot of a wife","commenter_a":"It's ok he will be let go with no repercussions !! 1 he is a Clinton 2 he is in California","post_message":"Former President Bill Clinton's brother, Roger Clinton, has been arrested for DUI in Redondo Beach, California."},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"1027250217329982","commenter_b":"Samantha please do me a favor you sound like and intelligent young lady .HERE GOES LOOK AT SOCIALISUM IN SOUTH AMERICA THE People ARE STARVING LIVING LIKE RATS AND THE BIG BOYS ARE TAKING THE MONEY 85 percent TAXATION SAME CRAP IN CANADA AND THEY WILL SWARE ITS THE GREATEST FREEDOM AND FREE MARKETS ARE THE ONLY WAY NOT CONTROL","commenter_a":"Every state should have open primaries. Pretty disappointed in my state of NY. So many people can't vote because of this.","post_message":""},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"10156273080720389","commenter_b":"She's a gutless wonder!","commenter_a":"good for you rudy.now call out the queen of liars abad tell her this country does not need a corrupt murdereer of ameicans in bengazi...","post_message":"In Case You Missed It: Rudy can be a little blunt sometimes."},{"comment_id":"10155110249450294","commenter_b":"She got caught in the moment ... She looks like she's on drugs!!! This b!tch ain't news worthy...","commenter_a":"I saw it also and I took it that she was comforting her BF and they were both distressed about what just happened in the game. I remember it was a tense time","post_message":"Ohio State Buckeyes won the game ... but here's the six seconds from last night's Sugar Bowl that everyone is talking about today. What is happening in this video?!"},{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."}]
