[{"comment_id":"1078002582252504","commenter_b":"Boycott Mexico , all vacationing boycott Mexico.","commenter_a":"What ! The Texicans beat your butts once and they can still do it again !","post_message":"Haven't they heard? You don't mess with Texas..."},{"comment_id":"10154269776132619","commenter_b":"What is ISRAEL SUPPOSED TO DO?????????? let the rest of the world walk all over them????? I don't think so..... If a lot more countries in the world were like ISRAEL the world would be a better place....","commenter_a":"Let's black list the UN. It needs to go. Thugs in suits.","post_message":"A push is currently being made in the United Nations to have the Israeli Defense Forces added to the blacklist of the council for Children and Armed Conflict."},{"comment_id":"10153689211286438","commenter_b":"Are uggos ugly women who like to hire pretty secretaries for pay raise kitty chow.","commenter_a":"Lesbians can rape just as easily as men.","post_message":"It’s time to stop pretending that only men perpetuate violence and women are only victims of it."},{"comment_id":"10153576265156336","commenter_b":"Suck it up, buttercup.","commenter_a":"Wonder if this clown avoids baseball games","post_message":"Lambert’s Café is known as “Home of the Throwed Roll,” where servers at the restaurant are known for tossing the rolls to customers."},{"comment_id":"1003105503069410","commenter_b":"Taryn ignore her, she will forever think she is right about everything even though she's not","commenter_a":"Or we could just let every woman decide for herself.. If you don't agree with abortion, just don't get one. But that doesn't mean other people should be forced into the way you think..","post_message":"Not a bad thought - Let us know if you agree!"},{"comment_id":"10153205553056782","commenter_b":"@username...the difference is that I am a legal United States Citizen and the illegal criminal is not. They broke the law so that makes them a criminal..and as for pushing...the illegals are the ones that are not going to like the results.. You come to the U.S. legally and you are welcome with open arms. Illegals come here by breaking the law and then refuse to learn English and then demand they be given the same rights as American citizens and for things to be changed to fit them...BS!!!!","commenter_a":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"1004633596257472","commenter_b":"I would do the same only faster. Highways are for vehicles not pedestrians. Soooo expect to get run down of you are blocking traffic on a tiadwa","commenter_a":"Finished my run thru Arizona, didn't see no protesters ;)","post_message":"WATCH: DRIVER FED UP WITH ANTI-TRUMP Terrorists Blocking Road Drives Through Crowd…Reaction Of AZ Police Officer…Priceless"}]
