[{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police.  Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded.  No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"1222948041117063","commenter_b":"Grow some balls bitch!","commenter_a":"You look redickuselse's.........","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"685676394932163","commenter_b":"Throw her in jail.","commenter_a":"Plus she is now blaming her server stupidity on Collin Powell. Isn't that racist?","post_message":"The double standard..."},{"comment_id":"395997370588557","commenter_b":"all these weman want is his money and 15 minutes of fame ,,,REALLY","commenter_a":"Had to tell her name because not getting any attention.","post_message":"Do you believe Jane Doe #2, Jennifer Thompson, considering she said she took the $700 Bill Cosby reportedly gave her after this act???"},{"comment_id":"10154712423493812","commenter_b":"Oh goody. The racist, sexist, xenophobe will meet the corrupt, mass murderer President of Mexico if he wins.","commenter_a":"To do what? Give him the bill for the wall?","post_message":"Donald J. Trump says, if he's elected, he would meet with Mexico's President Enrique Peña Nieto. Last week, Pres. Nieto said he'd meet with Trump, despite previously comparing him to Hitler and Mussolini."},{"comment_id":"10153437491481130","commenter_b":"Arrogant bitch","commenter_a":"Hilary is a dumb lying bitch!!","post_message":"Sick burn, Hillary Clinton!  Video: NowThis"},{"comment_id":"10153677657398132","commenter_b":"She to good for him it's time she finds a real man","commenter_a":"More like scott dick sack !","post_message":"'They urge her to never take him back.'"}]
