[{"comment_id":"2175292792696203","commenter_b":"Fire her","commenter_a":"I am sure there are plenty of dancers to replace her.","post_message":"Ungrateful Rockette Snowflake Posts Anti-Trump Rant Over Being Forced To Perform At Inauguration"},{"comment_id":"964810136945374","commenter_b":"Woman is nuts , how did she get the job in the first place?","commenter_a":"I don't think she wants fame. She's taking a stand for what she believes in. Just like everyone else is standing up for what they believe in. Only one that's making her famous is the ones giving her attention. #DRAMASEEKERS","post_message":"Kim Davis's latest attention-grab has blown up in her face."},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."},{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"1676979775916397","commenter_b":"IF TRUMP CANT HANDLE SOME FEMALE MODERATOR HOW THE HELL WOULD HE HANDLE WORLD LEADERS? GIVE ME A BREAK. DONT EMBARRASS THE REST OF THE COUNTRY NH!!!","commenter_a":"New Hampshire vote for him! Trust Trump! Thank you for volunteers!","post_message":"I enjoyed a great breakfast at the Airport Diner! Everyone get out & vote in New Hampshire! Lets MAKE AMERICA GREAT AGAIN! Voting questions? @webpagelink"},{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"}]
