[{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."},{"comment_id":"10156352332210354","commenter_b":"whore.","commenter_a":"Another one that is missing all that gray matter between the ears...","post_message":"Feminist Gloria Steinem is a _________________."},{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"10154249016409170","commenter_b":"She's a soft spoken HACK!","commenter_a":"Bam, i love the dems motto, vote early and often. How is this right. Another star for NC. Good job","post_message":"Usually Democrats can play the race card with no consequences. Not this time."},{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"},{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."},{"comment_id":"10155463176480294","commenter_b":"Jordan Beier","commenter_a":"I saw about at two points when the injury could have happened (the roll, and when he was thrown out of the ring) and the dropkick could have finished off the injury but the way he was handled after the injury didn't help matters. According to the earlier reports he died at the hospital but he didn't look alive to me.","post_message":"When the bout ended, medical personnel transferred Aguayo to the hospital, where local media reports he was pronounced dead:"}]
