[{"comment_id":"1090368724307930","commenter_b":"Women fought for many, many decades for the right to vote.","commenter_a":"Yay, and now we will get to vote in an awesome woman as president!","post_message":"The United States is 239 years old. Women have been able to vote for only 95 of those years."},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"10154250951204641","commenter_b":"Ok, u say it's a choice so that person chose to have unprotected sex and got prego. Who's fault is that. That child didn't ask to be killed because of their parent made a choice to not put a condominium on. The consequence of having unprotected sex is a baby. If u don't want to have a baby don't have sex. Abortion us an e cause to not take respinsibilty for ur actions. Abortion isn't safe. It leaves scared emotionally.","commenter_a":"If you don't want an abortion fine, but who the hell are you to tell another person who is getting a safe procedure by professionals what they can or can not do to there bodies? What if someone was raped, low financial income, mentally unstable, or if the pregnancy was unsafe for mother and baby? Explain that to your petty beliefs of striping women of he right TO THEIR OWN BODIES!!","post_message":"The 5-3 ruling is the most significant decision from the U.S. Supreme Court on abortion in two decades and could serve to deter other states from passing so-called \"clinic shutdown\" laws."},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"1802126320030739","commenter_b":"I still say his daughter should be charged with inciting a riot! All damages, and the protester that was killed. I still think she was doing all of this to get a paycheck from the city. No difference between her and Browns momma in Ferguson Missouri. Remember her jumping up and down on somebody's car screaming \"Burn this mother*ucker down\" referring to the city! Was she charged? Hell no, I still wonder if she got paid ? Bitch should have been buried under the jail.","commenter_a":"Ah, more clickbait. Headline: Dash Cam Footage Released. Story: Police are not releasing the dash camera footage because..... Gotta love the manipulative lies in these article headlines that these sites put out just so they can get paid per click to the site.","post_message":"Riots have critically wounded one already and now it's proven he had a gun, not a book..."},{"comment_id":"10153446783647293","commenter_b":"-cough- There are already Muslims in America. -cough-","commenter_a":"Trump for President No muslims in America","post_message":"Donald Trump has his campaign rally groove — poll numbers, protesters, Putin, and of course, making America great again."}]
