[{"comment_id":"10153795049694199","commenter_b":"I thought he was dead....ooopps","commenter_a":"April fools","post_message":""},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"10153420150224087","commenter_b":"jeanne ruzzin: Ivana is a big woman and anyone who tried to push her around would surely regret it.","commenter_a":"Donald Trump, serial adulterer. Brutally assaulted Ivana and paid her off. Talks constantly about wanting to bang his daughter. Meanwhile, Hillary has been a faithful spouse, who had every right to choose whatever she wanted in the wake of her husband's cheating. Figures The Donald would stoop to #VictimBlaming.","post_message":"“If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong!” Donald J. Trump tweeted."},{"comment_id":"1261804000541268","commenter_b":"WHy do you follow him?","commenter_a":"The word \"voter\" isn't in the constitution Bernie. You lost man..too out of touch","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"1094996023854086","commenter_b":"What an ignorant woman..,","commenter_a":"Beautiful! So glad she will be recognized. This Pope restores a bit of faith in me for the Catholic Church!","post_message":"Mother Teresa of Calcutta, a nun who dedicated her life to helping the poor, will be made a saint of the Roman Catholic Church at a ceremony on Sept. 4, Pope Francis has announced: @webpagelink"},{"comment_id":"10154557066322908","commenter_b":"feelthebern.org :)","commenter_a":"Do not vote for Bernie Sanders, he is VERY MISGUIDED!!!","post_message":""},{"comment_id":"10153751890519411","commenter_b":"Fuck Israel baby killers.","commenter_a":"The alleged tens of thousands of “rockets” from Gaza killed how many Israelis so far? How many? Palestine has a legal right of self-defense whether Israel likes it or not. Saying that Israel is a victim is like saying that Hitler acted in self defense. Israel has no more right to Palestine than the Nazis had over Austria, Hungary, Poland, etc... In 2000, 57 Arab and Islamic countries offered full diplomatic recognition of Israel if they returned to 1967 borders. Israel never acknowledged this offer. Israel kills in the name of self defense. US kills in the name of democracy. When they fight back they are called terrorists. When it is said to them: \"Make not mischief on the earth,\" they say: \"We are only peacemakers.\" [Quran 2:11] Isn't this the case today... in the name of Freedom and Democracy! Law of current world Muslims = Guilty (until proven innocent) ...","post_message":"She died of multiple wounds in a hospital after bleeding in the street for 30 minutes."}]
