[{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"},{"comment_id":"921846451264234","commenter_b":"Hey al sharpton you and the guy next to you with the dorkey looking glasses on why don't you preach for colored people to be good instead of hate or is it because your so friggin stupid . I never realized that years ago back when you were a fat boy some one tried to kill you I guess your were spared so into the future you could spread your hate .","commenter_a":"Pay your taxes Deadbeat ! plus penalties, plus interest, You will when Trump takes over !","post_message":"\"...offensive and insulting.\""},{"comment_id":"1217783301639772","commenter_b":"It's new- tella. Stfu","commenter_a":"Some people say nut-ell-uh and he's right. Nutella is absolutely nut-ell-uh. New-tell-uh is wrong.","post_message":"The right way to say 12 brand names you've been mispronouncing your whole life."},{"comment_id":"10153953005567464","commenter_b":"Norma Pickford love your BS where you get it from? @webpagelink","commenter_a":"I trust you to do the right thing for America and the workers of America. Don't weaken. You keep doing your part and I will keep praying to the Lord to bless us with yo uh in the Whitehouse","post_message":"Politico reports Obama's Department of Labor is using H-1B foreign workers while many Americans are jobless. That is wrong. The H-1B visa program is broken and I have a plan to fix it: @webpagelink"},{"comment_id":"1698726270383299","commenter_b":"@username I DON'T KNOW WHAT YOU ARE SMOKING OR DRINKING BUT EVERY SINGLE DAY HE LAYS OUT POLICY....1. CLOSED BORDER, 2. DEPORT ILLEGALS, 3, BUILD A WALL. 4 HEALTH INSURANCE OVER STATE LINES SO IT IS COMPETITIVE. 5. BUILD THE MILITARY...6. IMMEDIATELY DEFEAT ISIS...7 SMART TRADE NOT JUST FREE TRADE WHICH BROKE THE COUNTRY..8. CUT TAXES FOR MIDDLE CLASS..9...TAX COMPANIES GOING OUTSIDE THE USA TO MANUFACTURE AND SELL HERE WITH NO PENALTY. 10. SMALLER GOVERNMENT, TRIM COSTS, AND WASTE. 11. PLACE CONSERVATIVE JUDGES ON SC...HE WILL NAME THE CHOICES BEFORE ELECTION 12. PRO LIFE...13.NO SALARY FOR HIMSELF 14. EDUCATION BACK TO THE STATES...NO MORE COMMON CORE...I GO ON BUT YOU NEED TO PAY ATTENTION AND STOP SPOUTING LIES....YES ONCE HE GETS IN...THE PENTAGON AND OTHERS WILL GIVE HIM INFO HE DOES NOT YET HAVE ACCESS TO...BECAUSE OF THAT NEW INFO, HE MAY HAVE TO ALTER THINGS SOME...THAT'S TRUE OF EVERY ...","commenter_a":"Yeah. Donny Trump and his lackeys DO NOT get to redefine what a conservative is. Many many real conservatives have fought hard, long battles over the decades to pull this nation back onto the constitutional rails advocating for founding principles. This fight has always been against politicians of the democrat party and republican establishment put there in part with Donny Trump donations. Where was Donny when some were standing tall against amnesty? Where was Donny when some were fighting Obamacare? Where was Donny when some were fighting to get Planned Parenthood defunded? Where was Donny when a certain someone was fighting the unconstitutional DC gun ban? Where was Donny when average citizens were having their homes confiscated by local governments so rich people could use them instead............... He was on the other side, or silent......because it didn't benefit him personally to be on the right side. Trumpers are for a ...","post_message":"Dana Loesch unloads: \"She made it personal first — I’m just doing it the Trump way: you come at me, I’ll come back at you three times as hard. You like it now?\""},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"1008831639165859","commenter_b":"Evil, vile woman.","commenter_a":"POS!","post_message":"Never forget..."}]
