[{"comment_id":"1170305866326090","commenter_b":"'@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"10153676322456509","commenter_b":"Says the girl with gigantic tits and a gun in one of her photos...","commenter_a":"THUGS","post_message":"Dozens of motorcycle rallies will take place nationwide this weekend amid sky-high tensions after a biker gang shootout left nine people dead in Texas. @webpagelink"},{"comment_id":"10153136670568010","commenter_b":"Amen.","commenter_a":"Mr Stewart, your request to resign has been denied. The American people need you to shed light on the ridiculousness and political shenanigans in Washington DC. Love, virtually every American.","post_message":"'[Jon] Stewart has been a voice of astonishment and outrage, sometimes for comic effect, sometimes heartfelt and often both — a safety valve, a tonic at the end of the latest hard day, comforting confirmation that you are not the only person to find the world out of joint,' critic Robert Lloyd says of Stewart's impending departure from 'The Daily Show.'"},{"comment_id":"10152528871250667","commenter_b":"What union???","commenter_a":"They get enough through their union","post_message":"President Obama will call on Congress to require companies to give workers up to seven days of paid sick leave a year, a senior adviser said Wednesday. Obama will also take executive action to give at least six weeks of paid leave to federal employees after the birth or adoption of a child."},{"comment_id":"10153366619543635","commenter_b":"Nope. I thought you knew better than that.","commenter_a":"Quran (3:56) - 'As to those who reject faith, I will punish them with terrible agony in this world and in the Hereafter, nor will they have anyone to help.'","post_message":"Hillary Clinton: 'Muslims Have Nothing to Do With Terrorism'"},{"comment_id":"1369597926402497","commenter_b":"Vote for Ohillary then...you deserve her","commenter_a":"Republicans have been telling trump supporters for months they wouldn't vote for trump. Now trumpsters are acting like it's a surprise. Well...surprise. #NeverTrump","post_message":"Sorry, Rick Scott."},{"comment_id":"10153708694531955","commenter_b":"Stop all immigration","commenter_a":"Stupid people.","post_message":"Congress to vote on right of Muslims to migrate..."}]
