[{"comment_id":"1096148677171405","commenter_b":"Trump should avoided all those snakes in the swamps.. They are traitors like Judas..","commenter_a":"No. No. Not at all!","post_message":"Question of the Day: Should President-elect Donald J. Trump trust people like President Obama, Al Gore, Rahm Emanuel and Mitt Romney?"},{"comment_id":"1114415161915837","commenter_b":"Sweet! Kill all the muslims too!","commenter_a":"Two wrongs do not make it right.","post_message":"#Canada #EndTimeHeadlines #Quebec"},{"comment_id":"1492050597481632","commenter_b":"Then your whole family is \"skewed\".","commenter_a":"That's funny, because all of the vets in my family are voting for Hillary. Is this another skewed poll? I'd love to see where survey monkey dug up the survey subjects. Here's the problem with the poll... Only people who are passionate enough or crazy enough are going to hang on the line to take a survey at this point... I.E. Trump supporters. Most smart people usually just vote and don't waste their time with surveys.","post_message":"But Hillary Clinton is perceived more favorably on the use of nuclear weapons. Here's where things stand."},{"comment_id":"516575861835702","commenter_b":"Just shut the fuck up.","commenter_a":"Here a question , if tuition is free in the next years , does my daughter get a \" Refund \" on what she has paid in so far ?If Debt relief is on the table then she should be paid back for having the cash up front to pay for her school....right ?","post_message":"\"He said if a million students march on Washington for free college, that's the only way we're going to win. That's a really inspiring thing to hear.\""},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153528994604641","commenter_b":"What's up with her fingers?!!!","commenter_a":"Karolynn Cevidanes","post_message":"Taiwan puts porn star on metro cards. They sell out."},{"comment_id":"10154114787935329","commenter_b":"LOL Chad.... Mom I'd be so mad!!!","commenter_a":"Chad Stacy Mike Deb don't buy these for the girls!!","post_message":"\"Her butt-length hair is now chin length. I was lucky to save that much.\""}]
