[{"comment_id":"1052426431445034","commenter_b":"You do realise the Weasel is trying to kill the Woodpecker, right ?","commenter_a":"Nature is amazing! Humans could learn from it.","post_message":"This amazing photograph shows a weasel RIDING a woodpecker!"},{"comment_id":"10154524570660579","commenter_b":"IS THAT A BED SPREAD KILLARY IS WEARING. MY GOSH THAT WOMEN IS SOOOOOOOOOOOOOO UGLY","commenter_a":"I am with her","post_message":"Senator Elizabeth Warren campaigns with Hillary Clinton in Ohio.  Watch the complete video here: @webpagelink"},{"comment_id":"10153754963576636","commenter_b":"oh god im sick of seeing this the vote has been and gone in favour of leave just bloody get over it ,and out of the 2 mil that have signed how many are actually british,didn't know this was a world wide petition","commenter_a":"Keep politics out of music.","post_message":"The petition is unprecedentedly popular"},{"comment_id":"10154245788639060","commenter_b":"'Women: Kill yourselves.'","commenter_a":"Rename this rag to The Feminist. I'm sure that there was something else happening in the world today more important than finding another excuse the use the word misogyny in an article. Generally more men die in every society than women by an order of magnitude. Women have a lot of catching up to do to meet those equality of outcome goals.","post_message":"The murder of a young woman in South Korea has prompted hand-wringing over festering misogyny in a country that ranks near the bottom of the pile for gender equality"},{"comment_id":"10153151146755950","commenter_b":"Seriously, can this bitch go away?","commenter_a":"Nope don't believe it","post_message":"During their private meeting, Pope Francis told Kim Davis to stay strong, according to her lawyer."},{"comment_id":"845581582242351","commenter_b":"Dyson is a racist pig ! Don't let the media try to take the spotlight off of Hillery ! She is the CRIMINAL !","commenter_a":"The pits of academia!! But good students will learn despite him.","post_message":"This outburst would be laughable if you ignore the fact that he's a 'respected' professor who gets to go on TV and say this."},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"}]
