[{"comment_id":"10153557846293984","commenter_b":"just leave her alone!","commenter_a":"For gosh sake's, get a life!","post_message":"Wow, just when you thought people forgot about Paula Deen's problems, this shocking photograph surfaces..."},{"comment_id":"10154729609496729","commenter_b":"Unfit evil lying grandma killery","commenter_a":"She only said it because she wanted to diffuse Trumps statement. Too late to get on that band wagon. Meanwhile American lives are lost due to stupidity.","post_message":"Whoa. About damn time."},{"comment_id":"821114344592574","commenter_b":"She doesn't owe anyone an explanation!","commenter_a":"Mustn't piss off the militant feminists","post_message":"\"Anyone that truly knows me, knows my heart and knows what I meant.”"},{"comment_id":"10156191527000354","commenter_b":"Huma, you criminal bitch, up yours.","commenter_a":"Dr Ben Carson: \"Islam is not consistent, not compatible with the Judeo-Christian Values and Principles of America, the U.S. Constitution, Sovereign Individual Freedom and Liberty Dr. Ben Carson nailed it on the head, and like Trump, is not 1 ounce of 1 iota fearful of any biased politically correct media backlash because he states the truth as it is, not as they want it to be. Those who are ignorant of the Islamist threat and unwilling to confront it, will be conquered, subjugated, enslaved, raped, tortured, and exterminated over time. David Wood on Islam's 3 stages of Jihad @webpagelink","post_message":"\"Huma’s history includes her past work at an Islamist periodical, the Journal of Muslim Minority Affairs (JMMA). The journal was founded by a man named Abdullah Omar Naseef, who would later go on to aid Al Qaeda’s operations worldwide.\"  MORE..."},{"comment_id":"10154431713909411","commenter_b":"It would be good only if happen in America, Israel, Saudi Arabia, Turkey, England or some another war spreading and terror supporting country. All what happen in peaceful countries is bad and for regret. Thos who spread death around world, deserve it back in they own country.","commenter_a":"Good.","post_message":"BREAKING: Accident happened in Hualien County on Taiwan's mountainous eastern coast"},{"comment_id":"10153079641390950","commenter_b":"Bitch, fuck you and the white man!","commenter_a":"Jorge Ramos can kiss my hispanic behind! Go back to Univision y callate la boca! Legal hispanics are tired of paying for ANY illegals from ALL COUNTRIES (not only Spanish speaking) with our hard earned tax dollars!","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"10153640663754205","commenter_b":"#LetThemEatTrump #FuckTheDNC","commenter_a":"Hillary will have us in a war with Iran. We need to avoid Hillary at all cost.","post_message":""}]
