[{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"},{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"},{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"},{"comment_id":"10153190910859607","commenter_b":"Little a$$wipe","commenter_a":"Uf you don't like what they serve,bring your own.","post_message":"The video of a UConn student berating food service workers who refused to sell him jalapeno-bacon mac and cheese prompted a group of students to start an online fundraiser to give the beleaguered employees a well-deserved night out."},{"comment_id":"394396457415315","commenter_b":"Muslim women why do you want to stay somewhere your notttttttt wantedddddddd !!!!!!!!!!!","commenter_a":"There was nothing wrong with America until THEY came here to destroy everything we have worked so hard for!!! She and eveyone like her needs to go back where they came from!!","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"645119115621270","commenter_b":"GET A JOB BITCH!","commenter_a":"Who's going to pay . . . .? YOU ARE!!!!!","post_message":"America.....someday."},{"comment_id":"10153306237383984","commenter_b":"It's about d**n time......quit dragging your feet and file the articles....make sure to include all his bogus names in the charges including the name Davis","commenter_a":"If it hasn't been done by now,it's not going to happen.He might be impeached, but to actually 'remove' him from office takes a seperate action,and that's the ultimate goal.But.........don't get your hopes up. Saying and doing....are seperate issues as well!","post_message":"Wow. This guy has a lot of guts to go after Obama in this way. Do you hope his plan to take down Obama is successful?"}]
