[{"comment_id":"10153945489322522","commenter_b":"And more illegal aliens in states Trump won","commenter_a":"If the electoral College didn't exist. There would be no need to campaign outside of New York and California. The election is over. The results are in. Clinton conceded. Trump won. Move on. If America really wanted to elect Clinton, perhaps more Americans should have voted!","post_message":"It's official:"},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."},{"comment_id":"1362948977061222","commenter_b":"@username oh look a grammar nazi, good burn lol","commenter_a":"First of all I know what it's like to work in a shop with just men. Men talk locker room talk. What you do think woman talk the same way! Shut the F up! It works both ways! Until you know what it's like to work in an all male job you can shut up!","post_message":"This rape survivor just took a powerful stand against Jeff Sessions."},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"513297895525170","commenter_b":"common texans stop sharia now ! it's time to play cowboys and muslims !","commenter_a":"Way to go if they don't like it move back to Iran, Iraq or Saudi Arabia","post_message":"WAY TO GO TEXAS..."},{"comment_id":"882901261808481","commenter_b":"Wow. It's just a military organization, and not a very good one. Your fear is irrational and betrays you, allows you to be easily manipulated.","commenter_a":"Ok. These are Islamic extremists who believe that death in the service to their religion is the highest honor they can achieve. I'm fairly certain they've got some kind of contingency plan in place in event that their current leaders achieve \"martyrdom\". I'm just going to put that out there. \"We've killed more of their leaders\". So what? They want to die. They're promised 74 virgins in the afterlife. I'm absolutely positive there are plans in effect to appoint successors to those leaders who are destroyed.","post_message":"U.S.-led forces have killed 10 Islamic State leaders in air strikes, including individuals linked to the Paris attacks."}]
