[{"comment_id":"1725568321015816","commenter_b":"I see lots of people who are saying \"see a wall won't help..\" Well the truth is the government doesn't give a crap about drugs coming into this country. They will make their money off addicts and death and jail time. What the government won't make money off of is illegal immigrants not paying taxes. That's the only reason for the wall. The government just wants their cut.","commenter_a":"Nick Cal","post_message":"800-yard-long tunnel found between Mexico and San Diego containing 1 ton of cocaine and 7 tons of marijuana. It's believed to be the longest cross-border tunnel ever discovered. @webpagelink"},{"comment_id":"483414185182495","commenter_b":"She has NO AUTHORITY!!!","commenter_a":"Who is she- he","post_message":"Michelle Obama just made a major move on gun confiscation.  This is ridiculous, restrictive gun laws cause HIGHER murder rates.  Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1077509702340944","commenter_b":"She's a vulture.","commenter_a":"She is disgracing American's right to vote. She is labeling anyone who is not a Democrat. In other words we are \"basket cases\"! It's one thing to bash Trump, quite another to degrade voters.","post_message":"Hillary Clinton is taking heat for saying \"you could put half of Trump’s supporters into what I call the ‘basket of deplorables’. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\" What do you think?"},{"comment_id":"10155164817270093","commenter_b":"Hilarious. And I can't even fault people for mistaking it as serious because that IS how absurd feminists sound most of the time.","commenter_a":"Good one!","post_message":"Talking about mansplaining, manspreading and manslamming is not enough. We also must fight against manterrogating, manpacking, mansulting, and bropen-mouth chewing!"},{"comment_id":"10153611499316955","commenter_b":"Dumb broad should have to eat it herself before feeding the garbage to our kids.","commenter_a":"Good! If you eat what she eats you might end up looking like her!!!!!","post_message":"Students celebrate as school drops Michelle O lunch rules..."},{"comment_id":"10153763460367629","commenter_b":"The wall will be built of hatred and ignorance.","commenter_a":"Creepy!","post_message":"So cute!"},{"comment_id":"509489615909884","commenter_b":"No She is a pig.","commenter_a":"She is also a jackass","post_message":"Canada: Muslim Conservative who decried party's Islamophobia is really a Liberal"}]
