[{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"10156112421560293","commenter_b":"LIFE is what they should get. turn their a**holes inside out by the sisters...","commenter_a":"These people should be charged with sexual slavery of a minor. They should have a very long prison sentence.","post_message":"Phone calls about possible human trafficking and a missing teenager led Tuscumbia police to arrest these three suspects:"},{"comment_id":"1172311699525637","commenter_b":"Fuck You! Get off your fat ass and get a fucking JOB!","commenter_a":"All I can do is laugh","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"942297612493435","commenter_b":"Yep....her attitude says it all!","commenter_a":"\"What difference does it make?\"","post_message":"\"I will not quit on you. I will fight for you. I will be there for you every single day.\"—Hillary in Iowa City, Iowa yesterday via Hillary for Iowa"},{"comment_id":"10156026923975354","commenter_b":"She makes me sick .","commenter_a":"Sadly, the low information voters, which seems like 70% of the populace today, buys her act hook, line and sinker...Then again, if she is so naive about servers and cell phones, who on earth wants this dimwit in the White House (again)...","post_message":"A reporter asked if she had attempted to “wipe” her server. She replied, “What, like, with a cloth or something?” And she didn't stop there..."},{"comment_id":"10150772965449999","commenter_b":"She's going to wear the same shoes every day forever? What if her feet keep changing?","commenter_a":"If you paid $1000 for shoes you will have the rest of your life, you got a bargain. If you hadn't you would have spent more on shoes that didn't fit, hurt, were too high, and you wouldn't wear them. Not extravagant at all; I would say it was smart shopping.","post_message":"\"I know I am going to take a lot of heat for what I am about to tell you, but I just spent almost $1,000 for a pair of custom shoes.\""},{"comment_id":"404730193048608","commenter_b":"Go back to your own country and suck off your own people!!!! Get out!!","commenter_a":"How about dog food it has no bacon in it.","post_message":"This group wants a low price halal food shelf..."}]
