[{"comment_id":"1353337611353126","commenter_b":"What needs to happen if Trump wants to make America great again is give it back to the original owners. I think it's funny when Trump supporters say their not racist and some aren't, yet you must know that so many are. That's why there's a popular Trump chant \"Make America white again\" which is ignorant because it never was!!! You killed off the main population of natives then brought the Africans here to work your farms without as much as a thank you. If true justice and freedom or anything great were to happen in that case we would pack all you European folk up and send ya shipping. You bitch about minorities yet your ancestors brought our ancestors here, to a land stolen from anothers ancestors. You are the problem and the contradiction, you should leave. But really all we want is to live peacefully with everyone now ...","commenter_a":"Went from racist, Muslim, and a wife who was one of the uncouth \"first lady\" ever.","post_message":"America DOES NOT stand with Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153163157971130","commenter_b":"Nope...move along","commenter_a":"I hated the first one...I guess I'm not the audience their after.","post_message":"Thunder-buddies for life!"},{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"1045431208809965","commenter_b":"This is not news worthy.","commenter_a":"Who cares?","post_message":"BREAKING> Beijing wins bid to host 2022 Winter Olympics. China's capital will be first city to host summer & winter games."},{"comment_id":"717054201797155","commenter_b":"Yeah, she'll get sammich stains all over the front.","commenter_a":"That's a strange dress to wear in a kitchen... Doesn't she know women are better off today than being nothing more than owned objects","post_message":"Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay"},{"comment_id":"10153187675581336","commenter_b":"Obviously the Muslim student. If she doesn't want to watch it go get a coffee or do something else. I mean I don't like certain movies but instead of causing a ruckus I just don't go see it. Remember...we do live in a FREE country.","commenter_a":"We're just going to let them dictate to us what we can watch in our own country!?!","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""}]
