[{"comment_id":"10154690577255329","commenter_b":"Yeah, like. Hey white girls: YOU ARE FREAKING EVERYWHERE. Chill.","commenter_a":"Please don't come on here saying white girl magic and all prom dresses are beautiful cause i swear to god.","post_message":"#BlackGirlMagic is real."},{"comment_id":"10153257370521130","commenter_b":"She probably wouldn't be as beautiful as you are","commenter_a":"Mehul","post_message":"He said she looked very beautiful and attractive before marriage, but when he woke up in the morning and found that she had washed the [makeup] off her face, he was frightened as he thought she was a thief."},{"comment_id":"10150716535004999","commenter_b":"I forgot to add that Polish women are among the most beautiful ladies in the world.","commenter_a":"As an alternative to the Polin museum (which is excellent) I would recommend the Warsaw Uprising Museum, which also opened in the last few years. It is a very well designed and engaging museum that brings to life this difficult piece of World War II history.","post_message":"Warsaw is finally growing into its aspirations as Eastern Europe’s culture capital. Here's what to do if you're ever there."},{"comment_id":"10156149159940354","commenter_b":"There's NO MYTH! ASSHOLE! I RESCUE PIT BULLS TOO, It's Dumb F**KS like you and your brother James that give Pit Bulls a bad Rap! Also DumB F**KS like this woman in the article! Check Cesar Milan, Pit Bulls & Parolees, Etc etc! OH NEVER MIND You're probably a Liberal Obama lover too!","commenter_a":"I OWN PIT BULLS, It would be impossible for me to order mine to attack ANYBODY! I could leave them in a room with an infant crawling on the floor without a worry! THIS woman IS THE REASON Pits have a bad Rap! These dogs were trained to be mean! Lock her ass up for 25 YRS! I Doubt the two dogs can be saved, they'll have to be put down!","post_message":"***WARNING: GRAPHIC VIDEO***"},{"comment_id":"818380371637006","commenter_b":"These women supporting Hillary are the most delusion bunch I have ever encountered... I'll leave this video of a woman providing facts about Hillary, so that you know just how delusional to are, and if you still support her after watch this video, you are just as bad as she is. ALL WOMEN SHOULD WATCH THIS BEFORE VOTING FOR HILLARY CLINTON: @webpagelink","commenter_a":"I was delighted and elated to put my vote for y-o-u Hillary! Ive been waiting for this moment and plan to bake cookies to celebrate your election. Much love kindness snd goodwill, Jean","post_message":"\"Get this Donald: Nasty women are tough. Nasty women are smart. And nasty women vote.\" —Elizabeth Warren IWillVote.com"},{"comment_id":"906611306042877","commenter_b":"I think what most Americans are concerned about is that a lot of illegals want the same rights that we do. A lot of illegals work and send money back to Mexico and then asking for aid with our tax money. You are very welcome here....if you follow the immigration laws.","commenter_a":"Enough of the PC crap. There is no such thing as \"undocumented immigrant\". They are ILLEGAL. I know this has been said before, but calling an illegal alien an \"undocumented immigrant\" is like calling a drug dealer an \"undocumented pharmacist\".","post_message":"“This undocumented immigrant...wants to, as a sign of my humanity and yours, recognize you and say, ‘Can I give you a hug?’”"},{"comment_id":"1412960289011405","commenter_b":"THE CORRUPT NAZICRATS ARE THE ONES THAT WILL BE DEFEATED!!!!!","commenter_a":"That's what you think American people got news for you","post_message":"Thanks Liz, this should increase membership..."}]
