[{"comment_id":"10153374338805329","commenter_b":"Lock her up and Throw away the key.","commenter_a":"Haha hopefully everyone enjoys there burgers and burritos today Cats ruin the forests when left to roam free They kill anything that's small And they over breed more than people on welfare Get over yourself You would ruin her life forever just because she took out a feral cat? Murderers even get off Scott free and live in society but this girl who by the way isn't hunting giraffes and rhinos (which is an actual job in some places) is condemned to a life of hatred by all you animal eating Internet trolls I curse everyone here with the fact that you will accidently run over an animal in your life Know that you were just a photo away from getting your whole life ruined","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10154960585818984","commenter_b":"She is wacko bird ...","commenter_a":"Yeah that fact that I can't debate .........because Trump is a bigot.Sexist, homophobic, racist, fear off warrior goddesses (think about it), also. And Hillary told you he was so it must be true.","post_message":"Elizabeth Warren is a liberal favorite, and she LOVES pushing her talking points on CNN. She thought this was going to be another easy opportunity to peddle her views, but this host immediately put her in her place. Her reaction is priceless..."},{"comment_id":"869610479765368","commenter_b":"Oh it's only Muslims who r care free! Grow up what about non Muslims that r care free with the poor starving away! Do u know Muslims give the most charity! Stop being typical media followers, lead ur own minds","commenter_a":"I love how caring these Muslims are, while the rest of their people starve to death and kill each other, they are living in the lap of luxury","post_message":"'Our lives aren't like Homeland or Argo!'"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work. She went to the hospital, where her ear was numbed and stretched even more, freeing Bart. \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"500763203381607","commenter_b":"This crap started with Clinton. Oliver North warned us what was coming.","commenter_a":"He warned Bush,but wasn't taken seriously.","post_message":"Do you agree or disagree with Donald Trump on this?"},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."}]
