[{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"1324175080956294","commenter_b":"You'd rather vote for Killary That murdering lier. God help us.","commenter_a":"Can't imagine any decent American voting for this clown!! I'm not the biggest Hillary fan but anything is better than this. Use this weekend while we spend time with family and friends to first of encourage people to VOTE. And then let them know the evils this dude is spewing. We've come too far to let this dude take us backwards!!","post_message":"Just when you thought Trump couldn’t get any more racist and misogynist, he manages to lower the bar of human decency."},{"comment_id":"10153707555079753","commenter_b":"She racist trash","commenter_a":"She's a racist pig white lives matter she needs to move to Canada allso","post_message":"Apparently, Beyonce was only getting started when she hit the Super Bowl halftime show with the debut of her new song “Formation.” On Saturday, one of Beyonce’s fan clubs, The BeyHive Team, announced that she will be putting together another music video with the help of the parents of Trayvon Martin, Mike Brown and Tamir Rice according to The Grio. Rice, Martin and Brown have all become familiar faces in the Black Lives Matter Movement. According to reports, Beyonce’s new music video will... @webpagelink"},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153932351055950","commenter_b":"FEMALE FAT FARMS WILL RULE TRUMP PRESIDENCY... .LOL.LOL.LOL. FAT CHICK'S BEWARE","commenter_a":"If Hillary cared so much about women she would not have brought this woman's name up. That just shows she will use anyone to get her agenda out there. She's Evil. Just remember she was the person who brought this up on debate night.","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"10153124758876336","commenter_b":"Inappropriate.","commenter_a":"This says she's not a very good golfer and is not really serious about golf as a vocation. Bet she gets a lot of offers for sex though.","post_message":"This week, \"GolfDigest\" unveiled a head-turning shot of one of golf's top young female stars, Lexi Thompson. What do you think of the controversial cover?"},{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"}]
