[{"comment_id":"10154683704293984","commenter_b":"Lil pussy","commenter_a":"Go Trump!!!","post_message":"Actor Brad Pitt just shook things up with a very public Donald J. Trump rant that caught everyone by surprise..."},{"comment_id":"10153111204826680","commenter_b":"The paper of choice for Fox News viewers","commenter_a":"What was curious about the Democrat primary Debate selection pool is all Old White people — No Blacks No Hispanics -diversity?","post_message":"The National Enquirer is fixated on Hillary Clinton's mortality."},{"comment_id":"1213125935366328","commenter_b":"This old hoe has lost her mind.!!","commenter_a":"You can be the first one to be unprotected! Have your security do without their weapons to protect you & Bill!","post_message":"Hillary Clinton, front-runner for the Democratic Party presidential race, heartily endorsed the idea of high taxes for gun sales, along with high fees for gun dealers."},{"comment_id":"1672047073075950","commenter_b":"I hope this doesn't help Hillary. She needs to be indited & serve time.","commenter_a":"they are setting the stage to let hillary off with murder","post_message":"Breaking News: Defense Secretary Ash Carter has decided not to demote General David Petraeus. @webpagelink"},{"comment_id":"10153173313535090","commenter_b":"<(\") Those whom approve of ILLEGALS in our country are either here illegally themselves Or are Profiting off of them in some way. The Government equates Illegals to two things, more tax revenue for them to spend & more votes for the democratic party. To insure this, they are flooding our society with individuals from every country possible. They couldn't care less about The American Citizens or LEGAL Immigrants. To Overpopulate any country places an undue burden on it's natural resources, it's firemen, it's police, it's agriculture ( food ), it's educational & medical centers. Obama Openly stated : I will immigrate 100,000 Muslims from the middle east annually for the next 8 years... :( He recently aided 100,000 Illegals prior to a Judge filing a stay of his executive order. He & Hilary Clinton are receiving money from Saudi Arabia & other middle eastern governments to insure their agenda ...","commenter_a":"51 million immigrants in the last 8 years! When are you guys going to do your jobs and stop this madness!!!","post_message":"Do what's best for your health.   Stand in opposition to Obama's government bureaucrats: @webpagelink"},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10154183744199091","commenter_b":"She is a baby killer","commenter_a":"Trump belives in God and life & Americans clinton she is evil she is for aborting a baby in late term open borders allowing evil in our country no I voted Trump.","post_message":"Who do you think will be the next president of the United States? Send us a blue thumbs up for Hillary Clinton or a red heart for Donald J. Trump."}]
