[{"comment_id":"837639489700820","commenter_b":"I will destroy humans","commenter_a":"Eloise Nicholls Regan Howard Louise Hemmings Sydnie-Jo Goodison Megan Wilkins @username","post_message":"This robot wants a family...and to destroy humans."},{"comment_id":"578880512291528","commenter_b":"I have a daughter and if she decided to not wear a bra, and wore clothing appropriate for that. Obviously not some plunging v neck cut out, crop top but a shirt sure. Bras are a cause for back pain and unless it's comfortable for the woman to wear it she shouldn't have to. If you insist we wear bras, I insist that your man boobs must also be held with a wire bra. You're pecks offend me!","commenter_a":"If I had a daughter ain't no way she going to school with no bra on. So I think the parents are to blame also. What are they teaching her letting her go to school like that??....that's tacky and careless parenting in my opinion..","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"876682692378359","commenter_b":"These two women obviously don't know the plan and purpose of marriage.","commenter_a":"STOP have n sex if u dont want children. Once the child is made its alive. Not when it takes the first breath. Ppl are so selfish these days","post_message":"Do you?"},{"comment_id":"10153269973986167","commenter_b":"Enjoying your tax Magnus rates? And how many refugees and immigrants are you valuing?","commenter_a":"As a Scandinavian, I don't know if I should laugh or cry on your behalf....","post_message":"An actual question from last night's #GOPDebate"},{"comment_id":"582449118570531","commenter_b":"Maybe to you but the ladies love me.","commenter_a":"GOP has nothing but Scare Tactics, look at all the fools they have running not a good one in the lot. What Scarey is if one gets elected then it time to be scared, they'll take the whole country down the Hole.","post_message":"The boogeyman will get you. via Grobanites for President Obama."},{"comment_id":"10153588995871943","commenter_b":"With her I the White House nothing will change. Don't forget we will get a sexual predator along with her. What a deal.","commenter_a":"I WANT TO KNOW WHY - OUR PEOPLE WERE ABANDONED?!!! Just like Clinton's hubby refused adequate forces for BlackHawk Down - I'll NEVER get the images of OUR PEOPLE BEING DRAGGED THROUGH THE STREETS.....NEVER. That's the REAL RECRUITING Message: \"America is WEAK!!!\"","post_message":" Obama administration and Clinton officials hid this compelling Benghazi email for years, said Judicial Watch President Tom Fitton.   The email makes readily apparent that the military was prepared to launch immediate assistance. The fact that the Obama administration withheld this email for so long only worsens the scandal of Benghazi. Please SHARE!"},{"comment_id":"10153660324311491","commenter_b":"@username Girl, your HR prowess is EVERYTHING. Reading these comments with a cup of tea. *sips slowly*","commenter_a":"Earned the right to what? To throw a tantrum and not show up for work? They did tell her but she did not like the news? When, how it was delivered? Kelly is not responsible for Michael's career! If she is acting unprofessionally and retaliating or is having behavior that is inappropriate in a workplace, the network will need to enforce the EEOC policies and review her contract for creating a hostile environment. The decision to move his day to depart is in everyone's best interest. Maybe after 26 years she should look for a new job, maybe advance herself too. She does not decide when any employee leaves. I now refuse to even watch this show anymore since the Kelly drama and I hope family and friends turn her off and let the network see who has the power to decrease ratings here! He's advancing his career period. If ...","post_message":"“I needed a couple of days to gather my thoughts. After 26 years with this company, I earned the right.”"}]
