[{"comment_id":"10153574207499641","commenter_b":"And they are mostly Muslims !!","commenter_a":"that's because indians are breeding like rats","post_message":"If every candidate were granted an interview, the hiring process could take four years to complete, officials said."},{"comment_id":"482642515272130","commenter_b":"Absolutely it is. We're nearing the point of no return for this planet (relative statement. Could be in 100, 300, 500 years) and without a plan to continue our species (even if generations have to spend their lives in a travelling spaceship) we will go extinct. Planning for the future is always a worthwhile investment no matter how far ahead the worst case scenario seems.","commenter_a":"In other news more useless discoveries that are so far away they might as well not exist","post_message":"AMAZING news."},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10154496276031636","commenter_b":"Women are only carriers? What a disgusting mindset to see an entire sect of humanity as subhuman. For the record, men can vanish off the face of the earth tomorrow and humanity will still survive.","commenter_a":"What a sad sight to watch, so many people fighting for the right to kill there own children. Children are the children of the Father. Man can make babies with artificial overs, in a tube, but women can not have babies without a man's sperm, woman are only carrers, all children come from there father first. Maybe instead of worrying about having aborstions, we worry about the decay in society which cases the need for them in the first place. We must raise our standards.","post_message":" intent is to try to put the fathers in the process. My bill would stop the abortion if the father does not agree to the abortion."},{"comment_id":"10153905516506178","commenter_b":"I always say Merry Christmas at that is just the way it is.","commenter_a":"Fitting that a NUTCRACKER be in the back ground. :-)","post_message":""},{"comment_id":"10154048567109203","commenter_b":"She's a turd","commenter_a":"Hillary 2016","post_message":"How could you, Will Ferrell??"},{"comment_id":"10152932852611378","commenter_b":"Give her a better intersection ! I'll take the intersection. ! This intersection should be for a young person , a person that's quick on their feet! Firing her doesn't solve nothing ! Crazy intersection","commenter_a":"Her attitude is disgusting; it's like I'm entitled to get paid just for showing up!","post_message":"A lot of people were talking about this 6abc Action News HIDDEN CAMERA Investigation before it even aired! Now here's the whole story. A crossing guard, who is paid to walk kids across a busy intersection, stood by as groups of children bolted across traffic, but she didn't help walk them across to safety. Plus, hear this public servant's interesting response, when we ask why she isn't doing her job to keep students safe!"}]
