[{"comment_id":"880698808638574","commenter_b":"Bilble is all about sex","commenter_a":"This is done in public? Wonder what goes on in private.. But Wait! Do we not hear of the domestic violence in this country also. Christian , Jewish, Hindu as well? Religion is not true religion if it practices such violence.","post_message":"A Saudi female victim of a gang-rape is sentenced to 200 lashes and six months in jail More details: @webpagelink"},{"comment_id":"751075045025676","commenter_b":"@username I like the guy. He's obviously brilliant, but wasn't on top of his game last night. I'm glad he'll be able to survive it.","commenter_a":"Ben was kinda catatonic at the debate last night. Luckily, the liberal zealot moderators stole the show and the headlines.","post_message":"In 3......2......1.......BOOM!"},{"comment_id":"10153855884068606","commenter_b":"Kate shut the f*ck up! You weren't there!","commenter_a":"... Y'all can reply as you will.... This man had \"cocaine toxicity.\" He could have easily had a heart condition from drug use or other undiagnosed heart problem and he did cocaine. He was assaulting other people, he was violent and breaking the law. He was high. He required restraint. How about don't do drugs and hurt people and then you probably won't die in police custody?","post_message":"JUST IN: Death of man in custody of security guards at D.C. apartment complex ruled a homicide: @webpagelink"},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"1185974561486681","commenter_b":"Motherfucka must of been hella hungry","commenter_a":"Ys Ir","post_message":"Ladies, would you let him?. #WSHH"},{"comment_id":"1009601765755554","commenter_b":"Brandon Douglas just remember this. This was a rigged election and the only ones that lost are us by excepting the way things.","commenter_a":"Don't give up Bernie! People still believe in you as being the right pick. Stand up and fight for the Presidency! People will back you!","post_message":""},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."}]
