[{"comment_id":"1203579539653054","commenter_b":"I'll be sure to let them know you said that Ralf, I'm sure they'll be devastated,.?!","commenter_a":"More bs from HRC,.. H and her half-truths... Number of oil, gas and coal industry lobbyists that have made direct contributions to Hillary Clinton 2016 presidential campaign: 57 57 registered oil, coal and gas lobbyists have personally given $126,200 to the Hillary campaign Of those 57, 11 are bundlers. 11 lobbyists have bundled $1,140,930 in contributions to the Hillary campaign 43 lobbyists have contributed the maximum allowed ($2700). Source : @webpagelink","post_message":"Hillary Clinton showed a flash of anger when confronted by a climate activist: \"I'm so sick of the (Bernie Sanders) campaign lying about me.\" @webpagelink"},{"comment_id":"10153870911641680","commenter_b":"Crooked Hillary only a few more weeks until she goes away for good","commenter_a":"Forced conscription ”has always been a bipartisan goal“? News to me.","post_message":"Hillary Clinton: \"I don't think you'll hear any of this from my opponent, and I think that's a shame: National service has always been a bipartisan goal.\""},{"comment_id":"10156328907740354","commenter_b":"This cheap harlot is getting a high price for her prostitution. I can only expect less from someone as low as her.","commenter_a":"Nasty skank!","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."},{"comment_id":"1043155299071968","commenter_b":"She is disgusting.","commenter_a":"She's scummy just ignore her 5% I Q","post_message":"JENNIFER LAWRENCE Recalls Attending Same Concert As Trump: “I was adamant on finding him and then making a video of me going, ‘Hey Trump, f*ck you!’” [VIDEO]"},{"comment_id":"539015142953445","commenter_b":"Scum of the earth all of them! !!","commenter_a":"But they're a Religion of Peace!","post_message":"These guys are SCUM!!!"},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""}]
