[{"comment_id":"10154991489419726","commenter_b":"Oh please! Maybe she'll move to Syria and we'll never hear from her again!","commenter_a":"loser.","post_message":"Her Instagram has us thinking she might..."},{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"867346193401426","commenter_b":"US American’s must again flush ALL these scurvy republiCon knaves from the once sacred halls of our Government…just like our Grandparents HAD to TAKE BACK AMERICA 86 years ago. CLEAN THE LATRINE…IN 2016! VOTE BLUE","commenter_a":"I can only assume God had a long talk with him last night ,or someone hit him over the head with a two by four.I hope it was God those two by fours realy hurt.","post_message":"Even a broken clock is right twice a day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"1346164815479767","commenter_b":"She will not ever be our president","commenter_a":"The Department of Justice is now the Department of Clinton. The FBI are just employees of Clinton also. Do not trust the FBI. Join your local militia! Support your 2nd and 1st amendment. Remember Hillary Clinton is everyone's enemy and all Liberals are animals and terrorists. The North should have there own country. The South and Midwest our own also. Liberals can't be trusted. Liberals are not patriots.","post_message":"BREAKING: Here are the NBC News presidential race updates for 8PM ET poll closings @webpagelink #Decision2016"},{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."}]
