[{"comment_id":"10152784839266680","commenter_b":"Oh hell no...","commenter_a":"Universal speed Bernie, your track record is AMAZING and your heart is filled with incredible passion! Thank you for FIGHTING FOR US #berniesandersforpresident #wallstreet #monsanto #earthfirst #love #care #animalsmatter #politics #gasland #environment #oceans #earth #america #goodpeople #bernie #hillary #hillaryclinton #jebbush @webpagelink","post_message":"Democratic Whip Steny Hoyer: \"We will dictate that the only people who can serve are the rich and I don’t think that’s what the Founding Fathers had in mind.”"},{"comment_id":"10152758056381051","commenter_b":"In her own bed? I would've picked something heavier than a shoe! Id burn the bed.","commenter_a":"He is scum her bed he needs to loose his penis cause hr is thinking with his small head","post_message":"When this wife got home and found her husband in bed with another woman, she decided to teach him a lesson."},{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."},{"comment_id":"10154015419833869","commenter_b":"Having a hot flash doesn't mean she is not qualified!","commenter_a":"Yup","post_message":"The Borowitz Report: The same poll revealed that a broad majority of voters found an unconscious Donald Trump more fit to be President than a conscious one."},{"comment_id":"10156349571840354","commenter_b":"Racist illegals","commenter_a":"We deport your sorry ass, illegal!","post_message":"Brace yourselves.  Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"10153973841258598","commenter_b":"She is a liar , a cheat, a murderer, and a disgrace to womanhood!!!","commenter_a":"FIRST WOMAN MURDERER!!! If she would kill innocent little American babies, what would she do to the rest of us?? Don't vote gender, vote for a great leader, vote TRUMP!!!","post_message":"Pro-Life Women Leaders: “We Can’t Celebrate Pro-Abortion Hillary Clinton as First Woman President”"},{"comment_id":"10152966731859342","commenter_b":"She needs a hanging.","commenter_a":"Sierra Gotti","post_message":"\"Not just one kid, but multiple kids. That's a plan. You're making a plan and continue to do it. I think you are sorry for the last two years, but frankly you're just sorry that you got caught,\" a judge said of a former special education teacher.  WATCH THE TEARFUL COURT PROCEEDINGS:"}]
