[{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"1398961996812250","commenter_b":"Hhhh u wish loser umais .. our heels over u and ur terrorists logic","commenter_a":"So what stopped Iran from making a grand Muslim Allaince against Terrorists? Unfortunately Iran gave it a secterian touch by involving only shias in the fight against daesh. Iran did not reach out to any Muslim country to come and help them in fight against daesh or did they?","post_message":"Pakistan’s Defense Minister has confirmed that the country’s former Army Chief has been appointed as commander of a so-called Saudi-led military coalition."},{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."},{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"10153341682339575","commenter_b":"Thank God for careless criminals.This case was able to be solved quickly because of it.","commenter_a":"I hope satan meet this scumbag at the gates of hell RIP beautiful young lady","post_message":"UPDATE: Bloomington Police confirm they have reopened the investigation into the disappearance of Lauren Spierer. This comes after the arrest of Messel in the murder of Hannah Wilson. Police will investigate any links between the two cases."},{"comment_id":"1338072722922864","commenter_b":"Boooo she's a TRUMPIDIOT!","commenter_a":"This lady knows nothing all she knows 200 million dollars is in her account for sitting there and talking s*** oh my God good job","post_message":"Senator Chris Murphy (CT) asks Education Secretary nominee Betsy DeVos, \"Do you think that guns have any place in or around schools?\" Check out her answer for yourself:"}]
