[{"comment_id":"801468519888245","commenter_b":"The female judge is pathetic.","commenter_a":"Wow....","post_message":"The cop sexually violating her body is evil enough, and to see the judge's reaction is absolutely chilling. Watch now (WARNING: GRAPHIC): @webpagelink  -Via Filming Cops flashback files."},{"comment_id":"982872948473970","commenter_b":"These people are what is wrong with America! I can't wait for them to occupy Canada","commenter_a":"these are the hate american soros funded kids who still live at home and hacve ebt cards and dont pay for health insurance..","post_message":"DEVELOPING: Leftist Radicals in New York City and Arizona launching anti-Trump uprisings...TRUMP PROTESTERS BLOCK ROADS TO PHOENIX RALLY....MORE..."},{"comment_id":"1302991003096347","commenter_b":"Wait-what? these illegals don't like what's going to happen? well, guess what? this is still America, we have immigration laws and it looks like the authorities are going to have to start following them. Go home and come back legally and you'll be welcomed with open arms!","commenter_a":"Start packing","post_message":"BREAKING: Trump Appoints Head Of Immigration Team Illegals, Liberals HORRIFIED!!!   We're making America GREAT!!"},{"comment_id":"10154153451894197","commenter_b":"nice, she can afford to leave, no doubt on our dime.","commenter_a":"and who didn't see this coming","post_message":"Former Governor Rell is moving to Florida, and she is not happy about the direction of Connecticut.   Have you considered moving for tax reasons?  Watch Face the State with Dennis House this morning at 11.    Preview here: @webpagelink"},{"comment_id":"10153444614011955","commenter_b":"It's a two part problem. Illegals and lazy Americans.","commenter_a":"Maybe those Americans should leave.","post_message":"Illegals outnumber unemployed in USA..."},{"comment_id":"845732068898255","commenter_b":"bring all our soldiers home to protect us from the illegals, n's, and queers. let those other countries fight their own battles. money paid by americans stays in america","commenter_a":"I told you from day 1. We Americans are so super sick and tired of you liberals and media trying to water down America. We're sick and tired of you trying to pussify America. We're sick and tired of you trying to force liberalism down our throat. So guess what ? Open wide because now you forced us to shove Trump down your throat !! Enjoy !! We just got our balls back !! Liberals and socialists suck ... They don't like guns, So they don't think you should have one. They like social programs, So they think you should pay for them They don't like religion, So they don't think you should be religious They like abortion, So they think you should like abortion They hate success, So they think you should pay more taxes. They elected the first Muslim president, So they think you are a racist.","post_message":"ClashDaily.com"},{"comment_id":"10153208487503124","commenter_b":"A hole where I tried to hang a coat rack and it went clear thru to the bedroom behind the wall.....ooops....two holes...walls need patched now and still don't have the coat rack hung.....#AmazonSweeps #DDIY Thanks for the chance.","commenter_a":"We want to install slide out shelves in our pantry! #AmazonSweeps","post_message":"What project needs to get done around your house? Comment with #AmazonSweeps to enter to win a $250 gift card to be used on Amazon Home Services. Hire a pro to handle the hard work - don't do it yourself. #DDIY  Ends 7/30/2015 at 11:59 pm (PT). We will reply to the winner's randomly selected comment with instructions on how to claim the prize. See Official Rules: @webpagelink NO PURCHASE NECESSARY"}]
