[{"comment_id":"933155700053185","commenter_b":"go Hillary....... TO PRISON!","commenter_a":"I hope Hillary will serve her Prison Time as Gracefully as Martha Stewart did! She might even make some new girlfriends!","post_message":"THIS is who liberals want?"},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10152639354152093","commenter_b":"Beautiful, what breed?","commenter_a":"Zeus is a big fan of the ice! #PuppysFirstIceStorm","post_message":"Ice storms are better with your best bud… #PuppysFirstIceStorm (photo: Dawn Lankford Morton) Latest updates: @webpagelink Tuesday closings/delays: @webpagelink"},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."},{"comment_id":"10153141758042994","commenter_b":"unfortunately my tax dollars go from her welfare check to paying for her prison cell...I have no sympathy for her whatsoever... I feel sorry for her living children..","commenter_a":"Where's daddy? Protector supporter?","post_message":"\"My client has suffered from serious depression, long-term chronic,\" Steve Kaplan said. \"She's also less-than-average in intelligence.\""},{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4. TO WATCH/READ MORE: @webpagelink"}]
