[{"comment_id":"954404074652647","commenter_b":"Hey boys go check the Negro-in-Chiefs record. Highest deficit of all time Biggest deficit than last 5 presidents combined. Highest sustained unemployment in history.","commenter_a":"how true how true","post_message":"A reality check for our Republican friends...  Thanks to Roy Mark Ramdas."},{"comment_id":"845673835565796","commenter_b":"@username - As usual, the liberal fails to consider the unintended consequences of their actions. Transgenders make up only .3% of the population so the threat from them is minimal. The threat from perverts who will abuse this decision to commit assaults will far outnumber the Transgenders who simply want to go pee. It will be the innocent among the majority of Target's customers that will face the consequences of Target's liberal, feel good decision.","commenter_a":"Well I guess my kids will not be using the fitting rooms. I to will be reconsidering using their bathrooms and even shopping there. This country has lost it's damn mind!","post_message":"Are you kidding me?!"},{"comment_id":"956678911036116","commenter_b":"Trump is right ! All 11 million illegals have to go !","commenter_a":"Trump Chopper in Air Salad toss on a stick taint Fear God Trucker Hat -.......... high-ku Reverend #TrumpTrain #GOPClownCar #iacaucus","post_message":"\"They have to go.\""},{"comment_id":"10153254400059228","commenter_b":"What a Negative Nancy!","commenter_a":"This is prolly the biggest lie I have heard yet.","post_message":"An Ohio woman searching for her biological mom got the surprise of her life Monday when she learned her mother was a coworker."},{"comment_id":"10158042812305551","commenter_b":"I have trouble with Rhinos who profess to be one thing, but are LYING. I have not trusted John McCain for several years. I am beginning to wonder about Marco. Time will tell. As for Hillary and John Kerry, They are trying to destroy what America stands for and that is FREEDOM. Than there is Eric Holder who along with Obama and Clinton, sold guns to Mexico Mafia. Corruption is what WE THE PEOPLE are sick of.","commenter_a":"Trump is right again. John McCain is no war hero and never has been.","post_message":"Two Senators Have a Problem with Tillerson, but not Hillary Clinton or John Kerry"},{"comment_id":"10153171684108352","commenter_b":"Gun or no gun this girl would have stabbed him. And believe me, I would have too.","commenter_a":"And why do kids have access to guns?????","post_message":"Florida sisters, aged 15 and 11, are charged with murder of 16-year-old brother who they shot dead"},{"comment_id":"729187697271808","commenter_b":"A Hot MESS","commenter_a":"She should be in jail. Who is protecting this criminal and why.","post_message":"Like if you agree."}]
