[{"comment_id":"736524969871414","commenter_b":"True she needs to sit down some where and just grow old. If they don't put her in jail.","commenter_a":"I had been wondering about Hillary and her health. I was just thinking today what if Hillary should get sick if she's in office. Woman have a tendency to become ill as we get older. Has had her menopausal years. Hell because when I get sick I don't want to be bothered by nobody. I don't think Hillary would able to handle this president stuff. Not that we don't want her to be president I really don't think she would make it. Stress on a woman is not good. It triggers other types of sicknesses. I know about that stress. I had to quit a job because of stress. I was so damn stressed out I came down with hyperthyroidism that made me lose 94 lbs in one month. Due to stress. My doctor made me quit my job or die. And I had been wondering about Hillary Clinton. She's ...","post_message":"BREAKING: Hillary Clinton's Health In Jeopardy... Campaign Could Be Over Either way she was never fit to be president. She should retire early. Can we get 30,000 'LIKES' to have Hillary drop out of the race?"},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"1800550493547458","commenter_b":"Good idea but im barefoot anyway","commenter_a":"@username would you use it?","post_message":"The iron horseshoe is now a thing of the past."},{"comment_id":"10153120731383010","commenter_b":"now THAT'S a woman!","commenter_a":"Yay! Now wet can objectify plus - size women too! We're all about equal opportunity around here!","post_message":"When Sports Illustrated's 2015 swimsuit issue hits newsstands next week, it will include an ad featuring plus-size model Ashley Graham. Cause for full-figured celebration?"},{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"1695206677435751","commenter_b":"@username totally agree! She's a waste of good breath!","commenter_a":"Bye bye!!","post_message":"ClashDaily.com"},{"comment_id":"10154493231947235","commenter_b":"That's if she lucky..now don't get me wrong,I never hit a woman,but this bitch would've caught a 1989 Mike Tyson uppercut to da jaw at best case scenario lol","commenter_a":"Why can't I see none of these people...man I'm telling you,if that was my daughter she was talking to,her fucking head would've been in her mailbox","post_message":"What an absolutely HORRIBLE person"}]
