[{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"},{"comment_id":"10154505706873812","commenter_b":"If you create terror among a group because you are shooting them and killing them, you are a terrorist. If you align yourself with a KNOWN terrorist group, you become part of that terrorist group. I don't believe any domestic terrorist has EVER sworn allegiance to God and commenced to killing folks though.","commenter_a":"Just because it's deleted doesn't mean it wasn't said!!! He swore his allegiance to isis! We already know this. I guess offending those of the same belief and/or faith is more important than the entire truth being released so it's sugar coated and deleted. Sickening!! Why bother releasing any of it if you delete the parts where he ADMITS he's a freaking terrorist?!!!!!","post_message":"UPDATE: DOJ and FBI release full transcript from Orlando shooter's 911 call to provide the \"highest level of transparency.\" abcn.ws/28It1Ld"},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"499057813618132","commenter_b":"just a rich, fat, black bitch","commenter_a":"Sick idiot","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10153618680301336","commenter_b":"I don't agree with what happened to Mr Ramos but I emphatically want the illegals sent packing and our borders fortified!","commenter_a":"Moron","post_message":"ICYMI: Univision anchor Jorge Ramos told Megyn Kelly that Donald J. Trump's immigration plan is full of empty promises. What do you think? @webpagelink"},{"comment_id":"1021280037910232","commenter_b":"Maybe Russia will take care of the roaches for us.","commenter_a":"Sad","post_message":"This is just sad. I never thought an American president would be seen as weaker than the Russian leader."}]
