[{"comment_id":"10156889052280206","commenter_b":"if we really want to protect our country all we have to do is put up pictures of carly at the borders. that would scare anything.","commenter_a":"First is to end all illegal wars in the Middle East and stop supporting rebel groups with weapons which eventually end up in the hands of people who wish to harm the USA. We no longer need to rely on Middle East oil so there is no need for the US to be there.","post_message":"Q: What do we need to do to protect our homeland?   Get more answers at @webpagelink"},{"comment_id":"10153875809248352","commenter_b":"Thank you Doriaan. This bitch hatin ain't she?","commenter_a":"Instant reflex nigga don't touch me while I'm performing bitch you lucky that's all you got...KEVIN GATES THAT MOTHAFUCKING NIGGA","post_message":"RAPPER BRUTALLY KICKS FEMALE FAN BECAUSE SHE TOUCHED HIS SHORTS. REALLY? #DISGUSTING"},{"comment_id":"383422335172981","commenter_b":"There are laws and then there is right and wrong. When you factor out people from the laws, you create an inequity that needs to be handled as Solomon did --- One case at a time. Many years of productive residency DOES erase the fruit of the poisoned tree --- that she came here against a statuary law. Laws were made to cope with inequity. We have immigration laws because we feared overpopulation by the poorest people in the world who would want to come to the \"land of opportunity.\" But, when someone comes and contributes to our fabric, we need to weigh that against a rule made to prevent, in her case, something that doesn't exist.","commenter_a":"The first step in holding conservative views on immigration is that they can't view anyone who might be affected by bad immigration policy as fully human. That's the problem. They've successfully dehumanized Hispanic people so they simply don't care.","post_message":"Now she has the opportunity to apply to stay here legally."},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."},{"comment_id":"10153945679949087","commenter_b":"Don't care for Michael Moore but im with him on this, gooo Trump!! Beat that lyin corrupt Hillary.","commenter_a":"Alyssa Hohorst","post_message":"Liberal filmmaker Michael Moore is doubling down on his prediction that Donald J. Trump will win the White House with a list of 5 reasons why."},{"comment_id":"1096660043788412","commenter_b":"A woman President, fine, BUT NOT HITLERY!!!","commenter_a":"It turns my stomach to think of Hillary as president","post_message":"\"Madame President Hillary Clinton.\"  Do you like or dislike the sound of that?"},{"comment_id":"10155175983529749","commenter_b":"Not fair to use term feminist for these people...might be better to go on \"feminazzi\" :) . It's kinda offensive for the real feminism movement which is still something some part of the world really need no? :)","commenter_a":"Why are they always fat? I have never received a satisfactory explanation.","post_message":"Presenters and staff frantically scrambled to cover the woman's breasts."}]
