[{"comment_id":"979803835419705","commenter_b":"Dumb shit hoes do for niggas","commenter_a":"Looonngggg liiiive the kinggggg🦁","post_message":"The Struggle: His Mom Came Home Early So She Had To Jump Out The Window!"},{"comment_id":"10153754963576636","commenter_b":"oh god im sick of seeing this the vote has been and gone in favour of leave just bloody get over it ,and out of the 2 mil that have signed how many are actually british,didn't know this was a world wide petition","commenter_a":"Keep politics out of music.","post_message":"The petition is unprecedentedly popular"},{"comment_id":"1194580720554183","commenter_b":"This is all propaganda to rig the voting pattern and is trashy media reporting.","commenter_a":"THE PEOPLE LOVE TRUMP, WE LOVE AMERICA, WE WILL TAKE HER BACK FROM THE FILTH IN DC WHO RAPE OUR COUNTRY AND TERRORIZE OUR PEOPLE!!!!","post_message":"You've heard all the claims that Donald Trump has no chance of beating Hillary Clinton in the general election. Now, here's how that argument is instantly deflated"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"10153264907976336","commenter_b":"The illegals are bleeding the system dry, plain and simple and then there's the government that doesn't give a crap about the poor because they largely do not see a reason to vote and therefore don't","commenter_a":"Yea and that will never happen. Illegal immigration will never completely stop as long as we have open borders and waterways","post_message":"In a Fox News Sunday exclusive, presidential candidate Marco Rubio says he still believes the U.S. needs immigration reform but it can’t be done “in one big piece of legislation.”  WATCH: @webpagelink"},{"comment_id":"10153688828342014","commenter_b":"Is this a female prison?","commenter_a":"Enact everyone who knows our job, calls us all corrupt, tells us we're poorly trained, and blames us for the inmate's behavior in 5, 4, 3, 2, 1...","post_message":"ATTACKED: A PCSO officer is going to be OK after being violently attacked by two inmates STORY: @webpagelink"},{"comment_id":"10153277362054170","commenter_b":"she is such STUPID IDIOT","commenter_a":"Her strategy, which has worked in the past, is to blame everything as due to \"Right-wing extremists\" and denounce reports of her past as \"old news.\" The liberal press will support her.","post_message":"Well, the much-awaited Hillary announcement video is out, and we've got it here. If you can find a rationale for a Hillary presidency anywhere in it, by all means let us know. We couldn't."}]
