[{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"10154185430309062","commenter_b":"Why force a woman to ruin her body if she doesnt want to","commenter_a":"Conservative's be like \"I demand you to keep that baby\" nine months later \"I don't want my tax dollars paying for those babies\"","post_message":"NEW: Another hidden camera video taken at a Planned Parenthood facility was just posted online, and Governor Greg Abbott has already responded."},{"comment_id":"1528607397159285","commenter_b":"Nobody has proved that Russia is behind it .","commenter_a":"I just can't take how Trump supporters defend this disgusting and vile piece of trash! Let's vote based solely on platform! Everyone keeps saying that they both have a lot of baggage, so let's level the playing field.","post_message":"\"To profess not to know at this point is willful misrepresentation,\" an official said."},{"comment_id":"10154390572299749","commenter_b":"@username suckers.","commenter_a":"@username Nope....that is all...nope","post_message":"About 400 fen raft spiders have been set free in the UK."},{"comment_id":"954295721303850","commenter_b":"Dumb hoe lol","commenter_a":"KiAsia SimplyyMee Wilson smh #fixitjesus","post_message":"SMH"},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means. READ MORE: @webpagelink"},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."}]
