[{"comment_id":"910630875626359","commenter_b":"They need to be shot!","commenter_a":"These people just need a hug.....around the neck.....with a rope.","post_message":"This could be way more serious than you ever thought possible. Do you think these men need to be stopped?"},{"comment_id":"10157349438290354","commenter_b":"She needs to shut up! We don't care!","commenter_a":"Rosie needs to check in at the local mental health clinic ASAP","post_message":"And that's not all Rosie O'Donnell said about Donald Trump either..."},{"comment_id":"472460989569345","commenter_b":"Your vagina has muscles specifically designed for pushing things out. Kegel exercises will strengthen and tone them. Plus, I'm pretty sure that little knob looking thing on the bottom of the cup is for grabbing.","commenter_a":"I'm just not comfortable sticking something up there that I don't have a mechanism to pull it out with","post_message":"While used mostly in developing countries due to lack of access to regular products, these cups could be far superior than those regular products."},{"comment_id":"1792270164372790","commenter_b":"She's an old nasty hag!","commenter_a":"Not worth it!","post_message":"SAY WHAT?"},{"comment_id":"10153704994641337","commenter_b":"Fuck off fag","commenter_a":"Here come the \"cause Obama is a Muslim\" comments","post_message":"#IStandWithAhmed: Even Barack Obama is showing his support for Ahmed Mohamed..."},{"comment_id":"10153374957661051","commenter_b":"Of course, a common sense approach. All sales and transfers should be subject to a background check protocol. Keep up the rhetoric NRA, unless we see some common sense prevail among the gun lobby & gun nuts the eventual backlash is going to greatly affect responsible gun owners.","commenter_a":"To purchase any firearm there are already checks in place.","post_message":"Do you agree or disagree with America's police chiefs on this?"},{"comment_id":"675287475916889","commenter_b":"so we don't need Muslims, Blacks, Hispanics, French or England immigrants here.....Missing anyone?","commenter_a":"We are having the same problem here with blacks, Hispanics, and muslims. They do not want to assemilate into the American society. They want their old country here with American benefits. Wake up America. We don't need a France or England here... or Sharia Law!","post_message":"Thankful hostages in France have been freed the terrorists have been brought to justice. A valiant and heroic performance by the French police.  UPDATE: Sadly, early reports hostages had been freed were premature. Our prayers are with victims and their families and our thanks with the police."}]
