[{"comment_id":"674600329361440","commenter_b":"rep need to get a life","commenter_a":"Look at that! I bet there are at least 100 people there! Maybe unpaid to boot!","post_message":"WATCH LIVE: Hillary Clinton and Elizabeth Warren campaign together in New Hampshire."},{"comment_id":"1225473394192695","commenter_b":"@username you suck big donkey dicks","commenter_a":"A man of class, dignity, character, honesty...everything goid and positive. God bless our nominees, and the Unired States of America!","post_message":"Republican vice presidential candidate Mike Pence holds a town hall."},{"comment_id":"465974283593152","commenter_b":"too damn bad. if they dont like get their asses out of our country. they dont and will not control america.","commenter_a":"Hell no!! They offend us just being here!","post_message":"Should The Words 'Bacon', 'Pork', 'Sausage' Be Banned?  Comment 'yes' or 'no'."},{"comment_id":"10153572356905329","commenter_b":"Yeah Cheryl. You stupid bitch.","commenter_a":"Not very honest of you @username - you have deliberately failed to mention the marginalization & persecution of christians & other groups who morally oppose same sex marriage, & the hardship & tyranny they now endure. You have also quite 'conveniently' chosen to ignore the increasing body of evidence that is emerging of the sense of loss, disadvantage & suffering, those raised in same sex relationships, & who have now reached adulthood, have & are experiencing - nor the vilification & persecution they can face for daring to speak out....","post_message":"Eighteen other countries have legalized same-sex marriage before America. Let's see how some of them are holding up."},{"comment_id":"1110306035681925","commenter_b":"She's a evil hypocrite","commenter_a":"Good point!","post_message":"'Hillary Clinton doesn’t miss an opportunity to ridicule Donald Trump’s illegal immigration solution of a wall on the southern border — but that’s exactly what she’s deployed to keep undesirables away from her.'"},{"comment_id":"1759425104296851","commenter_b":"So how come she is now for crooked Hillary?","commenter_a":"michelle you said that Hillary was not fit for the white house nothing has changed since 2008 except she committed more crimes","post_message":"The first lady who did pushups on Ellen, whose hubby sang Al Green, claims Trump's immature."},{"comment_id":"10153975105390950","commenter_b":"Lock her up for life","commenter_a":"Sounds like she should have found a new career. A long time ago","post_message":"In one incident, the woman hung up on a caller reporting a robbery at a convenience store. The man called back and spoke to a different operator, but by the time police arrived, the store manager was dead."}]
