[{"comment_id":"10154313536616509","commenter_b":"Um, the judge is a republican. But thanks, though.","commenter_a":"Fox news haters will blame muslims","post_message":"A week after a warrant for his arrest was issued, Ethan Couch -- more commonly known as the \"affluenza teen\" remains on the lam."},{"comment_id":"10153690719066130","commenter_b":"Andrew Ritchie","commenter_a":"Woof, there are some dumbass people on this feed. The benefits outweigh the risks.","post_message":"This vaccine is drastically reducing HPV cases in teenage girls, but some parents can't get over the stigma."},{"comment_id":"10152995083802869","commenter_b":"Isn't there something about judging a tree by the fruit it bears. This sir, is what you stand for and represent.","commenter_a":"I can't believe he found a woman stupid enough to marry and procreate with him.","post_message":"Janet and I want to affirm our support for the Duggar family.  Josh’s actions when he was an underage teen are as he described them himself, 'inexcusable,' but that doesn’t mean 'unforgivable.'  He and his family dealt with it and were honest and open about it with the victims and the authorities.  No purpose whatsoever is served by those who are now trying to discredit Josh or his family by sensationalizing the story.  Good people make mistakes and do regrettable and even disgusting things.  The reason that the law protects disclosure of many actions on the part of a minor is that the society has traditionally understood something that today’s blood-thirsty media does not understand—that being a minor means that one's judgement is not mature.  No one needs to defend Josh’s actions as a teenager, but the fact that he confessed his sins to those he harmed, sought help, and has gone forward to live a responsible and circumspect life as an adult is testament to his family’s authenticity and humility.  Those who have enjoyed revealing this long ago sins in order to discredit the Duggar family have actually revealed their own insensitive bloodthirst, for there was no consideration of the fact that the victims wanted this to be left in the past and ultimately a judge had the information on file destroyed—not to protect Josh, but the innocent victims.  Janet and I love Jim Bob and Michelle and their entire family.  They are no more perfect a family than any family, but their Christian witness is not marred in our eyes because following Christ is not a declaration of our perfection, but of HIS perfection.  It is precisely because we are all sinners that we need His grace and His forgiveness.  We have been blessed to receive God’s love and we would do no less than to extend our love and support for our friends.  In fact, it is such times as this, when real friends show up and stand up.  Today, Janet and I want to show up and stand up for our friends.  Let others run from them.  We will run to them with our support."},{"comment_id":"10153295318271130","commenter_b":"Then those girls who don't know how to do that stuff better learn. Especially the condoms. That's both partners responsibility.","commenter_a":"And I am sure girls do not know how to buy their guys condoms, strap-ons and penis rings. So what???","post_message":"They didn't have a chance."},{"comment_id":"10153703239058984","commenter_b":"She would be the worst women president ever !!!!","commenter_a":"Same crap. Boring!","post_message":"She wasted NO time with this one...  Do you think Hillary would be the worst pick for president?"},{"comment_id":"1116798981710579","commenter_b":"She's feeding her baby. Shut the fuck up and move on","commenter_a":"Well it isn't racey,it's natural. This is ridiculous people need to approve of the way babies were intended to eat and get over it. When they do mom's will stop plastering feeding photos all over the internet.","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"10153509000593984","commenter_b":"She doesn't deserve that child!","commenter_a":"is she in jail now?","post_message":"You'll be blown away by these shocking images... I can't believe a mother would share these, or even do this to begin with...  Do you think she should be punished for this?"}]
