[{"comment_id":"1073989012671274","commenter_b":"LOCK HER UP !!!!!! LOCK HER UP!!!!!!!!!! LOCK HER UP!!!!!!","commenter_a":"Yea to Iran and Syria to send there trash here while our jobs and wealth leaves while you trash the country to get rich???? Yea ok...#TRUMP2016","post_message":"'Next week in Philadelphia, we will offer a very different vision for our country, one that is about building bridges, not walls.'  In introducing her running mate U.S. Senator Tim Kaine, Hillary Clinton promised the DNC would look quite different than the RNC. bit.ly/2a3iybw"},{"comment_id":"10152833385031749","commenter_b":".","commenter_a":"You are right Brent!","post_message":"'America’s resurgence is real. And now that we’ve got some calmer waters, if we all do our part, if we all pitch in, we can make sure that tide starts lifting all boats again. We can make sure that the middle class is the engine that powers America’s prosperity for decades to come.' —President Obama  Watch the weekly address: @webpagelink"},{"comment_id":"10154014162531636","commenter_b":"Nope! Jeremy Corbyn.","commenter_a":"ISIS?","post_message":"BREAKING"},{"comment_id":"10154949669541037","commenter_b":"Great, ban it in the entire America now. God didn't create us females to abuse our bodies atall. You could always give up for adoption if it's already done. But prevention is better.","commenter_a":"Here we go....","post_message":"The law bans abortion once a fetal heartbeat can be detected, as early as six weeks after conception."},{"comment_id":"10153302141658812","commenter_b":"women wearing tuxs are on fashion runways @webpagelink so why can't she wear one?","commenter_a":"Every single girl should show up in a tux, and every single guy should show up in a dress.","post_message":"Principal says gay student can't wear tuxedo to prom. @webpagelink"},{"comment_id":"1334326533266897","commenter_b":"For the first time in American history a foreign hoe for first lady","commenter_a":"I wouldn't be Melania - even for a billion dollars!! I lived with a narcissist. She has my pity! I'm sure she is paid well to stay with him, and her frozen Botox face and designer wardrobe says it all.","post_message":"Politics aside, Melania Trump's modeled some winning looks on the campaign trail."},{"comment_id":"10154463285676178","commenter_b":"not immigrants...Illegal MIGRANTS. Immigrants come here legally.","commenter_a":"Gut punch to millions of ILLEGAL immigrants. And I feel bad because??","post_message":"The liberal media keep outdoing themselves..."}]
