[{"comment_id":"10154210994334024","commenter_b":"@username and never apologized! Hillary blamed them and called them vile names. Such double standards.","commenter_a":"This book was praised by women readers and them running to the theaters to see the movie, but offended by what trump said 11 years ago. The vulgarity of those novels enormously outweigh what he said. Such hypocrisy!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1165586973515562","commenter_b":"ABSOLUTLY","commenter_a":"Why not keep an open mind ( and a closed mouth) until the evidence is in?","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10153722151399705","commenter_b":"That was the syrup created by the heated jelly.","commenter_a":"Did you see the grease pour out of it no thanks","post_message":"Wow everyone: Thanksgiving morning with delicious baked brie and jam."},{"comment_id":"949766655064193","commenter_b":"What I don't understand about the anti-vaxers is the sheer number of people who have received vaccinations and they cite a couple of examples. I could probably list more damage caused by Legos to children than vaccinations. It is sad and scary that these people are convinced of some global wide conspiracy endorsed by world governments to pump out children full of poisons so big pharmaceutical companies can turn a profit. Do they actually listen to how ridiculous they sound? Canada officially listed the measles as eradicated from our country several years ago, now thanks to people refusing to vaccinate their children, there were 500 reported cases last year. Any other eradicated diseases you anti-vaxers want to see make a come back?","commenter_a":"Ugh, here come the anti-vaxxers with their pseudoscience and limitless idiocy. By not vaccinating, you are killing or at least potentially endangering children. End of. ** I feel that I should add to this, that I'm referring to parents of children who are perfectly capable of being vaccinated but who aren't; I get that there are issues with some childhood diseases and allergies and such.","post_message":"Maybe this'll end it. #vaccineswork"},{"comment_id":"1124493864242596","commenter_b":"I'm not sure why he was with her to begin with if that's the way she feels. She apparently doesn't have the same Christian values, which could only result in disaster for any potential marriage. Tim, you can do much, much better!","commenter_a":"Tebow is a good man......I couldn't care less about his football abilities...","post_message":"Tim Tebow loses girlfriend over Christian values."},{"comment_id":"10153396663904170","commenter_b":"She would HAMMER Hillary.. :)","commenter_a":"If Fiorina is blocked from the Republican debate in New Hampshire she should challenge Hillary to a debate there. Woman VS Woman. Hillary would never take the challenge, still the gauntlet will have been thrown.","post_message":"I love seeing GOP candidates use the media's \"gotcha\" questions to their advantage. Fiorina is turning it into an art form."},{"comment_id":"10154428205019087","commenter_b":"@username How is hiring illegal immigrants here in the USA \"putting 741915279236631s first\"? @webpagelink","commenter_a":"As an @username and a veteran I do not understand how anyone, but especially a fellow veteran, could support a disgraceful chickenhawk like Donnie. @webpagelink","post_message":"Several leading veterans groups who skipped President Obama's inaugural parades will march down Pennsylvania Avenue to celebrate the inauguration of President Donald J. Trump."}]
