[{"comment_id":"10154421194676545","commenter_b":"My tax dollars sometimes pay for things I don't necessarily agree with. It's called living in society. Grow up.","commenter_a":"Defund Planned Parenthood.","post_message":"She will be the keynote speaker at Planned Parenthood of Greater Texas' annual Fort Worth luncheon."},{"comment_id":"10154071183936336","commenter_b":"#obamaville #EVILislam #muslimBrotherhood. #NOmoreDemocrats #SouthCarolinaForTRUMP!","commenter_a":"There is either more to the story or it's the usual Obamma admin ways.","post_message":"\"After acting to protect a child from sexual assault from an Afghan commander, SFC Martland was punished and could be kicked out of the military at any time,\" said Jay Sekulow, of the American Center for Law and Justice."},{"comment_id":"10153348176116336","commenter_b":"I agree, some women go buy the biggest bag purse in addition to the over stuffed carry on.","commenter_a":"What they need to do is ENFORCE their rules now! I've seen people get on with HUGE carry ons! Just saying!!","post_message":"Will you buy new luggage if the world's airlines change their carry-on requirements? (via Fox Business)"},{"comment_id":"10150906812849999","commenter_b":"Which candidate doesn't?","commenter_a":"Guys he meant he is happy that nobody died lol get over it you all know what he meant. He says a gaffe, everyone is on it and saying how ill qualified he is, yet 99% of the time he is showing his wits no one cares.","post_message":"\"Well, first of all, just grateful that nobody got hurt,\" Gary Johnson told CNN after the attacks in New York and Minneapolis."},{"comment_id":"1074625052604249","commenter_b":"Send tits hoe","commenter_a":"The title said don't ruin it. Dumbasses can't read or see a blunt 🙄","post_message":"Don't spoil!"},{"comment_id":"1025172404211543","commenter_b":"That old gal is an idiot.","commenter_a":"She must not love her freedom, or freedom of choice,","post_message":"FOLLOW US FOR UPDATES----> Freedom Daily This is Monica Ball she is a peace protestor outside of Bradley University in Peoria Illinois she hates the troops and doesn't care about her freedom..... Anyone see her? If so make sure you let her know where you stand. Show her some love @webpagelink"},{"comment_id":"698556140299300","commenter_b":"shes a winner","commenter_a":"Recount now!","post_message":"We're at Trump Tower in NYC standing up for voting justice."}]
