[{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"10154400322244657","commenter_b":"In your illegal immigration poll Robert? Legal, voting hispanics want them gone.","commenter_a":"It doesn't matter. Now that the GOP candidates are in a pissing contest to see who can be the most xenophobic and racist while restarting the war on women, no Republican candidate has a a shot in 2016","post_message":"Does anyone have enough momentum to unseat Donald J. Trump? See which candidate rose and fell in the new Townhall.com / Hot Air poll:"},{"comment_id":"10154482749054423","commenter_b":"@username doesn't watch this!!!! LEAVE HER OUT OF IT!","commenter_a":"Caitlin Leonard @username","post_message":"PSA: The cast of This Is Us is very sorry for making you cry every episode."},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"1239839009369460","commenter_b":"@username is a wetback that's gonna be deported.","commenter_a":"When the immigrants - illegal or not - leave the USA, be prepared to clean your own toilets. Americans are lazy. Plain and sheer.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"10154200201311636","commenter_b":"I don't understand how she can even show her face in public after what she's done to Germany. Which in turn has had a negative impact on the rest of Europe. They should ship her out of the country along with all her precious illegal migrants.","commenter_a":"Thats good news for the AFD party..... No German wants to see this puppet!","post_message":"More follows"}]
