[{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning! Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"10156170491245206","commenter_b":"Shut up sexy","commenter_a":"I was pro @username but Carly I cant take you seriously unless you attack someone beside Hillary she is not the only one running who is bad for our country and until I see you attack Trump or Jeb who are you major competitors right now I am not going to take you seriously as a serious candidate.","post_message":"What are my thoughts on Hillary Clinton's speech this morning?"},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"10153732758118487","commenter_b":"Lolololololol people still believing in the \"good savage\" myth.","commenter_a":"Read it and weep. Colombus himself perhaps best conveyed this in his writings, describing the indigenous people as \"...the best people in the world and above all the gentlest—without knowledge of what is evil—nor do they murder or steal…they love their neighbors as themselves and they have the sweetest talk in the world…always laughing....They are very simple and honest and exceedingly liberal with all they have, none of them refusing anything he may possess when he is asked for it. They exhibit great love toward all others in preference to themselves.” Colombus shamelessly describes his vicious thoughts, oblivious to his own inhumanity : “They would make fine servants. With fifty men we could subjugate them all and make them do whatever we want.” -Howard Zinn's A People's History","post_message":"Before it became the New World, the Western Hemisphere was vastly more populous and sophisticated than has been thought."},{"comment_id":"10153618625791130","commenter_b":"How many more will emerge before she is 30? She is off to an excellent start!","commenter_a":"Sarah Palin has banned all Liberals from entering Bristol Palin","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."}]
