[{"comment_id":"10155035981661159","commenter_b":"So I take it she does not plan to work in the near future, for she may not fit any parts with cropped hair.","commenter_a":"Who is she???","post_message":"This didn't work out very well..."},{"comment_id":"10153184134613984","commenter_b":"she is a drama queen & idiot.","commenter_a":"What a crock of crap!","post_message":"People are NOT happy about this, and they're calling her out for it big time.  Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10156940473490354","commenter_b":"She was having plastic surgery!","commenter_a":"Where were you Maria, when Obama was proposing this last year. That's when you should have objected! It's too late now!","post_message":"BLISTERING..."},{"comment_id":"10153210594174270","commenter_b":"Every female to attempt the Marine Corps Infantry Officer Course...failed. And that's a fact","commenter_a":"Come on you all should know that males have to make second attempts at ranger school sometimes. This is not a female only type thing. Please for your sake do at least a google search of something before acting like only females get the second attempt","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"672161809583667","commenter_b":"This gal is a piece of .......","commenter_a":"Nothing quick about judging this one. It's been years in the coming","post_message":"I'm sorry....I'm not a fan."},{"comment_id":"1792493044351097","commenter_b":"For the safety of the country, her and everyone linked to her SHOULD BE PERSUED, THEY NEED TO DO IT. Unless all this was just political carpet-bagging, I'd hate to have to believe that, but their out to break this country, and if they aren't taken to task They Will Break This Country!!! Trump, keep your promise, were counting on you...","commenter_a":"He's just another elite ..with promises to get elected and being schooled by the negro ..he never meant to do anything he said ..he panderd to us all..","post_message":"President-elect Donald Trump and his transition team signaled Tuesday that his administration will not pursue further investigations of Hillary Clinton, backing off a vow on the campaign trail to appoint a special counsel to probe his Democratic rival secret email setup as secretary of state and suspected pay-to-play deals involving her family foundation."},{"comment_id":"491174087737551","commenter_b":"Muslims offend me. Ban them from the U.S.","commenter_a":"BS!","post_message":"Muslims Want to Change Our Nation and Obama is letting them..."}]
