[{"comment_id":"10153220980835950","commenter_b":"Calm your tits lady damn it's fuckin cup!","commenter_a":"I CARE ! That \"plain red cup\" represents the disdain that Starbucks and its homosexual CEO have for Conservative and Christian values. Except for the color red,Starbucks refuses to advertise any semblance of the Christmas season or what it represents..Well I don't intend to patronize their coffee shops again ! They can HAVE their liberal agenda and I\"ll continue with my Conservative principles !","post_message":"WATCH: At campaign rally, Donald J. Trump says maybe we should boycott Starbucks over plain red \"holiday\" cup design, promising: \"If I become president, we’re all going to be saying 'Merry Christmas' again, that I can tell you.\" @webpagelink"},{"comment_id":"10153233297426336","commenter_b":"They come over here illegally an you birch about it so you shouldn't celebrate there customs from there country here go back there an live don't do it here","commenter_a":"You can celebrate any way you want....","post_message":"\"I do not think it is the props that are wrong, it is forgetting that this is actually a part of the Mexican heritage.\" Olga Gonzalez, a Northwestern University undergrad from Mexico, takes a nuanced look at Americans' celebration of Cinco de Mayo."},{"comment_id":"459509127578200","commenter_b":"She still has it","commenter_a":"I would love to dance with ..you go girl..!","post_message":"I can't stop laughing!"},{"comment_id":"585702171625401","commenter_b":"REAL MEN FOLLOW THROUGH WITH PROMISES MADE REGARDLESS OF WHO OBJECTS!!!","commenter_a":"Well fuck you too!","post_message":"Do you side with Garth Brooks? or DONALD TRUMP? Comment your answer below!"},{"comment_id":"10153480430267483","commenter_b":"I bet the sissy SOB would have never talked to a man that way.","commenter_a":"More businesses need to be like this. Its 2016 for heaven's sake. No one should be treated less than anyone else.","post_message":"\"Due to privacy laws, we are limited in what we can share, but in a situation in which a customer verbally abuses another customer or a Regions associate, we close that customer's account,\" a Regions Bank spokesperson said."},{"comment_id":"10154136530601509","commenter_b":"Ignorant woman!","commenter_a":"Botate a la verga pinche paisana que te deporten por pendeja y regresate a tu pais pinche ignorante andas apoyando a trump y ni hablar ingles sabes se te nota lo paisana desde lejos","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"},{"comment_id":"10153194136535329","commenter_b":"Shut the fuck up bitch.","commenter_a":"OMG nobody is obligated to come to your kids birthday party people always run to FB for sympathy get over it & yourself","post_message":"“I know this might be something silly to rant about, but my heart is breaking for my son. We invited his whole class (16 kids) over for his 6th birthday party today. Not one kid came,” Ashlee posted on a local Facebook group."}]
