[{"comment_id":"998167890303719","commenter_b":" y ayuda tmbn a Los autistas","commenter_a":"Diego Alberto Rodriguez Pesaresi @username","post_message":"Marijuana can literally stop a seizure in its tracks. Like ATTN: on Facebook."},{"comment_id":"898756240177140","commenter_b":". . . and it's just going to get worse until we deport them all ! ! ! !","commenter_a":"LOL. LOL. These retarded Liberals! Can't we all just get along... you stupid liberals have brought this into our country... and now it will be like the middle east... Socialist DEMOCRATS SUCK!","post_message":"(Video) Is 2015 the year we see outright war between radical Muslims and Americans on our streets? As exemplified by the actions of these Texans, Americans will push back against Islamization with highly provocative moves. Will Obama be able to keep his jihadists in check until he declares Caliphate? Read More + Video: @webpagelink"},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"1128870593839354","commenter_b":"They not are migrants ffs, They are invaders. When will our government's wake the duck up!!!","commenter_a":"These people are deranged.... Catch them and give them an immediate death sentence............Shut all the boarders..... Keep filth out to protect our own...","post_message":"Migrant rape fears spread across Europe"},{"comment_id":"1225000220856314","commenter_b":"You're so evil Hillary! @webpagelink","commenter_a":"We don't have a depleted military, you moron.","post_message":"\"We cannot have a depleted military.\" Donald J. Trump speaks to supporters about the military @webpagelink"},{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."},{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"}]
