[{"comment_id":"10154661777626336","commenter_b":"I encourage all you Hillary supporters to each take in 3 Syrian refugees, because we don't want them here. Let them live in your homes. And while you're at it, since you Hillary sheep hate #Walls, start the #movement by taking the walls down, doors and windows off your houses and let people come in and out freely. And while you're at it, put up your gun free zones. #Trump2016 #BuildThatWall","commenter_a":"It's now reported that Hillary is going to appoint Loretta Lynch to the Supreme Court if elected president....pay for play, and corruption to the max. UNBELIEVABLE but not unexpected.","post_message":"\"You tell me what’s worse: Name-calling or lying to grieving parents as their sons' bodies lay cold in caskets... and then turning around and calling those parents liars?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"1297356170285821","commenter_b":"But a man still has no say over a woman's body. When men have the capability to carry a baby inside them, I'll gladly have a 3rd and let my husband experience the joys of pregnancy","commenter_a":"I think it is totally acceptable. They get to terminate like it's no big deal and others get to mourn that loss as an actual baby. Win=win situation.","post_message":"\"Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”"},{"comment_id":"10152908801970927","commenter_b":"No body forced you to spread your legs; and, no body forced you to have unprotected sex!!!!","commenter_a":"Cross your legs","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"10156672074140725","commenter_b":"Americans have done that stuff for years. Illegals do it cheaper because they work under the table and cause greater unemployment and then somehow get welfare!","commenter_a":"hey stupid Donald trump if you stop immigration who will work on the farms or will clean the bathrooms , American people won't do that stuff , think on what you are saying trump","post_message":"WOW! THANK YOU Atlanta, Georgia! LETS MAKE AMERICA SAFE & GREAT AGAIN! Heading to Nevada- now!"},{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"\"Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?\""},{"comment_id":"1184948411561852","commenter_b":"FOREIGN WORKERS MEANS TAX BREAKS FOR THE COMPANIES AND LOWER WAGES..... ALSO MEANS NO JOBS FOR USA CITIZENS!!!!! TRUMP FOR POTUS - DEPORT THE ILLEGALS AND STOP WORK VISAS !!!!","commenter_a":"In my lifetime, I have been through 3 amnesties. Each was promised to be the last. Does anyone in the Congress, who made this promise to the American people, have enough backbone to honor their word? Seems not. Why believe anything they tell us?","post_message":"Not good."},{"comment_id":"10154331295400695","commenter_b":"Praying","commenter_a":"Lord I pray for these families. Unless you have lost a child no one can even imagine the heart break they feel right now. I ask you Father to walk along side of each one of the family members wrap your arms around them to let them know you are right there for them to lean on you or carry them thru this. They have now entered the choir of angels . God bless all","post_message":"#PrayforUGA: We just received these photos of Christina Semeria, Halle Scott, Kayla Canedo and Brittany Feldman, the four UGA students killed in last night's tragic crash. Our hearts go out to their families and friends. @webpagelink"}]
