[{"comment_id":"631709593654535","commenter_b":"Just left Great Lakes Navy Recruit Center and such pride in our country and military on full display....folks from all backgrounds. Hillary does not support our troops and I can only pray that my son does NOT have to have that woman as his CIC","commenter_a":"The irland of cyprus to .with u trump","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"10153460799391130","commenter_b":"When bitch steals ur face 😠","commenter_a":"Alyse Kozis @username - she makes one of your faces Karlie 😂😂","post_message":"Instagram's @Daddyissues_ hilariously meme-ifies herself."},{"comment_id":"10153311054577293","commenter_b":"Guns multiply violence and death everywhere they are available without careful screening and detailed background checks. Even the sane lose their tempers and can lose control and kill their loved ones in the heat of the moment if a gun is at hand.. Guns place the innocent at risk everywhere from homes and schools to movie theaters and offices. No one NEEDS a gun. Only fools want them.","commenter_a":"This is why we need to ban guns. If a psycho attacks children with a knife they have a fighting chance. If he had been shooting the outcome would have been very different.","post_message":"He had only one thought: “This is not going to happen.”"},{"comment_id":"10157863685855354","commenter_b":"she will be the death of our country","commenter_a":"She ain't no lady. She's a hydra. Think about it- during the whole day every MSM outlet was focused on a 10 yr old comment while- An arms dealer was not charged because he said he'd tell on POTUS and Clinton Russia had drills for its citizens to go to underground shelters The FBI was caught being more than complicit in helping destroy evidence The internet was given away The UN is coming for our small arms- both thanks to POTUS","post_message":"JUST IN..."},{"comment_id":"10152916992026749","commenter_b":"stfu","commenter_a":"Horrible man!!!!!!","post_message":"First Steps."},{"comment_id":"835505926554037","commenter_b":"I bet she get tax breaks on her taxes.take a few seats missy","commenter_a":"C U NEXT TUESDAY !!!","post_message":"Does this woman realize she's shopping at Walmart, where wages are so low that many workers qualify for public assistance?"},{"comment_id":"10153236659491051","commenter_b":"Wait a minute. These girls made threats against someone's life and are suspended from the cheerleading squad for three games? What's wrong with this picture? Are you kidding me?","commenter_a":"OMG criminal charges and other parents need to be involved in their daughters' cruelty towards another student.","post_message":"This mom was horrified when police contacted her and told her what was happening with her daughter."}]
