[{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"1854124191468836","commenter_b":"Perhaps that bitter old lady should learn proper English. Disgusting behavior.","commenter_a":"Like this white woman has never held a space or stood in line for a family member. Come-on!!! we have all done it. What the F..k!!","post_message":"The video is intensely uncomfortable to watch. After a shopper berates two others in line, telling one \"you are nothing\" and worse, a mall says it's banning the woman for her racially-charged tirade. @webpagelink"},{"comment_id":"10153894151651782","commenter_b":"So if people have an issue with racism in this country they should leave?? How dumb","commenter_a":"I'd make sure they get no government grants or assistance! Way to keep division strong!","post_message":"A Massachusetts college says it will remove the American flag from its campus: @webpagelink"},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"}]
