[{"comment_id":"508965689228025","commenter_b":"The Dem's blocked Bushes nominations when he still had 18months to go. What goes around comes around. Oh yea, they forgot that fact.","commenter_a":"Eat shit and dye hillary.","post_message":"Agree or disagree?"},{"comment_id":"1179869992091535","commenter_b":"Lol yeah never thought about a lefty you ever try those net bags to catch spent casings I use them because we reload that should help","commenter_a":"First of all the guy was lying no way he shot it he said the casings flying in front of his face gave PTSD has anyone ever had a spent casing fly in front of them why shooting the AR not me lol so I doubt he even used one","post_message":""},{"comment_id":"896653263722173","commenter_b":"Why is she getting away with this lawless behavior?","commenter_a":"told ya!","post_message":"HILLARY CLINTON HANDS OVER A BLANK SERVER TO THE FBI Slick Grifter..."},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."}]
