[{"comment_id":"10153187905664087","commenter_b":"If posting in the comment section of a facebook page is being 'involved in politics' then we really are in trouble.","commenter_a":"For better reasons why we should have retention elections of these SCOTUS. Congress can't be trusted to impeach these first year lawyers in black robes!!","post_message":"#BREAKING: Rowan County Clerk Kim Davis was released from federal custody today and ordered not to interfere 'in any way, directly or indirectly, with the efforts of her deputy clerks to issue marriage licenses to all legally eligible couples.'"},{"comment_id":"1960555887503751","commenter_b":"TRUMP! Go, go go ... Defeat that evil woman and make America great AGAIN!","commenter_a":"Killary is a beast and needs to be in prison........TRUMP is the only candidate that deserves to be president","post_message":"I will defeat Hillary Clinton - and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"997724686914554","commenter_b":"Natenyahu, be a man and accept refugees to Israel!","commenter_a":"Hungry is right!","post_message":"A Syrian father laid to rest his wife and his two little boys in Kobani after they drowned as they tried to flee to Europe. This, as desperation and anger deepens among people escaping conflict and poverty. Read more: @webpagelink"},{"comment_id":"10154355731201051","commenter_b":"stupid bitch.","commenter_a":"it doesn't matter what trumpie ever says His repugnant followers don't care about anything even if it affects them They lost out on the education they sorely needed..and they will never complain because they are too dumb to know it","post_message":"Actor Tom Arnold says he has secret recordings of Donald Trump doing something so bad that it could change everything."},{"comment_id":"10153813340919342","commenter_b":"I am also. But unfortunately not all women have that same luxury.","commenter_a":"They don't do thorough background checks?!!!!!!! My heart hurts every time I see stories like this! That's why I'm a stay at home mom. Can't trust anyone now a days.","post_message":"A parent's worst nightmare comes true. #abc13"},{"comment_id":"1131244553635264","commenter_b":"#BernieOrBust #BernieAllTheWay #DropOutHillary","commenter_a":"Either way it will be a Democrat all the way to the White House again for another eight years along with a Democratic majority in Congress! Many thanks to the GOP for putting up unelectable candidates election after election,those dumb idiots will never learn","post_message":"Trump must be stopped.  Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were 'Together' and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."}]
