[{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"1226487637389708","commenter_b":"Just remember when your ass gets beat up coming to my town... U started this shit. I bet your wife's dick is bigger than yours","commenter_a":"Hillary gonna win.....trump will be doomed....after his rape case and so many other Court appearances he will be in jail along with the other republicans...","post_message":"CAN'T WAIT!"},{"comment_id":"1802884339926690","commenter_b":"evil woman","commenter_a":"You're right, Donald. She doesn't give up. She's been fighting to keep people like you from preying on others - all her life! You aren't even qualified to clean toilets.","post_message":"\"You interrupt me all the time. Why don't you interrupt her?\" All the times tonight's #debate moderators and Donald J. Trump talked over each other. @webpagelink"},{"comment_id":"10154173006980950","commenter_b":"No intel has verified that! Please name names & not newspapers","commenter_a":"If Russia hacked the election to favour Trump, then how did Hillary win the popular vote?","post_message":"NEW: Despite Vladimir Putin denials, U.S. intelligence sources confirm hacks and cyber operation of this scale could not have occurred without his blessing, CBS News' Jeff Pegues reports. @webpagelink"},{"comment_id":"1069713516429844","commenter_b":"My Father and his family came through Ellis Island. They had to have a sponsor in the United States who guaranteed them a place to live and support until they were self-supporting. They were screened for disease. My Grandmother was almost refused because she was sea-sick for the whole journey. The government officials had to determine that it was only sea-sickness before she was admitted. Now, we have no idea what illnesses are being brought in to OUR Country through all these illegals and obummers immigrants. No wonder illnesses that we have virtually eliminated are cropping up now.","commenter_a":"Absolutely the way that it should be done!","post_message":"America's Freedom Fighters"},{"comment_id":"10152810811021130","commenter_b":"It absolutely shocks me that this many woman are grossed out by their own bodies. What a shame!","commenter_a":"I'm glad to see this getting publicity. I love my cup and would love to see more acceptance and less \"ewwwwww\" about it. It's great!","post_message":"Menstrual cups could be a great alternative if you don't like tampons or pads."},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"}]
