[{"comment_id":"370042553184039","commenter_b":"marriage was not meant to be a shitty relationship depends have a market I would like to invest","commenter_a":"evolution and same sex cannot coexist","post_message":"POLL: God's design for marriage? (man and woman)"},{"comment_id":"10155922190175725","commenter_b":"#FuckTrump","commenter_a":"Trump 2016!!!","post_message":"Watch my interview with Eric Bolling that aired today- @webpagelink"},{"comment_id":"1187762051262009","commenter_b":"Build a defense wall also protects from evil ducks.","commenter_a":"President Trump will think of something.","post_message":"China have finally confirmed that they have lost control of their space station."},{"comment_id":"10153436699476337","commenter_b":"Yea and he's got a fake pussy.","commenter_a":"No one here read the article did they? She's not being called out for being a white NAACP supporter or for 'not being black enough', she's being called out for lying about being black. She's totally not black at all. She's a white woman pretending to be black saying that she grew up poor, black, and racially profiled. When she wasn't. At all. -_-,","post_message":"HOW DOES THIS HAPPEN? Is this NAACP leader pretending to be black? Many on the Internet certainly think so..."},{"comment_id":"10153961188184705","commenter_b":"Show us your Boob's lady.","commenter_a":"Hi from rio brasil","post_message":"Get an exclusive tour of the Mashable House at SXSW with Pete Cashmore."},{"comment_id":"897157403654934","commenter_b":"she gave her all, wasnt a armchair quarterback","commenter_a":"She did it great","post_message":"“It took heart, guts, determination, falling down and getting up, and a little motivation from the crowd to get across the finish line.   Check this out.”"},{"comment_id":"10153554876193010","commenter_b":"Yes send them all back,","commenter_a":"Welcome to socialism.","post_message":"The children at this San Bernardino motel pay no attention to the meth dealers on the sidewalks. To the men in nice cars driving slowly through their makeshift play area scanning the doorways for prostitutes."}]
