[{"comment_id":"10154353544894228","commenter_b":"Middle aged white ladies also have much less to fear now don't ya? Or was there a string of incidents where the police killed a group of white women I didn't hear about? Common sense...","commenter_a":"I was always when pulled over by the police to put my hands on the steering wheel (10 & 2) until the officer approached you and asked for your information. Common sense people.","post_message":"The victim's name is Philando Castile"},{"comment_id":"902141793237008","commenter_b":"She didn't deserve this. She was a good hoe...","commenter_a":"'@username it appears that maybe, a hoe can get cold","post_message":"Elizabeth Luebke died in Wisconsin after going outside in temperatures as low as as -27.5 degrees with the wind chill."},{"comment_id":"945825838793990","commenter_b":"nothing but a whore from the sixties.","commenter_a":"Ask her to please go back to Vietnam where she loves it so much .","post_message":"Actress Jane Fonda, who 45 years ago as making the lives worse for Americans fighting for their life in the jungles of Vietnam, is now making lives worse for American energy producers. Given the fight Fonda now has against North American oil discovery and transportation, she has once again aided and abetted the enemy: Islamic oil producers. It seems Jihadi Jane neither understands how her actions are viewed by the enemy (major Muslim oil exporters, some of whose core members want to see the destruction of the United States) nor how these anti-jobs protests impact hundreds of thousands of North American families. @webpagelink"},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"10154261503546770","commenter_b":"Hollywood is full of whores!","commenter_a":"Omg. It's just a dress! Didn't your mothers teach you that if you don't have anything nice to say, don't say anything at all!!! Looks like you could all use a lesson in kindness!!","post_message":"Holy moly, Jennifer Aniston."},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1047390088634796","commenter_b":"Jane I think you should try instead of History books the actual bill that was introduced in the Congress in 1983, the sponsors of the Bill, the Democratic almost unanimous vote, and the Democratic rationale behind their support. It's there to read if you get your head out of your ass","commenter_a":"Strange how if your a Democrat you tend to forget the horrors created by your party when foolishly you are in command. After President Carter destroyed our country we needed to reform the Social Security System so it would be solvent as is the case today with Obama doubling down on the atrocities created by Carter. When Reagan took office he acknowledged that the system was broken and pledged to fix it. At the time we had a Republican President, a Democratic Congress and a Republican Senate but we also had a different set of principles in our politicians as they were devoid of loons like yourselves and the likes of Cruz. The Democratic house took care of all federal employees, all Federal Judges, all State Workers, all women's rights, raised the AGE of retirees from 65 to 67, took care of themselves, their staff and whoever else they could ...","post_message":"Jeb Bush has a plan to save Social Security: Ensure hardly anyone can qualify for it. Is he trying to lose the election?"}]
