[{"comment_id":"1179451428768183","commenter_b":"Blacks on a welfare leash! also remember the KKK WAS STARTED BY THE DEMOCRATS. the first RUNAWAY Slave tracked down by a Democrat Government and the first legal slave was owned by another BLACK MAN ,, SO WHO YOU VOTING FOR ??","commenter_a":"Bastard, who opened the vault holding our Social Security.","post_message":"Here's the HARD TRUTH about what the Democrat party has REALLY done to the Black community,."},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"},{"comment_id":"10153411171720950","commenter_b":"Ron, please stop being materialistic with cheap cars. Are you trying to intimidate or impress your FB friends? Bad taste, Sir.","commenter_a":"Trump Supporters are not motivated by fears, we're motivated by FED UP! We're tired of our voices being stifled and the liberals/media doing all they can to take our freedom of speech! This time we WILL have the last word! <3 Common Sense Approach! TRUMP! 2016","post_message":"Donald J. Trump: \"We love Nevada!\" Watch his full victory speech after projected GOP caucus win."},{"comment_id":"1123813841007500","commenter_b":"Illegals, you don't like our choice for president please do us a favor and go back to yours!","commenter_a":"Trump brought half his votes!!!","post_message":"WATCH LIVE: President Obama awaits Donald Trump's arrival at the White House for transition meeting. Story: @webpagelink"},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""},{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."}]
