[{"comment_id":"1263441190347909","commenter_b":"Exiguimos la Cabeza de Juan Manuel Santos Calderon Presidente Eunuco de Colombia, Denodado Comandante santiago de las Farc, lo mismo que de los Altos mandos de las Fuerzas armadas por traidores y por aceptar el soborno del Gobinero Naco terrorista Criminals de Santos y su Asquerosa Estirpe. Esto es lo que dir un honesto y verdadero Jefe de estado. Los Colombianos pueden tener la tranquilidad que sea cual sea su elecci en el plebiscito, estar seguros porque las fuerzas del Estado no se doblegar y se han fortalecido\" No lo que dijo Santos? Emisario de FARC y Presidente de los narco terroristas genocidas de las Farc. est preparadas para guerra urbana si se cae proceso: La mas asquerosa extorsion y amenaza a los Ciudadanos. Justicia Verdad Patria o Vida.","commenter_a":"Senator, please oppose any and all gun control propsed by the Democrats. They simply want to disarm the American people to suit their own separate agenda.","post_message":"Today, Senator Nelson and I urged the U.S. Small Business Administration (SBA) to provide assistance to the small businesses in the Orlando area that have been closed off to the public in the aftermath of the Orlando attacks. In a letter to SBA Administrator Maria Contreras-Sweet, we requested assistance to the affected businesses, such as disaster relief loans. Read the letter here: @webpagelink"},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"10153142231890329","commenter_b":"Also it says 'optional' so parents do what they want regardless. Lots of parents I know say they prefer the class donation as they may not always get a chance to shop or might not know the child well enough to personalise the gift.","commenter_a":"Let me put forth a different perspective: my kids are in classes with 20 odd children in - this is excluding family and family friends who attend the parties. At birthdays if all the class kids attend that's 20 gifts. You are hard pressed to find something cheaper than 10 quid these days and most individual presents cost more so if everyone gives 10 quid it lands up being more affordable for a lot of people, means a lot less clutter in what are often small London homes or apartments, and collectively with say 200 pounds a child can get one substantial gift like a bike or it could go towards something the parents need for their child. I genuinely don't see an issue with this at all and fail to see how this is a middle class issue.","post_message":"Oh, dear. // BuzzFeed UK"},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10154148249086336","commenter_b":"KILL ALL RNC PIGS,LIBS,RINOS,SQUAEL PIG SQUEAL","commenter_a":"Caleb Benitez these are those higher power that people don't know about ,they try controlling the world ,not this time","post_message":"The letter reportedly contained a threatening message that implied Donald J. Trump's children would be hurt if the GOP candidate did not withdraw from the 2016 presidential race."},{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"},{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"}]
