[{"comment_id":"10153291228751037","commenter_b":"He's not abandoning his kids. He's still their for them.","commenter_a":"It's too bad he didn't do it before making all of his children.","post_message":"#BruceJenner’s ex-wife knew about his plan to transition decades ago"},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"255446914877983","commenter_b":"Criminal News Network or Crooked News Network is full of nothing but whiny ass snowflake safety pin wearing nutjob crybabies. #TRUMPWON #MAKEAMERICAGREATAGAIN #DEALWITHIT #SORELOSERS","commenter_a":"It's a ban. He knows it we know it. But that doesn't stop him from spinning the Don's con.","post_message":"CNN just proved that Trump is LYING when he says he’s not banning Muslims. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10155415846376509","commenter_b":"Money time you know it","commenter_a":"Vinny","post_message":"New video shows power lines exploding on Merritt Island, Florida, as Hurricane #Matthew lingers just offshore. More footage from Florida as Matthew hits: @webpagelink"},{"comment_id":"10155226667000579","commenter_b":"Then you better understand that and take help from the one aligned closest to you which includes conservatives of all races.","commenter_a":"White males are the least served segment in British education.","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\" Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"10153109594476519","commenter_b":"Women always tell there sob stories, leaving out key facts and events, seen it, been through it, went to jail over it!","commenter_a":"Men that beat woman usually don't get in fights with men.","post_message":"You'll never look at unrepentant woman-beater Dr. Dre again the same way after reading this..."}]
