[{"comment_id":"1135459499799639","commenter_b":"END THIS EVIL INBRED FERAL ISLAMIST BARBARIAN DEATH CULT NOW, WHEREVER IT EXISTS!!","commenter_a":"Vote Trump and we won't have this problem.","post_message":" correctness is putting America in danger and it's time to take action and protect our country!"},{"comment_id":"721943014570974","commenter_b":"lol bitches just saying the same shit to get pity and money","commenter_a":"Oh I bet she's a 'liar' too. So many baseless accusations that all sound exactly the same from people who never knew each other. Amazing.","post_message":"A protest was planned at the event."},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"461301070747634","commenter_b":"They are ILLEGAL!!! It should not be allowed!","commenter_a":"No illegals have no right to vote in our country's elections. The democrats are destroying this country. Wake up is a phone worth your vote. Honestly look around are you better off now than 8 years ago. On the economy I blame both parties!","post_message":"BREAKING: Obama Launches Plan To Allow Illegals To Vote In Next Election They are not citizens of our country, and should not be allowed to vote. Do you think this is wrong?"},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"10153814451294203","commenter_b":"Rebecca shut up","commenter_a":"Nicki Minaj's dad was a financial executive. She's not exactly on Lil Kim's level. Plus she attacks Taylor swift and Miley. These kids are 10 years+ younger than her. It's a little pathetic","post_message":"\"You in videos with black men, and you bringing out black women on your stages, but you don want to know how black women feel about something that so important?\""}]
