[{"comment_id":"895487660544289","commenter_b":"I wanna find the actual article sited for this one","commenter_a":"Tiffany Rae 😐","post_message":"Another colossal Republican waste of taxpayer money."},{"comment_id":"10152961909207894","commenter_b":"Jessica Denise u got the good job, penis all day like that? Well dammmmm","commenter_a":"It was a little 🍆🍆🍆🍆🍆 but I seen it.","post_message":"Woah! LeBron James Accidentally Flashes His Penis on Live Television [Video]"},{"comment_id":"649524331880703","commenter_b":"She and Bernie are behind these riots. Why do we listen to her? She is a liar!","commenter_a":"You got that all right. Randy Webster","post_message":"Disappointing to hear."},{"comment_id":"10153677801340530","commenter_b":"Wow dicks can talk. .","commenter_a":"But, the SCOTUS said there is no racism in America.","post_message":"Community and city leaders are strongly condemning a racist flyer against blacks that was circulated in Southfield tied to an upcoming mayoral election."},{"comment_id":"998307626859113","commenter_b":"Sorry pussy","commenter_a":"Not Donald we like Donald we don't like pushy billionaires","post_message":"A billionaire Saudi Prince makes an offensive demand of Trump, then Trump FIRED BACK!!"},{"comment_id":"979982332037226","commenter_b":"Yawn. Y'know, feminism isn't out recruiting fuckwits today, to my knowledge.","commenter_a":"I will never call myself a feminist simply because feminism has no true definition. sure it has a dictionary definition but 9 times out of 10 people who support \"feminism\" have a different approach to it and have values that don't support equality. Men aren't afraid of powerful women I wish there were more powerful women because I can't stand submissive people. If I could find a woman that would stand up to me (in a loving way not a psychopath way like a lot of women think they need too)I would be very happy. I will say this again and again feminism is not the way to gain equal rights for all, because of its aggressive nature it will always have people fighting against it. Also the word feminism does not need to exist if it simply means equality then we can just say equality. I refuse to label ...","post_message":"Well said.  Like ATTN: on Facebook."},{"comment_id":"992749454106935","commenter_b":"Truth be told and Trump will get to it publically soon: we're at war with Mexico. Take back southern AZ from the drug cartels. Put the military and night vision drones on the border along with the wall. No way will I go there either. And right on look at labels and BUY AMERICAN!","commenter_a":"Go Trump. Excellent rally. Gotta love truth and intelligence.","post_message":"Donald J. Trump spoke to thousands who braved the heat at a rally in Fountain Hills today. If you missed the event, you can watch it here: @webpagelink"}]
