[{"comment_id":"1114612235259607","commenter_b":"So wait, now they don't WANT jobs? All this time they've been saying they want equal opportunity and a piece of the pie. Clearly, this group do sent want to work for it. They just want a free piece of pie. Give me a break! At least those inside the church get it. The Democrats have kept blacks down for decades and more but the fools outside just can't see beyond their hate.","commenter_a":"Democrats always wanted all black not to progress so they can pen them for their vote every election for a hand out then abandon them for 3 to 4 years.And the cycle goes on and on.","post_message":"DETROIT POLICE FORCED To Call Out BOMB SQUAD To Protect Trump From Hillary Supporters Offended By Speech About Bringing Jobs Back To Blacks…Faith I don't remember seeing a bomb squad when Hillary recently visited Detroit… @webpagelink"},{"comment_id":"1123485461004965","commenter_b":"I like how Jeffery Nichols is the expert on how Women get pleasure. Don't ever believe what Women say lol.","commenter_a":"The correct position is penis in vagina. #savedyouaclick","post_message":"Size has nothing to do with it. (via HuffPost Canada Living)"},{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"967879999960507","commenter_b":"Mr. Trump she is saying anything to get the Latino vote. She doesn't give 2 cents about any of those people.","commenter_a":"That's just insane!!!!!","post_message":"Do you believe that Hillary Clinton now wants Obamacare for illegal immigrants? She should spend more time taking care of our great Vets!"},{"comment_id":"1921412701405309","commenter_b":"Your daughter is next.","commenter_a":"But had they wasted the dude, they'd be selling shirts with his thug face and calling for a cop lynching.","post_message":"A police officer's body camera captures the moments he and his partner were shot during a traffic stop. More details ---> @webpagelink"},{"comment_id":"10153395852497629","commenter_b":"aSSHOLE NIGGA LOVER!","commenter_a":"I think it's safe to say they are not accusations but are indeed facts","post_message":"The interview is expected to include Dolezal’s first major comments regarding accusations that the she lied about her race."},{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"}]
