[{"comment_id":"522894674501793","commenter_b":"@username NEVER THE BENGHAZI BITCH.....please","commenter_a":"i would vote for hillary to stop cruz. if he should become the nominee i will for the first time in my life vote democrat just to block a foriegner from getting in. I want a president born in the usa not canada, whether he is eligible or not is beside the point","post_message":"Have the GOP left it too late to try to stop Donald Trump?"},{"comment_id":"10153889494331438","commenter_b":"I just don't understand how people who vote for these whackjobs can imagine living in the world that they want to create. Talk about a hellhole..","commenter_a":"Ted Cruz's campaign statement that \"Muslim neighborhoods\" should be patrolled and militarized is possibly the least American thing I have read today. Land of the free, home of the brave? Nope, not so much because those brown people scare me! And who determines how many Muslims in one neighborhood is enough to warrant this police state attention? I live in a very nice neighborhood and although I don't know for sure (you can't tell someone's religion by looking, folks) there are possibly 4 or 5 Muslim families in my little 2 mile square housing tract. Would that qualify as a \"Muslim neighborhood\"? Jesus, these guys are scary. Bomb, kill, torture, create Muslim ghettos inside the United States. Ugh!","post_message":"Ted Cruz and Donald Trump have particularly harsh responses to the Brussels attacks."},{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"10153767932239411","commenter_b":"Anna Tagintseva shut your mouth bitch","commenter_a":"I know those Chinese universities are bullshiting all the time and yet @username believed it. And someone believe that China will go against US with the help from Russia? Come on, China and US need each other, while Russia will have to stand back and watch.","post_message":"'The increasing pro-active position by China is built on increasing sophisticated and powerful military technology in China defense and military sector. This factor makes US increasingly worried.' - Xin Zhang, Research Fellow at East China Normal University. (Op-Ed)"},{"comment_id":"10153374154140329","commenter_b":"Karmas a bitch if you're an asshole","commenter_a":"People do spit in the food. I did it myself at McD's way the hell back when. Only when someone I really hated from school came through the line though. Nice big hock in their drink. Mmm...good times.","post_message":"\"We have all tried, and failed, to make a burger that looks like they do in the ad.\""},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"}]
