[{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"10153196392273984","commenter_b":"Hey Stupid! Thanksgiving is a day of thanks not a stupid holiday for your illegals and muslin buddies. Let it be! Stop destroying this country.","commenter_a":"Can we get rid of him, NOW!! Outrage doesn't even begin to describe this!! Leave things be!!","post_message":"Unbelievable. There's no way Americans are going to stand for this... Are you outraged?"},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."},{"comment_id":"10153322754305667","commenter_b":"On an earlier USA today post the majority were celebrating a mans death. I used the word moron it was deleted and USA today had me banned from FB for seven days see a lot worse then that.","commenter_a":"I have been noticing that on comments sections of news articles on Facebook regarding the death of Supreme Court Justice Antonin Scalia, it is the Bernie Sanders supporters/Bernie Bros who are celebrating the death of the late Supreme Court justice. I may have disagreed with his ideology and beliefs, but that is not a reason to celebrate and be happy of someone's death. Says a lot about the mentality of many Berniebots... especially the younger generations.","post_message":"In 1986, he was nominated by President Reagan to the Supreme Court. His confirmation that year made him the first Italian American justice."},{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"}]
