[{"comment_id":"1421191604574730","commenter_b":"Go to hell","commenter_a":"He's perfect for the job and he's american","post_message":"EXPLOSIVE! CNN Columnist Says Michael Phelps Should Not Have Been The Team USA Flag Bearer Purely Because He is WHITE! Liberals are going CRAZY, injecting skin color and religion into the the olympics!   Lets GET 5,000 SHARES For Phelps! He's White and a BADASS! So what!"},{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""},{"comment_id":"10153533239272464","commenter_b":"Dream Team? Cruz/Fiorina Gowdy - AG Carson - Sec HHS West - SecDef Rubio - Sen Maj Leader Issa - House Maj Leader","commenter_a":"Protestant Christian liberty to be exact!","post_message":"We’re a nation that was founded on religious liberty.  Stand with us to defend it: @webpagelink"},{"comment_id":"10155083896191178","commenter_b":"He might bring racist charges up against you","commenter_a":"OK I'm going to say it Everyone is racist OK we get it wahh wahh wahh!","post_message":"The histrionic grumblings for the liberal parodies over at MSNBC are STILL outraged over Sen. Sessions.  Liberals never seem to realize that they've worn out the racism accusation."},{"comment_id":"602588076598438","commenter_b":"She's just a confused little child in a bad place with no morales","commenter_a":"She is a pervert and don't have enough sense to know it , she thinks Christianity is a fairy tale but she wont when she gets to hell","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'.  This is unacceptable, we stand against Miley 100%.  Do you agree Miley should be kicked out of the country?"},{"comment_id":"10155094877376037","commenter_b":"She deserves the same treatment.... sick sick sick nasty woman. She doesn't deserve life","commenter_a":"Where's the picture of the mother?","post_message":"14-year-old Grace Packer was beaten, raped, poisoned and strangled."},{"comment_id":"10153382589804411","commenter_b":"shutup bastard","commenter_a":"Fuck them they are just as much terrorists as Isis","post_message":" we are facing a kind of danger that is unprecedented in history, which targets humanity itself,"}]
