[{"comment_id":"748263168643341","commenter_b":"Trump is a racist bigot who drives fear into weak people just like Hitler #dumpthetrump anti-muslim isn't a political opinion its bigotry. and his anti-hispanic is talk is racism","commenter_a":"America doesn't thrive off fear we don't feed off hate and we will certainly not have a president that represents all that is wrong in this country. Hillary is who we need in charge #dumpdrumpf #imwithher","post_message":"\"I don’t think there is anything more important than working to provide every child in this country and beyond the chance to do what that child is meant to do, because I think every child has a God-given purpose and a God-given potential. That means every child deserves a good teacher and a good school regardless of the zip code that child lives in. That means every child deserves the health care that will keep that child healthy, will deal with whatever befalls him or her. That means that the child’s parents and grandparents deserve good jobs with rising incomes to provide a good, solid life for their son and daughter, for their grandchild.\" —Hillary"},{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"},{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"1080143312021089","commenter_b":"Yep TRUMP 2016","commenter_a":"Looking forward to him becoming our next president asap.","post_message":""},{"comment_id":"10153476889474087","commenter_b":"How about that Nikki Haley... Traitor bitch","commenter_a":"Yesssss we need a lider no a politician like Cruz","post_message":"Donald J. Trump surged 5 points since last month to open a massive 22-point lead over his Republican rivals in North Carolina."},{"comment_id":"255446914877983","commenter_b":"Criminal News Network or Crooked News Network is full of nothing but whiny ass snowflake safety pin wearing nutjob crybabies. #TRUMPWON #MAKEAMERICAGREATAGAIN #DEALWITHIT #SORELOSERS","commenter_a":"It's a ban. He knows it we know it. But that doesn't stop him from spinning the Don's con.","post_message":"CNN just proved that Trump is LYING when he says he’s not banning Muslims. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10155154956823487","commenter_b":"These people are like the Clinton's they don't give a damn about the illegal immigrants! All they care about is making money 💰 off the backs of illegal immigrants!! Why didn't they help those poor people before get legal documents in order!! 😡😡😡","commenter_a":"A refreshing glimpse of optimism.","post_message":"Bill Gates: predict a comeback for the truth."}]
