[{"comment_id":"833282530101334","commenter_b":"Oh Terry your pro pic explains it all lmfao","commenter_a":"Tell me what isn't wrong with this picture.","post_message":"Bush. Romney. Utah. One day only."},{"comment_id":"10154180246323984","commenter_b":"Ha ha bitch you lost .........","commenter_a":"This is why they Hate Donald Trump, He is upsetting the SCheme they have in PLACE! @webpagelink","post_message":"Many are predicting that Marco Rubio is going to lose his home state of Florida in tonight's primary. Rubio has a plan if that is the case, and it's going to surprise a lot of people.  Is it over for Rubio if he loses Florida?"},{"comment_id":"10153293008086350","commenter_b":"Ugh totally agree! I would love a competent and brilliant female to become president! Just not Hillary..","commenter_a":"We need a woman president..just not Hilly! My opinion!","post_message":"\"I think women can do anything and be anything, but the president, I feel, is for a man...That does not mean we cannot be successful  run businesses, be doctors, be lawyers  I was only speaking of one specific position...and again, it's just my opinion.\""},{"comment_id":"10155384146056509","commenter_b":"You have to be a goddess first.","commenter_a":"There are no emojis that look like me either... When will Apple give a goddess as an option","post_message":"She couldn't find an emoji that looked like her, so she took it upon herself to make it happen.  Meet the 15-year-old that brought the hijab emoji into the picture @webpagelink"},{"comment_id":"10154767533793258","commenter_b":"Definitely a paid for astroturfer, Delphi technique plant. Real people are not this stupid.","commenter_a":"No one cares about her emails","post_message":"Security briefings for Hillary Clinton should be suspended until investigation is over, says Paul Ryan."},{"comment_id":"1573029682757155","commenter_b":"What's to be done. Vote for Hillary to screw over the vets, give away more jobs and flood us with refugees and illegal Hispanics?Seriously.","commenter_a":"@username shell say anything to get a vote this is how she really is a dirty white devil","post_message":"She used the racial slur over and over and over..."},{"comment_id":"1767802863447868","commenter_b":"Dirty old lady","commenter_a":"So, Madonna sexually assaults a minor, but it's all good because she's a female. Yay equality. #BecauseFeminism","post_message":"“Seriously, why would I sue Madonna for the best moment of my life?”"}]
