[{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act!  Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1700232733582570","commenter_b":"Lose with Cruz.... I like it","commenter_a":"Having recently switched parties for \"one day\" Republican status I will vote cruise to stop Trump in April 26 Pennsylvania primary then probably vote for Hillary in November. Question: what is the brand of the dress Nicole Wallace wore today?","post_message":"Joe and Mika are here to discuss the state of the 2016 race following the Wisconsin primaries – and much more! #24Live"},{"comment_id":"1178124042307867","commenter_b":"No brains--no headaches. Maybe he should leave with Whoopie. They would be happy in Iran, take Rosie with you.","commenter_a":"Some of these people have lost their f##ing minds!!","post_message":""},{"comment_id":"10155453199626729","commenter_b":"Illegal immigrants big issue here too, handing out drivers licenses that look identical doesn't help with the voter fraud issue we definitely have, but don't acknowledge.","commenter_a":"We have the same problem in Nevada. My guess would be 25% of the plates are Californian, maybe an exaggeration, but at least 10-15% are, and these aren't tourists because they're parked and driving out in our neighborhoods. These are just the ones that haven't bothered to register their cars here. Overwhelming people you talk to are Californians and most have come within the last 5-10 years. Majority of true Nevadans, natives and long time residents, are embarrassed by the color our state was on that election map. I wish the infestation would retreat to their looney state but it appears we've been overrun.","post_message":"So simple, a liberal could understand it"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?”  Answer: “I think she’s honest to the people who pay her.”  MORE: @webpagelink"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"1079285898761124","commenter_b":"No woman with an ounce of self respect would vote for a misogynist like Trump.","commenter_a":"Good way to clean out those we don't need in America. Just one more reason for Trump to win","post_message":"A majority of people said they would go to Mexico."}]
