[{"comment_id":"904031539740409","commenter_b":"@username you are just Jealous because your fat ass cannot wear something like that. Shut the fuck up.","commenter_a":"1. Bitch you know damn well you can't wear that to school shut you're whinny ass up, talking about being oppressed. I'm offended about your damn video. 2. When the your school starts banning something you can't control like how your hair grows then your oppressed until then put a damn t-shirt on and go about your way because if you truly didn't car how you looked you wouldn't have wore a strapless dress.","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10152943603067217","commenter_b":"Mosks should be destroyed first","commenter_a":"The earthquakes should destroy only churches.","post_message":"New Zealand's Christchurch was struck by a devastating earthquake in 2011"},{"comment_id":"10153412861986167","commenter_b":"A bunch of false prophets and their followers, sickening.","commenter_a":"First of all, for those who wish to criticize my typos complain to google translate. I'm dictating this and I don't have time to go back and correct typos. When it comes to SOCIAL ISSUES, topics like gun control, abortion, gay marriage etc voters who latch on to these things miss the big picture. The big picture involves having a viable economy in which to have debate about social issues. An economy cannot survive on social issue focus. It is a fact that 70% of all entitlement Dollar goes to bureaucrats not to the poor. @webpagelink To this day paychecks from the government are being dispersed to illegal immigrants, prisoners and dead people. There are perhaps hundreds to thousands of programs that have been budgeted by the government which always end up taking longer to implement and always cost more than expected. Under Hillary Clinton and Obama, six billion dollars ...","post_message":"He also thanked the star of Duck Dynasty."},{"comment_id":"10153404410236130","commenter_b":"@username All things you listed other than pot are legal. Yet why is it that while people...especially GOPers LOVE to scream bloody murder and point their fingers at those threatening to take away their guns and insist they not be persecuted the same way women who have abortions, gay men and women and birth control is seen as the devils idea. Guns kill people, The LGBT community hurts no one...all we want are equal rights and legal marriage, abortion in most cases saves unwanted children from being abused or just dumped in the trash and the GOP Congress has been trying to withhold food, shelter and a chance at a normal life from those born to poor unwed women. Where are those men and women when they see poor unnourished children who most likely are not wanted some being abused some being killed and some just starving to death. Instead ...","commenter_a":"To all those saying we have no gun problem - please review our statistics on mass shootings. We have more than the next few countries combined. And to those saying gun restrictions would not help because criminals would still get guns anyway: if you limit something at its source, if there are less guns being sold, period, statistically all criminals would have a much tougher time getting a gun. People with a history of physical violence and mental illness SHOULD NOT have access to guns, and today most can simply walk into a store and buy one as easily as anyone else - anyone who argues with these facts is part of the problem.","post_message":"What is standing in the way of meaningful gun reform?"},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"10153896425024330","commenter_b":"Some women are idiots. Victim blaming is a disgusting habit.","commenter_a":"Some women are saying , what did he do to deserve that ...","post_message":"This woman is accused of setting her boyfriend on fire and police are searching for her. Warning, the details are disturbing. ---> @webpagelink"},{"comment_id":"10154322380197217","commenter_b":"I'm just surprised he didn't grab her in the pussy","commenter_a":"Anyone else shudder when he leaned in to kiss Michelle Obama?","post_message":"Hugs and a gift. The Trumps meet the Obamas at the White House   #InaugurationDay   bbc.co.uk/inauguration"}]
