[{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"},{"comment_id":"943023235797122","commenter_b":"And California lets the illegals vote so it is no good!","commenter_a":"California and NY for Hillary of course.... Trump the rest of the Country so","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"827089443993145","commenter_b":"First Lady??? Really","commenter_a":"Ignore ....WHAT A WASTE OF CIVILATION","post_message":"Is she serious?"}]
