[{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."},{"comment_id":"692289614253147","commenter_b":"Doubt it,he won't say anything different then he has already,he's got a small mind and can't think beyond the paper and crayolas","commenter_a":"No,it's not...after his scripted speech Hillary IS going to have a lot of problems","post_message":"This made my morning. I hope you guys enjoy it as well. ~Natalie"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"523659234491323","commenter_b":"Not with a dogs dick!","commenter_a":"fuck her","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"1299697093430376","commenter_b":"Snaaaaacks forreal. Them ladies looking like 4 course meals family","commenter_a":"So we all goin to ignore all the female snacks 😍😍👅 in this video ...","post_message":"Mike Tyson going in on Soulja Boy! #WSHH #MikeTyson #SouljaBoy"},{"comment_id":"10153752277268984","commenter_b":"Hell No!!! Women in combat will be a liability and not an asset!!! I am all about women achieving their highest, but to EVER say a woman physically has the same strength as a man, is absolutely false!! Our culture teaches males to protect females, our Military does NOT need that liability in battle!!!!!","commenter_a":"Sorry ladies but I feel that only a few of us can fit certain gender roles in many male jobs. No standards should be lowered to make women fit . Some can apply but not all can make it.","post_message":"Shortly after the US military lifted its ban on women serving in combat, the Marine Corps began a year-long experiment - here's the result... What do you think about women serving in combat?"},{"comment_id":"10154603806201037","commenter_b":"You mean like your people did to the INDIANS","commenter_a":"If Mexico and Mexicans hate him so much, they are free to go back to their cesspool and stop raping the American welfare system!","post_message":"“[Donald J. Trump] is not welcome to Mexico. By 130 million people, we don’t like him. We don’t want him. We reject his message.\""}]
