[{"comment_id":"10154501984339087","commenter_b":"'@username So they get deported five or six times then come back and kill innocent people. Did you know that most of them send money back across the border to help their families come here.","commenter_a":"Trump cost himself the popular vote. He already said he is keeping Obama's amnesty in place. So if he's blaming the illegals why would he keep them here? He is such a lying fool and his supporters suck it up.","post_message":"'He said 3-5 million 'illegals' voted so that's why he lost popular vote,' one Democratic aide said about President Trump's comments at the meeting."},{"comment_id":"1260373737389011","commenter_b":"The Cocaine Carrot.","commenter_a":"Hahaha","post_message":"Nailed it."},{"comment_id":"1023827831012269","commenter_b":"Darlene Daniel not fair to Americans. Take way American jobs with low wage illegal invaders","commenter_a":"We 'ALL' know that Donald Trump is 'NOT' afraid of Megyn Kelly. Actually it is just the opposite. Fox News is AFRAID OF DONALD TRUMP.","post_message":"Michael Moore chided Donald J. Trump for being afraid of Megyn Kelly and backing out of the upcoming Republican debate Tuesday night on 'The Kelly File.'"},{"comment_id":"1181580438601675","commenter_b":"That's not true but i'm glad she got away with it,I can't wait till she starts debating Trump.","commenter_a":"Not","post_message":"True story..."},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"10154798309806002","commenter_b":"Women do it too!","commenter_a":"Why would u allow a man to babysit your kids hell no only man I'd allow is my father and my husband","post_message":"A 30-year-old man allegedly molested toddler-age children he was babysitting while living in Michigan."},{"comment_id":"10153148300259575","commenter_b":"You certainly are. 'Judge and be judged' Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing ' under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."}]
