[{"comment_id":"10152892453289342","commenter_b":"Texans have had a better record than the cowgirls since they became a team up until the last 2 yrs.","commenter_a":"Come over to a winning team THE DALLAS COWBOYS!!!","post_message":"The greatest offensive player to ever wear a Texans uniform will play somewhere else next season.  The team has reportedly freed Andre Johnson up to pursue other options"},{"comment_id":"10153384160134087","commenter_b":"RINO","commenter_a":"And we should listen to Kasich because his numbers are so high? Isn't that why he was on the end?","post_message":"“I don’t have anything against Mr. Trump personally, but we’re not going to scoop up 11-and-a-half million people and ship them out,\" said GOP presidential candidate Gov. John Kasich.  \"He’s disparaged Hispanics and Muslims, and he’s insulted women. These are not the things that unify the country and make us stronger.\""},{"comment_id":"1700042326929352","commenter_b":"Right here with my eyes open....much wider than your evidently.","commenter_a":"I just saw a posting with Trump and the same headline....too easy to to photoshop pictures these days. If you remember, bush didn't salute a Marine coming off AF1, as did President Obama....they've all done it at one time. However, I think Obama has been a great job....kept us out of a bigger depression than the big depression the last president create, but Americans have very short memories.","post_message":"Obama Refuses To Salute During The Pledge Of Allegiance [VIDEO].  Hands down the worst president of all time.  Do you think Obama is a disgrace?"},{"comment_id":"10153264748117690","commenter_b":"I Hope she gets fired! She obviously can't do her job.","commenter_a":"Why does she still have a job? Bottom line she should of been fired end of story.","post_message":"A Kentucky courthouse clerk who refuses to issue same-sex marriage licenses is scheduled to appear before a federal judge Thursday. @webpagelink"},{"comment_id":"1106022556087458","commenter_b":"Her agenda with democrat socialist is to end all jobs in America. Prove to Me they intend to increase opportunities . Jobless rate only lowering past few years due to millions that left and no longer participating in work force .. They want more of that trend for sure.","commenter_a":"This is the only truth she has told.","post_message":"Clinton promises to put people out of work."},{"comment_id":"10154974354758984","commenter_b":"lock her up","commenter_a":"Both are ignorant bitches!","post_message":"In Wisconsin, the recount had gotten Hillary Clinton one extra vote. Now, though, the recount in Pennsylvania is in, and here's how many votes it netted Jill and Hillary...  This is NOT what they expected."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."}]
