[{"comment_id":"10153754963576636","commenter_b":"oh god im sick of seeing this the vote has been and gone in favour of leave just bloody get over it ,and out of the 2 mil that have signed how many are actually british,didn't know this was a world wide petition","commenter_a":"Keep politics out of music.","post_message":"The petition is unprecedentedly popular"},{"comment_id":"1011526468943605","commenter_b":"That's what professional political tumors do!","commenter_a":"Good. Cruz wasn't there for Kim Davis. Ted was there for political purposes.","post_message":"Ted Cruz tried to get on the stage with Kim Davis in Kentucky ... only to be blocked by an event staffer."},{"comment_id":"10153467924781350","commenter_b":"Men like them that way on women.","commenter_a":"U can wear skinny jeans that aren't painted on","post_message":"Don't be a fashion victim."},{"comment_id":"1266165143423955","commenter_b":"This woman is such a moron. Send that lunatic Syria then see if she still thinks they ate doing gods work what an idiot","commenter_a":"Your kidding right ? Sick out of it, to hate that much.","post_message":"HOLY F*CK!"},{"comment_id":"10153169080361336","commenter_b":"What's up with that first woman who RAN in the other direction? Nice.","commenter_a":"They only pitch in to help the fallen man and good Samaritan after RUNNING AWAY FIRST!","post_message":"The 28-year-old hero leaped on to the tracks to save the man from getting hit by a train and other commuters helped to pull them both to safety."},{"comment_id":"675876952588617","commenter_b":"Hillary is a lying bitch.","commenter_a":"Won't hear this at the debate.","post_message":"JUST IN!"},{"comment_id":"1047811211942074","commenter_b":"I love her and some woman here are simple misogynists!..bitter woman! GO HILLARY!","commenter_a":"Look Hillary, no one likes Lena Dunham.","post_message":"Follow along as Lena Dunham takes over Hillary’s Instagram account today from the trail in New Hampshire: instagram.com/HillaryClinton"}]
