[{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"10153101645216615","commenter_b":"Common Core teaches math comprehension. It teaches students how to comprehend math rather than just memorizing tables. It also teaches students different ways to do math in their heads. I love the \"its dumbing down students\" argument. You, as an adult, cant do it or unferstand, your child can... yet this is making THEM dumber? Sounds to me like its an ego thing. How about you sit there and learn with your child instead of just complaining about it. Take the time to try to actually understand what your child is learning. Why would any parent not want their child to be smarter than they are... why would any parent argue and complain about something that will make their child smarter simply because the parent isnt smart enough to understand it. I have a High School education, no college degree, and i can still understand common core math. Why cant ...","commenter_a":"I love how people bash Common Core without ANY understanding of it at all. I mean, zero comprehension. \"Fox News told me it was bad so it's bad.\"","post_message":"This has been trending -- one dad blasted Common Core with the check he wrote to his child's school."},{"comment_id":"966636103398507","commenter_b":"Racism is alive and well and all the race baiters are enjoying tearing this country apart.","commenter_a":"This country is screwed up,this is what happens when people are as divided as modern day white people are. Who are the whites of these days owns slaves or would want to own anybody. The bible says u cannot enter into heaven if u don't forgive the ones who wronged u,yet some raise hell about a hundred years ago.what about the tribes in africa who captured weaker tribes and sold them to slave traders never her about that from the fame hunters.what about the poor whites who were treated the same and had to work all week for slab bacon,6 ears corn.","post_message":"RIDICULOUS: I can't figure this one out! Americans need to get their acts straight and realize who really protects them. LIKE our PAGE! www.facebook.com/Briankolfage"},{"comment_id":"10153756353381337","commenter_b":"Samantha, I am aware of the defintion. Just telling you its irrelevant. It's a stupid term made to put people down for making different choices.","commenter_a":"Taylor swift is a hoe she goes thru like 4 boyfriends a year","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."},{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153114063969091","commenter_b":"Why wouldn't they? Everyone is scared to stand up for something. Sodomites wont be around my kids cause they're not gonna be in the scouts.","commenter_a":"Just close the organization down no one is going to send There kids with the Boy Scout leader who is gay, it's another thing to gay people have screwed up","post_message":"BREAKING NEWS: Boy Scouts expected to announce that it will allow openly gay adult leaders."},{"comment_id":"1279876618745757","commenter_b":"Why tho. She's the one that slept with em. She's a dirty ass hoe and she got caught. If you were the dude and she wanted to bang you you'd probably do the fuckin same","commenter_a":"All you guys are saying he shouldn't whip his ass if you listen to the video he is calling dude out by his name so he obviously knows him which means he probably knows them I'm not gunna lie call me what you want but I'd whip dudes ass too","post_message":"He had rage behind each blow! #WSHH"}]
