[{"comment_id":"1139564849397858","commenter_b":"Well Brady, unfortunately they aren't going to kill poachers and they sure as hell aren't going to just up and kill buyers... So this is the next best thing.","commenter_a":"Science is kewl","post_message":"They plan to flood the market for rhino horn, selling the 3D printed version for 1/8th of the price of the real thing, and eventually force the poachers out of business"},{"comment_id":"1011637472207253","commenter_b":"Fuck drake ol biting ass nigga","commenter_a":"Fuck drake. He ripped off some shit from the nineties. Don't get crazy all you drake heads he is just trash anyways. pop not hip hop so don't disrespect hip hop by putting his name in the same sentence","post_message":""},{"comment_id":"1146246835410774","commenter_b":"Yes is no and no is no! Stupid males! Raaarg","commenter_a":"Dennis Kiil Andersen Mats Hellan Tobias Berntsen @username Magnus Nadheim sykt at denne artikkelen faktisk er legit og ikke laget for tull","post_message":"It's not just \"no means no\" and \"yes means yes.\""},{"comment_id":"10154071433569778","commenter_b":"You know him or something?","commenter_a":"Gordon","post_message":"A 9-year-old boy beaten by his mother's boyfriend over birthday cake died from his injuries."},{"comment_id":"10152932838822169","commenter_b":"I like the way you assume everyone is consuming too much. When sitting on our butts all day has more to do with it.","commenter_a":"Makes sense. The explosion of obesity has occurred after the advent and proliferation of fast food restaurants.","post_message":"Fast food kills gut bacteria that can keep you slim, study finds (From PBS NewsHour)"},{"comment_id":"1559763640995949","commenter_b":"What the hell is wrong with this women? What the hell was she thinking? She is going to jail. What a slime bag.","commenter_a":"Good! She should!","post_message":"Dani Mathers could now face criminal charges"},{"comment_id":"10153165565220399","commenter_b":"The Democratic President Lyndon B Johnson, the father of the \"Great Society\" that was the rebuilding of the Urban Center for the Black communities to populate and be the new beginning for the poor blacks.. How did that workout... Detroit was setup as the model city.. As was Baltimore and Chicago... In reality, all the democrats did was move the blacks from the southern plantations to the Urban Plantations and laugh as they did it!! Here is the quote from LBJ as he did this: \"These Negroes, they're getting pretty uppity these days and that's a problem for us since they've got something now they never had before, the political pull to back up their uppityness. Now we've got to do something about this, we've got to give them a little something, just enough to quiet them down, not enough to make a difference... I'll have them niggers voting Democratic ...","commenter_a":"Blame it on anyone else but your OWN failed policies, GOP.","post_message":"The conservative blame game is in full effect."}]
