[{"comment_id":"10154018789591491","commenter_b":"@username littel girls like that crap thats why.","commenter_a":"Because boys can grow up to be whatever they want, but girls will grow up to only want to look pretty and wear cute clothes...","post_message":"Amy Schumer and Blake Lively are not happy."},{"comment_id":"1398558810203863","commenter_b":"Stay off facebook lady.","commenter_a":"I'm not a hater, and love fashion, but, this dress is absolutely unprofessional! Why would she do something like this...makes a person wonder!!!","post_message":"'She looks like she's working for an escort agency!'"},{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"},{"comment_id":"10154466561263701","commenter_b":"Shawna you just said what I'm thinking!!!","commenter_a":"Reading these comments show that the majority is against her, read a trump article and the majority is in favor of him. If she wins we will know how truly corrupt our election system is.","post_message":"What did you think of Hillary Clinton's DNC speech?"},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"485911244932789","commenter_b":"be head her","commenter_a":"Yes , l support our police","post_message":"A woman is suing the police department... over a hijab? This woman broke the law, the police are completely in the right. Do you support our police?"}]
