[{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"10155143983283010","commenter_b":"GIRL WHY YOU MUFASA","commenter_a":"Ben Rotherham GAMBI AS SIMBA THIS IS NOT A DRILL","post_message":"James Earl Jones is reprising the role of Mufasa, and Donald Glover is taking on Simba."},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"925323364324906","commenter_b":"@username yes it was look at the lady who ran it she has ties to hamas open your eyes","commenter_a":"There was no pro Sharia Law March. There was a \"we don't want a president calling women who disagree with him fat pigs\" march. A \"no man has the right to give another man permission to call his daughter a piece of ass\" march. A \"why would you take away funding from violence against women programs as one of your very first acts as president\" march. A \"don't remove health insurance before you have another plan in place march\".","post_message":"Ayaan Hirsi just took the gloves off. She couldn't let this go unnoticed, and neither could we. Do you agree with her?"},{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."}]
