[{"comment_id":"10153171348750736","commenter_b":"Yeah, I want my 30 cents! in a check.. pronto!","commenter_a":"Instead of someone winning, split thee winnings with everyone who bought a ticket!!","post_message":"#BREAKING  No winner in tonight's Powerball Jackpot.  Wednesday's draw will be worth at least $1.3 BILLION.  Is there a billionaire's equivalent to the Dollar store??"},{"comment_id":"992220407519685","commenter_b":"Meghan Sullivan","commenter_a":"Hold up! Imma let you finish, but I just wanted to say Bernie Sanders had one of the best shut downs of all time!! #feelthebern","post_message":"Bernie Sanders to Hillary Clinton: \"Excuse me, I'm talking.\""},{"comment_id":"10154698586269641","commenter_b":"Or avoid stealing from worker or outsider, as well as free up labor to provide a cleaner environment","commenter_a":"What they're doing is phasing out people so they don't have to pay $15/hr wages.","post_message":"McDonald's is getting fancy - the chain is rolling out self-order kiosks, mobile pay options, and even table service"},{"comment_id":"10153126250487452","commenter_b":"But she could've let the staff know so they wouldn't bother her. Or find a private, cleaner place than the toilet to do it. Why do people feel so goddamn entitled? People relieving their bladders are important, too, and they can't do that at their seats. Some people need to grow up and realize the world doesn't revolve around your areola","commenter_a":"I have one kidney and would hate to have to sit and wait and wait and wait to use the restroom because she wants the bathroom for an extended period of time. This has nothing to do with breastfeeding and everything to do with being inconsiderate.","post_message":"An Arizona mom claims she was reprimanded by a flight attendant for pumping breast milk in an airplane bathroom."},{"comment_id":"928783390554410","commenter_b":"This is who he is at his core. This is what he will be. He has done us the great service of showing his true face, not the shiny, practiced veneer of the professional politician. Whether he learns to act presidential or not, this is the man you will be getting if you vote for him, a man who wants to pull out a measuring tape to settle disputes over issues. The fact of the matter is that there are no good choices this time. There aren't even any ok choices. But this man is a bully with all the character flaws that go with that, and he will do almost as much damage to this country as Clinton or Sanders. I am seriously dismayed by the continued popularity of this man, but I am equally dismayed by my other choices. And I am dismayed with a general electorate who ...","commenter_a":"It's past time for him to be acting more presidential. He also needs to do some research in preparation for the debates. Chris Wallace made him look like a fool when he put up those slides on his economic plan. He's making it harder and harder to not only defend him to skeptics, but to also remain an enthusiastic supporter instead of being a reluctant one.","post_message":"Despite what polls had shown days before Super Saturday, DONALD TRUMP lost two of the four states on Saturday to Sen. Ted Cruz, and the states he did win were at a lesser margin than predicted.  Some supporters and pundits are placing the blame on Trump's performance during the Thursday night debate, stating his \"less than presidential\" behavior is catching up to him.  In the past, DT has stated he will act more presidential when the time is right, so we ask you to take our poll knowing DML will read the results later tonight on UNFILTERED.  POLL: Does Trump need to act more presidential in order to win?  @webpagelink"},{"comment_id":"609436732514253","commenter_b":"She is a bitch","commenter_a":"Obama deserves no respect People who turn away from the very truth that is staring them in the face, will learn all too soon what these represent. This will be the beginning of the end. People have no idea what Hilary and Obama are doing behind our backs. Their evil and hatred goes much deeper and more wide spread than you can imagine. This is not a joke, it is coming.","post_message":"Some say this sign is extremely disrespectful to President Obama and should be removed on that basis alone. This man says it's his property, and the First Amendment gives him the right to keep the sign up. Decide for yourselves who is right."},{"comment_id":"10153743944261337","commenter_b":"GO HAWKS! We love you hating little bitches!","commenter_a":"It's okay. Knowing that their jackass coach screwed them out of the Super Bowl last season, it makes it better. Overrated team from Seattle.","post_message":"THEY BLEW IT: The blown call in Monday's Seattle Seahawks -Detroit Lions game inspired some hilarious fan reactions..."}]
