[{"comment_id":"933475353412186","commenter_b":"Somebody needs to fuck her ass up","commenter_a":"Elisabeth Hasselbeck is a no talent bimbo. She is a racist a bigot and just an unpleasant pain is n the ... Neck! Her claim to fame is that she was on Survivor and clung to an older gentleman who did everything for her and protected her. How is she qualified to open her ignorant mouth about anything political??? Typical Fox bleached blonde snotty witch! Yuck! She was fired from The View because she was so nasty and bigoted.","post_message":"This is superbly offensive."},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"},{"comment_id":"521358881400958","commenter_b":"They never would of been allowed into Our Great America.","commenter_a":"Vote all Democrats out of office Be Smart America they are worthless hypocritical self centerd murdering traitors","post_message":"If you were in charge, would you have these deported back to where they came from?"},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"1312058212172984","commenter_b":"Pandering witch.","commenter_a":"We're going to miss Michelle!","post_message":"“Como saben, estamos en medio del Mes de la Herencia Hispana. En las aulas por todo el país los niños aprenderán sobre Dolores Huerta y César Chávez… Julián y Joaquín Castro y la jueza Sotomayor… Roberto Clemente y Laurie Hernández… Gloria Estefan y Lin-Manuel Miranda e innumerables latinos más. Nombres que conocemos y nombres que tal vez no conozcamos, pero que han enriquecido a este país por generaciones. Si eres mexicano, puertorriqueño, cubano, latinoamericano o afrolatino… si tu familia acaba de llegar o ha estado aquí antes de que los Estados Unidos existiera… no eres un extraño. No eres un intruso. Ustedes son nuestros vecinos, nuestros colegas, nuestros amigos y nuestras familias. Ustedes hacen a nuestro país más fuerte, más inteligente, más creativo. Quiero que sepan que yo los entiendo y estoy con ustedes. Y una y otra vez hemos visto que cuando invertimos en la comunidad ─ cuando hacemos ..."},{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"},{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"}]
