[{"comment_id":"460337480823499","commenter_b":"No if they do then the native Americans should be first in line. The USA did not enslave the Blacks they where sold to plantations she them","commenter_a":"No","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"580872065400762","commenter_b":"She is a big mess","commenter_a":"Dress by Radical Christian Dior.","post_message":"LOL! Sorry, but we just couldn't resist... where did Kim Davis think she was going tonight? If she wasn't such a homophobic bigot we'd recommend she go on Queer Eye for the Straight Girl! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"10153051114747550","commenter_b":"I did when I was a teenager! Moms are hot!","commenter_a":"True it's sick but boys that age will bang a mom especially to show off.","post_message":"Mother accused of having sex with minors at her teenage daughter's party--> @webpagelink"},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"1021715281216809","commenter_b":"Definitely Dan!","commenter_a":"We are witnessing the greatest attack on our American Democracy since Citizens United! The DNC has chosen Hillary Clinton to be their next presidential nominee, and is doing whatever it takes to silence the voice of the people. We cease to be a Democracy when the Party receives millions in funding from the same media corporations that report biased coverage in an attempt to deceive voters. We cease to be a Democracy when the Party takes deliberate actions to suppress voter turnout, turns away registered voters, and commits election fraud in Arizona and across the country. We cease to be a Democracy when the Party selects super delegates (many of which are Lobbyists) who refuse to the listen to voice of the people the are intended to represent. We cease to be a Democracy when the Party simply removes a candidate from the ballot in Washington DC! A vote for ...","post_message":"Every success by Bernie is met with a story or column or talking head whose message is “but he can’t possibly win.” That's the media refrain because the Democratic establishment can't conceive of the possibility Bernie will win. That's because they aren't listening to Bernie's message and its resonance among Democratic and independent voters (as well as many Republicans). They don't know how determined Americans are to reverse the increasing concentration of wealth and political power that are eroding our economy and democracy. - Robert Reich"},{"comment_id":"10155041928809187","commenter_b":"Good please for ICE to pick up a bunch of illegals.","commenter_a":"i wish mexico would close its borders an treat american they way they treat illegal just for one day","post_message":"We are Live outside City Hall, where protesters are rallying as part of a nationwide demonstration called 'A Day Without Immigrants' to speak out against recent ICE crackdowns, and showing the impact that immigrants have on the community."}]
