[{"comment_id":"10153757809364877","commenter_b":"She wouldn't even have had the chance to do that to me, once I saw the knife in her hand it would be over for her with the quickness! I hope she gets arrested and that boy leaves her high and dry if he hasn't already!","commenter_a":"He should run and never look back","post_message":"Woman holds knife to boyfriend’s throat, forces public apology for flirting on Instagram.   Grio fam, how would you react if your son or daughter was in this relationship? Please be advised that this footage shows graphic imagery."},{"comment_id":"10153783824626523","commenter_b":"she's hideous","commenter_a":"Who cares","post_message":"Chelsea Clinton has given birth to her second child, a boy."},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"976708829015963","commenter_b":"If we could only get rid of Wynne and get 3 new federal candidates","commenter_a":"The whole country needs to come to grips and be honest with ourselves...Canada can and must do much better than we did over the past ten years!","post_message":"She's not holding back."},{"comment_id":"10153607644803984","commenter_b":"Vote all those dirt bag's out we need people with balls not vagina2","commenter_a":"Now how does everyone feel about this 'War Hero'?","post_message":"BREAKING: John McCain's secret move against arming our troops here at home just got exposed, and what he did is absolutely sickening.  McCain hoped this would never come out, but we're not going to let him get away with this.  If you want to hold McCain accountable for his deplorable actions that endangered our innocent troops, be sure to share this article."},{"comment_id":"525047394321882","commenter_b":"its not about muslims or syrians. It's about smart people and dumb people. Dumb people do stupid things And r always careless and go to prison Regardless of race colour ethnicity in every nation. Just as some kids who try being gangsters and get all hyped up and dont care about family and bettering themselves. Smart people in every nations try bettering there lives family living standard etc Education. I just like to say something That I want My message to be shared throughout the whole of the mainstream media. If i was ruler there b no prison i would make all dummies clean roads toilets for free or beat them these rude violance fuckers","commenter_a":"Laura Silk","post_message":"\"This is what happens when you f*** with mother Syria all of your blood will be spilled.\""},{"comment_id":"10153534003896336","commenter_b":"He's also a Democrat","commenter_a":"our Massachusetts senator markey voted not to defund planned parenthood","post_message":"BREAKING NEWS: Senate blocks Republican legislation to defund Planned Parenthood. @webpagelink"}]
