[{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"1279039008785553","commenter_b":"Video by a feminist probably...","commenter_a":"Wait a second. You're mad because 20 people, out of 320 people, dropped out of the study.... so 6%.... and because 6% couldn't handle it..... you reach the conclusion that obiously men can't handle birth control.... isn't that a sexist statement against men? Not to mention I'm sure more than 6% of women don't take birth control because of side effects. Let's just think before we generalize a group.","post_message":"Male birth control is here, but men won't take it because they can't handle the same side-effect of female birth control that women have been dealing with since the 1960s."},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"10153839277481717","commenter_b":"Welcome to Trumps America","commenter_a":"That's horrible! My partner and I attended the fair...we felt safer and less vulnerable in SF than we do in many parts of Albuquerque.","post_message":"Five men attacked the friends with pepper spray for no apparent reason other than they are gay."},{"comment_id":"10154680684123797","commenter_b":"Lisa Austin","commenter_a":"Okay, now this stupid game of Chicken is getting out of control! 😡😡 Someone needs to blink or all of the children in Illinois are going to suffer!!😡😡","post_message":"#BREAKING: Chicago Public Schools will not open in the fall if Illinois fails to approve an education budget, CPS CEO Forrest Claypool told the Chicago Tribune Wednesday."},{"comment_id":"10153408065894087","commenter_b":"Think all of you are missing the point. Women does it , Throw the book at her !!!!!!! Guy does it , oh yeah no problem .","commenter_a":"All these criminals need to go down, Hillary included","post_message":"Congressional Republicans are largely brushing off the news Defense Secretary Ash Carter used his personal email to conduct business at the Pentagon, in stark contrast to the scrutiny that has fallen on Hillary Clinton."},{"comment_id":"880649995314349","commenter_b":"What's the hold up? The President cannot be trusted to follow the law. President Obama has repeatedly shown that he will use \"prosecutorial discretion\" to simply refuse to enforce provisions of the existing deportation laws. Marco Rubio originally helped sponsor the Senate bill, but now says that he opposes any immigration reform until the border is secure FIRST. Any immigration reform should first start with verifiable border security -- not 100% since that's not realistic, but verification that almost all illegals are turned away at the border. At the same time, the Visa system needs to be reformed -- people from all over the world enter the U.S. with a tourist visa and then never leave -- the current system fails to track these people and force them to leave. This is not an issue of race; it is an issue of national sovereignty. Only after the Border is secure ...","commenter_a":"I am very impressed, Rep. @username, you nailed it. First, this is a vital issue under the Constitution -- the President cannot simply wish a new law into existence, especially one opposed by Congress, and the Congress MUST assert its Power of the Purse to preserve the balance of power. Otherwise, the Presidency becomes too powerful. Second, this Administration and the Democratic party have been able to accomplish much of their agenda by simply refusing to negotiate, forcing the Republicans to give in. However, the structure of the legislative branch in the Constitution was INTENDED to require compromise to get things done. It is obvious that the Democrats are more concerned with political victories than what is best for the country. This is one time when the Republicans should not, and CANNOT simply acquiesce to the other side who refuses to compromise. We all know that separating DHS funding bill ...","post_message":"I spoke on the House floor to discuss the Department of Homeland Security's funding and challenged our Congress to find solutions. You can watch my remarks here:"}]
