[{"comment_id":"888422501286356","commenter_b":"I feel bad for whoever votes for Hillary!!! You are asking for our country to be taken over and also death for America!!!! I guess Muslims get there wish of destroying America if Hillary is elected into the White House!!!! She is a traitor just like Obama is!!!!","commenter_a":"Hillary will probably just let me and my brothers die without any help. I trust trump fully.","post_message":"Who do you trust more to protect the American people: Hillary or Trump?"},{"comment_id":"10153815226441636","commenter_b":"@username, I think you and @username are on the same side..","commenter_a":"Western propaganda won't stop! Imagine of a situation if the coup would succeeded?! It would be worst than Egypt, killing of thousands in one night!","post_message":"Warning: graphic mages"},{"comment_id":"10154292587651336","commenter_b":"@username he has submitted the required financial statements","commenter_a":"Running a country isn't the same as running a business. It'd better not be, since Trump has a habit of declaring bankruptcy...and that's not an option for the country. Sure, he's rich. However, he STARTED really rich and would be about as wealthy now or even more so if he didn't go into business at all, based on average stock market gains. @webpagelink/ With his unwillingness to release his tax returns and his inability have to have a serious discussion of policy, beyond 140-character tweets and repetition of: \"tremendous\", \"problems\", \"so many people tell me\", \"better deals\", and \"believe me\", Trump is most certainly NOT qualified for the job.","post_message":"\"I feel Mr. Trump can come and get us better deals. He is a businessman,\" former Kentucky councilman David Abbott said. \"I don't want my children Dave and Erika to grow up in debt all their lives.\""},{"comment_id":"1078464325543429","commenter_b":"@username , no not dictating whatsoever. She can spend as much as she wants; I won't vote for her.","commenter_a":"You're spending so much personal time with this little girl. Are her parents campaign contributors?","post_message":"I’ll do everything I can to make sure that DREAMers like Karla never have to worry about being separated from their parents."},{"comment_id":"10153457931491130","commenter_b":"Zane Gutierrez","commenter_a":"The politics of this is, scandalously ,that its a way for the establishment to write people off , they do not want to understand., There is so much hypocricy on this particularly in relation to alcohol : whats wrong with wanting to feel good , which is why anyone tries to get high off anything ?How we try to achieve this might be questionable but anything can be abused, does not make it bad in itself . people would not do self-destructive things if they felt self-worth. As some people here have said in their comments here,learning to love themselves was key to giving up the addiction .(not read the article btw)","post_message":"\"We put people who are not well in a situation that makes them feel worse and hate them for not recovering.\""},{"comment_id":"1792493044351097","commenter_b":"For the safety of the country, her and everyone linked to her SHOULD BE PERSUED, THEY NEED TO DO IT. Unless all this was just political carpet-bagging, I'd hate to have to believe that, but their out to break this country, and if they aren't taken to task They Will Break This Country!!! Trump, keep your promise, were counting on you...","commenter_a":"He's just another elite ..with promises to get elected and being schooled by the negro ..he never meant to do anything he said ..he panderd to us all..","post_message":"President-elect Donald Trump and his transition team signaled Tuesday that his administration will not pursue further investigations of Hillary Clinton, backing off a vow on the campaign trail to appoint a special counsel to probe his Democratic rival secret email setup as secretary of state and suspected pay-to-play deals involving her family foundation."},{"comment_id":"10152762563712894","commenter_b":"I can't stand that Bitch.","commenter_a":"For some reason i like the color & hair, I just don't fuck with Kylie like that tbh . Then again I feel as though she low key disrespecting black folks with this shit. She tried it with the lips & butt but this shit right here just made me feel like she's doing the most now","post_message":"Say What Now? Kylie Jenner Says She Wishes She Looked Like THIS All The Time [Photo]"}]
