[{"comment_id":"1204270932993102","commenter_b":"Ape woman","commenter_a":"never heard of him !!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10155376064740389","commenter_b":"She's needs to be prosecuted for breaking the law!","commenter_a":"OF COURSE..... She is a huge narcissist, just like Obama. I am thoroughly disgusted!!!","post_message":"The White House tried to push past the Hillary Clinton email controversy on Wednesday, with Press Secretary Josh Earnest telling reporters he's \"not particularly interested in\" discussing the issue.   Question of the Day: Do you believe the former secretary of state's explanation for using one email account for work and personal use?"},{"comment_id":"10154453767181729","commenter_b":"Liar liar pants in flames","commenter_a":"BHO will pardon her.","post_message":"And she still thinks she's going to get off scot-free..."},{"comment_id":"364315750438606","commenter_b":"Orrrrrrrrrrrrrrrr, build a big wall around it and let in any idiot who wants to live like an animal.","commenter_a":"Solution for Baltimore. Dismantle the police department and incorporate law enforcement into the Department of Social Services. Terminate all police officers. Fund the law inforcement portion of social services with Federal dollars. Social Services pay gang members $100,000 plus benefits and pension to each gang member, no identification or proof of residence required. Pay each adult $500,000 for new housing or relocation. No identification or proof of residence required. No follow up for use of housing fund. Encourage business owners to allow no cost to their merchandise (free) .","post_message":"Democrat Candidate for Senate in Maryland Blames Republican Governor for Baltimore Education Problems"},{"comment_id":"10153499650978132","commenter_b":"She's skanky. ...that's a door the should have stayed closed.","commenter_a":"Why can't she just retire and go away.","post_message":"Pink ambition!"},{"comment_id":"1007831625924362","commenter_b":"Aka: a bitch wasn't a slut cause she refused to go along ( re: politically, sexually, maternally, etcetera.)","commenter_a":"Never, even when I thought it of myself. Maybe since I'm \"of a different generation \" I'm prouder of some other word","post_message":"You keep using this word. I do not think it means what you think it means. - Alisha Huber"},{"comment_id":"929408747192304","commenter_b":"As stupid and ugly as her mom!!","commenter_a":"She can't help it...look who her parents are!","post_message":"Chelsea Clinton....you are an IDIOT."}]
