[{"comment_id":"1238750836185439","commenter_b":"Maybe we \"Military Mothers\" should go protest the \" Temper Tantrum Party Protester's\" for BURNING OUR AMERICAN FLAG that is on our son's and daughter's uniforms. Wonder if that would take away their little spot light and five seconds of fame?","commenter_a":"After watching the new \" Temper Tantrum Party \" BURN OUR AMERICIAN FLAG last night, I'm voting straight up Republican Party Ticket for every Election... big, or small... for the REST of my life.","post_message":"\"We are living in an amazingly destructive, politically correct environment here in America. Just because something offends you, doesn't mean you have the right to hurt or destroy.\" Bill O'Reilly had some strong words for left-wing \"agitators\" who refuse to accept Donald J. Trump's victory in a fair and honest election. @webpagelink"},{"comment_id":"10153706895136680","commenter_b":"Go to hell","commenter_a":"We should be afraid of those 'people' who are different, they're culture and values are incompatible with western cultures and values, they claim their holy book teaches that we must convert of they must kill us... Sounds like these 'people' are going to be a great fit in our country... A nation that was built of immigrants who DID assimilate and welcome the new culture and values of the country they moved too","post_message":"New York Governor Andrew Cuomo says Donald Trump's campaign message is: \"Be afraid of people who are different.\""},{"comment_id":"10153499292339714","commenter_b":"Since when are \"weak\" and \"helpless\" feminine traits?","commenter_a":"Worst thing to say to a boy according to my son is \"clean your room\". He wants to be called a \"man\" and he's 7 and proud of it. People need to get over this emotional craps. Boys will eventually be men. I think the worst thing you could say is \"woman up\".","post_message":"How do we socialize boys differently?"},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."},{"comment_id":"10153675023971409","commenter_b":"First of all .... what is she doing out of the kitchen ? She should be making sandwiches ..not pizzas","commenter_a":"Good that's life","post_message":"Jensen isn't sure yet if she'll take any official legal action, but she still wants to fully understand why she wasn't given equal pay."},{"comment_id":"1353932681333143","commenter_b":"No ma'am. Her CHOICE killed her. Let's call a spade a spade.","commenter_a":"Grieving or not that's totally unfair on her friends who by the sound of it were nit even taking g the drugs with her! RIP what a waste of life educating kids this age on drugs is the most important lesson here as they are bound to try them.","post_message":"'You f****** killed her'"},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"}]
