[{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed.  You can't see greatness at the same time you see that."},{"comment_id":"1097784373632154","commenter_b":"He always stands up... Except for when it's time to bend over for Trump.","commenter_a":"I have never stopped liking Cruz...He always stands up for what he believe in...Sometimes that puts him at odds with other Republicans.","post_message":"Excellent question..."},{"comment_id":"1068442033272574","commenter_b":"If they don't like this country they should leave. Why don't they each donate a couple of million each to some of these black communities that need the money to make things better. They won't because they are talkers not doers.","commenter_a":"If the Giants do this I will give up my Tickets","post_message":"#BoycottNFL is gaining MASSIVE momentum online. Fans are FED-UP and FURIOUS with the anti-American hatred NFL players are increasingly showing.  Let's get 5,000 SHARES and LIKES to Boycott the NFL!!!  @webpagelink"},{"comment_id":"677415119050364","commenter_b":"Yes....","commenter_a":"yes","post_message":"Take the poll!"},{"comment_id":"1225877584098936","commenter_b":"Build a wall!! That'll stop em!! Bahahaha","commenter_a":"El Chapo was there.","post_message":"The 'super tunnel' – eight football fields in length – was discovered along the U.S-Mexico border south of San Diego.  via NBC 7 San Diego"},{"comment_id":"1091917874180626","commenter_b":"MAKE AMERICA GR8 AGAIN 2016! # AMERICA FIRST # BUILD THE WALL!","commenter_a":"Let's see a lot more arrests...these are terrorists!!","post_message":"Democrats' voter outreach to gang members is apparently working..."},{"comment_id":"10154686014913010","commenter_b":"That idiot grabs my pussy and makes it hurt and I dont even have one","commenter_a":"Wow I can sleep better","post_message":"At least one prominent Republican is still backing Trump."}]
