[{"comment_id":"10153642652659411","commenter_b":"Needs to be bombed to death. No more terrorism, no more parasitic immigrants.","commenter_a":"You want to slow down the migrant crisis? Stop bombing the Middle East!","post_message":"Op-Edge: 'The root cause is frankly Europe just not being prepared for this large scale numbers of people fleeing persecution and misery in other countries. Europe has rather just closed its eyes to reality and rather hoped that the situation might just go away' - Keith Best, former Vice Chair of the European Council for Refugees and Exiles"},{"comment_id":"10152925868341336","commenter_b":"I agree Joanie, impeachable offense to release enemies from Gitmo to try to kill Americans again!","commenter_a":"Obama has committed treason with this big time!!! Why hasn't congress started impeachment.","post_message":"The U.S. Army has decided to charge Sgt. Bowe Bergdahl with desertion, according to Retired Lt. Col. Tony Shaffer. He told Bill O'Reilly that the Army \"wants to do the right thing\" but The White House \"wants this to go away.\" @webpagelink"},{"comment_id":"10153704026896350","commenter_b":"And what kind of Kenyan or African name was it. Something no-one can pronounce or spell I'm sure.","commenter_a":"s","post_message":"Aww, we think the name is perfect!"},{"comment_id":"10153438712476636","commenter_b":"Good start but we need a lot tougher laws for the sex offenders especially the pedophiles and rapists.... If there is a country to deport them to then fine, if they are British I think we should start new colonies on the barren islands around the uk.","commenter_a":"Hear hear.....send them all home,BLAGGING no good scumbags. Thank god a bit of sense at last they have been taking the k Piss of our system too long","post_message":"Exclusive: Theresa May's response to the uncovering of sex abuse gangs"},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"116808422164651","commenter_b":"Illegal immigration must first be brought under control. Only then can we regulate all immigration and I doing do Skylake washes to naturally as the flood of cheap labor is ended.","commenter_a":"END THE DRUGS COMING IN US ! WE'RE IN BIG TROUBLE WITH DRUG ADDICTION","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign. MORE: @webpagelink"},{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."}]
