[{"comment_id":"938184229613517","commenter_b":"So then everyone on earth is an American, and we should have no borders, right?","commenter_a":"I took that ancestry DNA test. You all should. Turns out, I'm Native American. If your DNA turns out you are not from the America, shouldn't you fuck off?","post_message":"'Was it because of Europeans? Or was it because of the very early events that led to the peopling of the Americas?'"},{"comment_id":"10153768480704203","commenter_b":"And that makes it ok? So she should be President?","commenter_a":"Name me ONE successful person who has not had a pattern of hurting people, stepping on them, and then rewarding themselves? She's no different than 99% of the CEO's out there that make MILLIONS on the backs of their employees.","post_message":"need people to know who this woman is and what her pattern is of hurting people, stepping on them, and then rewarding herself."},{"comment_id":"10152698000912452","commenter_b":"I would still as long as she doesnt talk.","commenter_a":"Jessica acting like she ain't asking for attention lol girl you would be doing the same crap. Earn the beads Jessica","post_message":"UPDATE: The girl in the photo had been identified. She is 17 years old and does not attend college. Although she says her interaction with the group was consensual, she did not realize her photo was being taken. @webpagelink  Do you know her? Police in Florida are concerned this spring breaker, spotted in naked photos, may be in danger."},{"comment_id":"1561423844160413","commenter_b":"'@username 😜","commenter_a":"'@username me","post_message":"One 38-year-old Liverpool man took 39 goes to pass. 🚙"},{"comment_id":"1138545752861116","commenter_b":"Yes I want her and her friends out of my Country!","commenter_a":"They are lying liberals what you expect","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153635432868690","commenter_b":"Its not and has never been your land. You have no heritage nor history there except at best been that of tenant felaheens the Ottomans brought to milk the land for them or at worst; as more than half of you people are, illegal immigrants from the surrounding Arab states who flooded the land from the 1920s to 1940s as migrant workers and mujahideen who came to steal the land from the Jews. That your right of return better get its head swivelled to the Arab states. Besides, the Jews you ran out of the Arab states also has the keys to their doors and need their properties you stole and their own right of return.","commenter_a":"You will return and all Muslims will pray in Israhell won't last more than a decade","post_message":"'For Palestinians to give up the Right of Return- even those who have no intention of ever returning - is to acknowledge that we are lesser beings; that kicking us out of our homes and ripping our hearts out was okay. It is to affirm that we do not deserve our own history and heritage; that it was okay for our proud parents and grandparents to wither in the ashes of their memories inside refugee camps unfit for animals.'  Palestinian novelist Susan Abulhawa explores the meaning of the Right of Return."},{"comment_id":"1311803105524589","commenter_b":"Bryan Gogg Citation? I didn't think so. The SS never comments on such things.","commenter_a":"I will not shed one tear for any faithless elector that ends up suffering grave consequences.","post_message":"This is about to be all over the news, folks."}]
