[{"comment_id":"10154884648408984","commenter_b":"The old saying ...behind a good man is a great women.... nothing wrong with that","commenter_a":"Very impressive - I have watched her handle exceptionally tough and even hostile interviews exceptionally well. Great job!","post_message":"Trump's campaign manager, Kellyanne Conway, is the very first woman to run a victorious presidential campaign. After the election, she reveals why Trump chose her..."},{"comment_id":"10153659512120667","commenter_b":"add plz","commenter_a":"Put one of these posers up against a Gracie see what happens...dumbed down fighting","post_message":"He did it again."},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."},{"comment_id":"10157544751020354","commenter_b":"wasn't lady gaga also a crack fiend before she made shitty music and supported domestic terrorists?","commenter_a":"No one gives a shit what the fucking rich liberal is said.","post_message":"Here are Lady Gaga's tweets supporting the BLM radicals..."},{"comment_id":"10153913133146130","commenter_b":"Wtf is a \"puff hoe\"?","commenter_a":"I get all of my political advice from rich Hollywood actors, said no human ever. This just made another 100,000 people vote for trump,, keep it up puff hoe,, you're helping!","post_message":"Nailed it, Angelina Jolie."},{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."}]
