[{"comment_id":"431964536928587","commenter_b":"Sluts should be treated like people. So that's fine if you treat a slut 'like a slut' as long as you consider them people and treat them accordingly","commenter_a":"I don't understand the negative stigma behind girls being sluts. God Damnit, Men love sluts.","post_message":"Regardless of what a person wears, they are worthy of your respect."},{"comment_id":"477818462421667","commenter_b":"Good for him, we support him 100%. If the Muslims can burn our Flag we can burn theirs.","commenter_a":"Burn it!!! And send it back to hell where it came from.","post_message":"VIDEO: College Students Burn ISIS Flag And Muslims Are Outraged. SHARE to support these students are taking a stand against those ISIS pigs!"},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"10152647999850950","commenter_b":"stupid, stupid girls. can't they read?","commenter_a":"The war on terror is taking our freedoms. The Terrorists are easily winning.","post_message":"A former chief of counterterrorism at the FBI told CBS News that he thinks some young Muslim girls are being lured toward jihad as a way of giving meaning to their lives: 'They are looking for adventure.'"},{"comment_id":"10153537278823984","commenter_b":"Women in that cult are beaten and stoned and daughters married off at nine. Honor this way of life????","commenter_a":"Emperor PINOCCHIO is trying to make his MUSLIM brothers happy!","post_message":"News of this has been met with sharp criticism by many.   Do you believe the military is enforcing policies hypocritically?"},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"'Your voting history is public record.'"},{"comment_id":"10154310886941178","commenter_b":"Spanish came from Spain which invaded south and north america long,long ago.So yes,spanish speakers invaded,killed and stole land long before white people.Feel better now?","commenter_a":"All you Mexican flag holders need to go back to the country you remain loyal to. Only legal Mexican are loyal to the USA. We welcome the ones that come in legally to assimilate and make America their country.","post_message":"The LA Times gets political over the Trump protests.  Here's their biggest concern..."}]
