[{"comment_id":"10152669035866135","commenter_b":"Me too","commenter_a":"Me too, worst sound i have heard from my phone! I try to read the alert and they want me to answer a survey! Are you freaking kidding me?!?","post_message":"UPDATE: Police have now released a picture of missing 6-year-old Hailey Betts.  READ MORE: @webpagelink  Have you seen her? Please call police right away if you have any information."},{"comment_id":"10154105863319087","commenter_b":"Anyone who has an education voted for Bernie, because they know that Hillary is a liar and a right-leaning moderate. #BernieOrBust","commenter_a":"Clinton also leads with people who have educations. Gee, go figure","post_message":"Donald Trump may be rich, but the rich actually prefer Hillary Clinton."},{"comment_id":"1250005395092512","commenter_b":"Damn, please fire her & throw her in jail.","commenter_a":"Ugh...","post_message":"Just another day in America."},{"comment_id":"1283029891737480","commenter_b":"It is so embarassing to see some women with such low IQ and/or low self-esteem.","commenter_a":"TRUMP for PRESIDENT...GO TRUMP","post_message":"The crowd cheered."},{"comment_id":"10155379093015354","commenter_b":"This is why we need to deport these criminals. The illegal aliens are all criminals. They broke the law and came into our country uninvited. Deport them.","commenter_a":"obozo lied and innocent people died. Any questions? Criminal aliens are WMDs. How many must die before obozo and his minions are held accountable?","post_message":"This story has it all."},{"comment_id":"930066893697318","commenter_b":"Screw Jeb Bush, just because he married a foreigner doesn't make it right for our borders to be infiltrated by illegals looking to live off of our hard earned dollars that we worked for all our lives. Vote for Donald Trump for President and he will end this and make our country strong and proud again.","commenter_a":"He needs to get in bed with the Democrats!! He's not a Republican","post_message":"\"Trump is wrong on this.”"},{"comment_id":"10154017627642217","commenter_b":"that would be too easy haha","commenter_a":"@username @username We all know his motives","post_message":"The Saudi teen who could face years in jail for striking up a friendship with an American girl over the internet. (via BBC Trending)"}]
