[{"comment_id":"10152817676244877","commenter_b":"Wonderful woman","commenter_a":"RIP Queen of Gospel Music.","post_message":"ON THIS DAY IN HISTORY: On January 27 1972, The Queen of Gospel, Mahalia Jackson passed away at age 60. She became one of the most influential gospel singers in the world and was heralded internationally as a singer and civil rights activist. LIKE and SHARE to remember the Queen of Gospel!! >>@webpagelink"},{"comment_id":"10154178082379726","commenter_b":"Yea and less than that are for your boy Cruz, and even less than that (way less) for Kasich. What is your point. Look who got 60% of the third largest state (NY) and watch where he is in the primary's tonight.","commenter_a":"For me, I hope Trump supporters realize he is only getting about 37-39 % of Republican votes on the average. I'm not talking about the one national poll that has him at 50%, I'm talking about the current raw, known facts, of these primaries. Nearly 2/3 of Republican voters want other than Trump.","post_message":"It's begun — even his fiercest critics are resigned to Trump's likely nomination."},{"comment_id":"10154344335198181","commenter_b":"And the public has every right to show their displeasure by not supporting a corrupt regime...","commenter_a":"He's stupid","post_message":"The White House Press Secretary Sean Spicer on Pres. Donald J. Trump's tweet criticizing Nordstrom after decision to no longer carry Ivanka Trump's clothing brand: \"This was less about his family's business than an attack on his daughter.\" @webpagelink"},{"comment_id":"917358028382410","commenter_b":"off with her head!","commenter_a":"Behead here to.","post_message":" ordered me to kill child"},{"comment_id":"1109027105857009","commenter_b":"As the meme says, \"If you don't have a vagina and womb, keep out of mine!\"","commenter_a":"I support Bernie. Because I can't stand either Hillary or Trump. And because he wants Single Payer health care. But the Democrats are insane to support abortion rights. We will ALL be held accountable before God for the murder of our children.","post_message":"We're PROUD to be Democrats. Are YOU?"},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."},{"comment_id":"10152856224956051","commenter_b":"Ban them from the USA!!!!!","commenter_a":"These f***ing traitors need to have their asses strung up on the flag pole !!! Wtf is happening to our country!! What a bunch of sorry worthless stupid f***ing liberals!!.. S*** is fixin to hit the fan!.. Do they actually think we're just going to sit back n let them continue their disrespect??","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."}]
