[{"comment_id":"1279380305469095","commenter_b":"Obama said there are 53 states. Everyone makes mistakes. Calm down","commenter_a":"Deployables go vote on the 28","post_message":"LOL! Donald J. Trump just told supporters to go vote 20 days after the election is over.  Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1789908131147685","commenter_b":"' You won't divide by zero on my plane, you little bastard '","commenter_a":"What a typical story of people being scared of things they don't understand.","post_message":"He was interrogated for two hours."},{"comment_id":"10155984952470354","commenter_b":"Hanging around With To Many Illegale,s Will Do It !!!Dry Up His Brain !!!!!!!!","commenter_a":"Jerry brown is a twit. He's spent his life in CA and knows huge fires are part and parcel with living in CA.","post_message":"Two words: Moon. Beam."},{"comment_id":"1023375851016759","commenter_b":"You're wasting every body else's.","commenter_a":"67 out of the HOW MANY THOUSANDS of people that visit daily? Get your shit straight IFLS. scaring people for no reason. Pathetic.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10157671091150294","commenter_b":"Hush.","commenter_a":"Megan Crucis","post_message":"The person she contacted was using a clown photo as a profile picture -- as well as an alias."},{"comment_id":"10152961909207894","commenter_b":"Jessica Denise u got the good job, penis all day like that? Well dammmmm","commenter_a":"It was a little 🍆🍆🍆🍆🍆 but I seen it.","post_message":"Woah! LeBron James Accidentally Flashes His Penis on Live Television [Video]"},{"comment_id":"10153306961394087","commenter_b":"Build that big beautiful wall!","commenter_a":"The Trump Haters are the biggest whiners and cry babies in America ! Say all you want ,Hate all you want !.. But you cannot stop the train from heading to the White House !.Donald J. Trump for President 2016 !","post_message":"'I don't know if that's because she is incompetent, or she doesn't like me or maybe she's given instructions from up above,' Donald J. Trump said about CNN reporter Sara Murray after accusing her of purposely not recording the large crowds outside Trump's book signing event in New York."}]
