[{"comment_id":"1225058540866079","commenter_b":"Got to Hell Nancy Pelosi! You are lost.","commenter_a":"Brain damaged fool! You're a disgrace!","post_message":"The American people should know: central to the Ryan budget is voucherizing Medicare and cutting Medicaid. Seniors have a lot to lose."},{"comment_id":"565051436999865","commenter_b":"Why don't these idiots get deported already? They come here illegally so they are criminals!","commenter_a":"Just bag em and ship back to Mexico","post_message":"Police in riot gear faced off against a violent crowd of protesters outside a Donald J. Trump campaign event in Albuquerque. @webpagelink"},{"comment_id":"10153054360324411","commenter_b":"your wicked..i no longer have remorse for your kind....it is a tare...to be pulled up by the roots to be shoveled in a lake of ever lasting fire........you can't raise yourselfs up above nothing but killing......it is of old......you want this earth to yourselves.......its not going to happen...like sands in the hour glass ...........your time is short...","commenter_a":"brain washed .........or is it ..in their seed ?","post_message":"URGENT: Pakistani police use tear gas against anti-#CharlieHebdo protesters near French consulate in Karachi"},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"10152933391727061","commenter_b":"Someone call this woman a waaaaambulance!","commenter_a":"pumping is nosey - and a private matter......Maybe the airlines should have a private area for moms to nurse and pump.. My daughter travels and breast feeds and she has never pumped on the plane. She pumps before she leaves. BUT maybe it reallyl is time for the airlines to make areas for feeding and pumping.","post_message":"Mother claims male flight attendant relegated her to lavatory after denying request to pump breast milk in back of plane: @webpagelink"},{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"10153805458826337","commenter_b":"Is that chick is his girl?","commenter_a":"Vanessa Delgado where was this ride when we went damn man that looks cool","post_message":"Watch DeStorm Power escape Call of Duty's Black Ops 3 Shadows Of Evil Ride at Six Flags!"}]
