[{"comment_id":"10156523926480354","commenter_b":"what idiot would vote for the bitch-","commenter_a":"I knew she was cleaning up crap. It continues to spew from her mouth.","post_message":"The QUEEN Shall NOT Use the Restroom With The PEASANTS!!!"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153992359576037","commenter_b":"Unethical","commenter_a":"Smh... Crazy!!","post_message":"Some fear this could eventually lead to the creation of “designer babies.”"},{"comment_id":"593792507477995","commenter_b":"Leave the girls alone.","commenter_a":"In all fairness now, you'd take Drugs too if you had those two Lying Muslim Idiots for parents! LOL","post_message":"The White House is in uproar after Obama daughters caught doing THIS.  This is outlandish. These are the daughters of our president.  Would you vote to kick the Obamas out of the White House?"},{"comment_id":"1518093821534153","commenter_b":"Cindi Marcum then why do you ppl think that muslims have the right to travel to the u.s. and and park their lazy asses here, mooch off of us and kill at will while trying to enforce their barbaric ways of life on us....hmmmm?","commenter_a":"So if it's in the rights of the protesters to block a road where does my rights to travel freely fit into that agenda so I can say get to work , seek medical attention or buy food , ect","post_message":"Wow! Talk about fear mongering!?"},{"comment_id":"10153778472068984","commenter_b":"She doesn't owe anyone anything, much less a fucking apology lol","commenter_a":"Carly, how can someone so well versed on most subjects, be so uninformed on Muslims? Even Muslims know Islam is not a religion but an ideology of submission only. Therefore you owe Ben Carson an apology for being correct when he said they are not covered under OUR constitution. READ the Quran for yourself Carly and you will find out that you are an Infidel and are to be killed if you do not SUBMIT to Allah. Does that sound like someone our constitution would support? I think NOT!","post_message":"Carly Fiorina just revealed what she thinks about Ben Carson's comments about a Muslim serving as President of the United States - and you might be surprised with where she stands...  Do you think Fiorina is showing her true colors?"},{"comment_id":"10153850185846770","commenter_b":"Women talk about men in all women groups too.... no one ever talks about that but women can get raunchy too....","commenter_a":"So guys can't be guys and talk in private? I bet 100% of the people whom have a problem with this are guilty of doing the same thing in some fashion in there own lives but let's make a big deal about ABSOLUTELY NOTHING","post_message":"Her name is..."}]
