[{"comment_id":"10154558437983645","commenter_b":"Oh Gabrielle you maam are the main reason racism still exist!","commenter_a":"Had to be white. He should of been charge with murder","post_message":"Dennis Meers faces 11 months in prison if he fails his probation. His granddaughter Cadence Orcutt died in a November 2015 rollover crash where she was behind the wheel."},{"comment_id":"10153118547732377","commenter_b":"Wake up folks, don't be divided , be united....Carson for president, at least he's a God fearing man...A child of the most high God","commenter_a":"And Your Point Is???","post_message":"Ben Carson's faith as a Seventh Day Adventist came under fire at a Donald Trump rally on Saturday."},{"comment_id":"572796029562276","commenter_b":"If Bernie runs as an independent Hillary is ******","commenter_a":"So much investigations can't you win any states without ppl saying you cheated must suck getting caught.... #stillsanders #hillarigged #tonedownforwhat #whichhillary","post_message":"It isn't enough to just say we support equal pay for women. We have to do everything we can to make it a reality."},{"comment_id":"902571806432266","commenter_b":"THEY will be one of the 72 virgins.","commenter_a":"Its not 72 virgins they will get , its 1 -72 year old virgin, they are crazy","post_message":"You can't even imagine what is happening to thousands of children as young as 5 years old..."},{"comment_id":"10154203393907994","commenter_b":"Cut their dicks off.!!","commenter_a":"Wow","post_message":"THIS JUST IN: Police have released a picture of the second man wanted in the abduction and rape of a woman from a Walgreen's parking lot. Police say the two drove around and took turns raping her. More info:"},{"comment_id":"10153369802901037","commenter_b":"Tara! Mag-uber lang tayo! ;)","commenter_a":"@username gala na tayo! :)","post_message":"Thousands of Mexico City taxi drivers protest Uber, then Uber fires back."},{"comment_id":"1136375496397870","commenter_b":"SHE IS A DEMON POSSESSED WOMAN.","commenter_a":"Yes put Her in Prisone for life. For all the life's she took. Hillary Clinton we know what your up to and trust me God has not forgotten about you either.","post_message":""}]
