[{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"1160665140611621","commenter_b":"Men, have no business making any rules or laws that apply to women....PERIOD !","commenter_a":"Who elects these illiterate morons? New Hampshire, step up your game.","post_message":"These male legislators may not be grown-up enough to talk about women's bodies."},{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"10153913161040329","commenter_b":"\"Suck you dry and take you out for lunch\" she's a country lass, it is obvious: barley, then gooseberries.","commenter_a":"I couldn't actually finish reading it because it made me feel physically sick. Subhuman intellect isn't something to broadcast proudly, you misogynistic douchebags.","post_message":"\"It's people like you who make it clear women should never have been given rights.\""},{"comment_id":"1033520256666198","commenter_b":"It would be that woman riding in on a broom!","commenter_a":"what governor","post_message":""}]
