[{"comment_id":"1086256118053035","commenter_b":"So we leave our selves defenseless so that some kid can study underwater fire fighting?","commenter_a":"Spending more money that we don't have, Thank You, so very much!","post_message":"The Perkins Loan Program can be a critical lifeline for many low-income students. I’ve joined 53 of my colleagues, including Senator Robert P. Casey, Jr., in calling for its reauthorization. Learn more below."},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."},{"comment_id":"10153420150224087","commenter_b":"jeanne ruzzin: Ivana is a big woman and anyone who tried to push her around would surely regret it.","commenter_a":"Donald Trump, serial adulterer. Brutally assaulted Ivana and paid her off. Talks constantly about wanting to bang his daughter. Meanwhile, Hillary has been a faithful spouse, who had every right to choose whatever she wanted in the wake of her husband's cheating. Figures The Donald would stoop to #VictimBlaming.","post_message":"“If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong!” Donald J. Trump tweeted."},{"comment_id":"587546098014187","commenter_b":"It's ok, SHE has 24/7 armed guards, surrounding her...we just need to suck it up","commenter_a":"diane can have my gun, I will put it right where her head is at :))","post_message":"Diane Feinstein admits their are probably sleeper cells in America. So why does she want to take away your guns?"},{"comment_id":"994387677320953","commenter_b":"That witch is who is teaching our children","commenter_a":"This man is on point👍🏾","post_message":"Woah, THAT escalated quickly! What's YOUR opinion?"},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."}]
