[{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."},{"comment_id":"10155410892145500","commenter_b":"Arthur, your mother should have swallowed you.","commenter_a":"Once again. ..guns being used against the family...even if its unintentional. ...there are way too many unnecessary guns out there. ...","post_message":"BREAKING TONIGHT: A 9-year-old boy has accidentally shot his 54-year-old grandfather in the woods in Dade City. Story: bit.ly/1GIYKqL"},{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"10155959716910725","commenter_b":"One last word....Yes AMERICA is gonna start showing her TRUE COLORS AGAIN!! Prepare!!","commenter_a":"For the first time in many MANY YEARS, my wife and I think we may very well take our country back!! GO TRUMP!!!","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"746525202204724","commenter_b":"how stupid is she in the first place.","commenter_a":"Yes","post_message":"Clinton's Panic After Mistress Does THIS In Public [VIDEO] They never ever wanted this to happen. Do you think Hillary will lose?"},{"comment_id":"10153837797534199","commenter_b":"Disgusting trophy hunter. I despise nasty people like her.","commenter_a":"in the meantime, how many people serving our country passed away today? Besides...should we their be backlash agianst people who hang their \"kills\" on their walls? People have always been thrilled about their kill...you can't change human nature.","post_message":"The backlash started with a tweet: must happened to you in your life to make you want to kill a beautiful animal & then lie next to it smiling?"},{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."}]
