[{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."},{"comment_id":"1016888675050426","commenter_b":"Go Trump!","commenter_a":"God Bless you, Mr Trump, we've needed someone like you for a very long time, someone e who really cares about the a","post_message":"WOW! Thank you, America! LETS GO - it is Super Tuesday -- get out & VOTE TRUMP!"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"499136410296158","commenter_b":"Go back to Mexico you trash","commenter_a":"Very disrespectful! I can say I'm embarrassed, what type of protest is this? I don't agree with Trump but I certainly don't agree with this. That guy in the white shirt with the Mexican flag under his hat is ridiculous. Obviously he does not know how to respond correctly and only starts welling stupid stuff. The only history they are making is to upset people to react upon their actions.","post_message":"Watch This Insane Reckless Trump Protester Nearly Kill People"},{"comment_id":"953884527999046","commenter_b":"SCUM","commenter_a":"Ryan's as bad as the great imposter Obummer....","post_message":"BARACK OBAMA Finds Friend In “Fundamental Transformation Of America”: Shocking Way Ryan Betrayed Americans With $1.1 Trillion Bill Funding for Sanctuary Cities, benefits for illegal aliens, fully funded refugee programs, quadruples number of work visas for foreigners, release of criminal aliens, tax credits for illegal aliens and more..."},{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""}]
