[{"comment_id":"10154728738598352","commenter_b":"No excuse for those stupid people if that was my mom let me tell u poop would hit the fan they would have the biggest law suit and have everyone fired. No excuse for their stupidity bunch of idiots","commenter_a":"Thank God for Islam. We don't put our elders in these places and forget about them, alhamd lellah.","post_message":"Bedridden grandmother, 86, screams for help for three hours after staff at a dialysis clinic forget about her and lock up for the day"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"1837044486583115","commenter_b":"Build the wall already and send her back","commenter_a":"this is funny , only because these two willfully ignorant","post_message":"Leftists Attack - Man Harassed For Wearing #BuildTheWall T-shirt SHARE if you WANT TRUMP To Build the WALL! WARNING: Strong Language!"},{"comment_id":"10153136004245090","commenter_b":"She's an idiot","commenter_a":"She is a liar, sneaky, underhanded, untrustworthy and she needs to answer for Benghazi and the killing of those four innocent men. I hold her and Obama responsible. Would never want someone like this as President.","post_message":"Bottom line: Why don't you want Hillary Clinton to be President? Sound off here: @webpagelink"},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."},{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."}]
