[{"comment_id":"10153671011123132","commenter_b":"Being a hooker.","commenter_a":"Oh pleeeeeeeze, her profession is/was a stripper. She posts lots of photos of her body parts all the time. How do you think she pays her bills?","post_message":"Whoa!"},{"comment_id":"10153218446741051","commenter_b":"she wont care, she has another kid to take her spot. i bet she will continue to see him, and probly get married. sick nasty world!","commenter_a":"That is one sick family hope that mother feels real good abouit that sex, it cost her daughter and grandchild[s life.","post_message":"A pregnant lady walked in on her husband with another woman. When she realized who the woman was, she killed herself."},{"comment_id":"1644362728922565","commenter_b":"But haven't you heard....those votes are all from dead illegals","commenter_a":"Electoral College must do the right thing and prevent Trump becoming president. Now 2.5 million more people voted for Clinton than Trump!","post_message":"Were you wondering why Trump talked to Taiwanese President?"},{"comment_id":"1335655576501194","commenter_b":"Omg this little girl does need someone to beat her ass. Khloe can do it lol","commenter_a":"This lil girl is trash shame on her people need to stop giving her 5 minutes of fame","post_message":"She's calling out Kylie Jenner!  #WSHH #CatchMeOutside #KylieJenner"},{"comment_id":"10153663594614160","commenter_b":"You've Been Blamed because you brought us down to our Knees but we'll fix it all under Trump and wipe away ALL traces of your rotten deeds against our Beloved America--now go kiss some more Muslim butt and bring in more Illegals you only have 7months left ---","commenter_a":"Of course he is trying to deflect blame.","post_message":"\"I have been blamed by Republicans for a lot of things\""},{"comment_id":"887276944740413","commenter_b":"@username, I agree with you're sentiment. However, that's just what they want so they can finish sweeping this crime under the rug and most likely murder you while you were in jail. Count on Yashua Yahwashi to help you win this battle. I came not to bring peace but a sword.","commenter_a":"This is such a travesty. These judges are complicit in the cover-up. I remember when that girl Natalie Holloway was murdered on vacation. That case went on and on until they put that guy Ian Vandersloot (sp?) in prison. White parents rarely have the burden of proof put upon them. They should start a GoFundMe page.","post_message":"Parents of Kendrick Johnson (Teen Found Rolled Up in Mat at H.S Gym) Ordered to Pay Hefty Legal Fees"},{"comment_id":"778536202281765","commenter_b":"Lynette Houdek You really need to take a class in comprehension. Trump said he would renegotiate the trade deals so America gets a fair deal. You speak of the Colorado fiasco. What is crooked about it is that they locked the Trump delegates out and removed their names from the ballot. That is called rigging the election. Please take the class I suggested.","commenter_a":"Krauthammer, you think Cruz could handle China. Trump has done business with the Chinese. He know's what he is doing. The business in Colorado is a disgrace. Trump delegates were turned away and their names scratched off the ballot. Does that make you proud of our \"Banana Republic\"???","post_message":"Is Krauthammer right?  WATCH:"}]
