[{"comment_id":"10153064195022377","commenter_b":"This lady is destined to be behind bars. Narcissus is her mode of operation and her eye shadow displays deceit.","commenter_a":"As I always Say, Can't Fix Stupid. SHE IS.","post_message":"Newsmax shares the 10 most crucial moments from the Planned Parenthood hearing."},{"comment_id":"606606769472505","commenter_b":"Karma's a bitch!","commenter_a":"not that I don't think this would be a good thing, but what's shown isn't likely. Unless this particular suicide bomber killed himself without using the bomb he was wearing, that bomb has been used. somebody would have had to put the scraps of his body into a new wearable bomb for this to happen... without anyone noticing.","post_message":"Video: This funeral for a suicide bomber is about to take a MAJOR unexpected turn for these terrorists. Karma?"},{"comment_id":"10152735674121051","commenter_b":"This is a shame so many good women cant have kids but trash like this has them!","commenter_a":"ALABAMA...what else is there to say..........","post_message":"One look at this baby’s blood test and officials immediately ordered that the mom be arrested."},{"comment_id":"502126469966479","commenter_b":"Who knows who's here already? #WomenForTrump. Vote. #TRUMPFORPRESIDENT","commenter_a":"Is it just a few Americans that realize obummer n his administration are all Muslims, tied to CAIR, we could go on on on..72 in terrorist watch working for homeland security n DHs","post_message":""},{"comment_id":"10155746665275968","commenter_b":"@username so....that leaves people working and travelling abroad virtually unprotected.","commenter_a":"Those were the people in charge of the safety of all ambassadors. Wouldn't that constitute treason or gross negligence on the Trump cabinet that they don't have people in place in transition?","post_message":"😠 😨 😬"},{"comment_id":"10156761367765354","commenter_b":"quit giving her the time of day!!!","commenter_a":"Who knew behind the mask was a racist cop hating jerk, I heard Kanye needs some $$$$ since you gave the black panthers so much why don't you give $$$$$ to another cop hating jerk so he can lavish Kim.","post_message":""},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."}]
