[{"comment_id":"1170305866326090","commenter_b":"'@username you are the number one reason for birth control!","commenter_a":"I'm so glad they had a chance to speak about their loss. Some people don't care that lives were lost because they want to be so against a movement they can't possibly understand.","post_message":"These mothers who've lost their black children to police brutality and gun violence had a powerful moment at the DNC."},{"comment_id":"10154326005239657","commenter_b":"Just heard this morning, accordeing to an article in the NYT, that Hillary's unprotected server had an email disclosing the locaation of Ambassader Stevens on 9/11/2012. It was also disclosed that our allies knew her email was not secure, so we can only speculate our enemies knew as well. If all of this is true, this woman should be shuned by the American people.","commenter_a":"Lollllllll. True","post_message":"A look back at the week's most memorable, powerful, and funny political cartoons.  #5 might be one of the best we've seen all year!"},{"comment_id":"1136953183031095","commenter_b":"I can guarentee she will have a fitness dvd out soon, watch this space. All these reality stars have horrible pics taken of them on the beach then get fit n do dvdds xx","commenter_a":"A well cut swimsuit would be far more flattering, although not much one can do with cellulite - ugh.","post_message":"The Only Way is Essex star soaking up those wintry rays ☀"},{"comment_id":"10154087182591409","commenter_b":"'@username Michelle had to keep her legs closed or her dick would fall out!","commenter_a":"Lisa erikson just because Hillary hasn't been charged and found guilty doesn't mean she's not. She's a liar and as crooked as Obama and Michelle on many levels. Keep lying to yourself.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153167814539203","commenter_b":"typical, bend over asshole, and I'll shove a hammer up your ass. 😊","commenter_a":"leave it to a man, to be an ass.","post_message":"Will Smith on After Earth PTSD: 'After the failure of 'After Earth,' a thing got broken in my mind...'"},{"comment_id":"10156168064325594","commenter_b":"Asians women are Crazy hands down!","commenter_a":"Well this certainly doesn't fit the regular narrative.","post_message":"The tearful and frantic 911 call was clear: “We got into a fight. I stabbed him. He’s bleeding.”"},{"comment_id":"10154833870921336","commenter_b":"The pussy you are referring to is a family who call themselves Lisa, nice safety pin by the way, do they make them in mens?","commenter_a":"If Trump states that 'Nothing will Change', then he should stop being such a pussy and stop belly-aching about the recount. He's a complete WIMP.","post_message":"Reince Priebus slammed Dr. Jill Stein's presidential election recount effort, which was recently joined by Hillary Clinton's campaign."}]
