[{"comment_id":"10153395170866162","commenter_b":"Alien had azz. Kmsl. Female leaves there kids with anyone for bad love..","commenter_a":"Shaun Sullivan look at this guys head. wtf","post_message":"DISTURBING: A 19-year-old man is charged with the murder of 2-year-old girl whom he was babysitting @webpagelink For the stories you care about -\" like\" ABC 7 Chicago!"},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"10154913988378701","commenter_b":"I would ban that woman from the store.","commenter_a":"What a fucken cunt!!!","post_message":"\"One of their female employees Jessie? Jennifer? J something is disgustingly obese, and each time we come in, although she does her job and is very polite, instantly makes my appetite disappear,\" the customer's Yelp review read in part."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10153559970697093","commenter_b":"@username you shut up.","commenter_a":"See how good it feels to see good black hard working men...and the children have no hate for them big black men see hatred is taught we are not born with it. Love this interaction this should be a wake up call to any one steriotyping.","post_message":"Apparently they get this excited every pickup day... they're now good friend with the garbage men... @webpagelink"},{"comment_id":"10152880805672377","commenter_b":"Worried ???? then I suggest she better get her BUTT in gear and start letting us know what HER AGENDA is !!!!!","commenter_a":"Go Betnie, GO. We need candidates that are not corrupt and money grabbers without all of the baggage the Queen carries. Someone who has the interest if the country in mind not self- aggrandisement.","post_message":"Hillary Clinton's campaign is \"worried about\" the challenge being posed by Sen. Bernie Sanders, whose popularity and poll numbers are continuing to grow."},{"comment_id":"696122653842743","commenter_b":"They will catch these 2 cowards soon. Police Force do maximum.","commenter_a":"Going Back to origin country, muslim are not belong to europe, they are many coming politecal, assylum in germany, they should send bact to origen country , there muslim,","post_message":"Report: Two armed suspects in Paris shooting located in northern France"}]
