[{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"},{"comment_id":"10153422236844877","commenter_b":"Darn shes not even hot. Nappy headed hoe.","commenter_a":"What's crazy is people talking about her knowing she has special needs.","post_message":"Miami woman arrested for dancing naked at Johnny Rockets - in the middle of the afternoon! Find out why her father says she did it. Grio fam, what are your thoughts on his defense?"},{"comment_id":"596495133817002","commenter_b":"Please put this bitch in, just for the sake of good comedy.","commenter_a":"And Dems here's 8 more years. Repubs are screwed if we put these people up.","post_message":"This is easily the most hated person by liberals. They will begin freaking out in 3... 2... 1..."},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."},{"comment_id":"1216674918389035","commenter_b":"Vote Hillary","commenter_a":"Vote Hillary","post_message":"“En mis primeros 100 días, voy a introducir legislación para una reforma migratoria integral con camino a la ciudadanía. Esto no solo es lo correcto sino que cada análisis independiente ha demostrado que añadiría cientos de miles de millones de dólares a nuestra economía. Mantendría también a las familias juntas. Tenemos que sacar a las personas trabajadoras fuera de las sombras. Estados Unidos siempre ha sido un lugar donde personas de alrededor del mundo trabajan duro y aplican sus talentos al crecimiento e innovación del país en la búsqueda de sus sueños. Así que haremos todo lo posible para lograrlo” —Hillary."}]
