[{"comment_id":"10153715209333984","commenter_b":"Build a wall and send them home.","commenter_a":"You know illegal Mexicans come in this country illegally the women wait till about a month before delivering their child snake in this country have their child hoping to get birth rights I think if you come in this country out of another country if you have a child here your child is from your country not mine god bless the United States and we're going to try to keep it that way","post_message":"These Texas counties are doing something that has earned them a warning from Mexico, but it doesn't look like they're letting that stop them!  Do you support what these counties are doing?"},{"comment_id":"1769168636661696","commenter_b":"Love her(homegirls)we going to build the wall and who's going to pay for it?????","commenter_a":"Sounds like home girl need to read up on her history! California is was part Mexico territory!!! And native European Californian, she just rambling!!","post_message":"\"Will you go out and pick the strawberries?\"  Donald Trump protesters clashed with his supporters at his San Jose rally yesterday to make a point about an issue close to their heart: illegal immigration.  @webpagelink"},{"comment_id":"10156567119170725","commenter_b":"U R A NUTJOB AND A #FRUITCAKEFORILLEGALCRUZ ! #MAKEAMERICAGREATAGAIN #DONALDJTRUMP 2016 #ONLYAMORETRUMPNATIONCANSURVIVE!","commenter_a":"The sycophant behavior of many Trump supporters is identical to Obama Libtards, complete with vile hatred of anyone who disagrees and scummy ethics based on Utopian promises. I am starting to think maybe Americans do need to surrender their liberty and let the government take care of them like little retarded babies. Iowa better prove me wrong","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"1012141178845630","commenter_b":"She owes no one a child. Her womb is her business.","commenter_a":"maybe she used off gone on injection or pill or something instead off using nothing knowing there could be a small chance she could fall pregnant also there are alot of good people in this world who cant have kids she should off kept baby them given baby up to a loving family instead off killing a innocent life","post_message":"Woman uses IVF to conceive three kids - then has abortion for a natural pregnancy"},{"comment_id":"10153888604683812","commenter_b":"Bye dumbass. Take the illegals with you, of ALL nationalities","commenter_a":"I respect our president and all past Presidents. I will respect all future Presidents. ( unless Donald Trump is elected, I will move to MEXICO AND HELP BUILD THE WALL!!!!!!)","post_message":"President Obama has joined Facebook! Here's what the President wrote in his very first post: @webpagelink"},{"comment_id":"10153230871447708","commenter_b":"It's a good talk but you shouldn't make promises u can't keep. But you still have my vote","commenter_a":"Until AFTER election.....Read my lips...All the same","post_message":"I will oppose and veto ANY and ALL efforts to increase taxes. Join me in standing up for American taxpayers.  Click here now!"},{"comment_id":"1200289290023832","commenter_b":"It just needs to be remembered do this with no violence unless it is used on them and if the illegal aliens respond with violence deal with them direct and swiftly. No questions just stomp them and dump them back across the border.","commenter_a":"She just deserve a raspberry. It is the to be said to her. Our immigration system needs work but she is really talking about letting illegal aliens in. The term illegal means we have acknowledged that they have committed a non-legal act, thus becoming a criminal. That means do not pass Go do not collect 200 dollars. They are already being coddled at our expense. If, they are caught they should be taken direct to be fingerprinted and photographed, then directly to a border. If, they are identified as having done it before. We should setup a location far away to ship them to. This non-American needs to mind her own business, instead of trying to shovel her troubles on to us.","post_message":"Oh really?"}]
