[{"comment_id":"10153598659872434","commenter_b":"@username you females don't have any sense in your head that oppose this kind of thing.","commenter_a":"It is not any feminism I know that tells a person what they can and can't wear. Beach or not. France should stop blaming their bigotry on feminism.","post_message":"French officials have cited everything from hygiene to feminism in order to ban the swimsuit"},{"comment_id":"10153148300259575","commenter_b":"You certainly are. \"Judge and be judged\" Crystal. I PROMISE you God is watching your actions as much as he's watching mine. Typing \" under a homosexuals death does not, in fact, secure your ticket to heaven babes.","commenter_a":"Let's see if she can have god change his mind","post_message":"A terminally ill woman whose desire to have her same-sex marriage recognized by Indiana before she died helped galvanize efforts to overturn the state’s gay marriage ban has lost her battle with cancer.  Niki Quasney died Thursday, gay rights advocacy group Lambda Legal said Sunday. She was 38."},{"comment_id":"484307825084431","commenter_b":"Funny women are one of the fastest growing group of gun owners .She loses all credibility when she mentions dicks ....so pitiful and uninformed ...","commenter_a":"300 million guns in this country - not enough?","post_message":"How about not...."},{"comment_id":"10155361770815354","commenter_b":"Yea an so is this bitch!!","commenter_a":"she sounds like nixon i am not a crook","post_message":"Hillary & Bill Clinton are simply without shame..."},{"comment_id":"488243741366206","commenter_b":"Hell no don't mess with our children!!!","commenter_a":"I thinks it's wrong for Muslims to even to be on our soil!!!!!!","post_message":"American students are being forced to dress like Muslims.  This is absolutely unacceptable, we need to spread this and show Muslims we are not going to stand for this.  Do you think it's wrong for Muslims to force their beliefs on our children?"},{"comment_id":"10153272764696045","commenter_b":"Steals from children and drives drunk to possibly kill someone. She needs to be in jail.","commenter_a":"Mandatory Rehab and therapy","post_message":"Amy McArthur Balch is currently being held in Morgan County Jail with no bail."},{"comment_id":"501575200039916","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Yes","post_message":"Question of the Day: Should the media be giving Tim Kaine's past comments about President Bill Clinton more attention? Share your thoughts below."}]
