[{"comment_id":"10153320376007042","commenter_b":"All five females was arrested","commenter_a":"That poor girl. I hope the person who attacked her gets arrested.","post_message":"A 17-year-old girl viciously attacked inside a Brooklyn McDonald's is speaking out about the brutal assault for the first time. @webpagelink"},{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"1771925833072094","commenter_b":"Well, WE the people are voicing concern about muslim people who leave in US for free and hate us; WE the people.!","commenter_a":"assimilate and don't threaten to kill us or kill us. Or rape us. You're in America. Become American. Eezy peezy.","post_message":"Muslims are voicing concern on social media about a Trump presidency. @webpagelink"},{"comment_id":"939835422761174","commenter_b":"Damn...you are still at it? Get off the computer and go talk to the young men whose lives were destroyed. Go peer at those missing eyes. Go stand near the them who lost legs. Listen to the stories of the PTSD stricken. Then come speak this hunger for war. I took an oath to support and defend this constitution. I have great pride when I see little American children stumble to daycare with their backpacks on. I also know, the threat to us doesn't lie in a desert. No donkeys can cross the ocean alive. It's in the profiteers. Those folk who rattle dangers but are too old to pick up arms. Defending our country has been my lifelong business, but I won't say it's been without questioning where the profit is going! Re-read Sodom and Gomorrah. It wasn't about being gay...it was about PRIDE and INHOSPITALITY both of which ...","commenter_a":"You all should do a little research on Trump, did you know that when his father died Trump stole his brother's inheritance and did not get anything to his brothers kids either. He is a greedy bastard. The pathetic part of all of this is that this ignorant population who is supporting him right now think that he is going to do more for them. He doesn't give a rats ass about any of them at all whatsoever. He would structure tax laws and policies that would for their benefit him once he left the White House if he ever made it to presidency. And all those morons who voted for him would sit there with their asses handed to them.","post_message":"LOL! Somewhere, Pres. Obama is rolling on the floor with laughter! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155439911848797","commenter_b":"Poor Natalie. I almost feel sorry for her. Must suck being a triggered, fragile little snowflake.","commenter_a":"They should scalp the scumbag and hang his head at the entrance of the protesters so everyone knows what's going to happen to you if you try to harm people in a peaceful demonstration","post_message":"Instead of going around the crowd, the driver went right into it."},{"comment_id":"1796249287363379","commenter_b":"Khloe would put this midget bitch on blast.","commenter_a":"So what","post_message":"She really don't like the Kardashians. #WSHH"},{"comment_id":"10153374154140329","commenter_b":"Karmas a bitch if you're an asshole","commenter_a":"People do spit in the food. I did it myself at McD's way the hell back when. Only when someone I really hated from school came through the line though. Nice big hock in their drink. Mmm...good times.","post_message":"\"We have all tried, and failed, to make a burger that looks like they do in the ad.\""}]
