[{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10156470803785354","commenter_b":"They KISS ASS better then the others!!!","commenter_a":"There are thousands of kids bullied every day but Muslims are going to have our government defending them. That is so wrong. Why are they more important than the rest of the kids in our country. B.S.","post_message":"And check out Rush's epic take on this..."},{"comment_id":"729509567174081","commenter_b":"Oh shit here comes Ronda, there going to kick our ass for sure now she here. Lol","commenter_a":"Better hope she doesn't bring her losses with her","post_message":"The UFC fighter made a trip to North Dakota and donated fruits, vegetables, bread, tents and wood-burning stoves to “water protectors” who are protesting the Dakota Access Pipeline."},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10153315866223812","commenter_b":"Still none of this warrants being shot in the back...","commenter_a":"The officer has the suspects identification so was a foot chase even warranted since his address is on the ID...this man could have been picked up at anytime...seems like the officer used extremely poor judgement.....","post_message":"WATCH: Newly released dash cam audio and video shows Ofc. Michael Slager and Walter Scott before fatal shooting: @webpagelink"},{"comment_id":"10153151656451336","commenter_b":"Prayers for our Country. This woman is a tyrant!","commenter_a":"The last person on earth we need as president.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"10153933492904411","commenter_b":"lol it makes no fucking difference you whiny bitch","commenter_a":"Miss Universe pageant is all politics.... the Elites crown whichever country they wanna make use of. In this case, the Phillippines in the South China Sea issue. Whereas Colombia is drawing closer to China this year, this is just humiliating Colombia in public.","post_message":"Oops: Steve Harvey crowns wrong #MissUniverse2015"}]
