[{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"10153091738774071","commenter_b":"Tesla already solidified its royalty by breaking the consumer report ranking system 😜","commenter_a":"\"While Porsche's Concept Mission E is just a concept now, Porsche said that it aims to begin production in the next five years.\" The cheaper Tesla will be out by then and Tesla Motors will solidify it's spot as the king of e.v's.","post_message":"The future of Porsche? (via Tech Insider)."},{"comment_id":"10153185123243984","commenter_b":"For all the rhetoric and obfuscation, will Gowdy, or anyone else, really have the stones to put this bitch in jail? Lord knows she and many others in this government belong there!","commenter_a":"Please... don't tease me.","post_message":"Trey Gowdy just hit Hillary Clinton with an attack that could end her presidential ambitions... Do you have Trey Gowdy's back?"},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."},{"comment_id":"10154099164360329","commenter_b":"DREAM HUBS","commenter_a":"@username your future hubby","post_message":"He never even read the books, but he researched them and made all the magical decorations himself. Read more: @webpagelink"}]
