[{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"10153859214957169","commenter_b":"Should Donald Trump become President,what he has in mind to do,will go over Congress first","commenter_a":"All the blame on the \"current administration\" ignores that both the house and senate are republican...and they control (or obstruct) a major part of what happens in this country. Tho there is some opportunity for a president to make executive orders, it is a limited power. So our votes for our state reps and congress will carry a lot more weight. Just sayin'.","post_message":"Here's a look at some of the Republican presidential candidate's claims and how they compare with the facts (From PBS NewsHour)"},{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"1016888675050426","commenter_b":"Go Trump!","commenter_a":"God Bless you, Mr Trump, we've needed someone like you for a very long time, someone e who really cares about the a","post_message":"WOW! Thank you, America! LETS GO - it is Super Tuesday -- get out & VOTE TRUMP!"},{"comment_id":"10153247625591179","commenter_b":"vi sim. mas fiquei sabendo que legal mesmo é um creeper de pelúcia.","commenter_a":"Fernanda","post_message":"Same."},{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"}]
