[{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"},{"comment_id":"10154176527056770","commenter_b":"Shut up and crawl back in your hole.","commenter_a":"He's a creep for saying that!","post_message":"'Avengers' director Joss Whedon made a lot of outlandish comments on Ivanka Trump and Jared Kushner."},{"comment_id":"10152707849071028","commenter_b":"With their family issues this's couple should not have children.","commenter_a":"\"Seven case workers were assigned to the family\" yet they didn't do a thing!","post_message":"The girl’s nose and part of her cheek were eaten away, while her upper lip was shredded. @webpagelink"},{"comment_id":"10153709556991880","commenter_b":"Mario","commenter_a":"Maggie Urgupluoglu","post_message":"The city's five boroughs are filled with hidden spots."},{"comment_id":"693471650843413","commenter_b":"Yes they should be deported!","commenter_a":"Yes it should!!!","post_message":"Unbelievable fate for this liberal that disrespected our flag. This man will never be the same. Should burning the flag be grounds for deportation?"},{"comment_id":"608701745929674","commenter_b":"@username-I usually stay out of this topic area since it isn't making a huge impact on my life. However, science has shown that when populations of a certain group go up too high, homosexual bonds do come to play. For instance in Africa way back when, sometimes today, if the village had to many mouths to feed, the men would start mounting each other to prevent population growth. In animals, like dogs or cats, you have some that put off the opposite animals pheromones. For instance we use to have 2 female&spayed cats? The one kept dry humping the other.","commenter_a":"Considering most people don't get a sexual attraction until they hit puberty, how would they even know which students are homosexual unless the students are just acting out because of what they've seen their parents do...","post_message":"Pre-K? REALLY?!"},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"}]
