[{"comment_id":"1097322517004941","commenter_b":"#LockHerUp","commenter_a":"Hillary Clinton is a Criminal, who should be in prison, not running for office!","post_message":"\"I think my whole life has been about handling pressure. I think I have a great temperament for winning, 'cause I know how to win.\" Donald J. Trump argued that in comparison, Hillary Clinton is \"a loser\" who \"doesn't know how to win.\""},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."},{"comment_id":"10153316136926438","commenter_b":"... and so what if polygamy is \"legalized\" (lots of states already look the other way anyway) who would it hurt ?","commenter_a":"Yay polygamy.","post_message":"This was his best argument???"},{"comment_id":"10156062936845354","commenter_b":"Thugs","commenter_a":"Im in SA and just yesterday in Point rd Durban, my freind Gregory who is 69 yrs old was attacked by young foreigners with sticks and badlly injured. I am an ex policeman and I am ashamed of this assosiation. Our police are useless, I WILL TELL THEM FACE TO FACE if I have to. Warning to anyone in authority: IF NOTHING IS DONE TO REPATRIATE CRIMINAL FOREIGNERS FROM OUR COUNTRY IMMEDIATLEY. I WIIL CALL ON ALL WHITES TO START FORMING VIGILANTE GANGS. THE BALLS IN YOUR COURT, GET RID OF THE FOREIGNERS AND THE CRIMINAL ELEMENT.","post_message":"The vicious blow to the senior citizen comes around the :11 second mark."},{"comment_id":"10153108961506491","commenter_b":"Who cares ,whatever the case, he's richer than me ...who are we to judge and worry about how much money somebody has in their pockets ? .He has more money than any of us here writing crap on Facebook .","commenter_a":" keep teaching them cause it's obvious, America thinks we come from space!","post_message":"Bill Gates barely holds a candle."},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"}]
