[{"comment_id":"957334017635027","commenter_b":"He actually was not shackled. Its amazing how many people read cop blocks statement and dont even watch video or just flat out imagine what your seeing all because cop block intentionally manipulated you.","commenter_a":"Look, whatever the guy was arrested for, it doesn't make it right for that cop to beat on him. Even with the guy getting in the cops face and yelling. It doesn't make it right. The fucking guy is shackled. Cops aren't gods! They have no right to pass judgment and treat you like an animal.","post_message":"POLICE BRUTALITY caught on video! Is anyone REALLY going to try to justify this? From (Y) Counter Current News - MBD"},{"comment_id":"1922337691198281","commenter_b":"What easier place to pull off a mass murder? A gun free zone, loser!!! Did your law stop the murderer from having a gun?? Libs just keep getting dumber.","commenter_a":"another freaking retard liberal","post_message":""},{"comment_id":"10156463625885354","commenter_b":"She needs to go blow Bill, be the best use of her mouth in YEARS!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Kiss my butt u dumb idiot if someone had a gun some of those people might not be dead","post_message":"Hillary Clinton is a Fact-Free Zone."},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"1199808656730781","commenter_b":"I will say that being raised by two parents, not necessarily a man and a woman, can be a good support system for a child though. Single parents aren't worse by any means, but it is tougher out there for single parents, that's for sure.","commenter_a":"2 perverts","post_message":"Classic Jeb! (Hat tip to Bipartisan Report)"},{"comment_id":"932721720195935","commenter_b":"who is wiping out Africans?","commenter_a":"They need to do something before brazil becomes the next africa or Australia....white people taking over while the indigenous people get wiped out.","post_message":"EXCLUSIVE: Brazil, the World Second-Largest Black Nation, Has Been Taken Over by an All White Male Cabinet #ABSArchives"},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."}]
