[{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10153314695286051","commenter_b":"get over it, all anyone ever sees is when a black gets shot, stupid bitch","commenter_a":"Hell I don't see anything about our Military any more because all I ever see is about cops","post_message":"Two police officers fatally shot a man in Texas this week, but there’s a catch: The suspect fired multiple shots at them first. Did the officers defend themselves appropriately?"},{"comment_id":"1369855736388104","commenter_b":"Those women are vicious hacks for hillary.they don't care what she did against America or the corruption & lies they are all part of the corruption .","commenter_a":"What a waste of her time. They just want their ratings to increase with all the drama","post_message":"The claws really came out..."},{"comment_id":"10153774397117098","commenter_b":"No!!!! SHE IS A LYING SKANK!!!!","commenter_a":"What the hell? So these dudes were sleeping with their coworker's underage daughter? That is disgusting.","post_message":"#BREAKING...  What we're just learning on KRON News at 5 p.m."},{"comment_id":"10155824563490725","commenter_b":"White girl","commenter_a":"I am praying \"IN JESUS NAME\" that Donald Trump becomes our President, WE should all pray \"IN JESUS NAME\" that Donald Trump becomes our President so we can get our America back to the way God wants it to be. I know with Donald Trump as our President he will \"Make America Great Again\", Amen!","post_message":"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our \"leaders\" can't say no!"},{"comment_id":"10152979977382293","commenter_b":"go to hell sodomites","commenter_a":"Some will look at this map and say that the majority of the world has become enlightened. Others will look and say that Africa, the ME and the other countries in tan and brown are the righteous ones with their religious views. I think the map speaks for itself. Homosexuality is here to stay and someone needs to tell some of these countries what century they are living in. Killing people for being gay is a sick understanding of a religion.","post_message":"Many countries still punish homosexual acts with prison time, torture and even death."},{"comment_id":"10154241082384170","commenter_b":"@username, I like you a lot, but how is this woman good, when we had sanctions against Iran, she was selling to them like crazy....of course she was trying to save herself and get her numbers up, but just so wrong of her....that's just another one of the many things she did, she couldn't even win the Senate seat in CA...how could she help him win the Presidency? We just all need to stick with the best....TRUMP!","commenter_a":"Uh--oh! I hope he has a portable stage and plenty of microphones. That's her specialty.","post_message":"Smart move, if it pans out."}]
