[{"comment_id":"10153310876381770","commenter_b":"'@username right lol these idiots.","commenter_a":"Even as a Republican voter, I believe that we don't need another Bush in the White House.","post_message":"Jeb Bush is suspending his campaign for the Republican presidential nomination following a dismal performance in the South Carolina primary."},{"comment_id":"10153367144158352","commenter_b":"Wow she's a fool!!","commenter_a":"WTF IS WRONG WITH ALL THESE CRAZY ASS PEOPLE IN FLORIDA!!! All these stories lately have been about people in FL just like the mom who made her child jump out 2nd story, there's been a shit load of crazies hitting the headlines recently","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10152859650389877","commenter_b":"Girl, bye.","commenter_a":"It looks like there's another sign that says 'Down' so, I'm hoping the other sign, which we can't see, says with... Would spell out 'Down With White Power'. I'm curious to know what the colors of the other team are?","post_message":"High school students flash 'white power' signs at basketball game. Read what happened next below.   Grio fam, what should the punishment be 4 this ignorance? #soundoff"},{"comment_id":"10153900140313487","commenter_b":"Nazis are big in SA. Very wealthy, and powerful","commenter_a":"'Baby' Hitler was beaten by his father, and though loved by his mother, she died young. Take away either thing and you have a different adult.","post_message":"What would you do?"},{"comment_id":"10154784936184614","commenter_b":"We keep building houses, taking away the land near the hills. where else are these animals supposed to go? if you want to live out there, keep your little ones inside. the animals were there first.","commenter_a":"Lol i guess those dogs was watching to much YouTube where people had their dogs chasing away mountain lions and big cats thinking they was really scared of a dog lol guess again.","post_message":"'This video is heart wrenching,' says a Rancho Cucamonga animal-lover whose security cameras captured his dog being dragged to its death by a coyote.   Oliver, a 9-year-old dachshund, was chasing the intruder coyote away from his sister dog when the wild animal grabbed him.  'Even a 7- foot wall won't keep your pets safe,' the homeowner warns.  Read KTLA's story here: @webpagelink"},{"comment_id":"1592257357455136","commenter_b":"Ew. That girl is a cow","commenter_a":"Soar losers. Get over it.","post_message":"Anti-Trump protesters are outside Trump Hotel in D.C. They've been marching for two hours now.  More about road closures or traffic in D.C.: @webpagelink"},{"comment_id":"683878711749701","commenter_b":"By the way, good little robot response, Hudson. Care to elaborate?","commenter_a":"I've always admired Colin Powell. Mr. Powell said the Iran deal is a good deal. That's good enough for me.","post_message":"The nuclear deal with Iran risks the safety and security of America and our allies. It must be stopped. #NoNuclearIran"}]
