[{"comment_id":"472031482987432","commenter_b":"If this is the way she believes then she should go to a country that believes in that kind of stupidity. Piss on the rag heads","commenter_a":"Yes the officer was right, keep up the good work.","post_message":"A woman is suing the police department... over a hijab?  This woman broke the law, the police are completely in the right.  Do you support our police?"},{"comment_id":"1160164500670245","commenter_b":"@username did you forget to take your happy pills? LOL","commenter_a":"I am so over this. We need to worry about the homeless and disabled right in front of us, not hunting regulations in another country over one dead lion. Take the money you spent getting to this guys house and buying paint and feed someone today.","post_message":"Raw meat, animal crackers and spray paint were used to vandalize the Florida vacation home of lion-hunting dentist Walter Palmer."},{"comment_id":"10153442535983132","commenter_b":"there is tons of transgender models lol","commenter_a":"Beautiful!","post_message":"If 2015 wasn her year already, it sure is now."},{"comment_id":"542951289163244","commenter_b":"That cunt, is one letter away from ruining my name!","commenter_a":"This whole thing just happens at the EXACT SAME TIME OBAMA ANNOUNCES ILLEGAL EXECUTIVE GUN CONTROL ORDERS! This was a set up to drum up support from the sheep for this gun control garbage that will circumvent or HIPPA privacy. I for one feel that the government shouldn't have access to anyones medical records to see if they are crazy by THEIR STANDARDS, which are pretty fucked in the first place... I do not trust the most narcissistic, psychotic, murderous people in our country to choose who gets to protect themselves and the rest of us. This whole thing is under the guise of mentally ill not being armed. People that have guns will now redusr to get treatment they may need for fewer of the government coming and taking their guns by force. anyone that has EVER had treatment will loose their guns by a man with a gun ...","post_message":"So much for taking on the tyrannical federal government, ehh?"},{"comment_id":"10153754425932431","commenter_b":"Americans are so evil they kill 99% of us and steal our land and then when we stand up to them, they say hey you better kiss our ass or we won't help you","commenter_a":"If americans want their pipeline then just put it on their land over their water not ours, They should have to pay the price for their greed not us, I am tired of americans living good lives off our suffering.","post_message":"Video: 7 Arrested After Pipeline Protesters 'Invade'  Enbridge's Duluth Offices  bit.ly/1Ms7Sjy"},{"comment_id":"958471064269672","commenter_b":"BUT.... FOR ANY SMALL REASON SHE CAN GETS SHARIA LAW...... NO BAD TO TRY...!!!","commenter_a":"Lindsey! Remember no smoking no alcohol no pork prayer 5 times each day etc. However there will be more than enough sex and just think you will replace several goats! This will make you very popular with peta!!!!!😎","post_message":"Dear Lindsay: Pay particular attention to the anti-women bashing bits and ... then smoke a cigarette and meditate whether or not you really wanna to convert. @webpagelink"},{"comment_id":"974691752568165","commenter_b":"Lol.","commenter_a":"He has a point.","post_message":"\"You're a despicable human being.\""}]
