[{"comment_id":"1563876947236715","commenter_b":"She a crook herself","commenter_a":"Sarah, go walk to the end of that bridge in your yard and ask Vlad of he is afraid of Trump...","post_message":"Sarah Palin called out Mitt Romney on Facebook for attacking Donald J. Trump."},{"comment_id":"164458724060246","commenter_b":"Should give all their jobs to legal immigrants","commenter_a":"Good for the owner. Behind him all the way.","post_message":"30 WORKERS FIRED For Skipping Work To Protest On Behalf Of Illegal Immigrants…Calls Employer Who Fired Them A 'Racist' [VIDEO]"},{"comment_id":"10153692790361323","commenter_b":"I have a rare photo of Barack Obama actually working as President instead of playing golf. Rarest thing around. Unfortunately, as with everything connected to Obama, it is worth SQUAT.","commenter_a":"lovely","post_message":"Henry McCarty, known in Wild West lore as Billy the Kid, lived a brief and violent life, stealing and killing before his death in a gunfight aged 21. He lived with a gun in his hand – and sometimes, it seems, a croquet mallet.  Read the extraordinary story of how only the second photo ever authenticated as showing Billy the Kid came to light: @webpagelink"},{"comment_id":"10154020746508908","commenter_b":"Malo e :)","commenter_a":"'@username Kristjan Korez","post_message":"500 kilometers On 1 Litre of water: Brazilian man challenges the idea of gas stations."},{"comment_id":"930363577060209","commenter_b":"She is as STUPID as HILLARY","commenter_a":"Germany's Government 'feel good' Migrant policy has consequences.","post_message":"CLUELESS..."},{"comment_id":"10153442792427232","commenter_b":"Have you seen all the arrest of that originations leaders?","commenter_a":"Much like their spoksperson...LoL","post_message":"The civil rights group approved the measure Saturday at its national convention in Philadelphia to end the boycott of tourism and other economic activity. STORY HERE: @webpagelink"},{"comment_id":"10153254470474330","commenter_b":"I do not have girls, but if I did I would not let them wear either one of the dress below. they both look trashy, Asking for Trouble","commenter_a":"The guidelines may be appropriate.....yet they would have been honored if not considered had they come a month (or more) ago while these young women were shopping for the dresses!! Kids need to learn dress code acceptance to match the occasion...and while not promoting prudeism - if that is a word, my parents in the 60's would encourage us to leave some stuff to the imagination!","post_message":"Some controversy is brewing over prom dresses at Shelton High School. On Friday, the headmaster announced that dresses with slits, cutouts and backless styles wouldn't be allowed at prom. However, students and parents say the crackdown comes too late. They already bought the dresses. ---> @webpagelink  What do you think? Should the dresses be allowed or not?"}]
