[{"comment_id":"10155653992935389","commenter_b":"Obama's clusterf*ck !","commenter_a":"@username, I do not think either one of them have any care at all about this.","post_message":"Question of the Day: Do President Obama and Hillary Clinton owe the families of fallen troops an apology for pulling out of Iraq?"},{"comment_id":"10154223685116409","commenter_b":"@username it is what it is, he is president elect, I did not vote for him but we always need to see the bright side of things.","commenter_a":"Everyone should give him a try, ACA is unaffordable for middle class families.","post_message":""},{"comment_id":"1713613852259060","commenter_b":"a matched pair of idiots","commenter_a":"Ain't that the truth!","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question: “Have you seen those very, very controversial videos?”"},{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"10153595971197016","commenter_b":"And women are going to vote for this lady killer","commenter_a":"Sigh. If this big dope gets elected even the people who elected him will be bitterly deceived and betrayed and it won't take long.","post_message":"Republican presidential nominee Donald Trump on Sunday morning described the numerous female employees at Fox News who accused Roger Ailes of sexual harassment in the workplace as \"complaining\" and explained how that makes him \"sad\" because really the company's top executive actually \"helped\" \"some of those women\" and he's a \"very good person\" and a close personal friend. WTF."}]
