[{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"},{"comment_id":"595270947330151","commenter_b":"Absolutely the most corrupt female politician! Bad for the US!","commenter_a":"Hillary is a PIG","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10154015266906028","commenter_b":"Clearly you have ignored the riots that occur when sports teams win. Those are primarily white. It's incredibly difficult to understand any point you're trying to make, simply because you make no sense. @webpagelink","commenter_a":"Cops die on a daily basis stopping crime and just because there is some bad cops you assume all of them are bad ? What are you doing San Francisco 49ers Colin Kaepernick what are you doing to keep people safe or stopping crime ?","post_message":"After some fans took to social media to burn the jersey of the embattled quarterback because he refused to stand during the national anthem, photos of Colin Kaepernick's socks have surfaced and riled people up again. @webpagelink"},{"comment_id":"10155092552983797","commenter_b":"I'd rather have all those than Depression :D Wait, you said, \"CORRECTion\"... how do we even know the Bible is correct? Bible stated Jesus is white.. we know that's false. He's Black. The Bible is a contradiction to other verses and such.","commenter_a":"Really??? Lol! Side effects for birth control for women- Intermenstrual spotting. ... Nausea. ... Breast tenderness. ... Headaches. ... Weight gain. ... Mood changes. ... Missed periods. ... Decreased libido. And thats just the 10 common side effects.","post_message":"The shot seemed to be as effective as other forms of contraception, but the men complained of side effects like acne and mood swings..."},{"comment_id":"601754246672035","commenter_b":"Yes I do the whites made her now she it very racist big time","commenter_a":"shut your mouth!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"953914171315722","commenter_b":"I do agree that woman look proactive in these yoga suits. I always wear a long shirt over mine. Why cant these young women use some common sense.","commenter_a":"I am not responsible for someone else's thoughts.","post_message":"This woman's response to the idea that women should dress in a way that prevents men from having lustful thoughts is both amazing and hilarious:"}]
