[{"comment_id":"10152735674121051","commenter_b":"This is a shame so many good women cant have kids but trash like this has them!","commenter_a":"ALABAMA...what else is there to say..........","post_message":"One look at this baby’s blood test and officials immediately ordered that the mom be arrested."},{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"707413306095459","commenter_b":"She have a bird on her head?","commenter_a":"Illegal people","post_message":"LIVE NOW: The Phoenix City Council is talking about a proposal that will designate the city as a Sanctuary City. STORY: @webpagelink"},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"},{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."}]
