[{"comment_id":"1356822761024859","commenter_b":"I agree. What a Bitch.","commenter_a":"shame all those parents whose children have been murdered by Obama can't sing to their dead children... wake up this man is a bastard","post_message":"This is the most beautiful thing you will see all week."},{"comment_id":"10153749072149411","commenter_b":"This is why aliens don't want to talk to us","commenter_a":"There are no aliens from other planets riding around in spaceships people. If you really want truth read the Bible.","post_message":"An alien invasion unlikely at all?"},{"comment_id":"10152912760116491","commenter_b":"Nichole with all respects, no one is entitled to ANYTHING! I simply illustrate that women must figure out exactly what it is they want before complaining about how things are. I purposely let the door close on a woman because I don't always hold it for a guy. Women give me a stink face so often and I tell them it's me treating them equally. Have a woman pay for her own dinner once and see how far you get to having a second date. ... List goes on and on","commenter_a":"I've been to the Middle East. There isn't an American woman alive that can talk to me about oppression by men. Women run this country. They are the reason men wake up in the morning. I feel women in this country have an identity crisis in that they want chilvary but in the same instance they want equality. Men are tough and ravenous towards each other. You want that then don't complain when men treat you as they would a fellow man. (I want to add this doesn't apply to ALL women just the ones it does)","post_message":"Much of what we hear about the plight of American women is false."},{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"1556887964609272","commenter_b":"People need to come in our country the right way. Obama wants to flood our country with illegals.","commenter_a":"Poor you Ted Cruz! You and Trump are almost the same thing!! But, there is a little difference! Do you know why Trump is leading the GOP? Because he is white, and you Cruz, you dont, not for the racist republicans! You has been descriminated for them too! You and Trump never will be president of this country!","post_message":"Ted Cruz on illegal immigration: “The federal government is doing a horrible job of securing the border. It’s utterly failing.”"},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."}]
