[{"comment_id":"10153174842954342","commenter_b":"Amyaa Brown what u done did? Lol jk","commenter_a":"Deepan Patel","post_message":"EVACUATION CHAOS: Southwest Airlines evacuated a plane at Hobby Airport when the cabin started smelling like smoke.   WATCH:"},{"comment_id":"10154248174893734","commenter_b":"build the wall with trump under it","commenter_a":"TRUMP 2016..","post_message":"Do you agree or disagree with Donald Trump's speech at the Rolling Thunder motorcycle rally today?"},{"comment_id":"1259153044105704","commenter_b":"You could try this? :) @webpagelink","commenter_a":"Judy Acres too bad we can't watch this :( UK only","post_message":"Absolutely spectacular footage from the BBC's latest nature documentary, #thehunt. Honestly, some of these shots look almost too perfect to be real.  \"Witness a polar bear sneak up on its prey using ice holes to surprise it. This is the first time ever this has been captured on film.\"  You can watch on iPlayer here: bbc.in/1j0xI5B"},{"comment_id":"967628599952830","commenter_b":"Treason is what most our crooked federal employees should be charged with","commenter_a":"When both the Republican establishment and the Democrat establishment attack the SAME candidate, then you know YOU'VE FOUND YOUR GUY!! DONALD TRUMP for PRESIDENT!! 🇺🇸🇺🇸🇺🇸","post_message":"Uh-oh..."},{"comment_id":"1243719872306934","commenter_b":"I would kill radical's in a minute for these women!","commenter_a":"These guys need to be exterminated!","post_message":"Of all the atrocities committed by ISIS, this just might be the most horrific of all. Kidnapped girls and women caged like animals and then set on fire for refusing to have sex with their Islamic captors"},{"comment_id":"10152744364061051","commenter_b":"And she can spend all the money she wants...mother nature will eat you from the inside our eventually","commenter_a":"Wonder how many hungry people that money could feed? But why try to end world hunger when you can go to the gym.","post_message":"This couple spends $80,000 per year on their looks, and they say that's why they're the best looking people in America."},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana.   Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."}]
