[{"comment_id":"10154062692302439","commenter_b":"How will all the \"empowered\" women of America take this? I say there will be a revolt.","commenter_a":"Has the U S stooped so low. No gentlemen, no ladies, no gender. Just human bodies. Numb, mindless zombies.","post_message":"Another gift we can thank the feminists for. Let's see; the epidemic of single motherhood, the breakdown of the American family, the street vernacular of \"bitches and hos,\" the emasculation of men, defense of Islamic misogyny, suppression and oppression, silence on sharia, and the bone-crushing responsibility of one woman being mother, father, breadwinner, chief cook and bottle washer we owe to the feminists. And now this - one can only imagine what the likes of the Islamic State will do to our female soldiers."},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"},{"comment_id":"1008212159219442","commenter_b":"So....according to your thinking...If the CEO of a company steals a million dollars from stockholders....and a New CEO is elected, then it is the 1st one's fault if the new one steals 2 Million???","commenter_a":"Since Obama loves releasing terrorist from Gitmo - and \"trading them for Americans...looks like he could have negotiated a trade for these prisioners, afterall he did it for a deserter!!","post_message":"Iran continues to unjustly imprison and abuse at least three Americans: a Christian pastor, a former U.S. Marine, and a journalist. They must all be allowed to come home to their families immediately. This should be a condition of any potential agreement the Obama administration discusses with Iran."},{"comment_id":"10150699616999999","commenter_b":"He knows well cause his father was a partner with the militar goverment that killed thousands of Argentinian citizens.","commenter_a":"If I were him I would use another story. Something to do with Argentina and it's people. Just saying.","post_message":"At 32, Mauricio Macri, the president-elect of Argentina, was kidnapped and placed in a coffin by rogue police officers, an awakening that put him on a path toward politics."},{"comment_id":"10153297238001051","commenter_b":"YES","commenter_a":"Yup!","post_message":"The man who murdered a Kentucky police officer on Sunday night has been fatally shot. Do you consider this justice served?"},{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"10154603481037994","commenter_b":"How can you kid nap your own kids is as stupid as how can your rape your own wife","commenter_a":"That's messed up. I wish I knew more but she shouldn't have to go to jail. She's a mom and those are her kids. She shouldn't have done what she did but at the end of the day those are her kids too.","post_message":"The mother was scheduled to return the two little girls to their father -- but never came back."}]
