[{"comment_id":"10153906444119705","commenter_b":"All these people on here saying Apple is supporting terrorism have no clue. If the software is created to unlock this phone, it can be used to unlock any phone. They all use the same data encryption software. This would put all of Apple's customers (hundreds of millions of us around the world) in danger of our privacy being breached by thieves or overreaching governments. Apple has complied with every aspect of this investigation otherwise, including providing data stored on its servers as required by warrant. But the software needed to break into the rest of the data on this phone doesn't and shouldn't exist.","commenter_a":"The order specifically refers to *this* phone, specifically allows Apple the option of doing it on *their* premises, and specifically allows *Apple* to retain control of the method used. What? They can't keep that process secure themselves?","post_message":"Apple vs. the FBI explained, how this case might affect your iPhone."},{"comment_id":"10152967828847061","commenter_b":"Yes legal immigrants ma'am","commenter_a":"I am ashamed at the negative narrow minded comments. Check your heritage. We are all immigrants","post_message":"America Ferrera to Donald Trump: Thanks, your comments will send more Latino voters to polls: abcn.ws/1Iw7NNn"},{"comment_id":"1279009012178004","commenter_b":"Fuck that girlfriend","commenter_a":"I woulda just gave her the pipe since the gf it a dumb bitch anyways","post_message":"Dude passed the test!  #WSHH"},{"comment_id":"1450281048346082","commenter_b":"@username why don't you then? Rather than complaining? You are angry because women are doing exactly that for themselves but they aren't doing it for you?","commenter_a":"Machism means feminism...no extreme is good...Breast cancer has 10x more funding and support than prostate cancer (for equal mortality), there are more men incarcerated than women, men spend more time in jail then women for the same sentences...Men also suffer from inequality and starts from birth: life expectancy is lower than females and seems to be genetically driven (extra Chr X seems to provide some protection)","post_message":"Do you know what machista means? The hashtag #EsMachismo started trending, and these 21 tweets explain a lot. - Alicia E. Barrón"},{"comment_id":"10152933046001051","commenter_b":"Lady get it straight..stay home Granny! No, i'm not following you...Really!!!","commenter_a":"I sure hope not","post_message":"Here is Hillary Clinton's first campaign video. Simple question: Will she be the next President of the United States?"},{"comment_id":"10152849864834342","commenter_b":"Woman can be evil also.","commenter_a":"Sad.","post_message":"Rebekah Holly Speer, 36, is charged with cruelty to animals after authorities say they found several dead dogs -- at least one shot and stabbed -- at a home in the 3500 block of Deep Anchor Way"},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."}]
