[{"comment_id":"10153978384659726","commenter_b":"There is a new Wave in America, it's the Blue Collar Wave and it's about to wash away an entire Establishment. The Media says we're dummies and Racist for Standing up to the Establishment and Riding that #TrumpTrain all the way to the White House to Make America Great Again. I say let the Blue Collar Wave wash them away.","commenter_a":"Perhaps but regardless, Obama is a POS.....","post_message":"WATCH: Obama: I'm not a 'big government, crazy liberal'"},{"comment_id":"10153071798041051","commenter_b":"What a bitch","commenter_a":"Stupid! !","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153774465069170","commenter_b":"She is Pure Evil.........","commenter_a":"Gosh, I am so sorry that this is a waste of her time by the way she looks in this picture. This woman really believes she's above the law and she really needs to be indicted on this and her email server!!","post_message":"Forget all the analysis of this like it's a boxing match. All that matters is the facts that have been revealed, and these 10 minutes are the most important you can possibly see."},{"comment_id":"667821613408417","commenter_b":"She needs to shut her big mouth!","commenter_a":"Moooooooo !!!!!! Eat more chicken !!!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"10154525720961323","commenter_b":"@username: \"In any case, the only way to deal with migration is to recognise what really causes it (inequality, proxy wars, global warming you name it) and to start coming up with responsible and honest solutions rather than shutting yourself off.\" I definitely agree. Our high levels of foreign aid and international development is only the beginning. We need to stop bombing other peoples countries and begin accepting a LOT more refugees. ------------------------------------- \"Voting yourself out of the EU has not solved that problem at all and it will most certainly not lead to more non-EU migration\" But with control of our own borders we can stop priority status for Europeans over non-Europeans and decide our immigration policies at election time. ------------------------------------- \"And if you are so concerned by population control on your island\" I'm concerned about population control on earth. I've absolutely no idea what we do about never-ending ...","commenter_a":"That is the future the masses chose. If you don't like it, do your research next time instead of foolishly buying into far-right propaganda.","post_message":"\"There is very little evidence of people knowing what they are trying to do.\""},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."}]
