[{"comment_id":"10152777855631717","commenter_b":"Totally disgusting, the bastard should be locked up for life!","commenter_a":"Are you serious? Time to pull them off the bench!","post_message":""},{"comment_id":"10153990601334726","commenter_b":"Joel Gillespie One thing to have hired them (via a contractor) totally another to hand them citizenship. Maybe if Rubio and his fellow politicians would secure the border enforce immigration laws there would not be illegals for hire.","commenter_a":"hilarious that Rubio is the one that said Trump misspelled Choked and he didn't... Rubio was wrong","post_message":"WATCH: Rubio Mocks Trump, Reads Misspelled Mean Tweets, 'Friends Don't Let Friends Vote For Con Artists'"},{"comment_id":"10153384836141756","commenter_b":"And they're thin from getting anal leakage from eating all that spam!","commenter_a":"And they are still thinner!","post_message":"South Koreans eat three times as much Spam per capita as Americans. Customers buy it in bulk packages and as fancy holiday gift boxes. \"It's a luxury that really has kind of cemented itself in Korean society,\" says the president of a food tour company in Seoul."},{"comment_id":"10157751782920500","commenter_b":"BUILD THE WALL!","commenter_a":"I don't get how everyone assumes all those people are unemployed, on government assistance and have no education... who the fck are you.","post_message":"This is live footage from Oakland where people are protesting Donald Trump's election."},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"1154933824548403","commenter_b":"Kill every last pig","commenter_a":"Well done Syria","post_message":"Watch Syrian forces closing in on the Daesh Takfiri terrorist group’s de facto capital Raqqah."},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""}]
