[{"comment_id":"10154898338007577","commenter_b":"Do you know how many Christian societies destroyed each other fighting over how they would practice Christian culture? Go back to school buddy and come back when you are ready to embrace the real fate you are living in.","commenter_a":"The liberals know their perversion of modern society with their political correctness and liberal rights for the underserving criminals, non Christian cultures is coming to an end. The American people are going to start clawing their rights back under Trump.","post_message":"MSNBC continues to whine and cry over Donald Trump being democratically elected as President..."},{"comment_id":"10153833789564411","commenter_b":"Israel has been there 3000+ years as proven by archaeology. it's palestine who are the invaders. It's the SECOND palestine if you've studied history. They're Syrians and Egyptians as confessed by the PA itself. They even use the flag of Jordan.","commenter_a":"Guys Guys Guys u no one thing turkey is number one trading partner of isreal....And turkey is first country who excapt isreal as a brother Nation......And turkey is N.A.T.O mamber what N.A.T.O did in libya Afghanistan Iraq and somaliya u no batter then me......Down with Erdogan Down with Turkey...long live Palistayin","post_message":""},{"comment_id":"10155032769051757","commenter_b":"Great","commenter_a":"Excellent! I hope to see you do many more of Fox's interviews with President Trump. You deserve it. Thank you for always reporting the truth when others didn't.","post_message":"Question of the Day: What did you think of my interview with President Donald J. Trump?"},{"comment_id":"10153152461759170","commenter_b":"Because many people don't understand the effects of war on our men and woman of the war they fight overseas and home. It's the sadest thing I've come to know and yet sooooo many people can't understand. Watch and learn what they suffer along with there Loved ones. Then remember there sacrifice!!","commenter_a":"No they don't hate war movies, they hate war movies when an American is the Hero.","post_message":"No one should be surprised that American Sniper didn't win much at last night's Oscars..."},{"comment_id":"10153049017301323","commenter_b":"Leave her alone, can't we just all be pleased that Andy is through to the final. There were very tense moments in the match!","commenter_a":"Stone her","post_message":"F is for ferociously supportive, amongst other things.  What was Kim Sears saying to Andy Murray's opponent at the Australian Open?"},{"comment_id":"10153372404416509","commenter_b":"We gays.","commenter_a":"Its so surprising how everyone calls on God for a miracle yet america is a homosexual country that dont obey God....","post_message":"Almost three weeks after she was found unresponsive in a bathtub, Bobbi Kristina Brown is still fighting for her life. @webpagelink"},{"comment_id":"1088078934585187","commenter_b":"She is a pest!","commenter_a":"Does she not realise that her actions will encourage pest infestation of insects & rodents, germs will have a field day, right next to where she's raising her child?","post_message":"Some people are just scum"}]
