[{"comment_id":"1233016690120338","commenter_b":"I would say #NeverHillary. Write in Bernie OR anybody else. The woman is so corrupt.","commenter_a":"\"Superprepared warrior\" is absolutely nothing you should be proud of. You're a disgrace to world peace and America. America will never elect someone as insidiously corrupt as you. Hope the FBI comes knocking soon!!!","post_message":"“On April 19, New York Democrats will have unusual say over the party’s nominee. They have in Clinton a superprepared warrior realist... By choosing Clinton, Empire State Dems would powerfully signal that the party has gotten real about achieving long-sought goals.” —New York Daily News nydn.us/1Vn9bcK"},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"10153935539180399","commenter_b":"They will just be in the restroom with transgender men! Grow up guys!!","commenter_a":"cruzs and trumps kinda guy @webpagelink","post_message":"Cruz said the bills make sense because \"men should not be going to the bathroom with little girls.\""},{"comment_id":"10155089942751037","commenter_b":"Probably a 1% chance I'm wrong, 99% that go clubbing with mom are losers looking for a free ride!","commenter_a":"They'll all end up as Uneducated Ho's, sitting in the corner of a club by themselves when the looks are gone!","post_message":""},{"comment_id":"10154629464758797","commenter_b":"She also needs to be medically sterilized so another child cannot be born to this vicious murderer","commenter_a":"7 YRS R U FUGGIN KIDDING ME SMH I HOPE HE AT LEAST DIES IN PRISON","post_message":"TODDLER MURDERED: Prosecutors say the beating was so bad that part of the 17-month-old boy's skull broke off in the medical examiner's hand during the autopsy..."},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"}]
