[{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"10153070915541051","commenter_b":"Put her in the outhouse and lock the door.","commenter_a":"😕","post_message":"This woman's husband was buried under a particularly big pile of manure when police finally discovered him."},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."},{"comment_id":"10153918741113854","commenter_b":"@username You stupid racist the C word that women don't like! Will be glad when people like you die out!!!!!!!!!!!!!!","commenter_a":"Barack Obama has done NOTHING to improve this country....he has improved his own lifestyle at our expense!","post_message":""},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""},{"comment_id":"10153906233727522","commenter_b":"Hillary is so obese she looks pregnant in that photo!","commenter_a":"What a bull crap fake news article. Dont blame the constitution for running a more flawed candidate.","post_message":"It's possible to win the Electoral College while winning only 22 percent of the national popular vote."}]
