[{"comment_id":"10153851364301336","commenter_b":"Women and small children only.","commenter_a":"Look at all of those men! Able bodied men not fighting to defend their own country! Cowards!!!!","post_message":"The bill would require the FBI director to certify a background investigation for each refugee – and several top security officials to certify that each refugee is not a security threat to the U.S."},{"comment_id":"10156260216170725","commenter_b":"Michele the only thing dirty here is your pussy","commenter_a":"The media is always unfair to you @username but we are supporting you and what you will do for this country!!! Make Amerca Great Again in 2016!!!","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"10152923308511130","commenter_b":"Women lie about is ALL of the time, right?","commenter_a":"Imagine if women didn't falsely accuse men of rape because a man \"upset her\". (It happens ALL of the time.......) Maybe more men would reach out. Instead, modern feminists slam men daily then expect to be worshipped?","post_message":"Powerful."},{"comment_id":"10153901332209411","commenter_b":"Russians shout their own feet. We do not export our high quailty fruit and veggies anymore. Go and import from china the plastic one !","commenter_a":"We have banned all Turkish produce on our global operations since last week...and will never have any trade relations with that country. May it be Diplomatic or Corporate! For as long as it's erdogan's administration.","post_message":""},{"comment_id":"428369787523578","commenter_b":"Lady if I was standing right next to you I'd slap the s*** out of you","commenter_a":"Lana Genchi","post_message":"This woman's racist rant just got her banned by the mall for life."},{"comment_id":"606469089512450","commenter_b":"Cus Beyoncé just another weak ass bitch in the guise of some sort of strong independent woman.","commenter_a":"Except she didn't do any of this and stayed with the man that's been cheating on her (and before the beehive goes crazy, I love Beyoncé...but what I said is also very true...) soooo you can't be a strong independent woman who brushes aside the fuck boy...when you're still married to him. Now if she comes out and says that they are still married cause it's business but they sleep in separate rooms and have an open relationship then awesome for them...but it's not empowering women...its perpetuating the stereotype","post_message":"14 Beyoncé \"Lemonade\" Lyrics For When Your Ex Texts You"},{"comment_id":"797236390409541","commenter_b":"Stfu no one wants to hear your mouth.","commenter_a":"Donald Trump is a BIG Government Authoritarian and progressive fraud from New York City He's NEVER been a conservative, and he NEVER will be conservative -- he's an actor, a phony, pretending to be what he's not.","post_message":"I'm getting really tired of this."}]
