[{"comment_id":"10152931610594270","commenter_b":"He has to be doing this just to make me look like a saint.","commenter_a":"West Point grad and comissioned Officer - apology not good enough. Gotta go. If he could ly about something as serious as Valor what else can he lie about?","post_message":""},{"comment_id":"992656437438363","commenter_b":"Ban cars and booze. They made her do it !!","commenter_a":"The amount of unregulated stupidity shown by this younger generation is just absolutely astounding. It just blows my mind bravo idiots bravo","post_message":"Police couldn't believe what they were watching unfold live:  “After 30 years of law enforcement I hadn’t seen anything like this before.”"},{"comment_id":"1412807245405968","commenter_b":"Again....she attacks her husbands victims. She's a POS female.","commenter_a":"Says the woman who stood by her philandering husband on numerous sexual misconduct occasions. And then she attacked the women. She is the one who set women back!! I want a much better role model for my daughter.","post_message":"\"When Donald J. Trump says, 'Let's make America great again,' that is code for 'Let's take America backwards,'\" Hillary Clinton said."},{"comment_id":"1306332122711020","commenter_b":"This is America. Let them all leave. We love our National Anthem.","commenter_a":"Oh say can you see your way out of here muslims","post_message":"MUSLIMS ARE OFFENDED AT NATIONAL ANTHEM: They Say It Forcing Them...  THEY WILL NEVER ASSIMILATE!"},{"comment_id":"10153289786066491","commenter_b":"Here's the thing. You need to go # 1? You need to go # 2? Go to bathroom of your current sex. Drop the bomb, Cut loose, wipe clean, get out. That simple. Bathroom is not social grounds It's not grounds to dispute how you feel as gender. Do your business, in out less than 2 minutes..... WTF is wrong with the world today. Everyone wants to be special.","commenter_a":"Are we that far gone from reality that we want to make bathrooms for the trans in our society. Im sorry you were born as a boy or girl. How about you just stick with that while you are in public. Problem solved and no money spent on suppling a unneeded bathroom","post_message":"\"Before the 5th grade, my classmates were able to accept and be friends with me.\""},{"comment_id":"10152989497399099","commenter_b":"Impatient mother f'r, bc that's y those light and sign is there for, so they can cross safe.","commenter_a":"Smh","post_message":"A driver is accused of hitting a 6-year-old boy as he was getting off the bus and walking toward his mother @webpagelink"},{"comment_id":"370743173113977","commenter_b":"Should have thrown the book at her!!!","commenter_a":"Hell yes she deserved it!","post_message":"Did she deserve that?"}]
