[{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"},{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"10153451774798132","commenter_b":"Some lesbians dress like men everyday.... Just saying.","commenter_a":"HE SAY'S HE IS A WOMAN BY ALL MEANS, BUT STILL DRESSING IN MEN'S DRESS SHIRTS?? humm I don't get that","post_message":"Here's what everyone will be talking about tomorrow."},{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"10154148489244060","commenter_b":"@username I just think OUR country needs to find a way for its CITIZENS to be productive, if we want to limit immigration ..just an idea","commenter_a":"You are forgetting that Rodney King was drunk and high on PCP. He also attacked the cops, that is clearly seen on video. White people who are drunk and high on drugs are beaten by the police when they resist arrest too... Please tell all the story of you are going to tell it. As for the Black Lives Matter movement goes, they just increase tension and stir things up. All Lives Matter, end of story. Where are the BLM protesters when two black kids are shot in their front yard in a gang-related shooting and there are no leads in the case? Nowhere. If a white police officer isn't involved, they don't care. They just want headlines, not community building. And that community is all of us, not just one ethnic group.","post_message":"Rodney King, an American taxi driver, was beaten by four LAPD officers after being caught speeding. He suffered a fractured facial bone, a broken right ankle and severe bruising and lacerations. It sparked a global conversation about police brutality; two of the officers were found guilty of violating King’s civil rights on April 16th 1993"},{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"}]
