[{"comment_id":"1142306435836110","commenter_b":"What a piece of shit! And fuck the judge that his mommy and daddy paid off!","commenter_a":"White privilege at its best","post_message":"Man charged of raping 2 unconscious women only gets probation and won't have to register as a sex offender! #WSHH #SMH"},{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"950439771634160","commenter_b":"Yeah you are a coward you b*tch","commenter_a":"Didn't any of you read this Bill or just the miss leading article Think Progress put up. Probably not the Bill will make it a CRIMINAL offence to conceal you're Identity by using a hoodie. Read the Bill you look Stupid making comments you know nothing about","post_message":"Ugly stereotypes shouldn't be enshrined into law"},{"comment_id":"10153521372371162","commenter_b":"Illegals cant vote....","commenter_a":"This men can't never be president white racist people can do it alone with out Hispanics and blacks his election is a waste time and money he lost already","post_message":"BREAKING: Donald Trump sues Univision for $500 million over the Miss USA pageant... @webpagelink"},{"comment_id":"10152780926180779","commenter_b":"Dude I get it let it go","commenter_a":"Yet how many innocent black men have been killed for no reason other than for being black?","post_message":"Over 15 police officers were injured – six seriously – and over 200 people were arrested as riots broke out in West Baltimore yesterday following the funeral of Freddie Gray. Maryland Governor Larry Hogan declared a state of emergency in the city and requested that Maryland activate its National Guard."},{"comment_id":"10152933844790667","commenter_b":"He probably figured he could demand equality for animals, since now people of same sex can get married. Next, it will be polygamy. Watch the Muslims in the US asking for equality.","commenter_a":"Yep could have gone all day w/o reading this. sick","post_message":"Crawford posted an ad on a popular website soliciting a willing horse owner, according to officials."},{"comment_id":"925455207491820","commenter_b":"Buzz off Kim and take Kanye with you. Both of you suck....","commenter_a":"Wasn't it Paris Hilton that didn't know what Wal-Mart was?","post_message":"Here's how Kim Kardashian responded when asked to react to Megyn Kelly calling her look \"enhanced.\""}]
