[{"comment_id":"1751204798479851","commenter_b":"thiswoman has onebrain cell and it dont work","commenter_a":"If Nancy had a brain her Face Lift wouldn't Sag So b","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states 'a moment of silence just left there is a moment of denial.' Do you agree?"},{"comment_id":"10154379049296028","commenter_b":"The tourist started it. There are reasons they had to close up. Their computers weren't working and they were forced to close maybe for an hour. Stupid tourist wanted to fight. She assaulted the employee first (yes, throwing water at someone is considered assault) causing the employee to be in defensive mode. Maybe that employee should be suspended for 2 days and hopefully she's not fired.","commenter_a":"What? You are not going to stack the coupons and price match??","post_message":"A woman's desire for a post-Christmas bargain took a violent turn. The confrontation caught on camera shows a store manager and a customer get into a scuffle in front of awaiting shoppers at a Florida mall. @webpagelink"},{"comment_id":"923406901068872","commenter_b":"would love to see ben carson and donald trump ban together","commenter_a":"Ben, that is exactly what obama has been doing for the last six years!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"10153824664946336","commenter_b":"Just like Starbucks, learn to cook woman","commenter_a":"So many people falling for this. Of course the government wants everyone against Chipotle, because it's the first popular public chain against GMO's, which makes the government food companies look bad. I'll still be eating at Chipotle; everything they serve is still way better for you than the majority of fast food restaurants.","post_message":"The Chipotle Mexican Grill stores can open after they replace all produce, do a deep cleaning of their stores, pass a local health inspection and start a new protocol for cleaning produce."},{"comment_id":"10154535471263812","commenter_b":"I'm a white female, and I sure as hell don't trust her","commenter_a":"'Voters of Donald Trump are sexist idiots that rather vote for a fellow idiot than a woman'","post_message":"Poll shows 18% of people who say they will vote for Donald J. Trump think the real estate mogul is not qualified to be president."},{"comment_id":"701393549998426","commenter_b":"Get them out of US STOP PC they do not deserve to speak in N TV , no Christian or Jewish leaders were invited to speak to reporters. Muslim Imam just said it in Press conference (is like we did it n so what) is just mass shooting Hello THIS IS TERRORIS AT ITS BEST ISIS STILE, wait our Muslim President blame gun control","commenter_a":"IF he really wants to stop shootings he should go to Iraq or Afghanistan .where shootings hangings, stoning, acid baths, beheadings, gas weapons, all take place on the regular. WE have been saying this is going to be a problem here. we already have too many whack a do 's to deal with, and letting people who have an intense hate for a certain segment of our society in to this country with NO understanding of our population and LAWS other than it picks up the tab, is a recipe for this very thing. But IS NOT a good enough reason to give up my gun rights. I will just cling to my weapon and bible thank you very much. gay people everywhere should understand this now, weather it's a gun or a bomb, you are on their hit list.","post_message":"Speechless."},{"comment_id":"10154996300568827","commenter_b":"And when they do they can get arrested for indecent exposer. And if they do it in front of one child they should ALL have to register as a sex offender.","commenter_a":"Why do we need to see his returns...? He was a private citizen...show me yours...","post_message":"Protesters plan to pull their pants down to protest Trump."}]
