[{"comment_id":"10153007861084753","commenter_b":"Get a job!!!!!!!!!!!!!!!!!!!!!!!lazy bitch","commenter_a":"that is so wrong on so many levels","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10154741052673812","commenter_b":"Angela, your an idiot","commenter_a":"I love the comments so far. These folks probably have no idea that we have the largest prison population in the world filled with non violent offenders.","post_message":"NEW: Pres. Barack Obama grants commutation of sentences to 111 individuals. He's now commuted sentences for 673 people - more than the past 10 presidents combined. abcn.ws/2bPG0zc"},{"comment_id":"998513920215363","commenter_b":"girl needs to sit down","commenter_a":"LOL @username","post_message":"Yeah, Um....No."},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"10153330910164497","commenter_b":"Hillary is a sex addict; shes always screwing herself.","commenter_a":"Idk if she'd be a good president though; last time she had a job, she outsourced it to Monica.","post_message":"This Week's Top Story:"},{"comment_id":"575985222606198","commenter_b":"Yes","commenter_a":"More money to waist.","post_message":"Do you support a lottery in Alabama?"},{"comment_id":"887899764578453","commenter_b":"Any woman dumb enough to marry a cop shouldn't be surprised when he starts beating on you. How do you think cops unwind after work? The single ones get a dog to kick around","commenter_a":"Smh! When will it end?","post_message":"With all these red flags, police still didn't step in and protect her. Is it because the abusive husband was a fellow cop, so they just let him do what he wanted to her? Wow!"}]
