[{"comment_id":"10154227931919087","commenter_b":"They can have the goof!","commenter_a":"Fake polls Hillary is up 5.6 pats in NH","post_message":"The most recent New Hampshire polls shows Donald J. Trump with a slim lead."},{"comment_id":"10150609954164999","commenter_b":"He got elected because he was the best man for the job and he keeps proving it over and over.","commenter_a":"Spread the \"word.\" The \"word\" is love.","post_message":"\"Societies don’t overnight completely erase everything that happened two to 300 years prior,” President Barack Obama said."},{"comment_id":"598436243672056","commenter_b":"Henry Kissinger told Hillary that she can delete the emails too.","commenter_a":"Sure Killary doing what she does best: lie and blame somebody else for what she has done wrong.","post_message":"Hillary Clinton told the FBI that Colin Powell twice recommended using a private email account, according to sources."},{"comment_id":"647855782048269","commenter_b":"@username, no, she's a \"feminist\" and \"peace activist\" from Argentina. All my friends would describe themselves as feminists (male and female). None of them support Trump. Funny that.","commenter_a":"The insult 'a basket of deplorables', is the best exhibit of Hillary Clinton discriminating personality. There is a big number of registered democrats (like myself) for Donald J. Trump. So all democrats and independents (forget the republicans) supporting Trump, are that? That is how cheat this woman is. If elected, she will do the same to any ethnic group rejecting her, and will blow up one country after another, starting with Russia. Deplorable, is Hillary Clinton for expressing herself that way about the 75% of US citizens. (Ivan Mintz/Eric Trump)","post_message":"Republicans slammed Hillary Clinton for saying that half of Donald J. Trump’s supporters fit into a “basket of deplorables.\""},{"comment_id":"10153871706276051","commenter_b":"Who wears Crocs anymore?","commenter_a":"Debbie Pruitt French","post_message":"Do you wear Crocs? If so, you're probably going to want to stop ASAP."},{"comment_id":"10153977158805329","commenter_b":"Tia Guilbert","commenter_a":"@username this is me","post_message":"jump in! (via BuzzFeed Animals)"},{"comment_id":"1452361001456073","commenter_b":"Fuck Trump he is a real dangerous piece of shit he must be taken down at any and all cost do whatever you can to make sure this ultra right wing low life piece of garbage does not become President. Trump do us all a favor die soon asshole.","commenter_a":"Nice pose for his new Facebook picture!!","post_message":"He got TORCHED on twitter."}]
