[{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"1298794080158825","commenter_b":"OK. Sacrifice your two daughters first....and we will all follow suit (he is a big asshole)","commenter_a":"Obama's a damn clown","post_message":"More evidence that this president believes in sacrificing military readiness on the altar of social engineering."},{"comment_id":"2026860724207699","commenter_b":"Dumb bitch","commenter_a":"leftist hypocrite","post_message":"Racist blacks cried foul when Republicans wouldn't support the policies of Barack Obama. But what are you if you don't support Trump? For Leftists, a hero."},{"comment_id":"10154575462084714","commenter_b":"No, a set is 3 games. They lost one game in a set, which is the only time they've lost in Rio.","commenter_a":"But did she win??!","post_message":""},{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"988561661229838","commenter_b":"F*^king disgusting!!!","commenter_a":"Disgrace as president.","post_message":"President Barack Obama and First Lady Michelle Obama paid less than two minutes of respect to the late Antonin Scalia while the Justice lies in repose at the Supreme Court."},{"comment_id":"10153476790357490","commenter_b":"Rachelle that the way it was in the day...just saying...thank you for being a stupid bitch!!","commenter_a":"Oh Lord...way back in my day they got an Admin or Medical discharge...if the Navy wanted you to have a baby they would have issued you one with your seabag...","post_message":"MATERNITY LEAVE BOOST, ICYMI – Female sailors to get up to 18 weeks in the year after their baby is born:"}]
