[{"comment_id":"10157018686460389","commenter_b":"And who is this new party going to be run by.. Romney?","commenter_a":"Ronald Reagan had similar numbers at this point in the process...the anti-Trumpites will fall by the waste-side....they are caught up in narrow-mindedness babble that has locked the GOP out of the White House for 8 years...it does not work WITH their current platform...we will re-write the \"Contract with America\" and the Republic's Platform (for our constitutional republic) and our new GOP party--the New American Conservative Party...AND TRULY MAKE AMERICA GREAT AGAIN. #TeamTrump #TeamUSA #BrightLightOnTheHill #AnythingisPossible #PositiveAttitude","post_message":"This is what an insurgency looks like."},{"comment_id":"10154448446471636","commenter_b":"If liberalism is bad, what, IYO, is good?","commenter_a":"The coup is being instigated by the political establishment and the media against the people who dared to vote in what they dictated was the wrong way. They are mobilising the generations brain washed by leftist infiltration of the education systems to do their will. This is going to get bloody","post_message":"'If you're still trying to convince yourself that a 21st century coup is not underway, please, please snap out of it'"},{"comment_id":"585287011661878","commenter_b":"We don't need Muslims here for s*** this is America... They need to stay the f*** home...","commenter_a":"Get out of my country.","post_message":"Furious Muslim students rush stage during American Sniper showing.  They have no respect. If they don't like American Sniper they can leave.  Do you agree these Muslims are out of line?"},{"comment_id":"10153615145678598","commenter_b":"this woman is sick and will be judged by God. I wouldn't want to be in her shoes when she stands before God!","commenter_a":"And you get an abortion! And you get an abortion! And you! And you!","post_message":"Hillary Clinton: “I Think We Should Do Everything We Can” to Promote Free Abortions"},{"comment_id":"10154324391116336","commenter_b":"This lady is nuts! His mom just died.","commenter_a":"Whoah not cool. The judge must have seen something he didn't like. :(","post_message":"Amber Heard was reportedly granted a temporary restraining order against Johnny Depp."},{"comment_id":"773517859455693","commenter_b":"They should both go to jail","commenter_a":"Bill can't keep his pecker in his dried up wife's vagina and her server was unprotected. She is a liar, corrupt corrupt blood money.","post_message":"His reaction was..."},{"comment_id":"1108523962492406","commenter_b":"Illegal aliens 62%!","commenter_a":"Most people on welfare are in a red state and are white. @webpagelink @webpagelink Undocumented immigrants pay taxes all the time. \"The 11.4 million undocumented immigrants currently living in the United States collectively paid $11.84 billion in state and local taxes in 2012. ITEP’s analysis finds their combined nationwide state and local tax contributions would increase by $845 million under full implementation of the administration’s 2012 and 2014 executive actions and by $2.2 billion under comprehensive immigration reform.\" @webpagelink","post_message":"Fighting off anti-immigrant myths with FACTS."}]
