[{"comment_id":"1372232146121032","commenter_b":"Chris Schiraldi really? Please tell me your source besides your opinion because that sure as hell isn't fact!!!!","commenter_a":"Yeah thanks for the lowest workforce participation rate in decades. Thanks for creating so many low wage/ low benefit jobs. Thanks for so many on food stamps because the economy sucks. And thanks yahoo for being yahoo... and that isn't much","post_message":"75 straight months of job gains. 15.8 million private sector jobs added since 2010.   Thanks, Barack Obama."},{"comment_id":"1396465177113199","commenter_b":"Stfu Hilary won POPULAR vote.","commenter_a":"Cry baby losers. You can't say he's not your president and it be true. If you live in the USA he is your president. Keep throwing tantrums and rioting, destroying property, setting cars on fire. You are just going to make more people vote for him next time.","post_message":"Fear not!  Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154428205019087","commenter_b":"'@username How is hiring illegal immigrants here in the USA 'putting 741915279236631s first'? @webpagelink","commenter_a":"As an @username and a veteran I do not understand how anyone, but especially a fellow veteran, could support a disgraceful chickenhawk like Donnie. @webpagelink","post_message":"Several leading veterans groups who skipped President Obama's inaugural parades will march down Pennsylvania Avenue to celebrate the inauguration of President Donald J. Trump."},{"comment_id":"10154465141311037","commenter_b":"Melania DUMP","commenter_a":"Think the media wants to sh!t all over this to distract the public on what's really going on...","post_message":"Did Donald J. Trump's campaign literally just RickRoll the nation?"},{"comment_id":"585591074975467","commenter_b":"He must be some form of illegal alien. Where do orange people come from?","commenter_a":"Prepare for 4 years of unrelenting mocking until you take this job seriously and treat people with respect","post_message":"Trump is such a crybaby..."},{"comment_id":"1322936927726334","commenter_b":"Shariko ... I did call you Racist .. That has no bearing as to whether or not you attended college","commenter_a":"They are trying so hard to find him connected to that murder while they have him on some B.S. Making themselves look foolish.","post_message":"Multiple law enforcement sources explained to NBC News why a knife found on land where O.J. Simpson once lived does not appear to be connected to the murders."},{"comment_id":"10154571318628797","commenter_b":"Build The Wall","commenter_a":"She could have easily just left..but she didn't so who's fault is that?","post_message":"DENTAL DEATH: April went to the dentist to have a procedure and she was understandably nervous about it. After it was over, April collapsed and died in the parking lot. Now her family wants to know why the dentist went through with the procedure despite warning signs."}]
