[{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"10154082657224497","commenter_b":"The Hillary machine has infected ClickHole too? Thanks a lot, Obama!","commenter_a":"Only 7?","post_message":"Via ClickHole:"},{"comment_id":"1065496103473179","commenter_b":"J.K. needs to mind her business.","commenter_a":"WOW! She shut it down! OMG! Trump is backing down because a writer...no wait! This article isn't about the writer...it's not about Trump. It's about Pierson. No wait, it's about a writer comparing to one of her make believe characters. Jesus, if your going to attack; pick an opening paragraph and stay on topic. If you can't do that...atleast get the headline to reflect the topic...","post_message":"Just 5 words  and they say it all."},{"comment_id":"1315269151829205","commenter_b":"Somebody need to give this Scum, a History lesson !","commenter_a":"This idiot is truly deranged.","post_message":"White nationalist Richard Spencer held a conference in support of Donald J. Trump and claimed that America belongs to white men.   1,000 protesters met him outside."},{"comment_id":"10154030310632061","commenter_b":"Hillary can send emails to Satan but Donald still won't get my vote!!","commenter_a":"She should be in jail!!! And she should have never been allowed to run for president! Now we have two people running and I can't stand neither","post_message":"The newly discovered emails that prompted the FBI to reopen the investigation into Hillary Clinton private server came from a separate federal investigation of former Congressman Anthony Weiner, multiple sources tell ABC News."},{"comment_id":"10154786679373984","commenter_b":"What a shame that this ladies after so many many years will fall for Hillary's BS and the press that are now panicking cause things are getting worse to them and the campaign. Keep wondering how much money is floating around to pay all this people that suddenly have brought this stories and this will continue until Election Day, desperation is the mother of FU. 'GO TRUMP '","commenter_a":"There is no one that is for Trump that is going to believe this. If it was true theses (ladies) would have spoken up sooner, so you see you people are not talking to morans as you think.","post_message":"Michele Bachmann has gone on national radio and revealed what happened to her when Donald J. Trump hosted her for breakfast -- alone -- in his penthouse.  Every American needs to hear her story. It says a LOT about Trump..."},{"comment_id":"10156338941645615","commenter_b":"Yup let's get busy creating more terrorists.","commenter_a":"Jesus. Blind, and deaf to his own words.","post_message":"Do you hear yourself talking, Rick?"}]
