[{"comment_id":"1778455155709145","commenter_b":"Didn't \"us\" apes breastfeed your people? Lol...Some people were too lazy to breastfeed their own damn babies. Got some of that ape milk in ya'll system still from slavery!! 😏","commenter_a":"Black guy deserved it stupid black idiot not being racist being honest the black guy should have kept his mouth shut why was he at the Donald trump convention if he did not like Donald trump black retard","post_message":"The 78-year-old white man accused of punching a black protester in the face at a Donald Trump rally in North Carolina made his first court appearance on Wednesday. If found guilty, how would you punish him?"},{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"10152866241386094","commenter_b":"So what planet will the money mongers move to when this planet will not support human life?","commenter_a":"...while not witnessing the irony of the capitalist market as the driver of climate change… says nothing of the oil gas, mining, food industry's culpability in this mass earth murder","post_message":"Planetary distress has become the new normal."},{"comment_id":"10154964534141337","commenter_b":"@username so then why is everyone so butthurt about other immigrants coming in? What's done is done, they got in, the end","commenter_a":"An awful lot of illegally immigrated Europeans happy to see him deported on this page. Maybe you Mofos would be better off learning your native tongue, I know us Natives would love to see your cave dwelling, disease spreading barbarians back to where you emigrated from.","post_message":"Documenting the heartbreaking and unbelievable deportation of South Korean man Adam Crapser"},{"comment_id":"1113788628681311","commenter_b":"I will be voting for a true American who has respect for our military n veterans who's goal is to make America strong again for we the American people n the future of our country n children bring jobs back. close our borders Build the WALL My Vote like many Americans who are sick of our do noting liberal government Will vote Trump Go TRUMP","commenter_a":"Indiana, go vote Trump over lyin' Ted and Kasich! Time to send Donald to the White House. We're tired of all talk and no action politicians! #TRUMPTRAIN","post_message":"Last week we had huge wins in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island. It has been an amazing week in Indiana. We have traveled all over the state visiting Indianapolis, Evansville, Fort Wayne, Terre Haute, South Bend and beyond. I was endorsed by many sports icons including the legendary coach Bobby Knight, long-time Purdue University Basketball Coach Gene Keady, former Notre Dame Coaches Digger Phelps and Lou Holtz, and actor and former NFL player Fred \"The Hammer\" Williamson. I also received support from many Republican leaders across the country, who believe we will unify the party and defeat Hillary Clinton in the fall. The latest polls indicate this to be true. According to the latest Rasmussen poll, I beat Hillary easily and with your support we can widen this margin and Make America Great Again! It is so important to me to win Indiana. Not only would it solidify ..."}]
