[{"comment_id":"10155410892145500","commenter_b":"Arthur, your mother should have swallowed you.","commenter_a":"Once again. ..guns being used against the family...even if its unintentional. ...there are way too many unnecessary guns out there. ...","post_message":"BREAKING TONIGHT: A 9-year-old boy has accidentally shot his 54-year-old grandfather in the woods in Dade City. Story: bit.ly/1GIYKqL"},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."},{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"10153278742792144","commenter_b":"Foolish woman do you really think you can reason with a wild animal? Enough already.","commenter_a":"Very irritating.....good for the bear. There was no reason to pepper spray when she could have gone inside.","post_message":"HAHA."},{"comment_id":"1392748740784870","commenter_b":"Uh, he mowed down 100's of people. Definition of terrorist. Congrats on breeding and raising a supreme loser of the highest magnitude. Obviously he got his stupidity from you, seeing as you don't know terrorism when it sprung from your loins.","commenter_a":"Why did ISIS wait long before declaring the attack !! because it was not an ISIS member !!","post_message":"Family of killer insist he's 'not a terrorist'"},{"comment_id":"10153173721809091","commenter_b":"👎 on your comment sammi","commenter_a":"How many 15 year old boys get to bang a pro cheerleader?","post_message":"Molly Shattuck collapsed to her knees inside the courtroom as the judge handed down her sentence for raping a 15-year-old boy:"}]
