[{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"},{"comment_id":"10154101869331323","commenter_b":"He's a cunt !!","commenter_a":"Look at that mugshot! THAT is the face of a man who has just been caught doing, pretty much anything imaginable...","post_message":"Chancellor George Osborne is facing calls to reveal whether he has ever benefited from offshore tax havens after the prime minister bowed to public pressure over the Panama Papers by releasing a summary of his tax returns."},{"comment_id":"1768080320145861","commenter_b":"She is a criminal to her core","commenter_a":"TRUMP will protect LBGT people from the moSLIMEs. Hitlery will always side with iSLIME because that is who keeps her rich. VOTE for TRUMP!","post_message":"On June 18, 1983, Sally Ride became the first American woman and first LGBT astronaut to go to space."},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."},{"comment_id":"10153668088332452","commenter_b":"Ain't that near McD's and the bus station we were chillin at? @username","commenter_a":"Why are Latinos protesting? I don't see blacks protesting when a Latino is killed by a cop? 😒","post_message":"UPDATE: Video shows the chaotic scene as protesters scramble for cover as snipers open fire during marches in downtown Dallas. @webpagelink Eleven officers were shot and five killed."},{"comment_id":"1231385010209866","commenter_b":"Hahahahaha en fisica te salve de tu proyecto :v","commenter_a":"@username pa que se te de mejor química xD","post_message":"This is how they should teach chemistry in school. Video by Marie Skłodowska-Curie Actions."},{"comment_id":"10150699616999999","commenter_b":"He knows well cause his father was a partner with the militar goverment that killed thousands of Argentinian citizens.","commenter_a":"If I were him I would use another story. Something to do with Argentina and it's people. Just saying.","post_message":"At 32, Mauricio Macri, the president-elect of Argentina, was kidnapped and placed in a coffin by rogue police officers, an awakening that put him on a path toward politics."}]
