[{"comment_id":"1039384902787653","commenter_b":"Wow! Just listen to some of the crazy sh*t that this woman is saying! Talk about freakin' scary! Someone needs to go get her, put her in a straight jacket and lock her up! She is dangerous to herself and others around her! Saying Obama is the antichrist?? Have no clue where this kind of idiot gets off saying the things she does but if I were the CIA, I would be kicking her door down and taking her to GITMO...where she clearly belongs.","commenter_a":"REALLY?? Look I'm half German and spend a lot of time there. Yes it's difficult times there and a clash of civilizations so to speak.but to package this as a massive multicountry deliberate planned invasion of extremists is ludicrous. What is true is that Western Europe in its liberalism has forgotten it's Christian faith and there is a faith vacuum. Alberi wieder des Infoax viel dies Michael Lenz","post_message":"This woman is BUCKETS full of crazy!"},{"comment_id":"1577321485900379","commenter_b":"Women yes! Hillary no!!!!","commenter_a":"No victory to any women! She does NOT represent me! she's a liar, fraud.. and doesn't even come close to respectable... What a shame for \"women\"","post_message":"Hillary Clinton: “We’ve reached a milestone: The first time in our nation’s history that a woman will be a major party’s nominee for President of the United States.”"},{"comment_id":"10153926157556337","commenter_b":"Ronda is the only person to go and ask patricks wife for permission to do the role and movie.","commenter_a":"Companies are trying to cash in on Patrick Swayze's death.. Since his Death they've remade Red Dawn Point Break And now they are remaking Dirty Dancing. I'm sure a Road House remake will be coming soon..","post_message":"SHOULD YOU SEE the Point Break remake?  Only if you like to have fun..."},{"comment_id":"968788776513933","commenter_b":"Put these bastards in prison","commenter_a":"Jackasses.","post_message":"These people are psychotic."},{"comment_id":"1141182859235076","commenter_b":"I only like woman","commenter_a":"Anyone on this thread that defends the confederate flag or the klan, please kill yourself and do not procreate.","post_message":"\"The Klan today is weak, poorly led, divided internally and without any political support\""},{"comment_id":"1220599301301398","commenter_b":"@username where is your weed now","commenter_a":"That will soon become illegal for sure","post_message":""},{"comment_id":"10154734900826509","commenter_b":"U know muslims r gangraping british girls in UK","commenter_a":"RIP europe, immigrants will destroy europe, it has started from turkey , so i request all people to visit europe before it gets turn into europistan , after there would be many restrictions of burqua etc. And be ready to see ETHNIC EUROPEAN MIGRANTS LEAVING EUROPE FOR ELESWHERE.","post_message":"Terror suspect Salah Abdeslam has been extradited from Belgium to France, Belgian authorities say. The Belgium-born French citizen faces prosecution there in relation to the Paris terror attacks in November."}]
