[{"comment_id":"10152664925256717","commenter_b":"A business that is open to the general public should not be allow to discriminate . If I knew she belonged to the southern baptist I would have never given her by business anyway. Too many businesses out there would have loved to cater to your wedding.","commenter_a":"She looks a bit of a lesbian herself. Maybe a frustrated one! But anyway.... take that mama!","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1700724426879591","commenter_b":"Fuk Oprah. She had her run and time. Its over now. Another billionare who knows whats best for others. Sit down and shut up Oprah.","commenter_a":"Is Oprah muzlim Is whoopie they sure fighting for them hard and they killing all American people plus Christian people","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10154460904419411","commenter_b":"Nonsense. Religious claptrap has been indulged enough. They will never be satisfied.","commenter_a":"It's not OK. A country which excel in development like Swiss, must receive new minorities than traditional aliens. Therefore if you never had Buddhists, you will receive them make sure you also received their way of ideology. This is an article of Human Rights 'Freedom of Religion'.","post_message":"girls, whose names were not disclosed, said their religion prevents them from participating in compulsory swimming lessons with males in the pool at the same time.'"},{"comment_id":"1478938502146617","commenter_b":"That redneck is probably terrifying his sister...err! Girlfriend!!!","commenter_a":"That woman looks like she's trying to hide her identity. I would too if I had to go to a Trump rally with that gormless chubby asshole. :(","post_message":"'One man's sexual assault,' one said, 'is another man's flirtation.'"},{"comment_id":"667515520077863","commenter_b":"I hope she killed herself!","commenter_a":"Terrible","post_message":"This Texas mother and vocal gun advocate snapped and took the life of her own two children over a simple family argument after spending years criticizing Democrats for 'wanting to take her guns away':  'A family spat started inside the married couple’s Houston-area home and spiraled into gun violence that spilled out onto their street.  “It was a family argument that turned into a shooting,” Fort Bend County Sheriff Troy Nehls told the Houston Chronicle. “But we’re still trying to put the pieces together.”   Read more HERE: @webpagelink  Thanks to Point Counter Point."},{"comment_id":"531107707082073","commenter_b":"What a bunch of trash. Next time get up and yell back and pin them against the wall. Come on white people stop taking this shit from these thugs!","commenter_a":"We need to start taking care of business.","post_message":"'...screaming racially motivated chants such as, “F*ck you, you filthy white f*cks!”, “F*ck you and your comfort!”, and “F*ck you, you racist sh*ts!” One girl was even reported to have been pinned by protesters against a wall, who allegedly shouted “filthy white b*tch” in her face.'"},{"comment_id":"10153503592741336","commenter_b":"LOVE HIM!","commenter_a":"I CAN NOT TRUST THIS GUY NO A biT I RATHER VOTE FOR NOBODY TO GIVE HIM MY VOTE, HE COULB BE WORST THAN OBAMA. WISHY WASHY GUY.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"}]
