[{"comment_id":"10156340374100354","commenter_b":"You my dear are a moron who is helping to destroy your people.","commenter_a":"Scumbag.","post_message":"'Safe negro'?!  Can you IMAGINE the FIRESTORM liberal media would have generated had a conservative said this?!"},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":"[This comment contained a link to an external webpage which is not shown here.]"},{"comment_id":"1031281086912749","commenter_b":"Oh. Duh. Maybe I could! Planning.","commenter_a":"Oh my. Could someone unfurl a banner with this at the next gathering of Congress?!?","post_message":"This is just great advice.  Image via our friends at ATTN:."},{"comment_id":"1178158985635102","commenter_b":"OH PLEAZZZZZZZZZZZZ.....LMFAO..THIS IS BECOMING COMICAL...IDIOTS EVERYWHERE!","commenter_a":"It's not an anti trump its a protest against the president from mexico","post_message":"LIVE NOW: An anti-Trump protest in Mexico City."},{"comment_id":"10157640587160615","commenter_b":"#NeverHillary #BustTheDuopoly! She cares nothing for the populance as a whole and her smug haughty stance of needing a public and a private stance politically make me sick. Tack on her criminal past, and right wing agenda, and you bet your ass no progressive should consider voting for that pandering shill. Im done voting for a lesser evil, and will stay vigilant in ensuring a third party gets political funding, and grassroots activism because our system and the Dempublicans are controlled by a criminal elite and they are the enemy of Liberty, Justice and Freedom! #JillStein2016 #GreenNewDeal","commenter_a":"Down","post_message":"This Just In –"},{"comment_id":"924923120897717","commenter_b":"That is what the Supreme Court is for! To keep the Executive branch from VIOLATING THE HOLY MONKEY SNOT out of the Constitution. This administration is shameless and arrogant to the EXTREME!","commenter_a":"Yes","post_message":"A Federal Court upheld a block on Obama's executive amnesty. Do you support their ruling? -- COMMENT with YES or NO"},{"comment_id":"10153528204119497","commenter_b":"Ha!","commenter_a":"I see the girl inviting us to like her page is already here.","post_message":"'I could make somebody happy, I am loving, and I deserve to be happy, too.'"}]
