[{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"10153554902129087","commenter_b":"Ha haaaa!!! I think it's funny you fools immediately claim racism when somebody wants to do something that doesn't suit you. Well get over it!!! ILLEGAL immigrants have no business being here! Come to this country LEGALLY or fuck off!!!!","commenter_a":"We paid Mexico for those borders and they let illegals in and tramp through their country to come here Yeah you will pay for it..","post_message":"\"I’m not going to pay for that f---ing wall,” former Mexican President Vicente Fox to Jorge Ramos during a fiery interview on Thursday. \"[Donald Trump] should pay for it. He’s got the money.\""},{"comment_id":"10155306004950725","commenter_b":"Those girls are animals.","commenter_a":"Throw her Ass in Jail with the real Women, not the Kiddos.","post_message":"A 16-year-old girl has been arrested after a vicious fight with a group of girls at McDonald's, police say. Watch a video of the brutal brawl here------> @webpagelink (WARNING: Violent nature could be disturbing to some viewers)"}]
