[{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"10153825929880399","commenter_b":"Domestic Terrorists","commenter_a":"Let's say Trump gets defeated; narrowly or by wide margins, makes no difference. Will his supporters begrudgingly acknowledge defeat in the public forum of a democratic vote? Will they accept hat their ideas and policies, such as they are, are not accepted by the majority of their fellow citizens? I don't believe they will. And what then? Will they turn to other methods to advance political ideas that cannot be achieved through conventional democratic means? And what will we call them then...?","post_message":"Josh Marshall \"You can say all sorts of things about these folks being crazy, or extremists or whatever else. But set aside all these evaluative or partisan interpretations and one thing is fairly clear in objective terms: a large portion of the GOP is not satisfied with what can realistically be achieved by conventional political means.\""},{"comment_id":"10154561841344203","commenter_b":"What a dumb bitch.","commenter_a":"😷","post_message":" worship for him is like the people of North Korea worship their Dear Leaderblind loyalty.\" Ann Coulter"},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"10153573697440090","commenter_b":"If our next leader or liar was on that stage we are in trouble","commenter_a":"In your dreams!","post_message":"Take. It. Back. @webpagelink"},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"}]
