[{"comment_id":"10153562142188717","commenter_b":"Yes! Please leave!","commenter_a":"good for her .. Tah Tah","post_message":"Raven-Symone, co-host of \"The View,\" swore on the talk show that she will move to Canada \"if any Republican gets nominated\" for president."},{"comment_id":"1501229893270468","commenter_b":"IDIOT!","commenter_a":"I want to hear her say it 2 minutes into the stoning. Damn liberals are stupid.","post_message":"Has she LOST her freaking mind!?"},{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"},{"comment_id":"1081267351952171","commenter_b":"@username WHO IS TRUMP RACIST TO....I WANT AN ANSWER....IF YOU ARE GOING TO SAY IT AND BELIEVE IT THEN YOU CAN TELL THE REST OF US","commenter_a":"Why would anyone vote for her after everything she's done has been exposed? She is not for the American people. Benghazi was enough for me to say #nohillary her plans to continue Obamacare, my vote is a NO, setting up a private server in her home where classified information on an unsecured server putting OUR safety at risk (then lying about it) that's a No. Claims she will fight for the children out of one side of her mouth and supporting late term abortion out of the other. #notwithher. The Clinton foundation taking donations from countries that abuse their woman and children, yet she believes in equality for women?? No way , never ever Hillary. Donald J. Trump for POTUS!!!","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."},{"comment_id":"10153792298068271","commenter_b":"The ignorance of those bottom feeding illegals is who are to go, or die. We are not talking of the folks here legally. Your ignorance is proven. No more handouts! !!!!! Work, or die. I approved this message. If you are illegal then get out now! !!!!! Or you might have to go the hard way. LOL. Lock N Load, Simper-FY! !!!! Burn the Mexican flag, you are either a American or your not. If you carry that fag, Ops, I meant Mexican flag, you should be returned to that filth country right away.","commenter_a":"According to the United States Census Bureau \" By the year 2050 (which is not that far off) one in every three Americans will be Hispanic \"legal and illegal, The Trump family will not be happy. Incidentally. Census bureau is a reliable and credible source. Celebrating Cinco de Mayo weekend :)","post_message":"\"His business was built on the backs of Latinos that helped him become successful and what he boils that down to is eating a taco salad.\""},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."}]
